{"organizations": ["Glenfield", "Abbey Windows", "Newby and Co", "Dewhirst Kitchens"], "uuid": "9c4e77e3146dd8e2a8de8ec074d1a0116825a64f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29537168/14939950.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/opinion-improving-not-moving/story-29537168-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published OPINION: Improving, not moving", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published OPINION: Improving, not moving", "spam_score": 0.0, "site_type": "news", "published": "2016-07-21T13:30:00.000+03:00", "replies_count": 0, "uuid": "9c4e77e3146dd8e2a8de8ec074d1a0116825a64f"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/opinion-improving-not-moving/story-29537168-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published OPINION: Improving, not moving", "locations": ["Leicester", "Brexit", "Europe", "UK"], "entities": {"persons": [{"name": "melanie edgell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "damian dewhirst", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "glenfield", "sentiment": "none"}, {"name": "abbey windows", "sentiment": "none"}, {"name": "newby and co", "sentiment": "none"}, {"name": "dewhirst kitchens", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Melanie Edgell", "Brexit", "Damian Dewhirst"], "text": "Comments (0) \nHome improvement firms are in demand post-Brexit, as homeowners opt to stay put and make the most of their current space, writes property correspondent Melanie Edgell. \nWith continued uncertainty in the market and a shortage of new property put up for sale during the past year, wait and see remains the prevailing mood, with homeowners deciding to add value to their current living space rather than move on.Home improvement marketplace Plentific.com has released latest homeowner research statistics on the back of Brexit, showing that 10 per cent of homeowners are now more likely to improve their home than sell it in the current market.Carried out by the leading insight agency Opinium, The Plentific research surveyed 1,063 homeowners across the UK to gauge their feelings following the decision to exit Europe. \nYounger homeowners, aged 18 to 34, were the least likely to move, with 25 per cent saying they would rather carry out home improvements, reflecting the feelings of the majority of young voters who wanted to remain in the EU.Conservatories, loft extensions, garage conversions and new kitchens are among key improvements known to add substantial value. ConservatoriesVince Lord, director of long-established Leicester firm Abbey Windows, confirmed a surge of inquiries into replacement windows and conservatory extensions, estimated to add 15 per cent on to the value of your home.\"We have received a huge number of inquiries so far this month, almost reaching the total we had throughout the whole of July 2015,\" he said.\"The inquiries are tending to come in for the bigger items and we currently have almost double the number of conservatory installations in our system.\"Damian Dewhirst, of Dewhirst Kitchens, reported buoyant sales, with customers preferring to add value to their current home instead of moving.He said: \"Sales are definitely up and customers are saying they would rather spend the money on installing a good-quality kitchen than pay the stamp duty on a £500,000-plus home.\"Market experts have predicted a short-term fall in property values with the overall impact on the market still to be determined by the outcome of negotiations on the UK's exit.The RICS UK Residential Market Survey for June indicated current uncertainty had resulted in a marked drop in housing market activity, with buyer inquiries falling for the third consecutive month.Best advice continues to be to sit tight and see, since property investment should always be looked at as a long-term investment.Kevin Newby, of Glenfield- agency Newby and Co, confirmed a drop in inquiries due to the uncertainty generated by Brexit.\"Despite the current state of play, I see this as very short term situation,'' he said.\"There has been a long period of shortage of supply and low interest rates, which has caused prices to go up and some properties to be over-valued, which may now see a slight correction.\"But I personally expect the market to pick up again within the next few months.", "external_links": [], "published": "2016-07-21T13:30:00.000+03:00", "crawled": "2016-07-21T15:36:05.090+03:00", "highlightTitle": ""}