{"organizations": ["Newcastle", "Labour Members of Parliament", "Nato", "Vanguard", "Newcastle Central", "Royal Navy", "Republican party", "Newcastle Central’s Labour"], "uuid": "794d480b4e9c64065269b7726c1e1b5936d93d3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11654357.ece/ALTERNATES/s1200/JS95117170-1.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-mp-reveals-threat-terrorist-11663349", "country": "GB", "domain_rank": 21960, "title": "Newcastle MP reveals 'threat of terrorist massacres led me to back Trident renewal'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle MP reveals 'threat of terrorist massacres led me to back Trident renewal'", "spam_score": 0.0, "site_type": "news", "published": "2016-07-26T15:30:00.000+03:00", "replies_count": 0, "uuid": "794d480b4e9c64065269b7726c1e1b5936d93d3b"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-mp-reveals-threat-terrorist-11663349", "ord_in_thread": 0, "title": "Newcastle MP reveals 'threat of terrorist massacres led me to back Trident renewal'", "locations": ["Britain", "Turkey", "Brexit", "Europe", "UK", "Russia"], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ms onwurah", "sentiment": "none"}, {"name": "onwurah", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "labour members of parliament", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "vanguard", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "newcastle central’s labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Jeremy Corbyn", "Chi Onwurah", "Theresa May", "Ms Onwurah", "Onwurah"], "text": "Newcastle MP reveals 'threat of terrorist massacres led me to back Trident renewal' 13:30, 26 Jul 2016 Newcastle Central MP Chi Onwurah explained that she did not 'want to legitimise a dialogue of death' but felt she had to Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nA Newcastle MP has told how the threat of “terrorist massacres” led her to back the renewal of Trident. \nMPs voted to renew the Trident nuclear weapons system, including the replacement of the existing submarine fleet carrying the missiles with four new Successor submarines, by 471 to 116 - a majority of 355. \nNewcastle Central’s Labour MP Chi Onwurah said that she took the decision with a heavy heart, citing national and international political uncertainties as a major factor. \nRenewal of the submarines for the continuous-at-sea deterrent is predicted to cost £31bn, with a £10bn contingency fund also set aside. \nMs Onwurah said: “Would Britain declaring that it was not going to renew Trident make the world, and the UK, safer? Would it tend to stabilise or destabilise? I spent hours debating that. PA/PA Wire The Royal Navy's submarine Vanguard which carries trident missiles \n“I considered Britain on the road to Brexit with a new Prime Minister with no plan and an absent Labour leader, Europe between fear of migration and disintegration, Russia at bay, the Turkey coup, Israeli-Iranian relations, the Republican party’s candidate for President and the reality that terrorist massacres are a regular feature all over the world. \n“I thought about my constituents, would declaring that Labour was against Trident make them feel safer and more secure? \n“My conclusion was that it would not make the world more stable and it would not make my constituents feel more secure.” \nMs Onwurah also said that she was satisfied around points of cost and the effectiveness of the Trident deterrent. Chi Onwurah \nShe picked out the subject of morality as one of her most difficult considerations, saying: “I am not a conscientious objector but I have a great deal of respect for those who are, and I do believe the use of nuclear weapons is immoral. \n“But if you accept the concept of armed defence and believe in taking armed action to protect UK or global citizens, then the unilateral disarmament argument seems to resolve into one hiding behind the American deterrent two that it will make the world safer, or three that it doesn’t matter whether we end up in thermonuclear destruction as long as our hands are clean. \n“The first and the third I do not accept.” Read More \nLabour leader Jeremy Corbyn gave his party a free vote although he was among just 47 Labour MPs who objected to the Government’s motion. \nSpeaking in the Commons, prime minister Theresa May said she “enthusiastically” welcomed the result. \nShe added: “I think that vote showed the commitment of this house. It showed that we have not only committed to our own national security but also considered the security of our European and Nato allies. \n“We can now get on with the essential job of renewing our nuclear deterrent. \n“And can I thank those 140 Labour Members of Parliament who put the national interest first and voted to renew the nuclear deterrent.”", "external_links": [], "published": "2016-07-26T15:30:00.000+03:00", "crawled": "2016-07-26T16:35:05.690+03:00", "highlightTitle": ""}