{"organizations": ["Office for National Statistics", "EEF", "EU", "PMI", "Annual EEF", "BDO LLP"], "uuid": "c82d4c8e870d43c77774d877989e93e9773b3f6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11677328.ece/ALTERNATES/s1200/JS79807042.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturing-sector-grows-11677169", "country": "GB", "domain_rank": 21960, "title": "North East manufacturing sector grows in last year, but confidence is hit by Brexit vote", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East manufacturing sector grows in last year, but confidence is hit by Brexit vote", "spam_score": 0.0, "site_type": "news", "published": "2016-07-29T02:01:00.000+03:00", "replies_count": 0, "uuid": "c82d4c8e870d43c77774d877989e93e9773b3f6e"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturing-sector-grows-11677169", "ord_in_thread": 0, "title": "North East manufacturing sector grows in last year, but confidence is hit by Brexit vote", "locations": ["North East", "Brexit", "UK"], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "rui", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "jason whitworth", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "bdo", "sentiment": "none"}, {"name": "liz mayes  liz mayes", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pmi", "sentiment": "none"}, {"name": "annual eef", "sentiment": "none"}, {"name": "bdo llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Brexit", "Rui", "Graeme Whitfield", "Jason Whitworth", "Theresa May", "BDO", "Liz Mayes  Liz Mayes"], "text": "North East manufacturing sector grows in last year, but confidence is hit by Brexit vote 00:01, 29 Jul 2016 By Graeme Whitfield The Annual EEF survey finds that the North East has a bigger manufacturing survey than other regions Shares Get business news by email Rui Vieira/PA Wire A setter operator at work at a manufacturing company \nThe region’s manufacturing sector has been boosted by more than 100 new firms over the last year, but is now facing challenges as a result of the Brexit vote, a new report says. \nThe annual Regional Manufacturing Outlook from manufacturers’ organisation EEF and accountants BDO says that the North East now has 4,100 manufacturing firms, a 3.3% increase from last year. \nThe sector accounts for 117,000 jobs - 9.8% of the regional workforce - and 15.5% of the region’s output, with the North East well above the national average for its reliance on manufacturing. \nConfidence levels among manufacturing firms have dropped following last month’s EU referendum , the survey says, but other regions have suffered larger falls, allowing the North East to climb the confidence rankings from bottom last year to third now. \nManufacturers in the North East are the most exposed to European demand, though the short-term drop in sterling has boosted exports. \nThe EEF/BDO survey found that, while only a small minority of local manufacturers reported an immediate impact on demand from the referendum, they are amongst the most pessimistic of all UK regions about the outlook for domestic and foreign orders over the next six months. \nNorth East manufacturers are among the most likely to be reviewing UK recruitment plans (24%) and domestic investment (29%). Liz Mayes \nLiz Mayes, North East region director at EEF, said: “Despite some challenging times, manufacturing in our region remains a force to be reckoned with. This last year shows difficult conditions in the region starting to dissipate. But the referendum outcome provided a jolt and it’s clear that we’re now on a new path with fresh challenges ahead. \n“Exchange rate volatility, political uncertainty and the danger of increased costs are already causing concern in the region and business confidence is in short supply. But our sector is nothing if not dynamic, determined and resilient. With a solid business environment, supportive policies and the right outcome from Brexit negotiations, manufacturers in this region should be able to overcome the risks, reap future growth rewards and get their business confidence back on track.” \nEarlier this week, the Office for National Statistics said gross domestic product grew by 0.6% in its initial estimate for the second quarter, driven largely by an unexpected upturn in industrial production. \nThere are growing concerns that dark clouds are gathering over the UK economy, however, with Friday’s flash PMI survey showing economic growth had slumped at its fastest rate since the financial crisis. \nSome commentators believe that positive news from the first half of 2016 represents “one last hurrah for the economy” before it is hit by a bout of turbulence. \nJason Whitworth, head of manufacturing at BDO LLP in the North East, said: “The lack of a clear strategy for the manufacturing sector over recent years has been of huge concern and it is encouraging to see Theresa May’s promise of a proper industrial strategy. \n“We would like to see the Government match manufacturers’ long-term outlook by developing a 15-20 year industrial policy that avoids the disruptions of the political cycle.”", "external_links": [], "published": "2016-07-29T02:01:00.000+03:00", "crawled": "2016-07-29T02:30:30.139+03:00", "highlightTitle": ""}