{"organizations": ["Sedgefield", "Parliament", "EU", "Newcastle", "Sky News"], "uuid": "73408c9764934de2b833c5b1c4df3dc6a8580df9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11559636.ece/ALTERNATES/s1200/JS93738911.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tony-blair-says-britain-must-11559610", "country": "GB", "domain_rank": 21960, "title": "Tony Blair says Britain must 'keep options open' on Brexit, but is tight-lipped on Chilcot report", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Tony Blair says Britain must 'keep options open' on Brexit, but is tight-lipped on Chilcot report", "spam_score": 0.0, "site_type": "news", "published": "2016-07-03T13:31:00.000+03:00", "replies_count": 0, "uuid": "73408c9764934de2b833c5b1c4df3dc6a8580df9"}, "author": "Michael Marsh", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tony-blair-says-britain-must-11559610", "ord_in_thread": 0, "title": "Tony Blair says Britain must 'keep options open' on Brexit, but is tight-lipped on Chilcot report", "locations": ["Britain", "Brexit", "North East", "European Union", "EU", "Europe", "Leaf Island", "Basra"], "entities": {"persons": [{"name": "tony blair", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "murnaghan", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}, {"name": "jeff j mitchell/pa", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "leaf island", "sentiment": "none"}, {"name": "basra", "sentiment": "none"}], "organizations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Tony Blair", "Blair", "Murnaghan", "Lewis", "Jeff J Mitchell/PA", "Andrea Leadsom", "Brexit"], "text": "The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nTony Blair says Britain must “keep its options open” following the EU referendum . \nThe former Prime Minister and Sedgefield MP was a supporter of the Remain campaign, which was defeated on June 23. \n“One of the reasons we must keep our options open is - yes, the referendum expressed the will of the people - but the will of the people is entitled to change,” he told Sky News’ Murnaghan programme on Sunday. \nAsked if he meant there needed to be a second referendum or that Parliament could override the vote, Mr Blair said: “I don’t think you can override the settled will of the people but my point is very simple: it’s 52 to 48, supposing weeks or months down the line as it becomes what we’re moving to ... if it’s clear that these terms are bad... if people start to worry about their jobs, we should keep our options open.” \nHe added: “The vote was to leave the European Union... but we have no idea what lies on the other side of that and there’s a hugely complex negotiation that’s now got to take place. \n“We need to see exactly what is the offer - what does Brexit look like?” \nThe North East voted to quit Europe by 58% to 42%, with Newcastle the only Remain part of the region. \nThe effects of a Brexit are still unclear, but that didn’t stop Mr Blair criticising some of the Leave side’s claims during the campaign. \n“Let’s be very blunt about it - some of the claims made for the Brexit case have somewhat collapsed,” he said. Jeff J Mitchell/PA Wire Tony Blair \nHe also rebuked Tory leadership contender and Brexit campaigner Andrea Leadsom after it emerged she was previously against leaving the EU. \n“You find Conservative people who were campaigning for Brexit saying a few years ago it would be a disaster for Britain to leave the EU, so you’ve got a very strange atmosphere around all this,” he said. Read More Chilcot Inquiry: When is the report published and what is it likely to tell us? \nMr Blair suggested it was best to hold off on invoking Article 50, which would formally begin the process of Britain’s separation from the EU. \n“There will be a limit to how long we can do that - but absolutely I think we should keep all our options open,” he said. \nAsked how long Britain should wait before triggering Article 50, he said: “Frankly my view is for as long as it takes before we can get an idea of what the other side looks like.” \n“Personally right now I’d have someone very senior - I’d even say the Prime Minister or the Chancellor - visiting every capital in Europe, seeing what the room for manoeuvre is, seeing what they might really want, understanding their politics,” he said. \n“The most important thing right at this moment is to make sure that we shape the psychology and the thinking of the other 27 countries in Europe,” he added. Lewis Whyld/PA Wire British soldiers being extracted by a Merlin helicopter on Leaf Island, Basra province \nMr Blair will face questions on Wednesday over his involvement in the Iraq War, when the Chilcot report is released. \nWhen asked about the upcoming release of the report and calls for him to go to jail over his role in the conflict, he said: “I think it’s best we wait for Wednesday, then I can respond properly.” More on the EU Referendum", "external_links": [], "published": "2016-07-03T13:31:00.000+03:00", "crawled": "2016-07-03T14:16:48.296+03:00", "highlightTitle": ""}