{"organizations": ["EU Commission", "EU", "BGF"], "uuid": "4403eb642f8527bdaf4c6a56eac1d917c6638c51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11575983.ece/ALTERNATES/s1200/JS90727106.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-opinion/business-cant-afford-stand-still-11576022", "country": "GB", "domain_rank": 21960, "title": "Business can't afford to stand still after Brexit - it's time for imagination", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business can't afford to stand still after Brexit - it's time for imagination", "spam_score": 0.0, "site_type": "news", "published": "2016-07-06T15:29:00.000+03:00", "replies_count": 0, "uuid": "4403eb642f8527bdaf4c6a56eac1d917c6638c51"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/business/business-opinion/business-cant-afford-stand-still-11576022", "ord_in_thread": 0, "title": "Business can't afford to stand still after Brexit - it's time for imagination", "locations": ["EU", "Britain", "North East", "Europe", "UK"], "entities": {"persons": [{"name": "barry jackson", "sentiment": "none"}, {"name": "stefan", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu commission", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bgf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Barry Jackson", "Stefan"], "text": "Barry Jackson from the Business Growth Fund on the positives that might arise from the EU referendum vote Shares Get business news by email Stefan Rousseau/PA Wire EU and UK flags fly above the EU Commission offices in Westminster \nLast month, I wrote in this column that politicians were minded to push for stability, and tend to avoid rocking the boat where they can. I also said that ideas are at the heart of business, and that we should reward adventurousness, and not conformity. \nGiven the events of the last two weeks, I’m not sure I’d argue my first point as vehemently. My second point, on the other hand, is even more relevant and pressing. In business, imagination followed by robust execution of new ideas has just become paramount. \nAs of June 24, the UK is in new territory. There are many questions – and very few answers because there is no precedent. \nI cannot speak to how the wider investment community will react over the next few days and weeks, but I can talk about BGF’s hopes and plans. My intention for these columns was to focus on business issues affecting the North East. \nThe result of the Referendum means that on this occasion, I am going to echo the words of my colleagues across the UK and explain BGF’s position. \nOur hope is that we do not see knee jerk reactions or a flight of capital out of the UK. Capital enhances entrepreneurship and productivity growth, the elixir of prosperity. But each investment firm will have their own strategy and their own reasons behind that strategy. \nBGF has no plans to put the brakes on now. This year, we celebrated five years of growth – £850m invested across 125 British businesses, seven of which are headquartered in the North East. During that time, we have become the most active investor of growth capital in British small and mid-sized companies – we have no plans to pause, or to slow down. \nWith that in mind, there are three things that we want ambitious businesses in the region to know. \nFirstly, BGF is a long-term investor and now more than ever we are aware of the need to demonstrate this. \nWe will keep thinking about what the businesses we back can do over five to 10 years, not five to 10 minutes. \nSecondly, we retain our deep-rooted belief that the UK is still the most entrepreneurial country in Europe. The fundamentals that make this country so attractive for growing businesses have not suddenly disappeared. \nBGF will keep looking for Britain’s most ambitious and promising businesses – and there is no better demonstration of this than the fact that BGF has announced three investments since the Referendum vote. \nFinally, we know that the critical issues of access to capital, talent and markets are as pressing as ever especially for smaller growing companies. Given current and coming turmoil in British politics, businesses need to step up to the challenges and opportunities of a post-Brexit Britain. And that includes BGF. \nWe can’t wait for politicians to provide the answers, but we must ensure that the priorities of business are high on the agenda of the next Government, and that Britain remains a pro-enterprise country with the policies to support that. So what we need now is ideas. \nOut of risk and uncertainty, positives and opportunities can arise. Crises and challenges can lead to the emergence of new ideas, and necessity remains the mother of invention. \nSome of the greatest companies are those that invested and challenged themselves in the most challenging times. \nSo let’s start formulating. Because the last thing business needs now is to stand still for too long.", "external_links": [], "published": "2016-07-06T15:29:00.000+03:00", "crawled": "2016-07-06T15:43:01.945+03:00", "highlightTitle": ""}