{"organizations": ["Carr's Group", "Kromek", "Nuclear Detection", "Intellectual Property League Table", "Durham University", "Nuclear Detection and Medical Imaging", "DARPA", "US Department of Defense", "Carr’s Group", "County Durham", "Group"], "uuid": "161eadb5a4f595ed7f4e4871498fb51583055793", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10927533.ece/ALTERNATES/s1200/JS44014115.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-kromek-sales-11632655", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Kromek sales top £8.3m, Carr's Group react to Brexit & latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Kromek sales top £8.3m, Carr's Group react to Brexit & latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-07-19T09:55:00.000+03:00", "replies_count": 0, "uuid": "161eadb5a4f595ed7f4e4871498fb51583055793"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-kromek-sales-11632655", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Kromek sales top £8.3m, Carr's Group react to Brexit & latest news", "locations": ["Kromek", "California", "Huddersfield", "US", "UK", "Asia", "Pennsylvania", "Germany"], "entities": {"persons": [{"name": "kromek", "sentiment": "none"}, {"name": "coreena ford top", "sentiment": "none"}, {"name": "arnab basu", "sentiment": "none"}, {"name": "coreena ford kromek", "sentiment": "none"}], "locations": [{"name": "kromek", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "huddersfield", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "carr's group", "sentiment": "none"}, {"name": "kromek", "sentiment": "none"}, {"name": "nuclear detection", "sentiment": "none"}, {"name": "intellectual property league table", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "nuclear detection and medical imaging", "sentiment": "none"}, {"name": "darpa", "sentiment": "none"}, {"name": "us department of defense", "sentiment": "none"}, {"name": "carr’s group", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Kromek", "Coreena Ford Top", "Arnab Basu", "Coreena Ford Kromek"], "text": "FTSE & pound opening \nThe FTSE-100 index opened at 6695.42. \nThe pound at 8am was 1.3214 dollars compared to 1.3278 dollars at the previous close. The euro at 8am was 0.8377 pounds compared to 0.8336 pounds at the previous close. 8.07 Coreena Ford Kromek's highlights \nThe year was characterised by the award of two of the largest contracts in the Group’s history in its key growth markets. \nFirstly, in Nuclear Detection, Kromek was selected as the sole source supplier by the US Department of Defense agency, DARPA, to supply its D3S radiation detectors as part of the SIGMA programme in an agreement worth $6m. \nSecondly, in the Medical Imaging sector, Kromek secured a five-year contract totalling $12.6m with a long-standing customer. \nThe firm said: \nThese two landmark agreements, supplemented by multiple new contracts won through the year with new and current customers, demonstrate a step change in the group’s commercial activities, strength of order book and revenue visibility. \nAll in all a strong year for the firm, which also topped the 2016 Intellectual Property League Table, which lists the top 100 UK firms according to the number of patents they possess. \nThe County Durham company has over 247 patents covering medical, nuclear, and security industries. The league table listing for Kromek, which also also has offices in Huddersfield, Germany, California and Pennsylvania, came after the business was commended for its outstanding performance by the US defence agency for its work on the SIGMA programme. 8.02 Coreena Ford Kromek's CEO Dr Arnab Basu on the firm's year \nDr Arnab Basu said \nWe are pleased with the results for this year where we saw product sales accounting for more than half of total revenues for the first time in the history of the Group. \nThe year was also significant because we were awarded over $30m of contracts during the period - the largest value of contracts ever won in a year - and we strengthened our relationships with our current customers. \nWe have entered the new fiscal year with increased momentum as we deliver on the contracts won in previous years. 3,500 units of the D3S radiation detectors have already been shipped to DARPA with the remainder of the contract to be delivered before the end of the year. Good progress has been made in the delivery of our CZT-based SPECT product to an OEM in Asia, which positions the Group well to capitalise on the significant commercial opportunity in the near term. \nOverall, the Group’s products continue to gain traction across the globe as Kromek deepens its relationships with long-term customers and expands its reach. With a strengthened order book in place and improved revenue visibility, the Board looks to the future with confidence. 8.00am Coreena Ford Top story - Kromek report on strong year, securing contracts worth $30m \nMorning all and welcome to the Tuesday blog. \nWe’ve got two stock announcements to bring this morning - one from Carr’s Group, which is involved in food, engineering and agriculture, and the other from the Durham University spin-off Kromek, \nThe radiation detection specialists have reported final results for the year ended April 30 2016, with revenues rising from £8.1m to £8.3m. \nIts adjusted EBITDA was a £2.4m loss which has widened since last year’s £1.6m loss but this comes after further investment of £3.2m of research costs - £500,000 more than last year - forked out in preparation for the expected demand regarding two of its products. \nAnd its Kromek’s products which are really driving the business forward. \nProduct sales accounted for 65% of total revenues, up from 46%, a growth year-on-year of 41%. \nOverall, the directors said they made good progress during the period securing over $30m of new orders and delivered revenue in line with expectations. \nThe Group continued to maintain its strong market position as a key supplier of CZT detection systems both to commercial and government customers globally. \nPlus, it won significant contracts from multiple original equipment manufacturers across its different key target markets, in particular in the largest growth opportunities of Nuclear Detection and Medical Imaging. Arnab Basu, chief executive of Kromek", "external_links": [], "published": "2016-07-19T09:55:00.000+03:00", "crawled": "2016-07-19T10:15:23.187+03:00", "highlightTitle": ""}