{"organizations": ["European Union", "Office for National Statistics", "Bank", "ONS", "EU", "Newcastle Airport"], "uuid": "4479bf2cd3fcae698e712a8389b2750bd805cbf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9723022.ece/ALTERNATES/s1200/Petrol.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/fuel-air-fares-spark-unexpected-11633424", "country": "GB", "domain_rank": 21960, "title": "Fuel and air fares spark unexpected leap in inflation, new figures show", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Fuel and air fares spark unexpected leap in inflation, new figures show", "spam_score": 0.0, "site_type": "news", "published": "2016-07-19T12:46:00.000+03:00", "replies_count": 0, "uuid": "4479bf2cd3fcae698e712a8389b2750bd805cbf6"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/fuel-air-fares-spark-unexpected-11633424", "ord_in_thread": 0, "title": "Fuel and air fares spark unexpected leap in inflation, new figures show", "locations": ["Britain", "England", "UK", "Europe"], "entities": {"persons": [{"name": "phil gooding", "sentiment": "none"}, {"name": "julien", "sentiment": "none"}, {"name": "martin weale", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "owen", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Phil Gooding", "Julien", "Martin Weale", "Mark Carney", "Owen"], "text": "Fuel and air fares spark unexpected leap in inflation, new figures show 10:46, 19 Jul 2016 11:40, 19 Jul 2016 By Agency Staff Inflation rose to 0.5% last month - a 15-month high that was more of an increase than economists expected Shares Comments Get business news by email \nInflation rose to a higher-than-expected 0.5% last month after fuel prices increased and the Euro 2016 football tournament helped drive up the cost of air fares, new figures show. \nThe Office for National Statistics (ONS) said Consumer Price Index (CPI) inflation in June was up from 0.3% in May and matched the 15-month high recorded in March. \nCPI also came in higher than economists’ expectations of a rise to 0.4%. \nLast month’s hike in the cost of living came in part from soaring flight prices, which climbed by a record 10.9% between May and June, pushed higher by more expensive air fares to Europe. \nBut the ONS said it was too early to see the impact on inflation of the plunge in the value of the pound triggered by Britain’s decision to leave the European Union. \nONS statistician Phil Gooding said: “The rising cost of European flights, possibly boosted by the Euro football championships, was the biggest reason for this month’s increase in inflation. Owen Humphreys/PA Wire A plane leaving Newcastle Airport \n“The growing cost of oil, feeding through to petrol prices, also helped nudge up CPI. \n“Today’s figures were collected before the EU referendum, so recent falls in the value of the pound will have had no impact on them.” \nOverall transport prices rose by 1.1% between May and June this year, compared with an increase of 0.2% over the period in 2015, due to a hike in the cost of European flights. \nA rise in the price of filling up at the pump also had an upward impact on CPI, picking up more than it did a year ago, with the cost of petrol and diesel climbing by 2.3p and 2.6p per litre respectively between May and June this year. \nThe price of petrol was 111p per litre in June, while the price of diesel reached 112.1p per litre last month. \nThe cost of recreation and culture was also up by 0.6% this year, compared with a 0.1% fall a year ago, driven in part by the rising cost of computer games. \nBut these price increases were offset by a slide in the cost of furniture, household equipment and maintenance, with overall prices dipping 0.3% between May and June this year. \nThe impact came from falling price tags for furniture, furnishings and kitchen units. \nThe ONS said the Retail Prices Index (RPI) - a separate measure of inflation, which includes housing costs - rose to 1.6% in June, up from 1.4% in May. Julien Behal/PA Wire A person shopping in a supermarket \nThe CPI figures come amid a bleak outlook for the UK economy, with many economists slashing their growth forecasts and some pencilling in a potential recession following the Brexit vote. \nThe Bank of England held back from cutting interest rates from 0.5% this month, where they have remained since March 2009, but signalled a rate cut could come in August. \nInvestors and economists were taken by surprise, having expected the Bank to cut rates to 0.25% after governor Mark Carney said in June that action would be taken over the summer. \nSince then, Bank policymaker Martin Weale has questioned whether interest rates should even be slashed in August. \nHe said on Monday that the Bank was “not a nurse to markets” and there were no signs that consumers or businesses were “panic-struck” following Britain’s decision to leave the European Union.", "external_links": [], "published": "2016-07-19T12:46:00.000+03:00", "crawled": "2016-07-19T17:44:36.701+03:00", "highlightTitle": ""}