{"organizations": [], "uuid": "3c0da9975fd20f6bcc75766de56717af2daf151f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11570487.ece/ALTERNATES/s1200/JS48512357.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/housebuilders-persimmon-mj-gleeson-say-11570415", "country": "GB", "domain_rank": 21960, "title": "Housebuilders Persimmon and MJ Gleeson say it is 'business as usual' post Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Housebuilders Persimmon and MJ Gleeson say it is 'business as usual' post Brexit", "spam_score": 0.0, "site_type": "news", "published": "2016-07-05T16:45:00.000+03:00", "replies_count": 0, "uuid": "3c0da9975fd20f6bcc75766de56717af2daf151f"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/housebuilders-persimmon-mj-gleeson-say-11570415", "ord_in_thread": 0, "title": "Housebuilders Persimmon and MJ Gleeson say it is 'business as usual' post Brexit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Housebuilders Persimmon and MJ Gleeson say it is 'business as usual' post Brexit 14:45, 5 Jul 2016 Both Persimmon and MJ Gleeson have published robust trading updates with strong increases in house sales Shares Get business news by email Persimmon Homes development at Angel Way, Birtley \nHousebuilder Persimmon has moved to assuage fears over a Brexit hit as it posted robust home sales and assured there would still be “good opportunities” in the UK property market. \nThe builder said that while it was “too soon to judge” the impact of last month’s vote to leave the European Union , it believes the “market fundamentals remain strong”. \nThe company - the UK’s biggest housebuilder by volume - said it sold 6% more homes in the first six months of 2016, at 7,238, with the average price up 6% at around £205,500. \nIn an update before full half-year results next month, the group, which has offices in Newcastle, Durham and Stockton, said it took “good levels of sales” throughout May and June, with private sales around 1% higher year on year despite the uncertainty ahead of the EU referendum and tough comparatives from a year earlier. \nIts comments come after shares in UK-listed housebuilders took a hammering following the Brexit vote amid fears it would spark a downturn in the housing market, with 38% wiped off Persimmon’s stock market value in a savage two-day rout. \nPersimmon’s assurances follow figures on Monday that fuelled fresh fears for housebuilders after revealing the construction sector experienced its worst month for seven years during the run-up to the EU referendum. \nThe closely watched Markit/CIPS construction purchasing managers’ index signalled a shock contraction in the sector, driven by a “steep decline” in housebuilding and the first fall in commercial construction work since May 2013. \nIn its latest update, Persimmon said: “We believe that market fundamentals remain strong, supported by long-term unfulfilled demand, and that the UK housing market will continue to provide good opportunities for those companies with the right strategic focus and the balance sheet strength to navigate future changes in trading conditions.” \nPersimmon also assured over its financial strength and insisted a 10-year strategy put in place in 2012 was designed to help the group withstand knocks to the housing market. \nIt said site visitor numbers in the six months to the end of June were 8% stronger than a year earlier and the group said despite the later release of 35 sites for sale, its total forward sales held firm at £1.36bn and group revenues overall were 12% higher at £1.49bn. \nMeanwhile, MJ Gleeson plc, the urban regeneration and strategic land specialist, also posted a robust trading update following the end of its financial year on June 30. \nHousing regeneration specialist Gleeson Home – which runs offices covering the North East and Teesside from Durham and Wynyard Park respectively – sold 904 homes during the year, an increase of 20.4% compared with the previous year’s total of 751. \nIts Gleeson Strategic Land division also successfully disposed of seven land interests comprising of 91 acres and its strategic portfolio now comprises 68 sites, totaling 3,843 gross acres, which could deliver 21,051 plots plus a 60 bed care home and 24 acres of commercial land. \nJolyon Harrison, chief executive officer, also said the EU referendum has not impacted upon business. \nHe said: “Gleeson Homes continues to see strong demand for its low cost homes. The EU referendum has not affected our core customer base for whom the decision to become home owners is not influenced significantly by market or media sentiment. Similarly, in Gleeson Strategic Land, early indications point to a continuing commitment on the part of our mid-sized housebuilding customers, who have short land banks which they need to continue to replenish. \n“Our business plans have not changed; for us it’s business as usual.”", "external_links": [], "published": "2016-07-05T16:45:00.000+03:00", "crawled": "2016-07-05T20:11:17.466+03:00", "highlightTitle": ""}