{"organizations": ["UKIP", "Metro", "EU", "Labour Party", "Newcastle"], "uuid": "040c469e337d0d4dcb320517433ba4d7d6bf7537", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11113402.ece/ALTERNATES/s1200/JS84735793.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/someone-carry-northern-torch-ukip-11673585", "country": "GB", "domain_rank": 21960, "title": "Someone has to carry the northern torch in the UKIP leadership election - that's why I am standing", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Someone has to carry the northern torch in the UKIP leadership election - that's why I am standing", "spam_score": 0.0, "site_type": "news", "published": "2016-07-28T20:30:00.000+03:00", "replies_count": 0, "uuid": "040c469e337d0d4dcb320517433ba4d7d6bf7537"}, "author": "Jonathan Arnott", "url": "http://www.chroniclelive.co.uk/news/north-east-news/someone-carry-northern-torch-ukip-11673585", "ord_in_thread": 0, "title": "Someone has to carry the northern torch in the UKIP leadership election - that's why I am standing", "locations": ["North East UKIP", "Britain", "Scotland", "North East", "England", "UK", "Newcastle", "Islington"], "entities": {"persons": [{"name": "jonathan arnott", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "north east ukip", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "islington", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Jonathan Arnott", "Paul Nuttall", "Smith", "Corbyn", "Nigel", "Nigel Farage"], "text": "North East UKIP MEP Jonathan Arnott says any candidate that tries to \"out-Nigel Nigel\" cannot win the Ukip contest Shares Get daily news by email Jonathan Arnott MEP \nThe Labour Party is in freefall across the North of England . What has happened to them in Scotland could well be repeated on our side of the border. Their poll ratings have headed downhill fast as their internal spat has come to a head. There’s no sign of it abating, and I’m not completely certain that Smith would be that much more palatable to the general public than Corbyn in any case. \nYet there are some real issues which need to be addressed here in the North East. We receive so little funding from central government for transport and infrastructure projects; the ‘Northern Powerhouse’ has a long way to go if it’s going to prove that it’s anything more than hot air. \nAnd don’t get me wrong, I wouldn’t mind seeing HS2 come all the way up to Newcastle but the quoted £27bn price tag seems to be poor value for money. Better HS2 than nothing for our region, but it’d be far better to sort out the myriad projects that we actually need: expansion of the Metro system, upgrades to the A1, A69 and A66, investment in our railways and many many more. We need a strong, credible Northern voice to stand up on these issues. \nWe need a voice for our manufacturing; our steel industry, just like our shipbuilding and coal mining before it, and our fisheries, has seen a huge downturn. We’re a region that makes things, a region that builds things. Centuries ago, Londoners used to call coal ‘sea coal’ because it was transported by ship from Newcastle. We need a voice that will stand up for our heavy industry. A voice to rebuild what has been decimated, to bring modern technology to traditional industry, to stand up for the industries that EU and UK government policies have destroyed \nI’m all for the free market in general, because it’s the free market that creates those jobs, but we also need to be prepared to defend out industries from global issues like Chinese dumping of steel on UK markets. I want to see a vibrant post-Brexit North East (and Northern) economy which returns to what we’re good at: building the success of a nation. I don’t see that kind of vision from the Labour Party which has drifted out to sea and completely lost its way. \nI want an economy in which we give our young people the best chance in the best possible schools to develop the skills that we’re going to need, and a society which doesn’t look down upon those who choose a vocational or technical route rather than going to university. I want a government which will turn around the neglect of the North, a government which recognises that if you deregulate small businesses and let them get on with the job then they will bring jobs into the economy, cut unemployment, and leave the country as a whole better off. \nWhen I see some of the horrific crimes in this region which haven’t resulted in a jail sentence, you can bet it won’t be those in the leafy suburbs of Islington who’ll suffer because of repeat offenders: it’ll be working class people here in the North East and elsewhere. I want us to get tough on crime, make prison conditions tougher - but crucially, we need to treat rehabilitation seriously too and not just as an afterthought. Criminals need to know that the consequences of offending will be unpleasant in order to take advantage of society’s help to get them back into a meaningful role in society. \nUKIP as a party wants to tackle these issues head on . I’m often asked what UKIP’s role is in the post-Brexit UK. Well here it is: a party that shows a beacon of hope for how we can make Britain Great again in the next few years. We can take Westminster seats at the next General Election here in the North East, and we can take on the mantle of a Labour Party that has alienated the very people its name purports to represent. \nThere’s a leadership election going on now after Nigel Farage has announced that he’s stepping down. It was a sad day when he stepped down, but if he wants to go, who am I to argue? \nThe next leader will fall flat on their face if they try to out-Nigel Nigel; you can’t follow a charismatic leader with a cheap imitation of the same. We need a different leadership style. We also need a credible Northern voice in that contest, and I was devastated when our Deputy Leader Paul Nuttall MEP decided not to put his hat in the ring. \nSomeone has to carry this Northern torch in the leadership election, and that’s one of many reasons why I’ve ultimately decided to have a go at it myself. \nWhat do you say? Would it be better to have a UKIP Leader from our region who will ensure that the North East is never put to the bottom of the pile and never forgotten? \nJonathan Arnott is UKIP MEP for the North East.", "external_links": [], "published": "2016-07-28T20:30:00.000+03:00", "crawled": "2016-07-28T21:07:57.164+03:00", "highlightTitle": ""}