{"organizations": ["Leicester Mercury Sigma Components", "Sigma Components", "RMDG Aerospace", "Towergate Insurance", "Coventry University", "Dunlop Aerospace", "Silverfleet", "Sigma", "Rolls-Royce", "London Stock Exchange", "Sigma Lite", "European Union", "Nottinghamshire", "General Manager Sigma Components", "British Airways Airbus", "Silverfleet Capital", "Meridian Business Park"], "uuid": "09d0da37fad3afc54ea2113b7c77fcbd20b8ce4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29551368/14967798.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/sigma-components-aims-to-be-the-best-small-aerospace-company-in-the-world/story-29551368-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Sigma Components wants to be the best small aerospace company in the world | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Sigma Components wants to be the best small aerospace company in the world | Leicester Mercury", "spam_score": 0.643, "site_type": "news", "published": "2016-07-26T14:40:00.000+03:00", "replies_count": 0, "uuid": "09d0da37fad3afc54ea2113b7c77fcbd20b8ce4e"}, "author": "", "url": "http://www.leicestermercury.co.uk/sigma-components-aims-to-be-the-best-small-aerospace-company-in-the-world/story-29551368-detail/story.html", "ord_in_thread": 0, "title": "Sigma Components wants to be the best small aerospace company in the world | Leicester Mercury", "locations": ["Britain", "North America", "Hinckley", "Farnborough", "Cheltenham", "Dodwell's Bridge Industrial Estate", "Swadlincote", "Nuneaton", "UK", "Sigma", "France", "Derby", "Xi'an", "China"], "entities": {"persons": [{"name": "avingtrans", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "mark johnson", "sentiment": "none"}, {"name": "tom barrett", "sentiment": "none"}, {"name": "lucas", "sentiment": "none"}, {"name": "john browett", "sentiment": "none"}, {"name": "yumiko", "sentiment": "none"}, {"name": "lauren mills", "sentiment": "none"}, {"name": "johnston mark johnson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tom wilson", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "hinckley", "sentiment": "none"}, {"name": "farnborough", "sentiment": "none"}, {"name": "cheltenham", "sentiment": "none"}, {"name": "dodwell's bridge industrial estate", "sentiment": "none"}, {"name": "swadlincote", "sentiment": "none"}, {"name": "nuneaton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sigma", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "derby", "sentiment": "none"}, {"name": "xi'an", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "leicester mercury sigma components", "sentiment": "none"}, {"name": "sigma components", "sentiment": "none"}, {"name": "rmdg aerospace", "sentiment": "none"}, {"name": "towergate insurance", "sentiment": "none"}, {"name": "coventry university", "sentiment": "none"}, {"name": "dunlop aerospace", "sentiment": "none"}, {"name": "silverfleet", "sentiment": "none"}, {"name": "sigma", "sentiment": "none"}, {"name": "rolls-royce", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "sigma lite", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nottinghamshire", "sentiment": "none"}, {"name": "general manager sigma components", "sentiment": "none"}, {"name": "british airways airbus", "sentiment": "none"}, {"name": "silverfleet capital", "sentiment": "none"}, {"name": "meridian business park", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Avingtrans", "Johnson", "Mark Johnson", "Tom Barrett", "Lucas", "John Browett", "Yumiko", "Lauren Mills", "Johnston Mark Johnson", "Brexit", "Tom Wilson"], "text": "Sigma Components wants to be the best small aerospace company in the world By Lauren_Mills | Posted: July 26, 2016 0 COMMENTS SHARES Will Johnston Mark Johnson (centre) with Tom Wilson, Operations Manager (left), and Tom Barrett Director and General Manager Sigma Components wants to be the best small aerospace company in the world X \nCopy link to paste in your message / Pictures: Will Johnston Comments (0) \nMark Johnson wants Sigma Components to be \"the best small aerospace company in the world\". He tells Deputy Business Editor Lauren Mills about his ambitions \nIf you're jetting off on holiday aboard a British Airways Airbus A350 you have a county firm to thank – at least in part – for the plane's efficiency. Hinckley-based Sigma Components supplies pipe assemblies for the Rolls-Royce Trent XWB that's powering your airliner across the skies. \nThey are no ordinary pipes. These are tubes made from a super lightweight material weighing around half as much as standard fittings. \nSigma is a leading provider of greener aero-engine parts. \nIts Sigma Lite division, launched last year, designs and makes a range of lightweight components including composite pipes, end fittings and drive shafts, all of which offer substantial weight savings compared to their conventionally-manufactured counterparts. \nSigma founder and managing director Mark Johnson said: \"The need for lightweight, greener, more fuel-efficient aircraft continues to present a real challenge to the industry, so we're taking the opportunity to review a range of conventional component designs to identify where improvements can be made. \n\"While each new component is an exciting development in its own right, the real step change comes when you look at how modest weight savings in a single fitting can create a massive snowball effect, greatly reducing the overall cost, size and environmental impact of manufacturing and running an aircraft.\" \nMark is understandably proud of the company he launched 12 years ago. \nRead more: Towergate Insurance in Meridian Business Park sees strong growth \nHe set up Sigma Components after graduating in production engineering from Coventry University and then spending nearly two decades working for large corporates including Lucas, Dunlop Aerospace and Leicester-based Wadkin. \nTo begin with Sigma acted as a consultancy, offering advice to firms looking to get a foothold in emerging markets. \nThen, in late 2005, a UK customer – Yumiko – promised Mr Johnson's firm £1 million a year of business if he could get the money to set up a factory in China. \nThough a previous attempt to get outside funding had failed, this time Mr Johnson had a letter of intent from a major potential customer in his back pocket. \nMr Johnson said: \"When I went back out to the investment community, firstly they saw we were still surviving which they were surprised at as a lot of businesses fail in the first 12 to 18 months. \n\"Then they said, 'Wow you've actually got a customer'. \n\"Then, one of the investors – Avingtrans – said they would give us the £2 million we needed to set up in China if we'd help them build an aerospace division and that's what we've been doing for the past 10 years.\" \nNottingham engineering group Avingtrans, which is listed on the London Stock Exchange, bought Sigma in 2006. \nAvingtrans helped Sigma grow through a string of acquisitions. \nIt bought family-run B&D Patterns in late 2006. The firm was located in Dodwell's Bridge Industrial Estate in Hinckley, where the company is now based. \n\"We bought it and grew it significantly, from 90 employees to 150 on this site now,\" he said. \nSigma went on to buy RMDG Aerospace in Swadlincote, Aerotec in Derby, as well as PFW, which is in Farnborough. \nThe company now has operations in Hinckley, Farnborough, Nottinghamshire, Cheltenham and China. \nIt employs 250 people in the UK, with 500 in its China operation. \nThe latest twist in Sigma's journey came in May when Mr Johnson and his senior team led a management buyout to buy the business back from Avingtrans for £65 million. \nMoney for the deal was provided by European private equity firm Silverfleet Capital. \nRead more: Dunelm chief executive John Browett speaks about plans for the future \nMr Johnson said: \"Having met all of Avingtrans' targets and following a strategic review in 2015, we decided it was the right time for Sigma to find a new investor to support its ongoing growth. \n\"We'll look back at nearly 10 years' ownership by Avingtrans with happiness and pride and thank the board for their support. \n\"The whole team is excited at the prospects with Silverfleet and their support to help our future growth.\" \nSigma has an annual turnover of around £55 million. \nIt recently signed a £75 million, 10-year deal to supply pipe assemblies for Rolls-Royce engines including the Trent XWB. \nSigma also recently concluded a separate £3.5 million deal to acquire a Rolls-Royce pipe manufacturing business with operations in Nuneaton and Xi'an, China. \nMr Johnson's ambition is to grow annual revenues to £150 million over the next five years. \nHe said: \"We are looking at what companies would complement our business to help us achieve that growth, so we're looking at even bigger opportunities for acquisitions both in the UK and in North America. \n\"We are also growing quite strongly as our own business. \n\"We've just got some business from an engine manufacturer in France, which is great, because that is a new market for us.\" \nSigma is one of the few companies feeling a positive impact in the early aftermath of Britain's decision to leave the European Union. \nMr Johnson said: \"Bizarrely, one of the upsides as a UK manufacturer is the pound has dropped against the euro, so it reduces the cost of our products and makes us more competitive. \n\"It is still early days, but what is fundamental for any customer is the ability to get high quality product at the lowest possible price with the best possible service and Brexit won't change any of that.\" ", "external_links": [], "published": "2016-07-26T14:40:00.000+03:00", "crawled": "2016-07-26T13:48:37.505+03:00", "highlightTitle": ""}