{"organizations": ["Durham County Council", "Durham Council", "Environmental Health"], "uuid": "5709bf521c5deec7fa304e9e32149495fcd9118c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11641109.ece/ALTERNATES/s1200/JS90259312.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/durham-council-make-64million-savings-11641017", "country": "GB", "domain_rank": 21960, "title": "Durham Council to make £64million in savings - what will get cut and who will be affected?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Durham Council to make £64million in savings - what will get cut and who will be affected?", "spam_score": 0.0, "site_type": "news", "published": "2016-07-20T16:49:00.000+03:00", "replies_count": 0, "uuid": "5709bf521c5deec7fa304e9e32149495fcd9118c"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/durham-council-make-64million-savings-11641017", "ord_in_thread": 0, "title": "Durham Council to make £64million in savings - what will get cut and who will be affected?", "locations": ["Killhope Museum", "Meadowfield", "County Durham"], "entities": {"persons": [{"name": "coun napier", "sentiment": "none"}, {"name": "alan napier", "sentiment": "none"}, {"name": "simon henig", "sentiment": "none"}], "locations": [{"name": "killhope museum", "sentiment": "none"}, {"name": "meadowfield", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}], "organizations": [{"name": "durham county council", "sentiment": "none"}, {"name": "durham council", "sentiment": "none"}, {"name": "environmental health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Coun Napier", "Alan Napier", "Simon Henig"], "text": "As part of a consultation on Government cuts over the next three years Durham County Council has announced a raft of cost saving proposals Shares Get daily news by email Durham Council leader Simon Henig \nA wave of cuts hitting all ages, genders and the disabled is on its way to County Durham . \nDurham County Council has revealed were the axe might fall as the authority struggles to make further savings of £64m by 2020. \nThe medium term financial plan published by the council on Wednesday identifies around £29m of savings for next year. \nChildren come out as one of the worst hit groups in the latest round of cuts - as the council identified more than £5million that could be sucked from services directly used by the under 16s. \nCouncil leader Simon Henig said the reason for “big numbers” on children and adult services was because they formed the largest spending areas of the council – some 62 per cent. \nAround £7m of savings was also identified through job cuts and a restructure of the council. \nIf implemented hundreds more jobs will go, street lighting will continue to be reduced, library and museum staffing levels trimmed and building and grounds maintenance budgets slashed. \nDeputy leader Alan Napier told cabinet that the plan kept the authority away from the “financial cliff”. \nHe said: “This has been developed in the context of extremely challenging times for local government and the public sector more generally as a result of the ideological and politically motivated sustained attack on the public sector by the current Government. \n“These pressures may be further be exacerbated post Brexit. Our county and the region have at least three more years of austerity to come, making it a decade of austerity.” \nCoun Napier highlighted the use of £8.2m from the council’s £28m reserves to soften the blow. \nHe said: “It is important to hold reserves and use them at the right time to protect frontline services for as long as we can. It is only through our careful management of the council’s finances over the last seven years that we have the capacity and ability to do this.” \nThe total reductions across the period 2011 to 2020 for Durham County Council will be £245million. \nCouncil leader Simon Henig said: “We have already made by the end of this financial year £180m of savings, we now face another £60m plus, with three years of further cuts taking us up to a decade of unprecedented austerity. \n“These cuts are not getting more easy they are getting more difficult. we have already lost 2000 posts at county council and this will approach 2500 by 2017, yet we must continue to find further reductions.” \nThe measures approved by cabinet will go out to consultation in September and will involve all 14 of the council’s area action partnerships, as well as online and targeted discussions with a wide variety of groups. \nA final decision on options will be made at county council in February 2017. Where will the axe fall? \nAdult care provision - A saving of £333,000 has been identified. The saving will mean that the automatic allowance for non-residential care services for those in receipt of severe disability premium would be scrapped. This is currently £1,588 per year. Only new service users will be affected. \nJob reductions and council structure - Savings of £7m have been identified. In addition to a complete restructure of the council, significant staffing and non-staffing reductions will be made in planning, performance, IT systems development, policy, partnership support, quality assurance, training and development, marketing, business support and regeneration and economic services. \nChildren’s services - Savings of £5m have been identified. Services such as youth support, the looked after children programme and non-statutory home to school transport will face cutbacks. In addition there will be a review of education services which will cover staffing and non-staffing costs in progression and learning, school places and admissions, special educational needs and disabilities and support and development. Non-staffing savings will include reductions in activity budgets, for example, the young people, school health and progression and learning activities budgets, pension liabilities and increasing income targets. \nNursing care - Saving of £350,000 has been identified. Funding will be recouped through a review of the commissioning arrangements for standard and specialist residential and nursing care. \nMaintenance and business support - Savings of £750,000. Review of fleet workshop maintenance facilities and relocation of some garage services to Meadowfield. Reduction in repairs and maintenance, building and cleaning budgets and increased catering income. Also the reduction in Neighbourhood Services managed buildings will result in savings in the business rates and utilities budgets. \nNeighbourhood protection - Saving of £319,000 - This will be made through a review of grounds maintenance and a reduction in the safer communities initiatives budget which supports schemes to resolve local community issues. \nGarden waste charges - Income increase of £315,000 - Additional income will be generated through an increase in garden waste charging in 2017/18 from £20 to £25 per year along with a review of environmental monitoring budgets and contract payments around closed landfill sites. \nStreet lighting - Saving of £400,000. This is a continuation of savings in energy and maintenance costs from the street lighting energy reduction project. \nLibraries and museums - Saving of £210,000. A review of staffing and changes to operational arrangements relating to Killhope Museum. An additional proposal will produce savings from the supplies and services and buildings aspects of the library service. It would also have a staffing element where vacancies arise and staffing hours could be reduced without impact on opening hours. \nContact centres- Saving of £150,000. Reduce resources within both the customer access point (CAP) and the contact centre environments. \nEnvironmental Health - Saving of £140,000 - Reductions in premises, supplies and services budget.", "external_links": [], "published": "2016-07-20T16:49:00.000+03:00", "crawled": "2016-07-20T18:35:23.752+03:00", "highlightTitle": ""}