{"organizations": ["Hargreaves Services Potential Brexit", "County Durham", "Hargreaves Services", "The Group", "RWE", "Hargreaves Services  Hargreaves Services", "Group"], "uuid": "ea60400fb538b5479e641890902990361902c415", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article9577192.ece/ALTERNATES/s1200/JS34911920.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/potential-brexit-boost-blow-county-11564865", "country": "GB", "domain_rank": 21960, "title": "Potential Brexit boost and blow for County Durham's Hargreaves Services", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Potential Brexit boost and blow for County Durham's Hargreaves Services", "spam_score": 0.0, "site_type": "news", "published": "2016-07-04T16:57:00.000+03:00", "replies_count": 0, "uuid": "ea60400fb538b5479e641890902990361902c415"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/potential-brexit-boost-blow-county-11564865", "ord_in_thread": 0, "title": "Potential Brexit boost and blow for County Durham's Hargreaves Services", "locations": ["Brexit", "UK", "EU", "Aberthaw", "County Durham"], "entities": {"persons": [{"name": "hargreaves", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "aberthaw", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}], "organizations": [{"name": "hargreaves services potential brexit", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "hargreaves services", "sentiment": "none"}, {"name": "the group", "sentiment": "none"}, {"name": "rwe", "sentiment": "none"}, {"name": "hargreaves services  hargreaves services", "sentiment": "none"}, {"name": "group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Hargreaves"], "text": "Potential Brexit boost and blow for County Durham's Hargreaves Services 14:57, 4 Jul 2016 Hargreaves Services is a beneficiary of sterling weakness after the EU referendum but its earthworks business could be affected negatively Shares Get business news by email Hargreaves Services \nHargreaves Services said it could receive a potential Brexit boost thanks to its stocks of dollar-denominated coal and coke - though other parts of its business could be hit. \nThe County Durham business , one of the region’s largest firms, issued a post-close trading update to shareholders in which directors told how they are continuing to appraise the potential impacts of Brexit. \nAhead of its preliminary results for the year ended May 31 2016, directors at the firm – the UK’s leading supplier of solid fuel and bulk material logistics – said the group was pleased to report that trading in the run-up to the year end was in line with management expectations and consequently expects underlying profitability to be in line with current market expectations. \nIn the statement to shareholders, the firm said the pound’s drop in value since the EU Referendum result could produce positives for the firm, as well as negatives. \nThe firm said: “The Group continues to appraise the potential impacts of Brexit. The Group is a net beneficiary of Sterling weakness due to its current stocks of largely dollar-denominated coal and coke. \n“No revaluation gains have been booked to date, but if the current exchange rate trends continue the Group should benefit as and when these stocks are realised. \n“On a negative note the Group has been informed that a £7m earthworks project at a major UK port has been postponed owing to Brexit-related concerns. \n“The current uncertainty associated with Brexit presents potential risks for our Earthworks and Logistics businesses which have a significant exposure to construction activity and capital investment projects. \n“However, it is difficult at this stage to form a clear picture of the medium term impacts and we currently consider the risk of a downturn in private sector activity as against the potential upside from Government-sponsored public sector works to reflate the economy to be relatively finely balanced.” \nLast summer the firm set in motion a redundancy and cost-saving programme after what it described as the “most challenging” times ever seen in its sector. \nNow, the firm has said the restructuring and repositioning of the group’s core operations continues to progress and the resulting restructuring and exceptional costs are expected to be broadly in line with previous market guidance. \nIn April RWE announced its intention to potentially cease taking delivery of Welsh coal at Aberthaw power station after March 2017 – a decision that directly affects Hargreaves, which supplies Aberthaw from its Tower colliery. \nRWE has since confirmed it will cease buying coal for the power station, and Hargreaves said the decision firmed up its own previously announced intention to consider a shortened mining programme at the Tower joint venture. \nThe directors added: “Within our interim results we stated that a shortened mining plan could result in a modest impairment of our outstanding loans to the joint venture vehicle. \n“It is our current view that, although the equity investment values and goodwill require to be impaired as no future dividends are likely to arise, a full recovery of the loans remains achievable. \n“The Group will continue to work with its joint venture partners to seek an optimal outcome. The impairment charge in respect of our equity investment and goodwill will be approximately £4.9m.”", "external_links": [], "published": "2016-07-04T16:57:00.000+03:00", "crawled": "2016-07-04T17:20:21.938+03:00", "highlightTitle": ""}