{"organizations": ["European Union", "EU", "Nottinghamshire", "Leicestershire", "SDL Group", "Bentons"], "uuid": "9864e92ff76598013386432e6c2d004d182f71d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29473394/14779639.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/opinion-is-it-business-as-usual-after-eu-exit/story-29473394-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "RTWhyte published OPINION: Is it business as usual after EU exit?", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "RTWhyte published OPINION: Is it business as usual after EU exit?", "spam_score": 0.0, "site_type": "news", "published": "2016-07-04T12:26:00.000+03:00", "replies_count": 0, "uuid": "9864e92ff76598013386432e6c2d004d182f71d6"}, "author": "RTWhyte", "url": "http://www.leicestermercury.co.uk/opinion-is-it-business-as-usual-after-eu-exit/story-29473394-detail/story.html", "ord_in_thread": 0, "title": "RTWhyte published OPINION: Is it business as usual after EU exit?", "locations": ["Britain", "Leicestershire", "Clarendon Park", "Leicester", "Lincolnshire", "EU", "UK", "Midlands", "London", "Graham Penny"], "entities": {"persons": [{"name": "melanie edgell", "sentiment": "none"}, {"name": "kam johal", "sentiment": "none"}, {"name": "james warne", "sentiment": "none"}, {"name": "rob clifford", "sentiment": "none"}, {"name": "annette bateman", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "clarendon park", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "graham penny", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nottinghamshire", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "sdl group", "sentiment": "none"}, {"name": "bentons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Melanie Edgell", "Kam Johal", "James Warne", "Rob Clifford", "Annette Bateman"], "text": "Comments (0) As Britain comes to terms with life on the outside of European Union, Melanie Edgell asks Leicestershire property experts for their views on how it could affect the market \nA week after the UK voted to leave the European Union, the future of the property market is still on hold.The full implications of this decision and the timescales by which the UK will navigate an ultimate exit from the EU remain unknown. It seems likely there will be a period of volatility and uncertainty as the UK redefines its relationship with other European countries.While politicians continue to wrangle, local property experts appear less perturbed than the national press, refusing to be panicked and advising a level-headed approach, with a wait-and-see outlook. \nIt's very much business as usual for property specialist the SDL Group, which includes the Graham Penny auctioneering office in Leicester. SDL Group's commercial director Rob Clifford said: \"SDL Group was behind a remain vote, as it was a clear route to offer maximum and continued stability for both the housing market and the British consumer.\"Our business is robust and whilst we doubt there will be any direct detriment to the operations of SDL Group, we're inevitably anxious about the potential macro effect on both the housing and financial services sectors.\"These are uncertain times for all of us, but it's important to approach the situation we find ourselves in with a level head. Risks will undoubtedly come from such uncertainty, but that is the very nature of the market we're in. It's very much business as usual.\"James Warne, residential director at Melton-based agent Bentons, said he had sold six properties since last Friday, one of which fetched £1.5 million. \"I attended a meeting of 20 estate agents across Leicestershire, Nottinghamshire and Lincolnshire and found that only one sale had faltered as a result of the Brexit vote.\"The biggest driver for the housing market is the cost and availability of money. In the short to medium/term it is not likely that interest rates will go up and in fact they may well fall. I do not therefore think that there will be much change in house prices or market conditions, particularly when there is a shortage of property and demand has been high this year. \"We cannot, of course, ignore the issue of confidence, which I'm sure will affect the market much more in London and the Southeast, but I do not see any major change in market conditions in the Midlands other than a short-term, knee-jerk reaction.\"Kam Johal, dhief executive 0fficer of IPS in Leicester, said we are now in uncharted waters with many challenges ahead, but feel that after a short-term wobble the property market will flourish.\"Whilst property values might drop in the country, they will bounce back. It's only a paper loss, because it only becomes real if you sell. \"If you do have to sell, most people move up market, so whilst your property might have dropped by 5 per cent or 10 per cent , the one you want to buy would have dropped by the same 5 per cent to 10 per cent and here is the best part, you would actually be better off because the more expensive property you would be purchasing would have come down in value in actual pound notes more than the one you are selling.\"Annette Bateman, associate director of Barkers estate agent in Clarendon Park, said she had experienced a busy week. \"Whilst there was an initial shock to system we have found that this has soon settled down and in reality nothing has changed.\"This week it has been business as normal registering waiting buyers, listing new properties, agreeing offers and dealing with completions. If people are concerned then they should be reassured that the market is still moving. It is in a much stronger position than in 2007 to 2008 and waiting buyers are there. People always need somewhere to live and the result does not change this.\"", "external_links": [], "published": "2016-07-04T12:26:00.000+03:00", "crawled": "2016-07-04T14:29:22.617+03:00", "highlightTitle": ""}