{"organizations": ["Barratt Developments", "Housebuilder Barratt Developments plc", "Wilson King Investment Management", "Barratt"], "uuid": "3566b0e18ff4b56c511a0174380bf3601c754621", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11606580.ece/ALTERNATES/s1200/JS60797825.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/barratt-developments-confident-after-strong-11607822", "country": "GB", "domain_rank": 21960, "title": "Barratt Developments confident after strong year - despite Brexit uncertainty", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Barratt Developments confident after strong year - despite Brexit uncertainty", "spam_score": 0.0, "site_type": "news", "published": "2016-07-13T13:30:00.000+03:00", "replies_count": 0, "uuid": "3566b0e18ff4b56c511a0174380bf3601c754621"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/barratt-developments-confident-after-strong-11607822", "ord_in_thread": 0, "title": "Barratt Developments confident after strong year - despite Brexit uncertainty", "locations": ["North East", "Brexit", "UK"], "entities": {"persons": [{"name": "richard hunter", "sentiment": "none"}, {"name": "david thomas", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "barratt developments", "sentiment": "none"}, {"name": "housebuilder barratt developments plc", "sentiment": "none"}, {"name": "wilson king investment management", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Richard Hunter", "David Thomas", "Barratt"], "text": "Barratt Developments confident after strong year - despite Brexit uncertainty 11:30, 13 Jul 2016 Newcastle-founded company says Government support and strong forward order book suggest 'positive fundamentals'   Barratt Developments has reported another strong year \nHousebuilder Barratt Developments plc, which is set to report a 20% rise in profits this year, says it is confident about its future, as well as that of the sector, despite uncertainty caused by the Brexit vote . \nIn the trading update covering the 12 months ended June 30, 2016, the group, which was founded in the North East, said profit before tax was expected to increase year-on-year, from £565.5m to £680m. \nChief executive David Thomas said: “We have delivered another strong performance for the year. \n“The disciplined growth in completion volumes reflects the strength of our sector-leading build and sales teams.” \nHe added that while it was too early to say what the impact of the uncertainty facing the UK economy post-Brexit would be, the sector continued to receive focused Government support through the likes of the Help to Buy (Equity Loan) programme, which has been extended through to 2021. \nMortgage availability was also good and there remained an under-supply of new homes. \n“With a strong balance sheet and forward order book, and industry-leading quality and customer service, we remain confident in the positive fundamentals of both the hosing sector and our business,” he said. \nSince the referendum vote, Barratt’s share price has fallen more than 25% as economists warn of a slowdown that could end up hitting the housing market. \nNevertheless, during the 2016 financial year, it completed 17,319 new homes, an increase of 5%, with the average selling price rising 10.6% to £260,000. \nForward sales, including joint ventures, amounted to £1.76bn and Barratt approved over £1bn of operational land for purchase, compared to £957m the previous year. The company expects the investment to translate into 24,387 plots, up from 16,956. \nYear end cash, meanwhile, amounted to £590m, compared to £186.5m in 2015. \nThis was ahead of expectations and was driven by completion volumes and the timing of land payments. \nOn the potential impact of Brexit, the report added: “We had contingency plans in place and we have taken appropriate measures to reduce our risk, such as reassessing land approvals, as we continue to monitor the market.” \nBarratt will announce its full annual results on Wednesday, September 7. \nRichard Hunter, head of research at Wilson King Investment Management, said: “Barratt has delivered a defiant message in a trading statement which is both punchy in terms of metrics and upbeat in outlook. \n“Profit for the year is expected to be strongly ahead, underpinned by a noticeable improvement in completions and average selling prices.”", "external_links": [], "published": "2016-07-13T13:30:00.000+03:00", "crawled": "2016-07-13T14:32:17.062+03:00", "highlightTitle": ""}