{"organizations": ["Durham Miners", "Labour", "Durham Miners Gala  Mrs Blackman-Woods", "Durham Miners’ Association", "Association", "Newcastle City Council", "House of Commons", "Parliamentary Labour Party", "EU", "Labour Party", "Bishop Auckland", "House of Lords"], "uuid": "099e64ecb666c10a0a75658e1e6448f3e5cc1908", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article9637016.ece/ALTERNATES/s1200/JS68004321.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/anti-corbyn-mps-attend-durham-11570401", "country": "GB", "domain_rank": 21960, "title": "Anti-Corbyn MPs will attend Durham Miners' Gala despite withdrawn invites", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Anti-Corbyn MPs will attend Durham Miners' Gala despite withdrawn invites", "spam_score": 0.0, "site_type": "news", "published": "2016-07-05T20:30:00.000+03:00", "replies_count": 0, "uuid": "099e64ecb666c10a0a75658e1e6448f3e5cc1908"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/anti-corbyn-mps-attend-durham-11570401", "ord_in_thread": 0, "title": "Anti-Corbyn MPs will attend Durham Miners' Gala despite withdrawn invites", "locations": ["North Durham", "Durham", "Westminster"], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "anti-corbyn", "sentiment": "none"}, {"name": "my corbyn", "sentiment": "none"}, {"name": "rick", "sentiment": "none"}, {"name": "roberta blackman-woods", "sentiment": "none"}, {"name": "chroniclelive", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "dennis skinner", "sentiment": "none"}, {"name": "kevan jones", "sentiment": "none"}, {"name": "mrs goodman", "sentiment": "none"}, {"name": "angela eagle", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "mr corbyn", "sentiment": "none"}, {"name": "jeremy beecham", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "mr watson", "sentiment": "none"}, {"name": "dave hopper", "sentiment": "none"}], "locations": [{"name": "north durham", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "durham miners", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "durham miners gala  mrs blackman-woods", "sentiment": "none"}, {"name": "durham miners’ association", "sentiment": "none"}, {"name": "association", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "parliamentary labour party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Jeremy Corbyn", "Anti-Corbyn", "My Corbyn", "Rick", "Roberta Blackman-Woods", "ChronicleLive", "Helen Goodman", "Corbyn", "Dennis Skinner", "Kevan Jones", "Mrs Goodman", "Angela Eagle", "Tom Watson", "Mr Corbyn", "Jeremy Beecham", "Watson", "Mr Watson", "Dave Hopper"], "text": "VIEW GALLERY \nLabour MPs who called for Jeremy Corbyn to resign are set to attend the Durham Miners’ Gala despite being told they will no longer play an official role. \nRoberta Blackman-Woods, Labour MP for the City of Durham, and Helen Goodman, Labour MP for Bishop Auckland, have confirmed they will take part in the Big Meeting. \nAnd organisers the Durham Miners’ Association says they were never banned from attending, despite reports that MPs who opposed Mr Corbyn had their invitations withdrawn. \nHowever, the MPs will no longer be invited to take part in some official events. \nMr Corbyn is to be a guest at the Gala on July 9. Last year’s event attracted an estimated 150,000 visitors and organisers hope even more will attend this year. \nDave Hopper, general secretary of the Durham Miners’ Association, said in a statement: “Contrary to recent press reports, Labour MPs who refused to support Jeremy Corbyn in the recent vote of confidence have not been ‘banned’ or ‘barred’ from attending this year’s Gala. The Gala is a public event which anyone can attend. \n“However, the invitations to attend the official Durham Miners’ Association events and functions, stand on the balcony of the County Hotel and grace the platform on the Racecourse have been rescinded. \n“Jeremy Corbyn is a guest of the Durham Miners’ Association at this year’s Gala and we will not allow those who have sought to humiliate him and undermine the democratic process in the Labour Party the honour of taking part in the aforementioned Gala traditions.” The Durham Miners Gala \nMrs Blackman-Woods has urged people to attend. \nShe said: \"I will walk in with one of the banners, which is what I usually do. \n\"I respect their right to disinvite us if that's what they want to do. But that's to the formal bits but I'll be milling around with my constituents and having a good time, which is what people do at the Gala.\"I'm encouraging people to go. It's a wonderful family day out as well as being a political event.\" \nMrs Goodman told ChronicleLive “of course” she would attend and continue to support the event. \nBut the Association has come in for criticism. Jeremy Beecham, the former leader of Newcastle City Council and now a Labour shadow minister in the House of Lords, said: “That’s what they call democracy – no platforming two hard working local MPs who’ve done a great job opposing the Tory government.” Read More 'Call off the dogs Mr Corbyn' - MP's message to Labour leader after being deluged with abuse \nWhile the Labour team in the House of Commons has been hit by a series of resignations from front-benchers who say they cannot support Mr Corbyn as leader, the front bench team in the Lords has taken a different approach and effectively declared independence from the Labour leader by announcing that they will make their own decisions about how to vote. \nKevan Jones, MP for North Durham, has also criticised the Durham Miners’ Association position. \nMP Dennis Skinner, a supporter of Mr Corbyn, is expected to attend and speak. He replaces Tom Watson, the deputy leader of the Labour Party, who is unable to take part due to his father’s illness. \nAs Labour’s leadership crisis continues, Mr Watson is due to hold talks with trade union chiefs in an attempt to end the impasse over Jeremy Corbyn’s position. \nHe hopes to persuade My Corbyn to go while avoiding a leadership contest. Angela Eagle, the former shadow business secretary, has said she could trigger a contest by standing against Mr Corbyn, but Mr Watson is said to fear that party members would simply re-elect Mr Corbyn, leaving Labour more divided than it is already. Rick Findler/PA Wire Labour leader Jeremy Corbyn \nThe position of the unions could prove crucial in determining the future of the party, and Mr Watson told MPs that talks with them would be the “last throw of the dice” in efforts to persuade embattled leader Mr Corbyn to stand down. \nAt a one-to-one meeting at Westminster on Monday, Mr Watson told Mr Corbyn he could not carry on as party leader without the backing of the party’s MPs. Read More Take a rare look inside the historic and unusual Durham Miners' Hall \nHowever, he told a packed meeting of the Parliamentary Labour Party on Monday night that Mr Corbyn had again made it clear that he had no intention of walking away, issuing a renewed appeal to supporters to unite behind his leadership. \nIn a video posted on the internet, Mr Corbyn insisted he was carrying on with the responsibility given to him when elected leader by an overwhelming majority of grassroots members, and called for the party to “come together”. \nHe brushed away claims he only half-heartedly campaigned for EU membership in the referendum and so contributed to the vote for Brexit - which triggered the current crisis - pointing out that two thirds of Labour voters backed Remain. \nHe said the membership “wants and expects” everyone in the party - including MPs - “to work together in their interests”.", "external_links": [], "published": "2016-07-05T20:30:00.000+03:00", "crawled": "2016-07-05T22:25:42.012+03:00", "highlightTitle": ""}