{"organizations": ["Northern Powerhouse", "Department of Energy", "Parliament for South Northamptonshire", "Sunderland", "EU", "North East Combined Authority"], "uuid": "0c684670ca099c5953a24b6a72491a6b5dbd6054", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11565124.ece/ALTERNATES/s1200/JS93983259.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northern-powerhouse-supercharge-says-tory-11565041", "country": "GB", "domain_rank": 21960, "title": "Northern Powerhouse - supercharge it says Tory leadership hopeful", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Northern Powerhouse - supercharge it says Tory leadership hopeful", "spam_score": 0.0, "site_type": "news", "published": "2016-07-04T17:25:00.000+03:00", "replies_count": 0, "uuid": "0c684670ca099c5953a24b6a72491a6b5dbd6054"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northern-powerhouse-supercharge-says-tory-11565041", "ord_in_thread": 0, "title": "Northern Powerhouse - supercharge it says Tory leadership hopeful", "locations": ["Britain", "Sheffield", "Greater Manchester", "Liverpool", "UK", "China"], "entities": {"persons": [{"name": "andrea leadsom", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "danny lawson", "sentiment": "none"}, {"name": "ms leadsom", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "none"}, {"name": "department of energy", "sentiment": "none"}, {"name": "parliament for south northamptonshire", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Andrea Leadsom", "George Osborne", "Tory", "David Cameron", "Brexit", "Danny Lawson", "Ms Leadsom", "Osborne"], "text": "Andrea Leadsom calls for a devolution boost as Chancellor George Osborne includes it in his five point plan for the economy Shares Get daily news by email Danny Lawson - Pool/Getty Images Chancellor George Osborne \nChancellor George Osborne has restated his commitment to the Northern Powerhouse by including it as part of his five point post Brexit plan to ease fears of a recession. \nHe was backed by Tory leadership candidate Andrea Leadsom who said the devolution deal should now be “supercharged”. \nHowever as they spoke a report claimed Mr Osborne’s ‘big idea’ to devolve power to the North was just “smoke and mirrors”. \nWith uncertainty still surrounding the way forward for the UK after the EU referendum Mr Osborne, whose Government position is equally uncertain, outlined his plan. \nHe said he wanted to focus on delivering the Northern Powerhouse alongside lowering corporation tax to 15%, ensuring support for bank lending, a push for more investment in China and maintaining Britain’s fiscal credibility. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nIn an interview he said: “We must focus on the horizon and the journey ahead and make the most of the hand we’ve been dealt,” adding that the UK faced a “very challenging time”. \nBefore the EU referendum vote on June 23, Mr Osborne predicted a bleak future for the Northern Powerhouse if Brexit won, warning it would put a place question mark over major transport plans, the cornerstone of the project. \nPost referendum, he said: “One clear message from the referendum was that there were parts of the country which felt left behind and one of the reasons that I said two years ago that we need to build a Northern Powerhouse was to make sure the whole country shares in our economic prosperity. \n“If anything, the referendum result is even more of an instruction to deliver that powerhouse and make it a reality.” \nAnd Ms Leadsom, one of the front runners in the race to replace Prime Minister David Cameron , took this further when she said: “The Chancellor’s sound Northern Powerhouse needs to be supercharged and I will not forget that Sunderland was one of the very first to make it clear last Friday morning their desire for change.” Andrea Leadsom, Member of Parliament for South Northamptonshire and Minister of State at Department of Energy and Climate Change \nHowever while she and Mr Osborne talked up its future prospects a report dismissed the concept as “smoke and mirrors”. \nPublished by the Liberal Democrats, it argued that without real investment, the Northern Powerhouse is just a buzzword that is stronger on rhetoric than substance. \nAs part, the government has so far agreed devolution deals worth £30m a year for 30 years with the North East Combined Authority as well as Greater Manchester, the Liverpool region and the Sheffield region. \nAnother deal worth £15m a year for 30 years, has been agreed with Tees valley. \nThe Lid Dem report argues that the additional funding doesn’t compensate for cuts made to council budgets. From 2010-11 to 2015-16 there was a 40% estimated real-terms reduction in central government funding to the relevant local authorities, the authors claim. \nIts authors wrote: “There is very little revenue funding associated with the devolution deal projects. The vast majority of income relates to capital income over the next 30 years – much of which the local authorities would have received in one form or another anyway. This is more than offset by cuts to the budgets of first tier and joint authorities within the city regions.”", "external_links": [], "published": "2016-07-04T17:25:00.000+03:00", "crawled": "2016-07-04T18:27:59.145+03:00", "highlightTitle": ""}