{"organizations": ["CBI", "European Union", "European Union Business", "Pantheon Macroeconomics", "Industrial Trends Survey", "CBI  Business"], "uuid": "0f005fdd936561061f9c318c7e89c24803163ba0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11660134.ece/ALTERNATES/s1200/JS54467657.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/business-optimism-plummets-after-vote-11659979", "country": "GB", "domain_rank": 21960, "title": "Business optimism plummets after vote to leave the European Union", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business optimism plummets after vote to leave the European Union", "spam_score": 0.0, "site_type": "news", "published": "2016-07-25T15:06:00.000+03:00", "replies_count": 0, "uuid": "0f005fdd936561061f9c318c7e89c24803163ba0"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/business-optimism-plummets-after-vote-11659979", "ord_in_thread": 0, "title": "Business optimism plummets after vote to leave the European Union", "locations": ["Britain", "European Union", "UK", "EU"], "entities": {"persons": [{"name": "samuel tombs", "sentiment": "none"}, {"name": "rain newton-smith", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "cbi", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european union business", "sentiment": "none"}, {"name": "pantheon macroeconomics", "sentiment": "none"}, {"name": "industrial trends survey", "sentiment": "none"}, {"name": "cbi  business", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Samuel Tombs", "Rain Newton-Smith"], "text": "Business optimism plummets after vote to leave the European Union 13:06, 25 Jul 2016 CBI survey shows confidence falling at fastest rate since 2009, though manufacturing output is up Shares Get business news by email Rain Newton-Smith, director of economics at the CBI \nBusiness optimism has deteriorated at its fastest pace since January 2009 and investment intentions have been scaled back following the Brexit vote, the CBI has said. \nThe business group’s Industrial Trends Survey revealed that optimism had fallen sharply in the wake of the EU referendum result, while expectations that total new orders will rise are at their lowest level since January 2012. \nIt found that 52% of firms were less optimistic about the general business situation compared to three months ago, while 5% of businesses were more optimistic, leaving a balance of minus 47%. \nBut the report - which surveyed 506 manufacturers between June 27 and July 13 - said output had risen across the sector at its fastest pace in two years. \nThe update comes after last week’s closely-watched Markit Flash UK Composite Output Index showed the UK economy has slumped at its fastest rate since the financial crisis in the wake of Britain voting to leave the European Union. \nRain Newton-Smith, CBI chief economist, said: “Manufacturers picked up the pace over the second quarter, with output growing solidly. We’re also seeing encouraging signs of a boost to export competitiveness from a weaker sterling. \n“But it’s clear that a cloud of uncertainty is hovering over industry, post-Brexit. We see this in weak expectations for new orders, a sharp fall in optimism and a scaling back of investment plans.” \nThe report found that 30% of firms said their output volume had risen over the past three months, compared with 14% which said it had fallen, leaving a balance of plus 16%. It was the fastest rise since a reading of plus 23% in July 2014. \nHowever, investment intentions took a downward turn, with building investment at minus 23% compared with plus 6% in April and plant and machinery sliding to minus 5% compared with plus 17% in April. \nMeanwhile, total order for July hit minus 4% compared with minus 2% in June, while export order books fell to minus 22% from minus 14% over the period. \nLooking forward, the report is pencilling in total new orders to come in flat, which would be the lowest balance since the figure hit minus 2% in January 2012. \nSamuel Tombs, chief UK economist at Pantheon Macroeconomics, said the survey was a further sign that the UK economy was heading for a recession. \nHe said: “July’s CBI Industrial Trends Survey shows that manufacturers are preparing for torrid trading, despite the weaker pound. \n“The total orders balance in July was above its minus 10 average of the previous 12 months and it is consistent on past form with manufacturing output rising by about 0.5% year over year in July. \n“But business optimism has fallen to its lowest level since Q1 2009, and new orders are expected to be flat in Q3 as a whole, the worst expectation since Q1 2012. \n“Meanwhile, a small majority of manufacturers expect to cut headcounts and to reduce investment in plant and machinery. In short, the survey adds to evidence that the economy is heading for a recession.”", "external_links": [], "published": "2016-07-25T15:06:00.000+03:00", "crawled": "2016-07-25T15:28:04.340+03:00", "highlightTitle": ""}