{"organizations": ["Northumbria Police", "Newcastle International Airport", "EU", "Newcastle Airport"], "uuid": "ac16386f44b869d1632402b46c2ddb0c597c645f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11611254.ece/ALTERNATES/s1200/JS94857409.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-dont-expect-your-hometown-11611090", "country": "IE", "domain_rank": 21960, "title": "'You don't expect this in your hometown': Heaton man tells of shock at Newcastle Airport race attack - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "'You don't expect this in your hometown': Heaton man tells of shock at Newcastle Airport race attack - Chronicle Live", "spam_score": 0.0, "site_type": "news", "published": "2016-07-13T21:30:00.000+03:00", "replies_count": 0, "uuid": "ac16386f44b869d1632402b46c2ddb0c597c645f"}, "author": "Sophie Doughty", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-dont-expect-your-hometown-11611090", "ord_in_thread": 0, "title": "'You don't expect this in your hometown': Heaton man tells of shock at Newcastle Airport race attack - Chronicle Live", "locations": ["Newcastle Airport", "Warsaw", "Newcastle International Airport", "Poland", "Heaton", "Newcastle"], "entities": {"persons": [{"name": "heaton", "sentiment": "none"}, {"name": "amir", "sentiment": "none"}, {"name": "wh smith", "sentiment": "none"}, {"name": "amir khan", "sentiment": "none"}], "locations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "heaton", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "northumbria police", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Heaton", "Amir", "WH Smith", "Amir Khan"], "text": "'You don't expect this in your hometown': Heaton man tells of shock at Newcastle Airport race attack 18:30, 13 Jul 2016 Amir Khan, 39, is calling for tighter drinking regulations in departure lounges after a drunken gang hurled vile abuse at him Shares Get daily news by email Amir Khan, from Heaton, who was the victim of racist abuse at Newcastle Airport \nSubjected to vile verbal abuse as he waited for a plane, victim Amir Khan has today hit out against ‘ post-Brexit ’ racists. \nThe 39-year-old was walking through the departure lounge at Newcastle International Airport when a man, who was drinking with a group in the bar, began directing comments towards him. \nAmir, who is of Asian descent but has lived in Newcastle all his life, was stunned that he could be subjected to such cruel abuse in his home city at just 9am. \nAnd today, as police probe the incident, the victim has told how he fears the EU referendum has given some bigots the confidence to express racist views in public. Newcastle International Airport \nHe said: “I do not expect this in my hometown airport. I was really upset and really angry. I have had racist abuse before but this really struck a chord. \n“I do feel like it’s important to make a stand now. There has been so much going on since the referendum and there are people out there who think they can get away with casual racism. \n“It’s really important that anyone who experiences this stands up.” \nAmir, who lives in Heaton , was waiting for a flight to Warsaw in Poland when he encountered the strangers. \n“It was just 9am I was alone and I had a couple of hours to kill,” he said. \n“I walked through the bar area and there was a group of lads drinking. One of them made a racist remark aimed at myself, it was some sort of monkey reference. \n“He was just yards away. Other people heard it. At the time I was really angry. I don’t know what was going through his mind but I think alcohol was to blame. I was more shocked than anything. \n“I was in shock. It took me one or two minutes to get myself together.” Departure lounge at Newcastle International Airport \nFurious Amir decided to confront his abuser and followed him into the WH Smith store. But the man, who had clearly been drinking, denied saying anything, Amir said. \nThe restaurant worker told an airport security guard what had happened, and he got an officer from the police team based in the terminal. \n“He was really good,” Amir added. “He gave me his mobile number.” \nAmir believes the round-the-clock sale of alcohol at the airport could have contributed to the incident and he would like to see new regulations limiting how much can be consumed by passengers. \nNorthumbria Police has confirmed the incident is being investigated. \nA spokesman said: “We received a report that a man had been racially assaulted at around 10am on June 30 at Newcastle International Airport. “Enquiries into the incident are ongoing.” \nAnd a spokesman for Newcastle International Airport added: “We are committed to providing a safe and secure environment without prejudice and ensure all passengers receive the best possible experience when travelling through the airport. \n“As part of this commitment we are working together with all our partners to prevent and minimise the number of disruptive passenger incidents. \n“Staff in the bars and restaurants are trained in the sale of alcohol and we reserve the right to refuse service to any passenger we believe to be drunk.” ", "external_links": [], "published": "2016-07-13T21:30:00.000+03:00", "crawled": "2016-07-13T20:54:47.146+03:00", "highlightTitle": ""}