{"organizations": ["Daily Mail", "EU", "NHS", "UKIP"], "uuid": "182134924f24abeb800815317bbe77d363f42998", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11616438.ece/ALTERNATES/s1200/JS91195470.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-opinion/every-right-keep-banging-lies-11616444", "country": "GB", "domain_rank": 21960, "title": "We have every right to keep banging on about the lies of the Vote Leave campaign", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "We have every right to keep banging on about the lies of the Vote Leave campaign", "spam_score": 0.0, "site_type": "news", "published": "2016-07-14T20:30:00.000+03:00", "replies_count": 0, "uuid": "182134924f24abeb800815317bbe77d363f42998"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/every-right-keep-banging-lies-11616444", "ord_in_thread": 0, "title": "We have every right to keep banging on about the lies of the Vote Leave campaign", "locations": ["Brexit"], "entities": {"persons": [{"name": "matthew elliott", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "douglas carswell", "sentiment": "none"}, {"name": "matt ridley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "daily mail", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Matthew Elliott", "Graeme Whitfield", "Douglas Carswell", "Matt Ridley", "Brexit", "Boris Johnson", "Boris"], "text": "We have every right to keep banging on about the lies of the Vote Leave campaign 18:30, 14 Jul 2016 Journal business editor Graeme Whitfield resists the urge for positivity in the light of the Brexit vote Shares Get   Stefan Rousseau/PA Wire Boris Johnson with the Vote Leave campaign bus \nI have been told a number of times since June 24 that we should all stop talking about the referendum and just make the best of it. \nAfter listening to these arguments, mulling over the reasons postulated for this enforced silence and trying to reason the best way forward, I have decided to respectfully decline. \nThere is a logic, of course, in the argument that we can’t replay the referendum and talking down the country achieves nothing. I am not one of those people who have signed the petition calling for a second referendum, nor do I think that MPs should block what was a democratic vote. \nBut given that the two main planks of the Leave campaign - reducing immigration and spending more money on the NHS - were abandoned within hours of victory, the idea that we should happily accept a campaign based on massive fibs is not one I’m signing up to. \nIf you disagree with me, ask yourself this: if the vote had been 52% in favour of remaining in the EU , do you seriously think Farage, Boris and the Daily Mail would have shrugged their shoulders and said “fair enough”? \nI’m guessing not. What they would have done – rightly – is say that such a close vote showed huge discontent with the EU and it needed huge reforms. \nUsing the same reasoning, the narrow margin of the vote in favour of Brexit has to be taken into account. Exactly how we negotiate our future will be crucial to businesses and workers everywhere and we won’t get the best outcome if we leave it up to the folk whose pants are still on fire after the Leave campaign. \n(It’s worth noting too that the Vote Leave promise to maintain funding to the regions is now worth precisely nowt given that neither the new Prime Minister nor the new Chancellor signed it). \nThe other reason to keep banging on about the Brexit campaign and it’s casual relationship to the truth is this: many of the main Leave campaigners see Brexit as step one on a much larger journey. \nPeople like Vote Leave chief executive Matthew Elliott, our own Matt Ridley and UKIP MP Douglas Carswell are on an ideological mission to roll back the state and promote free trade. \nThey have every right to do that, of course, and some people will agree with them. \nBut those of us who believe unfettered private enterprise can sometimes be a bad thing and that constructive partnerships between the public and private sector are generally better need to have their voices heard. \nGraeme Whitfield is business editor of The Journal", "external_links": [], "published": "2016-07-14T20:30:00.000+03:00", "crawled": "2016-07-14T21:23:45.124+03:00", "highlightTitle": ""}