{"organizations": [], "uuid": "299358b7c80f66d45d4ee07ae1786e2246bd6dbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30464278/16095574.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/stop-delaying-a361-north-devon-link-road-improvement-we-need-it-now/story-30464278-detail/story.html", "country": "GB", "title": "Stop delaying A361 North Devon Link Road Improvement - We Need It...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-01T13:25:00.000+03:00", "replies_count": 0, "uuid": "299358b7c80f66d45d4ee07ae1786e2246bd6dbb"}, "author": "Patrick Phelvin", "url": "http://www.devonlive.com/stop-delaying-a361-north-devon-link-road-improvement-we-need-it-now/story-30464278-detail/story.html", "ord_in_thread": 0, "title": "Stop delaying A361 North Devon Link Road Improvement - We Need It...", "locations": [], "entities": {"persons": [{"name": "patrick phelvin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "brian greenslade", "sentiment": "none"}, {"name": "milton keynes", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "west buckland", "sentiment": "none"}, {"name": "north devon link road", "sentiment": "none"}], "organizations": [{"name": "ministry of transport", "sentiment": "none"}, {"name": "barnstable lib dem", "sentiment": "none"}, {"name": "north devon conservative", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "highways agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stop delaying A361 North Devon Link Road Improvement - We Need It Now By Patrick Phelvin | Posted: August 01, 2017 0 COMMENTS SHARES A familiar sight on the Link Road Stop delaying A361 North Devon Link Road Improvement - We Need It Now X \nCopy link to paste in your message / Comments (0) \nToday DevonLive.com launches a campaign which urges the Government to fast-track improvements to the \"killer\" North Devon Link Road. After yet more tragic deaths on the road politicians of all colours have lent their support to the campaign - We Need it Now. The campaign calls for a timetable to be put together so North Devon residents can have confidence in the programme of delivery of £250m improvements. \nYesterday a mother and two children from Milton Keynes were killed near the West Buckland junction after a head-on collision with a Marks & Spencer lorry. It came just 24 hours after a person was left with life-threatening injuries after an accident nearby. \nBecause the road was \"de-trunked\" over a decade ago it is no longer managed by the Highways Agency and Devon County Council has to go through a lengthy process of applying for Government money to affect change. Read more: Police reveal more details of head-on-crash that killed mum and her 12-year-old twins \nA consultation into the changes ended last week and now the Ministry of Transport will be presented with three options before a decision is made on a preferred scheme. What's worrying those who have campaigned long and hard for the improvements is that there is no set timetable in place for the improvements and with Brexit and internal wrangling there are plenty of distractions in Westminster. \nCounty Councillor Brian Greenslade campaigned against the original design for the North Devon Link Road in the late 1970s and 1980s. He told DevonLive.com that he had always felt the design encouraged dangerous overtaking. \n\"This tragic accident just proves once again that it's a killer road,\" the Barnstable Lib Dem said. \n\"People argue that it's bad driving but the design of the carriageway that just leads to people driving more dangerously than they would on a properly dualled road. Read more: Police investigate sudden death of man in 50s \n\"The trouble is that because it's not a trunk road we're locked into this process whereby Devon County Council has to bid for Government funding, and at a time of cuts and Brexit there are a lot of distractions. \n\"I am pleased that the Journal is launching this campaign - we need to apply as much pressure as possible to ensure these improvements get done as soon as possible.\" \nAlthough acknowledging that investigations were still under way into both incidents, that the causes were yet to be determined and the crashes were a \"tragedy\", North Devon Conservative MP Peter Heaton-Jones said: \"It is an unsafe road.\" \n\"We don't know the causes [of the crashes] at the moment, but people are taking too many risks because there are short overtaking lanes that suddenly merge at not much notice.\" ", "external_links": [], "published": "2017-08-01T13:25:00.000+03:00", "crawled": "2017-08-01T16:43:48.010+03:00", "highlightTitle": ""}