{"organizations": [], "uuid": "9f930af0d34f7d1becec18eefabbcfb58641f1e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13402889.ece/ALTERNATES/s1200/England-v-Spain-UEFA-Womens-Euro-2017-Group-D.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13416269", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: William Hill sees huge rise in betting on women's sports", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-02T10:05:00.000+03:00", "replies_count": 0, "uuid": "9f930af0d34f7d1becec18eefabbcfb58641f1e7"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13416269", "ord_in_thread": 0, "title": "Business Breakfast LIVE: William Hill sees huge rise in betting on women's sports", "locations": [], "entities": {"persons": [{"name": "william hill", "sentiment": "negative"}, {"name": "nathan rose", "sentiment": "none"}, {"name": "charles woodburn", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}, {"name": "graham soult", "sentiment": "none"}, {"name": "rose", "sentiment": "none"}, {"name": "heidi mottram", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}, {"name": "mike watkins", "sentiment": "none"}, {"name": "nielsen", "sentiment": "none"}, {"name": "nathan", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "andy clarke", "sentiment": "none"}, {"name": "philip bowcock", "sentiment": "none"}, {"name": "jordan nobbs", "sentiment": "none"}, {"name": "travis perkins", "sentiment": "none"}, {"name": "mottram", "sentiment": "none"}, {"name": "clarke", "sentiment": "none"}, {"name": "tim cook", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "redworth", "sentiment": "none"}, {"name": "rui", "sentiment": "none"}, {"name": "lucy bronze", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "john carter", "sentiment": "none"}, {"name": "greggs drive-thru", "sentiment": "none"}, {"name": "gary fawcett", "sentiment": "none"}, {"name": "roger whiteside", "sentiment": "none"}, {"name": "heron", "sentiment": "none"}, {"name": "helen dickinson", "sentiment": "none"}, {"name": "steph houghton", "sentiment": "none"}, {"name": "michael heuck", "sentiment": "none"}, {"name": "travis", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "jill scott", "sentiment": "none"}, {"name": "simon arora", "sentiment": "none"}, {"name": "sean clarke", "sentiment": "none"}], "locations": [{"name": "greater manchester", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "newcastle marriott hotel gosforth park", "sentiment": "none"}, {"name": "irlam", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "stirling", "sentiment": "none"}, {"name": "jordan nobbs", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "redworth hall hotel", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "brighton", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "wearside", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "kantar", "sentiment": "none"}, {"name": "harrogate", "sentiment": "none"}, {"name": "great hall", "sentiment": "none"}, {"name": "salford", "sentiment": "none"}, {"name": "brewin dolphin", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "gosforth park", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "coreena ford county durham", "sentiment": "negative"}, {"name": "lidl", "sentiment": "none"}, {"name": "amazon echo", "sentiment": "none"}, {"name": "cts", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "newcastle marriott hotel", "sentiment": "none"}, {"name": "kfc", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cairn group", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "google home", "sentiment": "none"}, {"name": "tottenham", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}, {"name": "gateshead metrocentre coreena ford food", "sentiment": "none"}, {"name": "wickes diy", "sentiment": "none"}, {"name": "asda", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "coreena ford apple", "sentiment": "none"}, {"name": "bae systems", "sentiment": "none"}, {"name": "heron foods", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "costa coffee", "sentiment": "none"}, {"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "spurs and arsenal", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "wickes", "sentiment": "none"}, {"name": "british retail consortium", "sentiment": "none"}, {"name": "bae", "sentiment": "none"}, {"name": "natwest", "sentiment": "none"}, {"name": "northumbrian", "sentiment": "none"}, {"name": "icc", "sentiment": "none"}, {"name": "b&m", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "heron food group", "sentiment": "none"}, {"name": "companies house", "sentiment": "none"}, {"name": "asda", "sentiment": "none"}, {"name": "heron", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "brc", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "coreena ford travis perkins", "sentiment": "none"}, {"name": "woolworths", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford County Durham hotel gets £150,000 investment \nA leisure group has invested £150,000 into a County Durham hotel it acquired last year as part of a £75m deal. \nNewcastle’s Cairn Group snapped up the 134-bedroom Redworth Hall Hotel near Newton Aycliffe last November as part of an acquisition of five properties in County Durham, Stirling, Harrogate, Cardiff and Brighton – a move which added 665 rooms to its now 3,000-room portfolio. \nNow the firm has injected £150,000 into a transformation of Redworth’s great hall in time for a summer season of weddings. Cairn Group has partnered with local suppliers on all decoration, electrical and restoration works to return the hotel – which dates back to 1693 – to its former glory, combining modern design with its historical attributes. The new-look Great Hall at Redworth Hall Hotel (Image: Focal Point Photography) 9.05 Coreena Ford BAE Systems warns of softening in cyber security operations \nDefence giant BAE Systems has seen interim earnings rise 11%, but cautioned over a restructuring at its struggling cyber security operations. \nThe group said it would take a charge in the second half for overhauling its cyber and intelligence arm, where revenues are “softening”. \nBut it expects this hit to be offset by stronger performances elsewhere in the group, helping it meet full-year guidance. \nBAE reported underlying operating profits of £945m for the six months to June 30, up from £849m a year earlier - a rise of 11%, or 5% with a boost from the weak pound stripped out. \nThe weak pound against a strong dollar has helped BAE as it makes sales in the United States more valuable when translated into sterling earnings. \nBAE said it would continue to keep a tight rein on costs, but is hopeful of higher spending worldwide. \nChief executive Charles Woodburn said: “We will continue to focus on efficiency and meeting our customers’ affordability challenges. \n“With the expected improvement in the defence budget outlook in a number of our markets, the group is well placed to continue to generate good returns for shareholders.” \nBAE said the cyber security business needs restructuring to improve returns and pledged an “increasingly focused investment programme in engineering capabilities and product development” to support future growth. \nIts applied intelligence arm, which forms part of the cyber security division, made a loss of £27m in the first half, but it expects the business to be close to an underlying break-even over the full year, with restructuring costs stripped out. \nShares in the group rose 3% after the results as BAE stuck by its guidance for earnings per share growth of between 5% and 10%. 8.58 KEY EVENT B&M buys Heron Foods for £152m \nDiscount retailer B&M has splashed out £152m to buy convenience store operator Heron Food Group as it delves deeper into the grocery sector. \nB&M, itself the subject of takeover speculation, said it would acquire Heron’s 251 stores, which are predominantly found in the North. \nThe acquisition of Heron will enable it to “develop and roll out a complementary, proven and profitable discount convenience grocery brand”, B&M said in a stock market announcement. \nIt added that the combination of the two retailers can deliver a “value proposition” in an expanding sector of the grocery market. Heron reported revenues of £274.4m last year, earnings of £19.1m and a pre-tax profit of £8.6m. \nThe business currently employs around 3,800 people and the deal will be “immediately earnings-enhancing”, B&M added. \nChief executive Simon Arora said: “B&M is already the UK’s leading general merchandise discount retailer, serving four million shoppers per week. \n“The addition of a complementary, proven discount convenience grocery brand to our own structural growth story gives the combined business an even longer, exciting growth runway.” \nHeron is currently managed and owned by Andrew, David and Michael Heuck. \nMichael will retire from the business as planned, while Andrew and David remain in their existing trading and finance roles with Heron. \nB&M said it plans to expand and develop the Heron business, initially through the addition of between 10 and 20 new stores per year. \nLast week shares in B&M rose sharply following reports that supermarket giant Asda is mulling over a £4.4bn takeover of the retailer. Shares were up 0.5% to 361.3p following the announcement. The Heron Foods store in Wallsend, which was previously a Woolworths store. (pic from Graham Soult) (Image: Graham Soult) 8.55 Coreena Ford Pasty lovers' prayers are answered - the Greggs drive-thru service is getting a national roll out \nBakery giant Greggs has confirmed plans to open more drive-thrus across the UK, just a month after launching a successful pilot. \nThe firm, which now has 1,806 shops, opened its first drive-thru last month at a service station in Salford in a bid to experiment with the food-on-the-go format, where the likes of Costa Coffee are now competing with traditional window-counter fast food firms such as KFC and McDonald’s. \nFollowing a successful month, chief executive Roger Whiteside said there is clearly an appetite for more such shops to meet convenience demands from customers. \nHe said: “We opened our first drive-thru shop at Irlam, Greater Manchester, in June and have been encouraged by its popularity, indicating a demand for further drive-thru locations. \n“We are very excited by it – it’s got off to a flying start. It’s been interesting and exciting to see how well customers have taken to it. \n“Customers are very taken by the idea of not having to leave their cars. We wondered if they would be welcoming to do this, and it’s been very positive – I don’t understand why we haven’t done this years ago. \n“We are actively looking for more sites but we will be competing against others looking for more sites. It’s something that’s become more and more prevalent – you’ve even got coffee shops now involved in drive-thrus. \n“The main factor in how customers decide where to shop is convenience, and this is the most convenient – they don’t even have to leave their cars. And they are getting just the same as they would in the store – breakfasts, coffees and so on – so it seems to be the most natural thing to do. The new Greggs Drive-Thru in Irlam, Salford 8.50 Coreena Ford Newcastle fashion website Peek lets shoppers try before they buy \nAn entrepreneur from the North East has launched an online fashion firm with a difference, allowing customers to try before they buy. \nNathan Rose is the brains behind Newcastle-based Peek, an online women’s clothing store which allows those who register with the site to choose items, try them on at home for free and only pay once they decide if they want to keep them or not. \nUsers provide their credit card details at the time they make their orders, and the card is charged within two weeks of the order being delivered, and delivery is free both ways. \nThe process is similar to the one introduced by Amazon for its Prime members earlier this summer. \nMr Rose said: “So often you buy something online and it doesn’t quite fit right or isn’t what you expected, and you have to go through a lengthy process to return it and get a refund. \n“Peek makes this process so much easier as you aren’t paying for items in advance and can return what you don’t want. \n“Customer experience, transparency and innovation are at the heart of everything we do, and we are working with a select number of brands and designers.” \nTo support his business, Nathan joined the Entrepreneurial Spark, an accelerator hub located in the NatWest offices on Newcastle’s Quayside. Nathan Rose carries out a pitch about his fashion firm Peek (Image: Peek) 8.45 Coreena Ford The search is on to find the top business executive in Durham and Wearside \nThe hunt to find the best business executive in Durham and Wearside has been launched, with last year’s winner a tough act to follow. \n12 months ago, Northumbrian Water CEO Heidi Mottram won not just the Durham and Wearside award but also the main prize at the North East Business Executive of the Year event. \nMs Mottram was praised for her inspirational leadership and closeness to her employees, as well as her contribution to the region as a whole through a number of business and community org­anisations. \nHer successor as the top executive in Durham and Wearside will take on counterparts in Tyneside and Northumberland, and Teesside, to win the overall prize at the awards, which are being held at the Newcastle Marriott Hotel, Gosforth Park on November 9. \nThe awards are organised by The Journal and our sister paper, The Gazette in Middlesbrough, and are held in association with sponsors Brewin Dolphin. \nAs well as the three area prizes, there are awards for young business person of the year, non-executive director of the year, plus a lifetime achievement award. Gary Fawcett, divisional director from Brewin Dolphin, said: “Whether in Durham and Wearside, Teesside or Tyneside and Northumberland, there’s always a number of standout nominees for the award of Business Executive of the Year. \n“Each year, I think the stories behind the successes are as good as they’re going to get, and then each year we’re surprised that they are surpassed. \n“We are a region that shows resilience, passion and a drive to be the best, and those nominated demonstrate this perfectly. The 2016 North East Business Executive of the Year Awards at the Newcastle Marriott Hotel Gosforth Park. Heidi Mottram won the Durham and Wearside award and also the main prize (Image: The Chronicle) 8.40 KEY EVENT Supermarket giant Asda begins turnaround after tough 2016 \nAsda has laid bare a tough 2016 in which sales and profits collapsed as the firm came out worse for wear in Britain’s supermarket wars. \nThe Walmart-owned firm saw sales drop 3.2% to £21.7bn in the year to December 31, while pre-tax profits crashed almost 19% to £791.7m. \nLike-for-like sales also plummeted by 5.7%, according to accounts filed at Companies House. \nThe figures crystallise a torrid time for the grocery giant, which has reported 11 consecutive quarters of sales declines. \n“The grocery market has continued to experience low growth throughout the year and competition in the sector has remained intense. \n“Our sales performance, relative to the market, was behind our expectations,” the company said. \nHowever, Asda added that despite the disappointing results, there are signs that turnaround efforts under new boss Sean Clarke are beginning to bear fruit. The group pointed to the final quarter of 2016, when it said improvements in ranges and price cuts were paying off. \nMr Clarke, who took up the reins last summer after being parachuted in to replace previous boss Andy Clarke, has slashed the prices of everyday items as he attempts to arrest falling sales. \nThe chain reported a 2.8% fall in like-for-likes sales in its first quarter of this year, a moderate improvement on the previous period, which saw sales fall 2.9%. Last August Asda posted its worst ever quarterly sales fall of 7.5%. \nAsda’s share of the market fell 0.9% to 15.7% last year, according to Kantar. \nAll of the so-called Big Four supermarkets, Tesco, Asda, Sainsbury’s and Morrisons, have suffered as German discounters Aldi and Lidl have gobbled up market share. ASDA at Gateshead Metrocentre Coreena Ford Food price inflation is slowing as currency pressures ease \nFood prices have rolled back from a three-and-a-half-year high as pressure from the Brexit-hit pound eased last month, new figures show. \nOverall shop prices fell by 0.4% in July in contrast to 0.3% the month before, according to the latest BRC-Nielsen Shop Price Index. \nGrowth in the cost of food slowed to 1.2% last month after reaching its highest level since January 2014 throughout May and June at 1.4%. \nFresh food prices also decelerated to 1% in July, following growth of 1.4% in June. \nHelen Dickinson, chief executive of the British Retail Consortium (BRC), said: “July saw lower food price inflation than in June, bringing the march of overall shop prices towards inflationary territory to a halt, for now at least. \n“Lower food price inflation in July was, in part, the result of the easing of upward pressure from the currency depreciation on fresh food. “Shorter stock cycles in fresh food mean that more of the impact of the currency depreciation fed through into inflation earlier in the year and hence it is now subsiding. “However, the upward pressure on food inflation has not entirely disappeared: ambient food prices are still affected and as seasonal pricing dynamics play out, we could see fresh food inflation pick up again.” \nThe update comes after official figures showed that inflation unexpectedly slowed in June to 2.6%, after hitting a near four-year high of 2.9% in May. \nUpward pressure on everyday prices came from food, which saw costs ease back by a smaller 0.3% in June compared with a 0.4% fall for the same month in 2016. \nFocusing on the BRC-Nielsen results, Mike Watkins, head of retailer and business Insight, Nielsen, said: \nThe amount of inflationary pressure coming from retail remains less than from other elements of the economy and in the last few weeks, whilst we have seen a return to more normal weather, the level of consumer demand remains unpredictable. \nWhich means retailers are cautious about passing on price increases, in particular at key retail price points. \nSo promotional activity is still an important stimulant of demand as consumers become more cautious in the face of higher living costs. 8.20 Coreena Ford Apple posts bigger than expected revenue rise \nApple beat analysts’ expectations in its latest financial results as the technology giant’s revenue rose 7% on last year. \nThe iPhone maker announced revenue for the last quarter of $45.4bn (£34.4bn), up on the $42.4bn (£32.1bn) posted a year ago. \nMarket analysts had predicted revenue of around $44.95bn (£34bn). \nThe company’s net income also increased to more than $8.7bn (£6.5bn) - compared to $7.8bn £5.9bn) in the same period in 2016. \nThe firm’s chief executive Tim Cook said: “With revenue up 7% year-over-year, we’re happy to report our third consecutive quarter of accelerating growth and an all-time quarterly record for services revenue. “We hosted an incredibly successful worldwide developers conference in June, and we’re very excited about the advances in iOS, macOS, watchOS and tvOS coming this fall.” \nIn September, Apple is expected the launch the next version of the iPhone, with up to three new devices rumoured to be on the way. \nReports suggest a special edition smartphone to mark the iPhone’s tenth anniversary could be unveiled alongside the iPhone 7s and 7s Plus. \nApple sold more than 41 million iPhone handsets in the last quarter, as well as 11.4 million iPad units. \nThe tech giant will also launch a new product line in December, when its HomePod smart speaker - complete with virtual assistant Siri integrated into the device - goes on sale to rival the likes of the Amazon Echo and Google Home. The Apple iPhone is approaching its 10th anniversary (Image: Yui Mok/PA Wire) 8.17 What's the FTSE latest? \nThe FTSE-100 index opened at 7423.66. \nThe pound at 8am was 1.3216 dollars compared to 1.3205 dollars at the previous close. The euro at 8am was 0.8956 pounds compared to 0.8933 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.15 Coreena Ford Travis Perkins hikes up prices amid Brexit effect \nBuilders’ merchant and Wickes DIY chain owner Travis Perkins has said it hiked prices to offset soaring costs from the Brexit-hit pound as it posted a 4.5% fall in half-year profits. \nThe group reported pre-tax profits of £168m for the six months to June 30, down from £176m a year earlier. \nIt said trading volumes were hit by price rises to offset “pronounced” input costs caused by the pound’s slump since the Brexit vote and rising commodity prices. \nBut the group said its action helped protect profit margins, although results were weighed down by its struggling plumbing and heating arm, where earnings dived 32% to £13 million. \nTravis outlined a turnaround plan for the division, including integrating its City Plumbing and CTS branch network to be run under a single management team. It will also overhaul its ranges, pricing and online offering, while setting up a dedicated supply chain. \nTravis chief executive John Carter said the overall group performance was “solid” against a “challenging market backdrop of pronounced input cost inflation and market volatility”. \nHe added: “The group made a conscious decision to recover input cost inflation selectively through disciplined pricing activity. “Whilst this had some impact on trading volume, it enabled us to maintain group gross margins and positions the business well for the future.” \nThe Wickes and Toolstation consumer division continued to buoy overall results, with underlying earnings up 2.3% at £45 million and like-for-like sales 4.7% higher. Travis Perkins store (Image: Rui Vieira/PA Wire) 8.10 KEY EVENT William Hill sees big rise in women's sport betting \nBookies William Hill has seen a surge in betting on women’s sports, with record amounts being placed on big cricket and football games. \nA record £3m has been wagered on the ICC Cricket World Cup - an increase of 90% - and if the England team, including the region’s Jill Scott, Lucy Bronze, Steph Houghton and Jordan Nobbs, get to the final of the Uefa Women’s Euro 2017 football championship - all of which has been televised - William Hill expects more than £3m in stakes - up 100%. \nMeanwhile, a strong end to the Premier League season from London clubs Chelsea, Arsenal and Tottenham helped dent profits at the firm in the first half of the year. \nThe bookmaker reported an 11% fall in pre-tax profits to £109m in the six months to June 28, while revenue grew 3% to £837m. \nOn an adjusted basis, operating profit fell 1% to £129.5m. \nThe group said “unfavourable” football results in the later stages of last season - including champions Chelsea winning six games in a row - were partly to blame for the profit fall. \nPunters also cashed in at the firm’s expense when Spurs and Arsenal notched up victories in five out of six games at the end of the season. Chief executive Philip Bowcock focused on the rise in revenue and the group’s online performance. \nHe said: ““The first half of 2017 has seen good progress against our three strategic priorities and wagering growth across all four divisions. \n“Our product improvements combined with improved marketing have seen both existing customers respond positively and the number of new customers start growing again during the period. As a result we are seeing good momentum building in Online’s performance. \n“In Retail we made market share gains, with growth in both sports betting, despite the lack of a major international football tournament, and gaming revenues. Internationally, our US business continues to perform well and in Australia, with the upcoming Spring Carnival key to the full-year results, we are competing hard and diversifying our product range. \n“Earlier in the year we targeted £40m of annualised savings as part of our transformation programme and we are on track to deliver this by the year-end. In addition to these savings, the programme has sparked initiatives to further improve our products and customer experience, accelerate our top-line growth and increase efficiency. We are confident about delivering a good outturn in 2017 and beyond. Jordan Nobbs, of Teesside, who helped England reach the Uefa semis in the 1-0 win over France (Image: Getty Images Europe) Share", "external_links": [], "published": "2017-08-02T10:05:00.000+03:00", "crawled": "2017-08-02T11:24:37.002+03:00", "highlightTitle": ""}