{"organizations": [], "uuid": "0e218f50127e01a3e4eff97fbf9a977e8a85ae30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30477032/16103692.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/you-can-prove-just-about-anything-with-a-google-search/story-30477032-detail/story.html", "country": "GB", "title": "Patrick Phelvin published You can prove just about anything with a Google search", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-10T11:27:00.000+03:00", "replies_count": 0, "uuid": "0e218f50127e01a3e4eff97fbf9a977e8a85ae30"}, "author": "Patrick Phelvin", "url": "http://www.devonlive.com/you-can-prove-just-about-anything-with-a-google-search/story-30477032-detail/story.html", "ord_in_thread": 0, "title": "Patrick Phelvin published You can prove just about anything with a Google search", "locations": [], "entities": {"persons": [{"name": "patrick phelvin   by bill martin", "sentiment": "none"}, {"name": "patrick phelvin", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "country land and business association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "You can prove just about anything with a Google search By Patrick Phelvin | Posted: August 10, 2017 By Bill Martin 0 COMMENTS SHARES You can read about the health benefits of wine in numerous online articles - or about how bad it is for you You can prove just about anything with a Google search X \nCopy link to paste in your message / You can read about the health benefits of wine in numerous online articles - or about how bad it is for you Comments (0) \nI reckon these days you can prove just about anything you want. \nThat's the beauty of the internet. Take for example my new health regime, (which in low moments feels like living like a dull monk). There are zillions of articles all over the world wide web that propound the best way to lose belly, fat, the key to the ultimate beach body, how to improve your sex life, and how to live forever. \nThere are diets, exercise regimes, recommended retreats, tips, hints and pointers that number infinity plus one (remember that one at school?). \nRead more Fitness boost for Tiverton as council looks into trim trail to help get townsfolk into shape \nVenture into social media, and YouTube, and you will find oceans of content and tens of thousands of bloggers keen to impart how we can all live more healthily, lose weight, and not get ill. \nThe whole lot could be distilled into the very simple eat well, take exercise and don't drink too much (smoking's a complete no-no). Or could it? \nThat's the thing with the net see. Google \"Is exercise bad for you,\" and there's plenty of content out there to evidence your couch potato argument. \"Too much exercise bad for your gut,\" and \"Good news teenagers, exercise can be bad for you\", were two of the first headlines I found. \nWhat about booze? Oh Yes. \"Cheers! Alcohol IS good for you,\" and \"eight reasons drinking alcohol is actually good for you,\" are the headers on articles just waiting to be consumed with a large glass of dry white. Chocolate? Yep. There at least ten reasons why. Smoking? Yes, even smoking. \"60 reasons for not smoking and 100 reasons to keep on smoking,\" being my ludicrous favourite. \nIf you work in the media you get familiar with surveys and polls that \"prove\" things. In the last week I have received press releases about surveys that prove how much we like to go on holiday in the UK, how messy our cars are, and how we all dream of a having a different bedroom (I kid you not). \nRead more Mulled gin is set to be the next craze and will go on sale in time for Christmas 2017 \nSo it was with a very thick pair of cynical goggles that I viewed this week's survey from the Country Land and Business Association. \nMore than eight out of ten (84%) people in a poll revealed they believe the Government should be spending money on maintaining the countryside. \nSome 40% said they believed that the Government's current spend of £3 billion per year on the countryside was the right amount, while 21% thought it was not enough. \nI'd love to think that is true, but balanced against another survey published this week that showed one in eight young people had never seen a cow in real life – and the amount of litter I seen strewn across Dartmoor every day – I doubt it. \nRead more Shops sells beer and doughnuts for dogs - so of course it has a slimming club as well \nIn this case though, it doesn't really matter what the survey says. The real truth is that Brexit, and our plans for it, is in chaos. It's not so much the decision, but the fact there seems to be no plan. I say seems, because it is beyond comprehension that there really is no plan. If there is one, I wish someone would tell us what it is. \nMy fear is that the real truth is that there isn't one. Even a Google search can't help with that. ", "external_links": [], "published": "2017-08-10T11:27:00.000+03:00", "crawled": "2017-08-10T12:04:44.012+03:00", "highlightTitle": ""}