{"organizations": [], "uuid": "1e02e63fdeb46715476d5f78f0a5a25be0e44737", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/sport/football/football-news/article269315.ece/ALTERNATES/s1200/davidwheeler.jpg", "site_section": "http://www.westernmorningnews.co.uk/exetercity.rss", "section_title": "devonlive - Sport", "url": "http://www.devonlive.com/sport/football/transfer-news/what-can-qpr-fans-expect-399491", "country": "GB", "title": "What can QPR fans expect from Exeter City's David Wheeler?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-30T14:06:00.000+03:00", "replies_count": 0, "uuid": "1e02e63fdeb46715476d5f78f0a5a25be0e44737"}, "author": "David Byrom", "url": "http://www.devonlive.com/sport/football/transfer-news/what-can-qpr-fans-expect-399491", "ord_in_thread": 0, "title": "What can QPR fans expect from Exeter City's David Wheeler?", "locations": [], "entities": {"persons": [{"name": "david wheeler", "sentiment": "none"}, {"name": "paul tisdale", "sentiment": "none"}, {"name": "donald trumpy", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "wheeler", "sentiment": "none"}, {"name": "jayden stockley", "sentiment": "none"}], "locations": [{"name": "exeter city", "sentiment": "none"}, {"name": "loftus road", "sentiment": "none"}, {"name": "portsmouth", "sentiment": "none"}], "organizations": [{"name": "qpr", "sentiment": "none"}, {"name": "blackpool", "sentiment": "none"}, {"name": "grimsby town", "sentiment": "none"}, {"name": "yeovil town", "sentiment": "none"}, {"name": "city", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What can QPR fans expect from Exeter City's David Wheeler? The winger is set to undergo a medical at Loftus Road today Share \nDavid Wheeler is set to undergo a medical at QPR today ahead of a permanent move to the Championship club. \nYet what can Hoops fans expect from the Exeter City star? \nAerial ability \nThe winger’s aerial ability is one of his biggest assets. He has a brilliant leap that sees him tower above many other players on the pitch, whilst he also times his jumps well. This has given the Grecians an outlet on the wing for the past few seasons, seeing them play a lot of diagonal balls forward to Wheeler, who will often be able to beat the full-back in the air and head the ball inside to a striker. This has also seen him become a major threat from corners, winning a number of near-post flick-ons. Read More Jayden Stockley spotted in Exeter City tracksuit at Checkatrade Trophy game against Yeovil Town \nA great finisher \nWheeler’s ability to finish chances has really come on leaps and bounds over the past couple of years, leading him to top the Grecians’ goal-scoring charts last season. His goal against Blackpool in the League Two play-off final shows how good he is at taking chances, whilst he also broke City’s record for goals in consecutive matches, netting eight in seven games during a particular hot streak in January last season. Being quick, he can also capitalise on defensive errors, as he did against both Grimsby Town and Portsmouth, latching onto loose balls before nipping in behind the defence and finishing well. \nVersatility \nHis aerial and scoring abilities mean Wheeler can also fulfil a number of different positions. Primarily operating as an attacking winger, he has also gone up front in matches, being used as a target man, whilst he can also play at wing-back. This versatility has come in handy for City boss Paul Tisdale, who has been able to switch shape during matches and utilise Wheeler in different roles during the same game. Read More David Wheeler to undergo medical at QPR as fee for Exeter City star agreed \nPolitical opinions \nWheeler has written a column for Devon Live for the past two seasons – yet it’s not been a standard footballer’s column. As well as talking about all things City, Wheeler has railed against Brexit, Donald Trumpy and austerity, giving his thoughts on a number of different political situations and backing a left-wing alliance in the last general election. Like us on Facebook", "external_links": [], "published": "2017-08-30T14:06:00.000+03:00", "crawled": "2017-08-30T14:25:10.003+03:00", "highlightTitle": ""}