{"organizations": [], "uuid": "fc6e9b4f65b515616a691d3c6f605013b38a812e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11518029.ece/ALTERNATES/s1200/JS93351693.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/britain-would-voted-remain-been-13448875", "country": "GB", "domain_rank": 21960, "title": "Britain would have voted to Remain had it been better educated, academics claim", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-08T20:00:00.000+03:00", "replies_count": 0, "uuid": "fc6e9b4f65b515616a691d3c6f605013b38a812e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/britain-would-voted-remain-been-13448875", "ord_in_thread": 0, "title": "Britain would have voted to Remain had it been better educated, academics claim", "locations": [], "entities": {"persons": [{"name": "stefan rousseau/pa wire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "zhang", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "aihua zhang", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "camden", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "university of leicester", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Britain would have voted to Remain had it been better educated, academics claim New research suggests the nation would have voted against Brexit if more of us had gone to university Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe UK could have voted against Brexit if voters had been better educated, academics have said. \nA new paper suggests that a university education was the “predominant factor” dividing those who voted Remain and those who voted Leave. \nIt even made more difference than age or income, according to the document. \nAnd if just 3% more people had gone to university then the results of last year’s EU referendum , when the UK voted to quit the EU, could have been different. \nThe findings were published by academics from the University of Leicester. Boris Johnson visiting Newcastle on the Vote Leave campaign (Image: Newcastle Chronicle) \nThey produced data showing that cities such as Sunderland have a relatively low proportion of people who have been through higher education and voted to leave the EU - while areas such as Lambeth and Camden in London have a high proportion of graduates and voted to remain. \nKey findings included: \n• An increase of about 3% of British adults accessing to higher education in England and Wales could have reversed the referendum result \n• A decrease of about 7% in turnout in England and Wales could have also changed the result of the referendum \n• Age did have an impact on voting patterns, with older people more likely to vote to leave, but the impact of age has been exaggerated \n• Sex is found to be a statistically significant factor but whether a person was born in the UK and their income level were both insignificant factors. \nMaps produced by the academics show that 19% of the population in Tyneside, which voted to leave, had a university education. \nBut 31% of people in York, which voted to remain, went to university. Read More Newcastle MP delivers her verdict on Theresa May's first year as Prime Minister \nOne exception to the rule was Newcastle , where 25% of people had a university education and a small majority voted to stay in the EU. The proportion who had been to university here was lower than in most remain-voting areas. \nThe study, by Dr Aihua Zhang, of the University of Leicester’s maths department, analysed voting data from the EU referendum and statistics from the 2011 census, taking into account factors such as sex, income level, education, age and employment. \n“Higher education is found to be the predominant factor dividing the nation, in particular in England and Wales, between Remain and Leave,” the paper says. The Union Jack flies behind the European Union flag (Image: Stefan Rousseau/PA Wire) \n“This analysis demonstrates highly significant evidence that university-educated British people tend to vote consistently across the UK for Remain. \n“It can be speculated that, as much of the Leave campaign was characterised by emphasising detrimental factors (such as immigration or the recession of the economy), the university-educated voters seem to be more immune than those who do not have university education to this kind of campaign. Read More Could the UK stay in the European Union after all? That's the question being asked at Westminster \n“The marginal effect of higher education on the referendum decision is much stronger than any other factors in England and Wales, where most Leave voters reside.” \nThe study, published in World Development journal, also concludes that a decrease in turnout in England and Wales of around 7% could have altered the outcome of last year’s vote. \n“The effect of voter turnout is one of the significant factors influencing the referendum result,” Dr Zhang’s paper said. \n“The high overall turnout actually benefited Leave with a big proportion of the turnout being from enthusiastic Leave supporters, with a corresponding under-turnout of Remain supporters. Read More UK must agree basic Brexit deal 'later this year' or face running out of time \n“This could indicate that the Leave campaign was more effective in mobilising their support base, but may also explain that regardless of the effectiveness of the campaigns, the Leave voters felt stronger about the factors affecting Leave than did the Remain supporters.” Like us on Facebook", "external_links": [], "published": "2017-08-08T20:00:00.000+03:00", "crawled": "2017-08-08T22:17:11.006+03:00", "highlightTitle": ""}