{"organizations": [], "uuid": "1b200e0bd708c44f44d0974f93d44ad40def9f33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13456596.ece/ALTERNATES/s1200/rkr_nec_090817veg.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/need-find-way-forward-north-13456592", "country": "GB", "domain_rank": 21960, "title": "We need to find a way forward for the North East's small farms - or they could be at risk", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-10T20:00:00.000+03:00", "replies_count": 0, "uuid": "1b200e0bd708c44f44d0974f93d44ad40def9f33"}, "author": "Kate Thick", "url": "http://www.chroniclelive.co.uk/business/farming/need-find-way-forward-north-13456592", "ord_in_thread": 0, "title": "We need to find a way forward for the North East's small farms - or they could be at risk", "locations": [], "entities": {"persons": [{"name": "ian dodds", "sentiment": "negative"}, {"name": "mike leigh", "sentiment": "none"}, {"name": "prof lang", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northern europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "dunkirk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "eurostat", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Opinion Vegetables from the farm of Ian Dodds, of North East Organic Growers (Image: Supplied pic. Free to use.) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIt is said the extermination of wolves in 1209 allowed England to become a giant sheep farm. \nWhile treating a just-about-managing farmer with back pain last Saturday, I asked if there was any sign of the rural equivalent to Mrs May’s industrial strategy. He laughed. \nNot previously known for devotion to things green, Environment Secretary Michael Gove is tasked with realising Brexit’s promised sunny uplands while ensuring we don’t end up with a rustic equivalent of an industrial wasteland. \nBefore the farmer arrived, I listened to a debate on the radio about food. \nFood is one of the major drivers of climate change, water stress, biodiversity loss, soil erosion and deforestation. Furthermore, modern diets are the single biggest factor in premature death worldwide, and a key indicator of social inequalities. Food, the biggest employer on the planet, is low-wage work. In the UK, farm work, food production and retailing all pay below the national average yet food and drink is the UK’s largest remaining manufacturing sector. \nProf Lang of the Centre for Food Policy says the way forward for nutrition has long been clear: an increased intake of plant-based foods – vegetables, fruits and wholegrains – with limited meat, processed foods and sugary foods. Read More Mike Leigh's Peterloo film could do for Labour what Dunkirk has done for Brexit \nI met Ian Dodds, a member of North East Organic Growers, a cooperative founded in 1995 which survives without subsidies. It grows about 50 different varieties of fruit and vegetables, several of which you won’t find in supermarkets. It imports some produce, particularly between April and July. Problems come from the weather and the clay soil hereabouts. The soil is cultivated in rotation with grass and clover, and the perimeter of the cooperative’s 10-acre farm is planted with trees to aid water drainage. \nIan said, “We produce high yields of vegetables with no artificial chemicals and with reduced greenhouse gas emissions and food waste. Only 3% of farmland in the UK is organic but British consumers are demanding more organic produce.” \nAbout 50% of the food we eat is produced here; we depend on European imports for a quarter of our consumption. Full self-sufficiency is unrealistic and we need to trade food across different, now volatile, climates or expect shortages and price hikes. \nAs farmers know all too well, fewer than a dozen companies control more than 90% of the food retail market. Even if you reduce profits made by processors and retailers, most farmers cannot survive without EU subsidies. Despite Common Agricultural Policy (CAP) money, Britain’s agricultural sector ranks fourth from bottom among the 28 EU states in terms of annual productivity. \nThe countryside has become another Brexit battleground: abandon farming and import cheap, unhealthy food, or develop a national food system. \nMarkets are forcing farmers to scale up; smaller farms are disappearing. The culprit is not the constraints imposed on national governments by regional integration, it is governments failing to implement domestic policies to remedy distorted, unfettered markets and to help people in distress. \nBrexit-fuelled megafarms would be bad news for rural life and tourism, the environment and, of course, animals. We could produce less meat. Meat is a luxury for low-income families who already spend proportionately more on milk, eggs and bread, staples hit by rising prices. \nTo Gove’s credit, he recognises that a cheap food policy may not be quite the bonanza Brexiteers tout, and knows ending free movement would be catastrophic for horticulture and food processing. \nGove wants to replace subsidies with a system of payments for public goods, rewarding environmental benefits rather than land ownership. Great, but this could accelerate the demise of the smaller, especially upland, farms distinctive of our landscape. \nThe majority of UK lamb goes to Europe so these changes could kick-start the rewilding of Britain’s uplands; arguably no bad thing as Britain is one of the most nature-depleted countries in the world with, according to the State of Nature 2016 report, more than one in seven species facing extinction and more than half in decline. Read More The Government's rail priorities show that London will always trump the North \nBeside climate change, deforestation and industrialisation, most of the blame is directed at modern agricultural techniques – intensification of grazing, pesticides and fertilisers and loss of marginal habitats. The report said EU environmental stewardship schemes carried out by some farmers are beneficial but can be poorly implemented and remain at a small scale. \nGood food produced to a high standard and better farmed environments are expensive and should be valued, which is why the CAP evolved and is still evolving. \nBrexit will not just affect the countryside in terms of a withdrawal from the CAP and related vital regulation, but will likely highlight the gradual unravelling of rural life – closing services, few jobs and affordable homes and poor transport infrastructure. \nEurostat figures show nine of the 10 poorest regions in northern Europe are in Britain. Geordie dynamism and EU regional funds have done more for the North East than our governments. \nThe countryside cannot just be the playground of the retired and wealthy; if a productive sector of the population cannot afford to live here, how can rural enterprises like Ian’s flourish? Organic and agro-ecological farming, niche products, crops for ornamental and pharmaceutical purposes or energy and other initiatives remain on the fringes and insufficiently supported. \nBrexit and turning Gove’s hazy vision into reality are gargantuan tasks. DEFRA couldn’t even manage to pay out EU subsidies on time so don’t count your unchlorinated chickens before they hatch. \nThe EU has long understood the CAP needs to become fairer and greener; it was always going to be reformed, albeit too slowly, regardless of whether the UK stayed or left. It is a mystery to me why farmers voted to leave. Many do well from membership; subsidies make up, on average, 54% of their income and the EU takes 62% of British agricultural exports. \nUnsurprisingly, the European Parliament’s agriculture committee insists that the next reform in 2020 does more to help small farms and protect the environment; sadly the UK will be neither a contributor nor a beneficiary. Like us on Facebook", "external_links": [], "published": "2017-08-10T20:00:00.000+03:00", "crawled": "2017-08-10T20:38:05.000+03:00", "highlightTitle": ""}