{"organizations": [], "uuid": "b7d4cff27dcf2a6c60aa80100cabb4d880bfc538", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article7158499.ece/ALTERNATES/s1200/Jonathan-Arnott.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/im-going-carry-voting-cut-13552106", "country": "GB", "domain_rank": 21960, "title": "I'm going to carry on voting to cut EU budgets - even though I know I'll be voted down", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-30T23:00:00.000+03:00", "replies_count": 0, "uuid": "b7d4cff27dcf2a6c60aa80100cabb4d880bfc538"}, "author": "Jonathan Arnott", "url": "http://www.chroniclelive.co.uk/news/north-east-news/im-going-carry-voting-cut-13552106", "ord_in_thread": 0, "title": "I'm going to carry on voting to cut EU budgets - even though I know I'll be voted down", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european network", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "council", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nIn Greek mythology, Sisyphus was condemned to the task of pushing a boulder up a hill for eternity. \nWith the European Union it’s water it feels like we’re trying to push uphill. From the ever-expanding timescales on Brexit to the European Union’s ransom demand for tens of billions of pounds (there is no legal basis upon which they can credibly claim it’s owed), the whole thing is moving in slow-motion. \nAfter the Brexit vote, the sense of limbo has only increased. In 2018 we’ll still be in the European Union , like it or not. We’re within a two-year negotiation period for withdrawal which - if recent developments are any indication - will then lead to transitional arrangements designed to ensure withdrawal happens at a snail’s pace. Hurrying this process along would be no bad thing. \nBecause we’ll still be in the EU in 2018, we’ll continue paying the membership fee. That fee is huge. It is (gross) in the order of £350m per week, the figure which Vote Leave controversially quoted but has repeatedly been pilloried for failing to make it abundantly clear during the referendum campaign that only the net figure – roughly half – could actually be saved by leaving. \nIn every interview I did during the referendum campaign, I was careful to make this distinction. \nI wonder why the even more outrageous Remain claims receive a free pass from scrutiny. Unemployment has fallen to its lowest level for over 40 years since the referendum, not gone up by 500,000 as claimed. \nNissan, which Remain insisted would leave the UK, has just announced yet another expansion. It’s fair to criticise Vote Leave, but unfair to do so in isolation: the worse dishonesty from Remain has gone unchallenged. They claimed these negative effects would start from referendum day, not the day we leave, those predictions already proven not just misleading but false. \nAs a member of the European Parliament I’m stuck in my current role. Resign, and I’d be replaced by someone else from the same party. If they all resigned, we’d spend millions on a meaningless by-election. So here I am, for better or worse, and there’s work to do. \nWe’re still in the EU, our membership fee’s going up, and one of the few powers of the European Parliament is that it has a say in the EU’s budget for 2018. We’re still paying so we must still have a say. This week my job involves submitting hundreds of amendments to that budget which would save an amount roughly equivalent to our net membership fee. \nThe 103-page closely-typed ‘summary’ of the 1,672-page document sits on my desk; each line to scrutinise represents another spend of taxpayers’ money. \nToday the ‘Farmhouse and Artisan Cheesemakers’ European Network - Project involving the production of European guidelines for proper hygienic practice’ takes the biscuit. On line 16 03 02 05 the Council and Commission are squabbling over whether 6.5 or 7.5 million euros should be spent on public opinion analysis under the ‘Security and Citizenship’ heading. I propose a more reasonable figure: zero. \nAnd, just like Sisyphus would watch the boulder roll back down the hill once he’d almost reached the top, I know that any proposal to save money will be voted down by the European Union. Last year, they bundled them together and voted them all down at once. Morally, it still makes sense to try: that’s our money being wasted. Read More Failing Brexit talks could do long term damage to North East economy \nI didn’t get involved in politics because I wanted to become a politician. I hate the nasty back-stabbing greasy-pole-climbing treachery-rewarding culture which pervades traditional political parties. I don’t always agree with my own party: my principles have not changed since 2014; theirs have. I got involved in politics because if you could somehow distil away the nastiness and all the negativity which people (rightly now) associate with politics, it should be a way to help people, to make a difference. \nI feel we made a difference with Brexit; the cosy political establishment still hasn’t recovered from the shock. It’s easy enough to look like you’re making a difference – writing articles, doing speeches, proposing amendments, speaking to people – but I’m honest enough to admit that in a European Parliament we’re going to leave, it’s incredibly difficult to actually transform people’s lives. \nUnless, of course, you adhere to the view that the State should take more of your money to use on underperforming projects of questionable benefit to other people. \nAll I can do is draw a marker in the sand, and keep opposing the worst excesses of the nonsense until we finally get our Brexit. \nJonathan Arnott is Ukip MEP for the North East. Like us on Facebook", "external_links": [], "published": "2017-08-30T23:00:00.000+03:00", "crawled": "2017-08-30T23:31:16.005+03:00", "highlightTitle": ""}