{"organizations": [], "uuid": "4a8acc16160673ac0c7829823ba20cfc20947ff8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9795935.ece/ALTERNATES/s1200/JS69514765.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/bumper-north-east-deals-paint-13490590", "country": "GB", "domain_rank": 21960, "title": "Bumper North East deals paint a positive picture but a bumpy ride lies ahead, report reveals - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.737, "site_type": "news", "published": "2017-08-17T15:46:00.000+03:00", "replies_count": 0, "uuid": "4a8acc16160673ac0c7829823ba20cfc20947ff8"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/bumper-north-east-deals-paint-13490590", "ord_in_thread": 0, "title": "Bumper North East deals paint a positive picture but a bumpy ride lies ahead, report reveals - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "erwin hymer", "sentiment": "none"}, {"name": "helen mcardle", "sentiment": "none"}, {"name": "paul mankin", "sentiment": "none"}, {"name": "parkdean", "sentiment": "none"}], "locations": [{"name": "fastflow", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "quantum pharma", "sentiment": "none"}, {"name": "csr", "sentiment": "none"}, {"name": "o’brien waste recycling", "sentiment": "none"}, {"name": "cav advanced technologies", "sentiment": "none"}, {"name": "biffa", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "lianhe chemical", "sentiment": "none"}, {"name": "barratt developments", "sentiment": "none"}, {"name": "turbo power systems", "sentiment": "none"}, {"name": "explorer group", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "clearly drinks group", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "northedge capital", "sentiment": "none"}, {"name": "innovia", "sentiment": "none"}, {"name": "onex", "sentiment": "none"}, {"name": "mbo", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nomad digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Bumper North East deals paint a positive picture but a bumpy ride lies ahead, report reveals Some £2.26bn of deals were carried out in the first half of 2017, but tricky times could be around the corner, says PwC's Paul Mankin Share Paul Mankin, corporate finance partner at PwC in Newcastle Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIn the first half of 2017 deal activity across the North East returned to relative ‘normal’ levels following the record number of deals recorded in the last quarter of 2016 with 68 deals completing with a total disclosed deal value of almost £2.26bn. \nThe second quarter of the year was quieter than the first with 31 deals completed compared to 37 in the first quarter which could be accounted for by the increased levels of uncertainty in the market caused by the General Election and following on from the Brexit vote last year. \nOur sizeable graphic detailing the mergers, acquisitions and IPOs shows a variety of activity, with notable deals including the Adderstone Group-backed MBO of Turbo Power Systems and NorthEdge Capital’s investment in Sunderland drinks firm Clearly Drinks Group. \nExpectation may have predicted that investment decisions would be put on hold but it appears that the deal volumes seen provide a clear indication that buyers and sellers are realising that to some extent there appears little to be gained by adopting ‘a wait and see attitude’. \nHistorically the second half of the year is usually busier from a deals perspective with the last few months showing increased activity so it’s probably too early to say if overall numbers will be down compared with those in 2016. My general sense is that if anything both underlying deal activity and confidence in the market is high but that it is at the smaller end of the deals market where volumes are being impacted by economic uncertainties. \n2016 was a record year for private equity in the North East region with 18 significant deals completing. Following a mid-year lull activity picked up again which has continued into the first half of 2017 with eight notable deals completing in the first six months of this year. \nAll three completed trade exits were cross border transactions namely; Nomad Digital, Innovia and Fine Industries. \nIn addition to the sale of Fine Industries to Lianhe Chemical in April there have been two other significant acquisitions by Chinese companies in the North East since 2015 indicating a definite growing trend where North East businesses are proving to be attractive investments to Chinese buyers - the first of which in the region was the acquisition of SMD by CSR for £120m. \nThe latest PwC IPO watch highlights the resurgence of private equity backed IPOs albeit with only three recorded in the region. Read More North East firm's 'dirty bomb' detectors up for national innovation award \nIn addition to Quantum Pharma in 2014 and ScS in 2015 Ramsdens floated in February 2017 providing an exit for NorthEdge. \nThe number of private equity investments balanced out the exits with three new investments; Fastflow, Clearly Drinks and CAV Advanced Technologies and CAV Ice Protection. Parkdean was the only secondary buyout with its £1.35bn sale to Onex. \nIt wasn’t only the private equity market that was active in the North East during the first half of the year. \nOther significant transactions included the acquisition of Helen McArdle Care by HC One, the sale of O’Brien Waste Recycling to Biffa and the sale of caravan manufacturer the Explorer Group to German company Erwin Hymer. \nOverall deals activity to date in 2017 does paint a positive picture in some ways acting as barometer as to the health and attractiveness of businesses across the region. Read More North East housebuilder Barratt Developments builds up record levels of reservations \nHowever the ride is expected to be bumpy as the UK and the European Union sharpen their negotiation tools with arguments which may have a direct impact on buyers’ investment thesis and deals. \nThere is plentiful debt, equity markets are at an all- time high and there is more money in the hands of financial investors than ever before. These factors all point to a positive momentum being maintained. Like us on Facebook ", "external_links": [], "published": "2017-08-17T15:46:00.000+03:00", "crawled": "2017-08-18T05:19:50.033+03:00", "highlightTitle": ""}