{"organizations": [], "uuid": "3bb3516b07f67997ec7f1b04f581508a147bccd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i3.leicestermercury.co.uk/incoming/article326273.ece/ALTERNATES/s1200/GettyImages-521258262.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/euro-worth-more-pound-soon-326227", "country": "US", "domain_rank": 48128, "title": "Euro to be worth MORE than the pound soon according to experts - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.718, "site_type": "news", "published": "2017-08-15T12:26:00.000+03:00", "replies_count": 0, "uuid": "3bb3516b07f67997ec7f1b04f581508a147bccd3"}, "author": "James Rodger", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/euro-worth-more-pound-soon-326227", "ord_in_thread": 0, "title": "Euro to be worth MORE than the pound soon according to experts - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "chris grayling", "sentiment": "none"}, {"name": "liam fox", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "birmingham mail", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Euro to be worth MORE than the pound soon according to experts The day before the Brexit vote the pound was worth 1.31 Euros Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nIf you're planning on going on holiday soon you might need to think about getting currency now as the pound continues to slump in value. \nMorgan Stanley is predicting that the two currencies could be worth the same soon, a year after the Brexit vote , the Birmingham Mail reports. \nAs things stand the pound is trading at 1.09 euro after collapsing from 1.31 euro the day before Britain voted to quit the European Union in June. \nThis has meant Brits holidaying in the likes of sunny Spain and Italy have had their spending power obliterated, which has resulted in more people than usual opting for \"staycations\" in Britain, despite it being afflicted with poor summer weather. \nNow the US investment banking giant believes the dilapidated British currency has further to fall and is pencilling in pound-euro parity in the first quarter of 2018. \nIt would signal the first time in its 18-year history the euro has reached parity with sterling. \nPiling on the misery, Morgan Stanley described Britain's economic prospects as \"bleak\" as it heads for what appears to be a calamitous exit from the EU, with Tory ministers unable to provide clarity on their vision for life outside the bloc. Read More Research from Leicester academic says Brexit vote could have flipped if more people went to university \nMichael Gove, Boris Johnson, Philip Hammond, Liam Fox, Chris Grayling and Prime Minister Theresa May herself have given contradictory statements about Conservative plans for trade, customs, tariffs, immigration, air control, a transition period and countless other facets of Britain's divorce. \n\"The UK economic outlook looks bleak, with stretched household balance sheets, Brexit negotiation uncertainty potentially weighing on business investment, and net exports growth staying subdued despite a weak pound. \n\"On the politics front, risks have also increased, with the Conservative Party showing split opinions on the UK's Brexit position, revealing inner party tensions,\" Morgan Stanley added. \nIn contrast, the eurozone is on the up, with its economy expanding twice as fast as the UK in recent months. \nThe pound's collapse has been used by Brexiteers to herald a new dawn of trading that would span beyond Europe. \nHowever, official figures on Thursday showed the trade deficit widened as a boost to UK trade again failed to materialise. Read More ", "external_links": [], "published": "2017-08-15T12:26:00.000+03:00", "crawled": "2017-08-15T14:56:09.002+03:00", "highlightTitle": ""}