{"organizations": [], "uuid": "aab4a6700d79673e8f0001c44dcd5068251c10fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13412992.ece/ALTERNATES/s1200/Car-production-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/potential-eu-japan-deal-raises-13412966", "country": "GB", "domain_rank": 21960, "title": "Potential EU-Japan deal raises fresh fears about Nissan in Sunderland post-Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-01T20:00:00.000+03:00", "replies_count": 0, "uuid": "aab4a6700d79673e8f0001c44dcd5068251c10fd"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/potential-eu-japan-deal-raises-13412966", "ord_in_thread": 0, "title": "Potential EU-Japan deal raises fresh fears about Nissan in Sunderland post-Brexit", "locations": [], "entities": {"persons": [{"name": "jude kirton-darling", "sentiment": "none"}, {"name": "anna round", "sentiment": "none"}, {"name": "mrs kirton-darling", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "anne marie waters", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "wallonia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "renault", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "eu commission", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe ‘cars for cheese’ deal - that’s how analysts have described the EU-Japan trade agreement which was shook on in principle earlier this month. \nAn ambitious trade accord which would see the two economies linked far more closely, it has been driven by the fact that both sides have something the other wants. \nEU’s agricultural and food sector will have better access to the Japanese market, while Japan’s huge automotive industry will be able to export cars to Europe far more cheaply than they can now. \nAlthough it hasn’t been formally ratified yet, it has been heralded as a great step forward for free trade by some - but for others, it has sparked a fresh wave of Brexit worries. \nIn particular, some have been wondering what impacts the deal could have on Nissan’s huge plant in Sunderland. \nNissan, which is a Japanese company but is largely owned by Renault, a European company, have committed to maintaining the Wearside plant in the short term but have been open about their willingness to change course if the post-Brexit settlement doesn’t suit them. \nAbout 80% of the cars produced at Sunderland are exported, primarily to Europe, which has created thousands of jobs. \nBut with Japan eyeing a raid on the European automotive market and persistent fears about the competitiveness of the UK’s car market outside of the single market, the EU-Japan trade deal has got some people extra worried. \nJude Kirton-Darling, a Labour MEP for the North East, has followed the progression of the deal closely as a member of the EU’s international trade committee. Workers at Nissan's plant in Sunderland (Image: PA) \nThere is a concern, she said, that a strong deal with the EU would allow Japanese exporters to compete for what has traditionally been Nissan’s most important market. \nShe said: “We’re still waiting to see the final deal and a lot is dependent on those fine details. \n“But we could end up with a situation where a car made in Japan will cost less to import than a car produced just a couple of hundred miles over the North Sea. \n“That adds an extra dimension to the importance of our post-Brexit deal with the EU.” \nWhilst she thinks it would be unlikely that Nissan would choose to move jobs back to Asia, an EU which is expanding its free trade reach across the globe could prove a tempting location for businesses. \nMrs Kirton-Darling said: “It’s not rocket science - big manufacturing companies are hard-nosed about their bottom line and if it costs them more to operate out of Sunderland than elsewhere then they will move. \n“The EU-Japan deal just adds an extra level of pressure to the situation.” \nNissan have declared the deal to be “in the best interests of both Nissan and the automotive industry in general” and the UK government are publicly supportive of the deal. \nA spokesperson said: “The UK and Japan are natural allies with a strong bilateral trade and investment relationship, with around 1,000 Japanese companies operating in the UK sustaining 140,000 UK jobs, including a significant number in the automotive sector. \n“As a global champion of free trade, the UK has been one of the strongest advocates of the EU-Japan Economic Partnership Agreement, and will continue to actively support the EU’s pro-trade agenda. \n“Through our Industrial Strategy we are supporting our thriving automotive sector and continue to engage with them on our EU exit.” Nissan (Image: Andrew Matthews/PA Wire) \nBut for some analysts, the prospect of an EU-Japan deal raises the stakes for UK industries which could come into direct competition with strengthened Asian producers. \nAnna Round is a policy specialist based in Newcastle with think-tank IPPR North. \nShe said: “Businesses in and around Sunderland - and across the north east - have built up an impressive presence in the supply chain for transport manufacturing both for Nissan and more generally. \n“And those supply chain firms are themselves important exporters to Europe and beyond. \n“It’s vital that the trade deals which are struck when Britain leaves the EU take into account these regional strengths and their potential to grow even further. \n“The region has worked hard to make the most of its great track record in attracting investment internationally and it needs opportunities to keep building on this post Brexit.” Jonathan Arnott, UKIP MEP for the North East \nFor her, the way to mitigate any drop in competitiveness is to ensure as close a relationship as possible with the EU after the UK’s departure. \nBut for Jonathan Arnott, UKIP’s MEP for the North East, all of these worries ignore a simple fact: the EU-Japan deal might never materialise. \nHe said: “I think the EU-Japan deal is a long way off because Brussels is incredibly slows at negotiating - it took a decade to get the Canada trade agreement finalised. \n“If it did happen imminently and came into effect before Brexit, then we could be stood to benefit through some sort of grandfather clause, but that’s unlikely. \n“Personally, I can’t see it happening for a long time, if at all.” Read More Ukip MEP Jonathan Arnott signals he could quit party if Anne Marie Waters becomes leader \nHe may have a point. \nThe EU’s process for agreeing deals like this is torturous - the Canada deal nearly fell apart when it couldn’t be agreed by the Belgian regional parliament of Wallonia. \nIt’s unlikely that Nissan in Sunderland will be vying with other Japanese producers for European consumers any time soon. \nBut, Mr Arnott said, if the deal does progress, it does make it all the more important that the UK gets strong deals with places like Japan to keep companies like Nissan competitive. \nHe said: “Getting a trade deal with Japan will have to be high on the list and if we got started on negotiations now we could steal a march on the EU.” Read More All areas of North East will be hit by Brexit, new study shows \nMr Arnott attacked the government’s position of waiting until after Brexit negotiation before formally beginning trade talks with other nations, saying the government needs to be more bullish and defy the will of the EU Commission. \nThe realities of what, if any, impact the EU-Japan deal will have on the UK’s car sector is unclear and will be for some time. \nBut if Europe proves as hungry for Japanese cars as Japan is for European cheese, Nissan’s Sunderland plant could find life post-Brexit just a little bit trickier. Like us on Facebook", "external_links": [], "published": "2017-08-01T20:00:00.000+03:00", "crawled": "2017-08-01T20:30:43.000+03:00", "highlightTitle": ""}