{"organizations": [], "uuid": "f232b92c9d18a1ebb46ba0709482515cc9768e03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13426449.ece/ALTERNATES/s1200/VCP_MEN_240317_Road_30JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/think-tank-policy-north-defends-13426337", "country": "GB", "domain_rank": 21960, "title": "Think tank Policy North defends plans for free trade zone in the North", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-04T07:00:00.000+03:00", "replies_count": 0, "uuid": "f232b92c9d18a1ebb46ba0709482515cc9768e03"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/think-tank-policy-north-defends-13426337", "ord_in_thread": 0, "title": "Think tank Policy North defends plans for free trade zone in the North", "locations": [], "entities": {"persons": [{"name": "george osborne", "sentiment": "none"}, {"name": "tomaney", "sentiment": "none"}, {"name": "john tomaney", "sentiment": "none"}, {"name": "stephen purvis", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "policy north", "sentiment": "none"}, {"name": "prof tomaney", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "policy north", "sentiment": "negative"}, {"name": "north news think tank policy north", "sentiment": "negative"}, {"name": "pa", "sentiment": "none"}, {"name": "think tank policy north", "sentiment": "none"}, {"name": "the world bank", "sentiment": "none"}, {"name": "university college london", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Think tank Policy North defends plans for free trade zone in the North Think tank Policy North defends plans for a 'freeport' in the North after top academic claims it would lead to low wages Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA North East think tank has defended plans to turn the North of England into a “free trade zone”, following claims it would lead to low wages and worse working conditions. \nThink Tank Policy North set out plans for a so-called freeport in the North , covering nine major northern freight ports, where goods could be imported, exported or processed without customs tariffs. \nIt said the plan could create 612,000 jobs, partly because it would cut costs for manufacturers in the region. \nBut a senior academic says that similar schemes in other parts of the world have created unstable and low skilled jobs. \nJohn Tomaney, professor of urban and regional planning at University College London, said freeports had been tried in developing countries and the USA, adding: “The World Bank, which previously advocated these instruments, has published research which suggests they do not contribute to long-term economic development but instead create unstable, low skilled jobs which are susceptible to being undercut by lower cost freeports elsewhere.” George Osborne (Image: PA) \nProf Tomaney also said Policy North, which describes itself as an independent think tank, was run by “Northern Conservatives”. \nStephen Purvis, Chair of Policy North: “Policy North is an independent think tank that works with local business leaders to try and get the best future possible for the north of England in a post-Brexit Britain. \n“London based left wing academic John Tomaney is repeating the same old lines, that the North should quieten down its ambitions and simply be grateful for whatever so called experts and policy makers based in London think best for us. Those days are over. \n“Policy North is proud to be a leading advocate of the vast economic benefits a free trade zone for our ports could generate, bringing hundreds of new jobs and as much as £12 billion a year to our region. Read More Have we seen the end of the Conservatives’ much-vaunt-ed Northern Powerhouse, asks John Tomaney \n“The people of the north of England, and Policy North are unashamedly ambitious for our area. We are proud to advocate for more jobs, more business and higher living standards for the place we call home.” \nWriting in the Journal this week, Prof Tomaney said the Conservative government appeared to have given up on the “Northern Powerhouse” policy, which was championed by former Chancellor George Osborne. \nMr Osborne said the North could become an economic powerhouse by improving transport links between major cities. \nBut critics say the Government’s announcement that it may not proceed with planned electrification of the entire trans-Pennine line shows that it is no longer committed to the plan. \nProf Tomaney said: “Have we seen the end, for all practical purposes, of the Conservative’s much vaunted Northern Powerhouse? \n“The North East was always at the margins of George Osborne’s rather ill-defined agenda. The barely hidden centrepiece of the Northern Powerhouse was the ambition of building Manchester as a de facto northern capital.” Like us on Facebook", "external_links": [], "published": "2017-08-04T07:00:00.000+03:00", "crawled": "2017-08-04T07:29:35.012+03:00", "highlightTitle": ""}