{"organizations": [], "uuid": "9f8c5a3777ce782d676f177258a0e4422791cf4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13032423.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13521645", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Brexit to bring 80,000 new jobs to Frankfurt", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-25T10:30:00.000+03:00", "replies_count": 0, "uuid": "9f8c5a3777ce782d676f177258a0e4422791cf4c"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13521645", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Brexit to bring 80,000 new jobs to Frankfurt", "locations": [], "entities": {"persons": [{"name": "hubertus vath", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "frankfurt  brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "deutsche bank", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "sumitomo mitsui financial group", "sentiment": "none"}, {"name": "frankfurt main finance", "sentiment": "none"}, {"name": "nomura.germany", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "standard chartered", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "jp morgan", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "daiwa", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Amazon pledge to slash Whole Foods prices hits supermarket shares The Amazon logo (Image: Getty Images North America) 9:17 KEY EVENT Longhorns BBQ Smokehouse hopes to resolve winding up order 'voluntarily' \nLonghorns BBQ Smokehouse is hoping to resolve a dispute with its landlord “voluntarily” , a court hearing has heard. \nThe future of the Newcastle restaurant was thrown into doubt at the end of last week after a winding up petition was filed against the firm. \nThe petition was filed by the landlord of Longhorns’ former restaurant in Jesmond, Zara Commercial Limited. The Jesmond branch closed in March, and it is understood that Longhorns has remained liable for the rent, after failing to find another company to takeover the premises. \nAn initial hearing in the case took place yesterday at Newcastle County Court, where barrister Matthew Maddison appeared on behalf of Longhorns. \nAt the hearing Mr Maddison said: \nI am here representing the respondent company. This is the first hearing of the petition. Both sides have agreed to a 28 day adjournment and hope matters can be resolved voluntarily. \nIt was not made clear whether Longhorns would be re-opening. \nLonghorns owner Paul Henzellhas been running the business on his own after his business partner Michael Dixon resigned in December. \nAfter the closure of the Jesmond restaurant earlier this year and the loss of contracts to serve food in five Head of Steam pubs, Mr Henzell told The Journal that he hoped to carry on running the business from its Newcastle city centre branch on Mosley Street, and open a number of new smaller branches. Longhorns Barbecue Smokehouse (Image: Newcastle Chronicle) 9:12 Jonathon Manning New Provident financial chief orders credit business management shake-up \nThe new head of troubled subprime lender Provident Financial has ordered a management shake-up at the firm’s consumer credit business, days after the company issued its latest profit warning.Manjit Wolstenholme, who took on the role of executive chairman after boss Peter Crook quit on Tuesday, has removed Andy Parkinson as managing director of the division as part of a review.He will be replaced by Chris Gillespie, whose role will be “establishing relationships with customers, bringing collections back to a normal level, and stabilising the operation of the business”.As part of turnaround efforts, Provident, which has around 2.5 million customers, launched a new home credit model in July with the aim of moving from self-employed door-to-door agents to full-time “customer experience managers”.But the lender warned earlier this week that the rate of progress being made is “too weak” and that its pre-exceptional loss this year is likely to be in the range of £80m to £120m, which resulted in shares plunging.To compound the misery, the firm revealed that the Financial Conduct Authority is investigating a Repayment Option Plan Provident offers through its Vanquis Bank arm.Ms Wolstenholme said on Friday: \nMy review of the business is ongoing as we move towards stabilising the Provident home credit business and improving the service to our customers. \nThese are my first appointments and I intend to work closely with the new team on turning the home credit business around and to putting a plan in place to deliver good results for the company. Manjit Wolstenholme, who will resume the role of executive chairman after chief executive Peter Crook quit 9:07 Newcastle businessman selling firm on Gumtree to help expansion \nA Newcastle business owner has turned to online classified site Gumtree after revealing plans to open an American style diner in the heart of Heaton. \nTop Dawgs has placed the online advert in the hope of selling the lease for its current premises on Chillingham Road, along with all of the equipment housed inside. \nOwner Adam Smith, who had run the firm as a takeaway, wants to move location and open a sit-down restaurant with a larger menu. \nHe said: \nWe are basically wanting to go for a bigger premises and move to a sit down restaurant. \nWe are moving as I am wanting to do something different in terms of food, as I want to serve more dishes. We will go for an American diner style restaurant serving chicken burgers, milkshakes and desserts. \nThe business, which was previously called Big Apple Hot Dogs, is based on Chillingham Road but will remain in Heaton after the move. \nMr Smith added: \nIt’s a great little shop for someone like an independent business. I started off on my own but now I have nine staff. \nIt would be great for someone who might work from a stall at a market, but who is looking to move into the next stage of their business. The rent is very low and it’s on a busy road. \nBusinesses who are interested in acquiring the lease are being asked to contact Mr Smith at topdawgsncl@gmail.com or view the advert on Gumtree. Top Dawgs takeaway in Chillingham Road, Heaton (Image: NCJ Media) 9:02 KEY EVENT Mike Ashley's Sports Direct increases stake in Goals Soccer Centres \nMike Ashley has increased his interest in the football business after his Sports Direct firm almost doubled its stake in five-a-side company Goals Soccer Centre. \nThe retailer controlled by the Newcastle United owner upped its holding from 4.8% to 9.8% in the East Kilbride-based firm today. \nGoals has 46 sites around the UK, including centres in Newcastle, Sunderland and Middlesbrough. It has also opened two centres in California and is looking to expand its growth in North America. \nThe deal rounds off a busy week for Mr Ashley, who on Tuesday increased his stake in department store chain Debenhams to more than 20%, while shares in Game Digital - in which Sports Direct took a 26% stake in July - soared after investors warmed to plans that will see the firm ramp up its presence in rapidly growing e-sports markets. \nEarlier this year he also moved into the US retail market by taking control of Bob’s Stores and Eastern Mountain Sports in a $101m (£78m) debt deal. Mike Ashley (Image: PA) 8:57 Businesses hit by rising cost of employment reforms \nChanges to employment legislation have saddled around four in five businesses with rising costs, a survey has suggested.Firms are under increased pressure during an uncertain time, business leaders have warned, as they urged the Government not to bring in any new upfront costs or taxes.Pensions auto-enrolment, the National Living Wage and the Apprenticeship Levy have contributed to higher costs for businesses, the annual workforce survey by the British Chambers of Commerce (BCC) found.Of the 1,461 businesses asked across the UK half said the increased living wage had bumped up their costs, while three-quarters reported that pensions auto-enrolment had added to costs.Jane Gratton, head of business environment and skills at the BCC, said: \nBusinesses are under increasing pressure from the burden of employment costs, and this will influence the choices they make and outcomes for employees. \nHigher employment costs impact on the bottom line and reduce the resources available to invest in the business and its people. \nShe appealed to the Government to “ensure that there are no upfront further costs or taxes on businesses and entrepreneurs for the remainder of this parliament”.David Williams, director of corporate engagement at Middlesex University London, a partner in the survey, said firms were facing a challenging time in a competitive market.He said: \nWe need to up our productivity to enable us to compete globally in a post-Brexit Britain, so it is important when making difficult choices, the development, upskilling and retention of the workforce is high on the list of investment priorities and that businesses get the support they need to do this. A woman walking past a Job Centre (Image: PA) 8:52 Jobs are cut as Tyneside company Utilitywise's profits plummet 40% \nUtilitywise has axed 75 members of staff as profits are set to plummet by around 40%. \nIn a statement to investors, the North Tyneside energy company said it had reduced its sales force headcount from 625 to 550, as part of a “planned productivity improvement initiative”. \nThe firm claims the efficiency drive has helped it increase its enterprise division’s order book by 17.3% to £99.2m. \nBut overall, Utilitywise’s profit before tax is expected to fall by 40% for the year ending July 31 2017. \nThe drop in profits was blamed on a problem with one of Utilitywise’s major contracts, which means it will have to repay £7.6m to an energy supplier. \nUtilitywise - which arranges discounts for individual companies in return for taking their contracts to one energy supplier - said the problems related to contracts put in place before August 2016. Since then Utilitywise has overhauled its methodology for estimating future energy usage. \nIn a trading update today, CEO Brendan Flattery said: \nAlthough the company endured some headwinds in the period which impacted our financial performance in the short term, there have been a number of underlying improvements in the business which auger well for the future. \nProductivity gains in our enterprise division, which represents the majority of our profits, have led to a significant increase in our order book. \nLooking forward, our revenues and profits will now be more closely aligned to our cash generation, and the secured future revenue balance of £46.1m at 1 August 2017 gives us increased visibility of future performance. \nWith our portfolio of energy services and strong customer service, Utilitywise has a solid platform for future growth. I look forward to providing further details in our year end results statement in October. Brendan Flattery, CEO of Utilitywise 8:47 Ex-Just Eat chief executive pockets £4.9m 8:42", "external_links": [], "published": "2017-08-25T10:30:00.000+03:00", "crawled": "2017-08-25T11:00:27.001+03:00", "highlightTitle": ""}