{"organizations": [], "uuid": "5b1947d0d7b2ee93a75ca41e3ea05cf86ef860ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/incoming/article329579.ece/ALTERNATES/s1200/Ben-Bradshaw-2PNG.png", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/news-opinion/speed-technology-changes-presents-huge-329554", "country": "US", "title": "Speed of technology changes presents us huge challenges - Ben Bradshaw MP column - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.824, "site_type": "news", "published": "2017-08-15T17:57:00.000+03:00", "replies_count": 0, "uuid": "5b1947d0d7b2ee93a75ca41e3ea05cf86ef860ab"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/news-opinion/speed-technology-changes-presents-huge-329554", "ord_in_thread": 0, "title": "Speed of technology changes presents us huge challenges - Ben Bradshaw MP column - Devon Live", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "tom friedman", "sentiment": "none"}, {"name": "friedman", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "economist", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \n“The latest edition of the Economist magazine has a striking image on its front cover. It is of a car engine, drawn to resemble a dead animal, flat on its back, under the headline \"Roadkill\". \n\"The implication is that the internal combustion engine, which has powered vehicles on land for most of the last hundred years is dead, or at least heading that way. \n\"Inside, the magazine publishes an in-depth news report and editorial on how advances in battery technology will mean that electric cars will soon become affordable and practicable and that their life-time costs will shortly after that be less than a conventional vehicle. \n\"Britain and France have already announced a ban on petrol and diesel cars by 2040, Sweden and Norway by 2030 and 2025 respectively. Read More North Korea behaviour 'extremely concerning', says Exeter MP Ben Bradshaw \n\"The Economist describes a world in which there are no more polluting vehicles on our streets (or congestion, alleluia!) and fleets of shared self-driving electric cars will allow cities to reclaim land currently taken up by roads and car parks for housing, trees and green spaces. \n\"A pipe dream? There are undoubtedly huge challenges - the provision of enough charging points and sufficient extra electricity generation - are two obvious ones. Ben Bradshaw, Exeter MP \n\"This transport revolution will also involve a big upheaval for the existing motor industry and its supply chain - electric vehicles have fewer parts and are easier to assemble and maintain. There is also the supply of the lithium and cobalt, essential for the manufacture of the lithium-ion batteries that are powering this revolution. But, despite these challenges, the Economist believes these changes could come more quickly than we currently expect. \n\"That will certainly be the case if the speed of technological advance continues at the rate is has travelled during the digital revolution. \n\"In a major book out this year, the veteran New York Times writer, Tom Friedman, notes that technological change bringing major impacts on our lives used to take decades, or, further back, centuries. It now takes just a handful of years. \n\"The implications are at the same time wonderful and terrifying. An individual with a smart phone and a brilliant idea has the power to do great good. But another individual to do great harm. Read More We need to make a 'Green Brexit' work - Neil Parish MP column \n\"Entitled \"Thank you for being late: An Optimist's Guide to Thriving in the Age of Accelerations\", Mr Friedman's book predicts the rate of technological change will only get faster. As the book's title suggests, Mr Friedman is an optimist. He believes we will be able to master this change for the common good. But only with the right policies in place to stop those likely to be most adversely affected by technological change from losing out, good governance and effective global action to stop man made climate change. \n\"That poses enormous challenges for policy makers and governments. It requires a generation of political leaders who are intelligent, visionary and competent. They are in short supply right now and Mr Friedman finished his book before Trump's shock win. \n\"But the thesis that human beings' ingenuity and creativity hold the secret to overcoming the challenges of the present and the future remains both valid and attractive. And the alternatives don't really bear contemplating.” Like us on Facebook ", "external_links": [], "published": "2017-08-15T17:57:00.000+03:00", "crawled": "2017-08-22T14:25:41.010+03:00", "highlightTitle": ""}