{"organizations": [], "uuid": "ff1fad6bdcb3711761d81e15b682bd31feb4724f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30478806/16105151.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/devon-diary-s-7million-profit-boosted-by-iced-coffee-trend/story-30478806-detail/story.html", "country": "GB", "title": "HannahFinch published Devon dairy's £7million profit boosted by iced coffee trend", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-11T17:52:00.000+03:00", "replies_count": 0, "uuid": "ff1fad6bdcb3711761d81e15b682bd31feb4724f"}, "author": "HannahFinch", "url": "http://www.devonlive.com/devon-diary-s-7million-profit-boosted-by-iced-coffee-trend/story-30478806-detail/story.html", "ord_in_thread": 0, "title": "HannahFinch published Devon dairy's £7million profit boosted by iced coffee trend", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "hannahfinch", "sentiment": "none"}, {"name": "harry potter", "sentiment": "none"}, {"name": "tim smiddy", "sentiment": "none"}, {"name": "crediton", "sentiment": "none"}, {"name": "smiddy", "sentiment": "none"}, {"name": "moo", "sentiment": "none"}], "locations": [{"name": "crediton dairy", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "west country", "sentiment": "none"}], "organizations": [{"name": "crediton dairy", "sentiment": "none"}, {"name": "uk long life milk", "sentiment": "none"}, {"name": "prisma", "sentiment": "none"}, {"name": "crediton dairy limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon dairy's £7million profit boosted by iced coffee trend By HannahFinch | Posted: August 11, 2017 0 COMMENTS SHARES A taste for ice coffee has boosted sales this year Devon dairy's £7million profit boosted by iced coffee trend X \nCopy link to paste in your message / Comments (0) \nA new trend for iced coffee has helped boost profits to £7million for a dairy in Devon. Crediton Dairy Limited, one of the UK's leading dairy drinks businesses, said that iced coffees sold in an 'on-the-go' 330ml size had helped boost sales alongside continued popularity of its Moo flavoured milk brand of which 16million litres were sold last year - up by 38%. \nNow it plans to invest a further £10million over the next three years to build on its added-value offering. It follows a £11million investment since the management buy-out in 2013. \nTim Smiddy, Managing Director of Crediton Dairy, said: \"I am pleased to be able to report that the business performed in line with our expectations at a financial, operational and commercial level despite very difficult market conditions. The performance reflects the significant investment we have made in the dairy in recent years and our continued focus on new product development and improvements in quality, service and efficiency. \"We believe that Crediton Dairy is in a good position to be able to continue to pay a competitive milk price to our farmer suppliers; invest further in processing, product innovation and marketing; enhance further our product quality and customer service levels; and carry on trading profitably and growing in 2017.\" \nREAD NEXT: Exeter is getting a Harry Potter inspired bar over four floors with a magic twist \nIn accounts for the year ended 31st December 2016, reported turnover was £62.4 million , up from £58.8 million in 2015, due to a combination of dairy market inflation, an improvement in product mix and growth in volume sales. \nProfit on ordinary activities before tax was £7.0 million, up from £6.0 million in the previous year.The net cash surplus at 31 December 2016 was £1.2 million - which included a cash surplus of £2.6m offset by a finance lease of £0.9 million and loan notes of £0.5 million. \nThe key markets which Crediton Dairy supply had a year of contrasting fortunes. The UK Long Life Milk market had reduced in volume terms by 3.8% in the year to December 2016. \nHowever, Crediton Dairy's long life milk business actually grew in 2016 due to a combination of securing some new UK retail business and growth in exports. \nThere has been strong growth for Crediton Dairy's extended shelf life dairy drinks business. Sales volumes of retail own-label flavoured milks continued to grow in addition to a strong performance of Crediton's Moo flavoured milk brand and the successful launch of Iced Coffee dairy drinks. \nREAD MORE: Exeter Airport 'disappointed' over disabled services ranking \nIn addition, to its existing 'take home' 1 Litre offering, Crediton Dairy also entered the 'on-the-go' impulse segment of the milk drinks market with the introduction of a 330ml Prisma pack range following a significant investment in a new filling line at the end of 2015.Own-Label and Moo branded flavoured milks, as well as Iced Coffee drinks, were launched in the new Prisma format during 2016. \nCrediton Dairy began recruiting farmers to supply the dairy in the Autumn of 2013. At the year-end, 69 farmers were supplying Crediton nearly all of whom farm within 25 miles of the dairy. They produced an annualised volume of over 100 million litres of high quality, farm-assured milk.The successful recruitment of a direct milk pool means that Crediton Dairy is now self-sufficient in the supply of milk in advance of the cessation of the Arla Milk Supply Agreement in March 2017. \nMr Smiddy, said: \"Looking forward, there are clearly still significant challenges facing all in the dairy industry which range from volatility, being driven by the continuing imbalance in supply and demand across the global market, through to Brexit. With regards to the latter, the implications of Brexit will become more apparent throughout the current year but already it is clear that the effect on currency exchange rates and trade agreements are likely to have a significant impact on dairy markets in the UK. Our strategy will be to manage the risks and to try and take advantage of the opportunities that will inevitably arise during this period of significant change. \n\"However, despite the current uncertainties in the UK and Global dairy markets, Crediton Dairy remains positive about the long term prospects for the dairy sector and the role that a focussed, added value, West Country business can play within it.\" NEWS", "external_links": [], "published": "2017-08-11T17:52:00.000+03:00", "crawled": "2017-08-11T18:51:48.000+03:00", "highlightTitle": ""}