{"organizations": [], "uuid": "2fc24c6e339ec84fd2fb10b6035a37bb81db7a17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30475963/16103109.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/eu-companies-have-created-more-than-4-000-new-south-west-jobs-since-2012/story-30475963-detail/story.html", "country": "GB", "title": "HannahFinch published EU companies have created more than 4,000 new South West jobs...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-09T17:29:00.000+03:00", "replies_count": 0, "uuid": "2fc24c6e339ec84fd2fb10b6035a37bb81db7a17"}, "author": "HannahFinch", "url": "http://www.devonlive.com/eu-companies-have-created-more-than-4-000-new-south-west-jobs-since-2012/story-30475963-detail/story.html", "ord_in_thread": 0, "title": "HannahFinch published EU companies have created more than 4,000 new South West jobs...", "locations": [], "entities": {"persons": [{"name": "jones", "sentiment": "none"}, {"name": "james mcgrory", "sentiment": "none"}, {"name": "liam fox", "sentiment": "none"}, {"name": "tim jones", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "derriford", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "single market", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sitel", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "heart of the south west local enterprise partnership", "sentiment": "none"}, {"name": "cornwall business council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EU companies have created more than 4,000 new South West jobs since 2012 By HannahFinch | Posted: August 09, 2017 0 COMMENTS SHARES South West businesses say that relationships with EU firms that can bring investment is vital for prosperity EU companies have created more than 4,000 new South West jobs since 2012 X \nCopy link to paste in your message / South West businesses say that relationships with EU firms that can bring investment is vital for prosperity Comments (0) \nMore than 12,600 jobs in Devon and the South West have been created and safeguarded by EU companies in the past five years, new Government figures show. \nDepartment for International Trade (DIT) statistics published on Tuesday, August 8 show that, between 2012/13 and 2016/17, of 407 Foreign Direct Investment projects started in the South West, 144 were started by EU firms and of the 12,020 jobs created, 4,370 new jobs were due to EU firms. \nREAD MORE: There are hundreds of jobs in Devon \nOf the 17,178 existing jobs that were safeguarded by the investment, 8, 234 were due to EU businesses. \nTim Jones, Chairman of the Devon and Cornwall Business Council, said that good relationships with businesses based in EU member states is vital for the South West. \nMr Jones said: \"There is absolutely no doubt that businesses in the South West value continuity with EU partners in relationships that have been built up over years and that cannot be easily back filled by entering the global market place. \n\"We recognise that statistics around inward investment are only part of the picture. \nREAD MORE: Nominate now for the Western Morning News Business Awards \n\"Our businesses are involved in an integrated supply chain with businesses in the EU which is even more dependent on continuity so the effects of breaking that will be felt by businesses here even more.\" \nFigures for Devon and Somerset, covered by the Heart of the South West Local Enterprise Partnership, show there were 16 successful FDI (Foreign Direct Investment) projects in 2016/17 , an increase of 45% on the previous year. Through these investments 688 new jobs have been created and 1009 jobs safeguarded. \nOne example is US-headquartered customer service firm Sitel which is set to create hundreds of jobs with its new workforce based in The Ship at Derriford in Plymouth. \nIn addition, the LEP area has secured six 'multi-region' FDI projects, which are companies that land in more than one UK location. \nOpen Britain, a campaign group advocating a soft Brexit, said the figures demonstrate the importance of staying in the EU's Single Market. \nJames McGrory, Executive Director of Open Britain, said:\"Liam Fox keeps talking about the great new trade deals we will do after Brexit. But his own department's figures show that investment from the European Union is vital to the economy of the South West and the whole of the UK. \n\"With over 4,000 jobs created by EU investment in the South West, it beggars belief that the Government would want to take us out of the European Single Market. Doing so would create new barriers to trade, making investment less likely and putting jobs at risk. \n\"To protect jobs and our economy, Ministers need to see sense and negotiate continued membership of the Single Market after the UK leaves the EU.\" \nAcross the whole of the United Kingdom, 3,149 EU projects were responsible for creating 116,000 jobs and safeguarding 80,000 more, the figures show. NEWS ", "external_links": [], "published": "2017-08-09T17:29:00.000+03:00", "crawled": "2017-08-09T18:52:31.002+03:00", "highlightTitle": ""}