{"organizations": [], "uuid": "9a9fd16c6ace6c1a36ca5c16a9c7f01e6c36b99c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30481265/16106462.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/homebuilders-must-be-held-to-account-and-an-independent-ombudsman-formed-neil-parish-mp-column/story-30481265-detail/story.html", "country": "GB", "title": "DanielClark published Homebuilders must be held to account and an independent ombudsman...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-14T16:30:00.000+03:00", "replies_count": 0, "uuid": "9a9fd16c6ace6c1a36ca5c16a9c7f01e6c36b99c"}, "author": "DanielClark", "url": "http://www.devonlive.com/homebuilders-must-be-held-to-account-and-an-independent-ombudsman-formed-neil-parish-mp-column/story-30481265-detail/story.html", "ord_in_thread": 0, "title": "DanielClark published Homebuilders must be held to account and an independent ombudsman...", "locations": [], "entities": {"persons": [{"name": "ruth davidson", "sentiment": "none"}], "locations": [{"name": "sherford", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "neil parish", "sentiment": "none"}, {"name": "national new home customer satisfaction survey", "sentiment": "none"}, {"name": "district council", "sentiment": "none"}, {"name": "new homes ombudsman", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Homebuilders must be held to account and an independent ombudsman formed - Neil Parish MP column By DanielClark | Posted: August 14, 2017 By Neil Parish Homebuilders must be held to account and an independent ombudsman formed - Neil... X \nCopy link to paste in your message / Comments (2) \nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010 \nThe Government is committed to building a million homes by the end of 2020 - and to deliver half a million more by the end of 2022. New housing will affect the length and breadth of our country. \nThat's why, when Parliament returns in September, I will be holding a debate on New Housing Design. \nAs a former Planning Officer at District Council level, I know just how terrified some communities are of new development. Not because they are NIMBYs. But because they have seen how previous developments in the last 50 years have left communities with homes totally unsuitable for their area. \nThe 2017 Conservative manifesto, for all its controversy, pledged to build \"better homes which match the quality of those we have inherited from previous generations\". This is a must. \nRead More: Rural leaders hit back over 'inappropriate' tax proposals for new farm buildings \nAsking people about their local area, housing designs in traditional form and style commanded 75 per cent support. Less traditional development styles commanded very low support – around a fifth to a third. The message is clear: new homes should be built in high-quality, traditional designs that are popular with the public. \nRuth Davidson hit the nail on the head when she recently wrote: \"The biggest ally we have in increasing housing supply is beauty – if new houses complement the local environment and avoid the disastrous design choices of the past we can help build sustainable local support for extra construction.\" \nThe key is strong community engagement. Local people must be given the tools and encouragement to create their own design codes and plan the sort of development they want. Not only will it improve the quality of housing stock, it gives people a stake in their community and a sense of civic pride in new developments. \nHowever, people need confidence developers will build to their plans. For example, in Devon, a new town called Sherford is being built. It's a great example of how design should be done, with extensive local consultation. But now developers have applied to change the town code to mere 'guidelines'. This can't be allowed to happen around the country. When communities come together to influence local housing designs, their plans should be implemented, not railroaded by big home-builders chasing extra profit. \nAnd this is the second major point I will raise in my debate on new housing. Homebuilders must be held to account. An independent New Homes Ombudsman, with teeth to enforce compensation, should be urgently established to give new homebuyers and their neighbours greater powers of redress. \nRead More: We need to make a 'Green Brexit' work - Neil Parish MP column \nIf a customer buys goods in a shop, they have powers of redress. But if someone spends their life's savings on a new home, they can sometimes struggle for years to get what they paid for? \nThe National New Home Customer Satisfaction Survey showed an overwhelming 98 per cent of new home buyers had reported snags or defects to the builder after moving in. Since 2012, the number of respondents satisfied with the condition of their new build home has fallen by 10 per cent. The problem is getting worse. \nAt a time when this country is preparing for the biggest expansion in new housing for 30 years, the quality of design and finish must not be compromised. We need to seize this opportunity and give people the sort of housing designs they want, backed up with a powerful New Homes Ombudsman. If we build top quality, well-designed buildings today, they will become the proud homes of our grandchildren and generations to come. We must invest in our housing stock, not cut corners. ", "external_links": [], "published": "2017-08-14T16:30:00.000+03:00", "crawled": "2017-08-14T16:36:08.005+03:00", "highlightTitle": ""}