{"organizations": [], "uuid": "dad6a607227e32613a0b8d5dcabdf772e16fed18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13442605.ece/ALTERNATES/s1200/Andy-Haslam-partner-of-Begbies-Traynor-in-the-North-East.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-insolvency-risk-13442568", "country": "GB", "domain_rank": 21960, "title": "North East business insolvency risk on the rise in first half of 2017", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-07T18:00:00.000+03:00", "replies_count": 0, "uuid": "dad6a607227e32613a0b8d5dcabdf772e16fed18"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-insolvency-risk-13442568", "ord_in_thread": 0, "title": "North East business insolvency risk on the rise in first half of 2017", "locations": [], "entities": {"persons": [{"name": "tait walker", "sentiment": "none"}, {"name": "andy haslam", "sentiment": "none"}, {"name": "bureau van dijk", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "east", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East business insolvency risk on the rise in first half of 2017 Research by R3 North East has found that 27.3% of regional firms were at a heightened risk of becoming insolvent last month Share Andy Haslam vice chair of R3 North East (Image: Publicity Pic) Share Get business   Thank you for subscribing!   \nThe proportion of North East businesses with a heightened risk of becoming insolvent in the next 12 months rose by 2.5 percentage points during the first half of 2017. \nInsolvency and restructuring trade body R3 has found that 27.3% of regional firms were in this position at the start of July, compared to 24.8% at the beginning of the year. \nThe figures vary across different market sectors, with transport and haulage firms having an almost five percentage point lower risk of being in this position today than they had back in January (32.8% then vs 27.9% now). \nHowever, insolvency risk-facing businesses in the agriculture sector are almost three percentage points higher than it was six months ago (21.8% then vs 24.5% now). \nDuring the first six months of the year, the insolvency risk has risen in six of the 11 regional industries that R3 monitors on a monthly basis, with the manufacturing, technology and hotel sectors all seeing rises of between one and two percentage points. \nThe important retail and construction sectors both recorded relatively small rises of 0.3 and 0.5 percentage points respectively in their proportion of firms at higher than average risk of insolvency, while the professional services sector remained unchanged over the period in question. \nThe North East’s pub and restaurant industries both enjoyed a solid first half of the year, with falls of 2.1 and 1.8 percentage points in their respective insolvency risk, while regional tourism operators saw a one percentage point improvement in their sector. \nR3’s insolvency risk tracker is compiled using Bureau van Dijk’s ‘Fame’ database and measures companies’ balances sheets, director track records and other information to work out their likelihood of survival over the next 12 months. \nAndy Haslam, North East vice chair of R3 and a partner with Tait Walker, said: “The last six months have seen a whole host of issues, including rising inflation, the weakness of sterling against other currencies and the uncertainties surround the continuing Brexit process, having an impact on regional businesses’ capacity to both make progress now and plan effectively for the future. \n“It’s therefore perhaps not surprising that we’ve seen a rise in the overall proportion of North East firms facing a heightened risk of insolvency over the first half of the year, and with many of these factors still in play, we may well see it continue to rise through the rest of the year. \n“There are some good news stories within our research, and given that the second half of the year is traditionally the time when our leisure industries record their best figures, it’s encouraging to see the pub and restaurant sectors so far enjoying a positive 2017. \n“Businesses in any sector can face financial and operational difficulties at any time of the year, and their management teams need to be prepared to swiftly seek qualified advice as soon as they become apparent, so they have the best possible chance of putting their situations right and moving on.” Like us on Facebook", "external_links": [], "published": "2017-08-07T18:00:00.000+03:00", "crawled": "2017-08-07T18:18:10.006+03:00", "highlightTitle": ""}