{"organizations": [], "uuid": "407dbdbd77035b0808709486d1612fad7c3c7988", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12758679.ece/ALTERNATES/s1200/dominoes-1.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13458592", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Domino's Pizza buys its own franchise to build on London growth", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-11T10:25:00.000+03:00", "replies_count": 0, "uuid": "407dbdbd77035b0808709486d1612fad7c3c7988"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13458592", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Domino's Pizza buys its own franchise to build on London growth", "locations": [], "entities": {"persons": [{"name": "bon bon", "sentiment": "none"}, {"name": "tony", "sentiment": "none"}, {"name": "roman kotlarzewski", "sentiment": "none"}, {"name": "veronica cleary", "sentiment": "none"}, {"name": "ian jones", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}, {"name": "simon berry", "sentiment": "none"}, {"name": "matt grozier", "sentiment": "none"}, {"name": "peden", "sentiment": "none"}, {"name": "efferoth", "sentiment": "none"}, {"name": "snapchat", "sentiment": "none"}, {"name": "matt", "sentiment": "none"}, {"name": "germand", "sentiment": "none"}, {"name": "jonathon manning snapchat", "sentiment": "none"}, {"name": "achim loecher", "sentiment": "none"}, {"name": "garner", "sentiment": "none"}, {"name": "cleary", "sentiment": "none"}, {"name": "ian peden", "sentiment": "none"}, {"name": "joe garner", "sentiment": "none"}, {"name": "oliver vogt", "sentiment": "none"}, {"name": "berry", "sentiment": "none"}, {"name": "faiz nahab", "sentiment": "none"}, {"name": "william dean", "sentiment": "none"}, {"name": "vincent efferoth", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "fred", "sentiment": "none"}, {"name": "fred noble", "sentiment": "none"}, {"name": "bruce hemphill", "sentiment": "none"}, {"name": "heather hancock", "sentiment": "none"}, {"name": "lukas", "sentiment": "none"}, {"name": "peter julian", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "lukas passia", "sentiment": "none"}, {"name": "lanchester gifts", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "kotlarzewski", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "mark rowntree", "sentiment": "none"}, {"name": "jonathon manning durham", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "crowdcube", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "bucharest", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "snapchat", "sentiment": "none"}, {"name": "fenwick food hall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "noveltea", "sentiment": "none"}, {"name": "passia", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "lanchester wins", "sentiment": "negative"}, {"name": "durham-based lanchester wines", "sentiment": "negative"}, {"name": "bon bon", "sentiment": "none"}, {"name": "harrods", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "om asset management", "sentiment": "none"}, {"name": "asda", "sentiment": "none"}, {"name": "sunderland eye infirmary", "sentiment": "none"}, {"name": "fsa", "sentiment": "none"}, {"name": "proton power", "sentiment": "none"}, {"name": "proton", "sentiment": "none"}, {"name": "lanchester wines", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "board of proton", "sentiment": "none"}, {"name": "food standards agency", "sentiment": "none"}, {"name": "surrey advertiser", "sentiment": "none"}, {"name": "snap inc", "sentiment": "none"}, {"name": "confin interim management ltd", "sentiment": "none"}, {"name": "veterinary health authority", "sentiment": "none"}, {"name": "jonathon manning newcastle", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "globe business college munich", "sentiment": "none"}, {"name": "lion egg processors", "sentiment": "none"}, {"name": "manning global ag", "sentiment": "none"}, {"name": "proton power systems", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lanchester Wins acquires luxury confectionery firm \nDurham-based Lanchester Wines has acquired luxury confectionery business Bon Bon’s. \nThe Wetherby business provides luxury sweets and chocolates to high end independent retailers and visitor attractions. It will now form part of Lanchester Wines’ gifting division, Lancester Gifts. \nBon Bon’s will continue to operate as a stand-alone business under its existing brand. Directors Mark Rowntree and Peter Julian continuing to manage the team. \nLanchester Wine Cellars was established in 1980 by Tony and Veronica Cleary, and continues to be run by the family. \nMr Cleary said: \nWe see the acquisition of Bon Bon’s a natural progression for our business, allowing us to reach new markets and extend our product offering. Mark and Peter have established a solid, successful business and we have every intention of working with them closely to grow even stronger. \nWe cut our teeth in the wine business nearly 40 years ago. In 2007 we diversified into gifting, starting with wine gifts and hampers, and now Lanchester Gifts is one of the largest businesses of its kind in the UK supplying a large section of the retail industry with own label gift products. \nThrough Bon Bon’s we’ll have direct access to luxury confectionery and chocolate to use within Lanchester Gifts’ products, enhancing both our offering and our ranges. In turn, this will extend the reach of Bon Bon’s products to new customers and drive sales. We see this acquisition as a natural progression for both brands and are looking forward to growing both businesses. Lanchester Wines has acquired luxury sweets business Bon Bon's 9:15 Jonathon Manning Snapchat adds 7m users but revenue falls below expectations \nTechnology Correspondent Photo app Snapchat added 7m new users in the last three months, the company’s latest financial results revealed. \nHowever, parent company Snap Inc fell short of analysts’ expectations with revenue for the quarter of $181.7m (£140m), well below the $189m (£145m) predicted. \nSnapchat’s daily active users rose to 173m, compared to the 166m reported in the last quarter, but continues to trail many of its rivals. \nSnap Inc has suffered from falling stock prices since floating on the US stock market earlier this year. Some of this fall has been driven by pressure from Facebook’s family of apps - including Instagram - which have successfully introduced features similar to Snapchat in order to entice users to their services. \nSince introducing a Stories feature similar to that of Snapchat, Instagram has seen daily use of the feature rise to more than 250m, eclipsing Snapchat’s entire user base. \nStories enable users to capture and share a montage of photos and videos over a 24-hour period that appear to friends in chronological order. However, Snapchat’s user growth for the quarter was up 21% on the same period last year. \nEarlier this year, Snap Inc released its first hardware product in the UK - video camera enabled sunglasses called Spectacles, which the tech giant sells via colourful vending machines called Snapbots. The logo of mobile app \"Snapchat\" is displayed on a tablet (Image: Lionel Bonaventure/AFP/Getty Images) 09:10 KEY EVENT Supermarkets bin egg products amid European contamination scare \nFour supermarkets have taken products off their shelves in the wake of the egg contamination scare - as the Food Standards Agency says the scale of the problem is higher than previously thought.Around 700,000 eggs from Dutch farms implicated in the Fipronil contamination scare have been distributed to Britain, rather than the 21,000 first estimated, the watchdog said.In response, Sainsbury’s, Morrisons, Waitrose and Asda have withdrawn a total of 11 products - including sandwiches, sandwich fillers and salads - from sale.The FSA said investigations into the incident suggested it was “very unlikely” that the eggs posed a risk to public health as it released a list of processed products withdrawn in the UK “to ensure that consumers are protected”.The move came as Dutch investigators detained two men suspected of being involved in the illegal use of the pesticide at poultry farms.Potentially contaminated eggs have cropped up in Luxembourg, Denmark and Romania, with the Veterinary Health Authority in Bucharest saying it discovered 1,000 kilograms of eggs before they reached supermarket shelves.The FSA said all products withdrawn in the UK were processed foods in which egg was one ingredient among many others, mostly used in sandwich fillings or other chilled foods.It said some of the products made from these eggs would have already been consumed, but some were still within the expiry date and were being withdrawn by the businesses involved.Many of the eggs were mixed with others which had not come from affected farms so Fipronil residues would be highly diluted, it added.FSA chairwoman Heather Hancock said: \nI’m confident that acting quickly is the right thing to do. \nThe number of eggs involved is small in proportion to the number of eggs we eat, and it is very unlikely that there is a risk to public health. \nBased on the available evidence there is no need for people to change the way they consume or cook eggs. However, Fipronil is not legally allowed for use near food-producing animals and it shouldn’t be there. \nThe FSA said it had no evidence that eggs laid in the UK were contaminated or that Fipronil had been used inappropriately here, and testing results to date for England and Wales showed no exposure to the pesticide.British egg processors have criticised the buying policies of the UK’s major supermarkets after the FSA released the list of withdrawn products.British Lion Egg Processors chairman Ian Jones said: \nThe major retailers are operating to double standards when it comes to eggs. All of them stock British Lion shell eggs but they use imported eggs in many of their other foods containing eggs. \nThis is just the latest of a number of food safety issues connected to eggs produced outside of the UK in recent years. Consumers clearly want retailers and food manufacturers to use good-quality British ingredients that are produced to high standards of food safety, but in some prepared foods this is not the case Around 700,000 eggs from Dutch farms implicated in a contamination scare have been distributed to Britain, rather than the 21,000 first estimated, the Food Standards Agency has said (Image: PA) 9:05 Jonathon Manning Old Mutual making 'excellent progress' on business split as profits soar 37% \nOld Mutual has reported a rise in half-year profits and said it is on course to split the firm into four by next year. \nThe FTSE 100 firm announced in March last year that it would run its US-based asset management operation, its UK-based wealth unit, an emerging markets division and Nedbank in South Africa as separate businesses. \nOn Friday, chief executive Bruce Hemphill said Old Mutual is making “excellent progress” in the break-up as he celebrated a 37% rise in adjusted operating profit to £969m. \nHe added: \nWe are making excellent progress in delivering the managed separation of Old Mutual, having materially reduced debt and largely disposed of our stake in OM Asset Management. \nOur focus for the next phase of managed separation is first to finalise the appropriate standalone balance sheets for our two unlisted businesses, and second, subject to the necessary approvals, deliver them to our shareholders at the earliest opportunity in 2018 after our 2017 full-year results. \nThe group said it will list its UK-based wealth unit and its South African unit next year. Its stake in US Old Mutual Asset Management will be reduced to 5.5%, the firm added. A pile of ten pound notes (Image: Surrey Advertiser) 9:00 Jonathon Manning Durham eye specialist invents new tech to help children with Down's Syndrome \nA Durham optometrist is on the hunt for a production partner after inventing a new device for taking accurate eye measurements of children with Down’s Syndrome. \nFamily optometrist Simon Berry has developed a new piece of equipment to help take eye measurements for those who are unable to focus on objects up close. \nThe condition, known as accommodative lag, is more common in children with Down’s Syndrome, who often find it hard to concentrate on a target for a long period of time. This makes it difficult to issue children with the right prescription for their glasses. \nBut Mr Berry, who also works at Sunderland Eye Infirmary as a specialist optometrist, has invented a new piece of equipment to fix the problem. \nThe new equipment uses mirrors and glass to act as a mini cinema screen, allowing the child to look at familiar pictures, such a TV characters, pictures of pets, or any other image or video that will hold their attention long enough to get an accurate measurement. \nA prototype was developed with the help of Durham University’s physics and engineering departments, along with final year engineering students Matt Grozier and Fred Noble. The team used 3D printing technology to produce the prototype in just two weeks. \nMr Berry said: \nMatt and Fred were quick to understand and address the issues involved, and used the University’s world-class facilities and the expert knowledge of colleagues in the physics and engineering departments to produce the prototype in a very short time span. (L-R): Simon Berry, Matt Grozier, Fred Noble, Oliver Vogt, and William Dean (front) 8:55 KEY EVENT Proton Power Systems announces major management shakeup \nGreen energy specialist Proton Power system has revealed its chairman and company secretary Ian Peden has stepped down from the role amid a major senior management shakeup. \nMr Peden has held his chairman position since 2015 but stepped down from his position yesterday. He continues to work as a non-executive director. \nHe has been replaced by fellow non-executive director Achim Loecher. \nThe Newcastle-founded firm specialises in fuel cells and systems that can be used in electric buses, light and heavy duty vehicles, boats and buildings, producing anything from 3kW to peak power of 30kW. \nProton has also brought in Roman Kotlarzewski as group finance director. \nMr Kotlarzewski has over 30 years’ experience in finance and accounting, having held leadership roles in start-ups and quoted UK, Germand and US companies.Currently he holds directorships at ConFin Interim Management Ltd, the Globe Business College Munich, and telecoms firm Manning Global AG. \nCommenting on the changes, Faiz Nahab, CEO of Proton, said: \nThe Board of Proton would like to thank Ian for his efforts and commitment to the Company as Chairman and look forward to continue working with him in the future. \nWe are pleased to welcome Roman Kotlarzewski as our new Group Finance Director. His experience in various financial roles will be a valuable addition to the Board. Proton Power Systems fuel cells are to be used in Austrian buses 8:50 KEY EVENT Nationwide profits down amid economic uncertainty and fall in buy-to-let loans \nNationwide saw profits tumble in the first quarter as it braces for a period of potential “prolonged economic uncertainty” and amid a retreat from the buy-to-let market.The building society said underlying pre-tax profits in the three months to June 30 dropped 18% to £301m.Statutory pre-tax profits fell from £401m to £322m in the period.It put the decline down to a non-recurring £100m gain in the first quarter of last year, and chief executive Joe Garner said profit remained in its “target range”.The figures also show that gross mortgage lending fell from £8.6bn to £8.1bn in the period, while net mortgage lending decreased to £2.4bn from £3.5bn.Nationwide put this down to a “reduction in buy-to-let advances” as a result of the increase in stamp duty for such properties that came in last year, and changes to its lending criteria.Mr Garner warned that while the building society’s research shows that consumers expect Brexit to leave their ability to access credit unchanged, there were choppy waters ahead. \nHe said: \nIt will be important for lenders to balance carefully credit supply with affordability as we seek to support the long-term interests of consumers in a responsible way through any potential economic slowdown ahead. \nIn a period of potentially prolonged economic uncertainty and persistently low interest rates, Nationwide continues to invest in products and services to support the long-term needs of our members. A Nationwide branch Jonathon Manning Newcastle tipsy tea firm Noveltea to crowd fund £120,000 following Harrods deal \nNewcastle creators of tea with a tipsy twist are set to take their novel drink around the world through a £120,000 crowdfunding bid . \nThe founders of Noveltea are looking to raise the sum to sell the drinks overseas, following early success for the fledgling firm. \nFormer Newcastle University students Vincent Efferoth and Lukas Passia both originally come from Germany, but settled in the North East to launch Noveltea, after being set on their business path by the British fascination for craft beers, spirits and afternoon tea traditions. \nNovelTea sells a range of boozy afternoon teas that are infused with gin or rum and the firm has achieved great success locally after it was stocked in Newcastle’s Fenwick Food Hall – and the afternoon tipple has now made its way to London after hitting Harrods’ shelves. \nNoveltea has also struck a dea l with John Lewis that will see its drinks stocked in 12 stores across the country from this weekend. \nMr Efferoth said: \nObviously Harrods is world famous and it means a lot for us at Noveltea to be recognised as a high premium product. \nWe were in London last week and it was just an amazing experience. We were there doing customer sampling, and it was great to see how well Noveltea is being received. \nFollowing on from the their company’s growing success in the UK, the duo are now looking to raise the six-figure sum to drive oversea sales and further promote the business. \nMr Efferoth added: \nWe are looking to raise £120,000 and the aim is to extend our team to reinforce our marketing activities, in a cost efficient way, and to meet our working capital requirements. We now have bigger accounts and we need to have the financial resources to deliver. \nWe want the financial resources to develop Noveltea as an international brand. We are preparing for exporting opportunities. \nThe campaign is taking place on crowdfunding site Crowdcube and is now under way. Noveltea co-founders Lukas Passia (left) and Vincent Efferoth (right) (Image: Noveltea) 8:40", "external_links": [], "published": "2017-08-11T10:25:00.000+03:00", "crawled": "2017-08-11T14:42:52.028+03:00", "highlightTitle": ""}