{"organizations": [], "uuid": "aab9d551e8522fa1b03450f9701f31bf9820c940", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30466954/16097185.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/why-this-is-the-best-week-of-the-year-for-all-football-fans-every-year/story-30466954-detail/story.html", "country": "US", "title": "Why this is the best week of the year for all football fans, every year! | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.089, "site_type": "news", "published": "2017-08-02T19:00:00.000+03:00", "replies_count": 0, "uuid": "aab9d551e8522fa1b03450f9701f31bf9820c940"}, "author": "", "url": "http://www.devonlive.com/why-this-is-the-best-week-of-the-year-for-all-football-fans-every-year/story-30466954-detail/story.html", "ord_in_thread": 0, "title": "Why this is the best week of the year for all football fans, every year! | Devon Live", "locations": [], "entities": {"persons": [{"name": "peter cook", "sentiment": "none"}, {"name": "gary", "sentiment": "none"}, {"name": "herb alpert", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "railway steve", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gilbert", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}], "locations": [{"name": "pop side gates", "sentiment": "none"}, {"name": "truro city", "sentiment": "none"}], "organizations": [{"name": "torquay", "sentiment": "none"}, {"name": "torquay united", "sentiment": "none"}, {"name": "nemanja matic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why this is the best week of the year for all football fans, every year! By Guy_Henderson | Posted: August 02, 2017 0 COMMENTS SHARES amon Lathrope of Torquay United makes it 6-0 to Torquay, during the pre season friendly match between Torquay United and Truro City Why this is the best week of the year for all football fans, every year! X \nCopy link to paste in your message / amon Lathrope of Torquay United makes it 6-0 to Torquay, during the pre season friendly match between Torquay United and... Comments (0) \nThis is my favourite week of the year, better than Christmas, better even than the first week of the Tour de France. This is the week when I go around filled with unbridled enthusiasm, my eyes aglow with a kind of evangelical zeal. This week I believe in unicorns and the tooth fairy. I believe in Father Christmas and you could even try telling me that Brexit was a good idea after all. \nBecause the countdown clock is ticking. The new football season begins on Saturday and everything is going to be all right. Everything is going to be just fine. \nOn Saturday afternoon Plainmoor will open its gates for the new season. Football is back and I could not be happier. Summer is still in full swing, and Paignton Regatta also begins on Saturday. \nThere is still sunshine and ice cream, and beer to be quaffed in the open air on summer evenings while bands play on open-air stages, but football starts on Saturday and this season is going to be the big one for Torquay United. \nI have been feeling like this at this time of year for as long as I can remember. \nNo matter how bad the previous season, no matter how terrible the football on those endless cold, wet February nights, no matter how clueless some of the clowns in golden shirts might have been last season, this is going to be the season against which all others will be measured. \nWhen they come to write the history books, this will be the season around which they write the opening chapter. \nI have been saying this over the past few weeks to anyone who will stand still for long enough to listen. \nMrs H is getting heartily fed up of it, In a household groaning at the seams with Torquay United fans, she is accustomed to this annual chirping ahead of the first game of the new campaign, a kind of dawn chorus of hopeless optimists. \nMorning, noon and night we are discussing the new arrivals and the players retained, the make-up of the new squad and the likely line-up which will be revealed when the team sheets are read aloud on Saturday afternoon.] \nThis had better be the year, she says, because I can't stand another winter like last winter with you lot. \nDon't worry, we say. This is going to be our year. We can feel it in our bones. \nSaturday will be a day for routines and rituals - early to the ground for me, just to be in position with laptop all fired up in good time for the arrival of those keenly-anticipated team sheets. \nI'll park in more or less the same spot I always do, and I'll walk down the lane behind the school, like I always do. I do it for luck, not that it has ever brought us any. \nI'll probably go round to see Peter Cook's blue plaque high on the wall by the Pop Side gates, then say hello to Peter and Michael and Gary and all the other familiar characters on the way from the gates to the press bench. Gilbert the Gull is always good for a handshake and an be counted on to appear somewhere in my matchday videos or pictures \nThe only one of my post-match videos anyone remembers from last season is the one where I got photobombed by Gilbert. \nYounger Daughter and Railway Steve will be coming through the turnstiles and taking their usual places on the Pop Side by the time I have the laptop fired up. \nThe season ticket holders will file in one by one to fill the seats around us, each and every one of them gleaming with the same starry-eyed zeal for the new campaign. \nAnd then the music will start pounding out of the PA speakers. Herb Alpert will be played. There will be seagulls. There will be an almost overwhelming smell of chips. \nIt is hard to put a finger on what makes us feel like this the week before the season begins each and every year. \nBitter experience should teach us that the things we hope for in August are rarely realised in May. But every now and then a season comes along that surpasses all others, and makes you think it's nothing but blue skies from now on. \nThat's the mindset I'm in right now, counting down the minutes until Saturday afternoon. \nGood friends have already caught my mood and have placed a hand on my shoulder to say: \"Don't build your hopes up.\" \nBut that's the whole point of being a football fan. Forget the Premier league, forget Match of the Day, forget £40million for Nemanja Matic, none of which has anything to do with actual, proper football, the kind we watch and love. \nI will build my hopes up, however much evidence stacks up to the contrary and regardless of how many times I have been bitten before. \nCatch me just before 5pm on Saturday and see how I'm feeling then. I reckon everything is going to be just fine. \nMy dear old grey-haired mum, who will clip me around the ear for describing her thus, celebrated a big birthday at the weekend. I am too much of a gentleman, and too much of a coward, to tell you the exact numbers, but we had balloons, tea, cake and a big family gathering which was meant to be a garden party but had to go ahead indoors because of the teeming July rain outside. \nThe dog ate too much cake, the cat went outside in the rain because it got too noisy for him, but my inspirational mum had a whale of a time. Happy birthday to you! ", "external_links": [], "published": "2017-08-02T19:00:00.000+03:00", "crawled": "2017-08-02T18:54:00.000+03:00", "highlightTitle": ""}