{"organizations": [], "uuid": "7d5068db8f47742f62870afcf860d321cb79acee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/news/property/article338752.ece/ALTERNATES/s1200/Sale-boardsPNG.png", "site_section": "http://www.westernmorningnews.co.uk/property.rss", "section_title": "devonlive - Property", "url": "http://www.devonlive.com/news/property/comment-how-can-tell-how-338512", "country": "GB", "title": "Comment: How can we tell how the Exeter property market is really doing?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-17T13:37:00.000+03:00", "replies_count": 0, "uuid": "7d5068db8f47742f62870afcf860d321cb79acee"}, "author": "Tina Penberthy-Hutchings", "url": "http://www.devonlive.com/news/property/comment-how-can-tell-how-338512", "ord_in_thread": 0, "title": "Comment: How can we tell how the Exeter property market is really doing?", "locations": [], "entities": {"persons": [{"name": "simon cooper", "sentiment": "none"}, {"name": "simon rubinsohn", "sentiment": "none"}, {"name": "drew pearce", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "royal institution of chartered surveyors", "sentiment": "none"}, {"name": "rics", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How many sale boards are up in your street? Share Comments \nHow many for sale or sold boards can you spot in your street? It is perhaps a good rule of thumb that if there are plenty of for sale signs in gardens it doesn't necessarily mean that the property market is buoyant. \nAlthough you may have missed out on a property you had your eye on, sold boards are actually what we want to see in our cities, towns and villages as this is a good indication that the market is moving and things are looking rosy on the property horizon. \nThis week the Office for National Statistics released figures showing that the average house price in Exeter has now climbed to more than a quarter of a million pounds but what does that actually mean? Read More \nIs it a case that house values are truly up or that a shortage of stock is driving houses prices with people paying a premium over and above what a house is truly worth? Exeter house prices have topped £250,000 for the first time \nEssentially something is only worth what someone will pay for it. You could have four houses in one street all priced at £150,000. Each one is identical inside and out and there are six people itching to buy them. \nWith more demand than supply, you could find yourself in a property price war with house hunters bidding well above the £150,000 price tag in order to secure one of the houses - putting the properties at a premium. \nHowever, if you have six houses at £150,000 and only four buyers, this puts the buyers in a much stronger position opening up the potential to offer the owner less money for one of the properties. \nThis goes to show that just because an average house price in an area is reported to be a quarter of a million pounds, vendors perhaps shouldn't demand more money for their property – market conditions need to be taken into account too. \nSo how is the Exeter market faring? With political uncertainty as the Brexit negotiations get underway, Exeter based agents Drew Pearce has reported that a \"supply shortage remains a dominant feature\", while Stags partner Simon Cooper referred to the top end of the market as being \"very price sensitive\" suggesting perhaps that those able to buy at the higher end of the property ladder are biding their time rather than paying a premium for property. \nThe Royal Institution of Chartered Surveyors' (RICS) residential market survey for July 2017 reports that record low stock numbers, political uncertainty and the aftermath of tax changes are obstacles hindering the UK housing market, with price growth and sales activity subdued during the month of July. \nRICS Chief Economist Simon Rubinsohn added that the most worrying aspect of the survey is the suggestion that this could continue for some time to come. \nAll signs seem to point to the fact that activity in the UK housing market is slowing. \nOnly Exeter estate agents really know how the property market is faring in the city, but if you want to conduct your own investigation, just keep on an eye on those for sale boards, when they go up, how long they are there for, and once the sold signs start replacing them, stop and listen and you may just hear a collective sigh of relief. Like us on Facebook ", "external_links": [], "published": "2017-08-17T13:37:00.000+03:00", "crawled": "2017-08-22T11:45:20.004+03:00", "highlightTitle": ""}