{"organizations": [], "uuid": "631061c823dfc7ab7060dae8236ca350315e117d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/news/article403917.ece/ALTERNATES/s1200/Ben-Rhodes2.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/dcbc-chief-executive-ben-rhodes-403906", "country": "GB", "title": "DCBC chief executive Ben Rhodes to stand down", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-31T11:44:00.000+03:00", "replies_count": 0, "uuid": "631061c823dfc7ab7060dae8236ca350315e117d"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/dcbc-chief-executive-ben-rhodes-403906", "ord_in_thread": 0, "title": "DCBC chief executive Ben Rhodes to stand down", "locations": [], "entities": {"persons": [{"name": "dave ratcliffe", "sentiment": "none"}, {"name": "ben rhodes", "sentiment": "none"}, {"name": "rhodes", "sentiment": "none"}, {"name": "mike elsey", "sentiment": "none"}, {"name": "ratcliffe", "sentiment": "none"}, {"name": "karen woodward", "sentiment": "none"}, {"name": "sean bean", "sentiment": "none"}, {"name": "karen", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "tim jones", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "david beckham", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "dcbc", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "selection committee", "sentiment": "none"}, {"name": "cornwall business council", "sentiment": "none"}, {"name": "ebay", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "british computer society", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DCBC chief executive Ben Rhodes to stand down Dave Ratcliffe has been appointed his interim replacement Share Ben Rhodes, chief executive of DCBC has been in post for five years Share Comments \nBen Rhodes, the chief executive of Devon and Cornwall Business Council is set to stand down after five years in post. \nHe will be replaced by Dave Ratcliffe as interim Chief Executive Officer until a permanent replacement is found. \nTim Jones, chairman of DCBC, said he is proud of the progress that DCBC has made. He recognises the work undertaken by Mr Rhodes. Read More From Sean Bean to David Beckham: The client list for this Devon firm that started on eBay is impressive \nMr Jones “He has been an invaluable, motivated leader for our organisation throughout Devon and Cornwall. His ability to be an advocate for business, build partnerships and drive the organisation forward serves as a model for those who will follow. I wish him every good fortune for his future.” \nMr Jones said Mr Ratcliffe comes with huge credentials to move forward with DCBC’s ambitious agenda for an enhanced strategic role in the regional economy. It’s core mission is to provide an effective network for businesses, large and small, which can drive wealth generation and prosperity. Being the regional voice of business is a critical role as we face the challenges and uncertainties around Brexit. \nMr Ratcliffe is a Fellow of the British Computer Society and a Chartered IT Professional. His career in information systems and networks spans over 35 years. He runs his own consultancy business specialising in support for new initiatives, project reviews and procurement. \nHe has been involved in NonExecutive Director roles in various South West businesses within the public and private sectors and health related organisations. Read More \nMr Rhodes will leave his post on September 8. \nHe said: “It has been a privilege working with so many dedicated professionals who care deeply about \nthe economic prosperity of Devon and Cornwall. I give much credit to my team, members and \npartners, that I’ve had the privilege of working with and look forward to their continued success. ” \nMr Ratcliffe will oversee operations until a new permanent Chief Executive is appointed. Tim Jones will be leading the Selection Committee for the organisation’s next Chief Executive, which he hopes will be in place within three months. \nKaren Woodward will remain as DCBC’s Head of Operations with the appointment of Mike Elsey as Senior Account Manager strengthening the team. Karen and Mike will continue to support all DCBC Members and key partners, supported by DCBC’s Board and interim CEO. Like us on Facebook ", "external_links": [], "published": "2017-08-31T11:44:00.000+03:00", "crawled": "2017-08-31T11:57:24.000+03:00", "highlightTitle": ""}