{"organizations": [], "uuid": "8adb528311e4e2ba231bea954324378bf4c0968f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13528466.ece/ALTERNATES/s1200/Mike-Ashley.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mike-ashley-set-miss-sports-13532116", "country": "GB", "domain_rank": 21960, "title": "Mike Ashley set to miss Sports Direct Annual General Meeting, the firm has said", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-25T23:00:00.000+03:00", "replies_count": 0, "uuid": "8adb528311e4e2ba231bea954324378bf4c0968f"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mike-ashley-set-miss-sports-13532116", "ord_in_thread": 0, "title": "Mike Ashley set to miss Sports Direct Annual General Meeting, the firm has said", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Mike Ashley set to miss Sports Direct Annual General Meeting, the firm has said Sports Direct said 'conflicting demands' for the chief executive’s time meant he could not attend the AGM Share Click to play Tap to play The video will start in 8 Cancel Play now Get   \nNewcastle United owner Mike Ashley will miss the upcoming annual general meeting (AGM) for his company Sports Direct , the firm has said. \nSports Direct said “conflicting demands” for the chief executive’s time meant he could not attend the AGM on September 6 at the company’s controversial Shirebrook warehouse in Derbyshire. \nThe meeting will be led by chairman Keith Hellawell, who has promised to step down at the 2017 AGM if minority shareholders oppose his reappointment. Mike Ashley (Image: PA) \nMr Ashley’s decision as the majority shareholder to re-elect Mr Hellawell last year sparked a backlash, with 54% of independent investors voting against the move. \nIn a stock market announcement, Sports Direct said: “The chief executive Mike Ashley recently hosted a detailed and constructive Q&A session with stakeholders in July, and due to conflicting demands for his time in other areas of the business, with the agreement of the board he will not be required to attend this year’s AGM. \n“For the avoidance of doubt, our chief executive and other members of the board will continue to engage with stakeholders in accordance with the engagement statement, which is available on the company’s corporate website.” Read More Mike Ashley's Sports Direct increases stake in Goals Soccer Centres \nThe retailer also revealed that it would call time on the open day event that had accompanied the AGM and involved Mr Ashley leading a tour of his Shirebrook empire. \nThe Newcastle United owner drew derision at last year’s open day when he joked that he had been to the casino and pulled a wad of cash from his pocket while demonstrating a mock security search. \nIt was seen as a major mis-step by the retail tycoon who had recently admitted to MPs that some staff had been paid below the minimum wage during a lengthy Parliamentary probe into “Victorian” working practices at Shirebrook. \nSports Direct announced last month that underlying pre-tax profits had tumbled to £113.7 million for the year to April 30 after it was left exposed by the pound’s heavy falls following the Brexit vote. Like us on Facebook", "external_links": [], "published": "2017-08-25T23:00:00.000+03:00", "crawled": "2017-08-25T23:05:06.008+03:00", "highlightTitle": ""}