{"organizations": [], "uuid": "ad9936dad0b5abe5e80c6905863ae1cccdf48594", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13461573.ece/ALTERNATES/s1200/Durham-Book-Festival-2017.jpg", "site_section": "http://www.thejournal.co.uk/culture/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/whos-coming-durham-book-festival-13461562", "country": "GB", "domain_rank": 21960, "title": "Who's coming to Durham Book Festival? Here are some of the famous names", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-11T18:00:00.000+03:00", "replies_count": 0, "uuid": "ad9936dad0b5abe5e80c6905863ae1cccdf48594"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/whos-coming-durham-book-festival-13461562", "ord_in_thread": 0, "title": "Who's coming to Durham Book Festival? Here are some of the famous names", "locations": [], "entities": {"persons": [{"name": "roddy doyle", "sentiment": "negative"}, {"name": "harry potter", "sentiment": "negative"}, {"name": "david almond", "sentiment": "negative"}, {"name": "gwendoline riley", "sentiment": "none"}, {"name": "jen campbell", "sentiment": "none"}, {"name": "alexei sayle", "sentiment": "none"}, {"name": "booker", "sentiment": "none"}, {"name": "andrew mcmillan", "sentiment": "none"}, {"name": "jenni murray", "sentiment": "none"}, {"name": "lionel shriver", "sentiment": "none"}, {"name": "stephen mcgann", "sentiment": "none"}, {"name": "tracy chevalier", "sentiment": "none"}, {"name": "roddy doyle  roddy doyle", "sentiment": "none"}, {"name": "peter snow", "sentiment": "none"}, {"name": "rachel reeves", "sentiment": "none"}, {"name": "ross raisin", "sentiment": "none"}, {"name": "jane housham", "sentiment": "none"}, {"name": "amy sparkes", "sentiment": "none"}, {"name": "adelle stripe", "sentiment": "none"}, {"name": "benjamin myers", "sentiment": "none"}, {"name": "alan hollinghurst", "sentiment": "none"}, {"name": "louise welsh", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "harriet harman", "sentiment": "none"}, {"name": "kapka kassabova", "sentiment": "none"}, {"name": "gordon burn", "sentiment": "none"}, {"name": "lara pawson", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "tony robinson", "sentiment": "none"}, {"name": "chris ryan", "sentiment": "none"}, {"name": "michael chaplin", "sentiment": "none"}, {"name": "sinéad morrissey", "sentiment": "none"}, {"name": "sara ogilvie", "sentiment": "none"}, {"name": "denise mina", "sentiment": "none"}, {"name": "rachel joyce", "sentiment": "none"}, {"name": "colette bryce", "sentiment": "none"}, {"name": "coun ossie johnson", "sentiment": "none"}, {"name": "john tomaney", "sentiment": "none"}, {"name": "gordon", "sentiment": "none"}, {"name": "tara gergin", "sentiment": "none"}, {"name": "ann macmillan", "sentiment": "none"}, {"name": "david keenan", "sentiment": "none"}, {"name": "shamsie", "sentiment": "none"}, {"name": "robert webb", "sentiment": "none"}, {"name": "prof tomaney", "sentiment": "none"}, {"name": "sophie hannah", "sentiment": "none"}, {"name": "harold fry", "sentiment": "none"}, {"name": "chloe daykin", "sentiment": "none"}, {"name": "ilse brauchmann", "sentiment": "none"}, {"name": "kamila shamsie", "sentiment": "none"}, {"name": "paddy clarke ha ha ha", "sentiment": "none"}, {"name": "doug johnstone", "sentiment": "none"}, {"name": "anna disley", "sentiment": "none"}, {"name": "david goodhart", "sentiment": "none"}, {"name": "rebecca wilkie", "sentiment": "none"}, {"name": "frank", "sentiment": "none"}, {"name": "black teeth", "sentiment": "none"}], "locations": [{"name": "durham town hall", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "clayport library", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "new writing north", "sentiment": "none"}, {"name": "felling", "sentiment": "none"}, {"name": "town hall", "sentiment": "none"}, {"name": "palace green library", "sentiment": "none"}, {"name": "pearl earring", "sentiment": "none"}, {"name": "petina", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "felling-on-tyne", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "durham cathedral", "sentiment": "negative"}, {"name": "franklin", "sentiment": "none"}, {"name": "lumiere", "sentiment": "none"}, {"name": "jk rowling", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "leeds west", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "publisher walker books", "sentiment": "none"}, {"name": "durham johnston school", "sentiment": "none"}, {"name": "arts council england", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Who's coming to Durham Book Festival? Here are some of the famous names David Almond and Harry Potter in Durham Cathedral will be there with Roddy Doyle, Harriet Harman, Rachel Joyce and many more Share Click to play Tap to play The video will start in 8 Cancel Play now Get what's on   Thank you for subscribing!   \nSocial media was abuzz with talk of Harry Potter screenings in the cathedral when Durham Book Festival was launched this week in the Palace Green Library. \nAs has been reported, 1,500 tickets for the three October showings of Harry Potter and the Philosopher’s Stone will go on sale on August 21. \nBut while JK Rowling has captivated young readers around the world with her stories of magic, so has another – and he is from the North East and was at the launch. \nDavid Almond first came to wide public attention, after a near lifetime’s writing, with the publication of Skellig in 1998, the year after JK Rowling emerged with that first Harry Potter title. David Almond with his Big Read book at the launch of Durham Book Festival 2017 (Image: ncjMedia) \nThis year a collection of his short stories, Half a Creature from the Sea, has been chosen as Durham Book Festival’s Big Read. \nPublisher Walker Books has produced 3,000 copies of the book to be distributed free across the county. \nIn schools, libraries, prisons, businesses and university departments they will be reading it, either cover to cover or dipping in, reading the eight stories in random order. \n“It’s a book set mainly in Felling-on-Tyne which is where I come from,” David said at the launch. \n“When I was a kid I knew I wanted to be a writer and people would say, when I was walking down the street, ‘What do you want to be, son?’ \n“I’d say, ‘I want to be a writer’ and they’d say, ‘You’d have to have a good imagination, son’. \n“That was terrifying. The word ‘imagination’ is very scary. \n“But they’d say, ‘You just live in Felling. What are you going to write about? Where is your material? \n“One of the things I’ve discovered in my career is that actually the way to become universal is to take the local, something very specific to you, and find the universal inside it, the extraordinary inside the ordinary. \n“Because we all think our life is very ordinary, but of course it isn’t.” \nA writer’s challenge, he concluded, was to show the supposedly ordinary world in all its wonder and glory. \nDavid Almond has certainly done that. \nAs well as contributing the Big Read book, David will be appearing at the Gala Theatre on October 14 in a festival event called The Books That Made Me. \nHe is also going in to Durham Johnston School on October 11 to talk to pupils about the Big Read book and his career as a writer. \nAlso speaking at the launch was Coun Ossie Johnson who has taken over the culture portfolio at the county council. \nHe said Arts Council England’s recent decision to continue its funding of Durham’s portfolio of festivals – also including the brass festival and Lumiere – was “a great endorsement of Durham County Council’s investment in the culture of the region”. \nBook festival manager Rebecca Wilkie, from New Writing North, said that with 73 events featuring more than 100 speakers, this was the biggest ever and also “probably one of the strongest programmes”. \nWhile it boasted a host of famous names, it also featured more Durham University academics, out to share their specialist knowledge with the public. \nAnna Disley, New Writing North’s acting chief executive, said: “Durham Book Festival provides a shared space for people to contemplate and engage with ideas and stories that help us make sense of our increasingly complex and often tumultuous world. \n“We are pleased once again to welcome to Durham some of the country’s most exciting writers, thinkers and artists, and we look forward to welcoming audiences to join the conversation.” \nHere are some of the highlights... FOR CHILDREN Artwork for Do Not Enter the Monster Zoo, a Durham Book festival show (Image: Sara Ogilvie) \nAs well as the screenings of Harry Potter and the Philosopher’s Stone in Durham Cathedral (October 6 and 7), the festival is putting a show on the road. \nNew Writing North’s production of Do Not Enter the Monster Zoo is an adaptation of the picture book written by Amy Sparkes and illustrated by Sara Ogilvie. \nBilled as “a theatre production with music for children under seven and their families”, it will be touring to more than 20 County Durham libraries and community centres from September 23 - find details at www.monsterzootour.com . \nChloe Daykin, author of Fish Boy, will host workshops for youngsters aged seven plus at Clayport Library, Durham, on October 7 and Jen Campbell, author of Franklin’s Flying Bookshop, will be at the same venue on October 14 for a “cosy storytime” suitable for children aged three to five. \nDurham Johnston School is also hosting a string of events. FICTION Irish author Roddy Doyle \nRoddy Doyle, famous for The Commitments and his Booker Prize-winning Paddy Clarke Ha Ha Ha, has a new novel coming out. It’s called Smile and he’s putting in a first festival appearance to talk about it. \nCatch him at the Gala Theatre on October 9. \nHe’s not the only Booker winner heading for the festival. Alan Hollinghurst, whose The Line of Beauty won in 2004, will be at Durham Town Hall on October 13 to talk about his latest, The Sparsholt Affair, which spans the years of the Second World War to the present decade. \nRachel Joyce, who hit the big time with The Unlikely Pilgrimage of Harold Fry, will also be at the Town Hall on October 13 to talk about The Music Shop, which tells of Frank, who owns a music shop, and customer Ilse Brauchmann. Author Rachel Joyce (Image: newcastle chronicle) \nTracy Chevalier, famous for Girl with a Pearl Earring, will share billing with Kamila Shamsie at Durham Town Hall on October 15 to talk about her latest novel, New Boy. \nShamsie’s novel, Home Fire, tells of a girl caught between her headstrong sister and Jihadist brother. \nIf crime fiction’s your thing, best be in Durham on October 14 when Doug Johnstone, Louise Welsh, Jane Housham and Sophie Hannah will be among those holding court. NON-FICTION Harriet Harman (Image: PA) \nFestival strands dedicated to Politics and Society, Memoir, History and others will bring a broad cross-section of writers to Durham. \nDavid Goodhart will talk about his book The Road to Somewhere, looking at politics in the era of Trump and Brexit. \nAmong those introducing their life stories will be Robert Webb, the comedian, actor and writer, actor and presenter Tony Robinson, Labour politician Harriet Harman and Call The Midwife actor Stephen McGann. Sir Tony Robinson (Image: PA) \nJenni Murray, the Woman’s Hour presenter, will introduce her A History of Britain in 21 Women, and journalists Peter Snow and his wife Ann MacMillan will talk about War Stories, a tale of 34 people who were swept up in the turbulence of war. \nAuthor and ex-SAS man Chris Ryan will also be back on home soil, presenting a session at the Gala Theatre (October 14) called SAFE. \nHe will explain what to do if caught up in an alarming situation such as a riot. POETRY \nThis year’s festival laureate is Andrew McMillan, whose award-winning debut collection, Physical, was published two years ago. \nHe has organised a Poetry Gala featuring 12 poets from across the north of England who are making waves. \n“I wanted to shine a light on poets who you should be reading and, more importantly, hearing,” he says. \nHear them in Rich Seams: A New Generation of Poets from the North at Durham Town Hall on October 14. \nThe performance is to be recorded on vinyl by crowd-funding publisher, Unbound. \nThe Newcastle-based Poetry Book Society is also involved, having organised a showcase at Palace Green Library on October 7 featuring Sinéad Morrissey, Colette Bryce and Tara Gergin, billed as “three stunning Irish voices”. COMMISSIONS \nDurham Book Festival always commissions new work and The News as a Novel is one of this year’s. \nFour very different writers – Lionel Shriver, Alexei Sayle, Benjamin Myers and Petina Gappah – have been set the task of producing a piece of writing in response to this year’s turbulent news. Comedian and actor Alexei Sayle (Image: Daily Mirror) \nIt’s an idea inspired by the late Gordon Burn. The Newcastle-born writer took the events of 2007 and turned it into Born Yesterday: The News as a Novel, an experimental \nwork of fiction about the way the media creates and manipulates the stories we see or read. \nIt was published in 2008, the year before Burn’s death. Read More Harry Potter screenings in Durham Cathedral - how to get your tickets \nThe event will come to fruition at Durham Town Hall on October 13. \nMeanwhile Rachel Reeves, MP for Leeds West, and Prof John Tomaney will be looking at Labour in the North at Palace Green Library on October 8. \nMichael Chaplin will chair the event for which Prof Tomaney was commissioned to write a piece about the party’s history of political dominance in the region. \nAnother piece of writing, commissioned from award-winning author Ross Raisin, will look at masculinity in the post-industrial North East. \nIs there a crisis in what it means to be a bloke? \nThat’s the question he and others have been exploring and you can hear his conclusions on the same datre and at the same place as above. GORDON BURN PRIZE \nThe prestigious annual competition honours the memory of the aforementioned writer with a £5,000 prize and a writing retreat. \nSix books have been shortlisted this year with the winner to be announced on October 12 at Durham Town Hall. \nThey are... Border: A Journey to the Edge of Europe by Kapka Kassabova; This is Memorial Device by David Keenan; The Long Drop by Denise Mina; The is the Place to Be by Lara Pawson; First Love by Gwendoline Riley; and Black Teeth and a Brilliant Smile by Adelle Stripe. \n* For the Durham Book Festival programme and to book tickets go to www.durhambookfestival.com or tel. 03000 266600. Like us on Facebook", "external_links": [], "published": "2017-08-11T18:00:00.000+03:00", "crawled": "2017-08-11T18:19:53.000+03:00", "highlightTitle": ""}