{"organizations": [], "uuid": "fe428bce1043effa6d7e7c852b95a4dda771491d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13440550.ece/ALTERNATES/s1200/JS107775551.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13440554", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Pubs need £5,000 cut in 'rocketing' business rates, campaigners claim", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-07T10:25:00.000+03:00", "replies_count": 0, "uuid": "fe428bce1043effa6d7e7c852b95a4dda771491d"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13440554", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Pubs need £5,000 cut in 'rocketing' business rates, campaigners claim", "locations": [], "entities": {"persons": [{"name": "colin valentine", "sentiment": "none"}, {"name": "carr", "sentiment": "none"}, {"name": "john craggs", "sentiment": "none"}, {"name": "sean hughes", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "tim davies", "sentiment": "none"}, {"name": "jonathon manning sunderland", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "gentoo", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cheshire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "carlisle", "sentiment": "negative"}, {"name": "key event carr's group plc", "sentiment": "neutral"}, {"name": "camra", "sentiment": "none"}, {"name": "st albans", "sentiment": "none"}, {"name": "carr’s group", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "nuvision engineering, inc", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "campaign for real ale", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tenant farmers association", "sentiment": "none"}, {"name": "group plc", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "esi holdings", "sentiment": "none"}, {"name": "cla", "sentiment": "none"}, {"name": "nuvision", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "usa department of energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Street-trading app gets £500,000 boost to expand network \nA London start-up that aims to modernise street trading has secured half a million pounds in funding from Singaporean fund BOH. \nStreetDots works with private and public landowners to open pitches, or “dots”, that can be booked by traders via an app. \nThe cash injection, which values the firm at £4.4m, comes after BOH pumped £350,000 into the company as an initial investment in January. \nStreetDots will use the investment to expand its network of dots from 50 to 200 over the next twelve months, as well as extending its focus from street food vendors to include “artisan producers” and retail brands wanting to reach new customers. \nFounded by Atholl Milton and Darren Callcott in 2014, StreetDots works with landlords including British Land and Land Securities. It has also recently struck deals with the likes of Blackstone and NewRiver. \nMr Milton said: \nWe’re not only hoping to streamline the business of outdoor retail trading, we’re hoping to grow the market. \nUK street trading laws are guided by legislation that is over a century old and its processes seem to be stuck in about the same era. \nOur vision is a digitally managed UK-wide network of dots that enliven our streets and bring the country’s most innovate businesses direct to customers. Cash (Image: PA) KEY EVENT Beloved Ouseburn café shuts its doors but plans pop-up events throughout summer \nA much-loved pizzeria and art café in the heart of the Ouseburn valley has closed its doors, planning instead to run a number of pop-up restaurants until it finds a new home. \nThe Tower Cafe has moved out of its premises at Uptin House, on Stepney Road, after the business’ landlord give them a month’s notice to leave the site. \nBut the family business, which is run by Stephano Congiu and Sophie Nadim, has said it intends to continue to serving its signature pizzas through a series of pop-up events throughout the region. \n“We will do pop-up events,” said Mr Congiu. “The next one will be in the Tyne Bank Brewery. We will then do more around the city until we find a new premises. \n“Me and my partner, Sophie, want to find a new premises in one or two months.” \nHe added: “The right location for The Tower Cafe is in Ouseburn but at the moment the business is open to any offer.” \nThe first pop-up event at the Tyne Bank Brewery will be held on August 19 at the Nowt Special art show. Local DJs, artists and performers will be at the event to showcase their work. \nAfter being given its notice The Tower Cafe decided to close the restaurant before the month was through, telling its customers on Facebook that it was “more beneficial to the business to shut up shop sooner rather than later”. \nBut Mr Congiu said the move out of the building was unrelated to Adderstone Group’s plans to create more student accommodation in the area. The Tower Cafe has moved from its home at Uptin House, Ouseburn (Image: Facebook) 9:20 Jonathon Manning Pre-pay energy customers to see bills fall as Ofgem lowers price cap \nThree million households are to see their energy bills fall by up to £19 a year as the regulator lowers a price cap aimed at protecting pre-payment customers. \nThe change, which comes into force on October 1, will see the average annual dual fuel bill for pre-payment customers cut from £1,067 to £1,048, Ofgem said. \nThe watchdog introduced a temporary safeguard tariff in April and will update it every six months based on the estimated cost of supplying energy. \nIt comes after British Gas last week said it will hike electricity prices by 12.5% for 3.1m customers, a move condemned by the Government and branded a “slap in the face” for families. \nBritish Gas was the last of the Big Six providers to increase prices after it promised in December last year to freeze tariffs until August, with its rivals opting to raise bills at the start of the year. \nThe safeguard tariff is aimed at protecting pre-payment meter customers - primarily those on poor- value standard variable tariffs - from paying too much for their energy. It applies to households who pre-pay for their energy, mostly with traditional coin or token-operated pre-payment meters. \nThey are among those least able to benefit from competition and are more likely to be in vulnerable circumstances, Ofgem added. The safeguard tariff is one of the Competition and Markets Authority’s (CMA) remedies stemming from its two-year investigation into the energy market. Theresa May has promised a cap on energy prices but will the DUP agree? (Image: Free editorial use) 9:15 KEY EVENT New electronics manufacturer opens in Ashington saving 24 jobs \nA new circuit board assembly plant has been opened in Ashington, saving 24 jobs and promising to boost its production over the coming months. \nArian EMS has been set up by Malcolm Humble, founder of Opsol and former managing director of electronic manufacturer Infoteam. \nMr Humble was appointed as managing director of Hebburn-based Infoteam in December but said that growing the business would have required too much investment to make it worthwhile. As a result Infoteam ceased trading on June 30. \nFollowing the closure Mr Humble launched Arian EMS to service Infoteam’s former clients and brought in 24 former Infoteam employees into the new business. \nMr Humble said: \nThe key for me was saving the people’s jobs. Those that were working in Hebburn, if the company to be put into administration they would have lost their jobs. A huge percentage have transferred to Arian. \nIncluding those who have joined from Infoteam, the new business has 32 members of staff. As part of the agreement with Infoteam, all of the business’ assets, customers and goodwill have been transferred to Arian. \nThe new firm has moved into a 16,000sq ft facility at Wansbeck Business Park in Ashington. The site consists of 12,000sq ft of manufacturing space and 4,000sq ft of offices. Malcolm Humble founder of Arian EMS (Image: Unknown) 9:10 Jonathon Manning Paddy Power Betfair boss to step down after 16 years \nBreon Corcoran, the boss of Paddy Power Betfair, is to step down after 16 years with the bookmaker. \nHe will be replaced by Worldpay chief executive Peter Jackson, who has been appointed following a “rigorous and extensive succession process”, the company said. \nMr Corcoran, a gambling sector veteran, was instrumental in the £7bn merger between Paddy Power and Betfair, which he previously headed. \nHe said: \nThis was a very difficult decision to make, and there is never a good time to leave, but this is the right decision for me and my family, and following the successful completion of the merger integration it is an opportune time for the business too. \nPaddy Power Betfair paid tribute to Mr Corcoran’s role in moving the business to digital and in developing a mobile offering. \nPrior to Worldpay, Mr Jackson was chief executive of Travelex Group from 2010 until its sale in 2015. In 2016 he led the innovation at Banco Santander and, between 2002 and 2010, he held a series of roles in the retail bank at Lloyds Banking Group and HBOS. \nHe has also been a non-executive director of Paddy Power Betfair since 2016. The firm, which is to announce its half-year results on Tuesday, will report revenue growth of 9% and underlying earnings up 21%. \nIt will also confirm that trading is in line with expectations and provide guidance for full-year 2017 underlying earnings of between £445m and £465m. Paddy Power Betfair logo KEY EVENT Carr's Group PLC acquires US engineering firm \nCarlisle agriculture and engineering firm Carr’s Group PLC has acquired a US engineering firm NuVision in a deal worth up to £15.4m ($20m). \nNuVisinson was founded in 1971 and has bases in Pittsburgh, Pennsylvania with operations in Charlotte, North Carolina. The company provides technology and applications to commercial nuclear and power plant facilities, as well as government waste facilities. \nNuVision’s customers include the USA Department of Energy, major nuclear energy suppliers, public utilities, and international governments. \nCarr’s Group carried out the deal by acquiring 100% of NuVision’s parent company ESI Holdings. The deal involves an initial cash consideration of $11.5m (£8.8m) and a total cash consideration of up to $20m (£15.4m) dependent on future performance. \nTim Davies, Carr’s Group Ceo CEO, said: \nI am delighted to announce the acquisition of NuVision Engineering, Inc. This acquisition lays the foundations for growth into the USA and wider international nuclear markets and provides us with access to specialised IP and a strong pipeline of long term contract opportunities. Additionally, this presents a significant opportunity for us to expand our existing remote handling operations into the USA market. \nThe management team at NuVision have created long lasting and sustained relationships with a number of major nuclear customers and we look forward to building on this and continuing to invest in the business and the team. \nThe firm said the acquisition would provide it with a strong foothold into the main nuclear markets in the US. \nAt close of play on Friday Carr’s Group shares were 142p. As the market opened this morning the shares had rose in value to 145p before dropping slightly to 144.75p at the time of writing. 9:00 FTSE and pound update \nThe FTSE-100 index at 8:15am was up 16.73 at 7528.44. \nThe pound at 8am was 1.3045 dollars compared to 1.3034 dollars at the previous close. The euro at 8am was 0.9034 pounds compared to 0.9017 pounds at the previous close. 8:55 Jonathon Manning Farming coalition calls on the Government to bring in transitional deal for Brexit \nAn unprecedented coalition of farming associations has called on the Government to arrange transitional agreements as the UK leaves the European Union to protect the agricultural industry from “risks and uncertainties”. \nFourteen farming organisations - including the NFU, the CLA and the Tenant Farmers Association - have come together to issue a joint statement which calls on the Government to provide short-term certainty for the industry as the decision to leave the European Union and the Common Agricultural Policy draws closer. \nThe organisations have called on the Government and the devolved administrations to work together with the farmers and land managers to prepare for a free trade agreement which retains and grows opportunities for food trade with the EU and the rest of the world. \nThey are also calling for commitments on transition that will see the UK remain in the Customs Union until a full free trade agreement is in place with the EU. \nThe statement comes after a Brexit roundtable which saw a broad range of farming organisations come together to provide a united voice for the agricultural sector. \nIt says: \nExiting the European Union and the Common Agricultural Policy has sweeping implications for UK farming. UK farming is a vital part of the national economy, contributing in excess of £24b of revenues and around £8.5bn of Gross Value Added to the UK economy in 2015. It also accounts for over 500,000 jobs. It is also responsible for the management of our farmed countryside which makes up around 70% of the total UK land mass. \nLooking to the future, there are many opportunities to increase markets for our products, to drive innovation and new investment into our industry, to increase our productive efficiency, to upskill our workforce and to establish new, simpler and more effective means of supporting farmers and land managers to deliver a range of benefits to society. \nThe process of exiting the EU brings risks and uncertainties that have to be managed. That is why we are calling on the UK Government to seek to secure an agreement on an initial transition period through which the UK retains unfettered access to European markets, remaining within the Customs Union. Such arrangements must be in place for the full duration of negotiations and implementation of a Free Trade Agreement between the UK and the EU that could extend beyond the end of Article 50 process. \nWe are committed to working with the UK Government to maintain the high standards of quality, welfare and provenance that sets out UK food in domestic and international markets. This includes supporting the UK’s world leading assurance schemes like Red Tractor, that are critical to the UK brand. As well as maintaining a commitment to maintain and champion UK standards in trade policy with the EU and the rest of the world. A combine harvester in a field (Image: Owen Humphreys/PA Wire) 8:51 Jonathon Manning Sunderland's Gentoo named as one of most responsible businesses in the country \nA North East firm has been named as one of the UK’s most responsible businesses after achieving a five-star rating in a national index. \nSunderland housing group Gentoo was one of only four in the country to receive five stars in Business in the Community’s 2017 Corporate Responsibility Index (CR Index), and achieved the score for the third year running. \nThe CR Index measures how companies integrate responsible business practices into how they operate. It takes into account a number of indicators such as how firms respond to global trends, act in a sustainable way, and how transparent their pay policies are. \nJohn Craggs, chief executive officer at Gentoo, said: \nGentoo is delighted to be awarded five stars in the Corporate Responsibility Index for the third year running. We believe that being a responsible business starts with our vision and values. \nIt’s about how we translate our values of working together and doing the right thing to inspire people and build strong communities. \nGentoo will continue to work alongside other businesses in the future as well as its supply chain to ensure best practice is shared so as to continue being a proud ambassador of the responsible business agenda. \nOver the past year Gentoo has worked to improve local communities where it operates, mostly in the North East. John Craggs KEY EVENT Pubs need £5,000 cut in 'rocketing' business rates, claim campaigners \nThe Government is being urged to stop pubs from being driven out of business by introducing a £5,000 annual reduction on their “rocketing” business rates. \nReviews of business rates across England are seeing many pubs hit with a “massive” new financial burden, according to the Campaign for Real Ale. \nThe “sky-high” tax burden is contributing to 21 pub closures a week, said the campaign group. \nSean Hughes, landlord of The Boot pub in St Albans, which has stood on its site since the 16th century, is set to see his rates bill soar by 280% over the next five years from £14,000 a year to £52,000. He said: \nOur new business rates bill means that we would have to sell an additional 22,000 pints of beer a year just to pay for the increase. I can’t see how we’re going to do that - it leaves us in a very difficult situation. \nWe’ve already had to increase our beer prices by 10p per pint, and expect that to increase to 35p a pint. If our customers can’t afford a pint at the pub they will go elsewhere, which means that our historic pub of 600 years may cease to run as a public house. We urgently need support from the Government to continue trading. \nColin Valentine, Camra’s chairman, speaking ahead of the group’s annual beer festival in London this week, said: \nTaxes now make up more than a third of the cost of a pub pint. Despite the fact that pubs currently account for 0.5% of turnover of the UK economy, they are still paying 2.8% of the business rates. \nThis is frankly unsustainable, and it is the consumer that will ultimately pay the price - whether it’s when their beloved local closes down or when the price of their pint goes up. \nIt’s clear that most of us believe that pubs need our help and recognise the vital role that they play in local communities. From celebrating a special occasion to meeting up with friends after work, pubs are an integral part of many people’s social lives. Business rate relief is urgently needed in order to ensure their continued survival. The boarded up exterior of a closed pub in Cheshire, as the Government is being urged to stop pubs from being driven out of business by introducing a £5,000 annual reduction on their \"rocketing\" business rates. (Image: Martin Rickett/PA Wire) Share ", "external_links": [], "published": "2017-08-07T10:25:00.000+03:00", "crawled": "2017-08-07T11:08:26.002+03:00", "highlightTitle": ""}