{"organizations": [], "uuid": "c53807b59dd91553008e8c39c4c26f661fb8d938", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/incoming/article336073.ece/ALTERNATES/s1200/A361-link-road-vs-dual-carriageway.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/mp-major-problems-locals-hopes-335946", "country": "US", "title": "MP: 'Major problems' with locals' hopes for dual carriageway on A361 link road - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.134, "site_type": "news", "published": "2017-08-16T19:56:00.000+03:00", "replies_count": 0, "uuid": "c53807b59dd91553008e8c39c4c26f661fb8d938"}, "author": "Lauren Harris", "url": "http://www.devonlive.com/news/devon-news/mp-major-problems-locals-hopes-335946", "ord_in_thread": 0, "title": "MP: 'Major problems' with locals' hopes for dual carriageway on A361 link road - Devon Live", "locations": [], "entities": {"persons": [{"name": "heaton-jones", "sentiment": "none"}, {"name": "dave black", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrea davis", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "north devon link road", "sentiment": "none"}], "organizations": [{"name": "devon county council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Comments \nThe MP for North Devon has said there are “major problems” with residents’ hopes for the A361 link road to be turned into a dual carriageway. \nPeter Heaton-Jones has promised to make upgrading the North Devon Link Road a priority, regardless of other distractions for the central government like Brexit, but though many people have been pushing for a full dual carriageway from Tiverton to Barnstaple, he has decided this is not the best plan. \nIn Mr Heaton-Jones most recent newsletter, he said there are two major problems with this idea, the first of which is the “prohibitive” cost. Read More Police say no action against driver of bus which hit child in Exeter city centre \nHe said: “I’ve been given estimates well in excess of half a billion pounds, and it could be much more. Bluntly, bidding for that amount of money simply would not be successful. We’d then be in the position of having a plan which we can’t get off the ground, and we’d be back to square one. Peter Heaton-Jones \n“Secondly, a dual carriageway would take too long to deliver. I’ve been told that the planning process alone could last ten years, not least because the land acquisitions would trigger a full public inquiry. \n“Incidentally, there’s an urban myth that the corridor on which the current road sits is already wide enough to accommodate a full dual carriageway. It’s not true, I’m afraid. Bearing all this in mind, I am persuaded that the current Devon County Council proposals present us with a far more realistic opportunity of getting significant improvements in a reasonable time frame.” \nThe MP said he had already been contacted by a number of people who are worried about the current plans, and he wants their “perfectly fair” concerns addressed. Read More Dashcam footage shows yet another near miss on infamous A361 link road \nHe met Dave Black, Devon County Council’s head of planning, and Councillor Andrea Davis, cabinet member in charge of infrastructure, to raise the issues and said they agreed the worries needed to be taken into careful consideration. \nMr Heaton-Jones said: “Some residents around Barnstaple have told me they’re concerned that the new four-lane section might encroach on their back gardens, mean the loss of some trees, and create extra noise. There are also people worried about the environmental effects of a busier road. \n“The public consultation has just finished and many people have taken part, but I know some residents felt it didn’t give sufficient opportunity to state their case, or simply want more information. \n“I have therefore agreed with the county council that I will arrange a meeting between residents and council officials to discuss this further. It’s really important that people get their voices heard.” Like us on Facebook ", "external_links": [], "published": "2017-08-16T19:56:00.000+03:00", "crawled": "2017-08-22T14:38:25.004+03:00", "highlightTitle": ""}