{"organizations": [], "uuid": "eb3980b44ea0c33e79014f286c633f0bf40d5edc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i3.leicestermercury.co.uk/incoming/article147860.ece/ALTERNATES/s1200/A-worker-at-Image-Scan-Holdings-factory.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/comment-bank-england-expert-confirms-368617", "country": "US", "domain_rank": 48128, "title": "Comment: Bank of England expert confirms \"Firms are investing less because of uncertainty over Brexit\" - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.217, "site_type": "news", "published": "2017-08-23T15:45:00.000+03:00", "replies_count": 0, "uuid": "eb3980b44ea0c33e79014f286c633f0bf40d5edc"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/comment-bank-england-expert-confirms-368617", "ord_in_thread": 0, "title": "Comment: Bank of England expert confirms \"Firms are investing less because of uncertainty over Brexit\" - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "chris gordon", "sentiment": "negative"}, {"name": "norasit kaewsai", "sentiment": "none"}, {"name": "alastair cunningham", "sentiment": "none"}, {"name": "alistair cunningham", "sentiment": "none"}], "locations": [{"name": "barrow", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "bank of england", "sentiment": "negative"}, {"name": "bank rate", "sentiment": "none"}, {"name": "mpc", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "bank of england’s agency", "sentiment": "none"}, {"name": "monetary policy committee", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "bank’s agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Companies like Image Scan in Barrow upon Soar keep the economy ticking over (Image: Chris Gordon) Share Comments \nI always enjoy the conversations I have each day with those running businesses, charities and other organisations here in the East Midlands, writes Alistair Cunningham, agent for the Bank of England in the East Midlands. \nThese discussions provide an up-to-the-minute insight into what’s really happening in the economy across the United Kingdom. \nAnd at the moment there’s certainly no shortage of things to talk about – whether that’s the prospect of Brexit, the rise in inflation or the challenge of finding skilled staff. \nThe information gathered by me and my colleagues in the Bank of England’s Agency network feeds directly into our policymakers in London as they make \ndecisions on how best to guide the economy through these somewhat uncertain times. \nThe Bank recently published its August Inflation Report, its latest quarterly assessment of the outlook for the economy. Alastair Cunningham, Agent for the Bank of England in the East Midlands \nIt also announced that Bank Rate, which is a reference point that banks use when setting interest rates on savings and loan products used by households and businesses, would remain on hold for the time being at 0.25 per cent. \nThe Monetary Policy Committee – which sets Bank Rate – also said the rate would likely have to rise in the coming years in order for the MPC to hit its 2 per cent inflation target. \nInflation is currently above that figure, largely because the value of the pound fell sharply following the vote to leave the European Union. \nWeaker sterling makes imports more expensive for UK companies and that has resulted in higher prices for UK households. \nWe expect inflation to peak towards the end of this year at around 3 per cent, before falling back towards 2 per cent. \nMeanwhile, wages have increased more slowly than inflation, so households’ real spending power has been squeezed. \"We expect growth to be a bit slower than last year, mainly due to weaker household spending\" (Image: Norasit Kaewsai) \nAt the same time, unemployment levels are the lowest they have been since the 1970s, which means many companies are finding it harder to recruit new staff. \nIt’s a story I hear frequently when I speak to employers in Leicestershire who tell me that finding the right people is getting harder – for a wide range of jobs and skills – particularly in engineering, construction and professional services. \nIn some cases, firms are responding by increasing wages. \nThe Monetary Policy Committee expects that wage increases will pick up in the coming years. \nAlong with the fall back in inflation, these rising wages should support household spending. \nWe expect UK growth to be a bit slower this year than last, mainly due to the weakness in household spending. \nBut there are other factors that are helping UK growth, including a stronger outlook for exports. \nDozens of jobs save as Brands 2 Hands snapped up in pre-pack deal \nThis stronger outlook comes from the recovery in world growth and the fall in the pound, which together should also encourage businesses to invest more. \nEven if the transition to Brexit is smooth, uncertainty about the eventual trading arrangements is likely to mean that firms will invest less than they otherwise would. \nUK Tech list: 35 companies showing the best of innovation and technology in the UK \nThis is consistent with what my colleagues and I in the Bank’s Agency network hear in our conversations with businesses. \nMany businesses remain uncertain about what Brexit means for them, which might discourage them from investing, perhaps because of fears that barriers to exporting might rise in the future. \nSo, investment is lower than might be expected given the current low cost of borrowing and the fact that some businesses are busy enough that they might benefit from buying new plant and equipment. \nOverall, we expect growth to be modest over the next three years. \nThe Bank will continue to keep a close watch on the economy and it stands ready to respond to changes in the economic outlook as they unfold to ensure a sustainable return to 2 per cent inflation. \nAnd we, the Bank’s Agents in the East Midlands, will continue to play our part in that, acting as ‘the eyes and ears’ of the Bank around the UK. \nYou can keep up to date with what we’re hearing from our contacts here in the East Midlands and beyond by reading the reports on our website here. Like us on Facebook ", "external_links": [], "published": "2017-08-23T15:45:00.000+03:00", "crawled": "2017-08-23T18:13:26.000+03:00", "highlightTitle": ""}