{"organizations": [], "uuid": "855cd84ee07d04cbeb1aedbe788bd43550fce1ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13412070.ece/ALTERNATES/s1200/The-Audi-VR-experience-created-by-Gateshead-company-Zerolight-mixes-precise-technical-detail-with.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/new-government-fund-aims-help-13412004", "country": "GB", "domain_rank": 21960, "title": "New Government fund aims to help create more tech 'unicorns'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-01T02:01:00.000+03:00", "replies_count": 0, "uuid": "855cd84ee07d04cbeb1aedbe788bd43550fce1ab"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/new-government-fund-aims-help-13412004", "ord_in_thread": 0, "title": "New Government fund aims to help create more tech 'unicorns'", "locations": [], "entities": {"persons": [{"name": "visualsoft", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "tombola", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "palringto", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bede gaming", "sentiment": "none"}, {"name": "patient capital review", "sentiment": "none"}, {"name": "european investment fund", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nomad digital", "sentiment": "none"}, {"name": "scott logic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business New Government fund aims to help create more tech 'unicorns' Proposals for a new National Investment Fund could help a number of North East firms tipped for rapid growth Share The Audi VR experience, created by Gateshead company Zerolight, mixes precise technical detail with engaging visual environments (Image: Publicity Pic) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Government will today aim to bridge a £4bn funding gap it says will help hi-tech start-ups match their peers in the US. \nThe proposed new National Investment Fund due to be unveiled by the Chancellor Philip Hammond today is aimed at helping cutting-edge British firms become “unicorns” - companies valued at more than £1bn. \nThe scheme could also help firms access finance after Brexit, with many companies currently scaling-up by accessing investment from the European Investment Fund, which they may lose access to after the UK’s withdrawal from the EU. \nA number of North East firms have been highlighted as potential tech unicorns, including Newcastle ’s Nomad Digital, which was bought by French transport giant at the end of last year, and Sunderland online bingo firm Tombola. Britain's Chancellor of the Exchequer Philip Hammond speaks during the Belt and Road Forum for International Cooperation on May 14, 2017 in Beijing, China (Image: Getty Images AsiaPac) \nThey were among nine North East firms highlighted by tech investor GP Bullhound as tech ‘foals’, with Bede Gaming, Palringto, Performance Horizon, Sale Cycle, Zerolight, Visualsoft and Scott Logic also tipped for growth. \nMr Hammond will today say: “Britain is an innovation powerhouse and it’s vital that we make sure our cutting-edge firms have the funding they need to meet their potential and conquer new markets. \n“Meeting this challenge will boost our productivity and enable us to create more well-paid jobs across the UK.” \nThe fund could be set up as a public-private partnership or be placed fully on the Government’s balance sheet to be sold off once it has established a sufficient track record. \nA consultation on the scheme will also look at how firms could receive investment from pension funds and examine how to commercialise research from UK universities. \nThe consultation is part of the Patient Capital Review announced by Prime Minister Theresa May last November, which intends to boost long-term funding for firms. \nIn a sign of the difficulties faced by start-ups in the UK, fewer than one in 10 firms that receive seed funding here go on to get fourth round investment, compared to nearly a quarter in the US. \nAlthough the UK leads Europe in the creation of unicorns it accounts for just 4% of the world’s total, while the US has 54% of the billion-dollar firms and China accounts for 23%. \nBig US firms are also younger than UK counterparts, suggesting America is more effectively growing new businesses into large-scale companies - just 10 of the UK’s largest 100 listed firms were created after 1975 compared to 19 in the US. Like us on Facebook ", "external_links": [], "published": "2017-08-01T02:01:00.000+03:00", "crawled": "2017-08-01T02:22:53.005+03:00", "highlightTitle": ""}