{"organizations": [], "uuid": "15c4d4e49789e48bccb4a0b8fb00322d137c4980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i4.leicestermercury.co.uk/incoming/article280570.ece/ALTERNATES/s1200/Steve-Coogan.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/leicester-news/steve-coogans-low-key-visit-280534", "country": "US", "domain_rank": 48128, "title": "Steve Coogan's 'low key' visit to Leicester to plan Richard III film revealed - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.145, "site_type": "news", "published": "2017-08-04T15:42:00.000+03:00", "replies_count": 0, "uuid": "15c4d4e49789e48bccb4a0b8fb00322d137c4980"}, "author": "Dan Martin", "url": "http://www.leicestermercury.co.uk/news/leicester-news/steve-coogans-low-key-visit-280534", "ord_in_thread": 0, "title": "Steve Coogan's 'low key' visit to Leicester to plan Richard III film revealed - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "alan partridge", "sentiment": "negative"}, {"name": "richard iii", "sentiment": "negative"}, {"name": "steve coogan", "sentiment": "negative"}, {"name": "philippa langley", "sentiment": "none"}, {"name": "martin traynor", "sentiment": "none"}, {"name": "henry tudor", "sentiment": "none"}, {"name": "coogan", "sentiment": "none"}, {"name": "chris gordon", "sentiment": "none"}, {"name": "will johnston", "sentiment": "none"}, {"name": "jeff pope", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "philomena", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "north norfolk", "sentiment": "none"}, {"name": "leicester cathedral", "sentiment": "none"}, {"name": "partridge", "sentiment": "none"}, {"name": "greyfriars abbey", "sentiment": "none"}], "organizations": [{"name": "bosworth", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "university of leicester", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Steve Coogan's 'low key' visit to Leicester to plan Richard III film revealed The Alan Partridge star is reworking the story behind the king's discovery Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nComedian Steve Coogan has revealed he is working on a film about the discovery of Richard III’s remains under a Leicester car park. \nThe Alan Partridge star’s potential film project is about an ordinary woman who discovered the last Plantagenet king’s body. \nIt has now emerged that the actor made a low key visit to the Richard III visitor centre earlier this year along with writer Jeff Pope, who wrote Philomena in 2013 in which Coogan starred, Read More \nChairman of the centre’s board of trustees Martin Traynor said the pair had not said what the purpose of their visit was at the time but it now appeared clear. Coogan has been inspred by the Richard III story \nHe said: “It looks like they were doing a recce and some research. \n“To be honest, Richard’s discovery was such an amazing story someone was eventually going to write a story about it. \n“Steve Coogan is a really funny comedian and it will be interesting to see what he does with it. Richard's funeral procession goes past the Clocktower (Image: Chris Gordon) \n“It will be fantastic profile for the city and the centre if the film goes ahead. \n“I do hope however that they stick as closely as possible to the facts of what happened.” Read More \nMr Coogan revealed his plans in an interview with the New European while talking about plans for the return of Partridge, North Norfolk’s third most popular radio host, next year as the ‘voice of Hard Brexit''. \nHe explained the Richard III project as follows: “Really, that’s about the amateur-versus-the Establishment, and intuition-versus-academia. \n“Partly, she does her research, partly it’s intuitive.” Read More Richard III campaigners call off play protest \nIt is unclear how much the film’s principal character will be based, if at all, on Ricardian, writer and historian Philippa Langley, who was the driving force in bringing about the real search for the king’s remains by University of Leicester archaeologists. Historian Philippa Langley with Richard III bust (Image: Will Johnston) \nThe discovery of Richard was made in 2013 during archaeological digs under a social services car park in the shadow of Leicester Cathedral. Read More Mother jailed for child cruelty 'will have any future children taken off her' \nRichard’s body has been interred inside the cathedral and the visitor centre has been opened over the actual grave. \nRichard III was originally laid to rest in Greyfriars Abbey after he was defeated and killed by the forces of Henry Tudor at the Battle of Bosworth in 1485. \nHis discovery, proven by DNA testing, laid to rest the myth that Richard’s bones had been scattered in the River Soar. Like us on Facebook ", "external_links": [], "published": "2017-08-04T15:42:00.000+03:00", "crawled": "2017-08-04T18:28:44.000+03:00", "highlightTitle": ""}