{"organizations": [], "uuid": "80628bd71f40bfa18bb3ace7c74e02f8ab3993e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13171574.ece/ALTERNATES/s1200/CS17556538.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13527916", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Outsourcing giant Mitie faces FCA probe into profit warning", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-29T10:30:00.000+03:00", "replies_count": 0, "uuid": "80628bd71f40bfa18bb3ace7c74e02f8ab3993e3"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13527916", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Outsourcing giant Mitie faces FCA probe into profit warning", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "negative"}, {"name": "grainger", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}, {"name": "housebuilder grainger", "sentiment": "none"}, {"name": "jonathon manning gateshead", "sentiment": "none"}, {"name": "hayden wood", "sentiment": "none"}, {"name": "stephen hall of deloitte jonathon manning jobs", "sentiment": "none"}, {"name": "simon parker", "sentiment": "none"}, {"name": "helen gordon", "sentiment": "none"}, {"name": "matthew flinders", "sentiment": "none"}, {"name": "stephen hall", "sentiment": "none"}, {"name": "ross linnett", "sentiment": "none"}, {"name": "dalziel", "sentiment": "none"}, {"name": "robert mcalpine", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "david sproul", "sentiment": "none"}, {"name": "richard wilson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "spinningfields", "sentiment": "none"}, {"name": "npower", "sentiment": "none"}, {"name": "salford", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "william street", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "gore street", "sentiment": "none"}], "organizations": [{"name": "fca", "sentiment": "negative"}, {"name": "dalziel ingredients", "sentiment": "none"}, {"name": "sse", "sentiment": "none"}, {"name": "uk land and property", "sentiment": "none"}, {"name": "edf", "sentiment": "none"}, {"name": "recite me", "sentiment": "none"}, {"name": "rmt accountants & business advisors", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "rmt", "sentiment": "none"}, {"name": "salford city council", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "centre of excellence", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Bunzl profits rise amid US growth and sterling collapse \nProfits at outsourcing firm Bunzl rose sharply in the first half of the year as it reaps the rewards of growth in the US.The group posted a 20% rise in revenue to £4.1bn and pre-tax profit increased 17% to £181.9m in the six months to June 30.Bunzl has been buoyed by a string of acquisitions in North America, where it books the vast majority of its revenue, and the Brexit induced collapse in sterling.Chief executive Frank van Zanten said: \nBunzl has once again delivered good increases in revenue, adjusted operating profit and adjusted earnings per share. \nI am particularly pleased to report a significant pick up in the level of organic revenue growth to 3.7% during the first half of 2017 following the previously announced new business win in North America last year. \nBunzl, which supplies food packaging to restaurants and hotels and shopping bags to the retail sector, has committed to spending £546m on acquisitions this year.To this end, the firm also announced a deal in China that will see it take over HSESF, which specialises in the sale of personal protection equipment.In the UK, Bunzl became the latest firm to point to a challenging market linked to “political and economic uncertainty” which it said is holding back investment decisions.Bunzl said: \nAlthough the UK Government has commenced negotiations with the European Union, the terms under which the UK will eventually leave the European Union and the impact this will have on the group’s operations are currently unclear. \nThe risks to the group’s operations are most likely to relate to the impact of foreign exchange volatility, an economic slowdown in the UK and the imposition of trade tariffs. Bunzl logo Jonathon Manning Strong performance in North East helps Deloitte increase revenues by 11% \nStrong performance in the North East has helped business advisory firm Deloitte report an 11% growth in revenue . \nThe company - which in February announced 75 new jobs in its Newcastle centre of excellence - saw its revenue increase to £3.4bn though distributable profit was flat year-on-year as it invested in its staff and new ways of working. \nChief executive David Sproul hailed the performance in a market affected by the Brexit vote and elections in the UK and the US as “good”, with the company also picking up work in its tax division resulting from that political upheaval. \nThe company, one of the Accountancy Big Four, pointed to consumer and industrial products, and to life sciences and healthcare, as sectors performing well in the global economy. \nIn Newcastle, where Deloitte employs more than 200 people, office senior partner Stephen Hall highlighted the firm’s impact on the wider region as a measure of its success over the last 12 months. \nHe said: \nThe accounting Centre of Excellence is a key element of the firm’s audit offering nationally and supports the work we do for some of our highest-profile national clients. We will continue to invest and anticipate increasing the number of people employed in this centre to 110. \nThe success of Deloitte is not only measured in the positive impact we make for our clients and our people, but also in the difference we make to the wider community. \nThrough our responsible business strategy, One Million Futures, we are supporting Action for Children, which gives children and young people the practical and emotional support they need to help them thrive and build the skills they need for adulthood. \nGlobally, Deloitte increased revenue by £340m in the year ended May 31, from £3,040m to £3,380m. \nThe largest increases were seen in consulting revenue, which was up by 13.6%, and audit and risk advisory, up 13.1%. Distributable profit came in at £608m, giving an average profit per equity partner at £865,000. Stephen Hall of Deloitte Jonathon Manning Jobs to be created at Gateshead food firm Dalziel Ingredients with expansion of site \nWork has started on a £2.5m warehousing expansion for a Gateshead food company as demand doubles for its gluten-free options. \nDalziel Ingredients is adding a new 16,000 sq ft warehousing facility - equivalent to a storage capacity of 1,400 pallet spaces - at its Felling factory and new product development centre. \nThe company is also installing a fourth high-speed automated packing line with the latest checkweigher technology and metal detection capabilities. \nCompletion on the project is expected early 2018 in a move that will add another 10 new jobs to its 100-strong workforce at William Street. \nSales director Richard Wilson said: \nOur sales have grown year on year and this expansion enables us to invest in raw materials in much larger volumes to increase our efficiencies. \nIt enables us to increase our production capacity to make us as flexible as possible, so we maintain the high levels of customer service we’ve built our business on. \nDalziel Ingredients has seen increased demand across all its seasoning blends, having expanded into new markets such as snack seasonings. \nVolumes have more than doubled over the last three years for its gluten free products. The new facility expands Dalziel’s capability to handle the complexities of ‘free from’ manufacturing. \nMr Wilson said: \nWe’re increasing production of gluten free products because we have the expertise in developing them and a dedicated gluten-free production line to produce them safely to the highest standards. \nThe rise in gluten free means we almost need a gluten-free option for every product we develop. Steelwork going up on Dalziel Ingredients’ new warehousing facility in Felling 9:02 Jonathon Manning Big Six energy customers are paying a price for their loyalty, says report \nUK households have forked out an extra £7.3bn over the last five years by remaining customers of the Big Six energy firms, a new report shows.Ofgem data compiled by energy provider Bulb found that families who held accounts with the biggest firms - including British Gas, SSE, E.ON, Npower, EDF and Scottish Power - for at least five years paid out an average £853 more than they needed to over the period.The report explained that while Big Six firms tend to offer cheaper fixed tariffs in order to “entice” new customers, those tariffs tend to expire within one to two years.At that point customers are usually transferred to standard variable tariffs, which cost up to 30% more than their original plan.The report went on to calculate the so-called “loyalty fee”, which measures the annual price difference between the average standard variable tariff at a Big Six firm compared to their cheapest tariff.It found that the average loyalty fee for a UK household was £852.75 over five years. Bulb co-founder Hayden Wood said: \nLoyalty towards a brand is often rewarded, yet households who’ve put their trust for years in a single energy company are being forced to subsidise others who switch every 12 months. \nHe added: \nThese latest numbers show that so-called standard tariffs no longer have the customers’ best interests at heart. The Big Six need to show that they’re putting customers first, instead of profits. British Gas (Image: PA) KEY EVENT Grainger launches £80m housing development \nHousebuilder Grainger has announced that it plans to build 375 homes in Salford as part of an £80m project. \nThe UK’s largest listed residential landlord has agreed to acquired the Gore Street site, which is near Spinningfields in Manchester, from Euro Car Parks and the English Cities Fund. \nThe development is expected to be completed by 2020 and will create 375 private rental homes. They will consist of a mix of apartments and townhouses. \nHelen Gordon, chief executive of Grainger, said: \nWe are pleased today to announce this significant £80m investment to deliver 375 new, high quality, purpose built rental homes in Salford, near Spinningfields, building on our existing portfolio in and around Manchester city centre and leveraging our operational platform and Manchester regional office. \nGreater Manchester is a key target in Grainger’s PRS investment strategy. The acquisition builds on Grainger’s existing investments of over 1,200 rental homes in the North West. \nSimon Parker, managing director of UK Land and Property, said: \nWe are delighted that the hard work and support of key partners including Salford City Council, The English Cities Fund and Sir Robert McAlpine Enterprises has contributed to the opportunity for us to develop this high quality landmark scheme for Grainger plc. The project will become a focal point to the highly successful Chapel St regeneration initiative in Salford. Helen Gordon, CEO Designate of Grainger plc (Image: Publicity Pic) 8:52 Jonathon Manning Gateshead tech firm Recite Me helps disabled clients access accountants website \nA Gateshead software company has used cutting-edge tech to make an accountancy firm’s websites accessible for people with disabilities. \nSoftware firm Recite Me has worked with RMT Accountants & Business Advisors to transform its website so that it can be accessed by all of the firm’s clients. \nRecite Me’s cloud-based software is capable of translating text into more than 100 languages and has ‘text to speech’ functionality for up to 30 languages. It also allows people to change elements of a websites such as font size, font colour and background colour contrast. \nRoss Linnett, CEO of Recite Me, said: \nAround a fifth of the UK population has a visual impairment, a learning difficulty like dyslexia, or some other kind of disability. These conditions can make accessing web-based information extremely difficult for some people. \nSo much of the information that we all need in our daily lives is now online, and if you can’t access web content it can make many day-to-day tasks very difficult to do. \nBy adding Recite Me to a website, businesses can ensure they are making a reasonable adjustment to comply with the web accessibility requirements of the Equality Act. \nThe software can be used on laptops, PC or on mobile devices, meaning it can be used anywhere. Recite Me is also capable of creating MP3 sound files of written text. The files can then be downloaded and listened to by people who have difficulty reading from the screen. \nRMT has adopted the technology to ensure that all its clients can access the information they need. CEO of Recite Me Ross Linnett with Matthew Flinders, head of marketing at RMT (Image: www.crestphotography.co.uk) 8:47 ", "external_links": [], "published": "2017-08-29T10:30:00.000+03:00", "crawled": "2017-08-29T11:21:31.003+03:00", "highlightTitle": ""}