{"organizations": [], "uuid": "65dbab33a6d51f01bc36aa57bfe9360f79548c06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12498751.ece/ALTERNATES/s1200/Dixons-Carphone-trading-update.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13516039", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Dixons Carphone warns on profits as cost of new mobile phones soars", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-24T10:30:00.000+03:00", "replies_count": 0, "uuid": "65dbab33a6d51f01bc36aa57bfe9360f79548c06"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13516039", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Dixons Carphone warns on profits as cost of new mobile phones soars", "locations": [], "entities": {"persons": [{"name": "seb james", "sentiment": "none"}, {"name": "deltis", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "stonegate", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "dixons carphone", "sentiment": "negative"}, {"name": "dixons carphone plc", "sentiment": "negative"}, {"name": "deltic group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Heathrow Airport funds trade missions for two North East firms \nHeathrow Airport is funding trade missions for two North East businesses in an attempt to help them boost their export capabilities. \nBillingham pump manufacturer Tomlinson Hall & Co and Wilton’s Micropore Technologies are both receiving funding as part of the airport’s World of Opportunity grant. \nThe programme sees Heathrow provide £40,000 for SME trade missions or research into global markets, to help businesses grow internationally. The North East firms are among 20 UK companies that are due to receive support from Heathrow. \nTomlinson Hall designs and manufactures a range of pumps for use in the oil and gas, food and beverage, chemical, and engineering sectors. The firm also sells its own Liquivac pump which is capable of handling a combination of liquid, gas, and fine solids. \nColin Simpson, business development director at Tomlinson Hall, said: \nWe are thrilled to have won this grant as it will open up export opportunities for our own pump product Liquivac. \nWe have identified that it has huge potential in the USA and Canada and could offer a pump solution for major water industry projects in California and the US West Coast, in the wine industry in the American Viticultural Area of the Napa Valley in California and in the Canadian aquaculture, desalination and mining industries. \nThis grant will greatly assist us in establishing a route to market into our target sectors and providing further export growth for Tomlinson Hall. \nAs part of the World of Opportunity programme, the two companies will gain access to personalised advice from an international trade advisor from the Department of International Trade, and a Plaza Premium lounge pass to begin their trip in style as they depart from Heathrow. The Tomlinson Hall boardroom (Image: Unknown) 9:23 Jonathon Manning Car production up 8% in Uk to halt seven-month decline \nThe number of cars built in the UK last month rose by almost 8%, new figures reveal. Just over 136,000 cars left production lines, up 7.8% on July last year. \nThe Society of Motor Manufacturers and Traders (SMMT) reported that the number of cars built in the first seven months of the year was down 1.6% to one million amid uncertainty over Brexit. \nExports are driving production, with almost four out of five British cars shipped overseas so far this year. But the number of cars built for the UK market grew by 17.7% in July, halting seven successive months of decline. \nSMMT chief executive Mike Hawes said: \nUK car production lines stepped up a gear in July, as usual bringing forward some production to help manage demand ahead of September and routine summer factory shutdowns. \nAs the timing and length of these manufacturing pauses can shift each year, market performance comparisons for July and August should always be treated with caution. \nBut as long as the economic conditions at home and abroad stay broadly stable, we expect new car production to remain in line with expectations for the rest of 2017. Workers at Nissan's plant in Sunderland (Image: PA) 9:17 KEY EVENT Government is 'passing the buck without passing the bucks' on rail in the North \nTransport Secretary Chris Grayling is “passing the buck without passing the bucks” by saying the North should sort out its own transport problems, a regional leader has said. \nNewcastle City Council leader Nick Forbes was speaking as business and political leaders from around the North gathered to discuss downgrades to promised rail improvements in the region which were followed shortly by news of upgrades in London. \nCoun Forbes joined counterparts from other big cities in the North in criticising Mr Grayling’s comments that “the success of Northern transport depends on the North itself”. \nThose comments have added fuel to a campaign for fairer transport funding that has already seen more than 80,000 people sign a petition calling for a better deal in the North. \nYesterday a summit was held in Leeds to bring together business and political voices across the North with the aim of putting pressure on the Government to reverse its decision. \nDespite criticising Mr Grayling, Coun Forbes said: \n“There’s a real danger that we focus all our anger on one particular Secretary of State for Transport. What’s becoming clear is that the issues and challenges we face are deeper than that. \nWe need to challenge the perception that some people have in the central Government machinery that the North is somehow in decline. We need to be absolutely clear that we don’t buy into that narrative, nor should be falling into the trap of saying simply that we need more money to help us. \nBut if the Government is serious about addressing the economic imbalances in this country, the North is the most efficient place to do that. That’s a more powerful message for the way Government works than simply saying: ‘Look at us. Aren’t we hard done by?’” Transport Secretary Chris Grayling (main pic) 9:12 Jonathon Manning One in three UK food firms 'unviable' without European workers \nMore than a third of businesses across the UK’s food and farming industry would become “unviable” without access to European workers, new research has found. A report by the Food and Drink Federation (FDF) said 36% of firms in the industry’s £110bn supply chain would see their business models fail if they could not hire EU nationals. Supported by trade bodies throughout the food, drink and farming industry, the study said 17% of firms would shift their operations overseas in response to a block on EU workers.The research was sourced from 627 business and included input from the Association of Labour Providers, British Beer and Pub Association, British Hospitality Association, British Retail Consortium, Fresh Produce Consortium and the National Farmers’ Union.To ensure the future of the supply chain, they have called on the Government to secure the rights of European nationals currently living in the UK, review how immigration data is recorded and build an “attractive and effective” migration system. Ian Wright, director general of the FDF, said: \nThe UK food and drink supply chain ensures that consumers have access to the safe, affordable and delicious range of food and drink that they have come to expect. \nFood is a matter of national security, so the results of this report are of central concern to businesses across the ‘farm to fork’ industries. \nIt is only a matter of time before the uncertainty reported by businesses results in an irreversible exit of EU workers from these shores. This is a scenario that will hurt the UK culturally and economically. \nWithout our dedicated and valued workforce, we would be unable to feed the nation. This is why it is imperative that we receive assurances from Government about their future, and that of our wider workforce. \nThere are two million EU nationals within the UK economy, 20% of which are working in the food and drink supply chain. Nearly a half of businesses said EU workers were looking to leave the UK due to uncertainty over their future, according to the study.Meanwhile, 31% of firms said they had already seen EU nationals depart since the Brexit vote. It said the sector, which employs four million people across the UK, could not stomach a “cliff edge” and the supply chain would endure “significant disruption” if there was sudden halt in EU workers coming into the industry. One in three UK food firms 'unviable' without European workers (Image: Newcastle Journal) 9:07 Jonathon Manning Hitachi adds £30m to turnover amid strong UK construction market \nHitachi Construction Machinery has seen its turnover soar by nearly £30m over the last year thanks to high demand for construction equipment in the UK. \nThe Hebburn factory, which makes excavators and dump trucks, saw its turnover grow almost 20%, from £150m to £179.1m for the year ending March 31. \nHitachi also added to its profit figures after growing its operating profit from £5.1m to £7.6m. Profit after tax also increased from by £2m to £6.1m. \nThe company’s growth was attributed to an increased demand for construction equipment, which helped relieve other economic issues that affected the firm. \nCommenting on the results in the company’s accounts, chairman John Jones said: \nThe period under review has proven to be very exciting with demand for construction equipment exceeding expectations. A reduction in material costs despite the adverse movement in foreign exchange currencies provided a positive impact on company performance, which resulted in increased turnover and profit. \nIncreased demand for construction equipment across the UK market has continued to defy market uncertainty surrounding the UK’s vote to leave the European Union and the migrant crisis currently affecting the European Union, with customer requirements high across all parts of the UK, especially in the South East region. \nThe directors anticipate consumer confidence and demand to remain high in the short term, with further infrastructure developments planned by the UK Government. Hitachi Construction Machinery chairman John Jones 9:02", "external_links": [], "published": "2017-08-24T10:30:00.000+03:00", "crawled": "2017-08-24T10:39:26.008+03:00", "highlightTitle": ""}