{"organizations": [], "uuid": "ebeb20bd66b13b4d6cae490ee9a48f9f964e5dc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13226978.ece/ALTERNATES/s1200/BP898368.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13547753", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: 888 handed record £7.8m fine for failing to protect vulnerable customers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-31T10:30:00.000+03:00", "replies_count": 0, "uuid": "ebeb20bd66b13b4d6cae490ee9a48f9f964e5dc8"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13547753", "ord_in_thread": 0, "title": "Business Breakfast LIVE: 888 handed record £7.8m fine for failing to protect vulnerable customers", "locations": [], "entities": {"persons": [{"name": "martyn pullin", "sentiment": "none"}, {"name": "steven warren", "sentiment": "none"}, {"name": "kelly lee", "sentiment": "none"}, {"name": "katie cullen", "sentiment": "none"}, {"name": "cullen", "sentiment": "none"}, {"name": "andy mccue", "sentiment": "none"}, {"name": "benny", "sentiment": "none"}, {"name": "frankie", "sentiment": "none"}, {"name": "jonathon manning gateshead", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "bhuvnesh majupuria", "sentiment": "none"}, {"name": "pullin", "sentiment": "none"}, {"name": "chiquito", "sentiment": "none"}, {"name": "theo paphitis", "sentiment": "none"}, {"name": "warren", "sentiment": "none"}, {"name": "mccue", "sentiment": "none"}, {"name": "iain townsend", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "margaret manchester", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "trinity square", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "high level bridge", "sentiment": "none"}], "organizations": [{"name": "kf training", "sentiment": "negative"}, {"name": "restaurant group", "sentiment": "none"}, {"name": "frp advisory llp", "sentiment": "none"}, {"name": "frankie & benny", "sentiment": "none"}, {"name": "durham hens limited", "sentiment": "none"}, {"name": "durham hens", "sentiment": "none"}, {"name": "garfunkel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Hays buoyed by European growth as Brexit hits UK recruitment \nRecruitment firm Hays hailed record performances in Germany and France last year, while profits at its British operation collapsed as Brexit put the brakes on hiring.The group reported an 18% increase in pre-tax profit to £204.6m in the year to June 30, while like-for-like net fees came in 6% higher at £954.6m.Results were driven by growth in Germany and France, which saw net fees rise 14% and 16% respectively, a reflection of the rising fortunes of the eurozone.Operating profit was up 28% across continental Europe and the rest of the world to £100.7m.This contrasted starkly with the UK, which saw net fees fall 7% to £252.9m and operating profit dive 20% to £41.5m as it pointed to a “marked step-down after the EU referendum”.London saw a 10% drop in net fees and Hays accountancy and finance business declined 3%.Construction and property and office support were down 5% and 3% respectively, and net fees in IT and education decreased 14% and 11%, as both were negatively affected by the sharp decline in the public sector market.Chief executive Alistair Cox said: \nWe delivered strong, broad-based growth in Europe including a record financial performance in Germany, now our largest business in the world. \nGrowth accelerated through the year in Australia across all states. \nIn the UK, after a marked step-down immediately after the EU referendum, activity levels quickly stabilised and we exited the year with modest private sector growth. Recruitment firm Hays said trading in Germany and France soared, while profits in Britain collapsed due to Brexit 9:20 Jonathon Manning Pole-dance leggings help Newcastle students win business competition \nA pair of Newcastle graduates are getting a global grip on a niche market with their unique business – leggings for pole dancers . \nMelissa Whipp and Harriet Skinner became friends through pole dancing classes they took to keep fit while studying at Newcastle University. \nAfter going their separate ways into different careers, they realised their true calling was to launch their own business, and returned to the North East to found Creatures of XIX, an extreme fitness brand with roots in the dance classes where they met. \nNow, less than two years ago officially launching, the duo’s invention – Gecko XIX Grip leggings made from the first fabric created specifically for pole dancing – has earned them the FDM Group Award for Outstanding Entrepreneur at the 2017 Pride of Newcastle University Awards. \nSales of the super-gripping leggings are growing in the UK and Europe, and now they are hoping to get traction in more overseas poledancing markets. \nFor the next six weeks Miss Skinner will be in Australia hoping to accrue more customers on an overseas trade mission. \nMiss Skinner, who is originally from Stoke-on-Trent and gained a First-Class BA Hons degree in Marketing and Management said: \nWhen I arrived in Newcastle I did pole dancing because it was a fun class and a good way to make friends. \nI like trying to make things and be creative, so I tried to come up with a material for leggings that would help you grip the pole if you didn’t want to wear short shorts and have bare legs. \nI spent years working with companies on creating the fabric, and we finally did it after five years. I was working in London when I called Melissa and said: ‘Want to come into business with me?’ and within a week the company was up and running. \nIt’s been hard and I’ve never been skinter, but I’ve never been happier. \nThe entrepreneurs had an amazing initial response to their invention on social media and later in terms of sales, with main sizes selling out in two weeks and then again in just 24 hours after re-stocking. \nNow the duo, who are based in Kingsgate, Newcastle, have taken on an intern to help with demand, and they have struck a deal with a new manufacturer to ensure shorter gaps between deliveries. A Gateshead fulfilment company has been enlisted to send out the orders. Harriett Skinner and Melissa Whipp, founders of Newcastle-based Creatures of XIX (Image: creatures) 9:12 Mayweather victory boosts Ladbrokes Coral as 'crucial sporting action' kicks off Floyd Mayweather vs Conor McGregor set for August 26 clash (Image: Getty Images) 9:06 KEY EVENT Peterlee's KF Training closes its doors - making 15 people redundant \nA North East training company has made 15 people redundant after entering liquidation, The Journal can reveal. \nPeterlee’s KF Training, which expanded rapidly following its launch in 2011, saw a drop in sales and a number of loss making contracts which caused the firm to be wound up earlier this month. \nWithin five years, the County Durham business’s rapid expansion saw it open two additional offices in the North East as well one in Yorkshire. The growth led to KF Training employing 52 people last year. \nBut the growth proved to be unsustainable and the company has now officially closed its doors, making 15 of its workers redundant. Despite the closure, 25 people have remained in work by transferring to a former client following a TUPE consultation. \nOn August 16 company chairman Kelly Lee appointed Martyn Pullin and Iain Townsend, from Stockton’s FRP Advisory LLP, to wind-up the company as joint liquidators. \nMr Pullin said: \nI can confirm that Iain Townsend and I were appointed as joint liquidators of the above company on 16 August 2017 by deemed consent of the creditors. \nCreditors are invited to submit details of their claim to our Teesside office with my colleague Bhuvnesh Majupuria having day to day responsibility for this case. \nOur focus at this stage is on realising the company’s assets (including customer debts) to maximise the return to creditors and dealing with employee and creditor claims. \nShould any creditors have any matters which they wish to be brought to our attention please send details to Bhuvnesh.majupuria@frpadvisory.com. \nAccording to the company’s accounts for the year ending July 31 2016, the business owed creditors £445,356, which was due to be paid within one year. \nKF Training’s financial difficulty was caused by a fall in sales along with holding a number of loss making contracts that were secured by the firm’s former management team. The loss of one key customer and the insolvency of another are also understood to have compounded the business’ woes. Kelly Lee, managing director of KF Training (Image: Handout) 8:59 Jonathon Manning Restaurant Group 'making progress' despite falling half-year sales \nThe struggling owner of Frankie & Benny’s has reported falling half-year sales, but chief executive Andy McCue insisted the business has stabilised following turnaround efforts.Like-for-like sales at the Restaurant Group fell 2.2% in the six months to July 2, with total sales dropping over 7% to £333.1m.The firm, which is also behind Garfunkel’s and Chiquito, saw adjusted pre-tax profit plummet 30.4% to £25.5m. Statutory profit came in at £2.8m compared with a loss of £22.5m in the same period last year.Mr McCue, who has been closing under-performing restaurants and rejigging menus as he looks to rejuvenate the group, said: \nWe have made good progress against our strategic initiatives outlined in March. \nOur leisure customers are enjoying a better value, higher quality product, our growth plans for our pubs and concessions businesses are advancing well, and we have made good progress in delivering cost efficiencies. \nIt comes after the Restaurant Group admitted it had lost value-conscious customers at Frankie & Benny’s following significant price hikes, with the firm pledging to “look at the pricing architecture of the menu” and “reinvigorate the value offer” in a bid to attract more families.The firm said initiatives such as a menu option of £9.95 for two courses had begun to bear fruit. \nThe group said: \nWhile there remains a lot to do, there are early signs of customer awareness of our changes, with recent data showing an uptick in value for money ratings, net promoter scores and the brand rankings for quality of ingredients and freshness of food. \nThe Restaurant Group also said the performance of the its pubs business was boosted by warm weather and helped soften the decline in restaurants. Frankie and Benny's in Trinity Square, Gateshead 8:52 Jonathon Manning Gateshead's Block and Bottle makes list of the best small firms in the UK \nA trendy Gateshead shop and a poultry business in County Durham are among 100 small businesses being celebrated as some of the best in the UK. \nGateshead’s Block and Bottle and Durham Hens Limited have both been named in the Small Biz 100 list, which showcases one UK business a day in the run up to Small Business Saturday, a national event takes place on December 2 to promote SMEs around the UK. \nBlock & Bottle is the UK’s first dedicated butcher and beer bottle shop. Located near the High Level Bridge, the shop stocks rare breed, free range meat and craft beers from across the North East and the UK. \nAs well as offering butcher quality meat, the shop sells draught beer that can be drunk on site or taken home in growler bottles. It also hosts butchery classes for those wishing to learn more about how to prepare their food. \nOwners Katie Cullen and Steven Warren opened the shop earlier this year, with Ms Cullen running the beer side of the business and Mr Warren sells Block and Bottle’s meat selection. \nMs Cullen said: \nBeing part of the Small Biz 100 will help us change the way people think about, buy, and consume meat and beer. \n“We want to share our ideals with a wider community who believe in supporting small independent businesses like ourselves to help us grow and develop by shopping local, which is where Small Biz 100 comes in. \nDurham Hens is also being included in the Small Biz 100 list. \nThe company was founded by Margaret Manchester and sells a variety of hens, feed, and runs for those wishing to keep chickens. It also offers “hen holidays”, a professional boarding service which takes care of the birds if their owners go on holiday. \nDurham Hens has previously been promoted by Dragons Den star Theo Paphitis as part of his ‘Small Business Sunday’ initiative. Steven Warren and Katie Cullen who run the Block and Bottle in Gateshead supplying craft beers and meat 8:47", "external_links": [], "published": "2017-08-31T10:30:00.000+03:00", "crawled": "2017-08-31T11:13:29.009+03:00", "highlightTitle": ""}