{"organizations": [], "uuid": "3bda60ef8fac9d1dc8c6beda96aeb9a7f10e62b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/incoming/article333343.ece/ALTERNATES/s1200/East-Budleigh-9PNG.png", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/east-devon-council-pledges-zero-360549", "country": "US", "title": "East Devon Council pledges 'zero tolerance' to hate crime after row over East Budleigh dog ban - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.474, "site_type": "news", "published": "2017-08-22T12:58:00.000+03:00", "replies_count": 0, "uuid": "3bda60ef8fac9d1dc8c6beda96aeb9a7f10e62b3"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/devon-news/east-devon-council-pledges-zero-360549", "ord_in_thread": 0, "title": "East Devon Council pledges 'zero tolerance' to hate crime after row over East Budleigh dog ban - Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News East Devon Council pledges 'zero tolerance' to hate crime after row over East Budleigh dog ban It comes after a row erupted last week after a decision by East Budleigh parish council to give permission for a fence around a football pitch used by East Budleigh FC, which was led until the police being called and the parish council refusing to speak to the Friends of East Budleigh Recreation Group, saying that they consider them a hate group Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nEast Devon District Council has reiterated that it has zero tolerance towards hate crime. The council have said that are fully supporting Devon and Cornwall Police with their ‘Zero Tolerance to Hate Campaign’. \nIt comes after a row erupted last week after a decision by East Budleigh parish council to give permission for a fence around a football pitch used by East Budleigh FC, which was led until the police being called and the parish council refusing to speak to the Friends of East Budleigh Recreation Group, saying that they consider them a hate group. \nThe ‘Zero Tolerance to Hate Crime’ campaign was formally launched during the national Hate Crime Awareness Week in October 2016 with the twitter feed #ZeroTolerance2Hate. \nThis followed the collation of ideas and concerns from a representative group of different minority communities which expressed feelings of disharmony and unrest after the Brexit result where a spike in hate crimes was reported. Read More Villagers defend themselves after being called 'hate group' in row over East Budleigh dog ban \nEast Devon District Council has signed the pledge which will assist in fulfilling obligations under the Public Sector General Duty - Section 149 of the Equality Act 2010 which protects people from discrimination and harassment, which means that those subject to the equality duty must have due regard to the need to: Eliminate discrimination, harassment, victimisation and any other prohibited conduct. Advance equality of opportunity. Foster good relations between people. East Budleigh \nGerry Moore, East Devon’s Community Safety Officer, said: “Any form of crime directed towards a person or persons due to their disability, race, ethnicity or nationality, religion or belief, sexual orientation or transgender identity is against everything that this council stands for. \n“If members of the public wish to have leaflets, posters or stickers in connection with this very worthwhile campaign they can be collected from our Customer Service Centre at Sidmouth or by ringing me on 01395 273802 or emailing ” \nIt comes as the Friends of East Budleigh Recreation Ground has issued a statement defending itself in response to news coverage of a proposed dog ban after the parish council labelled it a 'hate group'. \nThe organisation strongly refutes the allegation and also takes issue with the claim from the council that the village is 'particularly bad for dog mess'. It says both statements are 'ludicrous and unfounded'. East Budleigh Recreation Ground \nThe coverage followed a decision by the parish council to give permission for a fence around a football pitch used by East Budleigh FC, who play in Division Two of the Devon & Exeter League - the 12th level of English football. The club have endured years of having games halted in order to clear up dog's mess from their pitch, which is on a section of public green space. \nThe club have continually requested a barrier to be put up round the pitch in order to combat the issue, and the parish council has now agreed to it. But the Friends of East Budleigh Recreation Ground said the decision has divided the community and members have been left outraged and bewildered. It claims that hundreds of letters to the parish council have been sent by members of the group but they have been ignored. Read More Village divided as dog poo row leads to council branding community organisation 'a hate group' \nThe parish council decided as a collective group it will not engage with the Friends which it considers a hate group. Meanwhile the police are investigating an alleged incident of of abusive or insulting words or behaviour to cause harassment or alarm at a pub in East Budleigh on Friday, August 11. \nThe council said \"East Budleigh has been particularly bad for dog mess and we have had a number of complaints and last season several football games had to be stopped to clear up the dog mess. The idea is to make it a safe area and free from dog mess for everyone – not just the football club.\" \nIt added: \"We are doing what we think is best but we have been subjected to a vicious hate campaign as a result by some members of the Friends of East Budleigh Recreation Ground group.\" \nEast Budleigh, a small village in East Devon, two miles inland from the coastal town of Budleigh Salterton, is most famous as the birthplace of the Elizabethan adventurer Sir Walter Raleigh, who popularised tobacco smoking in the 16th Century. A lifesize bronze statue of him near the church unveiled in 2006 was funded by British American Tobacco. Sir Walter Raleigh pub in East Budleigh \nHere is the full statement from the Friends of East Budleigh Recreation Ground \nIn defence of The Friends of East Budleigh Recreation Ground \nThe alarming headline, from the East Devon Express and Echo, greeting villagers on the newsstand of their community shop, and more worryingly throughout the County, \"Hate group' claims as dog poo divides village.\" has further inflamed the sorry debate surrounding the issue of a dog ban in the recreation ground. \"The Council\" went on to state that \"as a collective group they will not engage with the group as they consider them a hate group\" Later on in the article they also state that 'East Budleigh has been particularly bad for dog mess' \nThis is not just about dog poo and a fence! The real issue of mishandling the proposal is being wholly overlooked and hidden by trying to turn this into a perceived personal attack by this group on the council which is ironic since it was only formed due to lack of inclusion or consideration by the Parish Council in the first instance. To have now casually labelled Friends of East Budleigh Recreation Ground, a large section of their community, \"A Hate group\" in a newspaper article is an extraordinary affront to the citizens they serve. East Budleigh \n\"Friends\" were only formed as a result of The Parish Council meeting in July 2017 and, as of yet, have had no communication or dealings with The Parish Council. They are simply a group of law abiding, public spirited people who exchange information on concerns regarding an unexplained decision to erect a fence in their Recreation Ground. This was as a direct result of the Parish Council unwillingness to engage with any group or individual on this matter. A new website is being published with the aim of functioning as a conduit and collection point for information, including letters to the Council, that may otherwise have not seen the light of day. It will also alleviate the problem of contact information, currently pinned on the Village notice board, being systematically removed by person or persons unknown. Issues of alleged \"hate\" the Parish Council may have with other individuals can in no way be seen as having any proven relationship or connection with this group. \nFor a Parish Council to wilfully label a community group as a \"hate group\" for publication in a newspaper is alarming, defamatory, libellous and sinister. It is also irresponsible for any individual councillor to state that 'East Budleigh has been particularly bad for dog mess' and that we have a 'hate group' active within our village. Both are ludicrous, unfounded, statements but unfortunately, through the power of the press, this is how the village's profile will resonate in the public's opinion for some time to come. Like us on Facebook", "external_links": [], "published": "2017-08-22T12:58:00.000+03:00", "crawled": "2017-08-22T13:08:22.000+03:00", "highlightTitle": ""}