{"organizations": [], "uuid": "c74fdde35355a279709bce32b7afc831bda48d39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/incoming/article280056.ece/ALTERNATES/s1200/LEWJ20120101B-018_C_L.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/company-car-man-ravi-karia-276354", "country": "GB", "domain_rank": 48128, "title": "Company Car Man Ravi Karia loves Game of Thrones, his Porsche 911 and hates British Gas price hikes - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.449, "site_type": "news", "published": "2017-08-03T17:52:00.000+03:00", "replies_count": 0, "uuid": "c74fdde35355a279709bce32b7afc831bda48d39"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/company-car-man-ravi-karia-276354", "ord_in_thread": 0, "title": "Company Car Man Ravi Karia loves Game of Thrones, his Porsche 911 and hates British Gas price hikes - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "ravi karia", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "will johnston", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}], "locations": [{"name": "pertemba", "sentiment": "none"}, {"name": "derbyshire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "porsche", "sentiment": "negative"}, {"name": "leicester mercury news company", "sentiment": "negative"}, {"name": "us tv", "sentiment": "none"}, {"name": "universal textiles", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "power", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Company Car Man Ravi Karia loves Game of Thrones, his Porsche 911 and hates British Gas price hikes \"We don't need more uncertainty, we need Theresa May to deliver Brexit and get us the best deal\" Share Ravi Karia has always loved Porsche cars (Image: Will Johnston) Share \nThis week's Company Car Man is Ravi Karia, who runs online clothes retailers Universal Textiles and Pertemba, both based in Leicester What do you drive? \nI drive a Porsche 911 4S. \nI have had it since late last year and I used to have a Mercedes E350. \nI have always loved Porsche cars and it's always been my dream to own one. \nMy hard work has started to pay off in the business and I have been lucky enough to be able to buy myself one. How much does Donald Trump scare you? \nI was concerned with Donald trump during his election campaign due to his messages, but once he was elected he toned it done considerably. \nHe is coming to the realisation that running a country is very different to running a business and you need a very different set of skills. \nYou don't have the same level of freedom and things don't move at the same pace. \nFor him to do any of the scary things he said during campaigning he needs political support and he won't get it for the more extreme ideas. \nFrom a global security point, he is different to Obama but he is not stupid and I am sure he knows when you push and when to back down. Donald Trump gives two thumbs up to the crowd (Image: Getty Images) A pop festival in Derbyshire was a complete wash-out last week. What is your worst holiday experience? \nOn route to our holiday, during the changeover our airline went bust. \nSo we were stranded for two days. \nWe were lucky to get on another flight but had to fly four hours in the wrong direction to change. Should Theresa May stay or go? \nWe don't need more uncertainty, we need her to deliver Brexit and get us the best deal. \nAfter that, we should think about a change. \nThe way she conducted the election was very poor. Prime Minister Theresa May outside Downing Street Are you a fan of celebrity TV such as Love Island, Big Brother, Ex On The Beach? \nI don't watch a lot of celebrity TV. \nAlthough I will always find time to watch US TV shows like Game of Thrones, Ballers, Power and Preacher. What do you make of British Gas hiking electricity prices by 12.5 per cent? \nI don't know how they get away with it. \nIt's quite a hike which will be hardest on the most vulnerable in society especially over the winter. \nI don't know how involved the industry regulator is with price increases, but there should be a cap on hikes of no more than the increase in energy costs. British Gas is set to hike prices by 12.5 per cent in September How do you feel HS2? \nI think HS2 will be good for us, when you make it easier for people and businesses to connect, breakdown physical barriers, commerce always follows. As a retail specialist who deals with countries around the world, what are your biggest Brexit fears? \nThe uncertainty being caused by Brexit is causing more damage than Brexit itself – companies are not investing and waiting for more information which can take years. \nAfter Brexit I think the economy will suffer, for a short period. \nOn the positive, we have a strong and diverse economy with excellent infrastructure and relationships with other countries. \nI have faith in UK businesses to be resilient and to adapt. Like us on Facebook ", "external_links": [], "published": "2017-08-03T17:52:00.000+03:00", "crawled": "2017-08-04T18:29:07.010+03:00", "highlightTitle": ""}