{"organizations": [], "uuid": "0b6cbb9fa7052821d7e31aa052eb5fe9e29aa005", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/sport/football/football-news/article333079.ece/ALTERNATES/s1200/DavidWheelerInjury.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/sport/sport-opinion/david-wheeler-column-exeter-city-333163", "country": "US", "title": "", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2017-08-16T13:53:00.000+03:00", "replies_count": 0, "uuid": "0b6cbb9fa7052821d7e31aa052eb5fe9e29aa005"}, "author": "Devon Live", "url": "http://www.devonlive.com/sport/sport-opinion/david-wheeler-column-exeter-city-333163", "ord_in_thread": 0, "title": "", "locations": [], "entities": {"persons": [{"name": "david wheeler", "sentiment": "none"}, {"name": "ade saunderson", "sentiment": "none"}, {"name": "ollie watkins", "sentiment": "none"}, {"name": "jack sparkes", "sentiment": "none"}, {"name": "sparkesy", "sentiment": "none"}, {"name": "danny cowley", "sentiment": "none"}, {"name": "liam mcalinden", "sentiment": "none"}, {"name": "ade edmondson", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "pierce sweeney", "sentiment": "none"}], "locations": [{"name": "exeter city", "sentiment": "none"}, {"name": "swindon town", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "wembley", "sentiment": "none"}, {"name": "wiltshire", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "county ground", "sentiment": "none"}], "organizations": [{"name": "grenfell", "sentiment": "none"}, {"name": "grenfell fire", "sentiment": "none"}, {"name": "imps", "sentiment": "none"}, {"name": "lincoln city", "sentiment": "none"}, {"name": "pinnacle", "sentiment": "none"}, {"name": "efl", "sentiment": "none"}, {"name": "swindon", "sentiment": "none"}, {"name": "swindon town", "sentiment": "none"}, {"name": "brentford", "sentiment": "none"}, {"name": "blackpool", "sentiment": "none"}, {"name": "sincil bank", "sentiment": "none"}, {"name": "st james", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "robins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sport Opinion David Wheeler of Exeter City is treated for a knock by Ade Saunderson at Swindon Town (Image: Pinnacle) Share Comments \nWhile it seems like only yesterday we were lining up against Blackpool in the League Two play-off final at Wembley, it’s great to be back. \nBetter still, we’ve started this season a whole lot better than we did the last one and after just two games already have four points more than we did at the same stage last year. \nI thought our 1-0 victory at home to Cambridge on the opening day of the season was well deserved and that with just a tad more good fortune we might easily have come away with another three points when we faced Swindon at the County Ground last Saturday. Read More Former Exeter City forward Ollie Watkins on scoring his first Championship goal for Brentford \nIn particular, a first-half corner produced a melee in the Robins’ box which, to my mind, saw us hard done by not once but three times. First and foremost, Pierce Sweeney’s header looked to cross the line; then I had a shot which appeared to be handled; and, just for good measure, I thought the challenge which came in on me as I took aim – and left me unable to continue in the second half – could easily have warranted a red card. Unfortunately, the referee remained unmoved throughout and eventually the home side managed to hack the ball to safety. Exeter City's Liam McAlinden celebrates scoring against Swindon Town (Image: Pinnacle) \nLiam McAlinden did fire us ahead not long afterwards, but we conceded an annoyingly soft equaliser shortly after half-time and, try as we might, couldn’t quite conjure a second goal. On his EFL debut, it was 16-year-old winger Jack Sparkes who came closest to restoring our advantage, but, moments after coming off the bench, Sparkesy’s fantastic 30-yard effort cannoned off the intersection of crossbar and post. \nAs he’s demonstrated in preseason, Jack is an exciting talent who could go a long way in the game. He’s got plenty of tricks, is comfortable on the ball, and displays a healthy lack of inhibition, which means he doesn’t think twice about trying things other players might not. What is more, he’s not a slight young thing still growing into his frame, but has the physique of someone several years older and that can only help his cause. Read More Premier League at 25: Where were Exeter City a quarter of a century ago? \nAs you may have heard, City fan Ade Edmondson and I will be sharing the column-writing duties this season; clearly, I can’t hope to compete with Ade for laughs so, instead, I’ll continue to touch on some serious [non-footballing] topics which are close to my heart. \nAs regular readers will be aware, I was a staunch remainer and, as such, am very skeptical about the chances of the government negotiating a Brexit deal which doesn't leave the country seriously disadvantaged. It always seemed to me that those campaigning to leave the EU were united by little more than a vague and ill-founded notion we’d be better off out of it, with no real vision, less still a plan, of how we might prosper outside of the customs union and I’ve seen nothing over the past couple of months to make me think otherwise. Quite the opposite. Grenfell Fire aftermath \nDepressing as it’s all been, the Grenfell fire, which left more than 70 people dead, must rank as one of the biggest tragedies to befall this country in my lifetime and saddened me even more. Of course, the loss of so may lives will always be a tragedy, but is even harder to accept when it’s plain so much more could, and should, have been done to prevent it. \nInstead, a culture which put profit before people meant that the Grenfell Tower residents who complained that their building was unsafe weren’t given the time of day and some pretty fundamental safety issues were overlooked, with devastating consequences. If any good is to come of this terrible tragedy then there has to be a recognition that people’s lives should never be compromised by financial considerations and, with that in mind, the government should commit now to the huge investment in social housing required to enable it to recover from decades of neglect. Lincoln City manager Danny Cowley (Image: Pinnacle) \nYou couldn’t help but be impressed by Lincoln last season, when they not only won promotion from the Conference but also reached the sixth round of the FA Cup, and I’m expecting them to provide stiff opposition when they visit St James’s Park on Saturday. \nAs and when I retire, I think there’s a good chance I’ll go into teaching, so I found it fascinating to watch how the Imps' impressive young manager Danny Cowley managed to combine his role at Sincil Bank with his job as a PE teacher throughout the course of last season. It proves it can be done and I’d like to think that in the future I might also get the opportunity to teach while doing some coaching at a non-league side. Read More EFL to discuss possibility of closing transfer window before start of season \nOf course, that’s some way off yet and right now my only ambition is to help the club in its bid for automatic promotion, in which respect another three points on Saturday would be a welcome step in the right direction. Having made a decent start to the season, I’d like to think there will be a sizeable crowd in attendance and, touch wood, on this occasion we’ll be blessed with a bit of the good fortune we were lacking on our trip to Wiltshire! Like us on Facebook ", "external_links": [], "published": "2017-08-16T13:53:00.000+03:00", "crawled": "2017-08-22T14:25:22.020+03:00", "highlightTitle": ""}