{"organizations": [], "uuid": "5cfba1d10722aabff0d99e293a1d9d84ec256d2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13555593.ece/ALTERNATES/s1200/Theresa-May-visit-to-Japan.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/japan-prime-minister-insists-japanese-13555555", "country": "GB", "domain_rank": 21960, "title": "Japan Prime Minister insists Japanese investors have faith in the UK after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-31T18:00:00.000+03:00", "replies_count": 0, "uuid": "5cfba1d10722aabff0d99e293a1d9d84ec256d2b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/japan-prime-minister-insists-japanese-13555555", "ord_in_thread": 0, "title": "Japan Prime Minister insists Japanese investors have faith in the UK after Brexit", "locations": [], "entities": {"persons": [{"name": "barnier", "sentiment": "none"}, {"name": "shinzo abe", "sentiment": "none"}, {"name": "abe", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "azuma", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "akasaka guest house", "sentiment": "none"}], "organizations": [{"name": "brexit news", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "virgin trains", "sentiment": "none"}, {"name": "nikkei asian review", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "getty images asiapac", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "akasaka guest house", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Japan Prime Minister insists Japanese investors have faith in the UK after Brexit The vote of confidence from Japan's Prime Minister follows reports firms such as Nissan and Hitachi are concerned about Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing! Could   Japan’s Prime Minister has reassured Prime Minister Theresa May that Japanese businesses have “profound trust” in the British economy and the UK’s prospects after Brexit . \nShinzo Abe was speaking Mrs May’s visit to Japan, following reports that firms such as Nissan and Hitachi are concerned about the lack of clarity over the UK’s future relationship with the EU. \nBut Mr Abe also asked Mrs May to keep Japan up to date about progress in the Brexit talks. He told a press conference in Tokyo: “I have asked the Prime Minister May for her continued consideration for ensuring transparency and predictability so as to minimise its impact on the business activities, including the Japanese companies.” Japanese Prime Minister Shinzo Abe welcomes British Prime Minister Theresa May to the Akasaka Guest House in Tokyo where they attended an official welcoming ceremony before holding talks (Image: Getty Images AsiaPac) \nNorth East MP Phil Wilson, whose Sedgefield constituency includes Hitachi’s train manufacturing site in Newton Aycliffe , County Durham, said investors needed to know whether the UK would continue to have access to the European Single Market, which allows British-made products to be sold in the EU, and the Customs Union, which allows items such as car or train parts to be imported into the country without red tape. \nHe said: “The North East have been one of the main locations for inward investment from Japan, such as Hitachi and Nissan’s site in Sunderland. \n“We’ve benefited as a country greatly, but as a region even more so. \n“Japanese investment has generated 100,000 jobs in the country and we know a lot of those are in the North East of England.” \nHe added: “If Japanese firms are going to invest more in plants such as Hitachi or Nissan, they want some certainty.” A Hitachi staff member working on a Virgin Trains' Azuma train (Image: PA) \nThere has been no sign of investment dropping off so far, and Nissan is reportedly planning to boost production at its UK factory by 20% and double the proportion of parts produced locally from 40 to 80 per cent. \nThe report, which appeared in a Japanese financial journal called Nikkei Asian Review, has not been confirmed by the carmaker. \nMrs May’s visit to Japan appeared to have been a success as the Prime Minister announced that the two countries had agreed to create a trade deal which copied a planned Japanese trade deal with the EU. Read More Nissan to double number of UK-sourced parts as Sunderland plant grows, reports say \nShe said: “Our intention is that the UK will be free to sign new bilateral trade agreements with partners around the world in any interim Brexit period, and we have agreed here today that we want to see a swift conclusion of the ambitious EU-Japan economic partnership agreement. \n“Prime Minister Abe and I have agreed that as we exit the EU we will work quickly to establish a new economic partnership between Japan and the UK, based on the final terms of that agreement.” Japan's Prime Minister Shinzo Abe shakes hands with Prime Minister Theresa May during a bilateral meeting at the Akasaka Guest House, Tokyo as she visits the country (Image: PA) \nBut in Brussels there were signs that talks between the UK and EU had stalled. \nBrexit Secretary David Davis has been meeting EU chief negotiator Michel Barnier. But the pair made it clear there had been little progress, when they spoke at a joint press conference. \nMr Barnier said: “At the current state of progress we are quite far from being able to say that sufficient progress has taken place.” Read More Nissan's 7,000-job Sunderland plant is under threat if there's no EU trade deal \nHe criticised what he called “simply impossible” demands made by the UK over its future relationship outside the single market. \n“The UK wants to take back control, wants to adopt its own standards and regulations - but it also wants to have these standards recognised automatically in the EU,” he said. \n“That is what UK papers ask for. This is simply impossible. You cannot be outside the single market and shape its legal order.” \nMr Davis said there had been “some concrete progress” during the latest round of talks but again called for the EU to shift from its rigid approach to the negotiations, which mean that talks on the future relationship cannot begin until sufficient progress has been made on priority issues including the financial settlement, citizens’ rights and other issues relating to the withdrawal. \n“This is not about skipping ahead or trying to reopen previous discussions; it is about pragmatically driving the process we all want to see,” he insisted. Like us on Facebook", "external_links": [], "published": "2017-08-31T18:00:00.000+03:00", "crawled": "2017-08-31T18:13:47.004+03:00", "highlightTitle": ""}