{"organizations": [], "uuid": "e8f3cb39b6dca10ecab2b38beb62962e70114d13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/news/devon-news/article404148.ece/ALTERNATES/s1200/Nick-Harvey-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/former-north-devon-mp-becomes-404210", "country": "GB", "title": "Former North Devon MP becomes Liberal Democrat chief executive", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-31T12:29:00.000+03:00", "replies_count": 0, "uuid": "e8f3cb39b6dca10ecab2b38beb62962e70114d13"}, "author": "Joe Bulmer", "url": "http://www.devonlive.com/news/devon-news/former-north-devon-mp-becomes-404210", "ord_in_thread": 0, "title": "Former North Devon MP becomes Liberal Democrat chief executive", "locations": [], "entities": {"persons": [{"name": "nick", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "sal brinton", "sentiment": "none"}, {"name": "rob tibbles", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "tim gordon", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}, {"name": "nick harvey", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "crediton", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "party", "sentiment": "none"}, {"name": "global partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Former North Devon MP becomes Liberal Democrat chief executive Nick will take up his new role next week after finishing a stint working as an advisor in Egypt and Jordan Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nFormer North Devon MP Nick Harvey has been made the interim chief executive of the Liberal Democrats. \nThe former coalition government armed forces minister served as North Devon’s MP from 1992 until 2015 when he was unseated by the area’s current Conservative MP Peter Heaton-Jones. \nNick will take up his new role next week after finishing a stint working as an advisor on Egypt and Jordan for Global Partners a “company working to build an internet environment based on and governed by human rights principles”. Former North Devon MP Nick Harvey and Liberal Democrat Leader Vince Cable. (Image: Rob Tibbles) Read More This is why a wallaby escaped near Crediton last night \nHe will replace the outgoing chief executive Tim Gordon. \nOn his appointment Nick said: “I am greatly looking forward to supporting Vince Cable as our new Leader, and hope that working closely together we can further revive Lib Dem fortunes. The party has shown great resilience. Now we have a real opportunity to begin the process of moving forwards again. \n“British politics has never been in greater need of the Liberal Democrats. There is a major gap which only we can fill, not least on Brexit. This could have a dramatic impact on people’s jobs, the health and care system they depend on, and the schools and colleges which enable everyone to succeed in life. \n“We must boldly promote our liberal values, at home but also with partners abroad – not fighting them, but working to find international solutions to global security and environmental challenges.” Nick Harvey on the campaign trail Read More \nHe added: “The party has many talented, experienced and innovative people, as well as legions of new members. Together we can get things going again.” \nHis appointment has been backed by party leader Vince Cable and party president Sal Brinton. \nVince Cable said: “Nick has a vast amount of experience in parliament and government, as well as in management in the private sector. It is a coup to have someone of his ability to run the party machine at a time of exciting opportunity for the Liberal Democrats.” A shell shocked Nick Harvey discovers he's failed for a second time in his bid to retake his former constituency Read More Dangerous double white line overtakes on A361 caught on camera \nParty president Sal Brinton said: “Nick takes the helm with our membership at record levels, an increase in MPs, a string of council by-election gains and fundraising working well. \n“It is great to have his steady hand on the tiller as the Liberal Democrats chart the next leg of our journey. We will advertise in due course to fill the role permanently.” \nNick lost his North Devon seat in 2015 when the Conservatives swept the board in the South West taking all of the seats in Devon and Cornwall except for Exeter which returned veteran Labour MP Ben Bradshaw. \nAn advert for the Nick’s temporary position will be published in October. Read More ", "external_links": [], "published": "2017-08-31T12:29:00.000+03:00", "crawled": "2017-08-31T13:10:29.005+03:00", "highlightTitle": ""}