{"organizations": [], "uuid": "b0491a7efb4f078841898084cc334f4a405f896f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13513014.ece/ALTERNATES/s1200/2015-Fastest-50.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/fastest-50-launched-highlight-north-13512627", "country": "GB", "domain_rank": 21960, "title": "Fastest 50 launched to highlight the North East's top growing companies - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.938, "site_type": "news", "published": "2017-08-23T07:00:00.000+03:00", "replies_count": 0, "uuid": "b0491a7efb4f078841898084cc334f4a405f896f"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/fastest-50-launched-highlight-north-13512627", "ord_in_thread": 0, "title": "Fastest 50 launched to highlight the North East's top growing companies - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "steph mcgovern", "sentiment": "none"}, {"name": "paul walker", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "vince cable mp", "sentiment": "none"}, {"name": "colin hewitt", "sentiment": "none"}, {"name": "jamie martin", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "baltic", "sentiment": "none"}], "organizations": [{"name": "chronicle live business fastest", "sentiment": "negative"}, {"name": "ward hadaway fastest", "sentiment": "none"}, {"name": "ward hadaway north east fastest", "sentiment": "none"}, {"name": "bywell holdings", "sentiment": "none"}, {"name": "isocom components", "sentiment": "none"}, {"name": "sage group plc", "sentiment": "none"}, {"name": "soil machine dynamics", "sentiment": "none"}, {"name": "bbc breakfast", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "armstrong technology associates", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "utility technical services", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Fastest 50 launched to highlight the North East's top growing companies Now in its 20th year, Fastest 50 is run by Newcastle law firm Ward Hadaway in association with The Journal Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe search to find the North East’s fastest growing companies has begun with the launch of the Ward Hadaway Fastest 50 for 2017 – the 20th time the annual survey of the region’s pace-setting businesses has taken place. \nThe Ward Hadaway Fastest 50 , established by leading North law firm Ward Hadaway and backed by The Journal, is the definitive guide to the companies in the North East who have delivered the most impressive performances in growing their businesses. \nThe Fastest 50 was started by Ward Hadaway in 1998 to recognise and celebrate privately-owned profit-making businesses in the North East showing the strongest annualised growth in turnover, with the aim of acknowledging the success of our high achieving companies and providing inspiration for others to follow. \nSince then, many of the region’s most successful businesses have had their achievements recognised with an appearance in the annual list of the fastest growing 50 companies, with the top performers receiving awards for their efforts. \nThis year marks the 20th time the survey has been undertaken and awards given to the North East’s trailblazing businesses. \nAs in previous years, the 50 fastest growing businesses for 2017 – compiled by independent economic researchers using publicly available data from Companies House - will be listed in The Journal next month in A to Z format. \nThese 50 businesses will then go forward to the Ward Hadaway Fastest 50 Awards in October where awards will be presented to the fastest growing small, medium-sized and large privately-owned businesses in the North East. \nOne of these three winners will go on to be named the overall fastest growing company in the region, becoming the 20th recipient of the coveted title. \nJamie Martin, managing partner at Ward Hadaway, said: “The Ward Hadaway Fastest 50 is always a great way to celebrate all that is best about business in the North East, even more so this year as we mark the 20th time the awards have been presented. \n“Over the years, I am proud to say it has become a real institution in the region and a key event in the North East business calendar which we all look forward to. \n“The thinking behind the first Ward Hadaway Fastest 50 in 1998 is as true today as it was then – to champion enterprise and business achievement in the North East and to demonstrate what a great place the region is in which to live, work and do business. \n“Whilst a lot has changed over the years, it remains true that those businesses which make the list for this, the 20th Ward Hadaway Fastest 50, are the real drivers of the region’s economy and setting the pace for the North East.” Ward Hadaway North East Fastest 50 Awards 2016 held at the Baltic, Gateshead (Image: Newcastle Chronicle) \nThe first Ward Hadaway Fastest 50 in 1998 saw Armstrong Technology Associates – a Wallsend -based company formed by members of the design team at Swan Hunter shipyard – win the overall award after clinching contracts in the offshore and gas industry. \nThe other inaugural winners were engineering group Bywell Holdings - more recognisable as the holding company for Soil Machine Dynamics - and manufacturer Isocom Components, which won fastest growing large and medium companies respectively, with engineering consultancy Utility Technical Services winning the fastest growing small company award. \nWinners over the ensuing years have included nursery providers, specialist recruitment agencies, retailers, hotels, manufacturers, health and fitness clubs and marine and offshore companies. \nAs well as charting the successes of the region’s fast-growing businesses, the Ward Hadaway Fastest 50 has also seen some distinguished guest speakers including the then Business Secretary Sir Vince Cable MP, former Sage Group plc chief executive Paul Walker and BBC Breakfast business reporter Steph McGovern. \nColin Hewitt, partner and head of commercial law at Ward Hadaway, said: “Over the years, as well as highlighting individual business achievement, the Ward Hadaway Fastest 50 has helped to illustrate the areas of the North East economy which are enjoying the strongest growth and which sectors are prospering. \n“Entry into the final 50 has always depended on a company’s financial performance, which means that every business which makes it into the list in any given year gets there purely on merit. \n“A look at the range of different companies to have won awards in the Ward Hadaway Fastest 50 over the years demonstrates the diversity and strength in depth of the North East economy. \n“Competition to become one of the Ward Hadaway Fastest 50 companies has always been fierce and I think it will be no different this year. \n“As we continue to gear up to the challenges presented in a post-Brexit world, the qualities of determination, expertise and teamwork exemplified by the Fastest 50 companies both this year and over previous years will stand us in good stead.” \nThe 20th Ward Hadaway Fastest 50 awards ceremony will take place in October at Baltic, the Centre for Contemporary Art, in Gateshead. \nJournal Business Editor Graeme Whitfield said: “It is amazing to think we are now on the 20th Ward Hadaway Fastest 50 Awards – their longevity and continuing success is a tribute to the commitment of Ward Hadaway to the event and to the region as a whole, as well as a marker for the enduring qualities of North East companies. \n“Over the years, the Ward Hadaway Fastest 50 has always been a source of positive news, even during difficult economic times for the North East, and it never fails to show the region’s business community in its best light. \n“We look forward to continuing this great tradition and to celebrating the companies who will be the trailblazers for the 20th awards.” Like us on Facebook", "external_links": [], "published": "2017-08-23T07:00:00.000+03:00", "crawled": "2017-08-23T15:34:48.003+03:00", "highlightTitle": ""}