{"organizations": [], "uuid": "e470e079e017164e551ad29b5e6f36d3306af346", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30465043/16095997.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/5m-upgrade-for-road-surface-of-north-devon-link-road-announced/story-30465043-detail/story.html", "country": "US", "title": "£5m upgrade for road surface of North Devon Link Road announced | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.149, "site_type": "news", "published": "2017-08-01T21:12:00.000+03:00", "replies_count": 0, "uuid": "e470e079e017164e551ad29b5e6f36d3306af346"}, "author": "", "url": "http://www.devonlive.com/5m-upgrade-for-road-surface-of-north-devon-link-road-announced/story-30465043-detail/story.html", "ord_in_thread": 0, "title": "£5m upgrade for road surface of North Devon Link Road announced | Devon Live", "locations": [], "entities": {"persons": [{"name": "north devon", "sentiment": "none"}, {"name": "ken browse", "sentiment": "none"}, {"name": "jesse norman", "sentiment": "none"}, {"name": "cllr stuart hughes", "sentiment": "none"}, {"name": "halberton", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "brian greenslade", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}, {"name": "devonlive", "sentiment": "none"}, {"name": "jesse norman mp", "sentiment": "none"}], "locations": [{"name": "north devon link road", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "link road", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "community road wardens", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "devon county council cabinet member for highway management", "sentiment": "none"}, {"name": "ministry of transport", "sentiment": "none"}, {"name": "devon county council's highway maintenance community enhancement fund", "sentiment": "none"}, {"name": "barnstable lib dem", "sentiment": "none"}, {"name": "north devon conservative", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "£5m upgrade for road surface of North Devon Link Road announced By DanielClark   1 COMMENTS SHARES Comments (1) \nThe North Devon Link Road is set to undergo a major £5 million upgrade of its road surface and drainage. \nTransport Minister Jesse Norman has today announced that sections of the A361 will be improved, following Devon County Council's successful bid for Challenge Funding. \nDevon is one of nineteen areas across the country to receive a share of £75 million of government investment for essential road maintenance. \nThe Minister confirmed that Devon will receive £4.25 million from the Department for Transport to improve the road surface on parts of the North Devon Link Road. The remainder of the scheme funding is from Devon County Council and developer contributions. \nLow noise surface will used on the link road and the new junction which will be constructed to access developments to the east of Tiverton. \nIt comes as today DevonLive.com has launches a campaign which urges the Government to fast-track improvements to the \"killer\" North Devon Link Road following the tragic death of a woman and her two children on the Link Road on Monday \nThe campaign calls for a timetable to be put together so North Devon residents can have confidence in the programme of delivery of £250m improvements \nA consultation into the changes ended last week and now the Ministry of Transport will be presented with three options before a decision is made on a preferred scheme – but without any set timetable in place for the improvements. \nJesse Norman told DevonLive: \"Certainly, the council receives annual money from us, a portion of which can be used for road safety, on existing schemes, if there are bigger schemes which need government support, we stand ready to listen to them, we work very closely with them already, on the North Devon link-road scheme, which is potentially tens to even hundreds of millions of pounds, and we're supporting them in producing that bid. READ MORE: Mother and two children killed in A361 crash \n\"So we're really bending over backwards, trying to accommodate and support the local council, and to hopefully bring the benefits of better transportation to the South West and to Devon.\" \nAsked whether the government fast-track the proposed 250 million link-road improvements, he said: \"Well that's what I've just been talking about. No fast-tracking until we've had the bid, we have to have a bid in before we can do that. Once we have that we can consider it, and we do that, on its merits, against bids from around the country. You know, there are lots of parts of the country which are seeking road funding, there is more funding being made available under this government than in recent living memory, and we just need to make sure these bids are as strong as possible, that's why we spend money investing in and supporting local councils, and doing the best job they can in making their case to central government.\" \nOn today's announcement. Cllr Stuart Hughes, Devon County Council Cabinet Member for Highway Management, said: \"This is a very welcome announcement of funding to carry out necessary surface improvements on one of our major roads in the county. \n\"The Government funding for resurfacing the North Devon Link Road will enable us to focus support toward more minor roads across Devon, and continue the roll-out of our Community Road Warden Scheme and our Highway Maintenance Community Enhancement Fund.\" \nAs part of the scheme, Devon County Council has already funded essential drainage improvements on the A361, which has been completed three weeks ahead of schedule. \nOvernight work on the filter drains on the stretch of the Link Road from Junction 27 of the M5 to Tiverton was due to continue throughout August, but was completed in the early hours of Saturday. \nTransport Minister Jesse Norman MP today said: \"We are taking the big decisions for Britain's future by investing in the infrastructure the country needs and ensuring motorists have the well maintained roads they expect and deserve.\" \nUsing the Challenge Funding on a major road enables the County Council to use other highway maintenance funding on more minor routes on its 8,000 mile highway network as well as supporting volunteer Community Road Wardens. \nREAD MORE: The A361 tragedy: Fatal crash was day after another serious collision on 'unsafe road' \nRead more at http://www.devonlive.com/the-8203-a361-tragedy-fatal-crash-was-day-after-another-serious-collision-on-unsafe-road/story-30463048-detail/story.html#24gOMxJZIMEAGsZF.99 \nOver 40 volunteers from town and parish councils have signed up as Community Road Wardens, enabling them to carry out a range of duties including minor work such as weed clearance, grass cutting, sign cleaning, small drainage work, and minor road repairs. A further 130 volunteers from 80 parish and town councils have received Chapter 8 training funded by Devon County Council, with more than 30 from other organisations such as district councils and probation service undertaking the training. \nThrough £95,000 of Devon County Council's Highway Maintenance Community Enhancement Fund (HMCEF) last year these volunteers delivered work with a value of more than £168,000. \nKen Browse, Community Road Warden for Halberton, said: \"We care about our community and the people in our community, and with a lack of funding available for upper tier authorities, volunteers from parish councils can roll up our sleeves and step in to help. It was a good opportunity for the Minister to see what we're doing at grass roots level.\" \nCounty Councillor Brian Greenslade campaigned against the original design for the North Devon Link Road in the late 1970s and 1980s. He told DevonLive.com that he had always felt the design encouraged dangerous overtaking. \n\"This tragic accident just proves once again that it's a killer road,\" the Barnstable Lib Dem said. \n\"People argue that it's bad driving but the design of the carriageway that just leads to people driving more dangerously than they would on a properly dualled road. \n\"The trouble is that because it's not a trunk road we're locked into this process whereby Devon County Council has to bid for Government funding, and at a time of cuts and Brexit there are a lot of distractions. \n\"I am pleased that the Journal is launching this campaign - we need to apply as much pressure as possible to ensure these improvements get done as soon as possible.\" \nAlthough acknowledging that investigations were still under way into both incidents, that the causes were yet to be determined and the crashes were a \"tragedy\", North Devon Conservative MP Peter Heaton-Jones said: \"It is an unsafe road.\" \n\"We don't know the causes [of the crashes] at the moment, but people are taking too many risks because there are short overtaking lanes that suddenly merge at not much notice.\"", "external_links": [], "published": "2017-08-01T21:12:00.000+03:00", "crawled": "2017-08-01T21:36:38.004+03:00", "highlightTitle": ""}