{"organizations": [], "uuid": "4d6f97863429f335ff64638dcf07635407d42085", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11963210.ece/ALTERNATES/s1200/JS101110115.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farming-coalition-calls-government-bring-13432983", "country": "GB", "domain_rank": 21960, "title": "Farming coalition calls on the Government to bring in transitional deal for Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-04T17:09:00.000+03:00", "replies_count": 0, "uuid": "4d6f97863429f335ff64638dcf07635407d42085"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farming-coalition-calls-government-bring-13432983", "ord_in_thread": 0, "title": "Farming coalition calls on the Government to bring in transitional deal for Brexit", "locations": [], "entities": {"persons": [{"name": "gove", "sentiment": "none"}, {"name": "dame helen ghosh", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "brexit business farming coalition", "sentiment": "negative"}, {"name": "the soil association", "sentiment": "none"}, {"name": "national trust", "sentiment": "none"}, {"name": "food and rural affairs", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "british poultry council", "sentiment": "none"}, {"name": "national pig association", "sentiment": "none"}, {"name": "national beef association", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "national federation of young farmers clubs", "sentiment": "none"}, {"name": "tenant farmers association", "sentiment": "none"}, {"name": "royal association of british dairy farmers", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "national farmers union", "sentiment": "none"}, {"name": "national sheep association", "sentiment": "none"}, {"name": "cla", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Farming coalition calls on the Government to bring in transitional deal for Brexit Unprecedented coalition of 14 farming groups puts pressure on Government to get measures in place for the end of the CAP Share A combine harvester in a field (Image: Owen Humphreys/PA Wire) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAn unprecedented coalition of farming associations has called on the Government to arrange transitional agreements as the UK leaves the European Union to protect the agricultural industry from “risks and uncertainties”. \nFourteen farming organisations - including the NFU, the CLA and the Tenant Farmers Association - have come together to issue a joint statement which calls on the Government to provide short-term certainty for the industry as the decision to leave the European Union and the Common Agricultural Policy draws closer. \nThe organisations have called on the Government and the devolved administrations to work together with the farmers and land managers to prepare for a free trade agreement which retains and grows opportunities for food trade with the EU and the rest of the world. \nThey are also calling for commitments on transition that will see the UK remain in the Customs Union until a full free trade agreement is in place with the EU. \nThe statement comes after a Brexit roundtable which saw a broad range of farming organisations come together to provide a united voice for the agricultural sector. \nIt says: “Exiting the European Union and the Common Agricultural Policy has sweeping implications for UK farming. UK farming is a vital part of the national economy, contributing in excess of £24b of revenues and around £8.5bn of Gross Value Added to the UK economy in 2015. It also accounts for over 500,000 jobs. It is also responsible for the management of our farmed countryside which makes up around 70% of the total UK land mass. Read More Gove plans for new farm subsidies given cautious welcome in North East \n“Looking to the future, there are many opportunities to increase markets for our products, to drive innovation and new investment into our industry, to increase our productive efficiency, to upskill our workforce and to establish new, simpler and more effective means of supporting farmers and land managers to deliver a range of benefits to society. \n“The process of exiting the EU brings risks and uncertainties that have to be managed. That is why we are calling on the UK Government to seek to secure an agreement on an initial transition period through which the UK retains unfettered access to European markets, remaining within the Customs Union. Such arrangements must be in place for the full duration of negotiations and implementation of a Free Trade Agreement between the UK and the EU that could extend beyond the end of Article 50 process. \n“We are committed to working with the UK Government to maintain the high standards of quality, welfare and provenance that sets out UK food in domestic and international markets. This includes supporting the UK’s world leading assurance schemes like Red Tractor, that are critical to the UK brand. As well as maintaining a commitment to maintain and champion UK standards in trade policy with the EU and the rest of the world. \n“We believe that a fairer, more transparent and accountable UK supply chain is vital to the future of a sustainable domestic food market that works in the best interest of consumers and producers.” \nThe statement has been signed by the British Poultry Council, CLA, National Beef Association, National Farmers Union, National Federation of Young Farmers Clubs, National Pig Association, National Sheep Association, Royal Association of British Dairy Farmers, The Soil Association, Tenant Farmers Association and farming groups in Scotland, Wales and Northern Ireland. \nThe statement has come after a warning from the head of the National Trust that Britain’s countryside faces a decade of “damaging uncertainty” unless the Government takes urgent action to support farming and wildlife in the wake of Brexit. Read More Brexit poses 'real risks' to UK food supplies, new report warns \nDame Helen Ghosh said affordable, high-quality food and wildlife-friendly methods can be secured if the Government maintains the £3bn a year support for the industry and reassures farmers that food standards and environmental protections will be maintained. \nShe said: “We are within touching distance of a vision for the future of farming that sees thriving businesses successfully meeting the needs of the nation into the 21st century and beyond. \n“The longer we wait, the more we risk losing all the gains we have made over the last decade.” \nA spokesman for the Department for Environment, Food and Rural Affairs said: “Leaving the EU provides us with a golden opportunity to set up new frameworks for supporting our farmers to grow more, sell more and export more great British food. \n“We have committed to match the £3bn agricultural support until 2022 and the Environment Secretary has said that support for our farmers will continue for many years to come where the environmental benefits of that spending are clear. \n“As we develop this new approach to food and farming outside the EU we will not compromise on our high standards of animal welfare and environmental protection.” Like us on Facebook", "external_links": [], "published": "2017-08-04T17:09:00.000+03:00", "crawled": "2017-08-04T17:40:14.002+03:00", "highlightTitle": ""}