{"organizations": [], "uuid": "00d84f4d151685936d9452b5874c5a8df155e6eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9543189.ece/ALTERNATES/s1200/JS39138120.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/ward-hadaway-reports-flat-turnover-13480599", "country": "GB", "domain_rank": 21960, "title": "Ward Hadaway reports flat turnover amid difficult British economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-16T02:01:00.000+03:00", "replies_count": 0, "uuid": "00d84f4d151685936d9452b5874c5a8df155e6eb"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/ward-hadaway-reports-flat-turnover-13480599", "ord_in_thread": 0, "title": "Ward Hadaway reports flat turnover amid difficult British economy", "locations": [], "entities": {"persons": [{"name": "ward hadaway", "sentiment": "negative"}, {"name": "jamie martin", "sentiment": "negative"}, {"name": "paul hughes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "chris smith", "sentiment": "none"}, {"name": "bond dickinson", "sentiment": "none"}, {"name": "stefan bainbridge", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}], "locations": [{"name": "bainbridge", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "leeds", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ward Hadaway reports flat turnover amid difficult British economy Managing partner Jamie Martin said he was content with turnover remaining flat at just under £36m Share Jamie Martin, managing partner at Ward Hadaway Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLaw firm Ward Hadaway has reported a “solid” financial performance after its turnover remained flat at just under £36m. \nThe company, with offices in Newcastle, Leeds and Manchester, said income was steady at just short of £36m, similar to revenues of £35.8m accrued in the last financial year. \nWard Hadaway declined to reveal its profit figure for the 2016/17 financial year but said it remained “on track”. \nDuring 2015/16 the firm’s profit margin was 32.2% and In terms of turnover the firm has grown by 26% over the last 10 years. \nDespite the steady results Ward Hadaway boosted its lawyer numbers in Newcastle by 7%. \nCommenting on the results managing partner Jamie Martin said: “We are very content that income remains steady across all of our departments and offices in what was a somewhat difficult year for the British economy. Jamie Martin, managing partner at Ward Hadaway \n“Uncertainties caused by Brexit and the political situation in a number of countries including our own have affected the legal market place and so to be able to report a 3% increase in volume is a more than satisfactory outcome. \nHe added: “It is also particularly pleasing to report that profit remained relatively strong, despite the significant investment which we made over the course of the year. \n“Continuing to invest in our operations is vital to the ongoing success of the firm and is something we remain committed to going forward.” \nAmong those joining the firm was Stefan Bainbridge, who returned to Ward Hadaway as a partner from Bond Dickinson. Mr Bainbridge now heads up the specialist rural land and estates team. Read More Ward Hadaway and Weightmans call off merger talks amid strategic differences \nThe firm also hired a specialist insurance team, made up of consultants Paul Hughes and Chris Smith. \nWard Hadaway added that its property team had a stand out year after they were named UK Regional Law Firm of the Year in the Legal 500 Awards 2017. \nIts specialist plot sales team completed the sale of 3,336 new homes in the last 12 months, a figure which represents 1 in 50 of all new homes built in England. \nEarlier in the year it was revealed that Ward Hadaway had entered into merger talks with Liverpool-headquartered Weightmans. The merger would have created a new top 40 UK law firm with revenues of around £130.9m. The deal fell through in April amid strategic differences. \nIn a statement regarding the financial results, Mr Martin added: “We are proud to be a ‘Northern based Law Firm for National Business’ and we look forward to benefiting from a political commitment to the Northern Powerhouse as we support our clients’ ambitions across the North. \n“We believe that there is a place for a mid-sized commercial law firm dedicated to the North and to the markets we serve and our recent commitment to our independence supports that vision.” Like us on Facebook", "external_links": [], "published": "2017-08-16T02:01:00.000+03:00", "crawled": "2017-08-16T02:28:21.002+03:00", "highlightTitle": ""}