{"organizations": [], "uuid": "74f8fc4152518d36a70809d139dfd222bc9b2d5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13556687.ece/ALTERNATES/s1200/Construction-industry-employment-report.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/skills-shortage-affects-90-growing-13556644", "country": "GB", "domain_rank": 21960, "title": "Skills shortage affects 90% of growing North East firms, report suggests", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-31T19:28:00.000+03:00", "replies_count": 0, "uuid": "74f8fc4152518d36a70809d139dfd222bc9b2d5c"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/skills-shortage-affects-90-growing-13556644", "ord_in_thread": 0, "title": "Skills shortage affects 90% of growing North East firms, report suggests", "locations": [], "entities": {"persons": [{"name": "sarah glendinning", "sentiment": "none"}, {"name": "geordie bangers", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "consett", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Skills shortage affects 90% of growing North East firms, report suggests ECI Growth Survey highlights North East as area with largest skills shortage, plus most concerns about the future of the economy Share Builders on a building site (Image: PA) Share Get business   Thank you for subscribing!   \nThe extent of the skills crisis in the North East has been laid bare by a report which says more than 90% of growing firms in the region are suffering from a shortage of skilled staff. \nThe ECI Growth Survey polls growing firms around the country on levels of confidence, where they expect to see growth and other factors affecting the business community. \nThe survey points to a number of concerns in the region, with the North East highlighted as an area where companies are most concerned about a downturn in the economy . \nBut it is in the area of skills that the region appears to be particularly suffering, with 91% of companies in the region taking part in the survey saying they have suffered from skills shortages, more than double the rate of the North West and significantly higher than any other UK region. Read More Geordie Bangers to open Grainger Market shop after regional success \nConcerns on skills could be made worse by Britain leaving the EU , the report says, but companies polled also say that shortcomings in the education system need to be tackled urgently. \nThe report says: “The message to Government is clear: Britain’s entrepreneurs need clarity on the terms of Brexit sooner rather than later, and reassurance that the UK economy will come through the coming uncertainty unscathed. Read More Jobs coming to former Consett steelworks site with creation of business units \n“Once it does, public investment in our schools system will be crucial if we are to turn out workers that can meet the needs of our ambitious growth firms.” \nThe report says that access to finance, a perennial complaint for high-growth businesses, has improved on last year, and adds that high-growth companies may be benefiting from the fall in the value of the pound, which is boosting exports. \nBut it says that many companies are concerned about the longer term impact of Brexit, with almost two-thirds fearing a recession in the UK and a quarter concerned that EU trade negotiations will go against them. \nThe report shows that the North East is one of the regions most reliant on the EU for trade, with 64% of companies saying they are most likely to export to Europe, second only to the Midlands. Sarah Glendinning, director, CBI North East \nSarah Glendinning, regional director of the CBI, said: “Skills and access to labour are a top business priority with many firms worried that they can’t get the people they need to thrive. Getting the skills and education system right and closing the attainment gap, remains a big challenge for Government. \n“There are very positive signs throughout the North East with more businesses supporting schools, for example using the Gatsby Benchmarks to provide excellent careers guidance, and investing in workplace training – firms need to, and continue to keep upping their game in this area.” Like us on Facebook", "external_links": [], "published": "2017-08-31T19:28:00.000+03:00", "crawled": "2017-08-31T19:44:14.008+03:00", "highlightTitle": ""}