{"organizations": [], "uuid": "12ce656395acd52c3bc64d40ddb4f7e832fd084d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i4.leicestermercury.co.uk/incoming/article306107.ece/ALTERNATES/s1200/Ibstock-PIC.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/sales-soar-ibstock-back-buoyant-305970", "country": "GB", "domain_rank": 48128, "title": "Sales soar at Ibstock on back of buoyant housing market - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.194, "site_type": "news", "published": "2017-08-10T12:50:00.000+03:00", "replies_count": 0, "uuid": "12ce656395acd52c3bc64d40ddb4f7e832fd084d"}, "author": "Lauren Mills", "url": "http://www.leicestermercury.co.uk/news/business/sales-soar-ibstock-back-buoyant-305970", "ord_in_thread": 0, "title": "Sales soar at Ibstock on back of buoyant housing market - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "wayne sheppard", "sentiment": "none"}], "locations": [{"name": "leicester mercury sales", "sentiment": "none"}, {"name": "cannock", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north west leicestershire", "sentiment": "none"}, {"name": "lodge lane", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "ibstock", "sentiment": "negative"}, {"name": "general election", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "vismedia", "sentiment": "none"}, {"name": "lapd", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sales soar at Ibstock on back of buoyant housing market A county brick maker is defying Brexit gloom with strong sales and profits Share Ibstock truck hard at work Share Comments \nA leading UK brick maker reported strong growth in revenues as demand for new homes continued to soar. \nIbstock, which is listed on the London Stock Exchange and has its headquarters in the North West Leicestershire village of the same name, said revenues grew by nearly 9 per cent to more than £228 million in the half year to the end of June. \nPre-tax profits rose by almost 3 per cent to nearly £39 million, though this came in at £43.3 million before exceptional items. \nIbstock said its new 100 million capacity brick plant at its in Leicestershire base is on track to commence commissioning in the final quarter of this year and will expand the company’s UK brick capacity by around 13 per cent when in full production. Read More LAPD hopes Leicestershire safety cushions can be used in suicide situations \nIt is also growing capacity at its Lodge Lane blue brick plant in Cannock, which should also start production in the final quarter of 2017. \nThe company said UK clay sales were benefiting from “good activity levels” within the UK new-build housing sector, with brick volumes “well ahead” compared to the same time last year. \nIbstock said its concrete division was continuing to grow and that a new roof tile line produced by its Forticrete business was now in production with healthy take-up from the major house builders. Wayne Sheppard, the CEO of Ibstock plc (Image: VisMedia) \nWayne Sheppard, the chief executive of Ibstock, said: \"The group has delivered a robust first half performance. UK brick volumes were well ahead, driven by good activity levels in the UK new build housing sector and our concrete businesses also enjoyed solid growth. \n\"Against this backdrop of continued robust demand we are investing in the UK clay business to increase capacity. Read More Hastings Direct speeds ahead in insurance market \n\"Our new brick factory in Leicestershire will begin commissioning in the final quarter of this year, with production to build progressively across 2018. \n\"When operating at its full capacity of 100 million bricks per annum it will expand UK domestic brick production by 5 per cent, adding a much needed new source of supply. \n\"A second project - to increase capacity at our blue brick plant at Cannock - is also on track. \n\"Looking ahead, the longer term fundamentals underpinning the new-build housing market in the UK - government support, good mortgage availability and an undersupply of new homes - remain in place, although we continue to be alert to any changes in customer confidence stemming from political uncertainty after the recent General Election result and the on-going Brexit negotiations. \n\"The group remains strongly cash generative, we are investing for further growth, and our expectations for another year of progress are maintained.\" Like us on Facebook ", "external_links": [], "published": "2017-08-10T12:50:00.000+03:00", "crawled": "2017-08-10T16:29:56.021+03:00", "highlightTitle": ""}