{"organizations": [], "uuid": "e624462430c8a00f8c7df73b7e1956245b44a7d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13396021.ece/ALTERNATES/s1200/HS2-project.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/burning-question-northern-rail-debate-13526453", "country": "GB", "domain_rank": 21960, "title": "The burning question of the Northern rail debate: is Chris Grayling just a little bit daft?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-24T20:31:00.000+03:00", "replies_count": 0, "uuid": "e624462430c8a00f8c7df73b7e1956245b44a7d8"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/burning-question-northern-rail-debate-13526453", "ord_in_thread": 0, "title": "The burning question of the Northern rail debate: is Chris Grayling just a little bit daft?", "locations": [], "entities": {"persons": [{"name": "chris grayling", "sentiment": "negative"}, {"name": "grayling", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "betty", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "christopher grayling", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "pennines", "sentiment": "none"}], "organizations": [{"name": "transport", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Transport Secretary Chris Grayling (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA question that has been bothering me over the last few days is this: is the Transport Secretary Chris Grayling just a little bit daft? \nOn the one hand, this seems unlikely. Mr Grayling is a senior Cabinet Minister who has a degree from Cambridge and can point to a successful career in the media and business before entering politics . \nOn the other hand there is the evidence. \nMr Grayling managed to offend pretty much the entire Northern business community earlier this summer by cancelling rail improvements over the Pennines before then giving approval for a large rail scheme in London. \nOfficials at the Department for Transport have spent much of the intervening few weeks trying to downplay this unfortunate sequence of announcements, while more than 80,000 people in the North signed a petition calling for a re-think. Read More Mike Ashley is a hero for our time (when he's asleep, anyway) \nOn Wednesday, business and political leaders from around the region met to discuss their response, and Mr Grayling thought this a good time to write an article in a Leeds newspaper saying that it was pretty much up to the North to sort out our own transport system. \nThat was, I would suggest, a little bit daft. For one thing, because it made a group of angry people even angrier, and it also ignored the fairly obvious fact that we can’t do much until he gives us the money. He is, as Newcastle City Council leader Nick Forbes quipped: “Passing the buck without passing the bucks.” Read More Time for Ministers to grow up and stop Brexit disaster, says North East business chief \nI’d like to think that I am wrong and there is method to Mr Grayling’s madness but I am - as my Auntie Betty used to say - buggered if I can see it. \nIt would be uniquely galling if something as important to the North as transport was put in the hands of such a clot at this particular juncture, but that seems to be the case. \nWhere we can take some heart is the size, speed and togetherness of the response to Mr Grayling from around the North. A co-ordinated and well-argued response has already been formulated and a campaign to get this ridiculous decision reversed is gathering pace. \nHopefully there is someone in Whitehall with a brain larger than a pea who will see sense, though the chances of that being Christopher Grayling seem fairly slim. \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2017-08-24T20:31:00.000+03:00", "crawled": "2017-08-24T20:57:16.009+03:00", "highlightTitle": ""}