{"organizations": [], "uuid": "1433d23779952756ece9c298bc352cd9d1c212ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12625181.ece/ALTERNATES/s1200/Health-and-social-care-cuts.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/number-unfilled-nhs-jobs-north-13445740", "country": "GB", "domain_rank": 21960, "title": "The number of unfilled NHS jobs in the North East is revealed in 'worrying' new figures", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-08T15:00:00.000+03:00", "replies_count": 0, "uuid": "1433d23779952756ece9c298bc352cd9d1c212ed"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/number-unfilled-nhs-jobs-north-13445740", "ord_in_thread": 0, "title": "The number of unfilled NHS jobs in the North East is revealed in 'worrying' new figures", "locations": [], "entities": {"persons": [{"name": "chris gray", "sentiment": "none"}, {"name": "clare williams", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "ann stringer", "sentiment": "none"}, {"name": "claire williams", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "england cumbria", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "northumbria healthcare nhs foundation trust", "sentiment": "none"}, {"name": "local workforce action board", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "health education north east", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The number of unfilled NHS jobs in the North East is revealed in 'worrying' new figures The number of vacancies reached its joint highest figure on record for the region in March Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe number of unfilled NHS jobs in the North East has hit one in 55 - the region’s joint highest figure on record. \nNew figures have revealed that the equivalent of 63,878 people were working full-time in the NHS in the region in March. \nDuring the same month there were 1,173 adverts for full-time jobs - meaning that one in 55 NHS jobs in the North East was empty. \nThe data shows that a full-strength NHS in the region would have at least 65,051 staff and that at least 1.8 per cent of posts were vacant. \nThe NHS has published monthly data on vacancies and its current staff going back to February 2015 and this figure is the joint-highest on record for the North East. \nDuring this time it has fluctuated between 1.1% (one in 87)and 1.8% (one in 55). (Image: PAPeter Byrne/PA Wire) \nBut the real vacancy rate could be higher as the service sometimes advertises multiple jobs in the same advert. \nThe data includes both frontline doctors and nurses and support staff. \nCommunity health services were the most common area to be advertised in the North East , followed by admin jobs and then medicine. \nThe NHS in the North East has also grown slightly, employing the equivalent of 123 more people in March 2017 full-time than it did in March 2016. \nUNISON Northern’s regional secretary Clare Williams said “a perfect storm” of pay worries, access to training and post-Brexit uncertainty for migrant workers was leading to a staffing “crisis” in the NHS. Claire Williams UNISON Northern regional secretary (Image: newcastle chronicle) \nMs Williams said: “We’re seeing the continuing public sector pay cap having a massive impact, then you’ve got the reversal of the student bursary which affects the number of qualified staff coming through. We’re also seeing the impact of the EU referendum result. \n“What we’re getting is a perfect storm of pay restraint, lack of access to continuing training and some elements of the workforce not sure whether they’re able to stay in the country.” \nAnn Stringer, executive director of human resources and organisational development at Northumbria Healthcare NHS Foundation Trust, said: “The NHS as a whole is facing big challenges in relation to the recruitment and retention of the future workforce and at Northumbria we are proud to have one of the lowest vacancy rates of any NHS organisation in England. \n“We are also very passionate about growing our own workforce and for over ten years have run one of the largest apprenticeship schemes in the NHS with over 95% of apprentices securing employment with us.” Read More Looking for a job in the NHS? Here are 10 of the roles available in the North East \nProfessor Chris Gray, medical director for NHS England Cumbria and the North East, said: “Staffing is a priority across the whole of the NHS and these figures illustrate the huge efforts being made by employers to recruit talented health and care staff across the board, but they also highlight the growing demand for these staff. \n“NHS England in Cumbria and the North East is working with Health Education North East and other health and social care partners through the Local Workforce Action Board to ensure we have the staff required to provide first class care across the region.” Like us on Facebook", "external_links": [], "published": "2017-08-08T15:00:00.000+03:00", "crawled": "2017-08-08T15:30:35.002+03:00", "highlightTitle": ""}