{"organizations": [], "uuid": "340f1fe34bfc7ea6218fdc3c4ad19741550f4dd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13466079.ece/ALTERNATES/s1200/110817Office3.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-science-central-legal-general-13464191", "country": "GB", "domain_rank": 21960, "title": "Plans for £65m development at Newcastle's Science Central development given go ahead", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-12T13:00:00.000+03:00", "replies_count": 0, "uuid": "340f1fe34bfc7ea6218fdc3c4ad19741550f4dd6"}, "author": "Chris Knight", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-science-central-legal-general-13464191", "ord_in_thread": 0, "title": "Plans for £65m development at Newcastle's Science Central development given go ahead", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Plans for £65m development at Newcastle's Science Central development given go ahead Planning chiefs at Newcastle City Council have given the eight-storey office proposal at Science Central the go-ahead Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPlanning chiefs have given the green light to the £65 million regeneration project at Newcastle’s Science Central. \nThe eight-storey Grade A office development proposal submitted by Legal & General on the 24-acre former Newcastle Brown Ale brewery site will create 627 new jobs. \nAt a meeting of Newcastle City Council’s planning committee on Friday, plans were given the go-ahead subject to conditions and a section 106 agreement. \nRachel Dickie, investment manager at Legal & General Capital, said: “It is fantastic to have received planning approval on our first office development on this prime gateway plot. “Delivering Grade A office space will help to act as an important catalyst for further investment in Newcastle Science Central and forms a significant next step in this major city centre regeneration project. \n\"The building, designed by Ryder Architecture, complements the existing development whilst adding a new dimension to Newcastle Science Central.\" A CGI of how the first L&G office building, designed by Ryder Architecture, at Newcastle Science Central will look (Image: Ryder Architecture) \nIn homage to the region’s steel manufacturing and ship-building past, the first of Science Central’s two planned office developments will be copper-coloured and clad in steel and glass Read More \nThe structure designed by Ryder Architecture will have office space from the first floor to the seventh, and a double height reception space and a cafe. \nInterested in North East jobs? Find job vacancy listings across a range of sectors here . \nApproval was also granted for the creation of a temporary car park with 110 spaces on the site. A CGI of how the first L&G office building, designed by Ryder Architecture, at Newcastle Science Central will look (Image: Ryder Architecture) \nJulie Seaton, planning officer at Newcastle City Council, said: “The scheme will provide high-quality office development, and a distinct and what we feel will be a landmark building.” \nConsidered one of the biggest urban regeneration projects of its kind in the UK, the scheme at Science Central is being delivered as part of a partnership between Legal & General, Newcastle City Council and Newcastle University. \nThe mixed-use development is set to create more than 4,000 jobs in total, with 500,000 square foot of office space and 450 homes in the heart of the city. A CGI of how the first L&G office building, designed by Ryder Architecture, at Newcastle Science Central will look (Image: Ryder Architecture) Read More Is Brexit just another challenge for businesses across the North East to overcome? \nNewcastle City Council will manage and operate the building when complete. The two office buildings, along with The Core – a 27,000 sq ft space for start-ups and SMEs – will form the gateway to Science Central. \nA public square will also be created in between the three structures to improve accessibility and provide an amenity for workers, visitors and the surrounding community. Read More ", "external_links": [], "published": "2017-08-12T13:00:00.000+03:00", "crawled": "2017-08-12T15:25:23.014+03:00", "highlightTitle": ""}