{"organizations": [], "uuid": "a72a75608aa8c85b030587209a9da824e6a6864b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "https://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.8084974.1501690450!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "http://www.bostonstandard.co.uk/news/two-thirds-of-migrants-in-boston-want-to-see-more-done-to-bring-communities-together-research-finds-1-8084976", "country": "GB", "title": "Two thirds of migrants in Boston want to see more done to bring communities together, research finds", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-03T02:01:00.000+03:00", "replies_count": 0, "uuid": "a72a75608aa8c85b030587209a9da824e6a6864b"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/two-thirds-of-migrants-in-boston-want-to-see-more-done-to-bring-communities-together-research-finds-1-8084976", "ord_in_thread": 0, "title": "Two thirds of migrants in Boston want to see more done to bring communities together, research finds", "locations": [], "entities": {"persons": [{"name": "oldham", "sentiment": "none"}, {"name": "fizza qureshi", "sentiment": "none"}, {"name": "daniel jaines", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "dagenham", "sentiment": "none"}, {"name": "wolverhampton", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "esol", "sentiment": "none"}, {"name": "migrants’ rights network", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Two thirds of migrants in Boston want to see more done to bring communities together, research finds No Caption ABCDE PPP-171005-173156001 Daniel Jaines Published: 00:01 Thursday 03 August 2017 \nTwo thirds of migrants living in Boston think immigration is talked about negatively and would like to see more action to bring together local communities together, research released today has found. \nThe Migrants’ Rights Network interviewed more than 270 respondents living in four locations – Boston, Wolverhampton, Oldham, and Barking and Dagenham – which had a majority leave vote in the EU referendum and have a high non-UK born population. \nOf those, 136 respondents were living in Boston, including 130 who migrated from Europe. \nIt is believed to be ‘the first quantification’ of migrant opinion in Boston on immigration examining migrants’ experiences of Brexit and immigration policies in the UK. \nOrganisers said that respondents in Boston recommended more action to bring together migrant and non-migrant communities to increase community cohesion and build strong relationships. \nThey also called for better provision of ESOL classes and providing more information to migrant workers about their employment rights. \nNationally, the study found that a majority of migrants thought the local leave vote was driven by a belief among Britons that there are too many migrants in the UK or a desire for some of them to leave. \nMost respondents felt that the referendum had already impacted life in the UK, including by increasing hate crime and discrimination, and creating uncertainty about migrants’ future status. \nDirector of MRN Fizza Qureshi said: “Brexit means that immigration policy will be reshaped over the coming years. Our research shows how important it is we don’t exclude the people at the centre of the discussion – migrants themselves. If we do, we risk making the debate even more negative and polarised, while failing to address the issues facing our communities. \n“If we want to build strong local communities, free of exploitation, we’ve got to invest in bringing migrants and non-migrants together and listening to the concerns they raise. That’s the route to a more positive discussion about immigration that builds bridges by treating everyone, wherever they come from, with respect.” Sign in", "external_links": [], "published": "2017-08-03T02:01:00.000+03:00", "crawled": "2017-08-03T08:45:54.004+03:00", "highlightTitle": ""}