{"organizations": [], "uuid": "c075dffbd3316c3d6ccad20eb4665b9af18b7c74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13536497.ece/ALTERNATES/s1200/SGP_NEC_081013TURBINESTOCK02JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/rent-gob-researchers-risk-leading-13536504", "country": "GB", "domain_rank": 21960, "title": "Rent-a-gob researchers risk leading the North East into decisions which cause us harm", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-27T18:00:00.000+03:00", "replies_count": 0, "uuid": "c075dffbd3316c3d6ccad20eb4665b9af18b7c74"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/news/north-east-news/rent-gob-researchers-risk-leading-13536504", "ord_in_thread": 0, "title": "Rent-a-gob researchers risk leading the North East into decisions which cause us harm", "locations": [], "entities": {"persons": [{"name": "paul benneworth", "sentiment": "none"}, {"name": "low hauxley", "sentiment": "none"}, {"name": "patrick minford", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "druridge bay", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "amble", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "warkworth castle", "sentiment": "none"}, {"name": "cullercoats", "sentiment": "none"}, {"name": "netherlands like", "sentiment": "none"}], "organizations": [{"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "rspb", "sentiment": "none"}, {"name": "raf", "sentiment": "none"}, {"name": "northumberland wildlife trust", "sentiment": "none"}, {"name": "royal air force", "sentiment": "none"}, {"name": "university of twente", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wind turbines in Northumberland (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nI am writing this at the end of my annual North East-based family summer holidays. This year, with our new arrival, we visited Amble on Northumberland’s coast. \nIt certainly lived up to its title of England’s friendliest port, and we’ve already booked to return next year. \nAmble has lost none of its traditional fishing village charms with accessible family friendly beaches, fish’n’ chips in the harbour and craft ice cream. It’s also gradually upgraded its services with new restaurants, bistros and a micro-pub. \nAmble is compact, and heading to Warkworth Castle or south towards the still-pristine Druridge Bay you’re quickly in the countryside. \nAnd the week’s unusually sunny weather allowed us to really enjoy that countryside at its verdant best. \nI was really impressed with the diversity of Amble’s wildlife. I’d expected to see the gulls, oystercatchers and cormorants – after all, we grew up with those at Cullercoats. \nBut what really amazed me was to see the return of the ‘big birds’. \nWhether the stork gliding effortlessly over fields of wheat or a pair of buzzards circling ominously over their prey, I honestly can’t ever remember such diversity in the North East. \nMuch credit goes here to the Northumberland Wildlife Trust and the RSPB’s hard work in restoring these marvellous creatures’ natural habitats. \nPartly this is also due to better regulation of farming practices, pollution and pesticides, bringing wider benefits with salmon and otters return to the region’s once dead-rivers. \nThis has been part of wider north eastern shift towards ‘cleaner’ industries, and another pleasing change I spotted was growing numbers of windfarms. \nBut that left me scratching my head, because I remember when I was researching Northumberland’s renewable energy industry in the early 2000s, some experts swore blind that wind farms would exterminate the region’s avian wildlife. \nAnd yet, running along to Low Hauxley, I could see storks, hawks and windmills all co-existing in perfect harmony. \nThe mystery deepened further when a RAF fast jet raced overhead. \nWe were also told windmills were the ultimate security threat, making the Royal Air Force’s low-flying exercises impossible and opening us up to Russian fly-by probes. \nThese claims it appears were from people simply opposed having windmills in Northumbria, without really caring about wildlife or national security. \nBeing sceptical of these claims in 2003, I was thrilled to finally be proved correct and witness renewable energy at the heart of Northumberland’s environmental transformation. \nBut I remain concerned about these rentagob researchers who trot out tendentious studies for pandering to selfish interest groups’ prejudices and whims with no regard for our own welfare. \nAnd I was reminded of that when Patrick Minford cropped up last weekend repeating claims that Hardline Brexit could deliver mountains of gold for the UK. \nHe claimed that tariff-free trade would generate squillions of pounds annually, and the BBC gave him free rein on the BBC to repeat his nonsense. \nAnd his research has been embraced by extremist anti-European groups who value ideological purity over more prosaic concerns such as jobs, public services and the environment. \nLike with wind energy, you can’t call these claims lies because they are predictions about the future. \nBut they are very dangerous because they try to persuade us to follow our gut instincts towards self-harming choices instead of taking more measured decisions that can benefit us all. \nWe’ve got a beautiful region here in the North East, but there’s an army of ideologues who’d sacrifice us to pander to their outdated dogma. \nSo beware, be on your guard, and demand our policy-makers take the right decisions to build the future region that we all want to live, work and play in. \n* Dr Paul Benneworth is a senior researcher at the University of Twente in Enschede, Netherlands Like us on Facebook", "external_links": [], "published": "2017-08-27T18:00:00.000+03:00", "crawled": "2017-08-27T19:46:17.022+03:00", "highlightTitle": ""}