{"organizations": [], "uuid": "dff7f5dcf75da4af8d9b8ddada21bf34a23eb6de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13485555.ece/ALTERNATES/s1200/Tees-Valley-Business-Summit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/north-east-one-region-two-13485616", "country": "GB", "domain_rank": 21960, "title": "The North East may be one region with two systems - but it has a great deal going for it", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-16T20:00:00.000+03:00", "replies_count": 0, "uuid": "dff7f5dcf75da4af8d9b8ddada21bf34a23eb6de"}, "author": "Graham Robb", "url": "http://www.chroniclelive.co.uk/news/news-opinion/north-east-one-region-two-13485616", "ord_in_thread": 0, "title": "The North East may be one region with two systems - but it has a great deal going for it", "locations": [], "entities": {"persons": [{"name": "ben houchen", "sentiment": "negative"}, {"name": "delos", "sentiment": "none"}, {"name": "mike leigh", "sentiment": "none"}, {"name": "john tomaney", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "rishi sunak", "sentiment": "none"}, {"name": "graham robb", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "cheju", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "durham tees valley airport", "sentiment": "none"}, {"name": "dunkirk", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "none"}, {"name": "entrepreneurs’ forum", "sentiment": "none"}, {"name": "new mayoral development corporation", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "teesside pension fund", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "recognition pr", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Mayor Ben Houchen has praised businesses as he addressed delegates at the Tees Valley Business Summit (Image: Gazette) Share Get daily   \n‘One country, two systems’ is the constitutional system that governs China, allowing Hong Kong to operate a successful capitalist economy. In the North East , we are now “One region, two systems”. \nThis week marks 100 days since the Tees Valley became a devolved area , with the election of a new Mayor, Ben Houchen, and the transfer of money and powers devolved under agreement with the government. \nSo far, it has been a tremendous success. The mayor, a Conservative , has worked constructively with the Labour leaders of local authorities and business is responding to devolution with optimism and confidence. \n“I told you so” is not a very constructive point, but for those leaders elsewhere in the North East, who botched their devo deal, it is a fair point. As the then chair of the Institute of Directors and, as one of many voices in private business, I was very public in urging North East local authorities to get on with striking a deal and being in phase one of devolution along with Liverpool, Manchester and Tees Valley. \nNow it is time for some reckoning, facts tell a positive story so far. In Tees Valley since May: \nPrivate business has announced the creation of 1,300 new jobs. \n£240m of private sector investment has been announced. \n£200m investment has been secured from a landmark deal with Teesside Pension Fund. \n£7.5m “Routes to Work” scheme begun to help 2,500 of the most disadvantaged. \n£1.5m Apprenticeships Fund under way. \nNew Mayoral Development Corporation secured and about to start work. \nNegotiations under way to bring Durham Tees Valley Airport under local control. \nThe best thing about the money coming to Tees Valley is that it does not add to the overall tax burden of the country. \nThis is devolved money that was taken by government in taxes and administered by Whitehall. \nThe devolution deal cuts out the central bureaucracy, with one mayor and five council leaders deciding how the money is spent. \nThe result is more money for the frontline and less for the bureaucratic machine. This is an important point because our country still has to live within its means. \nI returned from a holiday in Greece this month. When I hear media outlets and opposition politicians casually use the term “austerity”, I think they should see the results of real austerity there. \nYears of public deficits led to the Greek debt crisis which caused bail-outs and loans from international bodies. \nThese finance deals came with strings attached and interest to be paid. \nThe result is seen everywhere that the public sector is involved. The airports are chaotic – where we landed, 1980s TV monitors showing public notices were broken, baggage conveyor belts didn’t work and not enough staff were available to load aircraft quickly. \nOn the roads, white lines had not been repainted, resulting in dangerous junctions. \nI talked to a teacher who told me her salary was less than 1000 Euros (£900) a month. With VAT at 24%, the black economy is thriving. Renting a car on a Sunday, I was ushered into a bar to complete the paper work because I was told “wicked tax collectors” were monitoring the opening hours of the office to calculate business income. Three restaurants I visited would not take debit cards, only accepting cash. \nWhen we complain about austerity, we should be pleased we don’t have to endure the hardships of Greece. Read More The North deserves more investment and we say it's time we got a fair deal \nI seldom hear the virtues of free enterprise, the means of generating wealth, being discussed by politicians. Their minds seemed pre-programmed to boast about what they are spending, with the media happy to play along with a narrative about cuts and austerity as the root cause of any problem. \nEducators also need to come out of their bubble – a professor at Newcastle University was writing in The Journal this month about the Northern Powerhouse and making ridiculous and partisan assertions. \nHe also castigated the idea of freeports, suggesting a North East freeport would be a “recipe for low wages”. \nWhat nonsense. Freeports are as old as time. In Greece, I visited the island of Delos. In 167BC, the island developed as a freeport and the resulting commercial activity helped it become one of the richest cities of ancient Greece. After Brexit, Tees Valley wants a freeport. It could be used to attract industry, it could be home to manufacturing finishing shops – used to add imported components to UK manufactured products or vice versa, then re-exporting them without taxes being levied. Read More Have we seen the end of the Conservatives’ much-vaunted Northern Powerhouse, asks John Tomaney \nA North East freeport, or free trade zone, on the River Tees could be one of the biggest Brexit boosts to our economy. \nThe Journal’s academic columnist should look for more evidence – I suggest he reads the paper on this matter by North MP Rishi Sunak, published by the Centre for Policy Studies. He also could look at “International City” in Cheju, Korea, or one of the 100+ free zones in the USA, many of which attract motor manufacturers. \nI keep reading gloom about Brexit, with overly-pessimistic interpretations of key data. \nBut my own experience, based on talking to real businesses and on the surveys of organisations such as the Entrepreneurs’ Forum, is that there is relative buoyancy in the economy. Read More Mike Leigh's Peterloo film could do for Labour what Dunkirk has done for Brexit \nGrowth has slowed a bit, but the UK is still out-performing France, Italy and Japan. Furthermore, unemployment has now fallen so much that – thankfully – the North East is no longer the number one unemployment blackspot of Britain. \nThis one region with two systems has a great deal of good going for it. It is time that the positive stories seen in the business pages of this newspaper were acknowledged and talked up by the politicians and commentators that dominate the news. \nGraham Robb is senior partner, Recognition PR, and vice-chair, Entrepreneurs’ Forum \n@GrahamRobb", "external_links": [], "published": "2017-08-16T20:00:00.000+03:00", "crawled": "2017-08-16T20:45:29.002+03:00", "highlightTitle": ""}