{"organizations": [], "uuid": "8ec53d6f1847424fb167cb38430a14b587e3b19d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13411453.ece/ALTERNATES/s1200/Amazon.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13451614", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Amazon's corporation tax halves while turnover rises 54%", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-10T10:25:00.000+03:00", "replies_count": 0, "uuid": "8ec53d6f1847424fb167cb38430a14b587e3b19d"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13451614", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Amazon's corporation tax halves while turnover rises 54%", "locations": [], "entities": {"persons": [{"name": "richard barksby", "sentiment": "none"}, {"name": "mooky greidinger", "sentiment": "none"}, {"name": "streetdots", "sentiment": "none"}, {"name": "graham minne", "sentiment": "none"}, {"name": "niels", "sentiment": "none"}, {"name": "dan foskett", "sentiment": "none"}, {"name": "david brown", "sentiment": "none"}, {"name": "graham minett", "sentiment": "none"}, {"name": "komori", "sentiment": "none"}, {"name": "jonathon manning cineworld", "sentiment": "none"}, {"name": "abellio", "sentiment": "none"}, {"name": "jeremy helsby", "sentiment": "none"}, {"name": "jorgen vig knudstorp", "sentiment": "none"}, {"name": "atholl milton", "sentiment": "none"}, {"name": "padda", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "statexcolourprint", "sentiment": "none"}, {"name": "liam coleman", "sentiment": "none"}, {"name": "niels christiansen", "sentiment": "none"}, {"name": "darren callcott", "sentiment": "none"}, {"name": "guy bell", "sentiment": "none"}, {"name": "streetdots", "sentiment": "none"}, {"name": "cineworld", "sentiment": "none"}, {"name": "milton", "sentiment": "none"}, {"name": "christiansen", "sentiment": "none"}, {"name": "keolis", "sentiment": "none"}], "locations": [{"name": "deadpool", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "teesside park", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "broadgate circle", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "birtley", "sentiment": "none"}, {"name": "london midland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bali padda", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "thurrock", "sentiment": "none"}, {"name": "dunkirk", "sentiment": "none"}, {"name": "abellio", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}], "organizations": [{"name": "savills", "sentiment": "negative"}, {"name": "amazon", "sentiment": "negative"}, {"name": "jonathon manning savills", "sentiment": "negative"}, {"name": "estate", "sentiment": "negative"}, {"name": "gn netcom", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "sofology 9:10 jonathon manning newcastle", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "boh pte", "sentiment": "none"}, {"name": "broadgate circle", "sentiment": "none"}, {"name": "co-op group", "sentiment": "none"}, {"name": "dfs", "sentiment": "none"}, {"name": "connection retail", "sentiment": "none"}, {"name": "mckinsey", "sentiment": "none"}, {"name": "govia", "sentiment": "none"}, {"name": "lloyds bank hp & leasing", "sentiment": "none"}, {"name": "direct wood flooring", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "lego", "sentiment": "none"}, {"name": "east japan railway company", "sentiment": "none"}, {"name": "coventry", "sentiment": "none"}, {"name": "birmingham mail", "sentiment": "none"}, {"name": "mitsui", "sentiment": "none"}, {"name": "nec", "sentiment": "none"}, {"name": "danfoss", "sentiment": "none"}, {"name": "lego group", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "co-op bank", "sentiment": "none"}, {"name": "go-ahead group", "sentiment": "none"}, {"name": "cineworld", "sentiment": "none"}, {"name": "co-operative bank", "sentiment": "none"}, {"name": "co-operative group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Savills sees half-year profits surge 27% to £32.4m \nEstate agency Savills has reported a surge in half-year profits, but also flagged a slowing UK residential market and warned over Brexit uncertainty. The firm saw pre-tax profits rise 27% to £32.4m in the six months to June 30, helped by a strong performance in Asia.Revenues jumped 15% to £714.4m.But UK residential fee income decreased by 4% to £55m as fewer house sales were completed.It meant that the firm’s UK residential transaction business saw underlying profits decline by 27% to £5.4m.Savills warned: \nIncreased levels of political and economic uncertainty created by the General Election and the ongoing negotiations to leave the EU make it difficult to predict market volumes for the rest of the year. \nThe firm said increasing levels of global insecurity have driven a shift towards income-producing assets, which has boosted the London office market where the first half saw nearly £9bn of transactions, 78% of which were to non-domestic investors.These investors, Savills said, still see the UK as “comparatively secure”, despite Brexit.Boss Jeremy Helsby said: \nIn an environment of ongoing political and economic uncertainty, we continue to anticipate that our performance for the full year will be in line with the board’s expectations. Savills For Sale sign in London 9:20 KEY EVENT Newcastle street food revolution set to be served by StreetDots tech startup \nA street food entrepreneur is set to team up with North East foodie firms in a venture which could serve up an ever-changing menu of vendors in the region . \nTech startup StreetDots helps food vendors and traders find pitches for their business through its ground-breaking app which has already seen huge success in London. \nOnce a “dot” has been booked by the trader the app automatically takes care of all the compliance and licensing work, meaning locals can be treated to a variety of delicious food as traders quickly move around the area. \nNow co-founder Atholl Milton has confirmed Streetdots has the North East in its sights, after receiving a £500,000 investment to fuel expansion, with plans to trigger a revolving selection of street food in Newcastle within the next few months. \nNow he and business partner Darren Callcott want to hear from local traders keen to take part. \nMr Milton said: \nWe have our sights on Newcastle and the North East as an area for expansion. We hope to open new dots in the region within the next few months. \nWe’d love to hear from any local street food traders or mobile caterers who would like to get involved. \nThe app has already been used successfully in London’s Broadgate Circle, where office workers are treated to a different selection of vintage food trucks every lunch time \nNewcastle is among cities set to launch Streetdots following the £500,000 investment from private Singapore fund BOH Pte, which previously injected £350,000 into the business in January. \nThe funds will be used to bring the app to a host of major cities across the UK. StreetDots has been successfully used by food vendors at London's Broadgate Circle (Image: Unknown) 9:15 Jonathon Manning DFS profits to be hit by general election and warm spring \nSofa chain DFS has confirmed that profits will take a hit after an uncertain economic environment, the snap General Election and warm weather led to weak trading at its stores.The retailer said it saw “significant declines in store footfall and customer orders” from April to June, leading to a 4% fall in second half revenue.It follows a strong first six months of the year, when sales rose 7%, helping total revenue for the year ending July 29 eke out 1% growth.As previously flagged, DFS anticipates full-year operating profit to be lower than market expectations, in the range of £82m to £87m.In a stock market update, the retailer said: \nThe second half has been weaker than we expected owing to significant declines in store footfall and customer orders across April, May and June. \nWe believe this to be an industry-wide issue, resulting from the uncertain economic environment and unexpected General Election, exacerbated by warm weather in May and June. \nThe group described the UK furniture market as “very challenging” with an uncertain outlook.DFS added that it will seek out efficiency savings as revenue growth becomes “harder to achieve in the short term”.However, the firm said that its summer sale “started satisfactorily in July”.Last week DFS acquired rival Sofology in a £25m deal and will take over its chain of 37 UK stores. DFS store at a Teesside Park shopping centre - the firm has acquired rival Sofology 9:10 Jonathon Manning Newcastle printer's £1.4m investment in machinery set to help to secure jobs \nA Newcastle printer has invested £1.4m in a state-of-the-art printing press to help slash production times and energy consumption, with banking support. \nStatexcolourprint directors say the new machinery will use 25% less energy than its previous printing presses, boosting productivity and helping to secure jobs, while also reducing the firm’s environmental impact. \nThe company, which employs 75 people at its base in Airport Industrial Estate, prints everything from business cards to company reports and banners, with clients including blue chip multinational companies and a number of universities. \nThe press was supplied by Japanese manufacturer Komori and a number of Statexcolourprint’s staff have travelled to Komori’s European base in Holland to receive specialist training in how to operate it. \nJoint managing director Graham Minett said: \nThis is an industry that has moved on dramatically in the last ten years, with a greater focus on speed and efficiency. \nThis new machine is faster, uses less energy and creates less wastage. \nIt’s a substantial investment that will cut our lead times and enable us to hit the tight deadlines that our clients demand. It’s all part of our strategy to become more productive and profitable. \nThe investment was supported by an asset finance facility supplied by Lloyds Bank HP & Leasing, which enables businesses that have capital tied up in stock, plant or property to raise funds using those assets as security. Statexcolourprint leaders Graham Minne, joint managing director, and Richard Barksby, marketing & sales development manager (Image: Statexcolourprint) 9:05 Jonathon Manning Flooring firm Connection Retail embarks on national shop rollout amid £300,000 investment \nA North East flooring firm has pledged to create new jobs as part of plans to open a host of new stores across the country. \nCounty Durham’s Connection Retail started out five years ago as an online-only retailer, selling outdoor furniture and flooring through it websites. \nRapid growth has since seen the business – winner of two awards at the Journal-backed North East Business Awards in 2016 – expand to open its first physical store in Birtley in February, to be swiftly followed by store openings in Thurrock and Bracknell. \nNow the retailer is rolling out its flooring shops, investing £300,000 to fuel its fifth store opening, with more to follow. \nThe six figure sum has been spent on the launch of a Coventry branch, which opened in July, and its new store in York, which will open later this month. \nThe major investment will also lead to the creation of 10 new jobs, taking the company’s headcount to over 100 by the end of the year. \nManaging director Dan Foskett said: \nThe store launches are significant investments for the company as we look to increase our geographical presence in the UK. \nBy operating a number of commercial counters in various regions this will also strengthen our links across the country, while maintaining a strong online presence. \nEach store will sell a range of flooring products from the company’s Direct Wood Flooring brand. The Direct Wood Flooring team at Connection Retail's new Coventry store 9:00 Jonathon Manning Cineworld's profits surge 57.5% \nBlockbusters such as Beauty And The Beast and a refurbishment programme helped profits surge at Cineworld in the first half. \nThe cinema chain saw revenue rise 17.8% to £420.2m in the six months to June 30, while pre-tax profit increased 57.5% to £48.2m. \nAdmissions rose 10% to more than 50m as Cineworld said customers had “embraced” revamps aimed at creating “better sightlines, bigger screens, better sound and great comfort”. \nThe top three films on the slate - Beauty And The Beast, Guardians Of The Galaxy Vol 2 and The Fate Of The Furious - together grossed £143m. \nThe three biggest titles in the first half of last year - The Jungle Book, Deadpool and Captain America: Civil War - grossed £120m. \nCineworld boss Mooky Greidinger said: \nI believe that the six months results clearly reflect our strategy and a good quality of film slate. \nOur strategy is based on our strong belief in the cinema experience, emphasising our efforts on creating our cinemas in a way that will give our customers ‘the best way to watch a movie’. \nThe firm is also encouraged by the calibre of films in the second half, which have so far included Dunkirk, Despicable Me 3 and Spider-Man: Homecoming. Releases still to come in 2017 include Star Wars: Episode VIII. Cineworld's profits have soared 57.5% (Image: hinckley times) 8:55 Lego replaces chief executive after just eight months \nLego is replacing its British chief executive Bali Padda, just eight months after appointing him. \nThe Danish toymaker said on Thursday that the 61-year-old will be sidelined to make way for Niels Christiansen, 51, who is currently boss of industrial tech firm Danfoss. \nMr Padda, who was only appointed in December as part of a wide-ranging management shake-up, will retain a role at the firm as a special adviser. \nMr Christiansen will take up the role on October 1. \nLego chairman Jorgen Vig Knudstorp said the transition to a new chief executive occurred “more rapidly than the board had anticipated”. \nHe added: \nNiels is a great leader who delivered outstanding results while CEO of Danfoss. \nHis experience in digitalisation and globalisation, implementing a transformative strategy, and creating an agile, high-performing, international team will benefit the Lego Group. \nMr Christiansen began his career at management consultancy McKinsey and became chief executive of GN Netcom when just 33. He joined Danfoss in 2004 and became top dog in 2008. During his tenure, the company doubled in value to 39bn Danish krone (£4.74bn). \nHe said: \nI have loved building with Lego bricks since I was a child. \nAs I look at the challenges facing this generation of children, the group’s mission, to inspire and develop the builders of tomorrow, is more important and urgent than ever. People enjoying building and looking at the amazing lego and brick creations at Brick Live at Birmingham's NEC (Image: Birmingham Mail) 8:50 KEY EVENT Go-Ahead Group loses West Midlands franchise \nNewcastle’s Go-Ahead Group’s has lost its contract to run the West Midlands rail franchise, after running the service for 10 years. \nThe transport group originally won the contract in 2007, but today the contract was given to Abellio, whish is a joint venture between East Japan Railway Company and Mitsui. \nGo-Ahead had operated the service through its joint venture Govia, which is 35% owned by Keolis. \nIn a statement to the stock exchange. Go-Ahead chief executive David Brown said: \nLondon Midland and its people have been part of our Group’s rail business for ten years. In that time we have delivered significant improvements across the entire network which have seen London Midland transformed into an award-winning franchise with high levels of employee engagement and customer satisfaction. \nI would like to thank everyone involved in London Midland for their hard work and contribution to the company’s successes. \nGovia will continue to operate the current contract until December 2017, after which Abellio will take control of the line. The new contract will run for nine years. \nRoutes between London, the West Midlands and Liverpool are set to receive and investment of almost £1bn. The cash will be used to add an additional 400 new vehicles to the fleet, which will carry 85,000 more passengers during rush hour. David Brown, chief executive Go-Ahead Group (Image: Guy Bell) 8:45 Jonathon Manning Co-op bank trims losses to £135m but sheds another 25,000 customers \nTroubled lender the Co-operative Bank has narrowed half-year losses, but continued to shed banking customers and borrowers amid uncertainty ahead of its recent rescue deal. \nThe group said it lost around another 25,000 current account customers since the end of last year, while it also saw £400m of instant access savings cash pulled out. \nIt confirmed it was partly hit by “retail customer reaction to uncertainty” surrounding the £700m deal secured in June with its hedge fund investors - a move that will spell the end of its historic relationship with the Co-operative Group. \nChief executive Liam Coleman insisted the Co-op Bank had put in a “resilient” performance in its first half, with losses trimmed to £135.2m for the six months to June 30 from £177m a year earlier. \nHe added: \nThe vast majority of customers have remained very loyal as we have progressed the sale and capital raise process and I am extremely grateful for their ongoing support. \nOf course there is more hard work ahead, and, like other banks, we recognise there are risks to the UK economy, but this is a great bank and we are positive about the future. \nUnder the refinancing package agreed with its hedge funds, which is expected to complete in September, the wider Co-op Group’s stake in the bank will shrink from 20% to around 1%, with the lender also agreeing to separate itself from the wider mutual’s pension scheme. \nBut the bank will keep the Co-op branding and has pledged to retain “values and ethics at its heart”. \nThe deal will give Co-op Bank the ability to meet regulations on long-term capital requirements, avoid it being wound down and allow it to continue as a stand-alone lender. The Co-op Bank (Image: Getty Images Europe) 8:40", "external_links": [], "published": "2017-08-10T10:25:00.000+03:00", "crawled": "2017-08-10T12:26:04.008+03:00", "highlightTitle": ""}