{"organizations": [], "uuid": "c3c4b90684a05b1f937c12639f9416231aaf6f23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13083909.ece/ALTERNATES/s1200/ESH-GROUP.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13482736", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Esh Group to build homes on £8bn national framework", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-16T10:35:00.000+03:00", "replies_count": 0, "uuid": "c3c4b90684a05b1f937c12639f9416231aaf6f23"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13482736", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Esh Group to build homes on £8bn national framework", "locations": [], "entities": {"persons": [{"name": "liz truss", "sentiment": "none"}, {"name": "baker tilly", "sentiment": "none"}, {"name": "boden", "sentiment": "none"}, {"name": "esh construction", "sentiment": "none"}, {"name": "andrew radcliffe", "sentiment": "none"}, {"name": "david stevens", "sentiment": "none"}, {"name": "esh", "sentiment": "none"}, {"name": "andy radcliffe", "sentiment": "none"}, {"name": "nicholas boden", "sentiment": "none"}, {"name": "russell mcburnie", "sentiment": "none"}, {"name": "humber", "sentiment": "none"}], "locations": [{"name": "north west", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "south and south west", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ogden", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "esh group", "sentiment": "negative"}, {"name": "financial reporting council", "sentiment": "none"}, {"name": "key event esh group", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "frc", "sentiment": "none"}, {"name": "communities agency", "sentiment": "none"}, {"name": "hca", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "esh group share", "sentiment": "none"}, {"name": "homes and communities agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Performance Horizon's AI tech takes off through trial with British Airways \nA Newcastle firm leading a software revolution with artificial intelligence (AI) has taken a major step forward by trialling it with three global firms , including British Airways. \nPerformance Horizon, which works with large international companies to track online sales and pay commission to third party marketers, initially revealed its in-house team was developing AI technology in January. \nNow the firm, tipped to become a $1bn tech “unicorn”, has taken a major leap forward and entered its second stage of development. \nThe programme, which is still to be named, is being trialled by Marriott Hotels & Resorts, British Airways and leading fashion marketplace The Iconic. Performance Horizon’s new software adds an extra layer to the firm’s core business of handling electronic payments and commission for major multinational companies. \nUsing the AI tech, clients are able to forecast how changes in commission payments will impact their sales and revenue. L-R: Paul Fellows, Alistair Wyse and Chris Blaxall of Performance Horizon 9.15 Coreena Ford Northumberland seafood restaurateurs open new eatery La Famiglia \nA Northumberland food group has expanded its portfolio with the opening of an Italian eaterie , creating new jobs in the process. \nThe Old Boat House Food Group, which runs a series of successful Northumberland restaurants including Blyth Boathouse and The Old Boat House Amble, have opened La Famiglia in the former Pride of Northumbria premises on Queen Street . \nLa Famiglia, which is set to offer authentic Italian dishes with a Northumberland twist, follows the recent success of The Old Boat House Amble being named as Coastal Fish Restaurant of the Year in the 2017 Fishing News Awards. \nIt has also been nominated as Seafood Restaurant of the Year by The Caterer, which has spurred the group to diversify their portfolio with La Famiglia. \nOwner Martin Charlton said: “The Old Boat House Food Group is founded on excellent quality and La Famiglia will be no exception. \nThe family run group, which formed in 2014, hopes that by creating new jobs they can further demonstrate their commitment to creating opportunities for young people. Martin Charlton and Ruth Charlton in La Famiglia, Amble (Image: Dee Chaneva) 9.06 Coreena Ford Ward Hadaway reports flat turnover amid difficult British economy \nLaw firm Ward Hadaway has reported a “solid” financial performance after its turnover remained flat at just under £36m. \nThe company, with offices in Newcastle, Leeds and Manchester, said income was steady at just short of £36m, similar to revenues of £35.8m accrued in the last financial year. \nWard Hadaway declined to reveal its profit figure for the 2016/17 financial year but said it remained “on track”. \nDuring 2015/16 the firm’s profit margin was 32.2% and in terms of turnover the firm has grown by 26% over the last 10 years. \nDespite the steady results Ward Hadaway boosted its lawyer numbers in Newcastle by 7%. \nManaging partner Jamie Martin said: “We are very content that income remains steady across all of our departments and offices in what was a somewhat difficult year for the British economy. \n“Uncertainties caused by Brexit and the political situation in a number of countries including our own have affected the legal market place and so to be able to report a 3% increase in volume is a more than satisfactory outcome. \nHe added: “It is also particularly pleasing to report that profit remained relatively strong, despite the significant investment which we made over the course of the year.” Jamie Martin, managing partner at Ward Hadaway 9.02 Coreena Ford Hadrian's Tipi to return in new city centre location...the Odeon Cinema site \nHadrian’s Tipi could return to Newcastle within weeks following renewed efforts by leisure developers who have found a potential new home for the top attraction. \nAnd revised plans for Hadrian’s Winter Wonderland promise to be bigger and better than last year’s wigwam wonder, by taking up residence in the huge void left in the city centre by the demolition of the Odeon Cinema. \nChristmas-themed stalls, bars and eateries, live music and choirs and warming fire pits form part of the plans, which could see the tipi return in October. \nDanieli Holdings had originally hoped to bring Hadrian’s Tipi back to the Central Station area this summer, where it pulled in more than 118,000 people over the festive period, by creating an enchanted garden attraction. Proposals were also being made to erect the twin tipis at the site this year over the winter months too. \nThose plans were knocked back, however, when licensing officials blocked the Newcastle leisure firm’s bid for it to be set up again, deeming it to be not in-keeping with the neighbouring Grade-I listed station and “an incongruous feature, harmful to the setting of Newcastle Central Station ... and the character of the central conservation area.” \nNow, however, Danieli Holdings has submitted fresh plans to resurrect the marquee on the site of the former Odeon Cinema site and former Watson House, at the top of Pilgrim Street where the bottom of Northumberland Street meets Market Street. \nThe firm wants to install four shipping containers, two teepee tents and 11 timber huts which will be used for bars, restaurants and events for a temporary period from October 1 to December 7 - but it’s our understanding that it could run right over the Christmas and New Year period. Hadrian's Tipi was hugely popular at Newcastle Central Station last year - now it could be taking up residence on the former Odeon Cinema site (Image: Newcastle City Council planning portal ) 8.55 Coreena Ford Balfour Beatty back in profit on back of selective bidding \nBalfour Beatty swung back into profit in the first half as the construction firm’s turnaround under boss Leo Quinn continues. \nPre-tax profit came in at £12m in the six months to June 30, compared with a £15m loss in the same period last year. \nGroup revenue increased over 6% to £3.5bn and the firm’s order book fell 4.2% to £11.4bn, with Balfour putting it down to a “disciplined and selective approach to bidding”. \nThe results come as welcome relief to the firm after it was held back by onerous construction contracts that delivered poor returns last year. \nMr Quinn, who has been cutting costs under his Build To Last programme, said: “These results demonstrate the transformation being driven by focusing Balfour Beatty relentlessly on its chosen markets and capabilities. \n“Profitability is rising, backed by positive cash flow from operations, and the Group had average net cash during the period; all achieved without any material investment disposals. \n“The balance sheet remains strong, underpinned by the £1.2bn Investments portfolio.” A Balfour Beatty site", "external_links": [], "published": "2017-08-16T10:35:00.000+03:00", "crawled": "2017-08-16T11:21:07.014+03:00", "highlightTitle": ""}