{"organizations": [], "uuid": "b21544b64384d4df384f08d82d3d6d6c5650a852", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13460211.ece/ALTERNATES/s1200/Seaward-Group-managing-director-Andrew-Upton.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-just-another-challenge-businesses-13460074", "country": "GB", "domain_rank": 21960, "title": "Is Brexit just another challenge for businesses across the North East to overcome?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-11T09:00:00.000+03:00", "replies_count": 0, "uuid": "b21544b64384d4df384f08d82d3d6d6c5650a852"}, "author": "Anne Southby", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-just-another-challenge-businesses-13460074", "ord_in_thread": 0, "title": "Is Brexit just another challenge for businesses across the North East to overcome?", "locations": [], "entities": {"persons": [{"name": "huw john", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "william johnson", "sentiment": "none"}, {"name": "andrew upton", "sentiment": "none"}, {"name": "torro", "sentiment": "none"}, {"name": "keith taylor", "sentiment": "none"}, {"name": "rowan", "sentiment": "none"}, {"name": "mike rowan", "sentiment": "none"}, {"name": "mark lane", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "paul goldfinch", "sentiment": "none"}, {"name": "upton", "sentiment": "none"}, {"name": "michael farnsworth", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "torro", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "seaward group", "sentiment": "none"}, {"name": "atradiu", "sentiment": "none"}, {"name": "atradius", "sentiment": "none"}, {"name": "polar krush", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Is Brexit just another challenge for businesses across the North East to overcome? Over year has passed since Brexit, giving exporters time to get to grips with its implications. Mark Lane meets some of them Share Andrew Upton, managing director of Seaward Group (Image: Picture Keith Taylor) Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nIt takes a certain kind of mindset to head into international markets. \nBoldness, a willingness to embrace the unknown, positivity and a can-do approach – all these traits have been prominent in the countless exporters from the region I have met up with over the years. It was little surprise, therefore, to find a generally upbeat message from the exporters I approached about the Brexit issue. \nThere is no doubt the uncertainty about Brexit, the confusion about when we will actually leave the EU and doubts about what trading deals will be set up thereafter have caused a few sleepless nights for those with a lot of business in the EU. It would be naive to think otherwise. \nMost exporters I have spoken to off the record on this issue have made it clear that they think Brexit is, on balance, bad news from an economic standpoint (politics and issues around immigration etc aside). However, a year after the most significant economic/political event in the UK of the past half-century, there was a definite sense from the exporters I spoke to that they are adapting to and embracing the challenges posed by Brexit. \nThe no-nonsense approach I encountered was best summed up by Andrew Upton, managing director of Seaward Group, an exporter of electrical test instrumentation and biomedical test instrumentation. \nHe told me: “I don’t think it’s a matter of being more or less positive [about Brexit]; we have to remain positive. The democratic vote has happened, and we now have to negotiate the best for the country. The drop in sterling has had an impact on our procurement costs, but we are able to take advantage of currency gain when selling our products internationally. We’ve been able to retain our pricing within the UK, and this has helped our company against foreign imports, so at the moment there is a gain to the company overall. \n“We see emerging markets as important to us, so having the ability to create strong trading ties with these countries will now be vital. \n“If anything I think we will try to take advantage of the opportunity, so let’s remain positive, stop talking ourselves down, and let’s keep pushing British products and ingenuity globally.” Seaward is now in its 35th year and since its launch has always been involved in overseas trade. Upton tells me that Brexit did come as a “bit of a surprise”. \nHe adds: “But once the vote was finalised it became something we had to work with. As our exports are global we are protected a little more than if we were just exporting to Europe, but we are confident that with a positive outlook we can still compete in all territories. \n“Seaward is in a fantastic position to expand its market share in a number of territories outside of Europe, and this has been part of our strategy prior to the referendum.” William Johnson of Torro, with his business partner Michael Farnsworth \nA similarly upbeat attitude was in evidence from William Johnson, a director and co-founder of Torrocases.co.uk, a North Tyneside-based producer of smartphone and tech cases and other men’s fashion and lifestyle accessories. \nTorro first began exporting in the early part of 2014 and by the end of 2015, international trade had become a large part of the business. \nJohnson admits to being shocked at the initial Brexit result. “My first thought was that there is going to be a big burden for the business in terms of administrative changes,” he tells me. “The initial concern we had was regarding customs, in terms of moving products, as it will affect not just exporting out of the UK but around Europe as well. \n“The initial impact for us, as was the case with many businesses, was the instant weakening of the pound. We buy a lot of our material in US dollars and it was important for us to keep material costs as they were. \n“We have tried to pre-empt what might happen but you can never quite cover everything. I think there’s a lot we can’t predict until the discussions are over and we actually step out of Europe officially.” \nMore than a year on from the Brexit vote, Johnson says he feels much more comfortable about the challenges is poses. “We have done what we can already to mitigate the negatives, which we dealt with early on, so we feel much more confident about the future,” he says. “I didn’t, and still don’t, feel really positive about the situation as we are about to dismantle decades of policy-building for smooth EU trade but you have to work within the parameters set. \n“Issues will arise that nobody will have considered but we are in as good a position as we can be thanks to early intervention on our part.” \nJohnson touches upon a major issue with regards to Brexit – uncertainty. Businesses hate it, yet Brexit seems to have morphed into an almost textbook example of how to create uncertainty in a business environment, the arguments about soft-versus-hard Brexit having raged for months – with nothing remotely resolved as yet. Mike Rowan, regional manager for trade credit insurer Atradiu (Image: HUW JOHN) \nAs Mike Rowan, regional manager for trade credit insurer Atradius, says: “Over the last year, the main stimulus for change has been uncertainty: uncertainty about future trade deals, uncertainty about what a split from the EU might look like and uncertainty about its impact.” \nThat said, based on what he has seen, Rowan believes North East businesses are adapting and thriving, despite the uncertain times. \nHe adds: “While we appear to be no closer to establishing what a post-Brexit world will truly mean, North East businesses are already embracing the future and starting to consider the impact on overseas trade. \n“The ‘business as usual’ mentality we’ve seen arise in the North East is certainly positive and a sign of true resilience but one eye must remain fixed on the horizon for any possible Brexit fallout. \n“The Brexit shake-up has already stimulated North East businesses for considering new trade destinations across the world. Interestingly, this hasn’t been at the expense of European trade; North East businesses have not been deterred from continuing and creating new partnerships in Europe – and nor should they be. \n“Looking ahead, nobody can accurately predict what the outcome of a Brexit split will hold. But businesses cannot stand still and must find a way of navigating through the risks in the backdrop of shifting foundations. It’s not about shutting up shop as there are still opportunities to be explored – if you do things right.” \nArguably the main lesson to have come out of Brexit is that a successful business with the right attitude will always thrive – and Brexit should be viewed simply as another challenge to overcome. Paul Goldfinch of Polar Krush \nSuch is the case with Polar Krush, an international iced-drinks brand based in Ashington. Founded by Paul Goldfinch, the business has doubled its UK sales alone in the last 18 months and overall sales are continuing to grow by more than 62% per annum. Goldfinch said: “We have been exporting across Europe for 10 years. Over that time we have seen and overcome many challenges, including economic collapse in Iceland and Greece, but solutions have always been found, allowing us to grow and strengthen our brand across Europe.” \nGoldfinch admits that he had mixed feelings on hearing the referendum result. \n“It could be possible to trade with more countries outside of Europe with fewer barriers or charges but inside Europe it is likely to become more admin-heavy and we may be subject to some small duties,” he says. “Overall, I have to say I am cautiously optimistic as we continue to be in the top 100 fastest-growing businesses in the UK, which is a direct result of our success exporting across Europe and the rest of the world. We are continuing to grow at a rapid rate and we can absorb proposed duties of up to 15% and keep the British business flag flying.” Like us on Facebook", "external_links": [], "published": "2017-08-11T09:00:00.000+03:00", "crawled": "2017-08-11T20:27:05.017+03:00", "highlightTitle": ""}