{"organizations": [], "uuid": "439c4426aa219a950ce5b465ead12a921ae936bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13438372.ece/ALTERNATES/s1200/SGP_NEC_030817WRITER04JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/see-hijab-wearing-ballet-dancer-13438168", "country": "GB", "domain_rank": 21960, "title": "See why a hijab-wearing ballet dancer has become so important for a Bedlington film writer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-06T18:00:00.000+03:00", "replies_count": 0, "uuid": "439c4426aa219a950ce5b465ead12a921ae936bf"}, "author": "Lisa Hutchinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/see-hijab-wearing-ballet-dancer-13438168", "ord_in_thread": 0, "title": "See why a hijab-wearing ballet dancer has become so important for a Bedlington film writer", "locations": [], "entities": {"persons": [{"name": "syed", "sentiment": "none"}, {"name": "thorpe ali", "sentiment": "none"}, {"name": "rebecca", "sentiment": "none"}, {"name": "rebecca innes", "sentiment": "none"}, {"name": "bedlington", "sentiment": "none"}, {"name": "zylan mohd noor", "sentiment": "none"}, {"name": "muslim", "sentiment": "none"}, {"name": "syed zulkifli syed masir", "sentiment": "none"}, {"name": "khalil saleh", "sentiment": "none"}, {"name": "mike leigh", "sentiment": "none"}, {"name": "hijabsta ballet", "sentiment": "none"}, {"name": "adele", "sentiment": "none"}, {"name": "stephanie kurlow", "sentiment": "none"}], "locations": [{"name": "cannes", "sentiment": "none"}, {"name": "hijabsta ballet", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "dunkirk", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "bedlington", "sentiment": "none"}], "organizations": [{"name": "raindance", "sentiment": "none"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "london film academy", "sentiment": "none"}, {"name": "explosive magic sdn bhd", "sentiment": "none"}, {"name": "st benet biscop catholic high school", "sentiment": "none"}, {"name": "rebecca", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSitting behind her kitchen table at her Bedlington home, screen writer Rebecca Innes got hard at work to produce her first feature film. \nNow her masterpiece has been released in Malaysia and she hopes it will be screened in Britain in the near future. \nAnd the former St Benet Biscop Catholic High School pupil has told how she was so proud of her work when she travelled to the Asian country to see the premier last week. Rebecca Innes from Bedlington who wrote a film called Hijabsta Ballet (Image: Newcastle Chronicle) \nNow the 29-year-old is planning on rubbing shoulders with the rich and famous when the film is entered into the big film festivals, including Cannes, Raindance, Sundance. \n“I was really proud when I saw it on screen, it was really nice for me,” said Rebecca. “It is rare to get a feature film before a short film and to hear the actors speak the lines I wrote was so special. They did an excellent job too.” \nRebecca was the lead writer for the film titled ‘Hijabsta Ballet’, which hit the cinemas in Malaysia on August 3. \nDirected by Syed Zulkifli Syed Masir, the film is loosely based on the hijab-wearing ballet dancer Stephanie Kurlow, 15, from Australia. \nRebecca, whose day job is working in admin for an engineering firm, added: “The film is titled Hijabsta Ballet and covers a range of themes including personal struggle, family, and the complicated issues surrounding the hijab. The film touches on the false perceptions many Westerners hold in an increasingly Islamophobic world, but takes on even deeper angle with a focus on the conversations and tensions about it within the Muslim world.” (Image: Newcastle Chronicle) \nRebecca gained a Media Production degree at Northumbria University and because she got the highest first on her coarse, won a scholarship for a Creative Writing MA. \n“I then went to work at the London Film Academy where I took on a list of different roles, including reception and copy writing,” said Rebecca. “It was there I met the film’s director Syed, who was doing a diploma. Because English wasn’t his first language I helped him write a script and he liked the way I wrote. When he went back to Malaysia he got back in touch and asked if I would like to work with him again. \n“We now have a couple of things we are developing and I hope this is just the beginning.” \nRebecca co-wrote Hijabsta Ballet with Khalil Saleh, Thorpe Ali and Zylan Mohd Noor and Syed for his company, Explosive Magic Sdn Bhd. Rebecca Innes at her home in Bedlington (Image: Newcastle Chronicle) Read More Mike Leigh's Peterloo film could do for Labour what Dunkirk has done for Brexit \nThe film is about talented young dancer Adele who is on her way to great success until a pivotal experience prompts her to make a life-changing decision. Adele takes the hijab, claiming she will become the first Muslim ballerina. Her mother is heartbroken, her friends are confused and both the ballet scene and Muslim community reject her. Resolved to bring about change and acceptance, she sets out to find equilibrium between the two opposing worlds, but as word of her ambition spreads, she finds herself under serious threat from Jihadi fundamentalists. \n“I wrote it at my kitchen table in Bedlington ,” said Rebecca. “I was sent the outline for the story idea, I developed it, wrote the script and developed the scenes. I did it really quickly, in just four weeks and did it around my job too. \n“I hope to go back to Malaysia in September for an award ceremony as we hope to get nominated and win. \n“Already Japan has shown an interest but we hope that we can bring Hijabsta Ballet to the UK in the near future. We have entered the film into all of the big film festivals - Cannes, Raindance, Sundance - and we are hoping it will get noticed and gain a UK distribution.” Like us on Facebook", "external_links": [], "published": "2017-08-06T18:00:00.000+03:00", "crawled": "2017-08-06T18:18:59.008+03:00", "highlightTitle": ""}