{"organizations": [], "uuid": "24cae1f9b9315da819322364b3ceec755408834d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13549354.ece/ALTERNATES/s1200/coop.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/co-op-bids-buy-nisa-13549205", "country": "GB", "domain_rank": 21960, "title": "Co-op bids to buy Nisa convenience store chain - what does it mean for shoppers?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-30T15:13:00.000+03:00", "replies_count": 0, "uuid": "24cae1f9b9315da819322364b3ceec755408834d"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/co-op-bids-buy-nisa-13549205", "ord_in_thread": 0, "title": "Co-op bids to buy Nisa convenience store chain - what does it mean for shoppers?", "locations": [], "entities": {"persons": [{"name": "nisa", "sentiment": "negative"}, {"name": "lidl", "sentiment": "none"}, {"name": "booker", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "nisa", "sentiment": "none"}], "organizations": [{"name": "asda", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "co-op group", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Co-Operative have made a bid to buy up Nisa Local Share Get business updates   \nMore change could be coming to the UK supermarket scene after it emerged the Co-op Group has entered into exclusive talks to acquire convenience store operator Nisa. \nThe Co-op is thought to have tabled a £140m bid for Nisa, whose 1,300 shopkeeper members run 3,000 stores, including dozens in the North East. \nThe announcements comes after Sainsbury’s , which is under pressure to respond to Tesco’s £3.7bn merger with wholesaler Booker, paused takeover talks with Nisa. \nThe potential deal comes after Co-op was overtaken by Aldi in fifth position in the supermarket sales table. Confirming its interest in Nisa, the Co-op said that “we hope to be in a position where we can put forward an offer to Nisa members”. \nBut what does the potential deal mean for shoppers in the region? What is The Co-op up to and why? \nAt present, no deal has happened. The Co-op has entered into exclusive talks with Nisa and is essentially looking over its books before deciding on whether it wants to bid for it. \nNisa is unusual in that it is owned by 1,300 members who run its 3,000 stores. The Co-op is also slightly different to most businesses in being owned by its members, but it still has to compete in what is becoming a highly competitive market. \nA deal to buy Nisa would give The Co-op thousands more sites, though it raises the question of whether it would want to - or be allowed to - continue operating shops where existing Co-op stores are closed to Nisa outlets. Read More Peterlee's KF Training closes its doors - making 15 people redundant I thought Sainsbury’s were going to buy Nisa? \nSainsbury’s - the UK’s second largest supermarket chain - had been the preferred bidder as recently as June but is understood to be awaiting the findings of a Competition and Markets Authority (CMA) probe into the Tesco-Booker deal before it makes its next move. \nSainsbury’s already has a huge number of convenience stores and earlier this week announced that it would be trialling click-and-collect service for Argos and Tu clothing products in the run-up to Christmas. Is this the only deal going on? \nNot by any measure. As the retail and food sectors change rapidly, the big players in the market are moving just as rapidly to make sure they are the ones that survive and cope with the changing ways we shop. \nSo Sainsbury’s last year bought Argos and Tesco is looking to merge with wholesaler Booker, though that deal is subject to an investigation by the competition watchdog. \nIt is generally believed the food market is ripe for consolidation so expect more deals in the coming months and years. Read More Journal business growth campaign helps North East firms to create 7,700 jobs What is causing all this activity? \nIn recent years the food market has become more and more competitive, with a number of companies challenging the traditional ‘Big Four’ of Tesco, Sainsbury’s, Asda and Morrisons. \nThe emergence of German firms Aldi and Lidl has eaten away at the existing supermarkets’ market share, while more people than ever are buying their groceries online. \nIn America, internet giant Amazon has bought the Whole Foods supermarket chain and moved into the food sector, and it is likely that the company will look to take a chunk of the UK market soon. So what does this mean for shoppers? \nSo far, it has mostly been good news. \nThe most obvious of the supermarket battle has been a price war on the high street, with the major retailers cutting thousands of prices in a bid to see off the threat from Aldi and Lidl. \nMost experts believe the price of food could rise after Brexit, however, so cheap groceries might not be around for ever. Like us on Facebook", "external_links": [], "published": "2017-08-30T15:13:00.000+03:00", "crawled": "2017-08-30T16:41:09.009+03:00", "highlightTitle": ""}