{"organizations": [], "uuid": "7a8ff4754754f8c53faac3ed7e99c10e2fe4de1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13435925.ece/ALTERNATES/s1200/FILM-DUNKIRK.jpg", "site_section": "http://www.chroniclelive.co.uk/whats-on/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/news/news-opinion/mike-leighs-peterloo-film-could-13435913", "country": "GB", "domain_rank": 21960, "title": "Mike Leigh's Peterloo film could do for Labour what Dunkirk has done for Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-05T18:00:00.000+03:00", "replies_count": 0, "uuid": "7a8ff4754754f8c53faac3ed7e99c10e2fe4de1a"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/news-opinion/mike-leighs-peterloo-film-could-13435913", "ord_in_thread": 0, "title": "Mike Leigh's Peterloo film could do for Labour what Dunkirk has done for Brexit", "locations": [], "entities": {"persons": [{"name": "mike leigh", "sentiment": "negative"}, {"name": "peterloo", "sentiment": "negative"}, {"name": "john lees", "sentiment": "none"}, {"name": "eldon", "sentiment": "none"}, {"name": "percy bysshe shelley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bessie surtees", "sentiment": "none"}, {"name": "ye", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "st peter’s field", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "peterloo", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "dunkirk", "sentiment": "none"}, {"name": "waterloo", "sentiment": "none"}], "organizations": [{"name": "brexit news opinion", "sentiment": "negative"}, {"name": "dunkirk", "sentiment": "negative"}, {"name": "manchester guardian", "sentiment": "none"}, {"name": "chartist movement", "sentiment": "none"}, {"name": "lions", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "trade unions", "sentiment": "none"}, {"name": "hulton archive", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Mike Leigh's Peterloo film could do for Labour what Dunkirk has done for Brexit Two films which for some appear to sum up the mood in the UK at the moment Share Harry Styles of One Direction appears in the film Dunkirk, 2017 (Image: Publicity Picture) Share Get daily   \nIt’s grim up North but for now at least it offers the chance of extra cash, so long as you’re looking miserable enough. \nDirector Mike Leigh is making a movie about the Peterloo massacre in which 18 people were killed and hundreds injured after being attacked by troops including the King’s Hussars for having the temerity to want the right to vote and to be able to afford to eat. \nA casting website put up a notice saying “authentic Northern faces” were needed for it. Particularly extras who look like they “are tired, over-worked, had a hard life and, quite frankly, a bit hard done by.” \nThere’ll be a big queue. \nAnyone who knows about British social history will be aware of the infamous 1819 massacre in St Peter’s Field, Manchester. Mike Leigh (Image: PA) \nIt was christened Peterloo as a bitterly ironic nod to the Battle of Waterloo that happened four years before. One of the protestors killed was John Lees who had fought at Waterloo. \nFewer than 2% of the population had the vote and hunger was rife with the disastrous corn laws making bread unaffordable. \nProvocative banners like ‘Reform’, ‘universal suffrage’, ‘equal representation’ and, er, ‘love’, made the powers-that-be uneasy. \nThe speakers and organisers were put on trial, at first under the charge of high treason - a charge that was reluctantly dropped by the prosecution. The Hussars and those ‘who kept order’ received a message of congratulations from the Prince Regent, and were cleared of any wrong-doing by the official inquiry. Read More 10 Newcastle streets and why they were given the names we know today \nPeterloo was hugely influential in winning the vote for ordinary people, it led to the rise of the Chartist Movement from which grew the Trade Unions. A businessman who saw the massacre launched the Manchester Guardian newspaper - now the Guardian - in response. \nIs it just a coincidence how films seem to reflect or mirror the age they are made in? 'The Massacre of Peterloo or Britons Strike Home' (Image: Hulton Archive) \nOf late we’ve had Dunkirk, viewed by some as an allegory about Brexit , because it’s a story of plucky Brits getting out of Europe against all the odds (whilst ignoring the disaster bit). \nNow Peterloo, a story about a marginalised and ignored part of society beginning to get their voices heard. \nThe poet Percy Bysshe Shelley, then living in Italy, was inspired to write “The Mask of Anarchy”, when he learned of it. He had a pop at, among others, Lord Eldon who as lord chancellor, played a key role in drafting Acts to gag newspapers, prevent public meetings, and restrict freedom of speech after Peterloo. Read More As a major new film is released, what and where was Dunkirk - and why did it happen? \nHe was from Newcastle and was the subject of one of the city’s most romantic tales, his elopement with Bessie Surtees. \nThe poem famously finishes: ‘Rise like Lions after slumber; In unvanquishable number; Shake your chains to earth like dew; Which in sleep had fallen on you; Ye are many—they are few.’ \nTwo hundreds years later it’s a message that continues to reverberate. So much so, it might not just be the opportunity for work that benefits people in the North when Peterloo is made. Read More", "external_links": [], "published": "2017-08-05T18:00:00.000+03:00", "crawled": "2017-08-05T19:22:06.005+03:00", "highlightTitle": ""}