{"organizations": [], "uuid": "e026e271ed5ba2a94bfc7a4dbcc4215e2c2875f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article1439413.ece/ALTERNATES/s1200/000AA72A-DAF9-1052-B0EB80BFB6FA0000.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13477548", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Amec offers to sell assets to get Wood Group deal over the line", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-15T10:25:00.000+03:00", "replies_count": 0, "uuid": "e026e271ed5ba2a94bfc7a4dbcc4215e2c2875f9"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13477548", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Amec offers to sell assets to get Wood Group deal over the line", "locations": [], "entities": {"persons": [{"name": "fat buddha", "sentiment": "none"}, {"name": "samir brikho share", "sentiment": "none"}, {"name": "hakan enver", "sentiment": "none"}, {"name": "susan howe", "sentiment": "none"}, {"name": "daksh gupta", "sentiment": "none"}, {"name": "mears", "sentiment": "none"}, {"name": "neil travis", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "muckle", "sentiment": "none"}, {"name": "gupta", "sentiment": "none"}, {"name": "john watson", "sentiment": "none"}, {"name": "kate collyer", "sentiment": "none"}, {"name": "hutchinson", "sentiment": "none"}, {"name": "travis", "sentiment": "none"}, {"name": "morgan mckinley", "sentiment": "none"}, {"name": "ted ayres", "sentiment": "none"}, {"name": "enver", "sentiment": "none"}, {"name": "gary hutchinson", "sentiment": "none"}, {"name": "jason honeyman", "sentiment": "none"}, {"name": "arlen pettitt", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "heathrow airport  heathrow", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "square mile", "sentiment": "none"}, {"name": "west london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "muckle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "lake district", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "wembley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "wood group", "sentiment": "negative"}, {"name": "coreena ford former pe", "sentiment": "negative"}, {"name": "amec", "sentiment": "negative"}, {"name": "coreena ford business", "sentiment": "none"}, {"name": "the board", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}, {"name": "chrysalis leisure group", "sentiment": "none"}, {"name": "sunderland afc", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "middlesbrough academy", "sentiment": "none"}, {"name": "muckle llp", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "castle view enterprise academy", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}, {"name": "head of club wembley", "sentiment": "none"}, {"name": "middlesbrough football club", "sentiment": "none"}, {"name": "coreena ford eu", "sentiment": "none"}, {"name": "football association", "sentiment": "none"}, {"name": "amec foster wheeler", "sentiment": "none"}, {"name": "fat buddha", "sentiment": "none"}, {"name": "newcastle) ltd", "sentiment": "none"}, {"name": "aberdeen-based wood group", "sentiment": "none"}, {"name": "wood group industrial services", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "ridgeway garages", "sentiment": "none"}, {"name": "bellway homes", "sentiment": "none"}, {"name": "mike smith photography ltd", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "companies house", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "mears group", "sentiment": "none"}, {"name": "bellway", "sentiment": "none"}, {"name": "marshall motors", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Former PE teacher quits career to launch outdoor activity firm Discover Edventure \nA former PE teacher has turned his love for the outdoors into a new adventurous business. \nNeil Travis previously worked as head of the sports department at Castle View Enterprise Academy in Sunderland, but has now launched his own business, called Discover Edventure. \nThe 54-year-old entrepreneur founded the business to get North East schools, clubs, communities and businesses taking part in adventurous activities. \nMr Travis has already found success after securing Middlesbrough Football Club as a client. \nThe club’s under-18 squad travelled to the Lake District with Discover Edventure to take part in challenging team bonding activities that all had a football-related theme. \n“The coaches and staff from Middlesbrough Academy were impres­­sed by the skills it brought out in the players. When you take the players away from their normal environment, they can find new skills that they didn’t know they had, and then they can take it back to their usual environments,” said Mr Travis. “That’s one of the reasons I wanted to start this. \n“I’ve found that kids want to learn, they want to go outdoors and get away from their normal life. \n“It’s absolutely fantastic to see them shine in an unusual setting and it gives the best job satisfaction ever.” Former PE teacher Neil Travis has launched his own business called Discover Edventure 9.00 Coreena Ford Law firm Muckle uses artificial intelligence during multimillion-pound case \nNewcastle law firm Muckle LLP has become one of the first in the region to use artificial intelligence (AI) technology to help speed up the disclosure process on a multimillion-pound dispute claim. \nThe firm’s dispute resolution team is using predictive coding software, which is also known as technology-aided review (TAR), to analyse hundreds of thousands of disclosure documents to speed up the time it takes to review a case. \nMuckle has used the software on a case that involved one million disclosure documents. After carrying out a standard keyword search this was reduced to 660,000. \nThe firm then used AI to further reduce the number of documents by another 90% to 35,000. \nPartner and head of Muckle’s dispute resolution team, Susan Howe, said: “Using this type of technology is relatively new and is now being recognised by the court. \n“Firms in London are investing very heavily in artificial intelligence systems but, regionally, it’s not something that is widely used yet. \n“The dispute resolution team here at Muckle increasingly work on large claim cases where disclosure documents can be in the hundreds of thousands so having access to groundbreaking software such as TAR is game-changing.” Susan Howe, head of dispute resolution at Muckle (Image: Mike Smith Photography Ltd) 8.55 KEY EVENT Bellway chief executive Ted Ayres on temporary leave for ill health \nNewcastle housebuilder Bellway has announced that Ted Ayres, chief executive, is taking a leave of absence from the company in order to undergo treatment for a medical condition. \nIn a stock market announcement the firm said: “The Board and management team wish Ted a swift and full recovery and look forward to his return. \n“During this period of absence John Watson, who was formerly chief executive until his appointment as chairman in February 2013, will take up the position of executive chairman.” \nBellway also announce that Jason Honeyman will be appointed to the Board as chief operating officer on September 1. Ted Ayres, Bellway Homes' chief executive 8.50 Coreena Ford Business leader Gary Hutchinson eyes city Fat Buddha bar after launching new leisure firm \nA leading businessman who swapped Wearside for Wembley is returning to the North East to launch his own leisure venture. \nAs former Sunderland AFC commercial director, Gary Hutchinson brought some of the biggest bands in the music industry to the region including Take That and the Foo Fighters. \nHe left to become Head of Club Wembley working for the Football Association, overseeing all ticket sales at the country’s largest stadium, but is now set to return to the region after announcing plans to launch his own business. \nMr Hutchinson said: “It’s always been an ambition of mine to run a leisure group, and I’m in the process of finalising the purchase of my first venue. \n“I’m hoping to be in a position to share more details of plans over the coming weeks. It is the first of a number of planned acquisitions – we have big plans.” \nChrysalis Leisure Group has been officially incorporated by Mr Hutchinson in documents filed at Companies House, and more details on the group’s plans are set to unfurl soon. \nOne plan for the newly-formed firm could involve the successful Fat Buddha bar and restaurant in Newcastle, one of three Fat Buddha venues in the region. \nAt the end of last month, Fat Buddha (Newcastle) Ltd was incorporated at the Companies House, showing Mr Hutchinson as the sole director. Fat Buddha bar in Newcastle (Image: Newcastle Chronicle) 8.45 Coreena Ford EU nationals scrambling for city jobs \nThe number of City job seekers rose last month as EU nationals scrambled for employment in hopes of securing UK residency ahead of Brexit, but recruiters warn that the Square Mile is still “haemorrhaging talent” as a result of the referendum result. \nThe latest London employment monitor by recruiter Morgan McKinley recorded a 12% month-on-month rise in professionals seeking jobs in July, which compares to a 14% drop during the same period last year. \nHakan Enver, Morgan McKinley’s operations director for financial services, said it was likely a reaction to Government plans to end freedom of movement by the Brexit negotiation deadline in March 2019. \n“EU nationals who want to stay in Britain have a shrinking window of opportunity to get a job and permanent residency, and many are seizing it,” he said. The survey also noted a 1% month-on-month increase in vacancies, which it said was a “significant upturn” for July considering that summer months are usually marked by a double-digit slowdown in jobs activity. \nMr Enver said: “Normally the City clocks out for July, but with the industry being swept from under them, people are scrambling to make the most of the time left in the EU.” \nBut annual comparisons are less cheery, showing a 11% drop in vacancies and a 33% fall in job seekers, proving the City is “still haemorrhaging talent” due to Brexit, he added. \nIt follows a string of relocation announcements from financial services firms in recent months, with many revealing the site of their new EU headquarters. The London skyline Coreena Ford Used car sales help drive up profits at Marshall Motors \nCar dealer Marshall Motors has reported a surge in half year revenue and profit, driven by a sharp increase in used car sales. \nThe firm booked a 54% rise in pre-tax profit to £18.6m in the six months to June 30, while revenue jumped nearly 44%% to £1.19bn. Total used car unit sales grew 40%, or 5.8% on a like-for-like basis. \nBoss Daksh Gupta said the numbers represented a “period of record trading”, adding that the group is “well positioned to execute its growth strategy moving forward”. \nThe performance was boosted by acquisition of Ridgeway Garages, which Marshall Motors acquired last year. Mr Gupta said: “In the two years since listing, the group has successfully completed a number of retail acquisitions transforming its scale, geographic footprint and franchise portfolio as well as significantly growing its profitability.” \nHowever, the increase in used car sales comes amid a fall in comparable new vehicle sales. \nMarshall Motors said new car retail unit like-for-like sales fell 0.4%, reflecting figures from the Society of Motor Manufacturers and Traders (SMMT) that Brexit uncertainty is putting the brakes on the market. \nFigures from the trade body in August showed the car market has declined for a fourth consecutive month. \nMarshall Motors said: “The board is cognisant of the economic and political uncertainty following the UK referendum on EU membership and industry forecasts for continuing declines in the UK new car market. \n“The board therefore remains cautious.” 8.36 KEY EVENT Grenfell Tower disaster to impact Mears Group's profits \nThe Grenfell Tower tragedy will hit profits at social housing and support services provider Mears Group this year as clients delay new projects, the firm has said. \nThe firm said the fire in West London has meant clients’ attentions have “naturally been diverted towards ensuring their housing portfolios are safe and fully compliant”, rather than on beginning new work. \n“The recent tragic events at Grenfell Tower will impact the housing division later this year as clients review the commissioning and safety practices at their properties. \n“These unexpected events will inevitably impact the timing of our planned workloads as clients’ attentions have naturally been diverted towards ensuring their housing portfolios are safe and fully compliant,” the group said. \nAs a result, Mears said delays in planned works orders will see housing revenues of circa £800m in 2017 versus an original expectation of £830m, with a resulting “loss of profit and lower overhead recovery”. \nMears had no involvement in the Grenfell disaster, but does provide cladding for tower blocks. \nThe company said it expects the delays in procurement decisions to be temporary, adding the housing order book is not affected. The Grenfell Tower in west London (Image: PA) 8.35 What's the FTSE and pound latest? \nThe FTSE-100 index at 8:15am was up 12.93 at 7366.82. \nThe pound at 8am was 1.2959 dollars compared to 1.2975 dollars at the previous close. The euro at 8am was 0.9062 pounds compared to 0.9079 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.30 Coreena Ford North East SMEs prepare to land work at Heathrow Airport \nHeathrow airport is calling on North East firms to get behind a summit and play a significant role in its expanding supply chain. \nBusinesses across the North East are marking their diaries for Heathrow’s upcoming Business Summit, set for September 8 in Newcastle. \nThe free Business Summit North East is part of Heathrow’s commitment to create jobs in every corner of the UK, and companies who register will have a chance to meet face-to-face with Heathrow’s biggest suppliers and win contracts at one of the world’s largest airports, as it prepares the groundwork for its £16bn expansion project. \nThe event will be hosted in partnership with the North East England Chamber of Commerce (NEECC), and will consist of speed-dating style sessions of interviews with procurement managers representing firms based at the airport. \nForging meaningful in-person connections, North East SMEs will have the chance to win business at Heathrow and gain strong credentials, which they can leverage on other projects both in the UK and internationally. \nCommunities and businesses across the North East have been forecast to gain up to £4bn and see up to 5,100 new jobs created from an expanded Heathrow – and that starts with planning for the construction of a new runway and terminal facilities. Arlen Pettitt, Policy Adviser, North East England Chamber of Commerce (Image: handout) 8.25 KEY EVENT Amec offers to sell assets amid competition concerns over Wood Group takeover \nAmec Foster Wheeler has offered to sell off a number of assets as part of attempts to allay competition concerns over its proposed £2.2bn takeover by Wood Group. \nThe Competition and Markets Authority (CMA) warned earlier this month that the deal could face an in-depth probe if the companies fail to address antitrust issues. \nThe UK watchdog believes that the deal as it currently stands gives rise to competition concerns, particularly surrounding the supply of engineering and construction services, as well as operation and maintenance services in the North Sea. \nThe CMA said it is considering proposals put forward by the duo which would see Amec Foster Wheeler sell off “almost all” assets which contribute to these services in its upstream offshore oil and gas business in the UK. \nThe watchdog added that there are “reasonable grounds” for believing these undertakings, or a modified version of them, might be acceptable and it will open a public consultation on the proposal. \nKate Collyer, deputy chief economic adviser and decision-maker in the case, said: “It is crucial that competition is maintained in this major UK industry. We will consider the undertakings offered by Wood Group and Amec Foster Wheeler further, and carefully consult interested parties, in order to make sure that they fully address our concerns.” \nIf the CMA does not accept the undertakings proposed, the deal will be referred for an in-depth investigation. \nWhen announcing the deal in March, Aberdeen-based Wood Group, which owns Wood Group Industrial Services in Gateshead, said it will result in “significant cost and revenue synergies” of at least £110 million a year. \nWood Group employs 29,000 people, including around 1.600 people in the North East, while Amec has 35,000 workers and the new entity would be valued at around £5 billion. Amec Foster Wheeler chief executive, Samir Brikho Share ", "external_links": [], "published": "2017-08-15T10:25:00.000+03:00", "crawled": "2017-08-15T12:48:49.003+03:00", "highlightTitle": ""}