{"organizations": [], "uuid": "2c0cceac8fc83fdd0d36ca717558fe9fdccb92c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13550811.ece/ALTERNATES/s1200/Life-sciences-industrial-strategy-launch-event-Birmingham.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-well-placed-benefit-13550678", "country": "GB", "domain_rank": 21960, "title": "North East 'well placed' to benefit from multi-million pound life sciences boost", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-30T18:14:00.000+03:00", "replies_count": 0, "uuid": "2c0cceac8fc83fdd0d36ca717558fe9fdccb92c5"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-well-placed-benefit-13550678", "ord_in_thread": 0, "title": "North East 'well placed' to benefit from multi-million pound life sciences boost", "locations": [], "entities": {"persons": [{"name": "greg clark", "sentiment": "none"}, {"name": "john bell", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "hakim yadi", "sentiment": "none"}, {"name": "nisa", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}], "organizations": [{"name": "university of oxford", "sentiment": "negative"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "procter & gamble", "sentiment": "none"}, {"name": "northern health science alliance  alliance", "sentiment": "none"}, {"name": "european medical agency", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "northern health science alliance", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "chc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reguis Professor of Medicine at the University of Oxford (Image: PA) Share Get business   Thank you for subscribing!   \nThe North East is well placed to benefit from an ambitious plan to make the UK a world leader in the life sciences industry , it has been claimed. \nThe region has the largest life sciences sector in the UK, with global players like Procter & Gamble and GlaxoSmithKline having bases in the region, as well as a number of of emerging firms in the pharmaceutical indusry. \nThe sector is one of those highlighted for growth in the North East strategic economic plan, and today the Government has announced a multi-million pound package of support for life sciences after a report urged a more ambitious approach to the sector. \nBusiness Secretary Greg Clark unveiled a £146m investment in cutting-edge healthcare while Health Secretary Jeremy Hunt announced £14m of funding support for 11 medical technology research centres to bring new technologies to patients by encouraging collaboration between industry and the NHS. \nTheir funding announcements came after Professor Sir John Bell, who has led a cross-sector Government review of the long-term future of the £64bn industry, said the UK is “uniquely placed” to take advantage of sector growth because of the NHS. \nSetting out his findings, he said collaboration between industry and the NHS would allow the UK to capitalise on its strong science base, including academic research, to establish a global lead. Read More Co-op bids to buy Nisa convenience store chain - what does it mean for shoppers? \nSir John said the UK was “strong across all the components of the sector”, in business, and “miles ahead” in terms of numbers of leading academic hospitals and research universities. \nHighlighting areas for improvement, he said the country had “lost the plot” in manufacturing in life sciences, and had allowed some companies to move overseas. \nHe also said Britain needed to improve in how it grows small companies with “lots of great ideas” into profitable ones that can boost their value, commercialise and sell the innovative products they develop. \nSir John’s report has been welcomed by the Northern Health Science Alliance, an umbrella group for the sector in the North whose members include Newcastle and Durham universities, as well as a number of health trusts in the region. Dr Hakim Yadi, chief executive of the Northern Health Science Alliance \nAlliance chief executive Dr Hakim Yadi said the new strategy offered the chance of balancing previous approaches to life sciences, which had concentrated on the ‘golden triangle’ of Oxford, Cambridge and London and neglected businesses in the North. \nHe added: “Currently the sector suffers from a number of uncertainties, for example around Brexit and bodies like the European Medical Agency looking to leave the UK, and this strategy goes some way to put the UK on the front foot. \n“The creation of a handful of data driven innovation hubs is something the North is very well-placed to deliver on, and in fact is already delivering on with its Health North: Connected Health Cities (CHC) programme which ties together health, care and civic data across the North. \n“The focus and recognition of the importance of clusters and ‘place’ as drivers of delivery and growth is also encouraging. The North is acknowledged as a rapidly developing clinical and health research cluster and we hope that with this recognition in the strategy we can secure the continued growth of our already thriving health economy.” \nSpeaking earlier, Business Secretary Greg Clark had described the life sciences sector as “vital” to the UK economy, adding: “This is a place in the world where I think there is no better to advance to the next frontier given the opportunities in this country.” Like us on Facebook", "external_links": [], "published": "2017-08-30T18:14:00.000+03:00", "crawled": "2017-08-30T18:30:05.002+03:00", "highlightTitle": ""}