{"organizations": [], "uuid": "dcb65d7a8441155f3afb8f97b80384f6cf49dea2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/incoming/article271471.ece/ALTERNATES/s1200/Neil-ParishJPG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/jobs/everyone-wins-people-secure-jobs-400136", "country": "GB", "title": "Everyone wins if people have secure jobs - Neil Parish MP column", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-30T15:44:00.000+03:00", "replies_count": 0, "uuid": "dcb65d7a8441155f3afb8f97b80384f6cf49dea2"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/jobs/everyone-wins-people-secure-jobs-400136", "ord_in_thread": 0, "title": "Everyone wins if people have secure jobs - Neil Parish MP column", "locations": [], "entities": {"persons": [{"name": "bill clinton", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "west country", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "neil parish", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010 \nI am passionate about getting more people into work. A secure job is the best route out of poverty and helping people to get on and succeed in life. What’s more, more people in work means more people earning, spending money and boosting the economy. Everyone wins. \nIn the UK, we have a good story to tell on unemployment. Since 2010, the unemployment rate has near halved, from 8% to 4.4%. It’s now at a 42 year low. Across many areas of the EU, dole queues have remained long and, tragically, many young people have been left without work. Unemployment in Eurozone countries is still 9.1%. Thankfully, we’ve been able to create more jobs and cut unemployment here. \nWe’ve been particularly successful in the South West. Earlier this year, the employment rate in the South West became the highest in the UK. We now vie with the South East for this title of the most people in our area in work. Unemployment is at negligible levels. This means more jobs, money and security for people in our area. \nLooking for a job? \nLargely, this is to do with the strong entrepreneurial spirit in the West Country. Local people have a real sense of get up and go. The desire to find work or start their own business. It’s a real local success story and we should be proud of it. Neil Parish elected in 2010 Read More We need to make a 'Green Brexit' work - Neil Parish MP column \nMuch has been done, but there is much still to do. For starters, I want to see unemployment driven down even further. Even now, some young people can’t find a job and every person out of work is a talent wasted. Better apprenticeships and vocational training is needed to help more young people enter the workplace. \nWe also need a focus on higher pay. For too long, pay has lagged behind inflation. That’s why I strongly welcome the new National Living Wage, set to hit £9 per hour by 2020, which will help to boost the incomes of the poorest in society. But long-term, we need better productivity to boost incomes. Read More Homebuilders must be held to account and an independent New Homes Ombudsman should be formed - Neil Parish MP column \nThis means investing in our road, rail and broadband infrastructure – especially in the South West – to help employees and businesses reach their full potential. It’s no secret. If your area is plagued with traffic jams or your broadband keeps crashing, your productivity is going to suffer. But with extra investment in good quality transport and communications, we can help business grow, take on more staff and pay higher wages. \nBill Clinton’s successful message in the 1992 election campaign was “It’s the economy stupid”. During this Parliament, it is vital the Government does not lose sight of what a strong economy is – and what it can do for people up and down the country. More people in work is the first step towards ensuring everyone reaches their full potential and I will never let Minister forget that simple fact. Like us on Facebook ", "external_links": [], "published": "2017-08-30T15:44:00.000+03:00", "crawled": "2017-08-30T16:13:24.006+03:00", "highlightTitle": ""}