{"organizations": [], "uuid": "349b0486a50e8d31de560cbbc4cf6e6f978d98ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30468363/16098362.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/trip-to-tiverton-adds-years-to-lives-of-belarus-youngsters-thanks-to-chernobyl-children-s-lifeline/story-30468363-detail/story.html", "country": "US", "title": "Trip to Tiverton adds years to lives of Belarus youngsters thanks to Chernobyl Children's Lifeline | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.15, "site_type": "news", "published": "2017-08-03T18:14:00.000+03:00", "replies_count": 0, "uuid": "349b0486a50e8d31de560cbbc4cf6e6f978d98ab"}, "author": "", "url": "http://www.devonlive.com/trip-to-tiverton-adds-years-to-lives-of-belarus-youngsters-thanks-to-chernobyl-children-s-lifeline/story-30468363-detail/story.html", "ord_in_thread": 0, "title": "Trip to Tiverton adds years to lives of Belarus youngsters thanks to Chernobyl Children's Lifeline | Devon Live", "locations": [], "entities": {"persons": [{"name": "ian adlington", "sentiment": "none"}, {"name": "bourne", "sentiment": "none"}, {"name": "adlington", "sentiment": "none"}, {"name": "karen adcock", "sentiment": "none"}, {"name": "kentisbeare", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "belarus", "sentiment": "none"}, {"name": "pecorama", "sentiment": "none"}, {"name": "chernobyl", "sentiment": "none"}, {"name": "sampford peverell village hall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "seaton tramway", "sentiment": "none"}, {"name": "tropiquaria", "sentiment": "none"}, {"name": "sampford peverell", "sentiment": "none"}, {"name": "cullompton", "sentiment": "none"}], "organizations": [{"name": "chernobyl children's lifeline b", "sentiment": "none"}, {"name": "chernobyl children's lifeline | devon live trip", "sentiment": "none"}, {"name": "southwest", "sentiment": "none"}, {"name": "chernobyl children's lifeline", "sentiment": "none"}, {"name": "tiverton trip", "sentiment": "none"}, {"name": "cullompton dental", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trip to Tiverton adds years to lives of Belarus youngsters thanks to Chernobyl Children's Lifeline By Lewis_Clarke | Posted: August 03, 2017 0 COMMENTS SHARES Children from Belarus enjoyed the fresh air of Tiverton Trip to Tiverton adds years to lives of Belarus youngsters thanks to Chernobyl... X \nCopy link to paste in your message / Comments (0) \nYoungsters from across Belarus enjoyed the fresh air of Tiverton and the Southwest last month. \nChildren arrived on June 16 and went home after four weeks on July 14. They come from different towns and villages and are chosen by the local education authority. \nIan Adlington from the Chernobyl Children's Lifeline said: \"The children stayed with a wonderful set of host families who did an amazing job of caring for and entertaining them. There were two new host families this year, and all the host families find this an enjoyable experience. \n\"They have the children for either two or four weeks. A big thank you to all the host families.\" \nIn the first week, the children visited the dentist and the opticians, three needed glasses and four needed fillings. \nMr Adlington said: \"a precious service provided free to the children and our interpreter Vera. Special thanks to Cullompton dentists: The Bays, Cullompton Dental, Mr Bourne, and thanks to Specsavers in Tiverton. Also thanks to Independent Coffee Traders coffee shop who provided drinks and cake during their visit to the optician.\" \nRead more We need to make a 'Green Brexit' work - Neil Parish MP column \nSome activities including camping, swimming, craft days were also enjoyed wih a showing of Mr Bean in Russian at Sampford Peverell Village Hall. They also had visits to schools in Sampford Peverell and Kentisbeare as well as theme parks with free entry provided and often special treatment as well. \nMr Adlington added: \"Their faces were frequently filled with enjoyment, excitement and amazement but not all at the same time! Thanks to Pecorama, Chasers, Seaton Tramway, Tropiquaria, and Milky Way. \n\"Clothes were donated during the year, and they chose clothes for themselves and their family members. They came with very little luggage, some only a carrier bag but they all went back with luggage well over the weight allowance – the airlines turned a blind eye. \n\"It was amazing to look at photos of when they first arrived compared to when they left. They looked so much healthier, and their faces had filled out as a result of good food and fresh air. \"We take for granted the good food and variety that we have every day. One of the children wouldn't eat fruit or vegetables when he arrived - his regular diet was potatoes, pasta and rice - but by the time he left he was eating anything and everything! \n\"This was the holiday of a lifetime for them but July 14 came round too quickly, and there were some emotional farewells. Their parents sent back a message to say they were very grateful for all that was done for the children.\" \nThe Chernobyl Children's Lifeline is a charity providing respite breaks for disadvantaged children from Belarus who continue to live with the dreadful consequences of the Chernobyl nuclear meltdown in April 1986. While they are here the children escape from the nuclear contamination which affects the air they breathe, the food they eat and the land on which they live. Doctors in Belarus have reported that four weeks respite in the UK can extend their lives by up to two years. \nIf you want to know more, want to help or to give financially, please contact Karen Adcock on 01884 822905 and leave a message.", "external_links": [], "published": "2017-08-03T18:14:00.000+03:00", "crawled": "2017-08-03T19:10:43.018+03:00", "highlightTitle": ""}