{"organizations": [], "uuid": "3e03e36e4f00b7448663b238ac68c122c66747b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13493621.ece/ALTERNATES/s1200/Cabinet-meeting.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-deal-imminent-13493559", "country": "GB", "domain_rank": 21960, "title": "North of Tyne devolution deal is 'imminent' - Government reveals", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-20T10:00:00.000+03:00", "replies_count": 0, "uuid": "3e03e36e4f00b7448663b238ac68c122c66747b1"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-deal-imminent-13493559", "ord_in_thread": 0, "title": "North of Tyne devolution deal is 'imminent' - Government reveals", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "george osborne", "sentiment": "none"}, {"name": "north of the tyne  mr smith", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "mr berry", "sentiment": "none"}, {"name": "andrew percy", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "james wharton", "sentiment": "none"}, {"name": "jake berry", "sentiment": "none"}], "locations": [{"name": "northumbria", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "local government", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle university's national centre for subsea and offshore engineering", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA North of Tyne devolution deal could be imminent, according to the government. \nThe news comes after recent criticism of its attitude towards the so-called Northern Powerhouse after Transport Secretary, Chris Grayling, pulled the plug on plans to electrify the line between Manchester and Leeds seen as crucial to it whilst announcing he would support a £30bn “Crossrail 2” project in London. \nWhen we contacted the Department for Communities and Local Government , a spokesperson said: “Across Government we are making huge strides towards rebalancing the economy and empowering local government, ensuring all parts of the UK succeed. \n“This Government remains absolutely committed to the Northern Powerhouse and our aims to boost economic growth right across the North. Discussions are at an advanced stage with North of Tyne and the Government is keen to conclude a deal with this area in the near future.” \nThe deal has the potential to bring extra money and powers from Whitehall to the North East and will see the election of a mayor - similar to that in Manchester and Liverpool. \nLast year the whole project looked dead in the water in the water after disagreements over funding and the uncertainty caused by the Brexit vote led to the deal being voted down by local authorities in Gateshead, Sunderland, Durham and South Tyneside. Read More North of Tyne mayor could be elected in 2018 to serve Newcastle, Northumbria and North Tyneside \nHowever, Newcastle, Northumberland and North Tyneside decided to plough ahead. \nIn its most recent joint statement, a spokesperson for the North of Tyne authorities said: “Newcastle, North Tyneside and Northumberland are in ongoing positive discussions with Government about the devolution of powers and funding to the North East. \n“These discussions are focused on achieving accelerated business growth and economic development with more and better jobs for the North East; improving people’s skills and opportunities; and enhancing the vibrant places and strong communities in the region.” \nTalks are now at an advanced stage to the extent some have said it’s a case of dotting the i’s and crossing the t’s before the deal is revealed. Northern Powerhouse Minister, Jake Berry MP (left) at Newcastle University's National Centre for Subsea and Offshore Engineering in Wallsend, North Tyneside (Image: Newcastle Chronicle) \nHowever, the situation has been complicated as there have been three Northern Powerhouse ministers in the space of a year. In July 2016 Andrew Percy replaced James Wharton who was in turn replaced in June this year by Jake Berry. \nAnd George Osborne , the former Chancellor who came up with the Northern Powerhouse concept is no longer in Parliament. \nBut there is a desire to get the process going in the North East as neighbouring Teesside which now has devolved powers appears to be putting them to good use. \nIn the Conservative Manifesto at the last general election it said: “There remains...a far greater gap between the capital and other cities in the UK than in any other major developed country. We see the opportunity to close this gap as the biggest prize in Britain today.” Ross Smith, the North East Chamber of Commerce director of policy \nRoss Smith, director of policy for the North East England Chamber of Commerce, said it sees the Northern Powerhouse as potentially the most critical element in achieving this “prize”. \nHe said: “It would prove they are serious about closing the gap between London and the rest of the country.” Read More North East devolution deal is back on the cards - but only North of the Tyne \nMr Smith said the Chamber met with Mr Berry when he was first appointed Northern Powerhouse minister and they since been an exchange of letters. \nHe said: “It was very constructive, saying all the right things, so that was very positive. But the time for saying all the right things is passing, the time for doing all the right things is here. \n“He’s not a new minister now. He needs to get to grips with his portfolio. We hope to see him delivering on things he was talking about as quickly as possible.” \nMr Smith also said that while the government needed to get a North of Tyne devolution deal over the line as soon as possible - within months rather than years - the door must not be shut on those local authorities south of the Tyne not involved in the talks, offering them the opportunity to join at a later date if there is a change of heart. \nHe said the devolution deal was “not the be all and end all but it’s a start”. \nMr Smith added: “We’re not going to get everything we want but its important to get it up and running.” Like us on Facebook", "external_links": [], "published": "2017-08-20T10:00:00.000+03:00", "crawled": "2017-08-20T10:23:37.002+03:00", "highlightTitle": ""}