{"organizations": [], "uuid": "db1a20c3f28e41060f06d361c9730eed3448f58c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30475641/16102764.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/three-storey-flats-as-part-of-85-homes-plan-for-prince-charles-ideal-english-village-approved/story-30475641-detail/story.html", "country": "GB", "title": "DanielClark published Three-storey flats as part of 85 homes plan for Prince Charles'...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-09T15:10:00.000+03:00", "replies_count": 0, "uuid": "db1a20c3f28e41060f06d361c9730eed3448f58c"}, "author": "DanielClark", "url": "http://www.devonlive.com/three-storey-flats-as-part-of-85-homes-plan-for-prince-charles-ideal-english-village-approved/story-30475641-detail/story.html", "ord_in_thread": 0, "title": "DanielClark published Three-storey flats as part of 85 homes plan for Prince Charles'...", "locations": [], "entities": {"persons": [{"name": "charles", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "da", "sentiment": "none"}, {"name": "gittisham", "sentiment": "none"}, {"name": "cllr bond", "sentiment": "none"}, {"name": "prince charles", "sentiment": "none"}, {"name": "cllr susie bond", "sentiment": "none"}], "locations": [{"name": "gittisham", "sentiment": "none"}, {"name": "gittisham parish", "sentiment": "none"}, {"name": "feniton", "sentiment": "none"}, {"name": "honiton", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "baker estates", "sentiment": "none"}, {"name": "gittisham parish council", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Three-storey flats as part of 85 homes plan for Prince Charles' ideal English village approved By DanielClark | Posted: August 09, 2017 0 COMMENTS SHARES Gittisham and Prince Charles (inset) Three-storey flats as part of 85 homes plan for Prince Charles' ideal English... X \nCopy link to paste in your message / Comments (0) \nPlans for the first step towards a major new housing development on the edge what Prince Charles has called the \"ideal English village\" have been approved – and it includes a three storey block of flats. \nBaker Estates's plans for the first 85 homes of what they call a high quality new development for the green space between Honiton and Gittisham were approved by East Devon planners on Monday. \nThe site, located in Gittisham Parish to the west of Honiton town centre, already has outline planning permission for 300 homes, which was granted by East Devon planners in 2016. \nCouncillors approved the application, despite concerns expressed by Gittisham Parish Council who said that they objected strongly to the intensive urbanisation and the use of 3 storey developments which are totally alien and out of character with the countryside location. \nRead more 'Out of character urbanisation' homes plan for East Devon village backed for approval \nPrince Charles has previously claimed that Gittisham is his 'ideal English village' \nCllr Susie Bond, who represents the Feniton and Buckerell ward in which the application site is, said that she eventually voted in favour of the application, but only after expressing her concerns and agreeing that the committee would not be able to defend refusal of the application at any appeal. \nCllr Bond, who is an Independent concillor, said: \"A three storey block of flats does feel inappropriate for the site. It just doesn't feel right in an outstanding area of natural beauty. \n\"The plans were approved because of the sustainability for employment on the site as it is close to the Heathfield industrial estate, but three storey block of flats between two outstanding areas of natural beauty is not really appropriate \n\"The block of flats, which will contain social housing, will be right next to a working dairy farm, which by its very definition will create a lot of noise first thing in the morning, which is something that I raised concerns about.\" \nRead more Rural leaders hit back over 'inappropriate' tax proposals for new farm buildings \nShe added that as the development site has three phases, and that there are more concerns about additional three storey block of flats in the second and third phases of the developments would due to the topography of the land would have more of a impact on the area. \nShe said: \"The argument is that from the valley looking down is that the flats don't look that big, but they still look and feel inappropriate for the site.\" \nBut she added that the developers have worked hard with the local community on the plans and she understand that it is difficult for them to find 40 per cent of affordable housing in the site. \nThe outline application for the site was initially approved prior to the finalisation of the Local Plan for East Devon and discussions between the developers and the council around a design code for the site have been undertaken. \nThe application was approved by the committee, although three councillors voted against approving the application. \nRead more We need to make a 'Green Brexit' work - Neil Parish MP column \nA spokesman for Baker Estates had said: \"The homes have been sensitively designed to complement the existing surroundings, and public spaces will be landscaped to create an attractive living environment, alongside an equipped play area and allotments. \n\"Baker Estates has engaged positively with the local community to understand their aspirations for the site, and the submitted proposals follow extensive public consultation.\" \nThe construction period for the first phase is estimated to take 12 months, with a sales launch planned before the end of the year.", "external_links": [], "published": "2017-08-09T15:10:00.000+03:00", "crawled": "2017-08-09T16:08:21.000+03:00", "highlightTitle": ""}