{"organizations": [], "uuid": "c5b3d6c84e7ffa3e319f0939f8f37cbd5ccf29cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i3.leicestermercury.co.uk/incoming/article293919.ece/ALTERNATES/s1200/GettyImages-529658956.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/can-you-legally-park-your-293896", "country": "US", "domain_rank": 48128, "title": "Can you legally park your caravan on your own driveway? - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2017-08-08T11:14:00.000+03:00", "replies_count": 0, "uuid": "c5b3d6c84e7ffa3e319f0939f8f37cbd5ccf29cd"}, "author": "James Rodger", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/can-you-legally-park-your-293896", "ord_in_thread": 0, "title": "Can you legally park your caravan on your own driveway? - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Can you legally park your caravan on your own driveway? It's nowhere near as straightforward as you might think Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nIt's summer, it's raining, and as a result thousands of Brits are enjoying - or enduring - a holiday in a caravan. \nSites up and down the country and on the continent will be packed out with holiday makers looking for a break. \nBut what about when you get home? If you stick your caravan on your driveway are you breaking the law? Read More Research from Leicester academic says Brexit vote could have flipped if more people went to university \nPerhaps unsurprisingly, there is no law set in stone with regards to the parking of a caravan on driveways - meaning the rules can be interpreted a variety of different ways. \nIt largely depends on the deeds of the property, but a variety of other factors - your relationship with your neighbours, the size of your driveway - could complicate things further. Looks great in a field - but what about on your driveway? \nAt the basic level, your property will have a clause in the deeds stating that you can or cannot keep a caravan on the property. \nBut, in the latter case, they will probably also state that you can not keep any commercial vehicles or vans on the property as well. Read More \nIn practice, covenants prohibiting the parking of caravans have been applied to most 'estate type' properties built since the 1970s. \nNow, things get more complicated when you take into account neighbours' driveways, properties and land. Read More ", "external_links": [], "published": "2017-08-08T11:14:00.000+03:00", "crawled": "2017-08-08T12:12:11.007+03:00", "highlightTitle": ""}