{"organizations": [], "uuid": "a37dea916be42f8c4276466d94ffdc19d326371b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/incoming/article373433.ece/ALTERNATES/s1200/Shirt-Draw-Winner-2.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/business-scores-leicester-road-fc-373420", "country": "GB", "domain_rank": 48128, "title": "Business scores Leicester Road FC sponsorship deal - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.178, "site_type": "news", "published": "2017-08-24T13:28:00.000+03:00", "replies_count": 0, "uuid": "a37dea916be42f8c4276466d94ffdc19d326371b"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/business-scores-leicester-road-fc-373420", "ord_in_thread": 0, "title": "Business scores Leicester Road FC sponsorship deal - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "hinckley", "sentiment": "none"}, {"name": "paul moss", "sentiment": "none"}, {"name": "andy", "sentiment": "none"}, {"name": "andy armstrong", "sentiment": "none"}, {"name": "barwell", "sentiment": "none"}, {"name": "barwell juniors", "sentiment": "none"}], "locations": [{"name": "leicester road", "sentiment": "none"}, {"name": "barwell", "sentiment": "none"}, {"name": "king power stadium of leicester city", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "leicester mercury business", "sentiment": "negative"}, {"name": "armstrong electrical installations", "sentiment": "negative"}, {"name": "leicester road fc", "sentiment": "negative"}, {"name": "nuneaton borough", "sentiment": "none"}, {"name": "armstrong electricals", "sentiment": "none"}, {"name": "hinckley united", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "midland football league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business scores Leicester Road FC sponsorship deal Armstrong Electrical Installations, in Barwell, won a lucky dip to become Hinckley club kit sponsor Share All smiles for Andy Armstrong who won a lucky dip to become kit sponsor for Leicester Road FC Share Comments \nA businessman is celebrating after winning the rights to have his company name and logo printed on his local football team’s kit. \nArmstrong Electrical Installations, in Mill Street, Barwell, won a lucky dip to become kit sponsor for Leicester Road FC, in Hinckley. \nThe club, playing in the Midland Football League this season, held a lottery to pick the sponsor for the year. \nThe club invited businesses to pay £395 plus VAT to have a chance of getting their name on the first team shirts from this autumn. \nThe winner was also offered a pair of season tickets and a pitch side advertising board. \nIn the end more than 35 companies had a go. \nArmstrong Electricals has served the Hinckley area for almost 30 years, specialising in industrial, commercial and domestic electrical, and more recently CCTV and LED lighting. Ex-player Andy Armstrong is delighted to be Leicester Road FC kit sponsor this season \nProprietor Andy Armstrong said being this year’s main shirt sponsor would be a big boost to raising awareness of his business. \nHe said: “I’ve not won many things in my time, so it was a big surprise to be drawn out of the hat. \n“Having won the county cup last year, Leicester Road FC is a club on the rise and their youth development looks very strong too. \n“I’m proud to be part of it and it bodes well for the future. I can already recommend other businesses follow suit and get involved. \n“I have always loved the game and played for both Hinckley United and Nuneaton Borough in my youth, continuing to play lower level local football and progressing into coaching with Barwell Juniors, as both of my boys have always played too. Read More Jet2.com announces 160 new jobs at East Midlands Airport - here's how to apply \n“I played on the Leicester Road pitch recently in a veteran’s game to raise money for the schoolboy and youth development set up and it’s looking in great shape. \n“The ground is very impressive too and is the second biggest in the county to the King Power Stadium of Leicester City FC.” Read More Comment: Bank of England expert confirms \"Firms are investing less because of uncertainty over Brexit\" \nOther businesses that entered were guaranteed two season tickets plus either a pitch side board for the season or a full page advert in the programme for every home match. \nClub commercial director Paul Moss said: “To pay for the shirt sponsorship outright would cost in the region of £15-20,000, so we do it this way to make it much more rewarding for lots more businesses. \n“We’re delighted to have Andy (a football man as well) and the team at Armstrong Electrical Installations on board and we look forward to building a long standing relationship with them that will benefit both companies.” Like us on Facebook ", "external_links": [], "published": "2017-08-24T13:28:00.000+03:00", "crawled": "2017-08-24T20:54:26.009+03:00", "highlightTitle": ""}