{"organizations": [], "uuid": "022c9ddf8e788818bc1aeafcbbf5b0e3ca1b0966", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12772504.ece/ALTERNATES/s1200/KOR_NJL_170317stan_06.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13443677", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Bellway CEO praises firm for smashing house completion record", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-08T10:30:00.000+03:00", "replies_count": 0, "uuid": "022c9ddf8e788818bc1aeafcbbf5b0e3ca1b0966"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13443677", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Bellway CEO praises firm for smashing house completion record", "locations": [], "entities": {"persons": [{"name": "jonathon manning jury", "sentiment": "negative"}, {"name": "paula dumont lopez", "sentiment": "none"}, {"name": "anders kristiansen", "sentiment": "none"}, {"name": "neil sinclair", "sentiment": "none"}, {"name": "kristiansen", "sentiment": "none"}, {"name": "jonathon manning new look", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "new look", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}], "organizations": [{"name": "bellway", "sentiment": "negative"}, {"name": "st james gate", "sentiment": "none"}, {"name": "mcaleer & rushe group", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "national lottery charities board", "sentiment": "none"}, {"name": "marsh barton", "sentiment": "none"}, {"name": "sm newcastle ob ltd", "sentiment": "none"}, {"name": "serco", "sentiment": "none"}, {"name": "palace capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Quantum Pharma 'fundamentally successful' in simplifying strategy, says chief executive \nQuantum Pharma’s new business model has been hailed as a “fundamental success” by chief executive Chris Rigg , three months after he closed the company’s struggling NuPharm division. \nThe Burnopfield-based firm closed NuPharm in May after originally purchasing the business in 2015. \nEfforts to make the business profitable had consistently failed, forcing Mr Rigg to close the division, writing off £13.7m on the company’s balance sheet as a consequence. \nShortly after, Quantum sold its medication adherence arm, Biodose Services, in a further step to simplify the business. \nMr Rigg said that Quantum’s effort to focus its business is now paying off. \nSpeaking to The Journal Mr Rigg said: \nThe position that the business brought to float was the ability to convert unlicensed medicines to licensed. It then acquired NuPharm. \nIt was the business I closed, and it was a business that was failing. It was acquired for the right strategic intent but it was failing. \nPart of what I have done is to focus and simplify the business. \nWhen you license a product we bring it to market at a lower price than the unlicensed medicine. We can do that as we get a higher market share and manufacture it in bulk. \nThe aim is to drive into the future the benefits of the license programme to lower prices in the NHS. \nOne of the key areas for growth for the firm is Colonis and its licensing division. Once a drug successfully attains a UK license the business involves becomes the only one able to distribute the medication to pharmacies. This gives its a major market advantage. Quantum Pharma CEO Chris Rigg (Image: Unknown) 9:18 Jonathon Manning Standard Life profits rise despite huge investment cash withdrawal in first half \nInsurance giant Standard Life has revealed investors pulled out £3.7bn from its funds in the first half as it nears completion of its £11bn merger with Aberdeen Asset Management. \nThe group suffered after its flagship Global Absolute Returns Strategies Fund took a big hit, with net outflows of £5.6bn. But despite this, Standard Life notched up a 6% rise in overall pre-tax operating profits to £362m for the six months to June 30. \nChief executive Keith Skeoch said the group was ready for the “next chapter of our transformation to a diversified world-class investment company” as it prepares to seal its tie-up with Aberdeen Asset Management on August 14. \nHe added: \nThe combined leadership team of Standard Life and Aberdeen has been working well together to ensure ‘Day 1’ readiness. \nBut analysts said the results highlight the tough market for active fund managers, as investors are shunning the hefty fees of star managers in favour of more passive investing. \nShares fell more than 1% after the results. Standard Life saw investor withdrawals of £24.4bn outweigh inflows of £20.7bn in the half-year. \nNeil Wilson, senior market analyst at ETX Capital, said: \nStandard Life’s struggle to stem flows reflects a problem facing the whole active sector. \nIts betrothed, Aberdeen Asset Management, has been suffering net outflows for years. \nEamonn Flanagan, analyst at Shore Capital, said the deal to merge with Aberdeen “still feels like a defensive move by both companies, in an attempt to drive out costs and compete with the world of passives”. \nThe Aberdeen merger was given the green light by regulators in June, while shareholders also overwhelmingly backed the deal. The enlarged company, to be called Standard Life Aberdeen, will be headed up by Mr Skeoch and Aberdeen boss Martin Gilbert. \nThe merger will create Europe’s second-biggest fund manager, with £670bn under management. The deal, announced in March, is targeting cost savings of £200m a year, with around 800 jobs expected to be lost over a three-year period from a global workforce of 9,000. Standard Life chairman Gerry Grimstone. The firm's merger Aberdeen Asset Management has been approved. 9:13 Jonathon Manning New jobs to come at North East tech fim Saggezza after raft of contract wins \nA North East technology business is on a recruitment drive following rapid growth in its client base. \nSaggezza, which works with businesses to explore how they can get more value from their data, has seen its team quickly grow in recent months and is in the process of taking it headcount to 40. \nThe Chicago headquartered business moved to Sunderland three years ago, picking Sunderland as its only UK base out of London to take advantage of investment in the city’s software and technology facilities. \nAt the end of last year the business had 20 people in Sunderland, but following significant growth since opening up an office in Sunderland Software Centre it has moved into a larger office that is big enough for 50 members of staff. \nThe success follows news that one of the company’s divisions has been sold to US software giant Cisco. \nThe San Jose technology brand acquired Saggezza’s Advanced Analytics software and team for an undisclosed sum, in a move that will allow Cisco to realise its strategic goals to develop innovative big data analytics, and cloud technologies, while also cultivating top talent. \nLucy Harber, HR and operations manager at Saggezza, said: \nAcross the business, 2017 has been a fantastic year, and the expansion in Sunderland follows the phenomenal news of the sale of a division of the business to Cisco, testament to the level of skill and proficiency that exists in the Saggezza team. \nWe are delighted to be able to strengthen the Sunderland team, and to make a further commitment to the North East, having moved the majority of our UK operations here from London over the last few years. We know that we are capable of growing further, and we look forward to bringing in more new talent that is capable of driving ongoing expansion. Martin Williams, MD of Saggezza, with Coun Paul Watson, leader of Sunderland City Council (Image: Gilbert Johnston) 9:08 Jonathon Manning North East business insolvency risk on the rise in first half of 2017 \nThe proportion of North East businesses with a heightened risk of becoming insolvent in the next 12 months rose by 2.5 percentage points during the first half of 2017. \nInsolvency and restructuring trade body R3 has found that 27.3% of regional firms were in this position at the start of July, compared to 24.8% at the beginning of the year. \nThe figures vary across different market sectors, with transport and haulage firms having an almost five percentage point lower risk of being in this position today than they had back in January (32.8% then vs 27.9% now). \nHowever, insolvency risk-facing businesses in the agriculture sector are almost three percentage points higher than it was six months ago (21.8% then vs 24.5% now). \nDuring the first six months of the year, the insolvency risk has risen in six of the 11 regional industries that R3 monitors on a monthly basis, with the manufacturing, technology and hotel sectors all seeing rises of between one and two percentage points. \nThe important retail and construction sectors both recorded relatively small rises of 0.3 and 0.5 percentage points respectively in their proportion of firms at higher than average risk of insolvency, while the professional services sector remained unchanged over the period in question. \nThe North East’s pub and restaurant industries both enjoyed a solid first half of the year, with falls of 2.1 and 1.8 percentage points in their respective insolvency risk, while regional tourism operators saw a one percentage point improvement in their sector. \nAndy Haslam, North East vice chair of R3 and a partner with Tait Walker, said: \nThe last six months have seen a whole host of issues, including rising inflation, the weakness of sterling against other currencies and the uncertainties surround the continuing Brexit process, having an impact on regional businesses’ capacity to both make progress now and plan effectively for the future. \nIt’s therefore perhaps not surprising that we’ve seen a rise in the overall proportion of North East firms facing a heightened risk of insolvency over the first half of the year, and with many of these factors still in play, we may well see it continue to rise through the rest of the year. Andy Haslam vice chair of R3 North East (Image: Publicity Pic) 9:03 Jonathon Manning Paddy Power Betfair sees sales rise despite 'adverse sports results' \nPaddy Power Betfair has reported rising sales and earnings in the first half, but admitted it had been knocked by the lack of a major football tournament and punter-friendly sports results. \nThe bookmaker, which disclosed on Monday that chief executive Breon Corcoran is to step down after 16 years, reported revenue growth of 9% to £827m. \nEarnings in the six months to June 30 rose 21% to £220 million, but the firm said that, despite strong first-quarter growth helped by favourable Cheltenham results, the following three months were “affected by the absence of a major football tournament and adverse sports results”. \nLast year bookmakers were boosted by the European Championships, and in particular by England’s embarrassing exit at the hands of minnows Iceland. \nMr Corcoran, who is to be replaced by Worldpay chief executive Peter Jackson, said: \nWe continue to make substantial investments to position Paddy Power Betfair as a structural winner in a dynamic and highly competitive market. \nThe focus of this investment is to use technology to improve efficiency and minimise the cost of servicing our customers and to further enhance our customer proposition. \nPaddy Power Betfair confirmed that trading is in line with expectations and is guiding for full-year 2017 underlying earnings of between £445m and £465m. Paddy Power Betfair logo KEY EVENT Hargreaves has made 'excellent progress' after hitting profit target, says chairman \nDurham’s Hargreaves Property Services has made “excellent progress” after hitting its profit target, according to its chairman. \nHargreaves made £4.1m profit before tax for the year ending May 31 2017. During the previous year the company made a loss before of tax of £10.6m. \nCommenting on the results, Hargreaves Chairman David Morgan said: \nThese results demonstrate the excellent progress made by the Group over the last year. The achievement of our Group profit target was a positive step forward, which we believe marks a real turning point for the Group. \nThe independent property valuation exercise provides further confidence about the longer term value that we aim to create from our property portfolio. \nWhilst challenges remain to be overcome in some of our businesses, we are on track to achieve or over-acheive the three key strategic goals we set ourselves in 2016. We will continue to be careful in managing capital allocation and risk as we move forward. \nThe firm;s turnover increased marginally from £340.7m to £342.9m. \nAt close of trading yesterday Hargreaves shares we valued at 350p. Following this morning’s trading announcement shares in the firm soared to 385p before dipping slightly to 380p at the time of writing. 8:52 Jonathon Manning Jury's Inn hotel in Newcastle is sold as part of £20m flats and offices deal \nA London investment firm has snapped up a Newcastle hotel and adjoining apartments and offices in a £20m deal. \nPalace Capital has acquired the entire share capital of SM Newcastle OB Ltd, which owns Newcastle’s Jury’s Inn Hotel as well as the freeholds of 1,2 and 3 St James Gate, home to 145 apartments and more than 140,000sqft of office space. \nThe property firm focuses on commercial property outside of London and said the deal continues its strategy to acquire top quality buildings in key cities. \nThe acquisition represents one of the biggest deals involving North East property in recent months, affirming growing confidence in the region’s property, and it has been funded by a new loan of £11.5m from Santander, with the balance being funded from the company’s own cash resources. \nOriginally developed by The McAleer & Rushe Group, the deal includes the 274-bed Jury’s Inn hotel and 1 St James Gate which has 61,000 sq ft of office, and the residential element of 3 St James Gate, which has 145 apartments and has previously been sold on 999 year leases. \nThe adjoining 2 St James Gate is a fully multi-let office building of 82,500sqft, which was first built in 2006 and brings in net income of £1.605m per annum. \nTenants include the National Lottery Charities Board, Serco and UBS. \nNeil Sinclair, the chief executive of Palace Capital, said: \nWe are delighted with this corporate purchase, which continues our strategy of acquiring high quality buildings close to transport links in major cities. \nWe have bought the properties on an attractive initial yield resulting in over £600,000 per annum in excess of the income foregone on our recent disposals and the recent administration of our tenant at Marsh Barton, Exeter. \nThis acquisition increases the value of our portfolio to over £200m. This transaction demonstrates our skills at recycling our capital – we have used the proceeds of our recent sales on unencumbered properties to fund approaching 50% of the consideration. St James Gate, Newcastle, which includes Jury's Inn, apartments and office space, has been snapped up by London investors Palace Capital (Image: Palace Capital) 8:47 Jonathon Manning New Look acknowledges 'disappoointing quarter' in 'difficult' market \nHigh street chain New Look has revealed tumbling sales and earnings in a “difficult” market and warned trading would remain under pressure into 2018. \nThe fashion retailer posted a 60.3% plunge in underlying operating profits to £12.1m for its first quarter to June 24 after UK like-for-like sales slumped 7.5%. \nOn a bottom line basis, the group fell into the red with losses after tax of £15.2m against profits of £5.8m a year earlier. It blamed tough conditions on the high street, but its ranges have also missed the mark in recent months. \nChief executive Anders Kristiansen said: \nAs expected, the UK market has remained difficult, which has resulted in a disappointing quarter of trading. \nHe added: \nWe expect the consumer economy to remain fragile and challenging market conditions to persist into 2018. \nThe group is overhauling its clothing ranges, hiring new chief creative officer Paula Dumont Lopez, who is due to start in September. It is also reducing its “dependence” on the UK high street and Mr Kristiansen said the group is “confident that we will see improvements, but expect these to take time”. \nThe group saw website sales also fall in the quarter, down 0.6%, while overall brand sales dropped 8.2%. New Look, owned by South African investment group Brait, has 890 stores, including 593 in the UK and a further 297 globally. New Look of one of their stores, as the high street chain revealed tumbling sales and earnings in a \"difficult\" market and warned trading would remain under pressure into 2018 (Image: New Look/PA Wire) 8:42", "external_links": [], "published": "2017-08-08T10:30:00.000+03:00", "crawled": "2017-08-08T10:53:43.005+03:00", "highlightTitle": ""}