{"organizations": [], "uuid": "b5a029b07a9df70cffee04d99d5766c59d00b754", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13159326.ece/ALTERNATES/s1200/IBP_NEC_080617election_18JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/failing-brexit-talks-could-long-13546329", "country": "GB", "domain_rank": 21960, "title": "Failing Brexit talks could do long term damage to North East economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-29T20:00:00.000+03:00", "replies_count": 0, "uuid": "b5a029b07a9df70cffee04d99d5766c59d00b754"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/failing-brexit-talks-could-long-13546329", "ord_in_thread": 0, "title": "Failing Brexit talks could do long term damage to North East economy", "locations": [], "entities": {"persons": [{"name": "barnier", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "gisela stuart", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "daily telegraph", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "former labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Failing Brexit talks could do long term damage to North East economy As talks between the UK and EU become increasingly hostile, MP Catherine McKinnell says she fears for North East exporters Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nThe UK’s chaotic handling of Brexit talks with the European Union could have a devastating effect on the North East’s economy , an MP has claimed. \nNewcastle North MP Catherine McKinnell said the region could be particularly hard hit by a poor Brexit deal because the region is a major exporter. \nAnd as the British government appeared to be at loggerheads with EU officials, she said: “This cavalier approach just won’t wash in a situation as complex as this, and it’s also totally unacceptable when people’s jobs and livelihoods are at risk.” \nThe latest round of negotiations about is underway in Brussels, where Brexit Secretary David Davis is leading talks on behalf of the UK while French politician Michel Barnier represents the EU. \nBut both sides have accused the other of failing to take the talks seriously. \nMr Barnier has said he was “concerned” that the UK is failing to make its position clear on issues such as how much it was willing to pay in order to clear what the EU says are debts owed. He complained: “We need UK positions on all separation issues. This is necessary to make sufficient progress. We must start negotiating seriously.” Catherine McKinnell (Image: Newcastle Chronicle) \nAnd European Commission president Jean-Claude Juncker said the EU was not willing to discuss a new trade deal with the UK before agreement was reached on issues such as the status of EU citizens living in the UK. \nHe said: “We need to be crystal clear that we will commence no negotiations on the new relationship - particularly a new economic and trade relationship - between the UK and the EU before all these questions are resolved.” \nBut the Government has hit back. The Daily Telegraph reported “senior sources close to the talks” had attacked Mr Barnier, calling his approach “inconsistent, ill-judged, ill-considered and unhelpful for the next round of negotiations”. \nAnd Mr Davis appeared to express frustration with the negotiations, saying: “We want to lock in the points where we agree, unpick the areas where we disagree, and make further progress on a range of issues. \n“But in order to do that, we’ll require flexibility and imagination from both sides.” Read More Should the North East have its own immigration policy to bring in foreign workers? \nMs McKinnell, a Labour MP , said the way the talks were handled threatened to do long-term damage. \nShe said: “Fourteen months on from the referendum, the Government’s ongoing lack of detailed planning or strategy for the Brexit negotiations is absolutely staggering, and risks being hugely damaging for the future of our country. \n“Too many Cabinet Ministers have been able to get away with ‘winging it’ for too long, but they’re now being found out. This cavalier approach just won’t wash in a situation as complex as this, and it’s also totally unacceptable when people’s jobs and livelihoods are at risk. \n“It’s particularly vital for the North East that we get a good Brexit deal, and that must mean ruling nothing out as part of the negotiations. Our membership of the Single Market and the Customs Union are hugely important to the region’s economy – with 60% of our exports currently going to the EU – and I want to ensure that we continue to benefit from this for as long as possible.” \nLabour announced over the weekend that it would back a “transitional” deal with the EU, allowing the UK to remain in the European single market for an unspecified period of time even after Brexit takes place in 2019. \nBut some critics say this would mean the UK never really leaves the EU at all. Read More Britain would have voted to Remain had it been better educated, academics claim \nFormer Labour MP Gisela Stuart, who chaired the official Leave campaign in the 2016 referendum, said the UK would never really leave the EU unless it also left the single market. \nShe said: “If we remain in the single market or the customs union then we haven’t left.” \nAnd she criticised the idea of a transitional deal with no agreed end date. \n“If you move to it being open ended then people will see it as a way of not leaving at all. \n“And that’s the worst of both worlds, because on the one hand it will not fulfil the referendum pledge but also, if one of the arguments is that business requires certainty, then something that is creatively ambiguous doesn’t give you that certainty, which business wants.” \nThe single market allows the UK to trade with EU countries with very few restrictions. However, it also means the UK is bound by EU rules and continued membership would probably mean the UK had to continue to accept freedom of movement so it could not limit migration from EU countries. \nA transition deal may be needed because the UK is currently due to leave the EU by 29 March 2019 but agreement on the new arrangements, such as a trade deal between the UK and EU, may not have been reached by then. Like us on Facebook", "external_links": [], "published": "2017-08-29T20:00:00.000+03:00", "crawled": "2017-08-29T20:33:52.020+03:00", "highlightTitle": ""}