{"organizations": [], "uuid": "c9a0b9b3031c6a4d6fd7d4fee2b91b97276d7e2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30467363/16097544.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/we-need-to-make-a-green-brexit-work-neil-parish-mp-column/story-30467363-detail/story.html", "country": "GB", "title": "DanielClark published We need to make a 'Green Brexit' work - Neil Parish MP column", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-02T20:59:00.000+03:00", "replies_count": 0, "uuid": "c9a0b9b3031c6a4d6fd7d4fee2b91b97276d7e2f"}, "author": "DanielClark", "url": "http://www.devonlive.com/we-need-to-make-a-green-brexit-work-neil-parish-mp-column/story-30467363-detail/story.html", "ord_in_thread": 0, "title": "DanielClark published We need to make a 'Green Brexit' work - Neil Parish MP column", "locations": [], "entities": {"persons": [{"name": "danielclark", "sentiment": "none"}, {"name": "rebecca pow", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "north devon link road", "sentiment": "none"}], "organizations": [{"name": "neil parish", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We need to make a 'Green Brexit' work - Neil Parish MP column By DanielClark | Posted: August 02, 2017 0 COMMENTS SHARES We need to make a 'Green Brexit' work - Neil Parish MP column X \nCopy link to paste in your message / Comments (0) \nBrexit and environmental protections must go hand-in-hand. \nThe new Environment Secretary, Michael Gove, has now set out his vision of a 'Green Brexit'. Last week, I pressed the Government on how this would work in practice. \nThe British countryside is among the most beautiful in the world - and we are fortunate enough to live and breathe it here in Devon. I am delighted the Government has re-stated its commitment to safeguarding our vibrant natural environment post-Brexit. It's something I have pressed Minsters on specifically in Parliament. Post-Brexit, we can now tailor policy to the needs of our precious habitats and wildlife, instead of following a one size fits all approach for 28 EU different countries. This is an opportunity we mustn't miss. \nFor instance, we must look to reform our agri-environmental schemes. These are payments to farmers to protect and enhance our environment. We need to ensure such schemes are simple and provide proper incentives to farmers. Take trees as an example. Trees are a carbon sink, a way to manage flood risk and a habitat for precious species. Landowners and farmers should be encouraged to plant more. \nRead More: £5m upgrade for road surface of North Devon Link Road announced \nSo, if we are going to achieve a 'Green Brexit', we need to cut bureaucracy and create incentives to protect our environment. The everyday environmental benefits farmers secure for us should be recognised, not taken for granted. \nWe also need to be hard-headed about how we use environmental payments and subsidies. Anyone who drives up and down the M5 will not be surprised to learn that we now have enough solar to power 2 million homes. But we should avoid using fertile and productive agricultural land for renewable energy generation. \nEnglish farmland is some of the best in the world and should be geared towards growing quality food and crops. Solar panels, for instance, are best placed on the 250,000 hectares of south-facing commercial rooftops, where they will not compromise the success of our farming industry. I therefore welcome the fact that landowners are now being discouraged from constructing solar farms on the best and most versatile agricultural land. \nRead More: Developers say they will work to address local concerns after Exeter business park plan deferred \nThe Government will soon be publishing its plan for the environment in the next 25 years. We should take heart at what we have already achieved so far. \nSince 2010, the UK's greenhouse gas emissions are down 18% and our carbon emissions down 19%. We've introduced a 5 pence charge on plastic bags, decreasing their use by 83% in just two years. That means 9 billion fewer carrier bags distributed since the charge was introduced. Over a quarter of our electricity came from renewable sources last year, keeping the UK ahead of target on our renewable energy directives. We've also started phasing out coal-fired power stations, ratified the Paris Agreement on climate change and will soon be introducing laws to ban the sale and manufacture of microbeads, thanks to some excellent work by my neighbouring Conservative colleague, Rebecca Pow MP. \nWe should be proud of our record so far – but now is the time to redouble our efforts and press the Government to continue its good environmental work. The Government's ambition to leave the environment in a better state than it was found is a noble one. But there is more work to be done. I want our water to be cleaner and healthier, our seas plastic-free, an even lower carbon economy – and urgent work on air quality. \nRead More: University raise concerns after Stagecoach revise busy Exeter student route they subsidise \nAs we leave the EU and create our own domestic environmental regulations, I will press the Government to commit to the highest possible standards. But if a 'Green Brexit' is going to be a successful Brexit - food, farming and the environment must not become competing interests.", "external_links": [], "published": "2017-08-02T20:59:00.000+03:00", "crawled": "2017-08-02T22:44:34.004+03:00", "highlightTitle": ""}