{"organizations": [], "uuid": "d952421690b9340615bdc8a0ff321031e15709b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11699007.ece/ALTERNATES/s1200/Hinkley-Point-nuclear-power-station-plans.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13543064", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: £840m Network grid upgrade for Hinkley Point can be cheaper, says Ofgem", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-08-30T10:30:00.000+03:00", "replies_count": 0, "uuid": "d952421690b9340615bdc8a0ff321031e15709b2"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13543064", "ord_in_thread": 0, "title": "Business Breakfast LIVE: £840m Network grid upgrade for Hinkley Point can be cheaper, says Ofgem", "locations": [], "entities": {"persons": [{"name": "ofgem jonathon manning", "sentiment": "negative"}, {"name": "treharne", "sentiment": "none"}, {"name": "dunelm", "sentiment": "none"}, {"name": "paul callaghan", "sentiment": "none"}, {"name": "peckham", "sentiment": "none"}, {"name": "john browett", "sentiment": "none"}, {"name": "andrew burnett", "sentiment": "none"}, {"name": "robert patterson", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "ellingham", "sentiment": "none"}, {"name": "will adderley", "sentiment": "none"}, {"name": "sandy smith", "sentiment": "none"}, {"name": "peacock", "sentiment": "none"}, {"name": "jonathon manning dunelm", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}, {"name": "robert gibson", "sentiment": "none"}, {"name": "callaghan", "sentiment": "none"}, {"name": "jonathon manning jesmond", "sentiment": "none"}, {"name": "ian high", "sentiment": "none"}, {"name": "andy harrison", "sentiment": "none"}, {"name": "buccleuch", "sentiment": "none"}, {"name": "richard buckley", "sentiment": "none"}, {"name": "geof ellingham", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "sanderson weatherall", "sentiment": "none"}, {"name": "john treharne", "sentiment": "none"}, {"name": "yasmin peacock", "sentiment": "none"}, {"name": "steve ashmore", "sentiment": "none"}, {"name": "harrison", "sentiment": "none"}, {"name": "keith down.mr browett", "sentiment": "none"}, {"name": "steve messenger", "sentiment": "none"}], "locations": [{"name": "hinkley point", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "macau", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "brandling village", "sentiment": "none"}, {"name": "city road", "sentiment": "none"}, {"name": "lewisham", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "dagenham", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}], "organizations": [{"name": "tyne tees tv", "sentiment": "none"}, {"name": "peacock’s puds", "sentiment": "none"}, {"name": "rvi", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "newcatle city council", "sentiment": "none"}, {"name": "m&s northumberland street", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "agile business consortium", "sentiment": "none"}, {"name": "your homes newcastle", "sentiment": "none"}, {"name": "gym group", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "buccleuch property", "sentiment": "none"}, {"name": "jeds investments", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}, {"name": "home group", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "jonathon manning agile business consortium", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning The Gym Group gets in shape with 75% rise in profits \nLow-cost fitness chain The Gym Group pumped up revenues and profits in the first half of the year, helped by a rising number of Britons trying to get fit.The company posted an 18.8% rise in revenue to £42.8m in the six months to June 30, while statutory pre-tax profit rocketed 75.5% to £5.9m.Membership numbers increased by 19.8% to 508,000 and boss John Treharne said The Gym Group is limbering up for its next raft of openings.He said: \nWe have delivered another period of strong growth in membership, revenue and profit. \nWe have continued to expand our footprint across the UK, opening six new gyms in the period, two in H2 to date, with several more currently in fit out. \nOur strategy remains the same: to take advantage of the demand for high-quality, low-cost, 24/7 gyms whilst continuing to innovate through the use of technology and digital marketing. \nMr Treharne added that the firm, which has 95 gyms, expects to open 15 to 20 sites in 2017.The Gym Group said it has seen a fall in the number of local authority gyms as a result of “ongoing funding pressures on councils”, creating an opportunity for the business to “fill the gap”.The group said: \nIn the last year, we have opened in some of the most inactive areas of the UK with successful sites in areas such as Dagenham, Peckham and Lewisham. Inside one of The Gym Group's fitness centres 9:21 Jonathon Manning Last plot of former Tyne Tees site sold to student accommodation developers \nUK property investor and developer Buccleuch Property has sold the last remaining plot from the old Tyne Tees site in Newcastle for £1.7m. \nThe 0.57-acre site on City Road has been bought by JEDS Investments. \nBuccleuch bought the former Tyne Tees TV site in 2007 and over the past 10 years has released other plots from the overall 1.7-acre site for development by U Student and Home Group. \nProperty developer JEDS Investments has acquired the last remaining part of the site to transform it into student accommodation. It has secured full planning consent for the development of a 207-bed student residential scheme and will start work on site later this year. \nSandy Smith, development director at Buccleuch Property said: \nCity Road is a highly attractive site in the centre of Newcastle that has created a variety of opportunities over the past 10 years, already including the successful delivery of the 386 bed studio student village and the 30 residential apartments. \nWe continue to actively seek new investment and development opportunities of this nature across the UK. \nSanderson Weatherall and Knight Frank acted on behalf of Buccleuch Property. \nRobert Patterson, head of agency at Sanderson Weatherall said: \nThis development is the last part of the jigsaw for a major redevelopment of the former Tyne Tees TV site. We are delighted to have secured the sale of the site to JEDS Investments and see the continued transformation of the site following on from the previous sales to U Student and Home Group. Student accommodation planned for old Tyne Tees site in Newcastle (Image: Copyright unknown) 9:17 KEY EVENT M&S in discussions to franchise Hong Kong and Macau stores \nRetail giant Marks & Spencer is in talks to franchise out its 27-store business in Hong Kong and Macau as it continues to overhaul its international presence.M&S said it has started discussions with long-term franchise partner Al-Futtaim, which already operates 43 of its stores across seven markets in the Middle East, Singapore and Malaysia.The move comes as part of efforts to cut the group’s wholly owned international businesses under a wider overhaul announced last November.M&S said its stores in Hong Kong and Macau will continue to trade as normal while talks continue with Al-Futtaim, which will carry out several months of due diligence.Paul Friston, Marks & Spencer’s international director, said: \nIn November we set out our plans to create a more sustainable, profitable and customer-centric international business for M&S by focusing on our established partnerships. \nAl-Futtaim is a key partner to M&S in Asia and the Middle East and we are both committed to putting the customer at the heart of everything we do.” The green wall on M&S Northumberland Street (Image: handout) 9:12 Jonathon Manning 'Staircase tax' landing North East businesses with massive bills \nFirms across the North East are facing massively inflated business rates bills thanks to the introduction of a “staircase tax”. \nUnder new rules, many businesses are seeing their business rates soar because they share a communal staircase with other companies in the same building. \nIn the past firms that occupied multiple floors of a property received a single business rates bill covering the total space they occupied. But following a Supreme Court ruling, businesses will receive multiple bills if they occupy more than one floor but share a staircase with another company. \nFirms with their own private staircase or walkway will continue to be billed in the old style. \nMike Cherry, national chairman at the Federation of Small Businesses (FSB), said: \nThis latest twist in the business rates tale serves as yet another reminder of what a regressive system our entrepreneurs are faced with when it comes to this tax. \nHow can it be right that you’re hit with a massively inflated bill simply because the staircase you use is shared and not private? And these bills are backdated, stinging firms that are still waiting on delivery of relief measures announced more than five months ago. \nEnough is enough. Any sensible person can see that the business rates regime is fundamentally flawed, penalising firms before they made their first penny in turnover, let alone profit. A fundamental review of the tax is long overdue. \nMaking matters worse is the fact that the business rates will be backdated to April 2015, leaving thousands of firms with a massive bill to pay. Looking up a spiral staircase (Image: Getty Images Europe) 9:07 Jonathon Manning Dunelm chief executive John Browett stepping down 'for personal reasons' \nThe chief executive of homewares retailer Dunelm is to step down with immediate effect for “personal reasons”.Dunelm said John Browett, who was appointed as boss in 2015, had made “good progress over the last two years”, but added that the next “phase of growth requires different leadership”.Chairman Andy Harrison will step into the breach on an interim basis, supported by deputy chairman Will Adderley and finance chief Keith Down.Mr Browett said: \nI am pleased to have led the development of Dunelm over the last few years and feel that we have achieved much in a challenging retail environment. \nIt is, however, time to move on to a new challenge, and I am looking forward to the next chapter of my career. \nThe news comes after Dunelm warned in February that costs were starting to rise in the face of the Brexit-induced collapse in the value of the pound, resulting in a more “challenging” retail environment.Mr Harrison said: I would like to thank John for his contribution to the business and the strategic progress made under his leadership, most notably the exciting acquisition of Worldstores. John Browett is stepping down as CEO of Dunelm 9:02 KEY EVENT New bakery business promises to sell unique cakes on Newcastle's Quayside \nA new cake shop promising to bring a unique spin to traditional sweets is about to launch on Newcastle’s Quayside market. \nPeacock Puds is being opened by Yasmin Peacock, who is hoping to swap her medical career for a full time job as a baker. \nMs Peacock currently works as a medical information scientist at Newcastle’s RVI, helping the hospital treat patients who have overdosed on drugs. \nBut after members of the public started asking to order her cakes on Facebook, Ms Peacock decided to turn her hobby into a fully fledged business. \nShe said: \nI bake all the time, and it was one of those things when people kept telling me I could sell them. \nI thought it was people just being nice but then I made a cheesecake and put a photo of it online and about five people sent me messages asking to order the cake. When I started getting proper orders in I thought, ‘yes, I can do this’. \nAfter attracting so much attention online, Peacock’s Puds now uses a cartoon of its cheesecake as its logo. The business will launch a stall at the Newcastle Quayside market on September 3, and will trade there every Sunday. \nPeacock Puds intends to sell a range of cakes and sweet treats that are different from those already being sold on the market. \nMs Peacock said: \nOn the market there is going to be things like cake jars, brownies, traybakes, malteser cakes, and custard creme blondies. \nI want to do loads of different cakes that are a bit different from what is already down there. I know there is a cupcake place and a brownie place already there, so I want to do something a bit different. \nThere is nothing like my cake jars on the Quayside at the moment. \nMs Peacock’s cake jars are cupcakes baked within a large jam jar. Each one contains around four or five cupcakes covered in a variety of toppings such, as butter cream or caramel. Yasmin Peacock is launching Peacock Puds in Newcastle (Image: Unknown) 8:57 Jonathon Manning Agile Business Consortium appoints Newcastle businessman as chair \nAgile Business Consortium, the not-for-profit body that champions Agile business thinking, has appointed Newcastle businessman Geof Ellingham as its new chair. \nHe takes over from Steve Messenger who has overseen the growth of the consortium, as well as the launch of its training course and qualification known as Agile Project Management. \nCommenting on his appointment Mr Ellingham said: \nBusinesses face an unparalleled period of change, so this is the right time for us to bring business agility to more organisations. This means both developing innovative new products and services, and building new relationships with like-minded individuals and groups in the business agility arena. \nOrganisations, whether in the private or public sector, need to have access to a comprehensive toolkit of Agile products and guidance that can help them transform how they operate, and respond to the day-to-day changes they are experiencing. \nA huge thank you must go to Steve Messenger whose stewardship and guidance has helped lay such solid foundations for the Agile Business Consortium, and who was instrumental in the creation of AgilePM, the world’s most popular Agile project management framework. \nHis legacy to the Agile community is enormous, and it’s a privilege for me to follow him and champion the take-up of business agility globally. \nMr Ellingham has spent 30 years working in the tech and education sectors and now runs his own Agile business consultancy. Before this he was head of IT at Your Homes Newcastle, which manages council homes for Newcatle City Council. \nCurrently, Mr Ellingham is working on the development of a new agile and digital services qualification. Geof Ellingham chair of Agile Business Consortium 8:52 Jonathon Manning Jesmond pub to be re-named after being taken over by growing bar company \nA popular Newcastle pub is to be re-named after being taken over as part of a growing North East leisure firm. \nThe Brandling pub, in Jesmond’s Brandling Village , closed in March, but is set to re-open after Pub Culture - which currently operates three pubs in Sunderland - took over the building. \nPub Culture, which is backed by well-known North East businessman Paul Callaghan, will undertake a fit out of the bar before it relaunches as The Dun Cow at Jesmond in September. \nMr Callaghan, who is one of four founding members of Pub Culture along with Ian High, Richard Buckley and Andrew Burnett, said: \nJesmond is a vibrant, exciting part of Newcastle, and we see huge potential for this latest venue, which we are delighted to add to our portfolio. \nWe have named the pub after one of our other venues, which has a traditional feel to it and will deliver a similar proposition to its customers - a fantastic selection of real ale, great food and a programme of live music, comedy nights and other excellent cultural entertainment. \nPub Culture currently runs The Dun Cow, The Peacock and The Old Fire Station, in Sunderland. \nMr Callaghan said: \nThe name Pub Culture captures the ethos of our business, which is not only about creating high quality pubs, but places that celebrate culture and local talent. We are passionate about our pubs being friendly meeting places that add to the communities they serve – great venues where we serve excellent ales and play fantastic music to create a really special experience. \nThe Dun Cow at Jesmond will be built around the same successful model we have put in place in our other venues, while retaining the charm and uniqueness that made it so popular in its heyday. We are hugely excited to open our doors. \nThe Brandling was put on the market at the end of last year. It had undergone a refurbishment before that, but the new owners are promising something different. The Brandling in Jesmond (Image: Robert Gibson) 8:47 Jonathon Manning HSS Hire cuts earnings forecast as half-year losses nearly quadruple to £30m \nStruggling tool supplier HSS Hire has reported mounting half-year losses and warned over full-year results as turnaround efforts take longer than expected.The group saw pre-tax losses nearly quadruple to £30.1m for the six months to July 1 from £7.8m a year earlier.It said while its recovery plan had helped return the group to profit in June and driven revenue growth in its beleaguered rental division, progress has been “materially” slower than expected.HSS is now pencilling in a lower-than-forecast adjusted earnings of £8m to £11m for the second half.Chief executive Steve Ashmore said: \nWhile significant operational change was achieved during the first half 2017, both rental revenue growth and the cost base were temporarily impacted, leading to reduced profitability. \nWe are facing into these challenges by taking decisive action to reinvigorate rental revenue growth through the implementation of new sales initiatives and by rolling out cost action. \nHe added: \nWhilst the rate of recovery in our rental revenues has been positive, it has been materially slower than originally targeted, leading to lower-than-expected profitability over this period. HSS Hire branch ", "external_links": [], "published": "2017-08-30T10:30:00.000+03:00", "crawled": "2017-08-30T11:45:03.005+03:00", "highlightTitle": ""}