{"organizations": [], "uuid": "53f2cbbfd454bc9f48105ee97afd7454ec8b4ed3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/incoming/article276065.ece/ALTERNATES/s1200/WE-NEED-IT-NOW.png", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/hundreds-sign-petition-calling-urgent-275940", "country": "US", "title": "Hundreds sign petition calling for urgent improvements to North Devon Link Road - Patrick Phelvin - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.1, "site_type": "news", "published": "2017-08-03T17:55:00.000+03:00", "replies_count": 0, "uuid": "53f2cbbfd454bc9f48105ee97afd7454ec8b4ed3"}, "author": "Patrick Phelvin", "url": "http://www.devonlive.com/news/devon-news/hundreds-sign-petition-calling-urgent-275940", "ord_in_thread": 0, "title": "Hundreds sign petition calling for urgent improvements to North Devon Link Road - Patrick Phelvin - Devon Live", "locations": [], "entities": {"persons": [{"name": "patrick phelvin", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "amy gaskin", "sentiment": "none"}, {"name": "jane baker-lockett", "sentiment": "none"}, {"name": "oliver tayler", "sentiment": "none"}, {"name": "keira ball", "sentiment": "none"}], "locations": [{"name": "north devon link road", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}, {"name": "west buckland", "sentiment": "none"}], "organizations": [{"name": "kia sportage", "sentiment": "none"}, {"name": "north devon journal", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hundreds sign petition calling for urgent improvements to North Devon Link Road 'We want to remind central Government of the importance of this project' Share Click to play Tap to play The video will start in 8 Cancel Play now Share \nHundreds of people have added their names to a petition calling on the Government to deliver improvements to the North Devon Link Road after a series of tragic deaths. \nOn Sunday an accident took place near West Buckland which led to the death of Keira Ball from her injuries on Tuesday afternoon. \nA collision on Monday involving a Marks & Spencer lorry and a Kia Sportage led to the deaths of Jane Baker-Lockett, 43, and her 12-year-old twins James and Amy Gaskin. The site of that incident was less than a mile away from Sunday’s crash. Sgt Oliver Tayler and the scene of the fatal crash on the A361 on Monday \nDevonLive.com and the North Devon Journal are campaigning for £250m of improvements to the link road to be delivered as a matter of urgency and central Government to establish a timetable for their delivery. Since the We Need It Now campaign launched on Tuesday more than 2,500 people have added their names to the petition. \nSince its inception in the 1980s the design of the road has been widely criticised because overtaking opportunities are limited. Accidents are common at junctions and when two lanes merge into one. \nThe improvement proposals will see more dualling between Tiverton and Barnstaple, but although approved in principle there is no start date, and campaigners are worried that the project will slip. DevonLive.com is calling for safety improvements to the A361 North devon Link Road through it's We Need It Now campaign \nBecause the road is no longer classified as a trunk road, and became Devon County Council’s responsibility in 2002, the local authority has to go through a lengthy process of bidding for funding. \nDevonLive.com editor Patrick Phelvin said: “We don’t yet know what caused these recent tragic accidents but we do know that the proposed improvements have been a very long time coming and they will make the road safer. Read More Trucker denies forcing car off road in dangerous A361 overtake \n“With Brexit and plenty of other demands for public money there are concerns that the project will slip, as attention is focused elsewhere. We want to remind central Government of the importance of this project and ensure it is completed in a timely manner.” ", "external_links": [], "published": "2017-08-03T17:55:00.000+03:00", "crawled": "2017-08-22T14:25:30.000+03:00", "highlightTitle": ""}