{"organizations": [], "uuid": "06e0c2bc8729cae5c0692d61a6d34646c9a098d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/incoming/article332405.ece/ALTERNATES/s1200/Wilkos-Newton-AbbotPNG.png", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/thousands-jobs-wilko-risk-after-332434", "country": "US", "title": "Thousands of jobs at Wilko at risk after profits plunge - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.627, "site_type": "news", "published": "2017-08-16T13:14:00.000+03:00", "replies_count": 0, "uuid": "06e0c2bc8729cae5c0692d61a6d34646c9a098d5"}, "author": "Share", "url": "http://www.devonlive.com/news/devon-news/thousands-jobs-wilko-risk-after-332434", "ord_in_thread": 0, "title": "Thousands of jobs at Wilko at risk after profits plunge - Devon Live", "locations": [], "entities": {"persons": [{"name": "wilko", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "wilkos", "sentiment": "none"}, {"name": "anthony houghton", "sentiment": "none"}], "locations": [{"name": "torquay", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "wilko", "sentiment": "none"}, {"name": "asda", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "google maps", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "plymouth herald", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Thousands of jobs at Wilko at risk after profits plunge Wilko has confirmed that it has entered redundancy consultation with almost 4,000 staff after a rise in costs led to a plunge in profits Share Wilkos in Newton Abbot (Image: Google Maps) Share Comments \nRetailer Wilko confirmed that thousands of jobs are at risk after it has entered redundancy consultation with nearly 4,000 staff. \nThis move comes just weeks after Wilko bemoaned a rise in costs as a result of the pound's Brexit-induced collapse. \nThe discount chain said that following a review of its operating functions, changes are required to ‘ensure it is best placed to continue to thrive within an ever-changing retail landscape’. \nWilko has stores in Torquay, Newton Abbot and Exeter, and said it is consulting with 3,900 of its store supervisory team about a new management structure, alongside trade union the GMB. \nIt added that 1,000 new senior supervisor roles will be created as part of the shake-up, as well as a \"significant amount\" of customer service roles. \nThe Plymouth Herald reports that the move comes after Wilko posted an 80 per cent plunge in pre-tax profits to £5.1 million in the year to January 28, with the firm pointing to \"uncertain economic and geopolitical events\", the collapse in sterling and the introduction of the national living wage. \nInflation, which has soared since the Brexit vote sent the British currency tumbling, hit its highest level for nearly four years in May at 2.9 per cent, before easing back to 2.6 per cent. \nThe net result has been an increase in import costs for retailers, who have then passed this on to already hard pressed consumers. Read More Lidl's huge new depot near Exeter is taking shape - PHOTOS \nAnthony Houghton, Wilko's retail director, said: \"Despite the challenging retail landscape Wilko has seen both positive customer numbers and like-for-like sales growth this year. \n\"This is not translating into positive results despite all the hard work to reduce costs, grow own-brand and digital sales. \n\"Following independent studies we identified a legacy of retail structures that created complexity to manage which aren't simple, fair or transparent for our team members. \n\"The simpler newly defined store structure will give teams greater variety within their roles and result in more team hours on the shop floor, delivering a better customer experience.\" Read More Shock closure of Exeter supermarket - which will be replaced by a charity shop \nThe announcement comes following similar moves at other retailers. \nTesco said earlier this year it is taking the axe to 1,200 jobs at its head office as part of a major cost-cutting drive. \nSainsbury's and Asda have followed suit, with reports suggesting over a 1,000 jobs are on the line at the supermarkets. Like us on Facebook ", "external_links": [], "published": "2017-08-16T13:14:00.000+03:00", "crawled": "2017-08-22T14:38:08.003+03:00", "highlightTitle": ""}