{"organizations": [], "uuid": "ea97a11eaf64335137e5b2a87184e38381eb1c50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12376407.ece/ALTERNATES/s1200/TMP_NEC_231015OsborneDevolution_07JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tale-two-halves-how-north-12375332", "country": "GB", "domain_rank": 21960, "title": "A tale of two halves: How North East devolution split on the shores of the Tyne", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "A tale of two halves: How North East devolution split on the shores of the Tyne", "spam_score": 0.0, "site_type": "news", "published": "2016-12-29T18:00:00.000+02:00", "replies_count": 0, "uuid": "ea97a11eaf64335137e5b2a87184e38381eb1c50"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tale-two-halves-how-north-12375332", "ord_in_thread": 0, "title": "A tale of two halves: How North East devolution split on the shores of the Tyne", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "chroniclelive", "sentiment": "none"}, {"name": "norma redfearn", "sentiment": "none"}, {"name": "julian", "sentiment": "none"}, {"name": "grant davey", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "northumberland county council grant davey  northumberland", "sentiment": "none"}, {"name": "north of tyne", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle city council nick forbes", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nIt’s a tale of two halves as the old cliché goes - only this game of political football splits at the Tyne and has rumbled on for much longer than 90 minutes. \nBackroom rows, leadership changes, Government interventions - the North East devolution process has seen it all in past year. \nLast December, with the ink not long dry on the devolution agreement signed between the leaders of the region’s seven local authorities and the then Chancellor George Osborne, it looked odds on that the North East would have an elected mayor by May 2017. \nFast forward 12 months and Britain has voted to leave the EU, there are new faces in Numbers 10 and 11 Downing Street and a devolution agreement couldn’t look further away. \nIn September the leaders of Newcastle, Northumberland and North Tyneside councils voted in favour of putting a devolution package out to public consultation – the next step in making it a reality – but the proposal was defeated when the leaders of Gateshead, Sunderland, Durham and South Tyneside councils voted not to go ahead unless they received more reassurances from the Government over funding. Chancellor George Osborne signs the Devolution agreement for the North East (Photo: newcastle chronicle) \nSince then the North of the Tyne authorities have been clear on their commitment to continue to pursue the devolution of powers and funding to the North East and have started the ball rolling on a new devolution agreement. \nThe leaders of the South of Tyne authorities have indicated that they still support devolution - but have not made any moves to make it a reality. \nChronicleLive asked the leaders of all seven North East authorities to reflect on the past year and share their hopes for devolution next year. \nThe leaders North of the Tyne chose to respond, while those South all declined the offer. Below we look at what they had to say. Norma Redfearn, Elected Mayor North Tyneside Council North Tyneside Elected Mayor, Norma Redfearn \nIn North Tyneside we want important decisions about this region to be taken here in the North East, not in London. We want the power to invest in our own economy and to create jobs. We also want to make sure that skills funding is targeted at local business needs. \nNorth Tyneside already attracts a huge amount of inward investment, and is home to a growing number of international firms, UK headquarters and innovative companies. \nWe want to take every chance to build on our record for growth, to create more jobs and opportunities for people in the borough. \nWorking closely with other authorities will allow us to deliver a step-change in access to skills and employment, giving the entire labour market opportunities to learn and work. North Tyneside is a great place to live, work and visit, and our offer is enhanced by the city and natural landscapes of our neighbours. \nBy working together, we can accelerate the availability of good-quality homes for all, strengthen growth in our rural areas, and make the North East even more attractive for business, families and professionals that want to access everything offered by our region. For too long decisions about this region and our residents have been made in London by people who don’t necessarily understand the needs of our communities. We need to be confident in our ability to speak up for the North East and drive forward innovation and investment. Devolution gives us an opportunity to do that. Councillor Grant Davey, Leader Northumberland County Council Grant Davey \nNorthumberland is at the extreme of the English economy and it is important for our residents and businesses that we do all we can to support them to create new jobs and ensure that our people can benefit from the opportunities that will emerge. \nTo the north, we have Scotland with significant devolved powers and to the south we have a number of northern city regions that either have, or are seeking, devolved powers and funding from Westminster. I viewed the North East devolution deal as an opportunity to create a long-term investment fund to help deliver sustainable growth, improve skills and educational attainment, and drive increased productivity. \nIt devolved important powers to the region so that we could make a difference at local level. We could compete on a level playing field with our regional and national neighbours. The fact that the North East Combined Authority did not secure the devolution deal with Government was disappointing to me but I respect the democratic process that led to the decision being made. \nPersonally I am keen to develop a new partnership with business organisations in the North of Tyne, and I would hope that we can actively involve them in developing the devolution package as we seek formal negotiations. Read More Councillor Nick Forbes, Leader Newcastle City Council Nick Forbes (Photo: Julian Hamilton/Daily Mirror) \nI have always believed that policy and funding decisions that impact on the North East in general and Newcastle in particular should be made locally and not in Westminster. \nThat is why I was a strong supporter of securing a devolution deal for the North East and wanted to progress with the deal that was on offer. That deal would have been a beginning and, as Manchester has shown over the years, it is likely that we would have secured further devolved powers with time. \nEnsuring those opportunities continue to be available for Newcastle’s economy and residents is central to what myself and the city council are trying to secure by working with North Tyneside and Northumberland. Securing decision-making powers in the region is particularly important post-Brexit, where local areas are clearly better placed than Westminster to respond to any economic change. The North of Tyne area represents a strong and coherent economic geography, with over 800,000 people and 23,000 businesses delivering in excess of 400,000 jobs. \nIn terms of size it is on a par with other areas which have secured devolution deals such as Teesside and the West of England. The area benefits from major economic assets including two universities, an international airport, excellent intercity rail connectivity, two thriving ports, world-class historical and cultural assets and, most importantly, we have a city, towns and villages where people want to live. Gaining the devolved powers needed to make the most of these assets will deliver new opportunities for our residents and contribute to growth across the wider North East economy. Like us on Facebook", "external_links": [], "published": "2016-12-29T18:00:00.000+02:00", "crawled": "2016-12-29T13:46:48.353+02:00", "highlightTitle": ""}