{"organizations": [], "uuid": "1cf3b3507511d4e33be5fc474c8bafc0c326449c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11561659.ece/ALTERNATES/s1200/hargreaves.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12356820", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Hargreaves Services' acquisition of Blackwell to cost £800,000 more than expected", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Hargreaves Services' acquisition of Blackwell to cost £800,000 more than expected", "spam_score": 0.0, "site_type": "news", "published": "2016-12-22T15:15:00.000+02:00", "replies_count": 0, "uuid": "1cf3b3507511d4e33be5fc474c8bafc0c326449c"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12356820", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Hargreaves Services' acquisition of Blackwell to cost £800,000 more than expected", "locations": [], "entities": {"persons": [{"name": "blackwell", "sentiment": "negative"}, {"name": "peter jackson", "sentiment": "none"}, {"name": "michael potts", "sentiment": "none"}, {"name": "anu chandra", "sentiment": "none"}, {"name": "mary turner", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "al yong", "sentiment": "none"}, {"name": "kevin gilliland", "sentiment": "none"}, {"name": "waheed alli", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "rymote", "sentiment": "none"}, {"name": "narendra modi", "sentiment": "none"}, {"name": "coun michael mordey", "sentiment": "none"}, {"name": "steve walker", "sentiment": "none"}, {"name": "colin newbury", "sentiment": "none"}, {"name": "len mccluskey", "sentiment": "none"}, {"name": "nigel wilson", "sentiment": "none"}, {"name": "ben mawhinney", "sentiment": "none"}, {"name": "lizzie withington", "sentiment": "none"}, {"name": "koovs", "sentiment": "none"}, {"name": "alpesh paleja", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "ponteland south", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "green belt", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "virgin atlantic", "sentiment": "none"}, {"name": "aslef", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "lugano", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "acas", "sentiment": "none"}, {"name": "ponteland garden", "sentiment": "none"}, {"name": "dissington", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "ponteland", "sentiment": "none"}, {"name": "dissington garden village", "sentiment": "none"}], "organizations": [{"name": "hargreaves services", "sentiment": "negative"}, {"name": "uk space", "sentiment": "negative"}, {"name": "stagecoach north east", "sentiment": "none"}, {"name": "woodford investment management", "sentiment": "none"}, {"name": "drone industries", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "gospelware", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "newcastle science central", "sentiment": "none"}, {"name": "all post office", "sentiment": "none"}, {"name": "post office", "sentiment": "none"}, {"name": "ryelore", "sentiment": "none"}, {"name": "koovs", "sentiment": "none"}, {"name": "communication workers union", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "maritime and transport", "sentiment": "none"}, {"name": "confederation of british industry", "sentiment": "none"}, {"name": "southern railway", "sentiment": "none"}, {"name": "british business bank", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "legal & general capital", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "lugano property group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:12 North East businesses selected to join UK Space Agency-backed programme \nFive entrepreneurs have been chosen to benefit from a UK Space Agency-backed programme to help their firms tap into the billion pound space industry. \nBusiness Durham, the economic development company for County Durham , received a grant from the agency earlier this year, to set up the programme at Sedgefield’s NETPark. \nNow the group has picked a group of innovators who will benefit from mentoring by a panel of experts ready to impart knowledge in areas including law, financial management, business growth, marketing, and IP protection. \nThe entrepreneurs are entitled to up to £10,000 worth of professional services and will be based in an environment surrounded by some of the world’s most innovative companies. \nFour of the business owners met the panel for the first time at an event at the Newcastle Quayside offices of law firm Ward Hadaway. \nThe five business owners are Anu Chandra, of Durham-based software company Ryelore; Ben Mawhinney, director of Newcastle’s Drone Industries, known for its mapping technology; Lizzie Withington, CEO of Newcastle-based software company Gospelware; Al Yong, MD of Washington-based IT service provider Rymote, and Michael Potts of Houghton-le-Spring-based camera developers, Chapter 6. Artist impression of one of the two as-yet undiscovered planets as big as Earth or larger may be hiding in the outer fringes of the Solar System, scientists believe (Photo: Nasa/JPL-Caltech/PA Wire) 9:06 Talks over BA cabin crew strikes set to resume \nTalks aimed at averting strikes by British Airways cabin crew on Christmas Day and Boxing Day will resume on todau. \nUnite leader Len McCluskey and other union officials spent a second day meeting the company under the chairmanship of the conciliation service Acas, before talks were adjourned at 12.30am last night. \nA spokesman said the union continued to pursue progress in the dispute, seeking an improvement on the “poverty pay” of cabin crew employed in the so-called mixed fleet. BA says it will run a full service on both days even if the strikes by Unite members go ahead. \nThe talks come as the pre-Christmas bout of industrial unrest rumbles on, with workers who deliver cash to Post Offices striking on Thursday and Friday. \nMembers of the Communication Workers Union will walk out as part of a campaign against job losses, the closure of a final salary pension scheme and closures. Union members working in Crown offices were on strike on Monday and Tuesday, and will take action again on Christmas Eve. \nKevin Gilliland, the Post Office’s group network and sales director, said the company had contingency plans in place. He said: \nAll Post Office branches will be open for business on December 22 and 23. \nWe also expect the vast majority of branches to be open on Christmas Eve, although some will close at 12.30pm or during the afternoon in line with their normal Saturday opening hours. All of these branches will close by 4pm. \nMeanwhile, a ban on overtime by drivers on Southern Railway continued to cause delays and cancellations to services, which are likely to continue over Christmas. \nMembers of Aslef went on strike for three days last week, which halted all Southern’s services, and are due to stop work for a week from January 9 unless there is a breakthrough in their deadlocked dispute over driver-only trains. \nRail, Maritime and Transport union members on Southern ended their latest 48-hour stoppage at midnight and are set to strike for three days from New Year’s Eve over changes to the role of conductors. \nPilots at Virgin Atlantic are due to start a “work to contract” from Friday in a dispute over union recognition. British Airways fleet 9:01 Stagecoach introduces contactless card payments on North East buses \nStagecoach has introduced contactless card payments on its buses in the North East, making commuters in the region among the first to use the state-of-the-art technology. \nPassengers will no longer need to pay for their bus services with cash but can now use contactless credit or debit cards. Commuters can also pay using their mobile phone through Apple Pay or Android Pay. \nNorth East bus passengers will be among the first people outside of London to be able to use the new technology to pay for their fare. But, unlike London, those travelling with Stagecoach will still be able to pay with cash if they wish. \nSteve Walker, managing director at Stagecoach North East, said: \nThe introduction of contactless is yet another demonstration of the practical improvements bus operators are making for passengers. \nThis is a new fast, easy and secure way for customers to pay for bus travel and complements the many other technology solutions we have introduced recently. \nMore of our customers are using contactless cards to pay for coffee, sandwiches and many other day-to-day activities. Transport is a key part of people’s lives and this is another great reason for people to choose greener and smarter bus travel. \nNew dedicated ticket machines have been installed on all of Stagecoach’s 470-strong fleet of buses and coaches. The system is designed to speed up journey’s and help customers who will no longer be required to carry cash for their journey. Coun Michael Mordey and Stagecoach operations director Colin Newbury (Photo: Stagecoach) 8:57 Private sector growth hits one-year high after manufacturing activity pick-up \nPrivate sector growth has hit a one-year high thanks to a pick-up in manufacturing activity, but the Confederation of British Industry (CBI) warned of a “significant” slowdown in the year ahead. \nThe CBI’s latest growth indicators’ survey shows output across the manufacturing, distribution and service sectors rose to a balance of 17% in the three months to December, the highest level since December 2015, when it reached 20%. \nManufacturing saw the strongest growth rate, while the retail sector experienced a slower pace of growth despite a “solid” rise in sales. Volumes also picked up in business, professional and consumer services. \nThe survey, which polled 788 business representatives, found that firms expect similar momentum over the next three months, with a balance of 15% seeing healthy growth over the first quarter of 2017. \nBut the CBI cautioned that the long-term picture is not as bright. It said industry surveys have shown that inflationary pressures are building, while official data is pointing to rising cost pressures as the weak pound drives up import prices. Sterling has fallen over 18% against the dollar and over 9% against the euro since the Brexit vote. \n“Although growth since the EU referendum has been stronger than expected, we anticipate a significant slowing further ahead”, the report said. \nManufacturers’ expectations for output price inflation is at its highest since mid-2011, and the CBI says consumer services and distributive sector firms are already expecting a slowdown in growth over the next few months. \nCBI principal economist Alpesh Paleja said: \nIt’s great to see the economy end the year on the up, with growth strengthening across the private sector. \nHowever, economic growth is likely to soften next year, as heightened uncertainty hits business investment and higher inflation weighs on household spending. \nWith the fresh slate of a new year on the horizon, British businesses will be looking to the Government for as much clarity as possible on upcoming EU negotiations, and want to work together to develop a post-Brexit economy that sustains growth and prosperity for all. Union Jack pictured next to the European Union flag (Photo: Yui Mok/PA Wire) 8:51 2,000-home Ponteland garden village plans submitted with backing from top architect \nAn outline planning application for a 2,000 home garden village in Northumberland has been submitted, with backing from a prominent architect from the region. \nNewcastle’s Lugano Property Group wants to build housing and other facilities on land at Dissington, near Ponteland , but faces strenuous local opposition from people saying that local services will not be able to cope with the added population. \nNorthumberland County Council earlier this year backed an expression of interest submitted by Lugano to the Government to become one of the 12 new garden villages Ministers want to see built. \nNow the company has submitted plans for around 2,000 homes, of which it says 600 will be affordable and will include starter homes and supported housing for the elderly. \nEducation, leisure, medical, retail and employment facilities are also part of the plan, while there would be 130 hectares of public open space and landscaping, with sports pitches, parkland, allotments and walking and cycle routes. \nThe development would also include a new relief road bypassing the centre of Ponteland and funds towards secondary education and a flood alleviation scheme to protect Ponteland town centre. \nHexham MP Guy Opperman and councillors in Ponteland have previously spoken out against the plans and a new warning was sounded last night that the company will face largescale opposition in Ponteland. \nPonteland South councillor Peter Jackson said: \nAlong with most the vast majority of the residents of the whole area, I’m absolutely opposed to it. There’s no justification for such a massive incursion into the Green Belt whatsoever. \nThis development would have a dramatic affect on the whole character of the area. If you take it with other planned housing developments, it would almost double the size of the community. Residents, as in many other towns in Northumberland, are concerned about the lack of basic infrastructure planning for these extra houses. Site plan of Dissington Garden Village (Photo: Cian PR) 8:45 KEY EVENT £65m to create thousands of jobs in Newcastle is finalised \nA £65m deal that should pave the way for thousands of highly skilled jobs to be created in Newcastle has been completed . \nThe deal, which sees Legal & General Capital provide funding for developments at Newcastle’s Science Central, was first announced in the summer, with the transaction now being completed with the partners in the scheme, Newcastle City Council and Newcastle University. \nThe £350m development of the former brewery and one-time colliery site on the edge of Newcastle city centre has already seen the building of an award-winning office block, The Core, while Newcastle University is developing facilities that include a new centre for urban sciences, plus national centres in energy and smart data. \nIt is ultimately hoped that the 24-acre site will create more than 4,000 jobs, 500,000 sq ft of office space and 450 new homes. \nLegal & General has also created a £150m venture called ADV, working with Woodford Investment Management and the British Business Bank to fund digital businesses across all stages of their growth. \nLegal & General’s chief executive Nigel Wilson, who grew up in the North East and is a Newcastle United fan, has hailed the Tyneside deal. \nHe said: \nOur patient capital is being invested to develop UK cities so that they have the opportunity to succeed in science and technology innovation. \nThe £350m Newcastle Science Central scheme, alongside our other investments including our £150m co-investment in ADV will support UK-wide technology start-ups, creating jobs and boosting the economy. An aerial shot of the Newcastle Science Central site 8:39 Online fashion retailer Koovs posts loss of £9.1m \nLosses at London-listed Indian online fashion retailer Koovs widened in the first half of the year despite rising sales and customer numbers. \nThe firm, chaired by ex-ASOS man Lord Waheed Alli, racked up losses of £9.1 million in the six months to September 30, compared with £5.7 million last year. \nKoovs said the loss was expected as it continues to increase investment in marketing and technology. However, revenue doubled from £2m to £4m and active customers grew to 431,000 from 181,000. \nBoss Mary Turner said: \nIt has been another amazing six months of growth for both sales and new customers. We have delivered on both our strategic and financial objectives and are in line with expectations. \nThe increases in our customer base, registered base and social followers will provide an excellent opportunity for future growth. \nShe added that Indian Prime Minister Narendra Modi’s demonetisation programme had had a “short-term impact” on the market and e-commerce. The number of registered Koovs users now stands at 1.5m and social media followers at 1.7m. A person typing", "external_links": [], "published": "2016-12-22T15:15:00.000+02:00", "crawled": "2016-12-22T12:38:40.371+02:00", "highlightTitle": ""}