{"organizations": [], "uuid": "e72b5d977b619a99964c9f90d47e0dbc2ea6355c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/whats-on/shopping/article11061179.ece/ALTERNATES/s1200/asos-maxi1.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12306331", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: ASOS creating 1,500 jobs, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: ASOS creating 1,500 jobs, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-12-12T15:21:00.000+02:00", "replies_count": 0, "uuid": "e72b5d977b619a99964c9f90d47e0dbc2ea6355c"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12306331", "ord_in_thread": 0, "title": "Business Breakfast LIVE: ASOS creating 1,500 jobs, plus latest news", "locations": [], "entities": {"persons": [{"name": "mccarthy", "sentiment": "negative"}, {"name": "andy gossage", "sentiment": "none"}, {"name": "raschid abdullah", "sentiment": "none"}, {"name": "salter", "sentiment": "none"}, {"name": "brad stevens", "sentiment": "none"}, {"name": "jim mccarthy", "sentiment": "none"}, {"name": "mohan mansigani", "sentiment": "none"}, {"name": "nick beighton", "sentiment": "none"}, {"name": "camden", "sentiment": "none"}, {"name": "melanie brown", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "rob smith", "sentiment": "none"}, {"name": "melanie", "sentiment": "none"}], "locations": [{"name": "poundland", "sentiment": "none"}, {"name": "borthwick castle", "sentiment": "none"}, {"name": "beldray", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bar soba", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "camden", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "coreena ford", "sentiment": "negative"}, {"name": "asos", "sentiment": "negative"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "siemens mobility division", "sentiment": "none"}, {"name": "coreena ford bar soba", "sentiment": "none"}, {"name": "filtronic broadband", "sentiment": "none"}, {"name": "filtronic", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bar soba", "sentiment": "none"}, {"name": "siemens", "sentiment": "none"}, {"name": "greater london house", "sentiment": "none"}, {"name": "edinburgh festival fringe", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "petards", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "leading bar and restaurant chain bar soba", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "intempo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Ex-Poundland boss McCarthy to chair ultimate products ahead of planned flotation \nUltimate Products has appointed former Poundland boss Jim McCarthy to the role of chairman as the firm gears up for a potential stock market flotation. The Manchester-based company - which owns the Beldray, Salter and Intempo brands - is working with Shore Capital towards an initial public offering (IPO) which would value the firm at up to £100 million. \nMr McCarthy’s appointment is a clear signal that the firm intends to press ahead with the listing, despite putting flotation plans on ice prior to the EU referendum. \nThe retail veteran headed up Poundland from 2006 until July, before which he was managing director of Sainsbury’s convenience store business. \nMr McCarthy said: “I have known about Ultimate Products for several years, during which time it was a supplier to Poundland. \n“Ultimate Products has a terrific track record of growth, which has been achieved by building an impressive range of brands, delivering amazing value for money to customers, whenever, wherever and however they want to shop.” \nThe company made the announcement alongside its latest quarterly results, which saw revenue of £33 million in the three months to October 31, up 49% on the same period last year. \nIn October the group’s managing director, Andy Gossage, shrugged off Brexit fears. “Brexit will be challenging for the UK economy, but we’re just getting our heads down and getting on with it,” he said. Former Poundland boss Jim McCarthy 9.00 Coreena Ford Bar Soba eyes Newcastle for Pan Asian streetfood and cocktail venue \nLeading bar and restaurant chain Bar Soba is looking to launch a Newcastle site to serve up its brand of Pan Asian street food and cocktails. \nThe Glasgow-based bar and restaurant chain is preparing to open a further seven restaurants following a £3m investment by BGF (Business Growth Fund) and the appointment of industry veteran Mohan Mansigani as chair. \nThe company, which already has five sites spread across Edinburgh, Glasgow and Leeds, has unveiled plans to target Scotland and the North of England and is already considering a number of sites in key cities including Newcastle. \nFounder and chief executive officer Brad Stevens, who launched Bar Soba as a pop-up restaurant at the Edinburgh Festival Fringe in 1997, said the chain will then look to expand further afield. \nThe business, which serves cocktails and South-East Asian street dishes, is on course to turn over more than £6m during the current financial year. \nBar Soba has an ambition to become a national brand, using the first stage of investment from BGF to support its immediate growth, with an ultimate plan to grow to 30 sites. Inside a Bar Soba restaurant (Photo: Bar Soba ) 8.55 Coreena Ford   \nJob losses have hit the North East while the rest of the country has seen an increase in employment figures, a new survey suggests. \nThe North East PMI report from the Lloyds Banking Group found that 16.7% of businesses were employing less people in November than in October while only 2.4% of businesses had increased their headcount month-on-month. \nThe bank’s survey - which is based on a representative sample of businesses in the region - found that the North East was also the only region in the country to record “modest job losses” over the last three months, while the east of England saw the biggest rise in employment. \nLloyds’ report comes a few days before official employment statistics are due to be published by the Office for National Statistics, which will be closely watched as people try to see whether the Brexit vote in June, the plunge in the value of Sterling and other factors have hit employment prospects. The entrance to a Jobcentre Plus (Photo: Philip Toscano/PA Wire) 8.50 Filtronic in £13m defence supply agreement \nNorth East tech firm Filtronic has announced a £13m deal with a defence equipment manufacturer. \nThe firm’s broadband business, which is based in Sedgefield, has signed a multi-year agreement to supply its high frequency modules for use in the aerospace defence sector. \nThe firm said the agreement will last around eight years, during which Filtronic will manufacture and test the modules at the manufacturing facility in Sedgefield. \nThe deal is expected to generate around £13m of revenue over the term of the agreement. \nIf the clients gets further project wins from its own customers there could be scope for Filtronic to provide more of the modules too. \nRob Smith, Filtronic CEO, said: “Filtronic Broadband is a specialist designer and manufacturer of microwave and mmWave transceivers for the telecommunications industry and related defence markets. \n“This agreement is the first substantial defence related business win for Filtronic Broadband and with it we achieve a significant strategic milestone in diversifying our customer and market base. \n“We are delighted to have been selected as a supply partner by this prestigious customer and we look forward to further successes in this sector in the future.” Rob Smith, CEO of Filtronic 8.41 Coreena Ford Meet the North East designer who has designs on historic buildings \nThe winners of the Northern Design Awards were unveiled last month and among those from the North East who came away covered in glory was a Sunderland company called Design Direction, for its work on a 15th Century Scottish castle. \nDespite having a huge portfolio and matching workload this firm is a one-woman show run by talented Melanie Brown who will go to the ends of the earth for her private clients. Quite literally. In this week’s business profile we spoke to Melanie and heard how she travelled to Paris and Turkey in her quest to kit out Borthwick Castle. Find out more here . Melanie Brown of Design Direction 8.35 KEY EVENT Security specialist Petards in £2m Siemens contract \nPetards, the AIM-quoted software developer of advanced security and surveillance systems, has been awarded a contract to supply Siemens Mobility Division with its Petards eyeTrain systems. \nThe contract has been placed under the framework agreement which provides Petards the opportunity to supply Siemens’ world-wide rail vehicle business with its train related products and services. \nThe order is for eyeTrain on-board digital CCTV systems that will be fitted to new Desiro City Electrical Multiple Unit (EMU) trains being built by Siemens. \nThe equipment to be supplied provides the trains and their drivers with enhanced security and surveillance systems through CCTV coverage, both inside and out of saloon areas. It also monitors to debris on the tracks. \nThe order is worth around £2m and work is already under way on delivering the contract. First deliveries will be made at the end of the first quarter of 2017 the whole project will be completed during 2018. \nPetards chairman Raschid Abdullah said: “We are delighted that Petards has secured yet another key contract under the global framework agreement with Siemens. \n“This provides us with yet another exciting rail project which further enhances our position in the rail industry and significantly strengthens the Group’s present order book for delivery in 2017 and 2018.” 8.30 KEY EVENT Fashion retailer creating 1,500 jobs \nASOS has announced plans to hire an additional 1,500 people over the next three years to work at its London headquarters. \nThe online fashion retailer said it has taken on an additional 40,000 square feet to house the extra workers and will spend £40m on renovating the space in Camden. \nASOS currently employs 2,500 people at Greater London House. \nBoss Nick Beighton said: “Our people are what make ASOS special. We are creating a workspace that fosters creativity, where they can enjoy what they do.”“Greater London House is such an important part of the company’s history, as well as Camden’s, so I’m thrilled that we get to stay in our home, while building a workplace for the future.” \nThe new Camden space, designed by architects Spacelab, will boast health and workout facilities, an ASOS training academy, a quiet zone library, cafes and eating areas and an auditorium for company-wide gatherings. Share", "external_links": [], "published": "2016-12-12T15:21:00.000+02:00", "crawled": "2016-12-12T11:14:55.427+02:00", "highlightTitle": ""}