{"organizations": [], "uuid": "8ccc24b710fc1b8845f2df4afcc3f132e98728ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article9825964.ece/ALTERNATES/s1200/JS69458320.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-construction-sector-looks-12381044", "country": "GB", "domain_rank": 21960, "title": "North East construction sector looks to build on growing positivity", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East construction sector looks to build on growing positivity", "spam_score": 0.0, "site_type": "news", "published": "2016-12-29T19:07:00.000+02:00", "replies_count": 0, "uuid": "8ccc24b710fc1b8845f2df4afcc3f132e98728ea"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-construction-sector-looks-12381044", "ord_in_thread": 0, "title": "North East construction sector looks to build on growing positivity", "locations": [], "entities": {"persons": [{"name": "ian baggett", "sentiment": "none"}, {"name": "taemar", "sentiment": "none"}, {"name": "richard ord", "sentiment": "none"}, {"name": "john wardropper", "sentiment": "none"}, {"name": "stepney yard", "sentiment": "none"}, {"name": "chris dancer", "sentiment": "none"}, {"name": "junior", "sentiment": "none"}, {"name": "jeff alexander", "sentiment": "none"}, {"name": "jason wood", "sentiment": "none"}, {"name": "jack redfern", "sentiment": "none"}, {"name": "baggett", "sentiment": "none"}, {"name": "julian weightman", "sentiment": "none"}, {"name": "stuart miller", "sentiment": "none"}, {"name": "richard wood", "sentiment": "none"}, {"name": "stephen mccoy", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "southdale", "sentiment": "none"}], "organizations": [{"name": "ceca", "sentiment": "none"}, {"name": "construction alliance northeast", "sentiment": "none"}, {"name": "colmans seafood temple", "sentiment": "none"}, {"name": "turney wylde construction", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "invalid email  journal business", "sentiment": "none"}, {"name": "civil engineering contractors association", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}, {"name": "northern counties builders federation", "sentiment": "none"}, {"name": "adderstone group share get", "sentiment": "none"}, {"name": "union studios", "sentiment": "none"}, {"name": "st james", "sentiment": "none"}, {"name": "adderstone group", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "gb group", "sentiment": "none"}, {"name": "brims construction", "sentiment": "none"}, {"name": "national federation of builders", "sentiment": "none"}, {"name": "koru property services", "sentiment": "none"}, {"name": "ceca north east", "sentiment": "none"}, {"name": "nfb", "sentiment": "none"}, {"name": "galliford try partnerships north east", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East construction sector looks to build on growing positivity Interest in the region is unprecedented, as investors from far afield seek to build here - but do local firms benefit? Share Property developer Ian Baggett, chairman of Adderstone Group Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJournal Business’ review of 2016 today takes in the construction industry, with Coreena Ford looking back at a busy year for the building trade. \nThe North East landscape is undergoing a rapid transformation, as the increased crane activity in Newcastle and the wider area will contest. \nIt’s hard to travel more far in the city centre without coming across development work, whether it’s for the continuing trend of student housing schemes, new shopping zones or, on a much smaller scale at the moment, to create much needed office space or industrial units. \nLast year several North East firms were affected by the collapse of built environment businesses, including GB Group, Koru Property Services, Southdale and Turney Wylde Construction, which had a knock-on effect as their failure filtered down their supply chains. \nThis year, however, while the market remains competitive, there is much more work to be had, though there are fears that regional businesses are missing out to larger contractors. Richard Ord, Junior, John Wardropper, Brims, Richard Ord, senior and Brims Construction director Jason Wood at the Colmans Seafood Temple (Photo: Brims) \nRichard Wood, director at Brims Construction, said the the market remains very competitive, but it has seen an increase in the size of tenders it was pricing at the end of the year compared to the start of the year. \nThe firm delivered a number of significant construction projects such as the exciting LiveWorks project on Newcastle Quayside. \n“Tender enquiries have also picked up in the last couple of months with several projects of £5m-plus currently being tendered,” he said. \n“It seems that a number of other local contractors are experiencing similar increases in tender activity. We think the market is picking up and hopefully this will continue to be the case.” \nStephen McCoy, managing director of Galliford Try Partnerships North East was also positive. \n“Fears that we’d crash into recession after the Brexit vote have not materialised,” he said, “and although there was a slow down in the work coming through for registered housing providers, due to funding changes, there are signs that this is now returning. \n“We were selected for development frameworks involving projects worth over £60m and partnerships looks set to remain the fastest growing part of the business. Most of our work is for the public sector and registered housing providers and I have to say they have been exemplary with payments. \n“Planning however remains an issue. Obviously development needs to be managed but currently it just takes far too long to obtain permission to build. This isn’t the fault of the planners – they have to work within the system that is in place – however, it is not one which enables developers to easily increase the numbers of new homes being built.” Cranes tower over St James' Park as building work continues near the home of Newcastle (Photo: Newcastle Journal) \nIan Baggett, owner and director of Adderstone Group said the group completed construction work on a raft of schemes including two major student and PRS projects – Stepney Yard and Union Studios – totalling 308 beds, while its construction division Taemar delivered a supermarket in Blyth for Lidl, with a further superstore to follow. \n“Reflecting on the main challenges of 2016, I suppose construction price inflation needs a mention,” said Mr Baggett. \n“From a group wide perspective, however, this was more than compensated for by increased appetite from international investors for sterling based assets outside the South East. The deals done in 2016 represented in excess of £50m foreign direct investment into Newcastle.” \nHe added: “Construction price inflation remains a concern, especially in the North East, where values are such that development in many sectors and locations is barely viable. The current level of interest in our city from international and domestic institutional investors is unprecedented. \n“Other cities in the Northern Powerhouse have proved very adept at attracting private sector inward investment in the last decade. We must continue to gather momentum if we are to avoid being left behind.” \nThis year saw the first full year of activity for the Construction Alliance Northeast (CAN), a body formed in November 2015 to represent more than 500 SMEs, to champion their interests in public sector tendering. The Construction Alliance Northeast (CAN) members: (back row) Julian Weightman (FMB), Jack Redfern (NFB) and Chris Dancer (CECA) with (seated) Jeff Alexander (NCBF) \nCAN is made up the four professional organisations involved – Northern Counties Builders Federation (NCBF), Federation of Master Builders (FMB), National Federation of Builders (NFB) and the Civil Engineering Contractors Association (CECA). \nJeff Alexander, CAN’s chair, said: “In the North East the market remains very competitive. \n“Having had a number of conversations with some of CAN’s member companies, as well as consultants and clients recently it is clear that, while the sector remains very competitive, many are reporting a high level of enquiries at the moment and this is rather pleasing. Overall I would say confidence in the medium to long term does seem to vary from company to company, with most being cautiously optimistic for the future.” Read More Energy review of the year: Bad year for coal and uncertainty over climate change \nStuart Miller, director and secretary for CECA North East, which is one of the four organisations that make up CAN, added: “CECA members are providing a mixed bag of responses, some say they are thriving and expanding at pace, others are still feeling the pain of the fall out from the hurt of larger contractors failing and having to write off large sums from their balance sheets. \n“Certain specialist sectors, mainly SMEs, see sustainable growth in 2017 and beyond but other, larger businesses are less confident. \n“The whole membership agrees that procurement remains costly and whilst there are signs that local SME businesses are gaining greater access to the potential pipeline, it still falls well short of what has been promised. \n“Low margins and slow payment still hamper the industry which continues to prevent confident investment in skills and equipment.” Like us on Facebook", "external_links": [], "published": "2016-12-29T19:07:00.000+02:00", "crawled": "2016-12-29T14:27:58.244+02:00", "highlightTitle": ""}