{"organizations": [], "uuid": "c8952c4725849142d6e7c2ff4e680053359a066b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9395138.ece/ALTERNATES/s1200/JS64007812.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-housebuilder-bellway-starts-buying-12314211", "country": "GB", "domain_rank": 21960, "title": "Newcastle housebuilder Bellway starts buying land again", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle housebuilder Bellway starts buying land again", "spam_score": 0.0, "site_type": "news", "published": "2016-12-13T21:19:00.000+02:00", "replies_count": 0, "uuid": "c8952c4725849142d6e7c2ff4e680053359a066b"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-housebuilder-bellway-starts-buying-12314211", "ord_in_thread": 0, "title": "Newcastle housebuilder Bellway starts buying land again", "locations": [], "entities": {"persons": [{"name": "ted ayres", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bellway", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle housebuilder Bellway starts buying land again The firm has also snapped up 40 sites, having initially put off land purchases after the Brexit vote Share Get business   Thank you for subscribing!   \nThe robust housing market shows no signs of slowing after Newcastle housebuilder became the latest property firm to cheer the resilient market in the face of Brexit uncertainty. \nThe business said it has seen strong sales in the 18 weeks from August 1 to December 4 with a 7% increase in the reservation rate to 176 per week, up from 165 this time last year. \nHousing completions for the full year to 31 July 2017 are expected to increase by around 5%. \nMeanwhile, the business is continuing to invest in sites to secure further growth, spending £263m in the period - £28m more than it expended in the same period in 2015 – having initially put purchases on hold around the EU referendum. \nBellway said the move to restart land-buying has seen the group snap up 40 new sites to develop. \nThe group said site visitor numbers and hits to the group’s website were both ahead of last year, while its cancellation rate stood at 11%, edging up slightly on the 10% rate seen a year earlier. Ted Ayres, Bellway chief executive \nIt said sale prices were firm across its regions and was “stable and robust” in London, where it focuses on affordable homes and has been shielded from a tough market for high-end properties. \nAn interest rate cut to 0.25% in August and moves by the Bank of England to bolster borrowing following the vote to quit the EU has helped support the housing market, according to Bellway. \nThe Government’s Help to Buy equity loan scheme for first-time buyers has also continued to boost the sector, with 37% of reservations made through the initiative. \nAs previously announced, the board is recommending a final dividend of 74p per share - a significant lift on the comparable period’s 52p per share, which will result in a record full-year dividend for the year ended July 31 of 108p per share. Read More Cuts to planning will make housing targets impossible, analysts warn \nShares rose nearly 3% after the update. \nBellway chief executive Ted Ayres said: “The group has made an encouraging start to the financial year and customer demand for new homes continues to be robust. \n“The strength of the underlying housing market supports further growth and this, together with Bellway’s strong balance sheet and significant operational capacity, ensures that the group is well positioned to continue its disciplined growth strategy.” Like us on Facebook", "external_links": [], "published": "2016-12-13T21:19:00.000+02:00", "crawled": "2016-12-13T16:37:16.080+02:00", "highlightTitle": ""}