{"organizations": [], "uuid": "b9ef2c73141c23b1b9e7929b73348f45cff239ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12382577.ece/ALTERNATES/s1200/Sports-Direct-results.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-sports-directs-grilling-review-12382397", "country": "GB", "domain_rank": 21960, "title": "From Brexit to Sports Direct's grilling: A review of the 2016 political year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "From Brexit to Sports Direct's grilling: A review of the 2016 political year", "spam_score": 0.0, "site_type": "news", "published": "2016-12-31T15:00:00.000+02:00", "replies_count": 0, "uuid": "b9ef2c73141c23b1b9e7929b73348f45cff239ae"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-sports-directs-grilling-review-12382397", "ord_in_thread": 0, "title": "From Brexit to Sports Direct's grilling: A review of the 2016 political year", "locations": [], "entities": {"persons": [{"name": "david cameron", "sentiment": "negative"}, {"name": "anne-", "sentiment": "neutral"}, {"name": "rob browne", "sentiment": "none"}, {"name": "roberta blackman-woods", "sentiment": "none"}, {"name": "lauren", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "caroline lucas", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "jonathan bartley", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}, {"name": "len mccluskey", "sentiment": "none"}, {"name": "marie trevelyan", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "grahame morris", "sentiment": "none"}, {"name": "owen smith", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "ed miliband", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "kevan jones", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "angela eagle", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "jo cox", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "natalie bennett", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "durham city centre", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "easington", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "north east of brexit", "sentiment": "none"}, {"name": "druridge bay", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "berwick conservative", "sentiment": "negative"}, {"name": "green party", "sentiment": "none"}, {"name": "labour durham", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "durham miners", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "north durham", "sentiment": "none"}, {"name": "labour  labour", "sentiment": "none"}, {"name": "sunderland west", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "durham miners gala", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "durham cricket club", "sentiment": "none"}, {"name": "green party  the green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "David Cameron speech in full after Brexit Share this video Watch Next \nBerwick Conservative MP Anne-Marie Trevelyan also backed the Leave campaign. \nDavid Cameron agreed a “deal” with other EU nations in February, including some very limited restrictions on benefits that EU migrants could claim. \nThe referendum campaign got under way properly with confirmation that a vote would be held on June 23 - and Mr Cameron suffered a major blow when high-profile London mayor Boris Johnson came out in favour of quitting. \nWe heard a series of horror stories about the potential impact on the North East of Brexit. The region’s universities would lose funding and firms such as Nissan might stop investing, we were told. \nBut Mr Johnson visited the North East in April, where he said: “EU membership costs the North East half a billion pounds every single year.” \nCampaigning briefly halted after Yorkshire MP Jo Cox was murdered in her constituency in June. Prime Minister David Cameron speaks outside 10 Downing Street, London (Photo: Lauren Hurley/PA Wire) \nDavid Cameron had always been confident of winning the EU referendum. He would never have held the vote if he thought he might lose. \nBut as the results came in, in the early hours of June 24, it was soon clear he’d miscalculated. \nNewcastle was the first council in the country to declare. And it was a win for Remain, but not by much, with 65,404 people in the city voting to stay in the EU and 63,598 voting to Leave. \nRemain campaigners had expected a bigger margin of victory than that. \nAt 4am that morning, the BBC announced that although counting continued in some parts of the country, it was clear the Leave campaign had won. \nDavid Cameron announced later that same morning that he was resigning as Conservative leader and Prime Minister. \nMeanwhile, Labour politicians were furious with their leader, Jeremy Corbyn, claiming he’d campaigned only half-heartedly to stay in the EU. Labour \nLabour was a divided party throughout 2016, although the in-fighting reduced significantly after Jeremy Corbyn was elected leader for a second time in September. \nThere was an early sign of things to come when North Durham MP Kevan Jones resigned as a Shadow Defence Minister in January, saying he wanted to be free to make the case for the renewal of the Trident nuclear weapons system. \nLater that same month, Newcastle North MP Catherine McKinnell resigned as Shadow Attorney General. She cited a desire to spend more time with her family but also accused Mr Corbyn of taking the party down “an increasingly negative path”. The Durham Miners Gala takes place in Durham City Centre. Colliery banners are paraded to the Durham Cricket Club green where Jeremy Corbyn address the crowds who support his campaign \nBut the announcement that Mr Corbyn had accepted an invitation to attend the Durham Miners’ Gala illustrated why his supporters back him. \nHe was the first Labour leader to attend the gala for four years, after his predecessor, Ed Miliband, turned up in 2012. Tony Blair and Gordon Brown never made it at all. \nThere was an ongoing row over claims of anti-Semitism within the party. Newcastle MP Chi Onwurah said in April that Labour does not have a “widespread problem” with anti-Semitism but said the party must confront the small number of anti-Semites in its ranks. \nBut the divisions came to a head after the EU referendum. \nA series of Labour MPs resigned from the party’s front bench. They included City of Durham MP Roberta Blackman-Woods , who quit her post as a Shadow Local Government Minister, and Washington and Sunderland West MP Sharon Hodgson, who resigned her post as Shadow Minister for Children and Families. \nLabour MPs voted for a motion saying they had no confidence in their leader. Angela Eagle \nAnd former Shadow Business Secretary Angela Eagle prepared to launch a leadership challenge - before colleagues decided they’d prefer Labour MP Owen Smith to take on Mr Corbyn instead. \nMr Corbyn was backed by North East MPs such as Blyth Valley MP Ronnie Campbell and Easington MP Grahame Morris. \nWhen the votes were counted in September, Mr Corbyn was the clear winner. \nIt meant a promotion for Newcastle East MP Nick Brown, who returned to the top level of politics as the new opposition chief whip. \nHowever, opposition to Mr Corbyn continues. \nLen McCluskey, leader of trade union Unite and an ally of Mr Corbyn, announced in December that he would resign, triggering a leadership contest in 2017 when he will stand again. Labour “moderates” hope they will succeed in replacing him. Conservatives Boris Johnson and Theresa May \nThe Conservatives got their leadership contest out of the way quickly following David Cameron’s resignation decision. \nBoris Johnson, seen by many as the favourite, announced he wasn’t standing after all. \nHis former friend, Michael Gove, ruined what chances he had when he attacked Mr Johnson in what was seen as an act of disloyalty. \nFormer Energy Minister Andrea Leadsom quit the contest after she was criticised, perhaps a little unfairly, for appearing to make a comment about Theresa May having no children. \nIt meant Mrs May, the former Home Secretary, was the only candidate in the race - and she was duly crowned party leader and Prime Minister. \nShe quickly stamped her mark on the party, promising at the Conservative conference in October to take on business fat cats and to get tough on immigration. \nThe populist approach was her response to the mood of the country revealed, as she saw it, in the EU referendum result. Green Party Natalie Bennett, Leader of the Green Party \nThe Green Party set out plans for an economically self-reliant North as leader Natalie Bennett visited the proposed site of the Druridge Bay coal mine in Northumberland in January \nShe said she would invest in Northern manufacturing to ensure that the region was less dependent on London, and would improve links between large Northern cities. \nGreen MP Caroline Lucas and Jonathan Bartley took over as the party’s joint leaders in September. The economy Generic image of the 'living wage' which is £7.65 (Photo: Rob Browne) \nThe economy of the North East is booming in many respects - but the region also continued to suffer extreme poverty. \nBusinesses in the North East were revealed as the UK leaders when it comes to exporting to China and India, Government figures showed in January. \nThe Government’s living wage, effectively a 50p increase in the minimum wage for people aged 25 and over, came into effect in April. \nA quarter of Northumberland employees received a pay rise, the Government said. Good news, although it partly reflects the number of people on low wages to start with. \nBut the region continued to have the worst unemployment level in the country throughout the year. \nAnd North East MPs highlighted the challenges facing the region in a series of Commons speeches. \nLabour Durham MP Roberta Blackman-Woods said people in the Northern Powerhouse were “now facing a choice between food or a roof over their head”. \nIt came after figures from charity Shelter showed that 1.8 million people across the North will struggle to heat their home and pay their rent or mortgage this month. \nBut it wasn’t only Labour that expressed concern about people struggling to get by. \nConservative Anne-Marie Trevelyan, MP for Berwick-upon-Tweed, warned that cuts to housing benefit known as the bedroom tax had left some Northumberland families without a suitable home. \nAnd the Bishop of Durham spoke out against poverty, and led the House of Lords in defeating Government plans to scrap child poverty targets. \nMembers of the Lords backed his proposal to force Ministers to present a report to Parliament each year setting out the percentage of households in low income households. Devolution", "external_links": [], "published": "2016-12-31T15:00:00.000+02:00", "crawled": "2016-12-31T10:12:39.005+02:00", "highlightTitle": ""}