{"organizations": [], "uuid": "a9228a4e6dee6b9623e7ac5f19008029862e30b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30020029/15770401.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/new-year-s-hopes-for-leicester-in-2017/story-30020029-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "New Year's messages from Leicester's leaders and sports bosses | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "New Year's messages from Leicester's leaders and sports bosses | Leicester Mercury", "spam_score": 0.006, "site_type": "news", "published": "2016-12-31T17:02:00.000+02:00", "replies_count": 0, "uuid": "a9228a4e6dee6b9623e7ac5f19008029862e30b2"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/new-year-s-hopes-for-leicester-in-2017/story-30020029-detail/story.html", "ord_in_thread": 0, "title": "New Year's messages from Leicester's leaders and sports bosses | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "suleman nagdi", "sentiment": "none"}, {"name": "claudio ranieri", "sentiment": "none"}, {"name": "peter soulsby", "sentiment": "none"}, {"name": "simon cole", "sentiment": "none"}, {"name": "neighbours", "sentiment": "none"}, {"name": "richard cockerill", "sentiment": "none"}, {"name": "melton", "sentiment": "none"}, {"name": "nick rushton", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "premiere league", "sentiment": "none"}, {"name": "lord willy bach  police", "sentiment": "none"}, {"name": "federation of muslim organisations", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester tigers", "sentiment": "none"}, {"name": "nspcc", "sentiment": "none"}, {"name": "leicestershire county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New Year's messages from Leicester's leaders and sports bosses By Leicester Mercury | Posted: December 31, 2016 0 COMMENTS SHARES New Year's messages from Leicester's leaders and sports bosses X \nCopy link to paste in your message / Comments (0) \nChief Constable Simon Cole: \n\"The 180th year of policing in Leicester, Leicestershire and Rutland is at an end and I just want to take this opportunity to say 'thank you' on behalf of everyone in the force. \n\"To the members of the public, to those involved in Neighbourhood Watch, to our cadets and to our Special Constables, to everyone in every community that has worked with us in 2016, thank you. \n\"2016 is probably a year that history will not remember very fondly, but for us it's been a year in which we have been able to build partnerships and work together with local people to make our community safer. \n\"That's been really important and, without the help of the one million of you, the 3,500 of us would get nowhere.\" \nLord Willy Bach \nPolice and Crime Commissioner for Leicestershire: \n\"The start of a new year is a time full of promise and opportunity. \n\"Personally, I believe that in 2017 we can build on some of the groundwork established over the past 12 months. \n\"This new year will see my police and crime plan become a reality, with more visible and accessible policing, an enhanced non-emergency (101) call handling service, improved, tailored support for victims of crime and, above all, a real focus on prevention. \n\"It's quite simple. Pre-emptive action will see fewer lives traumatised by crime and the demand on all public services reduced. \n\"And my ambitions for the coming year? \n\"Like most people I am hoping for tolerance, peace and respect in a world where we embrace difference, where vulnerable members of our society are appropriately supported and where repeat offenders are helped out of the revolving door of crime and punishment. \n\"A world where people live and work without fear of crime and one where people have even greater confidence and satisfaction in their police service. \n\"I wish you all a very happy, health and successful 2017. I look forward to working with you to make Leicester, Leicestershire and Rutland a safer place for all our diverse communities. \nRead More: Sharp rise in calls to NSPCC helpline \nClaudio Ranieri \n\"2016 will be a year that my players and I, along with the whole city of Leicester, will remember forever. Maybe it will take some years, when I am old man, before I can truly appreciate what happened. Together – through the collective spirit of our fans, our owners, players and staff – we achieved something magical, brought a lot of happiness to a lot of people and reintroduced Leicester to the world. I hope that, in 2017, we can continue to build a strong future for Leicester City and to make our city proud. Keep dreaming!\" \nRichard Cockerill \nDirector of rugby, Leicester Tigers \n\"On behalf of the players, coaches and staff at the Leicester Tigers, I'd like to pass on our wishes for a very Happy New Year to all of the readers of the Leicester Mercury. All the best for the new year and, to everyone in this great sporting city of Leicester, I hope you all have plenty to celebrate in 2017.\" \nConservative Leicestershire County Council leader Nick Rushton \n\"I would like to wish everyone a Happy New Year in 2017. \n\"Despite our funding problems, the council has achieved a lot in 2016 and will continue to deliver in 2017. \n\"We're providing services in new ways, whether it's supporting communities to run libraries or joining-up health and social care services, like the new Light Bulb housing support service. \n\"We're always campaigning to get the best deal for Leicestershire, whether it's lobbying for fair funding or working with our district council colleagues on a combined authority, to seek extra devolved powers from Government. \n\"And we're working hard to boost the economy – we've already won Government backing to draw up plans for a Melton relief road and we've rolled out superfast broadband to 96 per cent of the county's population. \n\"The New Year will bring lots of uncertainties, with May's county elections and the unpredictable impact of Brexit and a new US president. \n\"One thing is certain - the county council is well-placed to make the most of any opportunities and adapt to changing circumstances.\" \nRead More: Neighbours rally round to help fire family \nLabour mayor of Leicester Sir Peter Soulsby \n\"As New Year approaches Leicester is still basking in what was probably the best present we've ever had – our first ever Premiere League win. \n\"There is still a buzz about the place, and there is no doubt the whole city has benefited from the football club's astonishing achievement. \n\"In 2015 we were celebrating the reinterment of King Richard lll – another huge event which saw the eyes of the world turn upon us. \n\"They say that good things come in threes. \n\"Let's hope that 2017 is another good year for our city. \n\"I wish you all a peaceful New Year.\" \nSuleman Nagdi MBE DL, Federation of Muslim Organisations: \n\"In light of the many challenges we have seen in 2016, from war torn countries, misplaced people, changes in government and world order, I ask that you all enter the New Year with a renewed positive determination. \n\"Let us look for the opportunities for individuals, groups and nations to see the need to work together for the betterment of greater humanity. \n\"The world has changed so deeply that we will undoubtedly encounter difficulties in the year ahead, however we must resolve to work together towards eradicating the suffering of those in poverty, trapped in war and conflict and especially those suffering the effects of natural disasters. \n\"The great British public has always worked tirelessly and donated generously to help alleviate the humanitarian suffering at home and abroad. I humbly ask that you all continue in this cause for the foreseeable future. \n\"I pray these thoughts remain with us during our day-to-day lives and that we all continue with energy and enthusiasm. \n\"Wishing you peace in 2017.\" ", "external_links": [], "published": "2016-12-31T17:02:00.000+02:00", "crawled": "2016-12-31T12:35:13.360+02:00", "highlightTitle": ""}