{"organizations": [], "uuid": "827b25fbda84c4bfb235aaa8b305e5131d40c297", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12332055.ece/ALTERNATES/s1200/GWR_-NJL_161216thompson_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/accountants-kpmg-see-profits-drop-12331963", "country": "GB", "domain_rank": 21960, "title": "Accountants KPMG see profits drop as it invests in new technology", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Accountants KPMG see profits drop as it invests in new technology", "spam_score": 0.0, "site_type": "news", "published": "2016-12-16T20:58:00.000+02:00", "replies_count": 0, "uuid": "827b25fbda84c4bfb235aaa8b305e5131d40c297"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/accountants-kpmg-see-profits-drop-12331963", "ord_in_thread": 0, "title": "Accountants KPMG see profits drop as it invests in new technology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Accountants KPMG see profits drop as it invests in new technology The company's Newcastle office reported a successful year with particular strength in its mergers and acquisitions team Share Mick Thompson, KPMG (Photo: sent by KPMG as publicity handout) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nKPMG has reported a dip in full-year profits as it ramped up tech investments, but the Government’s lack of clarity around Brexit has provided a boost for business. \nThe accountancy giant, which has a major office in Newcastle , said “essential” investments in IT and technology were among the costs that prompted a 2% drop in pre-tax profit to £374m for the 12 months to September 30. \nTurnover, meanwhile, rose nearly 6% to £2.07bn. \nKPMG’s Newcastle office senior partner Mick Thompson said 2016 had been a transformational year, both for the firm and for many of the companies it works with. \nHe said: “The Newcastle office has had an excellent year with a raft of engagements across a multitude of disciplines supported by cross functional expertise in the Enterprise market. \n“In particular, our M&A teams have had a stellar year advising on some of the region’s key transactions, involving Kitwave Wholesale Group, North East Convenience Stores, ZyroFisher and Kids 1st Nurseries, and have been named corporate finance team of the year. \n“We’ve appointed four new directors and launched new service lines including our hugely successful enterprise offering. The reason we are investing is that, although the North East is a relatively mature market, we see boundless opportunities ahead. The growth of the area’s tech sector is exciting and more broadly the place is a hive of entrepreneurial activity, which we’re involved in through our support for accelerator Entrepreneurial Spark. Read More Low-carbon engineering firm Sevcon posts record sales of £40m \n“We also anticipate opportunities created by the devolution and Northern Powerhouse agendas, encompassing public/private sector partnerships, funding collaborations, infrastructure investments and restructuring. \n“A common thread running through the majority of our focus for the next 12 months is transformation. We will continue to work closely with organisations, large and small, from across sectors including tech, retail, financial services and of course the public sector; all parts of the economy responding to disruption and reinvention. \n“And we will continue to transform and broaden our own capabilities, combining new technologies and our breadth of experience to help clients with issues around data security, privacy and customer experience.” \nKPMG’s UK chairman Simon Collins said that the company was at a “crossover period” and said revenue would start outstripping corporate investments over the next calendar year. \nHe highlighted the performance of the company’s specialist Brexit unit, which has been advising businesses on immigration, tax and supply chain management in the wake of the referendum. \n“Our clients need the navigation and the insight more because there’s not a clear path for them,” Mr Collins said. Read More North East farmers offered grants for natural flood management projects \nWhen asked whether the lack of Governmental direction on Brexit had caused companies to seek out KPMG’s advice at a higher rate, he said it was ultimately a “benefit” to KPMG. \n“Yes, I think whenever there’s uncertainty, or whenever options need evaluating, or you need insight based on experience of operating in other countries ... then people turn for clear and objective advice.” \nEarlier this week, KPMG’s International business reported an 8% rise in full-year global turnover to $25.42bn (£20bn). \nIt comes after sector peer EY saw turnover leap 9% $29.6bn (£23.3bn) in the year ending June 30. \nPwC reported a 7% rise in global revenues to $35.9bn (£28.2bn) over the past year, while Deloitte posted an 8% rise in annual revenues to $36.9bn (£28.9bn). Like us on Facebook", "external_links": [], "published": "2016-12-16T20:58:00.000+02:00", "crawled": "2016-12-16T16:15:04.020+02:00", "highlightTitle": ""}