{"organizations": [], "uuid": "0f0b64c0d2d41b1c15277a689313bd608f9e0930", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.skegnessstandard.co.uk/webimage/1.7638016.1481192272!/image/image.jpg", "site_section": "http://www.skegnessstandard.co.uk/rss/cmlink/1.346949", "section_title": "Skegness Standard Feed", "url": "http://www.bostonstandard.co.uk/news/boston-and-skegness-mp-backs-government-plans-for-brexit-1-7721692", "country": "GB", "title": "Boston and Skegness MP backs Government plans for Brexit", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "Boston and Skegness MP backs Government plans for Brexit", "spam_score": 0.0, "site_type": "news", "published": "2016-12-08T17:19:00.000+02:00", "replies_count": 0, "uuid": "0f0b64c0d2d41b1c15277a689313bd608f9e0930"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/boston-and-skegness-mp-backs-government-plans-for-brexit-1-7721692", "ord_in_thread": 0, "title": "Boston and Skegness MP backs Government plans for Brexit", "locations": [], "entities": {"persons": [{"name": "danie", "sentiment": "none"}, {"name": "matt warman", "sentiment": "none"}, {"name": "north hykeham", "sentiment": "none"}, {"name": "warman", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "sleaford", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "government", "sentiment": "none"}, {"name": "skegness", "sentiment": "none"}, {"name": "brexit boston", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boston and Skegness MP backs Government plans for Brexit Boston and Skegness MP Matt Warman By Daniel Jaines Have your say \nThe Boston and Skegness MP has thrown his support behind the Government’s plans for Brexit. \nMatt Warman spoke during the debate in the House of Commons last night (Wednesday) which saw MPs vote 461 to 89 to start the Brexit process by March. I hope that, through this debate, the message goes back loud and clear, both to Boston and Skegness and to Sleaford and North Hykeham, that Parliament will not seek to set the Government up to deliver anything other than the best possible deal for the UK by asking them to put all their cards on the table, and that we will trigger article 50 by the end of March. Boston and Skegness MP Matt Warman \nMr Warman, who has recently been campaigning with fellow Conservatives for the Sleaford and North Hykeham, told the house that there was a single line on the doorsteps of Lincolnshire ‘that honest, decent voters use again and again’. \n“They doubt that the Government will deliver on their word and trigger article 50 by the end of March. They say firmly that the Prime Minister is the right person to do it, but the Lincolnshire public doubt that politicians in the House are on their side.” \nHe added: “I hope that, through this debate, the message goes back loud and clear, both to Boston and Skegness and to Sleaford and North Hykeham, that Parliament will not seek to set the Government up to deliver anything other than the best possible deal for the UK by asking them to put all their cards on the table, and that we will trigger article 50 by the end of March. \n“We on the Conservative Benches know that that is the right thing to do, and Members on other Benches or those in the Supreme Court seeking to make a different case should accept that to take another view is to go further than questioning Brexit: it is playing with the fundamental principle of democracy that the people must decide.” \nHe further told the court, and remainers, that the European Referendum was ’not lost in six weeks’ \n“It was lost over years and decades. We in the House govern with the consent of the people. To maintain that consent all of us must bear in mind the fact that we laid out a case in June. \n“Now we must make sure, unused as some of us are to doing so, that we do as we are told. Not doing so risks far more than our relationship with Europe.” \nMPs backed a motion by Labour’s calling on the government to publish a plan and for Parliament to ‘properly scrutinise’ it. \nA vote to amend the main motion added that the timetable for triggering Article 50 of the Lisbon Treaty, be supported. \nMr Warman voted in favour on both counts. Sign in", "external_links": [], "published": "2016-12-08T17:19:00.000+02:00", "crawled": "2016-12-08T20:29:09.282+02:00", "highlightTitle": ""}