{"organizations": [], "uuid": "49b3a3fd33fdea5df19578f4b89fea909556043d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12063306.ece/ALTERNATES/s1200/JS29615502-1.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-businesses-demand-voice-12316121", "country": "GB", "domain_rank": 21960, "title": "North East businesses demand their voice be heard in Brexit negotiations", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East businesses demand their voice be heard in Brexit negotiations", "spam_score": 0.0, "site_type": "news", "published": "2016-12-14T01:00:00.000+02:00", "replies_count": 0, "uuid": "49b3a3fd33fdea5df19578f4b89fea909556043d"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-businesses-demand-voice-12316121", "ord_in_thread": 0, "title": "North East businesses demand their voice be heard in Brexit negotiations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "North East businesses demand their voice be heard in Brexit negotiations Local business leaders met with the government select committee for leaving the EU in Sunderland last week Share Councillor Paul Watson, leader of Sunderland City Council Share Get business   Thank you for subscribing!   \nNorth East business leaders demanded that their voice be heard when they met with the Government’s committee for Exiting the European Union. \nThe cross-party committee, chaired by Hilary Benn MP, travelled to Sunderland’s Civic Centre to meet with business and civid leaders in the region about their concerns on Brexit. \nFollowing June’s referendum on Brexit, Sunderland residents voted overwhelmingly in favour to leave the EU. \nProviding evidence to the committee alongside Sunderland Council leader Paul Watson was director of policy at the North East Chamber of Commerce Ross Smith, head of policy and strategy of the North East Local Enterprise Partnership Richard Baker, and John Elliot, executive chairman of County Durham manufacturing firm Ebac. \nMr Smith told the hearing: “It’s vital that the voice of businesses in this region does get heard, that communication is two way, and they do get to understand the process that is undertaken. \n“Just by dint of geography we can feel quite distant from that at times and that is why we welcome the visit of your committee today.” Read More Blaydon town centre to get major upgrade in move that will create hundreds of jobs \nOne of the issues facing North East businesses following Brexit, Mr Smith said, would be the ability for small company’s to enter the export market. \nFor businesses wishing to export their goods and services overseas the EU was seen as an accessible first step due to the UK’s membership. \nMr Baker said: “One of the key priorities for the UK as a whole, but particularly for regions like the North East, is to support small businesses to scale-up. If you look at all of the evidence that’s out there, CBI published a report that showed that finding ways to help businesses export boosts their productivity and competitiveness quite significantly. \n“The ability to gently enter into an exporting position by going through a relatively less difficult trading environment like the EU, compared with more stringent regimes, is absolutely key in moving people into global exporting.” \nThe panel also raised concerns about the availability of information that will need to be distributed to businesses in order for company’s to accurately price their goods. \nCurrent trade tariffs are determined by the UK’s EU membership meaning that these tariffs will change after Brexit. The panel called for information to be rapidly passed to company’s so business leaders could accurately determine costs. Like us on Facebook", "external_links": [], "published": "2016-12-14T01:00:00.000+02:00", "crawled": "2016-12-13T20:37:59.976+02:00", "highlightTitle": ""}