{"organizations": [], "uuid": "11fe69f8d0c89d8eff0fea7f567ef1abf0dcad5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12301576.ece/ALTERNATES/s1200/Thomas-Mair-trial.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jo-cox-killing-not-only-12301599", "country": "GB", "domain_rank": 21960, "title": "Jo Cox killing will not be the only one if poisonous post Brexit atmosphere continues", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Jo Cox killing will not be the only one if poisonous post Brexit atmosphere continues", "spam_score": 0.0, "site_type": "news", "published": "2016-12-10T23:00:00.000+02:00", "replies_count": 0, "uuid": "11fe69f8d0c89d8eff0fea7f567ef1abf0dcad5f"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jo-cox-killing-not-only-12301599", "ord_in_thread": 0, "title": "Jo Cox killing will not be the only one if poisonous post Brexit atmosphere continues", "locations": [], "entities": {"persons": [{"name": "jo cox", "sentiment": "negative"}, {"name": "mrs cox", "sentiment": "none"}, {"name": "batley", "sentiment": "none"}, {"name": "mair", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "anna sourby", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "thomas mair", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "birstall", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "west yorkshire", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jo Cox killing will not be the only one if poisonous post Brexit atmosphere continues People raising any concerns about triggering article 50 are being treated like public enemies Share News Opinion Jo Cox, who died after being shot and stabbed in the street outside her constituency advice surgery in Birstall, West Yorkshire (Photo: Yui Mok/PA Wire)   Thank you for subscribing!   \nThere’s going to be another Jo Cox type of killing if the temperature isn’t turned down in the post Brexit era . \nThe problem is stirring the pot is good for business in the cynical world of newspapers which are fighting to survive and those doing it, consciously or otherwise, think they are onto a good thing. \nMrs Cox, MP for Batley and Spen, was shot and stabbed to death a week before the EU referendum vote by Thomas Mair who shouted ‘Britain first’ as he attacked the mum-of-two. \nAnyone who thinks there is no link between Jo Cox’s death and the poisonous Leave campaign is deluding themselves. \nProsecutors said Mair was motivated by hate and his crimes were “nothing less than acts of terrorism ”. It takes little for people as unbalanced as Mair to find a grievance to act upon and certain newspapers are, however much they may deny it, fanning the flames. Thomas Mair (Photo: West Yorkshire Police/PA Wire) \nLast week Anna Soubry, a Remain-supporting Conservative MP was reportedly the target of a tweet which said “Someone jo cox Anna sourby (sic) please”. \nHer crime was to demand greater clarity from the government on its Brexit plans before she could back the triggering of article 50 to leave the E . \nThen just a few days later, a Commons vote on this precise issue was held. \nIn a bid to see if the government did actually have a clue, Labour put forward a motion to commit Theresa May to “publishing the Government’s plan for leaving the EU before Article 50 is invoked”. \nThe Tories agreed to this but with an amendment which “calls on the Government to invoke Article 50 by 31 March 2017”. \nIt was characterised by some as a ‘People v Establishment’ face-off. It was passed by 461 votes to 89. \nThis wasn’t a big enough win for one paper which wants total victory above all things for England. It asked its readers: ‘Was YOUR MP one of the 89 who voted against the will of the British people?’ \nIt then printed the names of the 89 MPs, the only thing lacking was pics of their faces with ‘cross hairs’ on top. \nAs has become evident, there was no plan among Leave campaigners before the referendum as to what to do if they won. And there is little evidence, nearly six months on, that there is one now. \nFor too long the government has benefitted from the media campaign which has slaughtered anyone who has raised a concerns about triggering article 50 without proper consideration. \nIt was left to a businesswoman to take the case to the Supreme Court to ensure any plan to invoke article 50 is debated by our MPs - ie do the job they are democratically elected to do. \nIt seems the government has become back seat drivers when it comes to Brexit - with alarming and hateful results. Like us on Facebook", "external_links": [], "published": "2016-12-10T23:00:00.000+02:00", "crawled": "2016-12-10T18:49:51.471+02:00", "highlightTitle": ""}