{"organizations": [], "uuid": "11682136aca63eddb9a75fc0ea2befe6d03c452b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12311402.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/food-drink-news/food-georges-great-british-kitchen-12311386", "country": "GB", "domain_rank": 21960, "title": "Food at George's Great British Kitchen is delicious — so why didn't we enjoy our visit?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Food at George's Great British Kitchen is delicious — so why didn't we enjoy our visit?", "spam_score": 0.0, "site_type": "news", "published": "2016-12-13T15:29:00.000+02:00", "replies_count": 0, "uuid": "11682136aca63eddb9a75fc0ea2befe6d03c452b"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/whats-on/food-drink-news/food-georges-great-british-kitchen-12311386", "ord_in_thread": 0, "title": "Food at George's Great British Kitchen is delicious — so why didn't we enjoy our visit?", "locations": [], "entities": {"persons": [{"name": "factfile  george", "sentiment": "none"}, {"name": "jane austen", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "tony hall", "sentiment": "none"}, {"name": "morrissey", "sentiment": "none"}, {"name": "george", "sentiment": "none"}, {"name": "katsu", "sentiment": "none"}], "locations": [{"name": "george's great british kitchen", "sentiment": "none"}, {"name": "eldon square", "sentiment": "none"}, {"name": "great british kitchen george", "sentiment": "none"}, {"name": "grey's quarter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "kitchen  grey’s quarter", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}], "organizations": [{"name": "brighton bloomer", "sentiment": "none"}, {"name": "newcastle restaurant week", "sentiment": "none"}, {"name": "uk independence party", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Food at George's Great British Kitchen is delicious — so why didn't we enjoy our visit? The assault-on-the-senses atmosphere at one of Eldon Square's new offerings threatens to overpower its tasty dishes George's Great British Kitchen George's restaurant in Grey's Quarter, intu Eldon Square (Photo: Tony Hall Photography) Share Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nGiving George’s Great British Kitchen, one of the new offerings from Eldon Square’s restaurant quarter , a fair star rating has proven rather tricky. \nOn the one hand, I had an excellent meal. On the other hand, I didn’t enjoy eating there. \nThat’s mostly down to the fact that the restaurant feels like it was decorated by members of the UK Independence Party who’ve teamed up with a group of moustachioed hipsters who wanted to make the place “quirky”. \nIt’s an assault on the senses. The bar area is a sort of faux country house, before we’re transported to the seaside, with tables inside beach houses and huge fish-shaped cushions; there’s a check table cloth filled picnic area; another area features railings covered in bowler hats perched at jaunty angles. Read More When is Newcastle Restaurant Week? This time more than 100 places are taking part \nThe music is loud to the point of being intrusive, with a playlist hopping confusingly from Christmas songs to the Beatles to weird pop mash-ups. \nThe “proper British” menu, which is presented like a “good old fashioned” newspaper, enthusiastically declares things to be “ruddy marvellous” or “rather splendid and jolly”. \nOn the back of the drinks menu, classic figures from British history pose for selfies, and we’re treated to a parody of Winston Churchill’s Twitter account. \nThe whole thing feels like a Great Britain theme park aimed a tourists who’ve never actually visited the UK, and is suffused with nostalgia for the sort of 1950s seaside holiday which probably never really existed. Anything to drink? The cocktails proved underwhelming \nWe opened our tab with a pair of cocktails — affordable enough at two for £12 if you visit between 5pm and 7pm in the week, hovering around the £8 mark ordinarily. \nThese promised much, but while my Brighton Bloomer – a fancy gin and lemonade – was sweet and fruity, I was hoping for a more complex, sour taste. The Boozy Iced Tea was actively disappointing, served watery and weak. \nIf you don’t fancy the cocktails, there’s a selection of wines and beers on draft, as well as some craft gins, which sound delicious but will set you back £7.85 for a double G&T. How were the starters? A generous starter of goats cheese fritter \nOnce the food arrived, we started to feel a lot more positive about George and his kitchen. \nMy goats cheese fritters was a huge portion — possibly too big, but I wasn’t complaining — of tangy cheese fried in one of the most delicate, crispy batters I’ve tasted, gently flavoured with a smokey hint of paprika. It was accompanied by sharp pickles and a lovely beetroot chutney with a slight aniseed taste. The chicken goujon starter \nKatsu chicken goujons were also excellent — crunchy panko breadcrumbs were spicy enough to impart the warm katsu flavour to the whole chicken fillet, while a sweet curry sauce on the side was tasty but not overpowering. And the mains? \nChoosing these was tricky, as there’s a huge choice of appealing dishes — the only unifying theme to the menu seems to be that every third item must be described as “proper” or “good old fashioned”. The best dish of the night - grilled seabass on a subtle chickpea curry base \nI went for charcoal grilled seabass, which comes with a choice of inventive bases and a side dish from the main menu – chickpea and spinach masala and some sweet potato fries for me. \nThis was fantastic. Wonderfully crisp, blackened skin topped well cooked, well seasoned fish, and at £13.95 for a decent amount of seabass it was good value too. \nThe curry base complemented the meaty fish perfectly, creamy with coconut milk, warming and subtle. And it was perfect for dipping the excellent fries in. \nAcross the table, the ‘chicken in a basket’ proved popular. Perfectly cooked breaded chicken came with a mountain of chips which could have come straight from a good chip shop, tasty coleslaw and — the star of the dish — some deliciously chewy, flavourful sweetcorn pancakes. \nOnce again, portions were generous to a fault, and we were pleasantly stuffed by the end. Room for dessert? \nWell, to be honest, not really, but we couldn’t resist. \nAnd since it seemed to be our duty as reviewers, we chose to share a tempting-sounding chocolate orange tart, topped with vanilla ice cream (£5.95). \nIt turned out to be the perfect end to the meal. \nA perfectly sweet crumbly shortcrust pastry gave way to rich chocolatey goo, with just the right note of orange. A chocolate orange tart rounded off the meal perfectly \nUnlike the other courses we’d sampled, the portion was very restrained, which was ideal — just enough to give both of us a few mouthfuls of sweetness to round things off. \nI washed down the last of the tart with some wonderfully strong black coffee, and contemplated the bill. \nAt just over £50 for two of us to enjoy starters, mains, dessert and cocktails, prices seemed pretty reasonable. \nAs we settled up, a Smiths song made an appearance on the baffling playlist, and my companion started doing his best Morrissey impression, so I decided it was probably high time we made our way out of Brexit-land. \nWe left with extremely satisfied stomachs, but slightly conflicted minds. Read More Newcastle Christmas Market: What can you buy and how long is it on? \nThe food at George’s is really very good, and normally I wouldn’t let décor put me off a decent dinner. \nBut here, the theme is so in-your-face that unless it appeals to you, you’ll struggle to enjoy your experience. \nSo I don’t think I’ll be making a return visit, but if Winston Churchill and Jane Austen sharing a selfie stick seems funny to you, then you’ll be pleased to know you’ll get a good meal on the side. \nOur star rating for food is 4, but for atmosphere just 1. Hence overall of 3. Factfile \nGeorge’s Great British Kitchen \nGrey’s Quarter, intu Eldon Square, Newcastle \nPostcode: NE1 7JB \nOpening times: Sun-Thur: 11:30am to9:30pm (Last Orders) \nFri-Sat: 11:30am to 10:30pm (Last Orders) Like us on Facebook", "external_links": [], "published": "2016-12-13T15:29:00.000+02:00", "crawled": "2016-12-13T10:40:23.613+02:00", "highlightTitle": ""}