{"organizations": [], "uuid": "522146248486c8d3248d0ffc0d6659a291bbaf92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article10894087.ece/ALTERNATES/s1200/JS47870002.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-union-leaders-12344288", "country": "GB", "domain_rank": 21960, "title": "North East business and union leaders call for EU workers to get right to remain in the UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East business and union leaders call for EU workers to get right to remain in the UK", "spam_score": 0.0, "site_type": "news", "published": "2016-12-20T01:00:00.000+02:00", "replies_count": 0, "uuid": "522146248486c8d3248d0ffc0d6659a291bbaf92"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-union-leaders-12344288", "ord_in_thread": 0, "title": "North East business and union leaders call for EU workers to get right to remain in the UK", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "beth farhat", "sentiment": "none"}, {"name": "james ramsbotham  james ramsbotham", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "uk business north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "tuc", "sentiment": "none"}, {"name": "could    union", "sentiment": "none"}, {"name": "eu justice", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East business and union leaders call for EU workers to get right to remain in the UK Unusual joint letter from union and business groups calls on Theresa May to make declaration on foreign workers Share Get business   Thank you for subscribing! Could   \nUnion and business bosses in the North East have come together to call on the Government to guarantee the right of EU nationals currently working in the region to remain after Brexit. \nThe unusual joint letter calls on Prime Minister Theresa May to make a “bold unilateral move” that they say would be both in the interests of the UK economy and the right thing to do morally. \nThe regional bosses also believe allowing EU workers already in the region to remain would send a signal of goodwill to other EU states that will benefit the UK’s negotiating position. \nMrs May and other Ministers have so far resisted a number of calls for her to guarantee existing workers’ right to remain, saying that it would be wrong to give away bargaining position before the rights of UK citizens living in Europe has been protected. \nAs well as business groups, education bodies also want guarantees on foreign workers and students, arguing that they make a vital and economically lucrative contribution to the UK. Read More Government needs proper industrial strategy for places like the North East, MPs told \nSome research has suggested that up to 75% of EU workers currently in the UK could be made ineligible for visas after Brexit. \nTUC regional secretary Beth Farhat said: “Business leaders and trade unions in the North East are joining voices on this because the uncertainty is bad for businesses, bad for public services, and unfair to so many of our hard-working friends and neighbours. \n“Families that are settled here and making a positive contribution to our community are very worried. So this is simply the right thing to do. But it’s also about avoiding problems for business that could lose staff, and protecting services like our local hospitals, which would be in trouble if doctors and nurses from the EU left. \n“We also need the Government also crack down on the minority of employers who exploit migrants and undercut wages in the local community.” North East England Chamber of Commerce chief executive James Ramsbotham \nJames Ramsbotham, North East England Chamber of Commerce chief executive said: “Our members are hugely disappointed that ministers are stalling on the need to guarantee residents’ rights for their EU colleagues. Businesses need certainty and could be losing key employees due this lack of decision. \n“We urge the Government to ensure skilled EU citizens working in our region know they can build their careers here and play a part in our future economic success.” \nLast week a group of peers said the UK had a “moral obligation to provide certainty and legal clarity to all EU nationals working, living and studying in the UK, who contribute so significantly to the economic and cultural life of the UK. \nThe Lords EU Justice sub-committee called for an “unilateral guarantee now” on the rights of EU nationals working in the UK. \nA Downing Street spokesman said: “The Prime Minister has been clear that she wants to protect the status of EU nationals already living here, and the only circumstances in which that wouldn’t be possible is if British citizens’ rights in European member states were not protected in return.” Like us on Facebook", "external_links": [], "published": "2016-12-20T01:00:00.000+02:00", "crawled": "2016-12-19T20:22:35.905+02:00", "highlightTitle": ""}