{"organizations": [], "uuid": "ab54248f9402cd4edfa48844d7a15c8247c7a937", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12321274.ece/ALTERNATES/s1200/Third-Party-Presidential-Candidates-Gary-Johnson-And-Jilll-Stein-Take-Part-In-Forum-At-The-Asian-Ame.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/open-trade-creates-prosperity-can-12321444", "country": "GB", "domain_rank": 21960, "title": "Open trade creates prosperity and can bring jobs, business advisor says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Open trade creates prosperity and can bring jobs, business advisor says", "spam_score": 0.0, "site_type": "news", "published": "2016-12-14T23:08:00.000+02:00", "replies_count": 0, "uuid": "ab54248f9402cd4edfa48844d7a15c8247c7a937"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/business/business-opinion/open-trade-creates-prosperity-can-12321444", "ord_in_thread": 0, "title": "Open trade creates prosperity and can bring jobs, business advisor says", "locations": [], "entities": {"persons": [{"name": "barry jacks", "sentiment": "negative"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "chemoxy", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "guangzhou", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "getty images north america", "sentiment": "none"}, {"name": "bgf", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Opinion Open trade creates prosperity and can bring jobs, business advisor says Barry Jackson from the Business Growth Fund on the need to embrace globalised trade for the advantages it can bring Share Former US President Bill Clinton (Photo: Getty Images North America) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA recurring theme during the major political events of 2016 has been the new wave of sentiment against globalisation. \nBill Clinton has compared globalisation to “a force of nature, like wind or water” – something that cannot be stopped and overrides all in its path. \nLike wind and water, globalisation is a force that can be harnessed for good, as well as one that can be overwhelming and destructive. For it to be a force that works for everyone, its tide needs to not only lift big business, but also smaller companies. \nSmaller companies have a far bigger impact on local communities – particularly those outside of London – than big businesses do. However, too few smaller companies are gaining from globalisation, which means that local communities are not experiencing the benefits of an open world. \nRather than being something local and understandable, globalisation has become a byword for ruthless corporations, outsourcing and offshoring. This needs to change. \nAlready, we are seeing the impact of what happens when people are disillusioned with globalisation. At a rapid pace, politics is sliding away from left versus right to open versus closed. Just look at the daily Brexit headlines, where there is never-ending debate about just what our relationship with the EU and beyond should look like. \nYet these movements are swimming upstream. Rather than stemming globalisation, we need to instead look at how it can benefit local businesses and their communities. We need to support businesses so that they access more markets and opportunities, so that their sights are set globally, from Gateshead to Guangzhou. \nFirstly, any business looking to export needs to scale up. A business cannot export if it lacks the capacity to increase its production or the ability to hire needed staff. \nOf course, the key to this is capital – something that many smaller businesses struggle to access. Without capital, a business cannot grow and without this growth it cannot hope to succeed overseas. \nSmaller businesses often need additional support, beyond capital. Foreign markets are full of potential pitfalls, some of which are as intangible as etiquette over dinner. From identifying opportunities to understanding how to operate in an alien market, exporting is a daunting arena for newbies. Here, it helps to have an experienced head providing advice and guidance. \nBut how can a business gain capital and experience? A bank loan brings debt and no advice, and it is hard for smaller companies to get the ear of people who have been there and done it. This is where an investor like BGF can help. \nWe provide equity investment, giving businesses access to capital which enables them to scale up. Not only this, but the businesses we back gain from having access to a huge pool of experienced board-level executives – many of whom are adept in navigating global business and can be invaluable to helping a smaller business taking its first steps abroad. \nFor the impact of this, I look to Chemoxy, a specialist chemicals manufacturer, whose international presence continues to grow with around 60% of the chemicals produced or processes at its two Teesside sites shipped to overseas markets. \nChemoxy secured a £10m investment from BGF in February 2015 to make further investments in capital and plant in order to increase capacity, expand its product and service range and drive growth. \nWe cannot push back the wave of globalisation, but we can ride it. Open trade creates real prosperity and can help local companies grow and bring jobs and investment to their local communities. It is time that more smaller businesses are given the tools to compete across the world. Like us on Facebook", "external_links": [], "published": "2016-12-14T23:08:00.000+02:00", "crawled": "2016-12-14T19:07:50.073+02:00", "highlightTitle": ""}