{"organizations": [], "uuid": "8a0823bc98e407deedd3f68955cbb21a398b3737", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12340311.ece/ALTERNATES/s1200/Migrants-Leave-The-Jungle-Refugee-Camp-In-Calais.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/am-immigrant-life-series-trade-12340319", "country": "GB", "domain_rank": 21960, "title": "I am an immigrant - and my life has to be a series of trade-offs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "I am an immigrant - and my life has to be a series of trade-offs", "spam_score": 0.0, "site_type": "news", "published": "2016-12-20T01:00:00.000+02:00", "replies_count": 0, "uuid": "8a0823bc98e407deedd3f68955cbb21a398b3737"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/news/north-east-news/am-immigrant-life-series-trade-12340319", "ord_in_thread": 0, "title": "I am an immigrant - and my life has to be a series of trade-offs", "locations": [], "entities": {"persons": [{"name": "geordie", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "cullercoats bay", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Women and children protest their case to the UK goverment (Photo: Christopher Furlong/Getty Images) Share Get daily   Thank you for subscribing! Could   \nChristmas this year will have a bittersweet feeling to me. The bitterness comes from the fact that for the first time in 20 years, I won’t be making it back home to the North East. \nThere’s something special about the festive season in and around Newcastle. \nThe bite of the whipping wind, the salty sea air tang, the vivid holly and ivy colours, and the bright Christmas lights over Cullercoats Bay remind me of those idyllic childhood winter celebrations. \nMy absence two decades ago was sweetened by a backpacking adventure round remote rural Australia. \nThis time, the sweetness comes from the arrival of a much-loved daughter, who’s just too fragile to risk journeying back home. \nThe bittersweetness of this Christmas brings back to me the fact that I am an immigrant and my life is a series of trade-offs between my home – the North East – and where I live. \nIf there was good work for me to do here in the North East I’d come back like a shot but, as things stand, it makes sense to continue working away. \nBut I am giving up so much that is dear to me from my North-Eastern roots, including my children’s Geordie identities. \nThat’s the reality of contemporary immigration – whether to the Netherlands or the North East. I am only in the Netherlands because there’s a job to do for me that I can do better than anyone else. \nIf I do that job well, then I benefit, and I have a good life there, but so does the Netherlands. \nThe Netherlands benefits not just through my job, because like most people I have an active social life: in the local school, a local football club, a local theatre group and my union. \nI did those things with pleasure in the North East but, because work takes me away, I am doing them now in the Netherlands. Read More The sooner we have a national conversation about migration and citizenship, the better \nThere’s currently a debate raging about whether the economic benefits that immigrants bring is worth the burden they place on their communities. \nThat plays into asking whether the burden of immigrants is a “price worth paying”, and it’s a question that extremists want us to unthinkingly reject. \nAll the evidence shows that immigrants are not a burden to where they live, but rather are active in making liveable places. \nStudy after study shows immigrants are the most dynamic, the hardest working, and the most entrepreneurial people and use those characteristics to benefit their host locations. \nPut concretely, immigrants to the North East provide vital services and do it better than possible without them. But, more importantly, they work hard to make their temporary homes pleasant places to live, and we can all benefit from that. \nImmigrants put down roots in our adoptive homes and become part of, and indistinguishable from, our hosts. \nTogether, as one community, as one North East, we move forward. \nWhen times are hard, it’s easy to forget that. Populists urge us to demonise particular groups to cover up deeper failings in society. \nThe whole “immigration as benefit vs burden” is fundamentally misplaced and scapegoats the very people who can help build creativity in vitality in towns and villages across the North East of England. \nWith Brexit coming from March next year, then we should recognise that we risk tearing these people from our communities in a misplaced Quixotic tilt at “taking back control”. \nOnly by working across boundaries as one North East can we build a region in which all of us and our children can happily live. And, finally, I’ll be able to return and share the delights of the Cullercoats Christmas with our newest family member. \nMerry Christmas and all the best for 2017! Like us on Facebook", "external_links": [], "published": "2016-12-20T01:00:00.000+02:00", "crawled": "2016-12-19T20:22:34.546+02:00", "highlightTitle": ""}