{"organizations": [], "uuid": "91f0419ee6cd69776786972fc0a4dd9d07c56868", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11828805.ece/ALTERNATES/s1200/JS52094250.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/delayed-economic-recovery-set-finally-12265555", "country": "GB", "domain_rank": 21960, "title": "Delayed economic recovery set to finally arrive in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Delayed economic recovery set to finally arrive in the North East", "spam_score": 0.0, "site_type": "news", "published": "2016-12-05T07:01:00.000+02:00", "replies_count": 0, "uuid": "91f0419ee6cd69776786972fc0a4dd9d07c56868"}, "author": "Chris Knight", "url": "http://www.chroniclelive.co.uk/business/business-news/delayed-economic-recovery-set-finally-12265555", "ord_in_thread": 0, "title": "Delayed economic recovery set to finally arrive in the North East", "locations": [], "entities": {"persons": [{"name": "jason whitworth", "sentiment": "none"}, {"name": "liz mayes", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east delayed", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eef", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "manufacturing outlook", "sentiment": "none"}, {"name": "bdo llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Delayed economic recovery set to finally arrive in the North East The quarterly Manufacturing Outlook survey published by EEF paints an 'upbeat' picture for the region Share Liz Mayes, EEF North East region director Share Get business updates   Thank you for subscribing! Could   \nManufacturers in the North East will be able to take advantage of the delayed recovery when it finally arrives in the first quarter of 2017, according to a new business survey. \nThe ‘upbeat’ quarterly Manufacturing Outlook published by employer’s organisation EEF and business advisory firm BDO LLP indicates regional manufacturers will benefit from a much-improved boost to output and orders at the start of the new year. \nEarly signs suggest the sector has left behind the negative effect of the low oil price and concerns about global growth to seek out more UK opportunities and improving export prospects. \nAnd with a strong forecast for new orders in the quarter, North East output is expected to increase by a balance +25% - compared with +6% in the last three months. Read More North East leading the country in creating new jobs, survey suggests \nLiz Mayes, EEF North East region director, said: “This is the most upbeat reading on the state of manufacturing we’ve seen for some eighteen months and signals the start of brightening conditions, which had been briefly knocked off course following the referendum. \n“This anticipated turnaround can be attributed to a range of factors including the resilience, thus far, of the UK economy but also the strengthening of demand in a number of major markets. \n“Critically, this should spur some new investment and recruitment activity to meeting fulfil new customer demands. \n“While confidence is back on the up, manufacturers are still cognisant of growth challenges in the near term. \n“Brexit aside, global growth is not yet on the firmest of footings and, with volatile exchange rates also in the mix, UK manufacturers will need to continue to be nimble in their responses to emerging challenges and opportunities in the months ahead.” Read More \nHowever, EEF stressed the picture is one of the manufacturing sector regaining ground after a sluggish eighteen months. \nWhile key indicators move back into the black, Brexit-related and global risks remain on the horizon. \nProfit margins will likely be squeezed further in 2017, and the pressures of inflation and significant price hikes will likely weigh down on domestic activity for the upcoming year. \nAs a result, EEF is still forecasting that manufacturing will contract in 2017 despite these improvements. \nJason Whitworth, corporate finance partner and head of manufacturing at BDO LLP in the North East, added: “Despite uncertainty at home and abroad, UK manufacturing is proving to be resilient. \n“The depreciation of Sterling is helping manufacturers export more and they are seeing a steady increase in appetite from the EU and US. Read More North East economy recovering well but problems await, surveys say \n“However, this is putting additional pressure on the cost of raw materials being imported and therefore profit margins for manufacturers, which will ultimately push up prices. \n“Brexit means a period of challenge and vulnerability for the sector and businesses need stability and certainty in government policy if they are to continue to commit to the investment that the country needs to grow.” Like us on Facebook", "external_links": [], "published": "2016-12-05T07:01:00.000+02:00", "crawled": "2016-12-05T02:12:57.580+02:00", "highlightTitle": ""}