{"organizations": [], "uuid": "98b77f868d224c53ee710a9e5a49764c148f433f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article8239996.ece/ALTERNATES/s1200/JS52393411.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-blamed-pushing-up-cost-12281272", "country": "GB", "domain_rank": 21960, "title": "Brexit blamed for pushing up the cost of food and forcing families to go hungry", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit blamed for pushing up the cost of food and forcing families to go hungry", "spam_score": 0.0, "site_type": "news", "published": "2016-12-06T23:00:00.000+02:00", "replies_count": 0, "uuid": "98b77f868d224c53ee710a9e5a49764c148f433f"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-blamed-pushing-up-cost-12281272", "ord_in_thread": 0, "title": "Brexit blamed for pushing up the cost of food and forcing families to go hungry", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "george eustice", "sentiment": "none"}, {"name": "emma lewell-buck", "sentiment": "none"}, {"name": "mrs lewell-buck", "sentiment": "none"}, {"name": "mary glindon", "sentiment": "none"}, {"name": "jonathan brady/pa wire", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south shields", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "trussell", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "food and drink federation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Brexit blamed for pushing up the cost of food and forcing families to go hungry South Shields MP Emma Lewell-Buck fears a hike in the cost of living will leave many unable to make ends meet Share Get daily   Thank you for subscribing!   \nThousands of struggling families risk going hungry as the price of food rises due to Brexit. \nThat is the warning from South Shields MP Emma Lewell-Buck , who fears a hike in the cost of living will mean many can’t afford to eat. \nAnd the Labour MP has called on the Government to take action to stop people going hungry. \nFigures from charity the Trussell trust, which runs food banks, show that 29,473 food parcels designed to last three days each were distributed in the North East in the six months between April and September this year. \nOther food banks run by different organisations will also have provided food to people in need. \nBut Mrs Lewell-Buck said this didn’t reveal the full scale of the problem, because there were also families which could not get to food banks. \nShe warned that an estimated that 8.4 million people in Britain now live in households affected by “food insecurity” where there is not always enough to eat. \nLeading a House of Commons debate on the topic, Mrs Lewell-Buck said the Government should measure the number of households suffering from a lack of food. South Shields MP Emma Lewell-Buck \nAnd she predicted the problem would get worse as a result of the vote to leave the European Union . \nWhile the UK is likely to stay in the EU for more than two years, the Brexit vote has already caused our currency to fall in value. \nIt means that imports become more expensive for British shoppers, and this could put up the price of food. Read More How the heartbreaking reality of the West End Foodbank helped inspire an award-winning film \nMrs Lewell-Buck said: “The drop in the value of sterling as a result of Brexit uncertainties means that food prices will start to rise - by between 5% and 8% in the coming year, according to the Food and Drink Federation - and that will place even further pressure on households struggling to put food on the table. \n“On average, healthier food costs two-and-a-half times as much as food high in fat, salt and sugar, and people who experience food insecurity often cut back first on healthy, perishable and more expensive fruit and vegetables.” Tins and dried food form the staple for most foodbanks (Photo: Jonathan Brady/PA Wire) \nThe MP revealed her staff had to get food parcels delivered to a mother-of-four and her children to prevent them going without anything to eat. \nThe drastic measures were just one illustration of the growing problem of people going hungry, said Mrs Lewell-Buck. \n“Recently, a woman called my constituency office in desperate need of help after having problems with her benefits. She had no money for gas or electricity, and no food to feed herself and her four young children, all of whom are under 10 years of age,” she said. \n“She was alone and unable to leave her home to get to the nearest food bank, which in any case was closed. \n“Even if she had been able to leave her home, she did not have the necessary funds for public transport. \n“In the end, my staff contacted one of the many food bank volunteers in Shields and managed to get food delivered to her and her children. \n“If they had not been able to pick up and deliver that food, that family would have endured the further pain of starvation.” \nBut this was just “one of the everyday experiences” of people across the country, she said. MP Mary Glindon \nNorth Tyneside MP Mary Glindon backed calls for the Government to measure the number of households in need. \nShe said: “It is totally unacceptable that here, in the sixth largest economy in the world, in the 21st century, so many people are going hungry and, perhaps we should say, are starving.” \nDEFRA minister George Eustice responded on behalf of the Government and argued that the cost of food had fallen in recent years. \n“Food prices, and commodity prices generally, are predominantly governed by changes in weather events, energy prices and exchange rates,” he said. \n“The truth is that the biggest spike in food prices in recent times took place in 2008, during the financial crisis. \n“Prices continued to rise gradually until the beginning of 2014, but they have been falling ever since, for almost three years now. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2016-12-06T23:00:00.000+02:00", "crawled": "2016-12-06T18:35:05.816+02:00", "highlightTitle": ""}