{"organizations": [], "uuid": "2f116db5f7a9328e3238c5bb581bc48b998b7819", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11707897.ece/ALTERNATES/s1200/JS58327613.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-rbs-settles-12272943", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: RBS settles three compensation claims, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: RBS settles three compensation claims, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-12-05T15:55:00.000+02:00", "replies_count": 0, "uuid": "2f116db5f7a9328e3238c5bb581bc48b998b7819"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-rbs-settles-12272943", "ord_in_thread": 0, "title": "Business Breakfast LIVE: RBS settles three compensation claims, plus latest news", "locations": [], "entities": {"persons": [{"name": "michael bruce", "sentiment": "none"}, {"name": "coreena ford purplebricks", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "phil cable", "sentiment": "none"}, {"name": "neil woodford", "sentiment": "none"}, {"name": "ross mcewan", "sentiment": "none"}, {"name": "danny lawson/pa wire", "sentiment": "none"}, {"name": "mr cable", "sentiment": "none"}, {"name": "fred goodwin", "sentiment": "none"}, {"name": "purplebricks", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "rob smith", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "coreena ford", "sentiment": "negative"}, {"name": "rbs", "sentiment": "negative"}, {"name": "filtronic  county durham", "sentiment": "neutral"}, {"name": "purplebricks", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "us state department", "sentiment": "none"}, {"name": "filtronic broadband", "sentiment": "none"}, {"name": "filtronic", "sentiment": "none"}, {"name": "abn amro", "sentiment": "none"}, {"name": "mast", "sentiment": "none"}, {"name": "royal bank", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford New products drive up sales at Filtronic \nCounty Durham components manufacturer Filtronic has issued a positive trading update, noting a significant shift in revenues thanks to its new antennas. \nThe firm, which designs and manufactures microwave electronics products for the wireless telecoms infrastructure market, updated shareholders on trading for the six months ended November 30. \nDirectors said the company traded strongly in the first half of its financial year and expects to report unaudited revenues for the period of £21.6m, with £18.7m of that amount coming from the wireless business. \nThe firm said the improved financial performance was primarily driven by increased sales of our new ultra wide band integrated antennas to our lead customer, following the successful product launch in FY2016, together with improving demand for its mmWave backhaul products and base-station filters. \nAs noted in the trading statement made on September 29, whilst the board is pleased with the progress made and remains confident on the long-term prospects for the business, it remains mindful that sales are currently concentrated on a small number of customers. \nThe firm said its broadband business continues to see incremental growth in sales of Orpheus, the company’s latest generation of E-band transceivers, with strong demand from its lead customer. \nThe statement said: “A key objective for Filtronic Broadband has been to diversify its customer base and product offering and to this end, we are working with several new potential customers for Orpheus in both telecommunications backhaul and adjacent markets. \n“In addition to E-band transceiver sales, Filtronic Broadband is also gaining traction in the design and manufacture of bespoke filters and the provision of specialist high-frequency assembly and test services for the defence and aerospace markets. \n“ Whilst the early orders we have received for these offerings are modest in size, they represent long-term platform business opportunities that will make an increasingly significant contribution to Filtronic Broadband’s performance.” Rob Smith, CEO of Filtronic 9.10 Coreena Ford British maritime security firm anticipates boost from Trump presidency \nDonald Trump’s plans to ramp up military spending are expected to provide a boost for British maritime security firm MAST, its chief executive has said. \nMAST - which provides services like armed security, training, counter-privacy, and system installations - could see demand for private security rise if the US president-elect follows through with plans to increase military investment. \nChief executive Phil Cable said it is an “interesting time” for his company. \n“I suspect Donald Trump will be strong on defence and support the military spending,” he said. \n“So I think for us, as a security business, in that sort of sector, and in areas of concern, there may be some opportunities for us to work with US security companies.” \nIn a speech to the Union League of Philadelphia in September, Mr Trump said he would reverse cuts to military spending that took place as part of the 2013 budget sequester, and submit a new budget to “rebuild” the military once he takes office. \nMAST said the US government had historically been one of the largest employers of private security, and that the company had supported the US State Department as a sub-prime contractor for projects including a diver training programme in the past. \nThe company, which launched in 2005, has struggled to match peak revenues of 50 million US dollars (£40 million) which it reached back in 2012. \nSince then, it has had to contend with a sharp downturn in the shipping industry, which it also services. \n“We went through a period like our particular sector of some quite rapid changes in market conditions, and consolidation ... massive price corrections and pressures and so for about a period of about a year, it was a very difficult trade.” \nMAST “sustained a certain level of losses,” and was forced to restructure, Mr Cable explained. \nRevenue projections for 2016 are around 15 million US dollars (£12 million), with gross profit margins of around 10%. \nThat is up from turnover of 14.6 million US dollars (£11.7 million) a year earlier. \nBut MAST’s super-yacht business has been relatively resilient, compared to the rest of its portfolio. \n“For super-yachts, there was a degree of downturn in the new build market, but inevitably with those that have extreme wealth ... I wouldn’t say they’re immune to global downturns but they’re less affected.” \nMr Cable does not believe Brexit will present similar challenges for the business, given the company’s international model. \nThe firm, which has its headquarters in the UK, has actually benefited from income in stronger currencies like the US dollar, following sterling’s collapse in the wake of the referendum. \n“Regardless of any political view, I don’t think we’ve really seen the effects of it yet,” he said. President-elect Donald Trump (Photo: PA Wire) 9.05 Coreena Ford Purplebricks builds first UK profit \nDigital estate agency Purplebricks has recorded its maiden profits in the UK as the group’s revenue soared in the first half of the year. \nThe AIM-listed firm said overall turnover shot up 159% to £18.7m in the six months to October 31, with UK profit coming in at £300,000. \nOn a group level, Purplebricks narrowed losses from £6m to £2.2m. \nChief executive Michael Bruce said: “Although we recognise that the UK market backdrop is tough, we continue to have a confident outlook for the future. “We have momentum, a superior, low fixed-cost flexible business model and a strong balance sheet, which we will leverage further in the early part of the busier spring market so as to build on our success to date.” \nThe company said it sold and completed on £2.5bn of property in the period. Its Australian business, launched at the end of August, has got off to a successful start, it added. Purplebricks is backed by fund manager Neil Woodford and a group of prominent investors. 9.00 KEY EVENT RBS settles three claims over toxic 2008 rights issue \nRoyal Bank of Scotland (RBS) has reached a “final settlement” with three out of the five shareholder groups bringing compensation claims against it in connection with its 2008 rights issue. \nThe lender, which is still 73% owned by the Government, said the settlement represents 77% of the claims by value in the litigation. The bank said the deal was struck in order to “minimise further material litigation expense and management distraction and without any admission of liability”, adding that it is willing to make available £800 million in total to be “split among all five shareholder groups”. \nThe money is covered by existing provisions. “RBS will now seek to agree finalised terms with members of the remaining two groups whose claims are presently continuing. \nAny claims for which settlement is not achieved will, however, continue to be vigorously defended. The trial for such claims is due to commence in March 2017,” RBS said. \nThe legal action is linked to a rights issue overseen by disgraced former boss Fred Goodwin. \nIn April 2008, RBS asked existing shareholders to inject £12 billion into the firm to strengthen its reserves after the bank had splurged £49 billion to acquire Dutch bank ABN Amro. \nThe deal proved toxic and, just months later, the value of RBS shares plunged 90% and the Government had to step in. \nCurrent chief executive Ross McEwan said: \nWe have been very clear that we wanted to deal with as many of our legacy litigation issues as possible during 2015 and 2016. \nWe are pleased to have reached this agreement and hope that it will be accepted by the remaining claimant group(s) so that this long course of complex and costly litigation can now be concluded. Royal Bank of Scotland branch (Photo: Danny Lawson/PA Wire) Share", "external_links": [], "published": "2016-12-05T15:55:00.000+02:00", "crawled": "2016-12-05T11:23:09.043+02:00", "highlightTitle": ""}