{"organizations": [], "uuid": "6c43b2fc274daba91242a0748ad7605e72820889", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12362057.ece/ALTERNATES/s1200/The-Supreme-Court-Hears-the-Governments-Challenge-To-Previous-Brexit-Ruling.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-six-months-on-12362034", "country": "GB", "domain_rank": 21960, "title": "Brexit vote six months on: What's happening with Article 50 and when can we expect to leave?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit vote six months on: What's happening with Article 50 and when can we expect to leave?", "spam_score": 0.0, "site_type": "news", "published": "2016-12-23T18:00:00.000+02:00", "replies_count": 0, "uuid": "6c43b2fc274daba91242a0748ad7605e72820889"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-six-months-on-12362034", "ord_in_thread": 0, "title": "Brexit vote six months on: What's happening with Article 50 and when can we expect to leave?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "yui mok/pa wire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "lisbon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "getty images europe", "sentiment": "neutral"}, {"name": "supreme court", "sentiment": "neutral"}, {"name": "european economic community", "sentiment": "none"}, {"name": "civil service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A man waves the EU flag in front of the Supreme Court (Photo: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nAt times, the Brexit process can seem complex and strange - because it is. \nWhat we didn’t know when we voted on June 23 was that we were also bringing a whole load of new jargon into the English language. \nDo you want your Brexit served hard or soft? \nHave you read your 50 articles a day on Article 50? \nAre we having a cliff-edge Brexit or a...non-cliff-edge Brexit? \nHere’s everything you need to know so far and what you can expect in 2017 and beyond. Let’s start at the beginning. This Article 50 business - what actually is it? \nArticle 50 is a niche, untested clause buried at the bottom of the Treaty of Lisbon. \nClocking in at fewer than 300 words, Article 50 is about as short and vague a legal document as you’re ever likely to see - and that’s a problem. \nThere isn’t a template for leaving the EU . \nNo plan, no method, no handy diagram telling you what to do and how to do it. \nYou have to agree to leave, tell the EU you’re going, negotiate a deal - oh, and you’ve got two years to do it. \nAnd that’s it. \nThe Article 50 process is what we’re about to embark on: putting this piece of legal theory to the test. Nigel Farage (Photo: Yui Mok/PA Wire) I’ve heard people talking about “notification” - what’s that all about? \nNotifying the EU of our intention to leave is the point at which that two year stop clock starts. \nIt’s the point at which the process of leaving the EU actually begins. \nThe government has announced that they will do this no later than the end of March 2017. \nThis is a political promise - technically, the government could trigger Article 50 in March 3017 if it wanted to. \nBut, as it currently stands, the two-year window to re-arrange our relationship with the EU will begin in the next three months or so. \nAnd remember: during these two years we will continue to be full, paid-up members of the EU - although we’ll have no say on how it is run or how the money is spent. So that means we’ll be out of the EU by April 2019? \nPretty much. \nThat certainly doesn’t mean everything will be wrapped up and ticketyboo by then but we will officially be “out of Europe” by April 2019. But two years is loads of time to sort everything out, right? \nThat sound you just heard was 100 government lawyers choking on their mulled wine. \nThere is an incredible amount of technical details to sort out. \nAnd we’re not particularly well prepared for it - for example, the Civil Service is currently hiring trade negotiators because we haven’t needed or trained any since we joined the European Economic Community in 1973. Prime Minister Theresa May (Photo: PA) Well, what sort of detail? \nTo begin with, there is the small matter of renegotiating how we buy and sell with the world’s largest free trade bloc. \nWe need to agree on what happens to EU citizens already living in the UK and UK citizens already living in the EU. \nWe need to figure out how we’re going to trade with other countries around the world because the EU has done that on our behalf for forty years. \nWe need new security processes, new environmental arrangements, new laws, new regulations. \nEvery contract drawn up under EU law will need to be reviewed, every joint foreign policy action taken with the EU will need to be reconsidered. \nOh, and on top of all that, there’s the small business of running the UK’s schools, hospitals, roads, prisons, tax system, courts, economy and everything else that the government has to do on a daily basis. \nIt would be nothing short of a miracle if that was all done in two years. Right...so what if it isn’t all done by April 2019? \nThe government have pretty much accepted that this is likely so talk has turned to a “transitional” deal. \nIn this scenario, the UK would formally leave the EU by 2019 but the trickiest negotiations would continue beyond then. \nFor example, complex talks over finance could run beyond the April 2019 deadline if both parties agree to retain the current arrangements or something similar for a few years longer. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2016-12-23T18:00:00.000+02:00", "crawled": "2016-12-23T13:21:23.544+02:00", "highlightTitle": ""}