{"organizations": [], "uuid": "d2c86f21782e9119d7310c4a5ceddca2ea65a5b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12342008.ece/ALTERNATES/s1200/Hitachi-Launches-Its-First-British-built-Intercity-Train.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/warning-uks-attractiveness-foreign-investors-12341951", "country": "GB", "domain_rank": 21960, "title": "Warning on the UK's attractiveness to foreign investors", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Warning on the UK's attractiveness to foreign investors", "spam_score": 0.0, "site_type": "news", "published": "2016-12-19T19:53:00.000+02:00", "replies_count": 0, "uuid": "d2c86f21782e9119d7310c4a5ceddca2ea65a5b0"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/warning-uks-attractiveness-foreign-investors-12341951", "ord_in_thread": 0, "title": "Warning on the UK's attractiveness to foreign investors", "locations": [], "entities": {"persons": [{"name": "sandra thomson", "sentiment": "none"}, {"name": "mark gregory", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "ey", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "business warning", "sentiment": "negative"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "hitachi rail europe", "sentiment": "none"}, {"name": "intercity express", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Warning on the UK's attractiveness to foreign investors Survey of foreign firms by accountancy group EY highlights 'short window of opportunity' for UK to overcome Brexit concerns Share Work is carried out on the new Intercity Express trains at the Hitachi Rail Europe site in Newton Aycliffe (Photo: Getty Images Europe) Share Get business   Thank you for subscribing! Could   \nThe UK has only a “short window” in which it can develop policies to keep the country attractive to international investors, a new report says. \nAn update to the UK Attractiveness Survey released by EY in May has seen the accountancy group interview representatives of 259 international companies to assess their feelings towards the UK in the aftermath of the EU referendum . \nThe survey found that 25% of those companies intend to invest in the UK in the next 12 months, suggesting that the potential impact of Brexit has not yet had a major impact on investor perceptions to a significant degree. \nBut the situation got worse when the international companies were asked about the UK’s long term attractiveness, with the proportion of investors that expect the UK to become more attractive falling to its lowest ever level (29%), while those who expect it to get worse has more than doubled, from 16% to 34% in the last six months. \nThe survey findings will be of particular concern to areas like the North East, where foreign companies, particularly from Japan, are major sources of employment. \nThey also raise questions about the future of the Northern Powerhouse initiative, which is aiming to attract overseas investment into Northern cities. \nSandra Thomson, incoming North East Senior Partner at EY, said: “There is no sign of any immediate deterioration in FDI intentions over the next 12 months, in fact there has been an improvement in short-term sentiment since May this year. \n“However, the medium term outlook has worsened across a number of metrics and investors are concerned about how the UK’s attractiveness will develop over the next three years. \n“The UK now has a window of opportunity to address their concerns and preserve future competitiveness. It also provides increased pressure on the Northern Powerhouse to demonstrate its worth and potential value to investors.” Read More Parkdean Resorts sold for £1.35bn to Canadian investment giant \nThe North of England attracted record levels of foreign investment in 2015 with the number of projects recorded increasing by 89% on 2014 to 225 projects. \nThe North East in particular saw the highest level of inward investment in a decade with an increase of 83% in the number of projects in the region compared to 2014 and creating 3,287 new jobs – an increase of 160% on 2014 figures. \nThe report found that Asian investors are the most positive about the UK’s future attractiveness, with 34% expecting an improvement and 26% a deterioration, although this is still significantly lower than the historic trend. European investors are the most pessimistic, with 43% expecting it to decline and only 23% anticipating an improvement. \nThe top four countries that investors think the UK should prioritise trade deals with are the US, Germany, China and France. \nInvestors are particularly concerned about not having access to skilled labour, highlighting the need for both an improved skills strategy in the UK and the case for allowing existing skilled workers from abroad to be allowed to remain after Britain leaves the EU. \nMark Gregory, EY’s UK chief economist said: “Once sector priorities have been identified, our discussions with investors indicate five priority action areas for the UK: developing a comprehensive approach to skills; delivering improved infrastructure; signing trade deals to preserve and grow the UK’s market access; introducing incentives to encourage investment, including taxation, support for R&D and capital equipment; all underpinned by the creation of a digital platform of both technologies and skills. \n“All these initiatives should be developed at national, regional and city level ensuring trade continues to support UK economic performance with benefits felt across the whole country.” \nEY’s report also highlights manufacturing as a focus for attention, with more than half of all foreign investment projects in Europe in that sector. Like us on Facebook", "external_links": [], "published": "2016-12-19T19:53:00.000+02:00", "crawled": "2016-12-19T15:19:16.837+02:00", "highlightTitle": ""}