{"organizations": [], "uuid": "69ee168014a33e7e6fe86acec59917609796dd32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11425149.ece/ALTERNATES/s1200/JS39459054.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-businesses-say-foreign-12294042", "country": "GB", "domain_rank": 21960, "title": "Why North East businesses say foreign workers are vital to keeping the region moving", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why North East businesses say foreign workers are vital to keeping the region moving", "spam_score": 0.0, "site_type": "news", "published": "2016-12-09T01:00:00.000+02:00", "replies_count": 0, "uuid": "69ee168014a33e7e6fe86acec59917609796dd32"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-businesses-say-foreign-12294042", "ord_in_thread": 0, "title": "Why North East businesses say foreign workers are vital to keeping the region moving", "locations": [], "entities": {"persons": [{"name": "iain wright", "sentiment": "none"}, {"name": "stefan wermuth/pa wire", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "hartlepool", "sentiment": "none"}, {"name": "monde nissin", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "energy and industrial strategy committee", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why North East businesses say foreign workers are vital to keeping the region moving The Government says it wants to cut immigration but North East firms say they need overseas staff Share     \nOverseas workers are vital to keeping the North East moving. \nThat’s the view of North East employers, who have urged the Government to ensure they can continue to employ skilled foreign staff - despite promises by ministers to cut immigration. \nThey also highlighted the need to ensure British workers had the skills firms need, and to improve the quality of life in the North East to attract workers to the region. \nThe plea came from the North East England Chamber of Commerce , which submitted evidence to an inquiry by MPs looking at the Government’s planned industrial strategy. \nBusiness Secretary Greg Clark is leading work on the strategy, and he has pledged to ensure it includes measures to boost the economy in every part of the country. Business Secretary Greg Clark (Photo: Joe Giddens/PA Wire) \nThe Commons Business, Energy and Industrial Strategy Committee, chaired by Hartlepool MP Iain Wright, asked employers and other organisations to set out their proposals. \nNorth East England Chamber of Commerce, which represents 4,000 businesses, said the region was an “under-utilised asset” which could make a bigger contribution to the economic success of the UK as a whole with the right support. \nBut it said one of the challenges facing local firms was difficulty recruiting staff. \nIn a written submission to the inquiry, the chamber said: “North East England Chamber of Commerce members consistently rate staff issues – either shortages or costs – as amongst their biggest concerns in our Quarterly Economic Surveys (QES). \n“In the latest QES, around a third of businesses across all sectors in the North East were concerned with staff shortages, and around four in 10 were concerned around staff costs.” \nThe Government has a policy of cutting net migration to below 100,000 people a year, and Home Secretary Amber Rudd focused on plans to reduce immigration in her speech to the Conservative conference in October. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Nissan plant in Washington - the making of a car Share this video Watch Next \nCurrently, the net migration figure is around 335,000 people a year. This is the number of migrants coming in to the UK minus the number of people leaving the country. \nThe chamber added: “To facilitate growth in new industry sectors, particularly those that are highly innovative or rely on the latest digital technologies, businesses need access to a pool of highly-skilled workers. \n“To achieve this, Government should allow employers to easily recruit from the best global talent, as well as facilitating partnerships with Higher Education institutions. \n“However, the ability of employers to do this will be curtailed by the Government’s stated aim of reducing net migration to under 100,000.” \nLeaving the European Union may provide an opportunity to cut immigration because it will allow the Government to impose border controls with EU countries, although most migrants to the UK already come from non-EU countries. Read More \nBut the chamber said ministers must also consider the needs of employers when drawing up a post-Brexit immigration policy . Prime Minister Theresa May (Photo: Stefan Wermuth/PA Wire) \nIt said: “The Government should take the opportunity granted by the vote to leave the European Union to review immigration policy in light of future growth aspirations in new industrial sectors and ensure that North East England continues to be open to attracting and retaining the best global talent, alongside investment in training for UK workers.” Read More Brexit blamed for pushing up the cost of food and forcing families to go hungry \nThe chamber also urged the Government to consider the needs of every part of the country when making plans for new infrastructure projects such as major transport schemes. \nHistorically, funding has tended to go where it is seen to be most needed, such as areas with high levels of congestion on the road or rail network. \nBut this means the North East, with a relatively low population density, can lose out. \n“As a region with relatively low critical mass in terms of population and business numbers, we tend to lose out from policies that are spatially blind. \n“For example, transport policy has historically skewed investment towards areas with high levels of congestion, thereby ignoring the greater potential for development that exists in regions such as the North East. \n“Industrial strategy should be about unlocking this potential rather than sustaining the status quo, providing support and incentivisation for businesses in key sectors. \n“This should include both established businesses looking to make new investment and support for new businesses.” \nEmployers also warned against blocking takeovers of British businesses by foreign investors, pointing out that Teesside-based food manufacturer Quorn had reported a 15% increase in export sales following their its by Filipino company Monde Nissin in October 2015. \nTheresa May , the Prime Minister, has said there should be more scrutiny when foreign firms attempt to take over British businesses. Read More", "external_links": [], "published": "2016-12-09T01:00:00.000+02:00", "crawled": "2016-12-08T20:39:12.168+02:00", "highlightTitle": ""}