{"organizations": [], "uuid": "da56e7a090b782354d54bb1e6c78486fbd65ae78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12131919.ece/ALTERNATES/s1200/EU-referendum.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/stop-sneering-north-east-brexit-12294606", "country": "GB", "domain_rank": 21960, "title": "Stop sneering at North East Brexit voters, establishment figures warned", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Stop sneering at North East Brexit voters, establishment figures warned", "spam_score": 0.0, "site_type": "news", "published": "2016-12-09T15:00:00.000+02:00", "replies_count": 0, "uuid": "da56e7a090b782354d54bb1e6c78486fbd65ae78"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/stop-sneering-north-east-brexit-12294606", "ord_in_thread": 0, "title": "Stop sneering at North East Brexit voters, establishment figures warned", "locations": [], "entities": {"persons": [{"name": "ed cox - director", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john stillwell/pa wire", "sentiment": "none"}, {"name": "ed cox", "sentiment": "none"}, {"name": "julia unwin", "sentiment": "none"}], "locations": [{"name": "north east brexit", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "northern brexit negotiating committee", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "ippr north  mr cox", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "joseph rowntree foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Stop sneering at North East Brexit voters, establishment figures warned The provocative comments come from IPPR North think tank and will be made at its annual conference on Friday Share Click to play Tap to play The video will start in 8 Cancel Play now How the EU referendum night unfolded Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEstablishment figures have been told to stop sneering at North East backers of Brexit and dismissing them as “simple” or “foolish”. \nThe provocative warning is to be made at the annual conference of the IPPR North think tank on Friday, where business leaders and politicians will discuss the economic fall out from the June 23 European Union referendum . \nIts director, Ed Cox, will say: “In June the people spoke. But in the North, they shouted. \n“It has made me very angry that since the referendum, when it has become clear that the Northern economy could suffer significantly as a result of the Brexit decision, that some in the metropolitan media have presented Northerners as foolish or simple. \n“We believe that Brexit is a cry of community outrage at the imbalances of wealth and power, played out in glorious technicolour within and between the regions of this nation. \n“Scotland had already had its say, in June it was a chance for England to rise up against the wishes of the Westminster elite.” Ed Cox - Director, IPPR North \nMr Cox will highlight research showing a growing ‘decoupling’ between the North’s economy and that of Scotland and London. \nAs a result of this, he will say this region could be hit hardest by Brexit. \n“Due to the composition of our economy, Northern regions are more than twice as dependent on EU trade as London,” he will tell the ‘State of the North’ conference in Leeds. \n“So in some respects, London is a great deal more insulated from the impact of Brexit than the North. Brexit is only going to exacerbate this decoupling process. \n“Add to this the loss of EU funding for our universities and most deprived places, add to this the impact of fewer migrants in an ageing population, add to this the impact on our rural economy and whatever kind of Brexit we end up with, it looks a pretty challenging place from here.” Leave campaigners celebrate as they win the vote in Sunderland during the North East region European Union referendum count on June 24, 2016 \nThe accompanying ‘State of the North’ report will urge government to establish a Northern Brexit Negotiating Committee; extend the Northern Powerhouse from the big cities alone, to also focus on areas that voted leave in June; make areas much less dependent on single industries. \nMr Cox will say the vote to leave was as much a vote to “take back control” from Westminster as from the EU and tapped into deeper concerns in “left behind” places where people want to “take back control” of their economic circumstances. \n“To conclude that the North’s vote to leave was an act of collective self-harm is to completely misunderstand what it is to be Northern,” he will say. Read More Why North East businesses say foreign workers are vital to keeping the region moving \n“In simple terms, just like our Scottish neighbours, Northerners have historically compromised short-term economic benefits for the sake of their wider freedom and autonomy. This I believe is what we are witnessing in the Brexit vote. \n“The 80-year experiment with centralisation is over, and it is little wonder the establishment are struggling to get it.” Chief Executive of the Joseph Rowntree Foundation (JRF) Julia Unwin (Photo: John Stillwell/PA Wire) \nJulia Unwin, chief executive of the Joseph Rowntree Foundation (JRF), said: “This report is a powerful reminder that swathes of the country have not shared in the country’s growth and prosperity, leaving them vulnerable to economic shocks. Read More \n“While many northern cities have been a success story over the past decade, their revival has not spread beyond many city centres. That has to change. \n“We need a post-Brexit settlement for northern towns that have been left behind.” Read More", "external_links": [], "published": "2016-12-09T15:00:00.000+02:00", "crawled": "2016-12-09T10:15:06.361+02:00", "highlightTitle": ""}