{"organizations": [], "uuid": "1e07a389dd1de57b65cd8c54032a39302bad99e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29953349/15720059.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/us-giant-buys-county-firm/story-29953349-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published US giant buys technology firm", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published US giant buys technology firm", "spam_score": 0.0, "site_type": "news", "published": "2016-12-02T23:04:00.000+02:00", "replies_count": 0, "uuid": "1e07a389dd1de57b65cd8c54032a39302bad99e8"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/us-giant-buys-county-firm/story-29953349-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published US giant buys technology firm", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "rivers", "sentiment": "none"}, {"name": "jan grothusen", "sentiment": "none"}, {"name": "paul rivers", "sentiment": "none"}, {"name": "matthews", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "meridian", "sentiment": "none"}, {"name": "braunstone", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "meridian business park", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "tompegden | posted", "sentiment": "negative"}, {"name": "matthews international corporation of pittsburgh", "sentiment": "none"}, {"name": "guidance automation", "sentiment": "none"}, {"name": "guidance marine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "US giant buys technology firm By TomPegden | Posted: December 02, 2016 0 COMMENTS SHARES US giant buys technology firm X \nCopy link to paste in your message / \nA company which designs and builds electronics for driverless warehouse vehicles plans to expand after being bought out by a US industrial giant. \nGuidance Automation has been acquired by Matthews International Corporation of Pittsburgh for an undisclosed sum. \nThe existing management team is being kept on under the new ownership. \nBased in Meridian Business Park, Braunstone, Guidance builds around 1,500 electronic units a year – costing around £3,000 – which clients fit into their own machines in the US, Europe and elsewhere. \nE-commerce businesses make up a growing proportion of the final customers. \nRead more: 'Talks on Brexit vital if we are to prosper' \nManaging director Dr Paul Rivers said it had seen year-on-year growth of around 30 per cent since splitting from sister company Guidance Marine two years ago. \nHe said sales for the year ended November 30 are expected to be close to £3 million, and hoped that would grow by more than £1 million in the new year. \nThere are 23 staff, a figure which is also set to grow. \nMatthews had sales of $1.42 billion (£1.13 billion) in 2015 and is a specialist in logistics automation among other things. \nDr Rivers said talks had been underway for the past six months. \nHe said: \"We hope this will push up investment and productivity and our staff. \n\"We are very excited by this. Matthews have a much bigger reach because they have customers they are already dealing with that we will get introduced to globally. \n\"We will also have support from the parent company for patents, which is an important part of our business. \n\"We have already been growing by more than 30 per cent a year whereas the industry as a whole is growing at a rate of around 20 per cent \n\"In fairness we are really trying to push our global reach, and even countries such as China and India, where labour costs are lower, want automation.\" \nJan Grothusen, chief executive of Guidance Marine , said the sale of the subsidiary would be beneficial to shareholders and employees. \nHe said Guidance Automation has been operating as an independent company out of its own premises in Meridian for the past two years and was now looking forward to extending its reach in indoor logistics and warehousing applications. \nHe added: \"Guidance Marine is continuing to invest into research and development and new product development in order to serve their maritime client base with best-in-class position reference sensors and situational awareness technologies for today's offshore vessels and tomorrow's generation of autonomous vessels.\"", "external_links": [], "published": "2016-12-02T23:04:00.000+02:00", "crawled": "2016-12-02T18:43:08.040+02:00", "highlightTitle": ""}