{"organizations": [], "uuid": "909627a6499d8fa8081141ae953452e5afb1d18d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10687606.ece/ALTERNATES/s1200/JS79695921.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farmers-faced-year-challenges-new-12383376", "country": "GB", "domain_rank": 21960, "title": "Farmers faced a year of challenges but new opportunities lie ahead", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Farmers faced a year of challenges but new opportunities lie ahead", "spam_score": 0.0, "site_type": "news", "published": "2016-12-30T18:00:00.000+02:00", "replies_count": 0, "uuid": "909627a6499d8fa8081141ae953452e5afb1d18d"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/farming/farmers-faced-year-challenges-new-12383376", "ord_in_thread": 0, "title": "Farmers faced a year of challenges but new opportunities lie ahead", "locations": [], "entities": {"persons": [{"name": "george eustice", "sentiment": "none"}, {"name": "north dorothy fairburn", "sentiment": "none"}, {"name": "eustice", "sentiment": "none"}, {"name": "terry", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "will terry", "sentiment": "none"}, {"name": "dorothy fairburn", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "south tyne", "sentiment": "none"}, {"name": "fairburn", "sentiment": "none"}, {"name": "north lancashire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "haltwhistle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "lanchester", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}], "organizations": [{"name": "business farmers", "sentiment": "neutral"}, {"name": "rural payments agency", "sentiment": "none"}, {"name": "country land and business association", "sentiment": "none"}, {"name": "northern farming conference", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "rpa", "sentiment": "none"}, {"name": "environment agency", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "farmer recovery fund", "sentiment": "none"}, {"name": "cla", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Farmers faced a year of challenges but new opportunities lie ahead 2016 was a year of trials for North East farmers who entered the year with serious floods and were split over Brexit Share Sheep move to higher ground in Lanchester. Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIn our final review of 2016, Jonathon Manning considers the year for the region’s farming community. \nNorth East farmers had a challenging start to the year after floods continued to hit the region well into January. \nHeavy rain, caused by Storm Desmond in December, led to some of the worst flooding the area had ever seen. \nThe bad weather caused the Environment Agency to trigger flood warnings in 21 locations across the region and led to farmers in Haltwhistle being forced to evacuate their cattle after the river South Tyne burst its banks. \nThe floods sparked calls for further access to the Government’s Farmer Recovery Fund, which was originally set up in response to flooding in Cumbria, Northumberland and North Lancashire. \nThat call was answered in park just a few days ago when the Government created a new £720,000 grant for farmers in Northumberland and County Durham who invest in natural flood defences. \nMany farmers also suffered from delays in payments from the Rural Payments Agency (RPA). Although the RPA claimed it will make 90% of its 2016 payments by the end of the year, a number of farmers across the country are still to receive their payments for 2015. CLA North regional director Dorothy Fairburn (Photo: Publicity Pic) \nProlonged low farmgate prices in 2015 were blamed as the cause of the falling farm income. Early forecasts estimated that income would fall across almost all farming sectors, with the arable sector expected to take a 24% hit. \nDairy farmers also had a tricky year with many seeing income fall by 50% and milk prices hitting their lowest level since 2009 in March. \nPrices are now on the rise having after the market began to correct its supply and demand levels. In 2015 it was estimated that there was an over production of between 10% and 14% but now milk production is understood to be around 5% below demand levels. \nThe market changes caused milk prices to rise to around 32ppl up from a low of 16ppl in 2015. \nIncreased competition with overseas farmers has also become a cause for concern and Country Land and Business Association (CLA) director North Dorothy Fairburn appealed to consumers to support their local farms. \nMs Fairburn said: “At the recent Northern Farming Conference, much was said about the global strength of the ‘British Brand’ in terms of farming produce, and that we should capitalise on this in the years ahead. \n“The best way to support this brand is to encourage consumers locally to buy British food, and to make sure that food is adequately labelled as such. Food provenance will become increasingly important – and provides opportunities to ‘add value’ for farmers.” \nAs with many UK industries the result of the EU referendum led to some concern across the region’s agricultural businesses. George Eustice at the Northern Farming Conference \nWhile the NFU did not actively campaign or tell its members how to vote, the organisations official stance was to remain in the EU. \nWill Terry, chairman of the NFU’s North East regional board, raised concerns regarding tariffs of exporting farm produce to the EU after Brexit. \nMr Terry said: “Whether the UK will manage to cut a deal within the two years of Article 50 being introduced into Europe, it is appearing that it is very unlikely that we will be to do decent trade deals with Europe stright away, which would take us into a World Trade Organisation (WTO) situation. Read More North East farmers offered grants for natural flood management projects \n“As a sheep farmer that could have a massive impact on my business. The WTO best look is a 37.5% tarriff and the worst case scenario is 67% for sheep meat. Remembering that 38% of British lamb goes directly into Europe, that is a massive impact for a sheep farmer.” \nAs well as dividing the country the Brexit debate divided farmers across the region. Farming minister George Eustice told those who were still sceptical about leaving the EU that the farming industry had been presented with a fantastic opportunity. \nSpeaking at the Northern Farming Conference in Hexham Mr Eustice told farmers: “The EU got it wrong because it attempted to codify every single feature of the landscape and every single thing a farmer does with his land, which made it hopelessly bureaucratic. \n“The weakness of the EU schemes is that if they get it wrong it takes seven years to sort it out. We need to be much sharper. \n“The question is how best we can support agriculture. If we want good policy it needs to be rooted in good ideas. We need to remove the blinkers of EU membership and work together to build a policy that a decade from now the world will want to emulate. I am confident we can do that.” Like us on Facebook", "external_links": [], "published": "2016-12-30T18:00:00.000+02:00", "crawled": "2016-12-30T14:14:36.515+02:00", "highlightTitle": ""}