{"organizations": [], "uuid": "495fcba0ce9fb4f2dd0f6ddd6782910cb0be7db6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.liverpoolecho.co.uk/incoming/article12261644.ece/ALTERNATES/s1200/JS106367046.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/top-north-east-lib-dem-12263579", "country": "GB", "domain_rank": 21960, "title": "Top North East Lib Dem: We won the Richmond by-election by fighting on our own priorities", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Top North East Lib Dem: We won the Richmond by-election by fighting on our own priorities", "spam_score": 0.0, "site_type": "news", "published": "2016-12-02T20:00:00.000+02:00", "replies_count": 0, "uuid": "495fcba0ce9fb4f2dd0f6ddd6782910cb0be7db6"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/news/news-opinion/top-north-east-lib-dem-12263579", "ord_in_thread": 0, "title": "Top North East Lib Dem: We won the Richmond by-election by fighting on our own priorities", "locations": [], "entities": {"persons": [{"name": "zac goldsmith", "sentiment": "negative"}, {"name": "sarah olney", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "paddy ashdown", "sentiment": "none"}, {"name": "alan beith", "sentiment": "none"}, {"name": "ron beadle", "sentiment": "none"}], "locations": [{"name": "richmond", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "orpington", "sentiment": "none"}, {"name": "richmond park", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}], "organizations": [{"name": "gateshead council like", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eastbourne", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "rolling stones", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Independent candidate Zac Goldsmith (L) and Liberal Democrat candidate Sarah Olney (R) hear the results of the Richmond Park by-election count which Sarah Olney was announced as the winner Share Get daily   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThis week’s Liberal Democrat by-election victory in Richmond Park comes in the same week as the release of a new studio album by the Rolling Stones. \nWe have had to wait around a decade for both and there have been times when we thought we would never see either. \nI suspect more people will be happy about the Stones but for me and mine, Sarah Olney’s victory provided a heady combination of relief and delight. \nBack in the day, by which I mean the early 1960s to 2010, Liberal and subsequently Lib Dem by-election victories were ten a penny. \nTo us they stand as battles do for regiments: Orpington 1962, Berwick 1973, Bermondsey 1982, Eastbourne 1990, Leicester South 2004 and many others. \nWe won because our appeal was something like an average brand of margarine – we raised little animosity and little love and we could easily become a repository for those annoyed by their usual brand. \nOne result was that very few of these seats would stay with us at the following general election and the few exceptions required staggering levels of devotion by their MPs, such as our own Sir Alan Beith. \nThe reason was straightforward - unlike Labour and the Tories we had no natural base. The reason why Richmond Park is different is that it suggests we now might. \nFor this argument to make sense I must make a more general point about political allegiance. \nAll those involved in politics are challenged by disagreements with our party policy on some issue and people ask us why we don’t leave or why we argue for party policy in public when we disagree in private. \nThe answer to this is about priorities – people who give much of their lives to political causes do so because certain things matter very much to them and whilst they may be closer to other parties on other issues, these issues matter less. \nThe problem for post-war Liberals and Liberal Democrats was that the things that matter most to us – civil liberties, internationalism and constitutional change, hardly mattered to anyone else; and we knew it. \nOne consequence is that our by-election victories had very little to do with our core beliefs and in some cases have come despite them. \nPeople who were very illiberal voted for us in the early 90s over the poll tax and in the mid-2000s over Iraq; but they abandoned us as soon after. \nOur error was to base a whole electoral strategy on not frightening the horses, to present ourselves as the centre of British politics, trying to appeal just enough to everyone and thereby gaining real allegiance to very few. Read More North East now wants to stay in the European Union according to our Brexit poll \nSo as soon as we did something unpopular, by joining the Tories in coalition in 2010, our support evaporated. \nWhen I and others on the left predicted this we were derided by most of our colleagues; even on election night Paddy Ashdown said he would eat his hat if we did as badly as the polls suggested. ‘It won’t be that bad’, they said and in a sense they were right; it was worse. \nIn 2015 we were reduced to eight seats. My wing of the party were proven right, but it no longer mattered. \n2016 may have saved us however; by forcing us to fight on our true ground. Brexit, Trump and the growth of the far right across Europe have demonstrated that the liberal values that saw everything from the abolition of the death penalty to equal marriage; are now under threat. \nThose who never saw the point of a distinctly Liberal voice, who thought that other issues were more important – unemployment, health, defence, whatever, are now seeing what happened when the enemies of liberal values get their act together. \nRichmond Park is not only the first by-election win in a decade; it is the first by-election win fought on our own priorities in decades. \nWe won because we argued for a diverse Britain and the maintenance of free movement through a ‘soft Brexit’. \nAdmittedly, Richmond Park is radically different from most constituencies but the kind of people who voted for us there can found everywhere. \nThese are people who took liberal values for granted but can do so no longer. And we are their voice. \nRon Beadle is Deputy Leader of the Lib Dems on Gateshead Council Like us on Facebook", "external_links": [], "published": "2016-12-02T20:00:00.000+02:00", "crawled": "2016-12-02T15:17:12.603+02:00", "highlightTitle": ""}