{"organizations": [], "uuid": "39ad794bb5ec6c12cedb5d23f337569e23be429c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11581133.ece/ALTERNATES/s1200/JS94400239.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/commercial-property/year-property-were-hotels-student-12373767", "country": "GB", "domain_rank": 21960, "title": "The year in property: Were hotels and student schemes the biggest winners in 2016?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The year in property: Were hotels and student schemes the biggest winners in 2016?", "spam_score": 0.0, "site_type": "news", "published": "2016-12-28T12:00:00.000+02:00", "replies_count": 0, "uuid": "39ad794bb5ec6c12cedb5d23f337569e23be429c"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/commercial-property/year-property-were-hotels-student-12373767", "ord_in_thread": 0, "title": "The year in property: Were hotels and student schemes the biggest winners in 2016?", "locations": [], "entities": {"persons": [{"name": "keith stewart", "sentiment": "none"}, {"name": "chris donabie", "sentiment": "none"}, {"name": "cycas", "sentiment": "none"}, {"name": "nick atkinson", "sentiment": "none"}, {"name": "simon taylor", "sentiment": "none"}, {"name": "tony wordsworth", "sentiment": "none"}, {"name": "danny cramman", "sentiment": "none"}, {"name": "atkinson", "sentiment": "none"}, {"name": "chris dobson", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "sally ann norman", "sentiment": "none"}, {"name": "zerolight", "sentiment": "none"}], "locations": [{"name": "converg", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "amble", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "liveworks", "sentiment": "none"}, {"name": "newgate street", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "maldron hotel", "sentiment": "none"}, {"name": "eldon square", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "bridge house", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tyne valley retail park", "sentiment": "none"}], "organizations": [{"name": "stephenson quarter development", "sentiment": "negative"}, {"name": "newcastle  tony wordsworth", "sentiment": "none"}, {"name": "gainford group", "sentiment": "none"}, {"name": "savills", "sentiment": "none"}, {"name": "cairn group", "sentiment": "none"}, {"name": "salvus house", "sentiment": "none"}, {"name": "camberwell house", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "hta real estate", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "head of office agency", "sentiment": "none"}, {"name": "arch", "sentiment": "none"}, {"name": "hra", "sentiment": "none"}, {"name": "naylors", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "intu properties", "sentiment": "none"}, {"name": "county hotel", "sentiment": "none"}, {"name": "gva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Rocket at Stephenson Quarter Development in Newcastle, which will soon house hundreds of Convergys workers (Photo: Sally Ann Norman) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOur week of 2016 reviews turns to the commercial property world, with Coreena Ford casting her eye over what happened in 2016. \nIf we had a pound for every time we saw ‘Brexit’ and ‘uncertainty’ in the same sentence in business stories this year we’d all be property magnates by now. \nBut 2016 certainly has been dominated by those two words, and that has been the case particularly in the property world. \nThat said, the North East has seen a continuation of surging demand within a selection of sectors, notably student accommodation and leisure. \nIntu Properties’ £25m investment into its leisure offering finally came to fruition with the opening of (most of) Eldon Square’s new dining area Grey’s Quarter, and myriad student housing schemes opened across Newcastle, Sunderland and Durham, with more to come. \nHotels were hot property, with the announcement that Arch development company is planning a £4m hotel development in Amble, plans for a boutique hotel on Newcastle quayside moving a step closer, operators announced for hotels on Newgate Street and at the former BT offices Bridge House on the quayside. Zerolight's new offices at Liveworks, Newcastle (Photo: handout from Chris Dobson PR) \nAnd let’s not forget the Gainford Group acquisition of the County Hotel, Staybridge Suites’ buyout by Cycas and Cairn Group’s shopping spree following a major finance deal, as well Savills’ ongoing search for a multi-million pound Top Golf site in the North East. \nAll in all, it has been a relatively positive year, though not all sectors have fared well, with offices and industrials coming off worse, as property agencies in the North East will contest. Read More Tyne Valley Retail Park in Hexham bought by Arch for £7.39m \nThe market has generally been slower this year across the industrial sector, with North East agents reporting just six deals on units of over 50,000sqft in comparison to 2015 when 22 deals were completed over this size. \nNick Atkinson of HTA Real Estate said: “Despite a slow year across the sector, HTA Real Estate has for the second year running completed 50% of the larger scale industrial deals in the North East. \n“The lack of take-up can be partially attributed to the uncertainty surrounding Brexit but also the ongoing shortage of accommodation through lack of development. Most developers still require gap funding to bring forward speculative new builds which is hampering large-scale speculative development opportunities, despite there being demand.” An aerial shot of Team Valley taken in 2008 \nActivity levels picked up in Q4 and HRA is in negotiations on five of its development sites for design and build opportunities. \nMr Atkinson said key sectors which continue to drive demand in the market are automotive, e-tailing, manufacturing and pharmaceutical. Washington and County Durham continue to be hot spots for larger requirements. \nKeith Stewart, head of industrial agency at Naylors said the gap between demand for good quality industrial property in the market and supply remains. \nHe added: “We are seeing a number of design and build ienquiries are coming through. We expect 2017 to start delivering some of these opportunities even with the Brexit vote, as businesses need to expand.” Read More 17th century lodge used by the Prince Bishops of Durham could be yours for £1.5m \nChris Donabie, director at Naylors, added: “Big shed transaction volumes are down on last year but this is largely due to a lack of readily available stock to satisfy demand, which remains healthy. Occupiers are increasingly looking at design and build opportunities instead but there will be a lag before we see take up.” \nDanny Cramman, director in the industrial agency at GVA, Newcastle, said the region’s industrial market started to see some light at the end of the tunnel during 2014 after a tough six years, with 2015 seeing record levels of take up. \nThis was short lived however, he said, and the market has been fairly flat throughout the last year with take up levels well down on last year. A CGI of how the Maldron Hotel will look in Newcastle \nHe said: “Current availability as a percentage of total standing stock has fallen and we are now down to sub 5%. That figure has been fairly constant over the last 12 months and there was a sharp drop of take-up in 2016. \n“Despite the uncertainty in the market there are some encouraging signs, the number of schemes in the pipeline for next year is actually quite strong, maybe not when compared to the last development boom, but certainly when compared to recent years.” \nIn the office market, overall take-up dropped in 2016 compared with the previous year. \nSimon Taylor, head of office agency at Naylors, said: “Despite the overall take-up figures falling, the office agency team at Naylors have had a good year, especially with our activity in the out-of-town market. Q3 was particularly strong as we completed disposals of over 80,000 sq.ft. including Salvus House in Durham and Camberwell House in Sunderland. \n“The city centre has been a little quieter than we would have hoped this year but we have a good number of transactions in solicitor’s hands which should mean that 2017 starts strongly.” Tony Wordsworth, Director - Head of Office Agency, GVA, Newcastle \nTony Wordsworth, director of office agency at GVA, Newcastle, said that the region continued to see the downward availability of Grade A office availability within the city centre. \n“This lack of supply does start to cause significant issues for companies looking at inward investment opportunities for the city centre,” he said. \n“New supply to the market in 2016 included the completion of Liveworks and Rocket which together brought into the market just under 50,000 sqft of space. On a positive note, both these new build schemes were occupied within months of practical completion. \n“On the demand side, it is perhaps not surprising giving the Brexit vote that we have seen a slight reduction in office take-up during the course of 2016 as companies take a bit of ‘time out’ to consider the way forward. \n“We have continued to see within Newcastle and other northern university cities and the continued loss of office buildings and sites to alternative developments – mainly student. Newcastle has seen close to 500,000 sq ft of space lost to alternative uses.” Like us on Facebook", "external_links": [], "published": "2016-12-28T12:00:00.000+02:00", "crawled": "2016-12-28T09:12:13.169+02:00", "highlightTitle": ""}