{"organizations": [], "uuid": "582274d61feec37c45e57ea16c56b31bb16ae4db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12266546.ece/ALTERNATES/s1200/JS106397086.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-liberal-democrats-making-north-12266255", "country": "GB", "domain_rank": 21960, "title": "Could the Liberal Democrats be making a North East comeback?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Could the Liberal Democrats be making a North East comeback?", "spam_score": 0.0, "site_type": "news", "published": "2016-12-04T15:00:00.000+02:00", "replies_count": 0, "uuid": "582274d61feec37c45e57ea16c56b31bb16ae4db"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-liberal-democrats-making-north-12266255", "ord_in_thread": 0, "title": "Could the Liberal Democrats be making a North East comeback?", "locations": [], "entities": {"persons": [{"name": "tom watson", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "farron", "sentiment": "none"}, {"name": "sarah olney", "sentiment": "none"}, {"name": "olney", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "julie porksen", "sentiment": "none"}, {"name": "cllr greg stone  greg stone", "sentiment": "none"}, {"name": "goldsmith", "sentiment": "none"}, {"name": "ms olney", "sentiment": "none"}, {"name": "zac goldsmith", "sentiment": "none"}, {"name": "coun stone", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "richmond", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "richmond park", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "city durham", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Could the Liberal Democrats be making a North East comeback? Lib Dems won in Richmond as the party of the 48 per cent, so could it happen here? Share Newly-elected Liberal Democrat MP Sarah Olney speaks to the media following her victory in the Richmond Park by-election on December 2, 2016 Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAfter their surprise win in Richmond Park, could Liberal Democrats make a comeback in the North East as “the party of the 48%”? \nThe Lib Dems have plenty to celebrate after overturning a 23,015 majority to defeat former Tory MP Zac Goldsmith in the outer London seat. \nIt’s their first big win since losing 49 seats in the 2015 general election, including Berwick-upon-Tweed in Northumberland . \nThey’ve had to suffer the indignity of losing their official status as the third-largest party in the House of Commons and the perks that go with it, such as a guaranteed chance to question the Prime Minister once a week. \nBut last week’s by-election victory suggests the Lib Dems could make a comeback by painting themselves as the only party willing to represent the 48 per cent of voters who opposed Brexit in June’s EU referendum . Liberal Democrat leader Tim Farron (R) and Sarah Olney (C) speak to the media following Colney's victory in the Richmond Park by-election on December 2, 2016 \nMr Goldsmith prompted Thursday’s election, in which he stood as an independent, when he quit as a Conservative MP in protest at the Government’s decision to back a third runway at Heathrow Airport. \nBut Lib Dem candidate Sarah Olney also opposed a third runway. And she attempted to turn the election into a vote about Brexit. \nA majority of Richmond’s voters backed the “remain” campaign earlier this year, but Mr Goldsmith was a staunch supporter of “leave”. \nBy contrast, Lib Dem leader Tim Farron says his party could vote against article 50, the formal mechanism for quitting the EU - and Ms Olney, says she definitely will. \nIt seemed to pay off when she won the by-election by 20,510 votes to 18,638. \nThe question is whether a similar approach could work in the rest of the country, including the North East. \nIn Newcastle, the referendum vote was narrowly in favour of remaining in the EU. \nAnd while the rest of the region voted to leave, the result was close. For example, in Northumberland, 54% voted to leave. \nEven some of those who wanted to quit may be having second thoughts now, Lib Dems believe. Cllr Greg Stone \nGreg Stone, a party spokesman in the North East and Newcastle councillor, said: “We are perceiving a move back to remain in the North East. \n“There is a constituency out there of voters who may not be the majority in most of the North East constituencies, but certainly in places like Newcastle and the City Durham, we are sensing there is a pro-remain section of the electorate. \n“Certainly, the Richmond results gives a very clear indication that there are people out there who are willing to listen to the Liberal Democrats.” \nAnd pro-remain voters don’t have anyone else to represent them, because Labour has confirmed it will vote in favour of Article 50 no matter what. Read More Top North East Lib Dem: We won the Richmond by-election by fighting on our own priorities \n“Some voters seem to be underwhelmed by Labour’s present position, and increasingly bemused by the lackluster position of Labour under Jeremy Corbyn.” \nLabour Deputy Leader Tom Watson , in a speech in November, accused the Liberal Democrats of seeking only to speak for a minority of voters - although 48 per cent is a pretty big minority. \nBut Coun Stone insists the party isn’t bothered. “We are quite enjoying the freedom of speaking for the liberal, progressive elements of the electorate,” he said. Liberal Democrat leader Tim Farron (R) and Sarah Olney (C) speak to the media following Olney's victory in the Richmond Park by-election on December 2, 2016 \nIt’s worth noting that the Lib Dems haven’t actually pledged, as a party, to try to block Brexit. Mr Farron’s position is that he will tell MPs to vote against Article 50 unless the Government agrees to hold a second referendum, this time to endorse the Government’s plan for exiting the EU. \nEven so, there may be a danger that presenting themselves as a pro-EU party will actually put off potential voters. \nJulie Porksen, the party’s candidate in the Northumberland seat of Berwick-upon-Tweed in 2015, argues that the Richmond win wasn’t all about Europe. \nVoters also back the Lib Dems on issues such as the NHS and creating a fairer society, she says. \n“One of the other big issues expressed in the Richmond by-election was the NHS, because its very apparent that the Conservatives want to strip the NHS to the bone.” \nMr Farron has insisted the win was “the beginning of something special”. \nBut whether what works in a wealthy pro-EU suburb of London can have the same effect in the more eurosceptic North East remains to be seen. Like us on Facebook", "external_links": [], "published": "2016-12-04T15:00:00.000+02:00", "crawled": "2016-12-04T11:35:06.545+02:00", "highlightTitle": ""}