{"organizations": [], "uuid": "a0f211684846f25692fc3efb4f86e5bc3e5ef60c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11522031.ece/ALTERNATES/s1200/JS93395447.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northumbria-police-chief-warns-brexit-12277405", "country": "GB", "domain_rank": 21960, "title": "Northumbria Police chief warns Brexit could draw more foreign criminals to the UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Northumbria Police chief warns Brexit could draw more foreign criminals to the UK", "spam_score": 0.0, "site_type": "news", "published": "2016-12-06T02:09:00.000+02:00", "replies_count": 0, "uuid": "a0f211684846f25692fc3efb4f86e5bc3e5ef60c"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northumbria-police-chief-warns-brexit-12277405", "ord_in_thread": 0, "title": "Northumbria Police chief warns Brexit could draw more foreign criminals to the UK", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "ashman", "sentiment": "none"}, {"name": "steve ashman", "sentiment": "none"}], "locations": [{"name": "uk brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "knutsford cheshire", "sentiment": "none"}, {"name": "knutsford", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "northumbria police", "sentiment": "negative"}, {"name": "uk news northumbria police", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Northumbria Police chief warns Brexit could draw more foreign criminals to the UK Brexit may see an influx of foreign criminal gangs seeking to avoid the European arrest warrant, says Steve Ashman Share A European Union flag, with a hole cut in the middle, flies at half-mast outside a home in Knutsford Cheshire after today's historic referendum on June 24, 2016 in Knutsford, United Kingdom (Photo: Christopher Furlong/Getty Images) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nForeign criminal gangs may consider relocating to the UK after Brexit , the Chief Constable of Northumbria Police has warned. \nThe force’s top cop Steve Ashman has dismissed the argument of those who campaigned to leave the EU that Britain’s departure would lead to a reduction in foreign criminals operating in the UK. \nIn an interview with the Guardian, Mr Ashman said that he would be very concerned if Brexit meant UK police could no longer apply for a European arrest warrant (EAW) or have access to surveillance and information-sharing systems from their European counterparts. \nHe said: “I think if you lose the ability to extradite people effectively then one might also argue that that’s going to make us quite attractive to a particular criminal group. \n“I think we are always going to have a problem with foreign national offenders. \n“What’s important to me – and, I think, what’s important for UK law enforcement – is that we have effective and efficient means of dealing with them when they are here. \n“Because I think we are dreaming if we think the position is ever going to be arrived at when there are no foreign national offenders in this country.” The new Northumbria Police Chief Constable, Steve Ashman \nMore than 900 suspected serious criminals, including paedophiles, rapists and murderers, have been extradited either in or out of this country, thanks to the EAW. \nMr Ashman said the Government must acknowledge that membership of the EU had brought real policing benefits. \n“We have benefited from our access to information from our European counterparts, our ability to form joint investigation teams where you have cross-border criminal behaviour and our ability to secure European arrest warrants,” he said. \n“[These] are clearly working and have worked for a number of years. I would have some real concerns if we were to walk away from or tear up those agreements.” \nMuch of the Northumbria Police force area, which serves a population of 1.5 million people and covers an area of more than 2,000 square miles, voted to leave the EU. \nOnly Newcastle voted to stay - by a narrow 1% margin. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2016-12-06T02:09:00.000+02:00", "crawled": "2016-12-05T22:34:46.832+02:00", "highlightTitle": ""}