{"organizations": [], "uuid": "f8cc7ba02d5f4a35b7fe31dfb339b33450596abc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12301988.ece/ALTERNATES/s1200/Unemployment-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-suffering-job-losses-12300377", "country": "GB", "domain_rank": 21960, "title": "North East suffering job losses as the rest of the country prospers, survey says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East suffering job losses as the rest of the country prospers, survey says", "spam_score": 0.0, "site_type": "news", "published": "2016-12-12T07:01:00.000+02:00", "replies_count": 0, "uuid": "f8cc7ba02d5f4a35b7fe31dfb339b33450596abc"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-suffering-job-losses-12300377", "ord_in_thread": 0, "title": "North East suffering job losses as the rest of the country prospers, survey says", "locations": [], "entities": {"persons": [{"name": "leigh taylor", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "business north east", "sentiment": "negative"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "sme banking", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "lloyds bank commercial banking", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East suffering job losses as the rest of the country prospers, survey says The North East is the only region in the country to suffer job losses, according to Lloyds Banking Group Share The entrance to a Jobcentre Plus (Photo: Philip Toscano/PA Wire) Share Get business   \nJob losses have hit the North East while the rest of the country has seen an increase in employment figures, a new survey suggests. \nThe North East PMI report from the Lloyds Banking Group found that 16.7% of businesses were employing less people in November than in October while only 2.4% of businesses had increased their headcount month-on-month. \nThe bank’s survey - which is based on a representative sample of businesses in the region - found that the North East was also the only region in the country to record “modest job losses” over the last three months, while the east of England saw the biggest rise in employment. \nLloyds’ report comes a few days before official employment statistics are due to be published by the Office for National Statistics, which will be closely watched as people try to see whether the Brexit vote in June, the plunge in the value of Sterling and other factors have hit employment prospects. \nThe North East has historically had the highest levels of unemployment in England, though most recent data has shown the region closely the gap with the rest of the country, albeit slowly. Leigh Taylor, area director, SME Banking in the North East, at Lloyds Bank Commercial Banking \nLeigh Taylor, regional director at Lloyds Bank Commercial Banking, said: “Growth in the North East private sector lost some ground in November, which led to job losses. \n“The region has fallen behind the pace of the general trend we’re seeing across the UK, but it is moving in the right direction. Competitive pricing should help firms to recover some of the ground lost and secure more work in this current environment.” \nAlthough businesses were found to be shedding jobs across the North East, local companies did grow their output last month. \nThe PMI index is used to show how the output of manufacturers and service providers has changed each month. A score of above 50 means that output has increased. \nThe North East was given a score of 52.2, signalling an increased in output during November. The rate of growth slowed compared to October when the PMI index was 53.8. Like us on Facebook", "external_links": [], "published": "2016-12-12T07:01:00.000+02:00", "crawled": "2016-12-12T02:08:26.093+02:00", "highlightTitle": ""}