{"organizations": [], "uuid": "73c13e40d77eb690be911ecb574562d174327371", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29976151/15736936.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/trousergate-loughborough-mp-micky-morgan-banned-from-downing-street-for-criticising-pm-s-leathers/story-29976151-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Trousergate: Loughborough MP Nicky Morgan 'banned' from Downing...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published Trousergate: Loughborough MP Nicky Morgan 'banned' from Downing...", "spam_score": 0.0, "site_type": "news", "published": "2016-12-12T17:14:00.000+02:00", "replies_count": 0, "uuid": "73c13e40d77eb690be911ecb574562d174327371"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/trousergate-loughborough-mp-micky-morgan-banned-from-downing-street-for-criticising-pm-s-leathers/story-29976151-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Trousergate: Loughborough MP Nicky Morgan 'banned' from Downing...", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "nicky morgan", "sentiment": "negative"}, {"name": "theresa", "sentiment": "none"}, {"name": "burt", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "morgan", "sentiment": "none"}, {"name": "adam stares", "sentiment": "none"}, {"name": "hill", "sentiment": "none"}, {"name": "ken clarke", "sentiment": "none"}, {"name": "ms hill", "sentiment": "none"}, {"name": "ms morgan", "sentiment": "none"}, {"name": "tory alistair burt", "sentiment": "none"}, {"name": "fiona hill", "sentiment": "none"}, {"name": "nicky", "sentiment": "none"}], "locations": [{"name": "loughborough", "sentiment": "none"}, {"name": "bahrain", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "loughborough", "sentiment": "negative"}, {"name": "bbc one", "sentiment": "none"}, {"name": "ms morgan", "sentiment": "none"}, {"name": "former cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nA bitter spat erupted between a top aide to Theresa May and Nicky Morgan after the former Cabinet minister was banned from a No 10 meeting in a row over the Prime Minister's trousers. \nFiona Hill branded the sacked former education secretary \"that woman\" after Ms Morgan was publicly critical of the PM's decision to wear leather trousers that cost nearly £1,000 during a photo shoot for a newspaper. \nThe joint chief of staff had previously met with Ms Morgan and fellow Tory Alistair Burt and invited them to a meeting with Mrs May about their views on Brexit next week. \nBut text messages the Mail on Sunday said it obtained show that Ms Hill texted Mr Burt to tell him \"Don't bring that woman to No 10 again\" after she spoke out about the premier's decision to pose in Amanda Wakeley-designed ''bitter chocolate'' trousers. \nMs Morgan, however, found out about the message and sent the aide a stinging riposte. \nRead more: Syrian family of eight continued to live in single room after moving into Leicestershire house \nThe message seen by the Mail on Sunday said: \"If you don't like something I have said or done, please tell me directly. No man brings me to any meeting. Your team invites me. If you don't want my views in future meetings you need to tell them.\" \nMs Hill, believed to be referring to the pair attending the previous meeting together, replied: \"Well, he just did. So there!\". \nEarlier this week Mrs May insisted she was not out of touch with ordinary people because she opted to wear costly clothing. \nSpeaking during trip to Bahrain, the PM said: ''Look, I stood on the steps of Downing Street and said what I did about the importance of a country that works for everyone because that is what I have heard from people as I have gone around the country, as I have met people in a whole variety of circumstances. \n''I believe it is important for politicians to get out and about and that's exactly what I continue to do. It is important that we have a country that works for everyone.'' \nMs Morgan had expressed doubts about the fashion choice, insisting: ''My barometer is always: 'How am I going to explain this in Loughborough market?''' \nThe MP said the trousers had been ''noticed and discussed'' in Tory circles. Ms Morgan said: ''I don't have leather trousers. I don't think I've ever spent that much on anything apart from my wedding dress.'' \nMs Morgan said being a backbencher at a time of \"weak\" opposition meant she had a duty to scrutinise the Government over Brexit. \nIn a pre-recorded interview the Remain campaigner, standing in front of a framed portrait of Mrs May, told BBC One's Sunday Politics: \"Nobody comes into politics to be a thorn in their party leader's side. But, at the end of the day, it is such a massive issue that if you don't stand up for what you believe in I'm not sure what the point is of going into politics.\" \nAdam Stares, deputy chairman of Ms Morgan's Loughborough constituency association, said he had \"no idea what she is playing at\". \nHe told the programme: \"There's a lot of people who think she is taking side-swipes at the Government and at Theresa May.\" \nFormer Cabinet minister Ken Clarke said it was \"tedious\" that stories about what women politicians were wearing featured in the newspapers. \nHe said: \"I feel sorry for women in politics. \n\"I'm glad to say men in politics don't have great news stories about what they are wearing. In my case, apart from my suede shoes, I'm probably very lucky because I'm not a very snappy dresser. \n\"Nicky and Theresa, I hope, will have some serious political discussions. If they want to have an argument about what they are wearing I think all their closest friends would advise them to keep that private.\"", "external_links": [], "published": "2016-12-12T17:14:00.000+02:00", "crawled": "2016-12-12T15:02:00.050+02:00", "highlightTitle": ""}