{"organizations": [], "uuid": "20fa5056418ed00c1f9834be13f848c29aed8af7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11816587.ece/ALTERNATES/s1200/JS69403219.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12362593", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: US Department of Justice launches legal action against Barclays", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: US Department of Justice launches legal action against Barclays", "spam_score": 0.0, "site_type": "news", "published": "2016-12-23T15:15:00.000+02:00", "replies_count": 0, "uuid": "20fa5056418ed00c1f9834be13f848c29aed8af7"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12362593", "ord_in_thread": 0, "title": "Business Breakfast LIVE: US Department of Justice launches legal action against Barclays", "locations": [], "entities": {"persons": [{"name": "paul menefee", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hann-ju ho", "sentiment": "none"}, {"name": "john t carroll", "sentiment": "none"}, {"name": "jonathon", "sentiment": "none"}, {"name": "loretta lynch", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "us department of justice", "sentiment": "negative"}, {"name": "barclays", "sentiment": "negative"}, {"name": "lloyds bank", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "doj", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "credit suisse", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The FTSE-100 index opened at 7063.68. \nThe pound at 8am was 1.2282 dollars compared to 1.2302 dollars at the previous close. \nThe euro at 8am was 0.8496 pounds compared to 0.8499 pounds at the previous close. 8:23 Jonathon Manning Business confidence hits highest level since March despite Brexit uncertainty \nConfidence among firms has reached its highest level since March despite ongoing uncertainty over the Brexit vote and the US presidential election victory of Donald Trump. \nUK business confidence rose by seven points to 39% in December, according to Lloyds Bank’s business barometer. It was driven by a 16-point jump in economic optimism to 30%. \nHann-Ju Ho, senior economist at Lloyds, said: \nAlthough significant uncertainties lie ahead, for now, economic optimism in our December survey has recovered near to levels seen at the start of the year. \nIn addition, confidence this year has held up much better than it did during the global financial crisis. \nWhile business confidence is on the rise, hiring intentions dropped to their lowest level since February, with the net balance of firms looking to bolster their workforces dropping two points to 22%. \nCompanies’ business prospects slipped three points to 47%, but confidence in consumer services, including retail, hit its highest level since March after clocking up a one-point rise to 37%. \nMeanwhile, the net balance of firms looking to boost prices climbed by three points to 17% following sterling’s plunge in the wake of the Brexit vote. \nBritain’s economy is expected to grow by 0.4% in the fourth quarter, down from 0.5% in the previous three months, according to the Bank of England. A man waves the EU flag in front of the Supreme Court (Photo: Getty Images Europe) 8:19 KEY EVENT Barclays faces legal action by US Department of Justice \nThe US Department of Justice (DoJ) has launched legal action against Barclays over the sale of toxic mortgage-backed securities in the lead-up to the financial crisis. \nThe civil complaint, filed in a New York court, accuses the British bank and employees of misrepresenting the quality of loans they sold to tens of thousands of investors between 2005 and 2007 in the run-up to the country’s financial meltdown. \nThe DoJ claims that investors, which included credit unions, pension plans and university endowments, lost billions of dollars. The lender falsely assured investors that it had excluded “unacceptable” loans, and that it had conducted due diligence on the loan pools it had securitised, according to the complaint. \nTwo former Barclays executives - John T Carroll and Paul Menefee - were named as individual defendants in the lawsuit accused of playing key roles in the alleged fraud. The DoJ has not specified a sum it is seeking from Barclays for settling the action. \nAttorney general Loretta Lynch said in a statement: “As alleged in this complaint, Barclays jeopardised billions of dollars of wealth through practices that were plainly irresponsible and dishonest.” \nA Barclays spokesman said: \nBarclays rejects the claims made in the complaint. Barclays considers that the claims made in the complaint are disconnected from the facts. \nWe have an obligation to our shareholders, customers, clients and employees to defend ourselves against unreasonable allegations and demands. Barclays will vigorously defend the complaint and seek its dismissal at the earliest opportunity. \nSeparately, German lender Deutsche Bank has agreed to pay $7.2bn (£5.8bn) as part of the DoJ’s investigation into the sale of mortgage-backed securities. \nThe figure is considerably lower than the $14bn (£11.3bn) originally sought. Credit Suisse has reached a $5.28bn (£4.2bn) settlement. \nBanks have reached multibillion-dollar settlements with the US government over the sale of securities that were promoted as safe investments in the lead-up to the housing market crash, but were in fact bundles of mortgages from borrowers unlikely to be able to repay their loans. A Barclays bank branch", "external_links": [], "published": "2016-12-23T15:15:00.000+02:00", "crawled": "2016-12-23T10:26:23.802+02:00", "highlightTitle": ""}