{"organizations": [], "uuid": "4075fecc2f985b234d3a89dc3c8e2abdb02f0b69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12256074.ece/ALTERNATES/s1200/JS106045275.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-grainger-plc-12253906", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Grainger Plc heralds transformational year, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Grainger Plc heralds transformational year, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-12-01T15:20:00.000+02:00", "replies_count": 0, "uuid": "4075fecc2f985b234d3a89dc3c8e2abdb02f0b69"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-grainger-plc-12253906", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Grainger Plc heralds transformational year, plus latest news", "locations": [], "entities": {"persons": [{"name": "michael taylor", "sentiment": "none"}, {"name": "mark maslin", "sentiment": "none"}, {"name": "lucien georgeson", "sentiment": "none"}, {"name": "mark hodges", "sentiment": "none"}, {"name": "harry potter", "sentiment": "none"}, {"name": "grainger", "sentiment": "none"}, {"name": "davy zyw", "sentiment": "none"}, {"name": "maslin", "sentiment": "none"}, {"name": "helen gordon", "sentiment": "none"}, {"name": "laithwaite", "sentiment": "none"}, {"name": "michael mcgee", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "paul zwillenberg", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "zwillenberg", "sentiment": "none"}, {"name": "milton keynes", "sentiment": "none"}, {"name": "liz dean", "sentiment": "none"}, {"name": "keith taylor", "sentiment": "none"}, {"name": "peckham", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "malton", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "central england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "thames estuary", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ferryhill", "sentiment": "none"}, {"name": "north yorkshire", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "romford", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "grainger plc", "sentiment": "negative"}, {"name": "slough", "sentiment": "none"}, {"name": "dmgt", "sentiment": "none"}, {"name": "euromoney", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "gb energy", "sentiment": "none"}, {"name": "rmt accountants", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "energy uk", "sentiment": "none"}, {"name": "sse", "sentiment": "none"}, {"name": "daily mail & general trust", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "chilton industrial estate", "sentiment": "none"}, {"name": "co-operative energy", "sentiment": "none"}, {"name": "southend", "sentiment": "none"}, {"name": "university college london", "sentiment": "none"}, {"name": "contego pest control", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "british gas", "sentiment": "none"}, {"name": "coreena ford daily mail & general trust", "sentiment": "none"}, {"name": "coreena ford british gas", "sentiment": "none"}, {"name": "contego environmental services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Ponteland pinto grigio anyone? North East tipped to become a major wine producer and exporter \nThe North East could become part of a thriving UK wine industry by the end of the century, according to a new report. \nThe UK’s changing levels of temperature and rainfall could produce ideal conditions for sauvignon blanc and chardonnay in as yet unfamiliar wine areas such as Peckham and Milton Keynes, according to the University College London study for Laithwaite’s Wine. \nAnd the North East and Newcastle are predicted to be the best places to produce and export pinot grigio. \nProfessor Mark Maslin and Lucien Georgeson used average temperature and rainfall conditions required for growing different grape varieties with predicted changes in climate to map changes to British viticulture over the next 85 years. \nThey worked on the theory that temperatures are expected to increase by at least a further 2.2C by 2100 and rainfall will increase by 5.6%. \nProfessor Maslin said: “Climate is critical to successful grape cultivation. This study could signal how we think long-term about British wine production and redraw the future wine map of the world. “However, exactly where would be best for particular grapes will depend on site, slope, aspect, soil and drainage as wine-making is as much an art as it is a science.” \nDavy Zyw, of Laithwaite’s Wine, said: “It’s not long ago that experts scoffed at the idea of English, let alone wider British wine. \n“Now thanks to a changing climate, as well as passion and expertise, we could see wine buyers from all over the world coming to taste the latest UK vintages in a few generations.” \nThe study said malbec could be produced in the Thames Estuary area in places such as Romford, Southend and as far west as Slough, while the Severn Pocket would eventually be perfect for merlot. Changing conditions in the Midlands and Central England could see the Black Country cultivating a number of grape varieties such as chardonnay, Riesling, pinot noir and sauvignon blanc, while the North East of England including Newcastle and as far north as Edinburgh are predicted to be the best place for pinot grigio. The Ryedale Vineyards near Malton in North Yorkshire could soon be joined by vineyards in the North East (Photo: Anna Gowthorpe/PA Wire) 8.55 KEY EVENT Birdman Michael spreads wings to London as bird and pest control firm expands \nA County Durham entrepreneur once responsible for caring for Harry Potter’s owl has flown the nest to open the latest office of his bird and pest control business. \nMichael Taylor began his career working as an animal handler and trainer in the film industry, with his birds getting starring roles in the second and third installments of the Harry Potter movies, The Chamber Of Secrets and The Prisoner Of Azkaban. \nA conversation with a colleague on the film set gave him the idea of how to use his skills commercially, and on returning to his native North East in 2004, he set up Contego Environmental Services. \nHeadquartered on the Chilton Industrial Estate in Ferryhill, the company quickly began to take on other aspects of pest control work before expanding into other parts of the UK. \nContego, which has grown to employ 22 people, now offers the full range of bird and pest control services, including population and site management, and pest proofing. \nThe business has offices in central Scotland and Aberdeen, and as part of national expansion plans it has acquired a rival with an office in central London from which clients across the south of England will be serviced. Michael Taylor MD of Contego Pest Control pictured with Michael McGee of RMT Accountants (Photo: Keith Taylor) 8.52 Coreena Ford Could you win the Not-for-profit Organisation of the Year award? \nProfits are often an all-important part of the region’s business community, yet there are numerous not-for-profit organisations which play a vital role in the North East. \nThat’s why the Journal and its sister paper, The Gazette in Teesside, are celebrating that crucial contribution through the North East Business Awards 2017. \nThe Not-for-profit Organisation of the Year is named at the grand final of our annual event as we do not have this category at our three regional heats. \nAll entries, from wherever they are based in the region, are considered for this award before a shortlist of three is announced ahead of the grand final. \nLast year, the category winner was the International Centre for Life (ICFL), which opened in 2000, borne out of an entrepreneurial spirit and a commitment to creating a self-sustaining science village. \nBased in the heart of Newcastle, almost 600 people from 35 countries work at the centre, where researchers, doctors and nurses work alongside people in the fields of education, public engagement and business. The 2016 North East Business Awards Grand Final. The Not-for-Profit Organisation of the Year winner was the International Care for Life represented by Liz Dean, sponsored by Square One Law represented by Neil Warwick 8.45 Coreena Ford Daily Mail & General Trust flags Brexit risk despite profits increase \nDaily Mail & General Trust, the publisher behind the Brexit-backing tabloid, has seen a rise in full year profits but again flagged that the vote to quit the EU represents a risk to the business. \nDMGT, which also produces the Mail on Sunday and freesheet Metro, saw pre-tax profits rise 14% to £247m in the year ending September 30, while revenue rose 4% to £1.9 billion. \nBut the company warned that the result of the referendum meant a potential weakening of the economy, “particularly if consumer led, could accelerate the decline in print advertising revenue”. \nIn September, the group said it was axing 400 jobs as it battled against plunging advertising income. Its financial publishing unit Euromoney could also take a hit from “uncertainty in the financial services sector”, the group added. \nOn the single market, the company said that because it has limited trade with the bloc, it is not dependent on access to it. Chief executive Paul Zwillenberg said: “DMGT’s results reflect the ongoing resilience of the portfolio through varying market conditions. \n“Revenues were supported by good organic growth in many of our B2B and consumer digital operations. This was balanced by challenging market conditions for print advertising, property information, energy and financial sectors.” \nOver the year, print advertising revenue across the group fell 12%. This translated to a 5% dip in revenue at the Daily Mail and Mail on Sunday to £484 million. But the group’s successful MailOnline operation recorded a 19% rise in sales to £93 million. Mr Zwillenberg said:“The significant organic and M&A investments made across the group over the past few years have started to bear fruit. Alongside this we have been expanding MailOnline while our newspapers continue to outperform the market. “The group has many strengths.” 8.40 Coreena Ford British Gas delivers price freeze in Christmas message to customer \nEnergy giant British Gas has announced a price freeze for more than six million customers on standard tariffs over the winter. \nThe UK’s biggest energy supplier will keep its gas and electricity standard variable tariffs on hold until at least March. British Gas said it would provide “peace of mind” for standard variable customers. \nThe move follows SSE’s price freeze last month until at least April and comes amid pressure on energy firms to treat loyal customers fairly, while a report recently accused Britain’s Big Six suppliers of overcharging families and making six times the profit they admit to publicly. \nBritish Gas also said it will ensure all existing and new customers can access its best deals from next year and will launch an energy health check for standard variable customers to make sure they are on the right tariff. \nIn a Christmas message to customers, British Gas chief executive Mark Hodges said: “The commitments we’ve made today show British Gas has been thinking hard about ways to improve how the energy market works for all our customers, and is taking tangible action. \n“You will see us doing even more in the coming months.” \nBritish Gas added that its standard variable tariff was already the second cheapest in the market. It has also launched a deal allowing households to fix energy prices for three winters, until March 2019. \nBusiness Secretary Greg Clark recently met energy company representatives to discuss concerns that they were abusing customer loyalty following a report commissioned by industry lobby group Energy UK. \nThe report found the cost of supplying a home with gas and electricity “falls well below” what households pay, averaging around £844 while families pay as much as £1,172 with some suppliers - giving profit margins of up to 28%. \nBut wholesale energy prices have been rising, leading to the collapse of smaller provider GB Energy earlier this week. It had recently hiked tariffs by as much as a third, while other small suppliers have also had to increase prices. \nGB Energy’s 160,000 customers have since been taken on by Co-operative Energy, which is honouring outstanding credit balances and tariffs for GB’s customers. Gas burns on a cooker (Photo: Matt Cardy/Getty Images) 8.30 KEY EVENT Newcastle's Grainger Plc toasts \"transformational\" year \nGrainger Plc, the UK’s largest listed landlord, has described 2016 as a transformational year in which rental income rose 15% to £37.4m. \nThe firm shifted its focus towards investing in the private rented sector soon after Helen Gordon carried out a full review of the business when she took over as chief executive officer earlier this year. \nAnd the strategy is paying dividends - literally - with the directors noting marked progress in its strategy. \nPlans were announced to invest around £850m into the sector, and £389m has so far been invested, with a further £347m in the planning or legal process. \nNet rental income is up 15% to £37.4m and adjusted earnings are up 69% to £53.1m. \nPre-tax profits, meanwhile, have soared by 64% to £84.2m. \nDirectors have announced a 64% increase in the dividend to 4.5p. \nHelen Gordon said: “FY16 has been a transformational year, with significant progress made in delivering our private rented sector growth strategy which we set out in January. \n“We have secured £389m of investment, disposed of our non-core businesses, improved the capital structure of the company and reduced operational costs following an internal restructure. \n“We have delivered strong financial results alongside these changes, with adjusted earnings increasing by 69% to £53.1m and a total return of 10.6%. \n“The private rented sector growth opportunity is very compelling. \n“With capacity to invest and a repositioned business, we are well placed to significantly improve our income and shareholder returns as we achieve our strategic objectives. “The new financial year started well, we have secured new investments, further developed our PRS pipeline and the benefits are starting to come through from the actions taken to reduce costs. I am confident in our future prospects and Grainger’s new, simpler and more focused structure which has strengthened our business and competitive position. I look forward to providing further updates on our progress throughout the year. Helen Gordon, CEO of Grainger plc Share", "external_links": [], "published": "2016-12-01T15:20:00.000+02:00", "crawled": "2016-12-01T11:28:45.465+02:00", "highlightTitle": ""}