{"organizations": [], "uuid": "e6d6bd7f6b825b72ba860d679d95fd77afd15b30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29994600/15751379.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/interview-pall-ex-founder-and-dragon-s-den-star-hilary-devey/story-29994600-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Former Dragon's Den star Hilary Devey tells story of Pall-Ex | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Former Dragon's Den star Hilary Devey tells story of Pall-Ex | Leicester Mercury", "spam_score": 0.73, "site_type": "news", "published": "2016-12-20T13:00:00.000+02:00", "replies_count": 0, "uuid": "e6d6bd7f6b825b72ba860d679d95fd77afd15b30"}, "author": "", "url": "http://www.leicestermercury.co.uk/interview-pall-ex-founder-and-dragon-s-den-star-hilary-devey/story-29994600-detail/story.html", "ord_in_thread": 0, "title": "Former Dragon's Den star Hilary Devey tells story of Pall-Ex | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "hilary devey", "sentiment": "negative"}, {"name": "den", "sentiment": "negative"}, {"name": "duvalay", "sentiment": "none"}, {"name": "alan colleran", "sentiment": "none"}, {"name": "will brexit", "sentiment": "none"}, {"name": "liz", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "far east", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "tower bridge", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "staffordshire", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "leicester mercury comments", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "st katherine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nThank you very much for agreeing to an interview. How does it feel to be celebrating Pall-Ex's 20th birthday? \nIt's a fantastic feeling! We've come such a long way as a company over the past twenty years, and I couldn't be prouder of my magnificent staff for being part of that journey, and contributing to our collective achievements \nWe hear you are based in London. How are you are enjoying life splitting your time between your London home and your Leicester business? \nI'm currently based at St Katherine's Dock in London, a stone's throw from Tower Bridge, which is a wonderful area to live in. Despite the relative distance between my home and Leicester, I find it benefits the business by being able to split my time between locations.I frequently have meetings in the capital so it's certainly important to have a base here. \nRead more: Who's Who 2017: Eight people from Leicestershire among new entries \nDo you still have a home in the Midlands? How much time are you able to spend here overseeing the business? Maybe you wish you were able to spend more time here? \nI keep a property in the Staffordshire area, because it'd be too tiring to dart back and forth to London all the time! I do think it's important to have a presence near the Pall-Ex HQ, but I think I have the balance right in terms of how much time I spend there, with large portions of my working days allocated to meetings on behalf of the company, both in London, and internationally. \nHow do you feel having won the highly coveted Lifetime Achievement Award at the second Leicestershire Women in Business Awards? \nIt honestly is such an honour. Awards like these do a really important job in highlighting the achievements of women in business, so I'm just grateful to everyone that made this possible . \nHow do you stay motivated in business given the undoubted successes of your career so far? \nIt's easier than you might think. It has been a real labour of love in building Pall-Ex up over the past 20 years, and I am immensely proud of where we are today. But the continued success of the company isn't just important to me – it also provides a living to so many other people.I keep saying it, and I'll say it again; human resource is a businesses' biggest asset.There's nothing that motivates me more than working every day to ensure continued growth and security for my company's employees, year on year. \nI think you only invested in one business during your two-year stint in Dragon's Den – luxury bedding firm Duvalay – how is it doing? \nI'm pleased to say that Duvalay is going from strength to strength. Since my investment back in 2011, we've seen turnover in the company increase by 200 per cent, and expanded distribution across the globe into European and Australian markets.A huge part of this success is down to Liz and Alan Colleran's passion and commitment, and I'm really excited to see how Duvalay grows in the coming years. \nGiven your approach on Dragons' Den, would you describe yourself as a cautious business woman? \nI think I'm cautious in business on the whole, although that's not to say I've never taken a risk before in my professional life. To get Pall-Ex off the ground, I ended up selling my house and car, and everything else but my son (and myself) to raise the money. That's probably the biggest risk I'll ever take, but it's not something I'd relish experiencing again. \nHow have you coped with the fame that comes with appearing on Channel 4's The Secret Millionaire and The Business Inspector on Channel 5? \nIt's not been a problem at all, and it hasn't changed my outlook on life or business a single jot. I've found that with an increased personal profile, I've been able to channel that attention positively towards Pall-Ex, and also to highlight the various charities that I support, whose causes mean a great deal to me. \nThe Mercury last spoke to you in 2012. Back then you were pushing ahead with taking your hub-and-spoke model to more countries in Europe. Will Brexit put the brakes on further EU expansion? \nOur plan is still to continue our expansion across Europe, and I'm confident that the company has the infrastructure, and most importantly, the people, to make that happen. Brexit will certainly present some unparalleled challenges, but it could also offer some unique opportunities of its own, so we'll just have to wait and see how things pan out. \nWhat are your views in general on Brexit's likely impact on UK plc? \nMy view is that British businesses will always have something to offer the world. It's common knowledge that I was the Small Business Champion for the Britain Stronger In campaign, and I fear that cutting ourselves off from our biggest export market will be hugely damaging to the ability of businesses to trade and export freely. When our Prime Minister says \"Brexit means Brexit\", I do not doubt her declaration of intent, but we're all waiting to see what this actually means.Whatever the outcome, I want our businesses to have the best opportunities to grow and expand, and I know that anyone who shares that ambition with me, whether they voted remain or leave, will keep on pushing British businesses on the world stage. \nWhen we asked you four years ago whether you were considering a sale or flotation of the business you said then it was not the right time. Is this something you are considering now? Is it something that is potentially on the cards in the future? \nNothing has changed, as far as I'm concerned. We're all just focused on our European expansion, and that is where our attention is wholly placed. \nWhy did it take you to the age of 39/40 to start the business? After all it was a huge risk to sell your house and car? What drove you to do it? \nIt was a huge risk, yes, but I'm happy to say it paid off. When I had the idea for Pall-Ex, I was turned down for funding by the bank, despite going to them with a business plan so accurate it traded pound for pound and pallet for pallet.I'd built up my experience within haulage over a number of years to a point where I felt I could see a gaping hole in the industry – that's where Pall-Ex came in. \nWhat was it like in the beginning with a young son and nowhere to live? \nIt was the toughest of times. The only accommodation I could afford for my son and I was a rented flat above a fish and chip shop. It would get so cold once the chip fryers below were turned off, I had to insulate the windows with silver foil. I had just enough foil left over to cover my son, too. When you look at your seven-year-old child lying in bed trussed up like an oven-ready turkey, it really does hit you. These are the sacrifices you must be prepared to make. \nYou spoke four years ago about a possible move into Asia and the Far East with partners in Malaysia and Singapore – is this still on the cards? And if so when? \nI could never rule it out, but we still have a way to go before we can confidently move into those markets. All I can say is, watch this space \nHow did your early life influence your approach in business? What was it like growing up in a pub? What did you learn from your dad's attitude to business? \nWithout a doubt, my father will always be my biggest inspiration. When he was betrayed by his business partner, we lost everything. One of my earliest memories as an infant was of the bailiffs coming into our home, and taking every stick of furniture we had.My father, despite such a catastrophic setback, picked himself back up, and managed to get into another business and provide a good living for us all.He was a shining example to me that money and good fortune can be fleeting, but hard work is nearly always rewarded. \nYou have had to cope with various difficulties in your personal life, not least your own health issues. How have you managed these at the same time as managing your businesses? \nWe all have our tough moments, don't we, but I'm happy to say that I'm feeling as strong as ever. It's all about maintaining a healthy work-life balance, and that's something I've gotten better at in recent years. \nWhat advice would you give to other would-be entrepreneurs about starting up and coping with challenges? \nThe first thing I'd suggest is to make sure you choose the right business partner. You need to find someone on an even keel, who aspires to the same dreams and ideals, and will support you, otherwise it simply won't work.Secondly, be brutally honest with yourself about the feasibility of your business idea, and examine your competition. Can you genuinely beat it in terms of quality, execution, and price? If you believe so, then you're probably on to something. The next step now is to make it demonstrable to investors. You also need to check the state of the investment climate, to see if the moneymen are likely to have an appetite for your industry. Finally, getting a start-up past the first year is commonly regarded as the biggest challenge to any entrepreneur.Sometimes hitting a bump in the road is just that and the best approach is to weather the storm, keep calm and carry on. \nWhat is your ultimate business ambition for Pall-Ex or any other business venture? \nI value the security and wellbeing of my workforce above all else, and my ultimate ambition is to continue building Pall-Ex up and up, and to ensure the opportunities for our staff continue to increase.I also want to help the young female entrepreneurs of tomorrow to find the confidence to enter the business world, and I will be doing a lot of work in the coming months to campaign on behalf of young girls with entrepreneurial ambitions. ", "external_links": [], "published": "2016-12-20T13:00:00.000+02:00", "crawled": "2016-12-20T08:27:14.251+02:00", "highlightTitle": ""}