{"organizations": [], "uuid": "5d9eed9d2e705339387d4a5746a6b0b4110a0171", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12362580.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/six-months-eu-referendum-would-12362560", "country": "GB", "domain_rank": 21960, "title": "Six months on from the EU referendum, would Sunderland voters still opt out?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Six months on from the EU referendum, would Sunderland voters still opt out?", "spam_score": 0.0, "site_type": "news", "published": "2016-12-23T18:00:00.000+02:00", "replies_count": 0, "uuid": "5d9eed9d2e705339387d4a5746a6b0b4110a0171"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/six-months-eu-referendum-would-12362560", "ord_in_thread": 0, "title": "Six months on from the EU referendum, would Sunderland voters still opt out?", "locations": [], "entities": {"persons": [{"name": "mike wooler", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cat watson", "sentiment": "none"}, {"name": "natcen", "sentiment": "none"}, {"name": "joan briggs", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "houghton-le-spring", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Six months on from the EU referendum, would Sunderland voters still opt out? Sunderland voters have mixed feelings about Brexit and where it has left the UK despite voting to Leave by a big majority Share Click to play Tap to play The video will start in 8 Cancel Play now We ask people in Sunderland about Brexit six months on from the vote Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSix months on from the referendum on the UK’s membership of the European Union and the country’s future remains unclear. \nDespite the UK voting 52% to 48% to end our 43-year-long relationship with Brussels there has been much debate over how, and if, Brexit should happen. \nThe North East gave a resounding ‘yes’ to the Leave campaign with Newcastle being the only council in the North East Combined Authority voting to Remain. \nCommentators pointed to Sunderland as the archetypal leave area so, six months on, we took to the streets to find out how voters feel now. Read More Brexit vote six months on: What's happening with Article 50 and when can we expect to leave? \nOn a cold and windy day in Sunderland city centre as people hurried around on their lunch-breaks, Brexit wasn’t exactly at the top of people’s agendas. \nBut in June it was a topic which dominated the city and the country at large - Sunderland voted to leave by 61%. \nSunderland returned the first decisive leave vote in the whole of the UK and was held up internationally as a profile of the sort of place which voted to Leave. \nOn the streets now the picture was far more mixed. Mike Wooler (Photo: newcastle chronicle) \nAmong the Remainers was 61-year-old Mike Wooler, a retired Sunderland resident. \nHe said he thought the vote was “the biggest mistake the country has ever made” but that he understood why people had made that choice. \nOne woman who didn’t want to be named said that, as the mother of a solider, she was concerned about the effect the vote would have on human rights legislation. \nWhile Leavers weren’t in the majority, they were certainly vocal. Joan Briggs (Photo: newcastle chronicle) \nJoan Briggs, 80, from Houghton-le-Spring, cited an opposition to immigration as the reason she voted Leave. \nOn the suggestion that the UK holds a second referendum, she said: “If it was tomorrow or today I would still vote out.” Cat Watson (Photo: newcastle chronicle) \nBut Cat Watson, 52, from Sunderland was candid in her regret for voting Leave. \nShe said “I wanted to leave but now I think I should stay” and that it wouldn’t surprise her if others felt the same way. \nOne reason for the mixed feelings over the future over our relationship with the EU may be due to conflicting desires over what the renegotiation should achieve. \nPolling by NatCen in November found that 90% of voters wanted to remain in the single market and that 70% wanted to see limits on immigration from the EU. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2016-12-23T18:00:00.000+02:00", "crawled": "2016-12-23T13:21:34.356+02:00", "highlightTitle": ""}