{"organizations": [], "uuid": "6b5000f0f8eea5d72237740ae6690daa7aee3674", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12317523.ece/ALTERNATES/s1200/JS107131060.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12312205", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Dixons Carphone warn of 'uncertain times', plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Dixons Carphone warn of 'uncertain times', plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-12-14T15:25:00.000+02:00", "replies_count": 0, "uuid": "6b5000f0f8eea5d72237740ae6690daa7aee3674"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12312205", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Dixons Carphone warn of 'uncertain times', plus latest news", "locations": [], "entities": {"persons": [{"name": "helen mcardle care", "sentiment": "negative"}, {"name": "zara", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "massimo dutti", "sentiment": "none"}, {"name": "helen mcardle", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "tom gadsby", "sentiment": "none"}, {"name": "peter williams", "sentiment": "none"}, {"name": "boohoo", "sentiment": "none"}, {"name": "tony murphy", "sentiment": "none"}, {"name": "seb james of", "sentiment": "none"}, {"name": "ed shedd", "sentiment": "none"}, {"name": "helen mcardle coreena ford zara", "sentiment": "none"}, {"name": "umar", "sentiment": "none"}, {"name": "umar kamani", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "zara", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "bershka", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "liberum", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "pretty little thing", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "ho chi minh city", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "hmc group", "sentiment": "negative"}, {"name": "dixons carphone", "sentiment": "negative"}, {"name": "pc world", "sentiment": "none"}, {"name": "news media association", "sentiment": "none"}, {"name": "fifa", "sentiment": "none"}, {"name": "panama paper", "sentiment": "none"}, {"name": "coreena ford news", "sentiment": "none"}, {"name": "inditex", "sentiment": "none"}, {"name": "coreena ford boohoo", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sunday times", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Helen McArdle Care sees revenues rise \nLeading North East care home operator HMC Group has boosted turnover by 16% to £37.4m after opening new homes across the region . \nThe group, which trades as Helen McArdle Care, currently runs 18 homes across Tyneside, Northumberland, Teesside and County Durham, providing beds for up to 1,160 residents. \nLatest accounts for the Team Valley-based business, founded by Helen McArdle, show revenues rose from £32.2m to £37.4m in the year ended March 31, an increase the firm attributed to the boost in contribution from newer homes as well as the sale of land. \nOperating profit rose from £2.08m to £2.76m, while pre-tax profits rose from £1.93m to £2.65m. \nDuring the accounts year the firm oversaw 17 homes, but it has since opened a new home in Jesmond, Newcastle, with plans to open a new home called Grampian Court in Peterlee in February 2017, and a further home in Newton Aycliffe, adding 184 beds. \nThe company also said occupancy rates had been strong, having risen to an average of 94% compared to the previous year’s 92%. \nIn a report accompanying the accounts the firm said it expected to see turnover rise significantly as the new homes come into operation. Helen McArdle Coreena Ford Zara owner buoyed by profits boost \nInditex, the owner of Zara, has seen sales rise 11% in the first nine months of the year as the company remains firmly in fashion with shoppers. \nThe Spanish retailer notched up revenues of 16.4bn euro (£13.7bn) during the period, resulting in a 9% rise in net profits to 2.2bn euro (£1.8bn). \nTom Gadsby, analyst at Liberum, said: \nEncouragingly, trading at the start of the fourth quarter has improved further, while new space and online launches are progressing as planned. \nFew other major clothing retailers can match the mid teens percentage sales growth that Inditex has achieved in difficult global markets this year while the company’s clear focus on achieving full price sales underpins high, and stable margins. \nInditex, the world’s biggest clothing retailer and also the owner of Massimo Dutti and Bershka, opened its first store in Vietnam’s Ho Chi Minh City in September and made its debut in Auckland, New Zealand, in October. The group now operates 7,240 stores in 93 markets, including a Zara at Metrocentre. \nIt’s also rumoured that the firm will soon be moving into around 35,000sqft of space at the old BHS store on Northumberland Street - Inditex are, however, remaining tight-lipped. Could Zara be moving in here next year? 8.45 Coreena Ford Boohoo hails strong Black Friday trading \nOnline retailer boohoo.com has acquired rival fashion website Pretty Little Thing and upgraded its profit guidance following bumper Black Friday trading. \nThe fast-fashion firm will pay £3.3m for 66% of Pretty Little Thing, with the remaining 34% being retained by the management team headed up by boss Umar Kamani. \nBoohoo chairman Peter Williams said: “Pretty Little Thing was always going to be a natural fit with boohoo. Umar and his team are to be congratulated for creating a fantastic brand, which complements boohoo’s own. \n“We believe this is an excellent opportunity to extend the group’s overall customer appeal.” \nRevenues at Pretty Little Thing grew by more than 400% to £17m last year and the company delivered revenue of £19m in the six months to August 31 2016. \nBoohoo, meanwhile, said that its trading across the Black Friday weekend was strong and “peak season trading continues to be encouraging”. \nThe firm now expects to deliver revenue growth of between 38% and 42% for the full year, up from previous guidance of between 30% and 35%, while its earnings margin is also expected to grow by between 11% and 12% versus earlier estimates of around 11%. Not so random photo of a dog in a Christmas jumper from Boohoo.com 8.42 FTSE and pound latest \nThe FTSE-100 index opened at 6968.57. \nThe pound at 8am was 1.2668 dollars compared to 1.2685 dollars at the previous close. The euro at 8am was 0.8411 pounds compared to 0.8386 pounds at the previous close. 8.40 Coreena Ford Nissan agrees 'excellent' pay deal with workforce at Sunderland plant \nThe two-year pay deal will see workers receive a pay increase of 2.75% for year one and year two. Paid maternity leave will also be increased from 18 to 26 weeks, from 1 January 2018. \nThe deal with the car giant was reached through Unite, the country’s largest trade union. \nTony Murphy, Unite officer for the automotive industries, said: “This is excellent news for this hardworking and dedicated workforce which has been in the vanguard of the renaissance in the UK car industry in recent years. \n“It is a good deal that both rewards staff and secures future employment at what is a challenging time ahead for the British car industry – we are particularly pleased about the increase in maternity pay.” Workers at Nissan's plant in Sunderland (Photo: Owen Humphreys/PA Wire) 8.34 Coreena Ford News industry contributes £5bn to UK economy \nBritain’s news industry pumped £5.3bn into the UK economy last year, supporting thousands of jobs and businesses across the country, research shows. \nWhile revenues have nearly halved since 2003 amid a slowdown in print circulation and the transition to digital news, sector expenditure supported around 87,500 UK jobs in 2015, according to a report commissioned by the News Media Association and carried out by Deloitte. \nThe industry spent a total of £4.3bn last year. Around £1.5bn went towards staff wages, with UK news organisations directly employing 28,600 people. \nThe rest was spent on suppliers, UK taxes and other costs, Deloitte said. \nThat helped support around 30,700 jobs across the news supply chain, including ink and newsprint suppliers, while wholesale and retail newspaper distributors employed around 9,100 people. \nDeloitte found that for every £1 that consumers pay on the newspaper cover price, an average of 28p goes straight to retailers and wholesalers, representing around £640m in annual revenues. \nA further 19,100 roles are supported through the wages spent by sector employees on goods and services such as restaurants. \nEd Shedd, partner and head of technology, media and telecommunications at Deloitte, said: “It is clear that the news media industry makes an extremely valuable economic contribution to the UK. \n“This is a vibrant sector that distributes value across the supply chain.” \nThe report adds that national and regional media outlets also served as an “important channel” for small and medium-sized business to connect with customers, as those business typically face higher barriers to advertising. \nIn addition to the sector’s economic contribution, Deloitte said the news industry improves community cohesion and literacy, which can lead to “enhanced productivity, employment and health outcomes”, especially when news outlets run articles on lifestyle choices and early disease detection. \nInvestigative journalism also plays an important function, holding “powerful figures and institutions to account”, Deloitte said, pointing to work such as the The Guardian’s Panama Paper revelations and the Sunday Times’ investigation into Fifa. \nHowever, as the industry continues to struggle under shrinking revenues, original journalism is coming under threat. \n“Although digital revenues of news media organisations are growing, they are failing to offset the fall in print revenue,” Deloitte said. Annual average revenue per print consumer is around £124, while the digital equivalent is around £15. But the sector invested more than £97 million in digital services last year, helping to future-proof the industry, the report said. Deloitte said: “With the ongoing shift to digital readership among all audiences and the greater use of digital media by younger audiences, the sector’s ongoing role as an engine of original news content relies on it being able to monetise digital audiences effectively so it can continue investing in quality journalism.” 8.30 KEY EVENT Dixons Carphone warns of 'uncertain times' despite profits rise \nElectricals and mobile phones giant Dixons Carphone cheered its best ever Black Friday as it posted a 19% jump in half-year profits, but said it was planning for “more uncertain times”. \nThe group said that, while it had yet to see a knock to shopper confidence from the Brexit vote, it was bracing for a more unsettled 2017 as EU exit negotiations loom large and amid cost pressures from the sharply weaker pound. \nDixons Carphone buys around 90% of its products in sterling, although its manufacturers are expected to start increasing prices as the Brexit-hit pound sends their costs soaring. It hopes to offset this and insisted customers were unlikely to see any noticeable hike in prices. \nDixons Carphone chief executive Seb James of said: \nWhile we have still not seen any effect on consumer demand as a consequence of Brexit, we have been planning for the possibility of more uncertain times ahead. \nWe are also planning our offer so that potential currency impacts are minimised for the customer, and are ensuring that next year, as always, everybody can be absolutely sure that they won’t get a better deal anywhere. \nDixons Carphone posted a 19% jump in underlying pre-tax profits to £144m for the six months to October 29 after notching up a 5% rise in like-for-like sales across the UK and Ireland. Black Friday, which fell after its first half, was another record trading day for the group as shoppers snapped up gadgets such as smart fitness and wearable technology, as well as drones and dash cams. \nMr James said the Currys and PC World owner was cutting its fixed costs so the group can adapt to any potential difficult market conditions and “generally preparing for all eventualities - just in case”. \nDixons Carphone has so far shrugged off any Brexit vote impact, with sales growth picking up over its first half - to 6% over the second quarter across the UK and Ireland. It added that Christmas trading was “so far so good”, following on from its Black Friday success last month. Share", "external_links": [], "published": "2016-12-14T15:25:00.000+02:00", "crawled": "2016-12-14T11:03:19.854+02:00", "highlightTitle": ""}