{"organizations": [], "uuid": "7e9ef2e354f06c95e36d072e9783a0515fc2ed27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12266191.ece/ALTERNATES/s1200/Tony-Blair-Returns-To-Sedgefield-To-Join-The-Labour-Party-Election-Fight.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/we-should-proud-tony-blair-12266188", "country": "IE", "domain_rank": 21960, "title": "'We should be proud of Tony Blair' - North East MP defends from Prime Minister over Iraq invasion - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "'We should be proud of Tony Blair' - North East MP defends from Prime Minister over Iraq invasion - Chronicle Live", "spam_score": 0.038, "site_type": "news", "published": "2016-12-04T12:00:00.000+02:00", "replies_count": 0, "uuid": "7e9ef2e354f06c95e36d072e9783a0515fc2ed27"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/we-should-proud-tony-blair-12266188", "ord_in_thread": 0, "title": "'We should be proud of Tony Blair' - North East MP defends from Prime Minister over Iraq invasion - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "wilson", "sentiment": "negative"}, {"name": "tony blair", "sentiment": "negative"}, {"name": "ian austin", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "trimdon village", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Watch Next \nMr Wilson said the motion was “essentially about calling Tony Blair a liar”. \nBut he told MPs: “I have known Tony Blair for more than 30 years, probably longer than anyone else who is in the House today, and I am proud to say that he is a friend of mine. When I am called a Blairite, which is sometimes seen as a term of abuse, I wear that term proudly as an accolade. \nI met Tony Blair in 1983, when he first became the Labour candidate for Sedgefield, in the community bar in Trimdon village. He believed then, as he does today, that the Labour party had a great ability to do good, but his opponents are angry about what he achieved. What he did achieve were great things, from the minimum wage to devolution in Scotland and the creation of the Scottish Parliament.” \nIn comments which may have been aimed partly at some Labour politicians, he said it would be a mistake for people to distance themselves from Tony Blair because he had been a huge success. Read More North East now wants to stay in the European Union according to our Brexit poll \n“Some people want to define themselves against Tony Blair and the 1997 to 2010 Labour Governments. To them I say, ‘Be careful, because it is not useful or a good idea to define yourself against success’. \n“Like all Governments, Labour did things that generated criticism, disagreement, frustration and anger, none more than on Iraq.” \nHe added: “I sincerely accept that people outside and Members of this House have strongly held views on the rights and wrongs of the Iraq war, but let us disengage from this witch hunt pursuing a line of criticism abandoned by the Chilcot inquiry. Tony Blair did not lie.” \nSome Labour MPs criticised the SNP, which is in power in Scotland, for using their debate as a chance to return to the subject of Iraq. \nLabour MP Ian Austin said: “Scottish councils face a £553 million black hole. SNP Members do not want to debate any of that. \n“They do not want to debate the educational attainment gap between the richest and the poorest that is growing in Scotland. They do not want to debate the fact that Scotland has the lowest percentage of university entrants from the poorest families. They do not want to debate any of that. \n“They do not want to be held to account on their record.” Read More ", "external_links": [], "published": "2016-12-04T12:00:00.000+02:00", "crawled": "2016-12-04T07:19:19.759+02:00", "highlightTitle": ""}