{"organizations": [], "uuid": "496bedcacbec8a6c23e3f1b7a291946971e62c47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11662606.ece/ALTERNATES/s1200/JS95637881.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-science-central-2016-year-12354660", "country": "GB", "domain_rank": 21960, "title": "From Sage to Science Central, 2016 was the year when the North East tech scene came of age", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "From Sage to Science Central, 2016 was the year when the North East tech scene came of age", "spam_score": 0.0, "site_type": "news", "published": "2016-12-27T18:00:00.000+02:00", "replies_count": 0, "uuid": "496bedcacbec8a6c23e3f1b7a291946971e62c47"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-science-central-2016-year-12354660", "ord_in_thread": 0, "title": "From Sage to Science Central, 2016 was the year when the North East tech scene came of age", "locations": [], "entities": {"persons": [{"name": "kromek", "sentiment": "none"}, {"name": "richard branson", "sentiment": "none"}, {"name": "chris blaxall", "sentiment": "none"}, {"name": "scott logic", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "stephen kelly", "sentiment": "none"}, {"name": "alistair wyse", "sentiment": "none"}, {"name": "zerolight", "sentiment": "none"}, {"name": "arnab basu", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "richard gregory", "sentiment": "none"}, {"name": "claire braithwaite", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "ashton kutcher", "sentiment": "none"}, {"name": "herb kim", "sentiment": "none"}, {"name": "paul smith", "sentiment": "none"}, {"name": "jacqueline de rojas", "sentiment": "none"}, {"name": "paul fellows", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "science central", "sentiment": "none"}, {"name": "barnard castle", "sentiment": "none"}, {"name": "gwyneth paltrow", "sentiment": "none"}, {"name": "newcastle  the dynamo", "sentiment": "none"}, {"name": "northern europe", "sentiment": "none"}, {"name": "tombola", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "campus north", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "glaxosmithkline", "sentiment": "none"}, {"name": "melinda gates foundation", "sentiment": "none"}, {"name": "deloitte uk technology fast 50", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "tech uk", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "intellectual property league table", "sentiment": "none"}, {"name": "general property", "sentiment": "none"}, {"name": "alstom", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "digital union", "sentiment": "none"}, {"name": "bede gaming", "sentiment": "none"}, {"name": "nomad digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "From Sage to Science Central, 2016 was the year when the North East tech scene came of age The region's technology and science sectors saw a number of big successes during 2016 Share Sage CEO Stephen Kelly at Sage Summit in Chicago Share Get business   Thank you for subscribing! Could   \nIn the second of our reviews of the year, business editor Graeme Whitfield looks at the science and technology scene in 2016. \nIf the technology sector is constantly talks of as “the industry of the future”, 2016 might just be seen as the year in which it very much became the industry of today. \nFor the sector’s largest North East player , Newcastle-based Sage, that has been the situation for some years, both in terms of the companies using its products around the world and the jobs its provides. \nSage does not have quiet years, and 2016 was no exception, with the company very consciously making a big noise in July when it held its annual Sage Summit in Chicago. \nThe event saw company unveil a number of new products and initiatives while CEO Stephen Kelly shared the stage with the likes of Sir Richard Branson and actors Gwyneth Paltrow and Ashton Kutcher. \nSage also appointed Jacqueline de Rojas – hailed by one commentator as ‘the most influential woman in UK IT’ – to lead its business in the UK and Northern Europe, and positioned itself as the champion of SMEs , making public interventions on tax, skills and broadband infrastructure at various points during the year. The press conference on Science Central, held at the Core in Newcastle (Photo: Newcastle Chronicle) \nIn terms of size alone, Sage remains the region’s largest tech firm by some distance. \nBut there were encouraging signs in 2016 that other firms are hoping to join it in the big league. \nIn January, investment bank GP Bullhound singled out six companies it thinks will do that when it named nine companies in the region as tech ‘foals’, saying they all had the ability to become ‘unicorns’ - $1bn businesses. \nAmong the list, rail wi-fi provider Nomad Digital had perhaps the busiest year, winning contracts around the world and achieving a world first with the creation of an internet-based television service for train passengers. As the year drew to an end it announced it was being acquired by French giant Alstom. \nThere was steady progress and moves to eye-catching new homes for Newcastle’s Bede Gaming and Zerolight, something that will be the case next year too for Sunderland’s Tombola. Also on the foals list was Cramlington’s Palringo, Houghton-le-Spring company Sale Cycle and Newcastle’s Scott Logic, all of whom made steady progress during 2016. L-R Paul Fellows, Alistair Wyse and Chris Blaxall of Performance Horizon in Newcastle Upon tyne, Journal Business \nBut perhaps the best bet for a breakthrough into the major leagues could be Performance Horizon, which clinched a £10m investment in July and announced plans to double its headcount. The company made it onto the Sunday Times Hiscox Tech Track 100 league table, which ranks the UK’s private technology, media and telecoms companies with the fastest-growing sales, in September and, for the second year running, the 2016 Deloitte UK Technology Fast 50 in November. \nWith so many tech companies in the North East doing amazing things and growing at a rapid rate, it is perhaps not surprising that a number of bodies have sprung up support the sector. \nGovernment-backed Tech North had something of a turbulent year, losing chief executive Claire Braithwaite in January amid accusations that parent body Tech UK was trying to muscle in on its ring-fenced Northern funding. Read More The Monday Business Interview: the best questionnaire answers of 2016 \nTech North chair Herb Kim – whose own Thinking Digital organisation had another successful event in Newcastle in May and also spread its operations to Manchester – took charge until Richard Gregory arrived in the summer as new chief executive. \nCloser to home the Ignite 100 initiative in Newcastle lost chief executive Paul Smith in January, but – along with Campus North, where it is situated – continued its much-envied work in backing and developing tech start-ups in the region. In June, Campus North was named the best place to work in the country. All of the winners at the BT Dynamites 16 Awards in Newcastle \nThe Dynamo project continued to support growing tech companies in the region, while creative industries support group Generator launched Digital Union and won funding to back growing tech businesses in the North East. \nThere was plenty to get excited about in science too, not least when major employer GlaxoSmithKline eased some Brexit fears by agreeing a £92m extension to its Barnard Castle factory, signalling its commitment to UK manufacturing. \nSedgefield’s Kromek was named the most innovative company in the UK after it topped the 2016 Intellectual Property League Table. The company is beginning to turn that expertise into commercial reality too, highlighting a number of major contract wins and issuing accounts in December in which revenues rose 19% and chief executive Arnab Basu said the firm had “moved into full commercialisation phase” \nIn Newcastle, QuantumDX won substantial financial backing from the Bill and Melinda Gates Foundation to help develop its groundbreaking work on the testing of tuberculosis with its Q-Poc device. \nAnd the region’s science sector was given a massive fillip in June when Legal and General Property invested £65m into the Science Central site in Newcastle. \nThe site had already seen a number of exciting science and technology companies move into office accommodation at The Core while plans for a £20m laboratory complex were approved and work continued on a number of other world leading facilities. \nMore than a decade after it was first proposed by then Chancellor Gordon Brown, Science Central is close to becoming a reality. The jobs of tomorrow are almost here. Like us on Facebook", "external_links": [], "published": "2016-12-27T18:00:00.000+02:00", "crawled": "2016-12-27T13:10:13.606+02:00", "highlightTitle": ""}