{"organizations": [], "uuid": "d38ef1075f322caec5abf227e8ccccbafe24f125", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11704167.ece/ALTERNATES/s1200/JS95806863.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-lloyds-bank-12340378", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Lloyds Bank buys credit card company MBNA for £1.9bn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Lloyds Bank buys credit card company MBNA for £1.9bn", "spam_score": 0.0, "site_type": "news", "published": "2016-12-20T15:20:00.000+02:00", "replies_count": 0, "uuid": "d38ef1075f322caec5abf227e8ccccbafe24f125"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-lloyds-bank-12340378", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Lloyds Bank buys credit card company MBNA for £1.9bn", "locations": [], "entities": {"persons": [{"name": "miles celic", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "grainger", "sentiment": "none"}, {"name": "matthew mccarrick", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "christine ourmieres-widener", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}, {"name": "anthony", "sentiment": "none"}, {"name": "jon super", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "flybe", "sentiment": "none"}, {"name": "paul walker", "sentiment": "none"}, {"name": "nigel begg", "sentiment": "none"}, {"name": "saad hammad", "sentiment": "none"}, {"name": "mccoll", "sentiment": "none"}, {"name": "michael errington", "sentiment": "none"}, {"name": "ms ourmieres-widener", "sentiment": "none"}, {"name": "jonathan fellows", "sentiment": "none"}, {"name": "antonio horta-osorio", "sentiment": "none"}, {"name": "christine", "sentiment": "none"}, {"name": "russell", "sentiment": "none"}, {"name": "laffin", "sentiment": "none"}, {"name": "jonathan miller", "sentiment": "none"}, {"name": "grainger games", "sentiment": "none"}, {"name": "dominique limet", "sentiment": "none"}, {"name": "simon laffin", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "cheetham hill", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "heworth hall", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "air france", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "science city", "sentiment": "none"}, {"name": "accrington", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "nun street", "sentiment": "none"}, {"name": "derby", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "lloyds bank", "sentiment": "negative"}, {"name": "mbna", "sentiment": "negative"}, {"name": "aspire technology solutions  work", "sentiment": "neutral"}, {"name": "square mile", "sentiment": "none"}, {"name": "bank of america", "sentiment": "none"}, {"name": "co-operative group", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "lloyd", "sentiment": "none"}, {"name": "pfizer inc", "sentiment": "none"}, {"name": "playstation", "sentiment": "none"}, {"name": "sage group", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}, {"name": "aspire technology solutions", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "shionogi limited", "sentiment": "none"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "mccarrick construction", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "gsk", "sentiment": "none"}, {"name": "heworth house", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}, {"name": "american express global business travel", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "royal courts of justice", "sentiment": "none"}, {"name": "sophos", "sentiment": "none"}, {"name": "experian plc", "sentiment": "none"}, {"name": "air france", "sentiment": "none"}, {"name": "fia jersey holdings limited", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "grainger games and trade nation", "sentiment": "none"}, {"name": "nissan motor manufacturing uk ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:15 Heworth Hall gets £1m extension from Aspire Technology Solutions \nWork has started on a £1m make over on a Grade II-listed building after investment from IT specialist Aspire Technology Solutions . \nHeworth Hall in Gateshead - which was originally built for the wealthy Russell Family in 1730 - is to get the extension to give Aspire the space to hire an extra 40 staff. \nAspire has already grown its workforce by around 20 people this year and now has over 100 employees. \nTurnover is also expected to increase from £10.2m to £12.5m this year and the company estimates that revenue could hit £20m by 2020. \nThe IT company provides clients with data centre solutions and delivers hosted services, as well as providing traditional IT support. \nThe extension to Heworth House will be made to the west side of the building. Work began last month and will be completed next summer. \nChief executive Nigel Begg, who co-founded Aspire in 2006, said: \nHeworth Hall is an outstanding place from which to do business and we love operating from here. \nWe take great pride in being responsible for a building that has been such a significant North East landmark for so many years and one which remains so recognisable today. Nigel Begg, Chief Executive of Aspire Technology Solutions, Sales Director Michael Errington, and Matthew McCarrick, Director of McCarrick Construction (Photo: Yellow Dog pr) 9:09 Newcastle University appoints leading business figure as new chair \nOne of the North East business community’s leading figures has been appointed to be the next chair of Newcastle University’s governing body . \nFormer Sage Group chief executive Paul Walker, who is now a major investor in the digital technology sector in both the UK and US, will take on the role at Newcastle University’s council from August next year. \nMr Walker - who is a director of Experian plc and sits on the board of US-based Sophos plc - has been a lay member of the university’s council since 2011 and has been the chair of the Science City Partnership between the university and Newcastle City Council since its inception in 2004. \nHe said: \nI have been privileged to have been involved with Newcastle University for over a decade through Science City and, more recently, as a council member. \nI am looking forward to being more involved in the strategic direction of Newcastle University as its new chair of council. There are so many strengths to build on: it has a fantastic research profile associated with world-leading advances in the fields of mitochondrial diseases, English, computing science and many other subjects. Paul Walker (Photo: Newcastle Chronicle) 9:05 British legal sector at risk after Brexit, report warns \nBritain’s £25.7bn legal sector could be at risk if the Government fails to secure guarantees for the industry after Brexit, a new report claims. \nThe loss of mutual enforcement rules - which requires EU member states to recognise and enforce UK law and vice versa - would make Britain a “less attractive” place for international businesses to resolve legal disputes and draw up commercial contracts, Square Mile lobby group TheCityUK said. \nThe group is now calling on the Government to find a regulatory alternative that will allow mutual enforcement to continue, or risk degrading the “primacy of English law”. \nIt is also urging lawmakers to maintain free movement for legal professionals - noting that more than 200 foreign law firms currently operate in the UK, employing more than 10,000 people. \nThe report said that “many of them depend upon EU market access, London’s position as a leading global financial centre and the ability to recruit English law qualified talent.” \nThe report raised concerns over the “knock-on impacts” if key sectors that support legal jobs are disrupted - including financial services, technology, telecoms, energy and real estate. \nBritain’s legal sector employs more than 370,000 people and contributed £25.7bn to the UK economy last year, amounting to 1.6% of gross domestic product (GDP), its research showed. UK sector turnover is two-and-a-half times that of Germany and four times more than France, which are Britain’s two largest competitors in Europe. \nTheCityUK chief executive Miles Celic said: \nThe UK-based legal services sector is the leading global centre for the provision of international legal services and dispute resolution ... It is vital that the key challenges and opportunities for the sector are addressed in the Brexit negotiations and that its competitiveness is maintained and enhanced. \nThe sector is working on these issues and providing that insight into Government, allowing Ministers to draw on the UK’s unique reserve of world-leading legal expertise. \nThe best Brexit deal will be one which is mutually beneficial to the UK, the EU and globally and which allows for a clear and predictable shift from current business conditions to whatever new arrangement is agreed. Royal Courts of Justice in London (Photo: Andrew Matthews/PA Wire) 9:00 KEY EVENT McColl's gets final clearance for 'transformational' co-op store deal \nConvenience store chain McColl’s has won clearance from the competition watchdog for a “transformational” deal to snap up nearly 300 outlets from the Co-operative Group. \nThe final clearance from the Competition and Markets Authority (CMA) comes after the acquisition was first announced in July and will see McColl’s add another 298 shops to its 1,000-strong convenience store estate. \nIt will also allow the Co-op to focus on its larger stores. The CMA said in October it was investigating the deal to examine whether it would result in “a substantial lessening of competition within any market or markets in the United Kingdom for goods or services”. \nJonathan Miller, chief executive of McColl’s, said: \nThis is a transformational deal, which substantially accelerates our growth strategy and expands our neighbourhood presence for the benefit of our customers. \nWe have a long history and proven track record of successfully integrating convenience stores into our estate, and we expect these newly acquired stores to make a significant contribution to our future strategic plans. \nThe group will start integrating the new stores into its estate in January and expects the shops to be converted to its branding by the end of next August. \nMcColl’s recently unveiled its sixth year in a row of rising sales, posting growth of 1.9% over the year to November 27 thanks to expansion efforts. But with the boost from new stores stripped out, like-for-like sales remained under pressure, falling by 1.7% in the fourth quarter and 1.9% over the full year. \nThis marked a slight improvement on a 1.8% drop in the previous three months. Same-store sales in its newsagents and standard convenience stores fell 3.3% over the full-year, but McColl’s said the performance was better in recently acquired and converted stores, where like-for-like sales lifted 0.8%. McColl's will buy 298 Co-op stores (Photo: Jon Super) 8:54 Grainger Games pin hopes on virtual reality as turnover fall by £2.4m \nVideo game retailer Grainger Games saw turnover fall by £2.4m during 2015/16 but is hoping virtual reality (VR) games will boost sales over Christmas . \nRevenue for the year ended March 26 fell by 4.5% last year, from £53.5m in 2015 to £51.1m. The company also made a loss before tax of £600,000. \nThe Newcastle-headquartered company has 70 stores located between Berwick on Tweed and Derby, which trade under the Grainger Games and Trade Nation brands. \nSince March 2015 Grainger has closed three of its stores at Accrington, Cheetham Hill, and Morpeth but did open a new store in Gateshead. The company employed 24 less people over the same period. \nCompany director Jonathan Fellows said: \nThe launch of virtual reality products will bring sales opportunities heading into Christmas 2016 and the business will look to continue its Trade National technology offering and repairs service. \nThe focus on the current year will continue to be on maximising the sales opportunity across the existing retail estate, on growing both the Trade Nation brand and the Smartfix repairs service. \nThe company is well placed to see continued progress in these areas in the year ahead and that investment in recent years into the business should allow core gaming revenues and profitability that will at least mirror performance across the overall market. \nA host of virtual reality games consoles have also been released recently such as the Oculus Rift and Playstation VR. \nMr Fellows added that sales of pre-owned video game consoles, such as the Xbox 360 and Playstation 3, continued to fall as people increasingly bought next generation consoles. Grainger Games, Nun Street, Newcastle upon Tyne (Photo: Newcastle Chronicle) 8:50 KEY EVENT Nissan profits motor to £129m despite slip in number of cars made \nProfits switched up a gear at the North East base for car giant Nissan , despite a small dip in production volumes . \nLatest accounts for Nissan Motor Manufacturing UK Ltd, the Sunderland -headquartered British arm of the car firm, show revenues fell by 1% to £5.188bn, but a year of solid activity within investments and strong production figures brought up profit levels. \nThe firm, which employs around 7,000 people in Sunderland, chalked up operating profit of £129.6m – a lift of 24% – while pre-tax profits also rose by 21%, coming in at £116.9m. \nThe year under review in the accounts ended on March 31 – ahead of the firm’s announcement that it would build the next-generation Qashqai at Sunderland as well as its new X-Trail SUV, new models which mean Nissan will add an extra shift onto the second production line at Sunderland, potentially creating up to 1,000 jobs. \nMany other key events took place ahead of the October news, including Nissan’s announcement that the next generation electric vehicle batteries will be produced at the Sunderland plant, representing a £26.5m investment which will safeguard 300 jobs at the battery plant. \nTotal vehicle production volumes reached 478,000, 3,000 fewer than the previous financial year, and directors said the figures constituted another year of very strong production for the Wearside plant. \nA total of 296,000 of the New Qashqais rolled off the production line – 6,000 more than the year before – and demand for the Juke saw 116,000 made, slightly down on the 120,000 from the 2015 financial year. \nNote production volumes, meanwhile, came in at 39,000. Workers at Nissan's plant in Sunderland 8:46 Ex-CityJet chief Christine Ourmieres-Widener named new Flybe boss \nFlybe has named Christine Ourmieres-Widener as its new chief executive after the regional airline’s former boss stepped down two months ago. \nMs Ourmieres-Widener - a former senior executive at Air France and previous boss at CityJet - will take on the role on January 16. Her appointment comes after previous Flybe chief executive Saad Hammad left by “mutual agreement” in October following more than three years with the group. \nChairman Simon Laffin assumed the role of executive chairman after his departure, but will revert back to non-executive chairman when Ms Ourmieres-Widener joins the group. \nFlybe has struggled financially in recent years, booking a £35.6m loss in 2015 before swinging back into a £2.7m profit in 2016. \nMr Laffin said: \nWe are delighted that Christine is joining Flybe at what is a very exciting time for the company, as we transition to become an increasingly customer-driven business. \nChristine brings extensive experience of aviation and travel, as well as deep knowledge of the UK regional aviation market, which will be extremely valuable to Flybe. \nMs Ourmieres-Widener has a lengthy career in the aviation and travel sectors, having first started in the maintenance department of Air France before working her way up to become the airline’s UK and Ireland general manager and later vice president in New York. \nShe was chief executive of CityJet between 2010 and 2015 and has since acted as chief global sales officer for American Express Global Business Travel. She joins Flybe on a £400,000 annual salary, with an annual bonus worth up to £400,000, as well as potential long-term incentive scheme shares. \nFlybe is also paying £120,000 for Ms Ourmieres-Widener and her family to relocate from New York. \nShe said: \nI am very excited to be joining Flybe and being able to bring my industry experience and passion to the business. \nI look forward to working with the board and the entire team to continue Flybe’s progression to becoming a more customer-focused business, aided by the greater control the airline now has over its future fleet size. Flybe operates a number of flights at Newcastle Airport 8:42 \nThe FTSE-100 index opened at 7017.16. \nThe pound at 8am was 1.2381 dollars compared to 1.2420 dollars at the previous close. \nThe euro at 8am was 0.8394 pounds compared to 0.8410 pounds at the previous close. 8:40 KEY EVENT GlaxoSmithKline moves a step closer to creating new HIV treatment \nPharmaceutical giant GlaxoSmithKline (GSK) has revealed that early testing of a new HIV treatment have been successful. \nIf the trials are fully successful patients with HIV may be able to switch from taking three or four drugs as part of their treatment to a two-drug regime. The drugs being tested are dolutegravir and rilpivirine. \nThe studies have passed a non-inferiority test after 48 weeks, meaning that the drugs are as good as those currently available. \nThe tests were carried out by ViiV Healthcare, which is majority owned by GSK, with Pfizer Inc and Shionogi Limited as shareholders. \nDominique Limet, CEO ViiV Healthcare, said: \nThese are important results for the HIV scientific community and represent an important milestone in our understanding of how HIV can be treated. \nThe results support our strategy of investigating two-drug regimens as innovative treatment options for people living with HIV and we are planning regulatory submissions for this two-drug regimen as a single tablet in 2017. New drug could improve patients' lives (Photo: PA Wire) 8:37 The future of Lloyds Bank \nThe deal to acquire MBNA comes after Lloyds took another step towards privatisation last week when the Government announced it had sold off a further chunk of the bank, taking its stake down to less than 7%. \nIt means more than £17.5bn has been returned to Government coffers since the lender’s £20.3bn bailout at the height of the financial crisis. \nIn October, Lloyds said it had set aside another £1bn to meet compensation claims for the mis-selling of payment protection insurance (PPI) as it attempts to draw a line under the scandal. \nOn the MBNA deal, the bank said its purchase price includes £240m for future PPI claims, adding that its “exposure of PPI liability” would be “capped at this amount”. \nMBNA, which booked post-tax profits of £123m in first half of 2016, will be kept as a challenger brand and help Lloyds strengthen its credit cards market share from 15% to 26%. \nThe bank said its underlying and statutory performance was strong and it remains on track to deliver “a progressive and sustainable ordinary dividend in 2016”. \nLloyds announced in October that statutory pre-tax profits had fallen 15% year on year in the third quarter at £811m, as it revealed more provisions for PPI mis-selling. Underlying profit for the third quarter came in 3% down at just under £2bn. Lloyds Banking Group bought the credit card company for £1.9bn 8:32 KEY EVENT Lloyds Banking Group buys US credit card company MBNA for £1.9bn \nLloyds Banking Group has swooped for consumer credit card business MBNA from Bank of America in a £1.9bn deal. \nThe banking giant said MBNA, which holds assets of £7bn, would deliver strong financial returns and bolster its position in the UK prime credit card market. \nAntonio Horta-Osorio, group chief executive of Lloyds, said MBNA was a “good fit” with the bank’s current credit card business. He added: \nThe acquisition, funded through strong internal capital generation, increases our participation in the expanding UK credit card market with a multi-brand strategy and advances our strategic aim to deliver sustainable growth as a UK focused retail and commercial bank. \nThe deal will provide a £650m boost to Lloyd’s group revenues each year, while enhancing the bank’s group net interest margin by around 10 basis points per year. \nOnce it is given the green light by regulators, the tie-up is expected to be complete by the end of the first half of 2017. \nThe move will see Lloyds buy MBNA from Bank of America subsidiary FIA Jersey Holdings Limited, delivering cost savings of around £100m per year within two years. Lloyds has claimed the savings would represent around 30% of MBNA’s cost base in 2015. A branch of Lloyds Bank (Photo: Anthony Devlin/PA Wire ) Share", "external_links": [], "published": "2016-12-20T15:20:00.000+02:00", "crawled": "2016-12-20T11:19:56.987+02:00", "highlightTitle": ""}