{"organizations": [], "uuid": "d9967e6767c66d35687b1aa7c56531fa4d819b62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article8450424.ece/ALTERNATES/s1200/JS32918645.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12340021", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: GoDaddy could see Brexit boost if more entrepreneurs 'strike out on their own'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: GoDaddy could see Brexit boost if more entrepreneurs 'strike out on their own'", "spam_score": 0.0, "site_type": "news", "published": "2016-12-19T15:20:00.000+02:00", "replies_count": 0, "uuid": "d9967e6767c66d35687b1aa7c56531fa4d819b62"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12340021", "ord_in_thread": 0, "title": "Business Breakfast LIVE: GoDaddy could see Brexit boost if more entrepreneurs 'strike out on their own'", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "harvey", "sentiment": "none"}, {"name": "john waterworth", "sentiment": "none"}, {"name": "blake irving", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "bob dudley", "sentiment": "none"}, {"name": "fiona simpson", "sentiment": "none"}, {"name": "irving", "sentiment": "none"}, {"name": "catherine harvey", "sentiment": "none"}, {"name": "duncan johnson", "sentiment": "none"}, {"name": "mrs simpson", "sentiment": "none"}, {"name": "andy", "sentiment": "none"}, {"name": "jeff sills", "sentiment": "none"}, {"name": "epiris", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "hemel hempstead", "sentiment": "none"}, {"name": "battersea power station", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "kosmos", "sentiment": "none"}, {"name": "senegal", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "santa", "sentiment": "none"}, {"name": "west africa", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "parkdean holidays", "sentiment": "none"}, {"name": "harlow", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "caledonia", "sentiment": "none"}, {"name": "mauritania", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}], "organizations": [{"name": "godaddy", "sentiment": "negative"}, {"name": "onex corporation", "sentiment": "none"}, {"name": "onex", "sentiment": "none"}, {"name": "essex", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "intermediate capital group", "sentiment": "none"}, {"name": "park holidays", "sentiment": "none"}, {"name": "abu dhabi company", "sentiment": "none"}, {"name": "abu dhabi", "sentiment": "none"}, {"name": "kosmos", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "bank holidays", "sentiment": "none"}, {"name": "bp", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "park resorts", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "icg", "sentiment": "none"}, {"name": "caledonia investments", "sentiment": "none"}, {"name": "kosmos energy", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "heg", "sentiment": "none"}, {"name": "parkdean resorts", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "host europe group", "sentiment": "none"}, {"name": "ebay", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8:54 ARTventurers art classes for kids grows to 22 franchises across the UK \nArt classes for babies, toddlers and older children are set to be splashed across the UK and beyond as the Sunderland-founder of the artistic venture expands the business through franchises . \nARTventurers – described as messy, colourful, creative classes for youngsters – was initially launched in Sunderland by Fiona Simpson, a qualified solicitor who quit the legal profession to work as an Early Years Practitioner. \nMrs Simpson, a mother of two, set up the enterprise in 2011 and demand for arty classes, as well as its holiday workshops for older children, arty birthday parties and after school clubs has grown rapidly. \nA Sunderland enterprise which runs art classes for babies, toddlers and children has two new franchises as part of its continued expansion. \nARTventurers runs colourful, creative art classes for babies, toddlers and children, as well as holiday workshops for older children, arty birthday parties and after school clubs and also provides creative activities at community and corporate events. \nAs demand for classes increased, she created a franchise model which launched last year, and there are now 22 franchises across the UK and one in Texas, with two new franchisees coming on board recently in Harlow, Essex, and Bristol in the south west. \nMrs Simpson said: \nMany of our franchisees are mums who have had a professional career and just want to do something different. We offer a flexible way to work and develop the business which is appealing to mums who want to work but also have the time they need for their families. \nAt ARTventurers we believe strongly in child-centred learning through art and creative play and our sessions provide a fun, secure and social environment for children and their grown ups to create and explore together. Fiona Simpson, a qualified solicitor who founded ARTventurers (Photo: RBS) 8:50 Newcastle holiday company snapped up by US private equity house \nParkdean Resorts announces that Onex, one of the oldest and most successful private equity firms with offices in Toronto, New York and London, has agreed to acquire Parkdean Resorts. \nIn 2015, Parkdean Resorts was created through the merger of Parkdean Holidays and Park Resorts creating the UK’s sector leading holiday park business with 73 holiday parks across England, Scotland and Wales, selling more than 500,000 holidays and short breaks a year. \nThe company offers a wide range of accommodation, from caravans and camping pitches to chalets, apartments and lodges. Parkdean Resorts employs over 6,000 staff during the peak holiday season and is headquartered in Hemel Hempstead and Newcastle. \nThe deal is subject to FCA approval and is expected to close in the first quarter of 2017. \nJohn Waterworth, CEO of Parkdean Resorts said: \nWe wish to thank our shareholders Epiris and Alchemy for their support and welcome Onex. We are excited about our growth prospects and taking the business to its next stage of its development. \nWe shall be investing £50m in our parks in preparation for the 2017 season, improving them for owners and holidaymakers alike. 8:45 Park Holidays sold to Intermediate Capital Group in £362m deal \nPrivate equity firm Caledonia Investments has sold caravan park operator Park Holidays to Intermediate Capital Group (ICG) for £362m. \nPark Holidays is Britain’s fourth largest caravan operator and is set to see earnings of £36.5m this year. The price tag represents a significant increase on the £172m that Caledonia paid for the firm in 2013. \nThe sale process was put on ice following the EU referendum result, but the rise in staycations following the collapse in the value of the pound has meant that caravan operators have become highly sought-after assets. \nOver the weekend, the country’s biggest operator, Parkdean Resorts, was sold by Epiris to Toronto-based Onex Corporation for £1.35bn. Duncan Johnson, Caledonia’s head of unquoted investments, said: \nCaledonia’s unquoted strategy is to invest in leading businesses which combine an ability to grow profits whilst also paying a healthy annual cash return to shareholders. Park Holidays has delivered in every respect. \nICG will retain Park Holidays’ current management team, including chief executive Jeff Sills. According to data from VisitEngland, £1.9 billion was spent on holiday parks and caravan trips in 2015. (Photo: eBay) 8:37 Santa-for-hire business booming despite Brexit uncertainty \nIn more festive news Santa is on course to beat the Brexit blues this Christmas as the number of corporate clients hiring out the bearded gift-giver soars. \nThe director of a high-end Santa-for-hire firm says business is thriving and will continue to flourish despite forecasts for an economic slump after Brexit. \nIn just over three years, Catherine Harvey has gone from managing Santa appearances solely for her brother to booking 280 gigs for 40 actors per week on average during the holiday season. She said: \nI’ve already got bookings for 2017, 2018 and 2019. \nAs soon as you get to January, companies are already starting to work on next year’s Christmas, especially other Christmas-based industries. \nShe has even been able to bag year-round bookings for at least one of her actors, dubbed the company’s “celebrity Santa” who does off-season photo shoots, celebrity parties, TV appearances and often plays roles as Santa-on-vacation. It has helped Hire Santa claim annual revenues of around £250,000. \nBut when asked whether business growth could slow in the years ahead as a result of Brexit, Ms Harvey said: \nI don’t believe so, because Santa - Father Christmas - is always going to be a prolific part of our culture, and that’s not going to go away. \nThe director is banking on the company’s “niche” focus on the high-end market to usher in further growth. Ms Harvey said her company focuses on getting the “best-quality Santas” - though not the cheapest - and tends to serve the upper end of the market, with corporate clients making up the majority of its bookings. \nThe business has around 70 costumes on the rack for their actors, who could be called in for anything from a mid-year wedding to an event that calls for 30 Santas. On one occasion, one of the company’s Santas was even booked for a gig that saw them airlifted to the top of a building. \nBut it is not just a fulsome beard that makes a perfect Father Christmas. Only two of her hires have beards of their own. She said Santas-to-be need to have a natural laugh, a good personality and a great sense of humour. Santa’s need to be able to think on their feet and deal with occupational hazards such as physical attacks by children. \nThe real Santa’s views on the EU referendum are unknown. What Bank Holidays is Santa bringing to us? 8:35 \nThe FTSE-100 index opened at 7011.64. \nThe pound at 8am was 1.2487 dollars compared to 1.2476 dollars at the previous close. \nThe euro at 8am was 0.8381 pounds compared to 0.8386 pounds at the previous close 8:30 KEY EVENT BP strikes deal with Kosmos Energy over west Africa gas field \nBP is to inject almost $1bn (£800m) into a gas field off the coast of west Africa as the industry continues to battle low energy prices. \nThe oil giant said it has struck an agreement with Kosmos Energy to explore the Tortue field off the coasts of Mauritania and Senegal. The deal will see BP pick up a 62% stake in Kosmos’s Mauritanian operation and 32.5% of its Senegalese unit. \nBP boss Bob Dudley said: \nBP’s entry into Mauritania and Senegal represents an exciting strategic opportunity to work with Kosmos Energy in an emerging world-class hydrocarbon basin. \nWe believe our expertise in integrating the gas value chain, together with a talented exploration partner in Kosmos, along with the support of the Mauritanian and Senegalese governments, brings together all the elements needed to create a new liquefied natural gas hub in Africa. \nBP added that the field could contain roughly 50tn cubic feet of gas resource potential. \nOver the weekend, BP struck a deal to snap up a 10% stake in Abu Dhabi Company, giving it access to emirate’s largest oilfields. In exchange, the government of Abu Dhabi will take a 2% stake in BP, worth around $2.2bn (£1.8bn). A view of part of the BP Etap platform (Eastern Trough Area Project) in the North Sea (Photo: Andy Buchanan/PA Wire) 8:27 KEY EVENT GoDaddy could see Brexit boost if more entrepreneurs 'strike out on their own' \nUS tech giant GoDaddy stands to get a boost from Brexit if more British entrepreneurs “strike out on their own” in the face of a bleak economic outlook. \nGoDaddy, a major player in domain registration and web hosting, could see customer numbers grow even in the event of an economic downturn in the UK, according to chief executive Blake Irving. He said: \nWhen a government or large businesses tend to fail, people, whether it’s a citizen or somebody who’s working for a company, think they have to strike out on their own and we actually benefit from that. \nBecause when they’re going to start something (like a business), they register a domain name or they start a website up and they get going because they feel they’ve got to bootstrap it themselves. So we have a resilience in that regard. \nGoDaddy is one of the latest US firms to make a move on the British market, having snapped up London-headquartered Host Europe Group (HEG) for €1.69bn (£1.42bn) in its largest acquisition to date. \nHEG, which owns UK web domain registration site 123 Reg, is the largest privately-owned web service provider in Europe, with offices in the UK, Germany, France, Spain, Romania and Bulgaria. \nMr Irving admitted that Brexit slowed the deal process for a “couple months” but that the Arizona-based firm was eventually assured and closed the deal. He said: “We went through with the deal, so we have confidence that the market - both Britain and Europe - are going to be strong for us”. \nGoDaddy already surpassed one million domains in Britain before the takeover, and Mr Irving said the company has continued to gain market share in the UK. A number of American tech firms including Facebook, Apple and Google have renewed their commitment to the UK in recent months, despite the Brexit vote. \nApple is now set to consolidate its London operations in the Battersea Power Station from 2021, while Google will open a new London building that could create up to 3,000 jobs. \nFacebook has said it plans to expand its UK workforce by around 500 when it opens its London headquarters in 2017. GoDaddy boasts over 7m international customers after acquiring HEG’s 1.7bn client accounts. \nMr Irving said that the company is now likely to focus in on existing operations, having already gained a foothold in 56 international markets. He added: \nWe think there’s maybe some opportunity in northern Africa, or the Middle East, but, honestly, right now we’re trying to become more effective in the markets we operate. The Union Jack flag flies besides the flag of the European Union Share", "external_links": [], "published": "2016-12-19T15:20:00.000+02:00", "crawled": "2016-12-19T10:57:47.189+02:00", "highlightTitle": ""}