{"organizations": [], "uuid": "f89b15193b8942d079d867c628a886372d767be7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12373993.ece/ALTERNATES/s1200/CFR_NJL_281116lep_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/indian-investors-looking-opportunities-northern-12373917", "country": "GB", "domain_rank": 21960, "title": "Indian investors looking for opportunities in Northern Powerhouse", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Indian investors looking for opportunities in Northern Powerhouse", "spam_score": 0.0, "site_type": "news", "published": "2016-12-27T19:02:00.000+02:00", "replies_count": 0, "uuid": "f89b15193b8942d079d867c628a886372d767be7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/indian-investors-looking-opportunities-northern-12373917", "ord_in_thread": 0, "title": "Indian investors looking for opportunities in Northern Powerhouse", "locations": [], "entities": {"persons": [{"name": "geoff phillips", "sentiment": "none"}, {"name": "martin venning", "sentiment": "none"}, {"name": "pat ritchie", "sentiment": "none"}, {"name": "ammar mirza", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "manchester central", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "delhi", "sentiment": "none"}, {"name": "punjab", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "neutral"}, {"name": "connex", "sentiment": "neutral"}, {"name": "north east lep", "sentiment": "none"}, {"name": "uk northern powerhouse conference", "sentiment": "none"}, {"name": "parkdean holidays", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "manchester evening news", "sentiment": "none"}, {"name": "sage uk", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "uk northern powerhouse international conference", "sentiment": "none"}, {"name": "federation of indian chambers of commerce and industry", "sentiment": "none"}, {"name": "asian business connexions", "sentiment": "none"}, {"name": "fcci", "sentiment": "none"}, {"name": "nomad digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Indian investors looking for opportunities in Northern Powerhouse North East's Asian Business Connexions will meet Indian investors to sell opportunities in the region Share Ammar Mirza CBE (Photo: NELEP) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA high profile delegation from India is set to visit the North East early in the New Year with a view to forging trade links with the Northern Powerhouse. \nThe group from the Federation of Indian Chambers of Commerce and Industry (FCCI) will be visiting the Northern Powerhouse conference in Manchester in February and touring key Northern cities, including Newcastle . \nMembers of the delegation include representatives of medium to large businesses from a range of sectors including health, life sciences, education, pharmaceuticals and chemicals. \nThe group comes from across India, including businesses in Delhi, Mumbai and Punjab, with the companies represented said to be “hungry to do business” with prospective partners in the North. \nAmong the groups they will meet will be Newcastle-based Asian Business Connexions, whose chairman Ammar Mirza has recently become a board member of the North East LEP. \nHe said: “The UK Northern Powerhouse International Conference and Exhibition is an ideal opportunity for Indian businesses to establish important relationships within the North. \n“There are a variety of trade links and business opportunities available here and we are very focused on what can be achieved during this visit. We want to make sure that the right connections are made and as a result, secure business opportunities throughout the region.” Big Northern Powerhouse conference at Manchester Central (Photo: Manchester Evening News) \nThe visit of the Indian delegation comes as the weakness of the pound makes UK businesses increasingly attractive to foreign investors. \nThe run-up to Christmas saw two North East companies - holiday firm Parkdean Holidays and train wi-fi provider Nomad Digital - being bought out by foreign firms in big-money deals. \nBoth deals are likely to see investment in the North East firms, though there have been warnings that continued weakness in Sterling could see many UK assets bought up on the cheap by overseas firms. Read More Warning on the UK's attractiveness to foreign investors \nThe UK Northern Powerhouse International Conference will be held in Manchester Central on February 21 and 22 and is expected to attract more than 3,000 delegates. Speakers confirmed for the event include Newcastle City Council chief executive Pat Ritchie, Geoff Phillips from Sage UK and a represenative of Nissan. \nMartin Venning, director of the UK Northern Powerhouse International Conference and Exhibition, said: “The North’s long standing relationships with India is one of the region’s great untapped assets with huge potential for the future. \n“This is an outstanding opportunity for businesses attending the UK Northern Powerhouse Conference to meet face to face with prospective trade partners from India who are looking to establish links with northern companies from a diverse range of sectors who want greater access to global markets in the post Brexit era.” Like us on Facebook", "external_links": [], "published": "2016-12-27T19:02:00.000+02:00", "crawled": "2016-12-27T14:09:52.254+02:00", "highlightTitle": ""}