{"organizations": [], "uuid": "2b31a1a92aa9eb8d1ba655ab8fcbb072643fb0e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12322058.ece/ALTERNATES/s1200/CFR_NJL_281014fishing_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/fish-prices-set-rise-because-12322071", "country": "GB", "domain_rank": 21960, "title": "Fish prices set to rise because of Brexit, North East specialist firm warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Fish prices set to rise because of Brexit, North East specialist firm warns", "spam_score": 0.0, "site_type": "news", "published": "2016-12-15T00:19:00.000+02:00", "replies_count": 0, "uuid": "2b31a1a92aa9eb8d1ba655ab8fcbb072643fb0e1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/fish-prices-set-rise-because-12322071", "ord_in_thread": 0, "title": "Fish prices set to rise because of Brexit, North East specialist firm warns", "locations": [], "entities": {"persons": [{"name": "richard collins", "sentiment": "none"}, {"name": "collins", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "collins", "sentiment": "negative"}, {"name": "county durham", "sentiment": "negative"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "wraggs seafoods limited", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "collins seafoods", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fish prices set to rise because of Brexit, North East specialist firm warns County Durham's Collins Seafoods saw turnover break the £50m barrier last year Share Fish prices are likely to increase as a result of Brexit, a firm has warned (Photo: PA - tark archive) Share Get business updates   \nFrozen fish supplier Collins Seafoods issued a warning that Brexit will increase the price of fish, despite breaking through the £50m turnover barrier. \nTurnover at the Durham-based company grew 6.1% last year to £50.3m, up from £47.4m in 2015. \nAt the same time Collins Seafoods saw its cost of sales increase by £3m, which led to the firm’s profit before tax dropping 20% from £1.6m to £1.27m. \nManaging director Richard Collins said: “The next financial year is set to be more challenging with the impact of the EU referendum result on sterling, which will increase the purchase price of our fish products. Additionally, the market continues to be highly competitive with competitors attempting to obtain market share via price. \n“Over the next financial year our aim is to continue to focus on marketing, in the hope to strengthen our position in the market by improving our brand awareness.” \nDespite the fall in profits, the firm managed to increase its cash in the bank from by £31,000 to £177,000. It also managed to reduce its overdraft from £2.3m to £1.9m. \nWhile Mr Collins cited the positives of the company’s increased turnover, he warned that the business’s profit margin had been impacted by the increased price of seafood. \nHe said: “The cost of stock still to a large extent remains outside the company’s control and is dependent upon market forces. \n“During the year the group’s margin was impacted by rising prices and as the directors are not always able to pass on price rises to customers they ensure other cost of sales are monitored accordingly.” \nThe review of costs caused the company’s gross margin to drop drop from 5.5% in 2015 to 4.8% in 2016. \nThe Newton Aycliffe business was founded in 1980 when Mr Collins filled his van with fresh seafood with the aim of supplying to local restaurants, bars, hotels and fish and chip shops. Now the business works with suppliers across Europe to provide customers with “frozen at sea fish”. \nIn 2011 the company expanded its business by acquiring Leeds-based Wraggs Seafoods Limited, which is also involved in the wholesale and retail of fish, seafood and other frozen produce. Like us on Facebook", "external_links": [], "published": "2016-12-15T00:19:00.000+02:00", "crawled": "2016-12-14T19:56:32.835+02:00", "highlightTitle": ""}