{"organizations": [], "uuid": "704aaef35a4a739d6a3099559513165d3354d191", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article10439221.ece/ALTERNATES/s1200/JS75496723.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/arts-culture-funding-north-east-12260952", "country": "GB", "domain_rank": 21960, "title": "Arts and culture funding in the North East slashed by £13 million", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Arts and culture funding in the North East slashed by £13 million", "spam_score": 0.0, "site_type": "news", "published": "2016-12-02T12:00:00.000+02:00", "replies_count": 0, "uuid": "704aaef35a4a739d6a3099559513165d3354d191"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/arts-culture-funding-north-east-12260952", "ord_in_thread": 0, "title": "Arts and culture funding in the North East slashed by £13 million", "locations": [], "entities": {"persons": [{"name": "tom watson", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "creative europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "share labour", "sentiment": "none"}, {"name": "media and sport", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "creative europe programme", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Arts and culture funding in the North East slashed by £13 million Museums, art galleries and theatres suffer as funding falls with the North East taking the biggest fall Share Labour party deputy leader Tom Watson Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSpending on culture , heritage and the arts has been slashed by £13 million since 2010 across the North East. \nThe figures were published by Tom Watson, the Black Country MP and Labour’s Shadow Secretary of State for Culture, Media and Sport. \nAnd he pointed out that the North East has suffered the biggest fall in funding in the country after taking into account the size of the population. \nIt comes to more than £5 per person, a bigger cut per head than anywhere else. \nSpending was cut by local authorities, but Labour points out that this was a result of huge cuts in the grants they receive from central government. \nFor example, Newcastle City Council has cut more than £200m from its budgets since 2010 and aims to save £70m more by 2020. \nIt means there is less money for museums, art galleries, theatres and community art and culture organisations. Nationwide, funding has been cut by £165 million. A European Union flag in front of Big Ben (Photo: Daniel Leal-Olivas/PA Wire) \nBut the spending squeeze could be even greater once we leave the European Union , because the UK is set to lose access to an EU grant scheme called the Creative Europe Programme. \nOver the last two years Creative Europe supported 230 UK cultural and creative organisations and audiovisual companies, as well as the cinema distribution of 84 UK films in other European countries, with grants totalling €40 million. \nThe north of England received around £1.3 million a year from EU funds for culture in recent years. \nIn theory, the Government could replace EU funding with cash from the Treasury after Brexit, but it has not so far promised to replace the Creative Europe Programme. \nMr Watson said: “The UK’s rich artistic and cultural heritage is the envy of the world and something everyone in this country can be proud of. \n“While Labour made the landmark decision to make our national museums to the public free of charge, opening up access to millions, new figures we’ve obtained have shown that arts and culture funding has been cut by £165 million since the Tories came to power with local councils and arts organisations now set to lose out on millions more when we leave the EU. Read More How would you vote if a second EU referendum was held today - here's your chance \n“If the Government is going to make a success of Brexit and create a ‘country that works for everyone’ it must create a country that works for the arts too. But right now we’ve got a Government that’s slashing arts funding and sidelining them from the Brexit top table. \n“Culture and the arts are too important to this country and its soft power to neglect them like this – the Government needs to tell us what more they are going to do.” \nA source in the Department of Culture, Media and Sport said: “This Government is committed to supporting the UK’s world-class arts and culture, which is why we are investing £1.1 billion through Arts Council England between 2015 and 2018. \n“Labour are too divided to accept that we will be leaving the European Union. Only the Conservatives can be trusted to make a success of Brexit and deliver the right deal for Britain. \n“We know that the arts play a vital role in shaping the UK’s image and reputation abroad. We are working closely with the arts sector to make sure we seize the exciting opportunities that will come from a new place for Britain in the world.” Like us on Facebook", "external_links": [], "published": "2016-12-02T12:00:00.000+02:00", "crawled": "2016-12-02T08:51:16.454+02:00", "highlightTitle": ""}