{"organizations": [], "uuid": "01d7b381f7411131eee16e33052056488e15b252", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11835139.ece/ALTERNATES/s1200/Quayside-from-the-Baltic.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-12277989", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "spam_score": 0.0, "site_type": "news", "published": "2016-12-06T13:50:00.000+02:00", "replies_count": 0, "uuid": "01d7b381f7411131eee16e33052056488e15b252"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-12277989", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tom eden", "sentiment": "negative"}, {"name": "ashman", "sentiment": "none"}, {"name": "steve ashman", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "copthorne hotel", "sentiment": "none"}, {"name": "northumbria police", "sentiment": "none"}, {"name": "tom eden northumbria police", "sentiment": "none"}, {"name": "environment agency", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "guardian", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Eden Traffic lights on the Quayside \nAgain, regarding the flood barriers coming to the Quayside today, it will be the first time the temporary barriers, which form part of the Government’s national flood prevention plans, have been deployed and tested in the North East. \nOrganised in partnership with Newcastle City Council, the exercise will boost flood resilience across the region by training staff how to put the barriers up as well as testing new operational deployment plans. \nThere will be traffic lights, too: 07:05 Horse trapped in barbed wire \nFirefighters in Durham were called to help a distressed horse, trapped in barbed wire: 07:04 \nRegarding the last post, here’s what it’s aiming to stop: The scene after the River Tyne burst its banks on Newcastle's Quayside 07:00 Flood barriers on the Quayside \nTonight, the Quayside might look a little different - but do not be alarmed. Newcastle Quayside \nThe Environment Agency and Newcastle City Council are trying out a new bit of flood-busting kit in the North East. In a live exercise, 700m of flood barrier will be built alongside the Tyne’s bank to test flood prevention methods. It is the first time the barriers have been used in the region. \nStaff will be trained on how to put up the mobile defences - which can be dispatched to any British location in 12 hours - and tested in flood-operation drills. \nOn Tuesday, a one metre high barrier will run from the Copthorne Hotel down to the Pitcher & Piano, to protect the “lowest” section of the Quayside, which floods when water levels reach 3.15m. \nSupport staff will test out technology which sends live flooding data to the Environment Agency. 06:52 Tom Eden Northumbria Police chief warns Brexit could draw more foreign criminals to the UK \nForeign criminal gangs may consider relocating to the UK after Brexit , the Chief Constable of Northumbria Police has warned. \nThe force’s top cop Steve Ashman has dismissed the argument of those who campaigned to leave the EU that Britain’s departure would lead to a reduction in foreign criminals operating in the UK. \nIn an interview with the Guardian, Mr Ashman said that he would be very concerned if Brexit meant UK police could no longer apply for a European arrest warrant (EAW) or have access to surveillance and information-sharing systems from their European counterparts. \nHe said: \n“I think if you lose the ability to extradite people effectively then one might also argue that that’s going to make us quite attractive to a particular criminal group. \n“I think we are always going to have a problem with foreign national offenders. \n“What’s important to me – and, I think, what’s important for UK law enforcement – is that we have effective and efficient means of dealing with them when they are here. \n“Because I think we are dreaming if we think the position is ever going to be arrived at when there are no foreign national offenders in this country.”", "external_links": [], "published": "2016-12-06T13:50:00.000+02:00", "crawled": "2016-12-06T09:17:16.353+02:00", "highlightTitle": ""}