{"organizations": [], "uuid": "38b805a323cea41e3efe42425cb744d67bbaa154", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29982887/15742457.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/jobless-numbers-keep-falling/story-29982887-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published Jobless numbers keep falling", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Lauren_Mills published Jobless numbers keep falling", "spam_score": 0.0, "site_type": "news", "published": "2016-12-14T21:57:00.000+02:00", "replies_count": 0, "uuid": "38b805a323cea41e3efe42425cb744d67bbaa154"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/jobless-numbers-keep-falling/story-29982887-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published Jobless numbers keep falling", "locations": [], "entities": {"persons": [{"name": "hastings", "sentiment": "none"}, {"name": "scott knowles", "sentiment": "none"}, {"name": "lorna foden", "sentiment": "none"}, {"name": "foden", "sentiment": "none"}], "locations": [{"name": "east midlands", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "charles street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "coalville", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nLeicestershire's dole queues are continuing to shrink, according to latest official figures. \nManagement at Jobcentre Plus said fewer people claimed Jobseeker's Allowance and Universal Credit last month than a year earlier. \nThey said job creation partnerships with big local employers such as Hastings Direct insurance and Amazon, which recently opened an enormous new warehouse near Coalville were helping get more people into work. \nThe Office for National Statistics (ONS) said the UK unemployment rate has fallen to a 10-year low of 4.8 per cent. \nThe jobless total stands at 1.62 million after a reduction of 16,000 in August, September and October, official figures said. \nThe rate has not been lower since summer 2005, ONS said. \nLorna Foden, senior operations leader for Jobcentre Plus in Charles Street, Leicester, said the number of people claiming jobseeker's allowance and universal credit in Leicester was 3,790 in November, down 19 per cent down on the 4,655 in November 2015. \nThe number of young claimants – aged 18 to 24 – was down 6 per cent year-on-year at 885, while 865 over-50s were claiming, a decrease of more than 15 per cent compared with the same month last year. \nIn the rest of Leicestershire, the total number of claimants was down 6.3 per cent to 3,205, with claimants aged 50-plus down almost 6.9 per cent to 810. \nThe number of young claimants rose by 6.7 per cent to 800. \nMs Foden said: \"It's looking like good news for Leicester, while nationally employment is at a record low rate. \n\"There is lots of activity in job centres. We are having employers and their agencies regularly coming in and most are holding weekly jobs fairs. \n\"We've seen all sorts of seasonal job vacancies, spanning warehousing, care work, hospitality and driving. \n\"The arrival of Amazon is great news for us as it has so many jobs available, in warehousing, catering, administration and management roles. \nWe also have a really good relationship with Hastings.\" \nScott Knowles, chief executive of East Midlands Chamber, said: \"These figures are better than we'd anticipated given all the recent negativity over the impacts of Brexit. \n\"They show business in the East Midlands remains robust. \n\"There may be turbulent waters ahead and there will be inflationary pressures that will negatively impact the jobs market, but there is also little doubt East Midlands businesses are continuing to drive the national economy. \n\"The Government must recognise the contribution this region is making and ensure it does all it can to reduce the doubt and uncertainty business faces. \n\"It needs to address immediate concerns such as the status of overseas workers once Article 50 is invoked and give assurances there will continue to be access to finance to encourage business growth.\"", "external_links": [], "published": "2016-12-14T21:57:00.000+02:00", "crawled": "2016-12-14T17:22:41.159+02:00", "highlightTitle": ""}