{"organizations": [], "uuid": "4edf0ed6bf97ccd737f7ebb37b7a4cc802fb4f63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article9798616.ece/ALTERNATES/s1200/JS63000604.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tory-mp-government-whip-defends-12274470", "country": "GB", "domain_rank": 21960, "title": "Tory MP and Government whip defends judges in Brexit row", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Tory MP and Government whip defends judges in Brexit row", "spam_score": 0.0, "site_type": "news", "published": "2016-12-05T20:00:00.000+02:00", "replies_count": 0, "uuid": "4edf0ed6bf97ccd737f7ebb37b7a4cc802fb4f63"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tory-mp-government-whip-defends-12274470", "ord_in_thread": 0, "title": "Tory MP and Government whip defends judges in Brexit row", "locations": [], "entities": {"persons": [{"name": "guy opperman", "sentiment": "negative"}, {"name": "opperman", "sentiment": "none"}, {"name": "matteo renzi", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "jeremy wright", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "james wolffe", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "holyrood", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "hexham", "sentiment": "negative"}, {"name": "the high court", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "scottish parliament", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "invalid email  tory", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Tory MP and Government whip defends judges in Brexit row Hexham MP Guy Opperman says judges are not trying to block Brexit and launched a staunch defence of the judges behind the ruling Share Click to play Tap to play The video will start in 8 Cancel Play now Brexit Ruling: What happened and what happens next? Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTory MP and Government whip Guy Opperman has come to the defence of judges who said the Prime Minister does not have the power to take the UK out of the EU. \nMr Opperman, MP for Hexham and a former lawyer, said the High Court judges had been unfairly attacked by some newspapers. \nHe made the comments as the Government went to the Supreme Court in the latest stage of the legal battle over Brexit. \nThe highest court in the land is being asked to overturn the High Court’s ruling that the Prime Minister cannot trigger the process of taking Britain out of the European Union alone. \nIn a decision that infuriated Brexiteers, three high court judges said the Prime Minister could not use the royal prerogative to trigger Article 50 of the Lisbon Treaty and start the two-year process of negotiating Brexit. \nWhile they did not spell out what should happen instead, their ruling probably means that the Government would have to win a vote in Parliament before it could trigger Article 50. Guy Opperman \nIn theory, this could give MPs the chance to prevent Brexit happening, or to demand a “soft” Brexit in which the UK accepts some loss of control over immigration policy in return for remaining in the single market. MPs could also simply support he Government’s proposals. \nMr Opperman criticised coverage of the decision in the Daily Mail, a newspaper which supported Brexit. He wrote on his blog: “It is not, as the Daily Mail suggests, a decision that was an attack on the people, but in reality a return of power to the people, via their parliament. Sadly the reporting of the high court decision was very inflammatory.” \nHe added: “The High Court is not seeking to thwart the decision of the June 23 referendum, which I for one have made clear I completely accept, as does the court; it is merely saying that we enact this decision through Parliament, not by the executive power of the Prime Minister. The Government is appealing this as it believes that it does not need to go back through Parliament and can get on with exit via a simple decision of the Prime Minister.” Read More North East now wants to stay in the European Union according to our Brexit poll \nMr Opperman said: “I utterly reject criticisms of the Supreme Court and high court justices, as orchestrated by the papers. But the key point of today’s blog is to make the point that it is a slippery slope to attack our rule of law. \n“Having been a lawyer for 20 years I am entirely satisfied that the decision is to be tried on its merits. The reality is that those seeking to exit the EU fought long and hard to ensure Parliamentary democracy. And the judges agree.” \nBrexit Secretary David Davis is leading the Government’s historic legal action. His team of lawyers, headed by Attorney General Jeremy Wright, will argue in the four-day Supreme Court hearing that the three High Court judges erred over Article 50 and its use was legally justified by the June 23 referendum vote in favour of quitting the EU. \nThe decision will be made by 11 Supreme Court justices, a record number to sit on an appeal. \nIf the appeal is unsuccessful, and any potential further appeal to the European Court of Justice in Luxembourg also fails, the Government’s plans for Brexit could be thrown into disarray . \nBut Mrs May has made it clear she still intends to give an Article 50 notification by the end of next March to start the leave negotiations with 27 other EU countries. Read More 'Trade with the UK will continue' - US delivers massive vote of confidence in post-Brexit Britain \nThe Scottish and Welsh governments and the Attorney General for Northern Ireland are all intervening in the case. \nScotland’s Lord Advocate James Wolffe QC is to argue that it would be unlawful for the Article 50 process to start without a legislative consent motion from the Scottish Parliament at Holyrood. \nThe Attorney General said: “The country voted to leave the European Union in a referendum provided for by an Act of Parliament. \n“The Government is determined to respect the result of the referendum. The Government’s case is that it does have legal power to trigger Article 50 on the timetable set out by the Prime Minister. We do not believe another Act of Parliament is necessary.” \nMeanwhile, the European Union is facing fresh turmoil as Italy’s prime minister Matteo Renzi announced his resignation after suffering a decisive defeat in his constitutional reform referendum. \nNinety minutes after polls closed, the 41-year premier conceded defeat as exit polls suggested 57% of voters had rejected his plan to streamline the country’s system of government. \nFinancial markets were braced for fresh volatility amid fears his fall could spark a run on Italy’s tottering banks, further weakening the euro. Like us on Facebook", "external_links": [], "published": "2016-12-05T20:00:00.000+02:00", "crawled": "2016-12-05T15:34:12.210+02:00", "highlightTitle": ""}