{"organizations": [], "uuid": "821e4e6019495f480088a10fc8d99f502c0d64fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article6894548.ece/ALTERNATES/s1200/JS28851302.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/trade-uk-continue-delivers-massive-12254806", "country": "GB", "domain_rank": 21960, "title": "'Trade with the UK will continue' - US delivers massive vote of confidence in post-Brexit Britain", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "'Trade with the UK will continue' - US delivers massive vote of confidence in post-Brexit Britain", "spam_score": 0.0, "site_type": "news", "published": "2016-12-01T12:00:00.000+02:00", "replies_count": 0, "uuid": "821e4e6019495f480088a10fc8d99f502c0d64fb"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/trade-uk-continue-delivers-massive-12254806", "ord_in_thread": 0, "title": "'Trade with the UK will continue' - US delivers massive vote of confidence in post-Brexit Britain", "locations": [], "entities": {"persons": [{"name": "matthew barzun", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "barzun", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "winfield house", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "united nations security council", "sentiment": "none"}, {"name": "transatlantic trade and investment partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   \nThe United States and United Kingdom will continue to have huge and growing trade links after Brexit , the US Ambassador to the UK has insisted. \nAnd the UK will continue to be a major player in world affairs, he said. \nMatthew Barzun, American’s ambassador to the UK since 2013, said leaving the EU would do no harm to trade, military and diplomatic links between our countries - or to the “unbreakable and unshakeable” special relationship. \nHis vote of confidence in the UK’s post-Brexit future comes months after US President Barack Obama warned that Britain would go to the “back of the queue” for trade talks, if it quit the EU. \nAmbassador Barzun, an ally of Mr Obama who led his fundraising efforts in the 2012 US elections, said the President’s comments had been misunderstood and were not intended to be “punitive”. \nHe was speaking to regional journalists in Winfield House, his official residence set in 12 acres of grounds in Regent’s Park, London. \nThe US would continue working to try to agree the Transatlantic Trade and Investment Partnership, a major trade deal with the EU, he said. \nBut he said that “regardless of what happens to that actual deal”, trade with the UK would continue to be vital to both countries. \nAmbassador Barzun said: “We are each other’s number one investors, and no-one even comes a close second. \n“This is 500 billion-ish both ways of investment. \n“That means a million Americans wake up every day in America and go to work in places because of British investment. \n“A million Brits wake up every day and go to work because of American investment. \n“And that didn’t happen overnight, and it didn’t happen because of just one deal. \n“It’s decades and decades of businesses and customers building these connections. \n“So I am confident that is going to continue.” U.S. Ambassador Matthew Barzun \nWhile the UK negotiates the terms of leaving with the 27 remaining EU countries, trade with the US would be unaffected, he said. \n“While the UK and the remaining 27 figure out what their future relationship will be, I think the United States and the United Kingdom and the small businesses and big businesses and all the connections that happen, continue.” \nAnd the lack of a specific trade deal such as the Transatlantic Trade and Investment Partnership would not be a problem, he said. \n“Look at all the trade in goods and services and investment and cultural exchanges and student exchanges and the number of flights that go back and forth between the United Kingdom and United States. \nThat didn’t happen overnight, it didn’t happen because of one deal, it is decades and decades of accumulated connections.” \nPresident Obama said in April that the UK would be at the “back of the queue” in terms of negotiating a trade deal with the US, if it left the European Union. \nIt provoked a strong reaction. Downing Street staff were initially delighted, believing that the comments would help David Cameron win his campaign for a “remain” vote in the referendum, but the President also came under fire from Brexit campaigners who accused him of interfering in the June 23 referendum. \nAmbassador Barzun said the comment was misinterpreted, and suggested it had been reported out of context. \nHe said: “President Obama’s point at the time was, as a member of the European Union, the European Union was at the front of the queue with this Transatlantic Trade and Investment Partnership deal. \n“There was nothing punitive about it. \n“If you take that phrase in isolation and reprint it elsewhere, you can see how people might feel that it was, but it wasn’t meant that way, it wasn’t said that way.” Read More How would you vote if a second EU referendum was held today - here's your chance \nThe Ambassador insisted President Obama had made it clear that “of course it’s up to you and if you ask, here is what we think. And regardless of the outcome on June 24 and going forward, this special relationship is unbreakable and unshakeable no matter what the result is, because of the emotional, cultural, commercial, you name it, ties that bind our two countries together.” \nSome opponents of Brexit argue that the UK’s influence and standing - and possibly its value as an ally - will be diminished as a result of leaving the EU. \nBut asked about this, Ambassador Barzun highlighted ways in which the UK will continue to be influential. \n“Permanent member of the United Nations Security Council. Vibrant and fully paid up member of NATO. \n“G7, G20. All these organisations where, by an accident of the alphabet we sit next to each other at those tables, because if it’s English spelling it’s United States, United Kingdom. \n“But it is no accident that we are shoulder to shoulder in places around the world, because we share the same beliefs and values, and we are willing to speak up, stick up, for them.” Like us on Facebook", "external_links": [], "published": "2016-12-01T12:00:00.000+02:00", "crawled": "2016-12-01T07:56:04.896+02:00", "highlightTitle": ""}