{"organizations": [], "uuid": "d1b3ce27c86fdb1428392c0ab44537c4bd390631", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12389287.ece/ALTERNATES/s1200/Donald-Trump.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/winners-big-votes-go-spoils-12389291", "country": "GB", "domain_rank": 21960, "title": "To the winners of the big votes go the spoils - but now we have to grapple with the consequences", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "To the winners of the big votes go the spoils - but now we have to grapple with the consequences", "spam_score": 0.0, "site_type": "news", "published": "2016-12-31T20:00:00.000+02:00", "replies_count": 0, "uuid": "d1b3ce27c86fdb1428392c0ab44537c4bd390631"}, "author": "Thom Brooks", "url": "http://www.chroniclelive.co.uk/news/north-east-news/winners-big-votes-go-spoils-12389291", "ord_in_thread": 0, "title": "To the winners of the big votes go the spoils - but now we have to grapple with the consequences", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "michael gove", "sentiment": "none"}, {"name": "elie wiesel", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "merle haggard", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "glenn frey", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "thom brooks", "sentiment": "none"}, {"name": "muhammad ali", "sentiment": "none"}, {"name": "sadiq khan", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "david bowie", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "west wing", "sentiment": "none"}, {"name": "dc", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "trump’s america", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "durham law school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President-elect Donald Trump (Photo: AP) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \n2016 was a year of surprises from start to finish. There were triumphs ranging from the fabulous success of Britain’s outstanding Olympians and Paralympians in Brazil winning a record number of medals to London electing Sadiq Khan as its first Muslim Mayor. \nThe past year has also brought much sad news of celebrity deaths. From David Bowie and Prince to Glenn Frey and Merle Haggard in the music world, and from Muhammad Ali to Elie Wiesel in the world beyond music – it’s like we’re all entering a new, strange world marked more by what is missing than what is there. \nSomewhere in between the triumphs and sadness lie two great surprises: Brexit and Trump. For some readers one or both will be seen as a kind of triumph, yet others find only grief. A remarkable range of emotions for capturing something that hasn’t happened, or at least not yet. \nTheresa May can say ‘Brexit means Brexit’ all she likes. Britain is still as much a part of the EU today as it was on June 23. The only things that have changed is just about everyone who wanted Britain to Vote Leave ran for the hills as soon as the verdict was announced. This was not about ‘taking back control’, but leaving one giant mess for somebody else to clean up. \nFirst gone was Nigel Farage who quit as Ukip leader. From his Twitter account, it appears he cares much more for living in Trump’s America than Britain post-Brexit. This really should give his game away. Then Boris Johnson decided against standing for leader of the Tories. Next Michael Gove quit running to lead the Tories within days of launching his bid. It makes you wonder – seriously wonder – why they fought for Brexit in the first place. None seem to have much, if any, interest in actually making it happen. \nSome argue that the shock wins of Brexit and Trump have one thing in common – the public have had enough of elites and instead looking to upset the apple cart. Both campaigns had something of an insurgency about them in taking on an establishment and aiming their fire at a political elite – whether in Brussels or Washington, DC – that was untrustworthy. \nOf course, there is more than a grain of truth in this. Politicians are held in lower esteem than journalists – perhaps even columnists who write about politicians. When one MP gets embroiled in a problem, this can tarnish all MPs. This is not unique to Parliament – an unhelpful waiter can damage the reputation of the finest restaurant. \nAn age of deference to politicians and the media’s less scrupulous eyes once upon a time is now an age of bitter cynicism amid a wide range of news sources in print and online. If we are uncomfortable with what is reported in one source, we can go to something less scrupulous until we reach an alternative reality providing a comfort zone. \nYet this cynicism has become a kind of postmodernism gone very bad. It is one thing to challenge arguments and demand evidence, but it is another to do so without any respect for argumentation or genuine evidence. \nWhen Brexit said leaving the EU would mean restricting immigration, this was not strictly speaking true and they should have known it. We can leave the EU but still be part of the EU free movement rules that come with membership of the European Economic Area (EEA) – each is part of a different legal arrangement. Norway is an example of one such non-EU country with EU free movement. The referendum paper mentioned the EU, but not the EEA. \nSimilarly, when Trump said he had a foolproof plan for defeating Isis, but then couldn’t say anything about it – beyond that it would be ‘great’ – because then the enemy would know it is simply breathtaking. \nSo while I agree that supporters of Brexit and Trump sent a message about rejecting the status quo, I don’t accept the pollsters did all that bad a job. The real common thread connecting these two shock victories was the certainty that neither would happen. We were all so sure the UK would stay in the EU and that Hillary Clinton would enter the White House that too many of those who were so sure stayed home. If everyone who was for Remain had turned out, Britain would not be scratching its collective head wondering a full six months on precisely what, if anything, Brexit means. It’s just gobbledygook so far. And if voter turnout was higher in the US, we’d be talking about Clinton instead of Trump. \nIn short, the big political surprises of 2016 were a result of some not taking the outcome for granted. The winner of every election is not who wins over the most voters, but who gets the most votes. Voters and votes are different things. The side that wanted victory most got it and there is a kind of natural justice about it. \nBut Brexit and Trump have more in common than this. They also represent the risks of taking a punt. Did you hear what Theresa May’s government was up to recently? Probably not because they are still sitting around a white board trying to figure out what Brexit means. Their best idea thus far is to propose a ‘Great Repeal Bill’ that will neither be great or repeal. It will freeze EU law in time so we can literally spend years repealing or amending legislation one by one. While Europe will have moved on in 10 years’ time, we might still find ourselves bound by outdated European rules because our government today simply doesn’t know what else to do next. This is anything but control. \nDuring Trump’s first visit to the White House, he found out – for the first time – that he had to fill jobs not only in his Cabinet, but throughout the whole of the West Wing. Until a few weeks ago, he didn’t know this. Next month he becomes Commander in Chief of the world’s most deadly military power. This is not a good omen he is genuinely prepared for the office he is take up. \nNone of the above are reasons against supporting either lest I be accused of having sour grapes. To the winner goes the spoils. But I hope that readers of whatever political inclination will agree with me that in 2017 let’s view public service as the public good it is – and treat it with the sober seriousness it deserves. Our democracy is worth it. Thom Brooks is Head of Durham Law School and author of Becoming British (Biteback 2016) \n@thom_brooks", "external_links": [], "published": "2016-12-31T20:00:00.000+02:00", "crawled": "2016-12-31T17:04:12.138+02:00", "highlightTitle": ""}