{"organizations": [], "uuid": "73bf1d2ed66b6bea10d5146e555fa01341ea6f77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12302278.ece/ALTERNATES/s1200/804536.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/good-bad-side-effects-brexit-12302219", "country": "GB", "domain_rank": 21960, "title": "The good and the bad: Some of the side effects of Brexit you didn't know about", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The good and the bad: Some of the side effects of Brexit you didn't know about", "spam_score": 0.0, "site_type": "news", "published": "2016-12-11T12:00:00.000+02:00", "replies_count": 0, "uuid": "73bf1d2ed66b6bea10d5146e555fa01341ea6f77"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/good-bad-side-effects-brexit-12302219", "ord_in_thread": 0, "title": "The good and the bad: Some of the side effects of Brexit you didn't know about", "locations": [], "entities": {"persons": [{"name": "alan shearer", "sentiment": "negative"}, {"name": "les ferdinand", "sentiment": "negative"}, {"name": "stuart rose", "sentiment": "none"}, {"name": "owen humphreys/pa wire", "sentiment": "none"}, {"name": "stewart downings", "sentiment": "none"}, {"name": "alan shearers", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nick ansell/pa wire", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "whitley bay", "sentiment": "none"}], "organizations": [{"name": "marks & spencer", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "british retail consortium", "sentiment": "none"}, {"name": "fifa", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "jordan hendersons", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "brc", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Alan Shearer and Les Ferdinand Share Get daily   Thank you for subscribing!   \nOn the one hand cheaper burgers, booze and more home grown footballers in the Premier League. \nOn the other, the spiralling cost of cars and concerns for eczema sufferers. We look at some of the good and the bad things that could result from the UK leaving the European Union you might not have considered. More home grown footballers coming through - GOOD \nThere’s a chance of more Alan Shearers, Stewart Downings and Jordan Hendersons coming through. Under current rules, any player from an EU member state was free to play in Europe while those from outside the bloc have to meet strict criteria to earn a visa. Non-EU players from a country in the top 10 FIFA list have to have played in 30% of international games in the two years prior to the date of application to be granted a work permit. For those lower on the list, the amount increases. However some think the UK will agree trade deals which will still enable European stars to play. Price of Chilean wine could go up. BAD Chilean wine may become pricier \nBritish shoppers could face higher prices if the Government fails to strike the right Brexit deal with the EU, the British Retail Consortium (BRC) has warned. \nThe BRC said that without reaching the right agreement with the EU by 2019, the UK could be forced to use World Trade Organisation (WTO) rules. \nUnder WTO rules, tariffs on food and clothing could rise sharply, with meat increasing by 27% and clothing and footwear up to 16%. \nAs a result, a bottle of Chilean which could go up because it would cost 14% more to import. Wages could go up - GOOD Notes and coins on a payslip (Photo: Nick Ansell/PA Wire) \nTruth be told there is an argument they could go down but we’re going to be optimistic here. \nPro-EU campaigners suggested that three million jobs could be lost if Britain goes it alone because they are ‘linked’ to Europe. The counter argument is that it was not made clear whether they were ‘dependent’ on being in the EU. \nIf trade and investment falls now the UK has voted for Brexit, then some of these jobs would be lost – but if they rose, then new jobs would be created. \nA drop in immigration would, all else being equal, mean more jobs and less workers to go for them. A labour shortage could mean workers could demand higher salaries. Stuart Rose, former Marks & Spencer chief executive and a prominent pro-EU campaigner, conceded that wages may rise if Britain leaves – which would be good for workers, but less so for their employers. Eczema sufferers should worry - BAD Eczema sufferers may struggle to get medication \nIf you want to sell pharmaceuticals in Europe, you have to have been cleared by European regulators. While we’re in the EU, that’s the case for the UK too. \nA fast, hard Brexit would leave a window between leaving the EU and setting up the UK’s own regulators, it is feared. During that period, drug firms wouldn’t be able to get their products authorised for the UK market, so, for a while, there would be no new eczema creams, asthma inhalers or any other new treatments available to British patients. Fishing industry no longer held back by strict quotas - GOOD A fishing boat shimmers in the heat of the sun this morning off the North Sea coast of Whitley Bay (Photo: Owen Humphreys/PA Wire) \nThe fishing industry was delighted by Brexit and expect the withdrawal from the EU will enable Britain to regain control of its waters after decades of “common grazing” rights given to European neighbours. Industry heads say it marks the first real opportunity since quotas were imposed in 1983 to return to “being a world leader in sustainable seafood”. \nThey now have Norway in their sights. It is the world’s leading producer of salmon and the second largest seafood exporter in the world with annual sales of more than £7bn, compared with the UK’s £1bn. Car prices go up - BAD Shoppers walk between cars at a supermarket car park \nBrexit could see the cost of cars in the UK imported from Europe soar by £1,500, according to a recent report. \nAnalysis by trade body the Society of Motor Manufacturers and Traders (SMMT) warned that the list price of imported vehicles could soar if the cost of import tariffs are not absorbed by brands and retailers. \nThe UK’s decision to withdraw from the EU could add at least £2.7bn to imports and £1.8bn to exports each year, the SMMT predicted. Burgers could become cheaper - GOOD You might have to shell out less to get your hands on a burger \nA bilateral trade deal with the US would see cheaper burgers in the UK. The Americans have lower animal-welfare standards, use growth hormones in their meat and have larger farms. This won’t be good news for British farmers, who will also be facing sky-high export tariffs and a possible end to subsidies. And it won’t be good news for animal rights campaigners. But burger lovers might be pleased. OK, a heavily qualified ‘good’. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2016-12-11T12:00:00.000+02:00", "crawled": "2016-12-11T09:40:32.307+02:00", "highlightTitle": ""}