{"organizations": [], "uuid": "d3ed36ca5d3edb9eb660266ec6ad5cf3d8209e50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.liverpoolecho.co.uk/incoming/article12408017.ece/ALTERNATES/s1200/JS108224261.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/londons-wealth-causes-resentment-rest-12428414", "country": "GB", "domain_rank": 21960, "title": "London's wealth causes resentment in the rest of the country, says Theresa May", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "London's wealth causes resentment in the rest of the country, says Theresa May", "spam_score": 0.0, "site_type": "news", "published": "2017-01-10T15:00:00.000+02:00", "replies_count": 0, "uuid": "d3ed36ca5d3edb9eb660266ec6ad5cf3d8209e50"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/londons-wealth-causes-resentment-rest-12428414", "ord_in_thread": 0, "title": "London's wealth causes resentment in the rest of the country, says Theresa May", "locations": [], "entities": {"persons": [{"name": "theresa may news london", "sentiment": "negative"}, {"name": "theresa", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "charity commission", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News London's wealth causes resentment in the rest of the country, says Theresa May Prime Minister Theresa May says the rest of the country needs a fair deal as she sets out her vision for a more 'shared society' Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Theresa May has said closing the massive wealth gap between London and the rest of the country is a “central challenge of our times”. \nMrs May put backing the economy nationwide at the heart of her vision of a “shared society”, as she laid out her agenda for 2017 in a major speech in London. \nDelivering the Charity Commission annual lecture, she said today’s global economy had made some people richer but left others “feeling locked out and left behind”. \nAnd she set out the case for government “stepping up” to provide help for “ordinary working class” people who don’t qualify for benefits struggle to make ends meet. \nThe speech was seen as an attempt to demonstrate that the Government is doing more than just preparing for Brexit, even though the UK’s relationship with the European Union has dominated debate at Westminster since last year’s referendum. Prime Minister Theresa May \nIt included a pledge to improve mental health services by making young people a priority with additional training for teachers. \nAll secondary schools will be offered mental health first aid training, and by 2021 no child would have to travel away from their local area to receive treatment, she said. \nMrs May highlighted the Government’s forthcoming industrial strategy, which is overseen by Business Secretary Greg Clark, from Middlesbrough, and will include measures to support industry in every region. \nThe Prime Minister said: “we will shortly publish a green paper to put forward our approach for a modern industrial strategy, setting out our plans to encourage growth, innovation and investment and ensure that as we aim to increase our overall prosperity – that prosperity is shared by people in every corner of our country.” \nShe warned that economic inequality encouraged resentment and divisions. \nMeanwhile, Labour leader Jeremy Corbyn is to set out his own vision in a major speech outlining Labour’s agenda for 2017. Labour Party leader Jeremy Corbyn \nHe will call for more NHS funding , saying: “We will rebuild our NHS by ending the under-funding and privatisation of health care. \n“This government could have given the NHS the funding it needs, but it has chosen not to. Their tax giveaways to the very richest and to big business hand back £70 billion between now and 2022.” \nAnd Mr Corbyn will say that leaving the European Union provides an opportunity for the UK to run a more active industrial strategy because it would allow the government to provide “state aid” for businesses when needed. \nMr Corbyn will say: “Tory Governments have hidden behind EU state aid rules because they don’t want to intervene. But EU rules can also be a block on the action that’s needed to support our economy, decent jobs and living standards. Read More Devolution deal in North East still possible, says Northern Powerhouse minister \n“Labour will use state aid powers in a drive to build a new economy, based on new technology and the green industries of the future.” \nAttention is likely to focus on Mr Corbyn’s comments about immigration, and he will appear to suggest that Labour wants to see an end to existing free movement rules which allow any EU citizen to work in the UK. \nHe will say: “Labour is not wedded to freedom of movement for EU citizens as a point of principle. \n“But nor can we afford to lose full access to the European markets on which so many British businesses and jobs depend. Changes to the way migration rules operate from the EU will be part of the negotiations. \n“Labour supports fair rules and reasonably managed migration as part of the post-Brexit relationship with the EU.” Like us on Facebook", "external_links": [], "published": "2017-01-10T15:00:00.000+02:00", "crawled": "2017-01-10T10:41:47.294+02:00", "highlightTitle": ""}