{"organizations": [], "uuid": "535389e47dbcc8a9ed03b77ea4e6c4350558b227", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12485638.ece/ALTERNATES/s1200/North-American-International-Auto-Show-Features-Latest-Car-Models.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-review-sunderland-plant-after-12485495", "country": "GB", "domain_rank": 21960, "title": "Nissan will review its Sunderland plant after Brexit, boss says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan will review its Sunderland plant after Brexit, boss says", "spam_score": 0.0, "site_type": "news", "published": "2017-01-21T00:56:00.000+02:00", "replies_count": 0, "uuid": "535389e47dbcc8a9ed03b77ea4e6c4350558b227"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-review-sunderland-plant-after-12485495", "ord_in_thread": 0, "title": "Nissan will review its Sunderland plant after Brexit, boss says", "locations": [], "entities": {"persons": [{"name": "carlos ghosn", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "ghosn", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "north america", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "nissan motor corporation", "sentiment": "none"}, {"name": "getty images", "sentiment": "none"}, {"name": "invalid email  nissan", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan will review its Sunderland plant after Brexit, boss says Nissan CEO Carlos Ghosn said competitiveness of Sunderland plant will be assessed after withdrawal from Europe Share Click to play Tap to play The video will start in 8 Cancel Play now Watch Nissan's new Infiniti Q30 model roll off the production line Share this video Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNissan will review the competitiveness of its car plant in Sunderland once the final outcome of Brexit negotiations becomes clear, the Japanese company’s chief executive has said. \nThe car manufacturer announced in October that it was investing in production of new Qashqai and X-Trail models at Sunderland after receiving Government assurances that EU withdrawal would not affect the plant’s competitiveness. \nSpeaking to reporters at the World Economic Forum in Davos, Switzerland, chief executive Carlos Ghosn said the company trusted Prime Minister Theresa May’s assurance, but added that Nissan would want to “re-evaluate the situation” once the final deal is concluded. Carlos Ghosn, Nissan Motor Corporation Chairman and CEO (Photo: Getty Images North America) \nMr Ghosn said: “Obviously when the package comes, you are going to have to re-evaluate the situation, and say, ‘Okay, is the competitiveness of your plant preserved or not?’ \n“We are going to have to make decisions on investment within the next two to three years, so obviously the faster the Brexit results come, the better it is.” \nHe was also reported as adding: “In the meantime, we are going to continue to run Sunderland with the assumption that Sunderland will remain competitive no matter what is the outcome of Brexit.” \nEarlier this week, Mr Ghosn said that Mrs May’s announcement that she would take the UK out of the European single market and seek a comprehensive free trade agreement with the remaining EU was “not a surprise” and “does not change the decision” to continue investing in Sunderland. \nThe Government has denied it offered a “sweetheart deal” to Nissan to secure the future of the Sunderland plant - which makes one in three of all cars manufactured in the UK - but has so far resisted calls to publish the “letter of comfort” sent by Business Secretary Greg Clark. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-01-21T00:56:00.000+02:00", "crawled": "2017-01-20T20:25:14.423+02:00", "highlightTitle": ""}