{"organizations": [], "uuid": "f953affac78b15da5055cec1c6679f09c2c9f114", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12374353.ece/ALTERNATES/s1200/GettyImages-630543008.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/deloitte-football-finances-show-gap-12479002", "country": "GB", "domain_rank": 21960, "title": "Deloitte football finances show gap between haves and have-nots is huge - and everyone will suffer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Deloitte football finances show gap between haves and have-nots is huge - and everyone will suffer", "spam_score": 0.0, "site_type": "news", "published": "2017-01-19T22:44:00.000+02:00", "replies_count": 0, "uuid": "f953affac78b15da5055cec1c6679f09c2c9f114"}, "author": "Stuart Rayner", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/deloitte-football-finances-show-gap-12479002", "ord_in_thread": 0, "title": "Deloitte football finances show gap between haves and have-nots is huge - and everyone will suffer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Papy Djilobodji and Lamine Kone deal with the danger of Zlatan Ibrahimovic (Photo: Getty Images) Share Get Sunderland AFC   Could   \nFootball’s finances are not working. \nLast week Uefa published a self-congratulatory “benchmarking” report lauding the success of their financial fair play rules but another report into the economics of football, this time from Deloitte, provided a further reminder that equality is a million miles away. \nFootball is not socialist. There are supposed to be winners and losers, and that means there will be haves and have-nots. But the gap between them is becoming so big as to damage both parties. \nBy Deloitte’s reckoning, Sunderland were the 29th biggest club in Europe last season for the revenues generated. They brought in £124.8m in 2015-16. Newcastle United were 21st. \nAnd what do the Black Cats have to show for these riches? They are stuck in transfer limbo, unable to buy players until they get others off the wage bill. \nThat is because finances are about more than just what you bring in. Uefa had Sunderland as the continent’s 11th most indebted club, owing around £180m for the 2015 financial year. That is why the Premier League are reining in their spending. \nBut Sunderland’s debts are nothing as compared to Manchester United’s £463m. The difference is the Old Trafford club brought in £595.3m, giving them the leeway to break the world record transfer fee on Paul Pogba, while making the likes of Zlatan Ibrahimovic and Wayne Rooney among the best-paid footballers in the world. \nThe gap between the rich and the disgustingly rich is huge. The Red Devils earned more than twice the revenue of Juventus, who themselves were tenth in Europe. They brought in more than four times the revenues of Leicester City, who were 20th. \nWhen the league was first published in 1996-97, they were also top, but with “only” £88m. \nMoney from television makes up just 27% of Manchester United’s revenue, but on its own it outstrips the whole of Sunderland’s. Their commercial revenue, the club’s big strength, is more than twice it. \nManchester United and Sunderland are of course, not equals. The Red Devils have won more championships than any team in England, whereas Sunderland’s last came in 1936. It is 44 years since the Wearsiders won a major trophy of any description. The crowds and global reach of the Manchester club is in another league. To the winners, the spoils. \nBut should the disparity be that great? When it comes to pure football, the two clubs are in the same league – at least for now. \nEven lower down the revenue table the gaps are huge. Serie A club Roma, in 15th, and Zenit St Petersburg (17th), earn more in TV and commercial revenue respectively than Sunderland’s total. \nIt is a pretty entrenched list, with only Leicester breaking into last season’s top 20, on the back of winning the Premier League. They certainly earned it. \nThe combined revenue for the top 20 was up 12% on the previous year, largely on the back of the Premier League’s new television deal – 49% of the rise came from broadcast revenue. For 10 out of 20 Deloitte reports, England has had eight clubs in the top 20. Only the weakening post-Brexit pound threatens that. Read More Revealed: Where Sunderland would be in the Premier League if they had held on to their leads \n“Even the biggest clubs in Europe outside the ‘big five’ leagues struggle to break into our top 20,” the report noted. \nMost of those at the top will probably be quite happy with it all, but they should not be. \nThe Premier League likes to bill itself as the best league in the world, not because it has the best footballers – it does not – or the best teams – look at the recent Champions League semi-finals for proof of that – but because it is “the most competitive league in the world”. \nThe wider the gap between top and bottom (in money terms), the more that is threatened. If Sunderland are more or less stuck with a squad which the league says is not good enough, how can they expect to take points off the teams at the other end? On the face of it, it is good news for the top six, who after taking their eye off the ball a little last year have put clear water between themselves and the rest this season. \nBut will the big boys, many of whom have or are extending their stadia (or in Tottenham Hotspur’s case building a new one), be able to keep attracting big crowds for one-sided encounters? Football needs to be a contest to be entertaining, and with the price of tickets nowadays, English football really needs to be entertaining. \nFootball needs to find ways to level the playing field, reducing the financial gap between the Football League and the Premier League, the Premier League and the other domestic leagues, the Champions League and the rest. \nGood football, even good marketing, deserves rewarding. This is not a plea for sympathy payments to those who run their clubs or their teams badly, as Sunderland have done for more than a decade. \nBut the price of failure is getting too high, and if football is not careful the winners will suffer as well as the losers. Like us on Facebook", "external_links": [], "published": "2017-01-19T22:44:00.000+02:00", "crawled": "2017-01-19T18:08:43.154+02:00", "highlightTitle": ""}