{"organizations": [], "uuid": "bd0ffded4a7774017d3764f9e665ee047215c6cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12467868.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-britain-leave-single-market-12467886", "country": "GB", "domain_rank": 21960, "title": "Brexit Britain will leave the single market: North East reaction to Theresa May's speech", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit Britain will leave the single market: North East reaction to Theresa May's speech", "spam_score": 0.0, "site_type": "news", "published": "2017-01-17T22:59:00.000+02:00", "replies_count": 0, "uuid": "bd0ffded4a7774017d3764f9e665ee047215c6cd"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-britain-leave-single-market-12467886", "ord_in_thread": 0, "title": "Brexit Britain will leave the single market: North East reaction to Theresa May's speech", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "stefan rousseau/pa wire", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "m. michel barnier", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "mrs trevelyan", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit britain", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brexit uk", "sentiment": "none"}, {"name": "lancaster house", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "sedgefield labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "birmingham post", "sentiment": "none"}, {"name": "berwick anne-marie trevelyan  northumberland conservative", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "lancaster house", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Theresa May (Photo: Kirsty Wigglesworth/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe UK will leave the European Single market and agree a new free trade agreement with the EU, Prime Minister Theresa May has confirmed. \nAnd this would allow the country to cut immigration. \nIn a long-awaited speech setting out the Government’s plan for Brexit, she said: “We will get control of the number of people coming to Britain from the EU. Because, while controlled immigration can bring great benefits, filling skill shortages, delivering public services, making British businesses the world beaters they often are, when the numbers get too high, public support in the system falters.” \nNorth East employers warned that the region’s firms needed “un-bureaucratic and low cost access to the European market” to succeed. Prime Minister Theresa May (Photo: Stefan Rousseau/PA Wire) \nThe Prime Minister said that her plans for Brexit meant quitting the single market. \nInstead, she said that she will seek “the greatest possible access to the single market on a reciprocal basis, through a comprehensive trade agreement”. \nMrs May said that she wanted to remain part of a customs agreement with the remaining 27 EU states, but said she had an “open mind” over whether this would be through associate membership of the Customs Union or through some other arrangement. \nShe also revealed that the final Brexit deal reached between the UK and European Union will be put to a vote of both Houses of Parliament. Foreign Secretary Boris Johnson (centre) listens as Prime Minister Theresa May speaks at Lancaster House in London where she outlined her plans for Brexit (Photo: Kirsty Wigglesworth/PA Wire) \nSpeaking at Lancaster House in London, Mrs May said: “When it comes to Parliament, there is one ... way in which I would like to provide certainty. I can confirm today that the Government will put the final deal that is agreed between the UK and the EU to a vote in both Houses of Parliament before it comes into force.” \nUnder Article 50 of the EU treaties, Britain will have two years to negotiate a deal after it informs the European Council of its intention to quit - something which Mrs May has said she will do by the end of March. Read More Here's Theresa May's 12-point plan for Brexit - what do you think? \nChief EU negotiator Michel Barnier has suggested that an agreement must be concluded by October 2018 to allow time for ratification before Britain leaves in March 2019, meaning that the Commons and Lords votes are likely to come during that six-month period. Euro Commissioner M. Michel Barnier (Photo: Birmingham Post and Mail) \nThe Prime Minister said the Government’s planned “industrial strategy” would ensure Brexit worked for every region and nation of the UK. \n“It’s why that plan sets out how we will use this moment of change to build a stronger economy and a fairer society by embracing genuine economic and social reform. \n“Why our new Modern Industrial Strategy is being developed, to ensure every nation and area of the United Kingdom can make the most of the opportunities ahead.” \nAnd she said the UK wanted to continue to be a friend and partner to the EU - but warned that the country would not accept a “punitive” deal designed to punish it for leaving. \nIf other EU countries tried to impose one then the UK would simply walk about without an agreement, she said. \nMrs May said: “No deal for Britain is better than a bad deal for Britain.” Conservative MP for Berwick Anne-Marie Trevelyan \nNorthumberland Conservative MP Anne-Marie Trevelyan welcomed the speech \nMrs Trevelyan, MP for Berwick-upon-Tweed, said: “I was delighted to hear the Prime Minister set out her vision for our nation – a nation which will be a strong, friendly ally to the EU, but which will look beyond it to the rest of the world. \n“Throughout the campaign, I talked about how leaving the EU would give us the opportunity to become an outward-looking nation which will be freed from the restrictions presently placed upon us by the EU, enabling British businesses to trade more freely with other nations, and to welcome the best talent from across the globe.” Read More Is Brexit UK about to ditch the metric measuring system - and could your pint glass change with it? \nBut Sedgefield Labour MP Phil Wilson highlighted the Prime Minister’s comment that the UK could continue to be an “associate member” of shared customs arrangements with the EU. \nThis could provide some help for carmakers such as Nissan, but Mr Wilson warned: “It looks like there will be winners and there will be losers, so we need to be told who is going to win and who is going to lose.” Sedgefield MP Phil Wilson (Photo: Ian Nicholson/PA Wire) \nHe also said EU countries were “prepared to sit down and talk” about migration, but instead the UK was simply rushing to leave the single market without having new agreements in place. \nJonathan Walker, head of policy, North East England Chamber of Commerce said: “We have known for some time that remaining a member of the single market and the Government’s commitment to restricting free movement would be incompatible. In light of this, today’s speech certainly touched on some of the issues that matter most to our businesses, but ultimately the PM will be judged on the outcome of the negotiations rather than the content of a speech. Read More Helping poor families buy nutritious food could be way forward for farmers after Brexit \n“We must continue to be a global North East. Our firms need un-bureaucratic and low cost access to the European market, support to grow their international presence and a migration system that allows our region to retain and compete for highly skilled overseas talent. \n“We do welcome Theresa May’s commitment to provide certainty to businesses as soon as she can.” Like us on Facebook", "external_links": [], "published": "2017-01-17T22:59:00.000+02:00", "crawled": "2017-01-17T19:14:40.089+02:00", "highlightTitle": ""}