{"organizations": [], "uuid": "61cd8e0b94b2f10a00ee25df8aa84b2eebad1137", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11881861.ece/ALTERNATES/s1200/JS96355993.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/high-price-sunderland-newcastle-could-12523039", "country": "GB", "domain_rank": 21960, "title": "The high price Sunderland and Newcastle could pay for Brexit revealed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The high price Sunderland and Newcastle could pay for Brexit revealed", "spam_score": 0.0, "site_type": "news", "published": "2017-01-30T12:00:00.000+02:00", "replies_count": 0, "uuid": "61cd8e0b94b2f10a00ee25df8aa84b2eebad1137"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/high-price-sunderland-newcastle-could-12523039", "ord_in_thread": 0, "title": "The high price Sunderland and Newcastle could pay for Brexit revealed", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "bill", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "alexandra jones", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "nick ansell/pa wire", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "people of sunderland", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland west", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "centre for cities", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The high price Sunderland and Newcastle could pay for Brexit revealed They are among 61 cities out of 62 UK cities whose biggest export market is to the European Union Share Click to play Tap to play The video will start in 8 Cancel Play now People of Sunderland talk about Brexit 6 months on from vote Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe potentially disastrous cost of leaving the EU has been laid bare in a sobering report . \nThe Cities Outlook 2017 report reveals 59% of all exports from Sunderland, the first place to declare its backing of Brexit, go to EU countries - the ninth highest figure out of 62 UK cities. \nSunderland is also one of only seven cities which are heavily reliant on a specific industry for the majority of their exports - car-making at its Nissan plant. \nThe plant’s success means Sunderland is Britain’s top exporting city with £40,650 worth of exports per worker. \nWhile last year the Government is said to have drawn up a secret deal with Nissan to persuade it to stay, earlier this month bosses said they would “review” the situation once the UK’s future relationship with the EU is settled. Workers at Nissan's plant in Sunderland (Photo: Owen Humphreys/PA Wire) \nSharon Hodgson, MP for Washington and Sunderland West, said: “This study shows the scale of the task at hand as we begin the negotiations to leave the EU, along with what the Prime Minister must do to mitigate any impacts Brexit will have on much-needed economic growth in Sunderland and the wider North East. \n“The North East plays a key role in exporting around the world, including to the EU, and any deal that is struck must be protect and nurture our trading position, post-Brexit.” \nNewcastle, which voted to stay in Europe, is not far behind as 54% of its exports go to the EU putting it at 23rd in the table. \nNewcastle North MP Catherine McKinnell said: “These figures reaffirm just how important the North East’s trade with the EU is, and what we stand to lose if the Government gets a bad deal for Britain - something I’ve raised time and again with Ministers in Parliament. \n“I remain deeply concerned that the Prime Minister is pushing ahead with a negotiating strategy that will harm North East exports, as they drag us out of the Single Market, and likely, the Customs Union. \n“It’s also - still - totally unclear how the Government intends to engage with our region throughout this critical process. \n“When people voted to leave the EU, they did not vote to damage our regional economy or jobs, and the North East’s voice must be heard during the Brexit negotiations.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now How the EU referendum unfolded Share this video Watch Next \nThe report was drawn up by the Centre for Cities think tank and looked at the exports of 62 UK cities to compare those to the EU compared to the rest of the world. \nEvery British city but one sold more of its exports to the EU. The average share of exports is 48% to the EU, 15% to the US and 5% to China, worth £15,690 per worker. \nSunderland’s US share of exports is 7% and 1% to China. For Newcastle, its US share was 15% and 3% for China while the value of total exports per job was £8,900. \nThe report, based on 2014 figures, shows that British cities would have to dramatically increase trade with other international markets to compensate for a downturn in exports to the EU. Sharon Hodgson (Photo: 2011 Getty Images) \nIts authors say, for example, to make up for a 10% decrease in exports to the EU, British cities would have to nearly double exports to China, or increase exports to the US by nearly a third (31%). \nCommenting on the findings of the report, Centre for Cities chief executive Alexandra Jones said:“Securing the best possible EU trade deal will be critical for the prosperity of Sunderland, Newcastle and other British cities, and should be the Government’s top priority as we prepare to leave the single market and potentially the customs union. \n“While it’s right to be ambitious about increasing exports to countries such as the US and China, the outcome of EU trade negotiations will have a much bigger impact on places and people up and down the country. \n“It’s also important that the Government aims to reach trade agreements covering as many sectors as possible, rather than prioritising deals for high-profile industries based in a small number of places. \n“Broad trade agreements for all goods and services will help every city to build on its exporting strengths.” A copy of the Bill to trigger article 50, in front of the Houses of the Parliament in London (Photo: Nick Ansell/PA Wire) \nA Government spokesman said: “As the Prime Minister has said, we will pursue a bold and ambitious free trade agreement with the EU that allows for the freest possible trade. \n“But we will also take advantage of the opportunities leaving the EU presents, forging stronger trading links with markets across the world. \n“We are supporting UK businesses in every region of the UK as we do this, through the Government’s Industrial Strategy and our new export hub with free advice, financial support and live export opportunities.” \nLast week, the Government published its bill to trigger Article 50, prompting Labour to table a series of proposed amendments. \nIn a statement with the bill, Brexit secretary David Davis said he trusted that parliament “will respect the decision taken by the British people and pass the legislation quickly”. Read More", "external_links": [], "published": "2017-01-30T12:00:00.000+02:00", "crawled": "2017-01-30T07:53:34.016+02:00", "highlightTitle": ""}