{"organizations": [], "uuid": "8ffe6efc7ad32f9343331b67fe181d16b2cf9c37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30035653/15781784.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/liz-kendall-starts-2017-determined-to-save-glenfield-s-children-s-heart-unit/story-30035653-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Liz Kendall starts 2017 determined to save Glenfield's children's...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published Liz Kendall starts 2017 determined to save Glenfield's children's...", "spam_score": 0.0, "site_type": "news", "published": "2017-01-06T17:12:00.000+02:00", "replies_count": 0, "uuid": "8ffe6efc7ad32f9343331b67fe181d16b2cf9c37"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/liz-kendall-starts-2017-determined-to-save-glenfield-s-children-s-heart-unit/story-30035653-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Liz Kendall starts 2017 determined to save Glenfield's children's...", "locations": [], "entities": {"persons": [{"name": "glenfield", "sentiment": "negative"}, {"name": "liz kendall", "sentiment": "negative"}, {"name": "willy bach", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "new parks", "sentiment": "none"}, {"name": "glenfield", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "glenfield hospital", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "midlands mainline", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Liz Kendall starts 2017 determined to save Glenfield's children's heart unit X \nCopy link to paste in your message / \nLots of people in our city will be starting 2017 with a list of resolutions for the year ahead and I'm no different. \nMy top priority will be continuing the fight to save children's heart surgery at Glenfield Hospital. \nLast year I led the campaign in parliament, working with a cross-party group of MPs. We took our case to the highest level, meeting with the health secretary Jeremy Hunt and NHS England bosses to press the case for this excellent service. \nAlongside the amazing staff at Glenfield and brilliant local campaigners we'll be ramping up the pressure over the coming months as the official public consultation takes place. \nAnother crucial task for 2017 will be protecting funding for local schools.I'm very concerned that Leicester will lose money under new Government proposals, despite the fact that we have high levels of need and deprivation. \nRead more: 'Don't blame me' - City mayor answers his critics over Fenwick's demise \nThis makes absolutely no sense. Britain's best asset is the talent and ingenuity of our people. If children don't get the skills they need, we won't prosper and grow as a country. \nWe need more investment in early years services, schools and apprenticeships to give young people the best opportunities, and ensure our city and country as a whole succeed in an increasingly competitive world economy. \nStrengthening the economy will be all the more important with Brexit ahead. There's a lot of uncertainty about what kind of deal we will get when we leave the EU, and what it will mean for the economy and businesses. \nBut there are steps the Government could be taking now to make sure we move in the right direction, whatever Brexit deal is eventually agreed. \nIn particular, we need long-term investment in high quality infrastructure in every part of the country, not just London and the South East. \nImproving train services on the Midlands Mainline is crucial to ensuring better transport links for Leicester's residents and businesses, and boosting jobs and growth across the East Midlands. \nThat's why I'm so concerned about delays to the electrification of Midlands Mainline and the risks this creates. In the year ahead I'll continue to work with the City's Mayor and MPs to get the upgrades we need now. \nHaving a good quality of life is about more than making sure the economy works for everyone: it's about ensuring all our communities are safe and welcoming places to live. \nPeople shouldn't have to live with the misery of crime and antisocial behaviour on a daily basis. \nThat's why I've asked the Police and Crime Commissioner Lord Willy Bach to come and listen to the concerns of local residents, starting in New Parks on Thursday 19 January. \nI want to make sure the views of local people are heard loud and clear on this issue, and I'll be running more events elsewhere in the constituency over the coming months. \n2017 will bring many challenges, but I'll continue to do everything I can to stand up for my constituents and secure a brighter future for us all.", "external_links": [], "published": "2017-01-06T17:12:00.000+02:00", "crawled": "2017-01-06T14:26:51.040+02:00", "highlightTitle": ""}