{"organizations": [], "uuid": "76c0a512f2095c528946ed8240d27ff27225c661", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12398310.ece/ALTERNATES/s1200/Manufacturing-output.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/uk-manufacturing-reaches-two-half-12398227", "country": "GB", "domain_rank": 21960, "title": "UK manufacturing reaches two-and-a-half year high at end of 2016", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "UK manufacturing reaches two-and-a-half year high at end of 2016", "spam_score": 0.0, "site_type": "news", "published": "2017-01-03T19:47:00.000+02:00", "replies_count": 0, "uuid": "76c0a512f2095c528946ed8240d27ff27225c661"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/uk-manufacturing-reaches-two-half-12398227", "ord_in_thread": 0, "title": "UK manufacturing reaches two-and-a-half year high at end of 2016", "locations": [], "entities": {"persons": [{"name": "james knightley", "sentiment": "none"}, {"name": "knightley", "sentiment": "none"}, {"name": "samuel tombs", "sentiment": "none"}, {"name": "rob dobson", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "pantheon macroeconomics", "sentiment": "none"}, {"name": "ihs markit", "sentiment": "none"}, {"name": "uk manufacturing", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "ing", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Output in Britain's manufacturing industry has started the new year on a \"strong footing\" after unexpectedly leaping to a two-and-half-year high at the end of 2016 (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOutput in Britain’s manufacturing industry has started the new year on a “strong footing” after unexpectedly leaping to a two-and-half-year high at the end of 2016. \nThe Markit/CIPS UK Manufacturing purchasing managers’ index (PMI) said output hit 56.1 in December, up from 53.6 in November and above economists’ expectations of 53.3. A reading above 50 indicates growth. \nThe move was driven by the Brexit-hit pound , which continued to boost demand by making UK exports cheaper on the international market. \nHowever, the double-edged sword of sterling’s slump means cost pressures are still high, the report said, with rates of inflation “remaining among the highest seen during the survey history”. \nRob Dobson, senior economist at IHS Markit, said the plunge in the pound had “undoubtedly been a key driver of the recent turnaround, while the domestic market has remained a strong contributor to new business wins”. \n“The UK manufacturing sector starts 2017 on a strong footing. The headline PMI hit a two-and-a-half year high in December, with rates of expansion in output and new orders among the fastest seen during the survey’s 25-year history. \n“Based on its historical relationship against official manufacturing output data, the survey is signalling a quarterly pace of growth approaching 1.5%, a surprisingly robust pace given the lacklustre start to the year and the uncertainty surrounding the EU referendum.” \nThe pound pushed into positive territory against the US dollar following the manufacturing update, rising 0.1% versus the greenback at 1.229. Sterling was also 0.8% higher against the euro at 1.181. \nThe report said that output expanded in December to meet stronger inflows of new work at home and abroad, with new export business climbing for the seventh month on the bounce. Read More South Shields company wins order on the largest container ship ever built \nIt came as the appetite for British goods grew in the US, China, the Middle East, India and across Europe. \nThe industry’s jobs market continued to show signs of strength, with employment rising for the fifth month in a row and accelerating at its fastest pace for 14 months. \nJames Knightley, ING senior economist, said the manufacturing boost was a sure sign that the pound’s fall was making the UK more competitive on the international stage, but warned that it could have a nasty sting in the tail for consumers. \n“Sterling’s fall also means that imported components are more expensive with both costs and output prices rising yet again,” he added. \n“This increase in domestic pipeline inflation pressures is being mirrored by higher costs for imported consumer goods and energy. As such, the squeeze on household spending power is set to intensify. \n“So while the strength of the manufacturing sector is good news, the likely weakness in the much larger consumer sector will more than offset it.” \nMr Knightley is pencilling the UK economy to slow to just above 1% in 2017 from 2.2% in 2016. \nThe UK currency remains 18% down against the US dollar and 11% lower versus the euro since the Brexit vote on June 23. \nSamuel Tombs, chief UK economist at Pantheon Macroeconomics, said the “brisk growth” in global and domestic demand was likely to peter out in 2017. Read More US aerospace supplier Adept to open first UK base at Team Valley \n“The relationship between the PMI and the official data, however, has been particularly loose lately; the PMI has signalled steady growth in manufacturing output since August, but the official data have oscillated around a flat trend. \n“Meanwhile, we continue to think that domestic demand for manufactured goods will crumble as consumers experience a renewed squeeze on their real incomes, driven mainly by higher import prices.” \nThe manufacturing industry’s strong finish to 2016 comes as the FTSE 100 Index continues to race ahead, reaching a fresh record high of 7,205.21 on the first official trading day of the new year. \nIt followed on from a late surge on the final trading day of 2016, which saw London’s top-flight smash its mid-session record, reach a new closing high and deliver its best year since 2013. \nThe performance of the UK economy was also unexpectedly revised up last month, with gross domestic product (GDP) expanding 0.6% in the third quarter, up from a previous estimate of 0.5%, according to official figures. \nHowever, the ONS said growth was weaker than initially thought in the first half of 2016, cutting its estimates by 0.1% for the first and second quarters to 0.3% and 0.6% respectively. Like us on Facebook", "external_links": [], "published": "2017-01-03T19:47:00.000+02:00", "crawled": "2017-01-03T16:04:04.850+02:00", "highlightTitle": ""}