{"organizations": [], "uuid": "87c1dcf735912d9e3c56e7e242028269247d6da5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12125383.ece/ALTERNATES/s1200/JS104114207.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12491673", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Trump win hits Paddy Power Betfair takings", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Trump win hits Paddy Power Betfair takings", "spam_score": 0.0, "site_type": "news", "published": "2017-01-23T14:55:00.000+02:00", "replies_count": 0, "uuid": "87c1dcf735912d9e3c56e7e242028269247d6da5"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12491673", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Trump win hits Paddy Power Betfair takings", "locations": [], "entities": {"persons": [{"name": "blakemore", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "post-brexit", "sentiment": "none"}, {"name": "john gildersleeve", "sentiment": "none"}, {"name": "bishop", "sentiment": "none"}, {"name": "john hayes", "sentiment": "none"}, {"name": "dean", "sentiment": "none"}, {"name": "hayley smith", "sentiment": "none"}, {"name": "michael kent", "sentiment": "none"}, {"name": "dale burnett", "sentiment": "none"}, {"name": "mike rake", "sentiment": "none"}, {"name": "peter blakemore", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "magnomatics", "sentiment": "none"}, {"name": "burnett", "sentiment": "none"}, {"name": "koh", "sentiment": "none"}, {"name": "kent", "sentiment": "none"}, {"name": "ryan maughan", "sentiment": "none"}, {"name": "jonathon manning bt", "sentiment": "none"}, {"name": "mark forster", "sentiment": "none"}, {"name": "koh dong-jin", "sentiment": "none"}, {"name": "peter dean", "sentiment": "none"}, {"name": "sarat pediredla", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "openreach", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "honolulu", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "paddy power betfair", "sentiment": "negative"}, {"name": "daf", "sentiment": "none"}, {"name": "leyland trucks", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "vodafone", "sentiment": "none"}, {"name": "avid technology", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "noble foods", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "lowrie foods", "sentiment": "none"}, {"name": "nordics", "sentiment": "none"}, {"name": "office for low emission vehicles", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}, {"name": "bt openreach key event noble foods", "sentiment": "none"}, {"name": "university of sheffield", "sentiment": "none"}, {"name": "nigel hudson photography", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "avid technology", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "erdf", "sentiment": "none"}, {"name": "ofcom", "sentiment": "none"}, {"name": "calor", "sentiment": "none"}, {"name": "avid", "sentiment": "none"}, {"name": "craft yourself silly", "sentiment": "none"}, {"name": "happy egg company", "sentiment": "none"}, {"name": "bt consumer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT AF Blakemore and Son sees turnover surpass £1.3bn \nFood and retail giant A F Blakemore and Son Limited has increased its turnover by 2.4% to £1.3bn. \nThe national retailer owns a number of North East businesses such as Lowrie Foods and Tyne-Tees Cash and Carry. Chairman Peter Blakemore said the positive results had been achieved within tough market conditions. \nMr Blakemore said: \nThis result has been achieved against a background of difficult trading conditions in the food retail and wholesale markets together with significant levels of price deflation. \nCost control being a major consideration during the year, total costs rose by £4.9m of which £4.7m was attributed to increased cost of wages and salaries. The group has repaid £4.0 of bank loans and loan notes during the year. \nThis is a pleasing steady result and I’d like to thank all members of staff for their efforts in achieving it. \nThe company saw its pre-tax profit increase by 0.2%, from £7.587m to £7.603m. 8:53 KEY EVENT hedgehog lab launches with new office in Denmark before Brexit bites \nNewcastle app developer hedgehog lab has opened an office in Denmark as the tech firm looks to grow its business in Europe and ensure access to the single market following the Brexit vote. \nThe Copenhagen office has initially launched as a sales and customer centre but the tech firm hopes to further develop the site into its European headquarters. \nThe move follows research into the Nordic market, which showed that while the region is home to large consultancies and many micro-businesses, there was a demand for mid-sized firms specialising in mobile technology. \nSarat Pediredla, hedgehog lab’s CEO, said: \n“We’d been interested in the Nordics for quite some time and, although we explored alternative options, Denmark - which is an hour-and-a-half from Newcastle on a plane - emerged as the best location. \n“We are committed to keeping our global headquarters here in the North East, but post-Brexit felt it essential we had access to the Single Market. We expect Copenhagen to be as a big as our US business in five years’ time and are tremendously excited about this new opportunity.” \nhedgehog lab is already an international business with offices in Austin, Boston, London and India, as well as Newcastle. \nThe firm’s first US office was opened in Boston while the firm was still classed as a micro-business. The Austin office was later opened in 2016. Denmark has repeatedly been voted the best place in the world to do business but it also offers hedgehog lab access to other areas of mainland Europe, including Germany. hedgehog lab CEO Sarat Pediredla, left, with chief operating officer Mark Forster 8:42 KEY EVENT Samsung smartphones caught fire because of battery failures \nSamsung has said failures in the design and manufacturing of the batteries in its Galaxy Note 7 caused them to overheat and catch fire. \nThe Korean electronics giant was forced to recall 3m handsets after the dangerous defect appeared within weeks of its grand launch in August. \nThe manufacturer launched a vast inquiry into what was behind the problem that is expected to cost the company an estimate $5.3bn (£4.3bn). Around 700 Samsung engineers carried out tests on 200,000 handsets and 30,000 batteries that were charged and drained over several months. \nKoh Dong-Jin, president of Samsung electronics mobile communications business told a press conference in Seoul: \nWe found that both fully assembled devices and batteries exhibited incidents at similar rates to those in the field. \nThis indicated that the incidents were caused by the battery cell itself and we preceded to focus our investigation on the batteries. \nMr Koh said he “deeply apologised” to Samsung customers and the company’s partners, adding that the public post-mortem was “a first step to regain your trust”. \nSoon after the Galaxy Note 7 launched, videos were posted on social media from owners around the world of handsets appearing to overheat and burst into flames. Two weeks later Samsung announced a global product replacement scheme, but was forced to elevate it to a full recall when the replaced handsets exhibited the same fault. \nOf the 3m handsets sold between August and October, 96% had been returned, Mr Koh said. The company carried out its own investigation on the Note 7’s manufacturing and distribution logistics processes and drafted in specialist companies to carry out independent tests. \nExperts analysed third party apps to see if they had an effect on how the device operated, tested the water resistance of components and even subjected the charging components to a 4,000 volt static shock. “None of these tests demonstrated abnormality or correlation to the reported incidents,” Mr Koh said. A photo taken in Honolulu shows a replacement Galaxy Note 7 smartphone one day after the phone released smoke and sizzled. 8:35 Jonathon Manning Proggy-mat firm Craft Yourself Silly takes Geordie tradition to the US \nAn award-winning North East business which is taking a traditional craft from the region around the world is aiming to conquer American markets . \nNorth Shields-based Craft Yourself Silly, which won the New Exporter of the Year at the National Business Awards in November, has received funding from the European Regional Development Funding (ERDF) to attend a craft fair in the US where it launch its new “Proggy” range in America. \nHooky and proggy rag mats were common in working-class homes in the North East until the mid-20th Century. Made from old sacks, clothing and recycled fabric, they were an economical option to keep feet warm in an era when fitted carpets were rare. \nCraft Yourself Silly has created kits using the traditional “proggy” making technique in which scraps of material are pushed through holes in a hessian backing. \nThe firm received ERDF funding, administered by the Department for International Trade, to internationalise its website, provide staff with export training, undertake market research to identify new overseas clients and attend the Creativation Exhibition in Phoenix, USA. \nThe company, which currently employs six people, also plans to use ERDF funding to help create two new jobs: a product development assistant and international sales manager. \nManaging director Hayley Smith said: \nCrafting is huge in the US, but the crafting market is years behind here. There is always a huge amount of interest in our products whenever we attend craft fairs in the country. \nProggy mats are much-loved and well known as a traditional way people in the North East used to provide floor coverings for their home, but it’s a whole new concept for many people in America - and for a lot of people in the the UK and Europe too. Hayley Smith of Craft Yourself Silly (Photo: Creo PR) 8:28 Cramlington firm Avid Technology to take part in £20m environmental scheme \nA North East firm has been selected to trial new methods of cutting vehicle emissions . \nCramlington-based Avid Technology has been included in one of 20 consortia selected by the Government to participate in a £20m project to improve air quality. \nThe freight industry accounts for around one third of the UK’s transport carbon dioxide emissions and Avid has won a contract to work on a programme which aims to increase the number of electric vans and lorries running as hybrids or on hydrogen dual-fuel. \nThe project, which will be delivered by the Office for Low Emission Vehicles and Innovate UK, was unveiled by Transport Minister John Hayes at the Sustainable Road Transport Conference in London. \nAvid is working with Magnomatics, a high-technology company formed in 2006 as a spin-out from the University of Sheffield, to implement its innovative Magsplit hybrid system into trucks which will be operated by Calor as part of its delivery fleet. \nAvid’s role will be to convert, commission and deliver the hybrid electric vehicles, including electrified ancillaries, to enable the vehicles to run in electric mode with zero emission capability. Overseeing the project will be DAF LF manufacturer Leyland Trucks. \nIn a year-long trial, two 18-tonne DAF trucks operated by Calor will be fitted with Magnomatics’ innovative transmission technology, which has the potential to reduce carbon dioxide emissions by one million tonnes per annum by 2025. \nRyan Maughan, founder and managing director of Avid Technology, said: \nClimate change, urban air quality and the rising cost of energy are major issues of our time. The energy consumption and exhaust emissions of heavy duty vehicles are a major contributor to these issues, despite being essential to everyday life. \nOver the past 11 years, we have developed the skills and know-how which gives us a unique position in the market place, leading to our involvement in this prestigious project. Our mission is to help our customers improve the efficiency and emissions of their vehicles and machinery through the design and manufacture of electrified ancillary systems for heavy duty and high performance vehicles. Ryan Maughan, founder and managing director, AVID Technology (Photo: Nigel Hudson Photography) 8:23 Jonathon Manning BT to publish third-quarter results amid Openreach battle with watchdog \nTelecoms giant BT will report back on third-quarter trading next week as it battles with communications watchdog Ofcom over plans to force it to legally separate its Openreach network arm. \nThe regulator warned in November that it would trigger formal proceedings with the European Commission to order a legal separation of Openreach after it said BT’s plans to appease competition concerns fell short. \nOpenreach develops and maintains the UK’s main telecoms network used by telephone and broadband providers such as Sky, TalkTalk, Vodafone and BT Consumer. But Ofcom stopped short of forcing a full break-up and sale of Openreach and added it remained “open” to further proposals from BT for a voluntary separation of the division. \nThere is unlikely to be any update on the talks with Ofcom in BT’s quarterly results on Friday, but analysts said it would continue to be a headache for the group until it is resolved. \nHSBC’s telecoms experts said: \nWe expect that 2017 will provide a conclusion, resolving an overhang for the stock. \nMost likely, in our view, is for BT and Ofcom to reach a compromise within the first half of the year. \nBT chairman Sir Mike Rake told the Press Association earlier this month the group was “hopeful to reach a solution”. \nThe firm’s third-quarter update is expected to show underlying pre-tax profits nudging up to £930m from £928m a year earlier and a further boost to customer numbers from its acquisition of mobile phone company EE last year. \nIt comes after better-than-expected second-quarter earnings, when it added 63,000 new customers, with EE numbers rising by 280,000. \nHSBC analysts added: \nWe continue to expect strong operational performance. In particular we look forward to the full-year results in May for a detailed update of the initial mobile cross-selling into the BT base. BT Openreach KEY EVENT Noble Foods considering flotation or partial sale \nThe group behind the Happy Egg Company and Gu desserts is weighing up a stock market flotation or partial sale that could value the firm at over £400m. The chief executive of Noble Foods, Britain’s biggest egg supplier said firm’s owners are considering a range of options, with an initial public offering (IPO) the most likely. \nDale Burnett, CEO said: \nNoble’s owners Peter Dean and Michael Kent are considering reducing their 50/50 shareholding at some point, one option is an IPO, the other is a partial sale. \nA flotation is the preferred route, although nothing is imminent and we’re under no pressure to do anything. We could just decide to carry on trading. \nNoble turned over around £530m last year, banking approximate operating profit of just under £50m. \nAn IPO, which could happen in 2018, would see Mr Dean and Mr Kent retain significant holdings in the firm and any partial stake sale would most likely be to private equity investors. \nLast year the firm appointed City grandee John Gildersleeve as chairman as a signal of intent and to “guide the company through potential changes”, Mr Burnett said. \nNoble acquired Gu in 2010 and the chief executive said the firm is hungry for more deals as he looks to ramp up the company’s brand profile, which includes Big & Fresh eggs. \nNoble will also pump £25m into opening a new Gu factory in Bishop’s Stortford this year, creating 170 jobs in the process. However, Mr Burnett struck a cautious note on Brexit and the predicament of EU workers residing in Britain. \nHe said: \nWe rely heavily on the free movement of people, our factories are heavily supported by European and non-UK staff. “Everybody is concerned and nervous, and we are already seeing some people return to the countries they came from as a result of Brexit. Eggs for the Happy Egg Company. 8:12", "external_links": [], "published": "2017-01-23T14:55:00.000+02:00", "crawled": "2017-01-23T12:41:46.179+02:00", "highlightTitle": ""}