{"organizations": [], "uuid": "170aaf964e1d51d7de28ff66cd100cd785783379", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12491867.ece/ALTERNATES/s1200/A19-Sunderland.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/new-42m-industrial-park-set-12496407", "country": "GB", "domain_rank": 21960, "title": "New £42m industrial park set to create 5,000 jobs is 'vital' to the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "New £42m industrial park set to create 5,000 jobs is 'vital' to the North East", "spam_score": 0.0, "site_type": "news", "published": "2017-01-24T01:16:00.000+02:00", "replies_count": 0, "uuid": "170aaf964e1d51d7de28ff66cd100cd785783379"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/new-42m-industrial-park-set-12496407", "ord_in_thread": 0, "title": "New £42m industrial park set to create 5,000 jobs is 'vital' to the North East", "locations": [], "entities": {"persons": [{"name": "chi onwurah", "sentiment": "none"}, {"name": "andrew hodgson", "sentiment": "none"}, {"name": "graham robb", "sentiment": "none"}, {"name": "joe giddens/pa wire", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "steve grant", "sentiment": "none"}, {"name": "michel euler", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "iain malcolm", "sentiment": "none"}, {"name": "james ramsbotham", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "tte technical training group", "sentiment": "none"}, {"name": "institute of directors", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "north east local enterprise partnership", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "iamp", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "energy", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "soil machine dynamics limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News New £42m industrial park set to create 5,000 jobs is 'vital' to the North East A high tech business park for North East will go ahead with Government cash and help create thousands of new jobs Share The Downhill Lane junction on the A19 (Photo: Handout) Share   \nA major new business park designed to create more than 5,000 jobs can go ahead after the Government offered £42 million in funding. \nSunderland and North Tyneside Councils have secured the cash to build the planned International Advanced Manufacturing Park, close to the A19 and north of Nissan’s carmaking plant. \nIt’s designed to prove a world-class environment for high tech industries and advanced manufacturing businesses, and council leaders say they expect the 100-acre site to create 5,000 jobs and bring in private-sector investment of £300 million. \nThe funding was announced as part of the Government’s new Industrial Strategy, launched by Theresa May, which included £49.7m for projects to support the economy in Newcastle, Gateshead, Northumberland, Sunderland, Durham, North Tyneside and South Tyneside, and another £21.8m for the Tees Valley area. British Prime Minister Theresa May (Photo: Michel Euler) \nPaul Watson, leader of Sunderland City Council, said: “We already have one of the biggest and most productive car plants in Europe and we are a centre for electric vehicle research and production. \n“We have advanced manufacturing expertise in aerospace and turbo technologies, and we know there’s interest and demand for facilities and land for new and expanding companies. \n“This is why the International Advanced Manufacturing Park (IAMP) is an important project for Sunderland, South Tyneside, the North East region and the UK economy.” \nIain Malcolm, leader of South Tyneside Council , said: “This funding will ensure the right infrastructure is in place to support the IAMP and the economic opportunities it can unlock.” Councillor Iain Malcolm \nThe project will cost £91.9m, with some funding coming from both councils while a portion of business rates paid by local employers will also help fund the scheme. \nPlans for the business park were launched in 2014, and involve the two councils working with each other as well as the North East Local Enterprise Partnership and authorities including Durham, Gateshead, Newcastle, North Tyneside and Northumberland. \nAndrew Hodgson, chairman of the North East Local Enterprise Partnership and chief executive of Tyneside-based Soil Machine Dynamics Limited, said the park was “vitally important” - but said the Government had not funded other proposals from the region. \nHe said the funding provided “gives us no scope to fund a range of projects which would have driven new growth and provided real impetus to business development - as well as giving the North East the chance to contribute more fully to the Government’s Northern Powerhouse agenda”. \nA Green Paper also set out technologies where the UK can lead the world, such as robotics and artificial intelligence, and 5G mobile network technology. A new Industrial Strategy Challenge Fund will support research and development in these sectors. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Nissan secures 7,000 jobs despite Brexit vote Share this video Watch Next \nIndustries will be invited to negotiate deals with government to help them succeed. For example, carmakers across the UK could set out the support they need to lead the world in electric cars. \nIt means different firms across the UK will be encouraged to come together to negotiate, either through existing trade bodies or by making new arrangements. \nThe Government says it is ready to invest in research, provide training, improve infrastructure such as internet services and help firms obtain finance such as loans. \nBusiness and Energy Secretary Greg Clark said: “This is an important step in building a modern, dynamic Industrial Strategy that will improve living standards and drive economic growth across the whole country. Business Secretary Greg Clark (Photo: Joe Giddens/PA Wire) \n“A modern British Industrial Strategy must build on the UK’s strengths and extend excellence into the future; close the gap between the UK’s most productive companies, industries, places and people and the rest; and ensure we are one of the most competitive places in the world to start and grow a business. \n“The North East has a world-leading reputation in the automotive sector, chemical innovation and exports. Through our Industrial Strategy and investment in the Northern Powerhouse we plan to build on these local strengths and create new opportunities and jobs in other industries and sectors.” Read More Nissan will review its Sunderland plant after Brexit, boss says \nLabour said that the strategy had a focus on skills but did not explain how the Government would grow the economy. \nShadow Business Minister Chi Onwurah , Labour MP for Newcastle Central, said: “What the Theresa May calls an ‘industrial strategy’ is in reality a collection of disparate measures mainly focused around skills and not even going far enough in that key policy area – very little on life long learning for example. Chi Onwurah \n“It is not a long term, sustainable industrial strategy, it doesn’t respond to the big global challenges we face – Brexit, climate change, automation, aging – to ensure our economy delivers prosperity for all in a changing world. \n“Labour’s industrial strategy will be challenge led, mission orientated and values driven to mobilise both public and private sectors in the interests of all.” \nBusiness leaders in the region gave the plan a cautious welcome. \nGraham Robb, regional chairman of the Institute of Directors in the North East, said: “The Government is right to create an Industrial Strategy, which will help to secure long term business growth and prosperity in the North East and across the UK.” \nSteve Grant, managing director of the TTE Technical Training Group, said: “The UK’s industrial capabilities have to be underpinned by a breadth of technical skills that can serve a variety of sectors. \n“By placing the development of a skilled workforce at its heart, through relevant and forward-thinking training, the Industrial Strategy will help arm companies with productive and motivated people that have the abilities to help our economy compete in global markets.” \nAnd James Ramsbotham, chief executive of North East England Chamber of Commerce, said: “An Industrial Strategy that recognises strengths and needs of the UK’s diverse places is vital if we are to achieve national aims. Government must now be true to its word and support regions such as ours to be the best they can be.” Like us on Facebook", "external_links": [], "published": "2017-01-24T01:16:00.000+02:00", "crawled": "2017-01-23T21:06:44.291+02:00", "highlightTitle": ""}