{"organizations": [], "uuid": "1c7629f5a05c15b1327e2f2051371d51a1542ac5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12510567.ece/ALTERNATES/s1200/IBP_NEC_130117100yr_old_03JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/watch-100-year-old-veteran-12510353", "country": "GB", "domain_rank": 21960, "title": "Watch 100-year-old veteran receive his 100th birthday card from the Queen", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Watch 100-year-old veteran receive his 100th birthday card from the Queen", "spam_score": 0.0, "site_type": "news", "published": "2017-01-28T20:00:00.000+02:00", "replies_count": 0, "uuid": "1c7629f5a05c15b1327e2f2051371d51a1542ac5"}, "author": "Barbara Hodgson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/watch-100-year-old-veteran-12510353", "ord_in_thread": 0, "title": "Watch 100-year-old veteran receive his 100th birthday card from the Queen", "locations": [], "entities": {"persons": [{"name": "paul", "sentiment": "none"}, {"name": "lawrence thompson-duffy", "sentiment": "none"}, {"name": "doreen", "sentiment": "none"}, {"name": "kathy hurst", "sentiment": "none"}, {"name": "thomson-duffy", "sentiment": "none"}, {"name": "kathleen hurst", "sentiment": "none"}, {"name": "christine duffy", "sentiment": "none"}, {"name": "damien green", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "lawrence thomson-duffy", "sentiment": "none"}, {"name": "christine", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "gibraltar", "sentiment": "none"}], "organizations": [{"name": "state for department of works", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "raf", "sentiment": "none"}, {"name": "squadron", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA great-grandad’s 100th birthday celebration hit a high note when a choir turned up on his doorstep. \nLawrence Thomson-Duffy was delighted when members of his former choir paid him a surprise visit on his big day. \nThe RAF veteran was himself a member of the local British Legion until the age of 95. And he was hugely touched when his friends arrived at his home in Newcastle to entertain him on his centenary . \nDaughter Christine, 54, said that her dad had no idea the family had planned a surprise party on his birthday, let alone a visit from his old pals. \n“The night before, he said to me ‘I wish I had hired a hall’,” said Christine. \nHe also mentioned his choir mates. She said: “I didn’t tell him anything - and he was so delighted when they turned up!” \nDespite his advanced years, dad-of-four Mr Thomson-Duffy - an avid reader of The Chronicle - still lives at home in Newcastle, with help from Christine. Lawrence Thompson-Duffy with daughters Christine Duffy and Kathleen Hurst (Photo: Newcastle Chronicle) \nShe and the rest of the family arranged the party there and he celebrated in grand style with a houseful of guests. \nFriends and relatives had been invited to drop in for afternoon tea from 3pm and Christine said: “There were around 80-100 people - but they didn’t all come at once!” \nAnd luckily there was a huge birthday cake to share. \nChristine and sister Kathy Hurst, 57, had appealed to Facebook friends to send birthday cards, setting a target of 100 to make his day. \nAnd 124 cards poured in, including some from as far afield as Gibraltar and Australia, which took them hours to open. \nAmong those arriving on the morning of the big day itself were best wishes from the Queen as well as Damien Green, the Secretary of State for Department of Works and Pensions. Lawrence Thompson-Duffy pictured on his wedding day in November 1957 with Wife Doreen (Photo: Newcastle Chronicle) \nThe family bought special picture frames to show those off. \n“He was delighted!” said Christine. With all the attention on his special day, she said: “He was overwhelmed. He just couldn’t believe it.” \nAfter the birthday tea, he was still looking forward to a meal. \nChristine said: “He asked for fish and chips for his tea. It was Friday which is fish and chips night and he still wanted them.” \nMr Thomson-Duffy, who also has twin sons Paul and Michael, aged 51, as well as four grandchildren and a great-grandchild, was widowed when his wife Doreen died last August at the age of 81. The pair had married in November 1957. Lawrence Thompson-Duffy (Photo: Newcastle Chronicle) \nIn his younger days he served in the RAF, 215 Squadron, which included service in south east Asia. \nChristine said they have been fascinated looking back at the diaries her dad kept over the years, including reading how he spent one particular birthday during wartime. The entry told how, following a period of sickness, he was just reporting back for duty on the day. Read More Newcastle MP to ask residents if she should back Brexit-making Article 50 \nOn leaving the RAF, Mr Thomson-Duffy worked for the Co-op until his retirement. \nChristine said his relatives lived until their late nineties and, asked about his recipe for a long life, he said “honey”, which he eats every morning. \nHe also continues to enjoy the radio, TV and reading. \n“He reads The Chronicle a lot,” she said. “He’s read it all his life.” Like us on Facebook", "external_links": [], "published": "2017-01-28T20:00:00.000+02:00", "crawled": "2017-01-28T15:29:19.008+02:00", "highlightTitle": ""}