{"organizations": [], "uuid": "c248d937ec3948363290de8e6dd3fa17b996de2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12532244.ece/ALTERNATES/s1200/Dr-Frankenstein-rehearsals.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/theatre-news/dr-frankenstein-female-northern-stages-12532017", "country": "GB", "domain_rank": 21960, "title": "Dr Frankenstein is female in Northern Stage's new Queens of the North season", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Dr Frankenstein is female in Northern Stage's new Queens of the North season", "spam_score": 0.0, "site_type": "news", "published": "2017-02-01T01:00:00.000+02:00", "replies_count": 0, "uuid": "c248d937ec3948363290de8e6dd3fa17b996de2b"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/theatre-news/dr-frankenstein-female-northern-stages-12532017", "ord_in_thread": 0, "title": "Dr Frankenstein is female in Northern Stage's new Queens of the North season", "locations": [], "entities": {"persons": [{"name": "frankenstein", "sentiment": "negative"}, {"name": "henrik ibsen", "sentiment": "none"}, {"name": "lorne campbell", "sentiment": "none"}, {"name": "ed gaughan", "sentiment": "none"}, {"name": "mary shelley", "sentiment": "none"}, {"name": "scott turnbull", "sentiment": "none"}, {"name": "shelley", "sentiment": "none"}, {"name": "victoria elliott", "sentiment": "none"}, {"name": "polly frame", "sentiment": "none"}, {"name": "donald mcbride", "sentiment": "none"}, {"name": "hedda gabler", "sentiment": "none"}, {"name": "rachel denning", "sentiment": "none"}, {"name": "hamlet", "sentiment": "none"}, {"name": "paul cummins", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "victoria frankenstein", "sentiment": "none"}, {"name": "elizabeth frankenstein", "sentiment": "none"}, {"name": "selma dimitrijevic", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "hedda", "sentiment": "none"}, {"name": "brack", "sentiment": "none"}, {"name": "hedda gabler", "sentiment": "none"}, {"name": "ibsen", "sentiment": "none"}, {"name": "justine", "sentiment": "none"}, {"name": "libby davison", "sentiment": "none"}, {"name": "gabler", "sentiment": "none"}, {"name": "tom piper", "sentiment": "none"}, {"name": "erica whyman", "sentiment": "none"}, {"name": "berte", "sentiment": "none"}, {"name": "mary wollstonecraft", "sentiment": "none"}, {"name": "elizabeth", "sentiment": "none"}, {"name": "victor frankenstein", "sentiment": "none"}], "locations": [{"name": "queens", "sentiment": "none"}, {"name": "ingolstadt", "sentiment": "none"}, {"name": "woodhorn", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "munich", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northern stage", "sentiment": "none"}, {"name": "bavaria", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "selma", "sentiment": "none"}], "organizations": [{"name": "royal shakespeare company", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "northern stage", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "greyscale", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Dr Frankenstein is female in Northern Stage's new Queens of the North season Rehearsals have started for Hedda Gabler and Dr Frankenstein as they are brought up to date for a dramatic Northern Stage double Share Rachel Denning as Justine, Victoria Elliott as Elizabeth and Polly Frame as Dr Frankenstein in rehearsal (Photo: Northern Stage) Share Get what's on updates   Thank you for subscribing!   \nQueens of the North is billed by Northern Stage as “stories by women, about women, about humankind through the eyes of women”. \nThis strand of the theatre’s new season begins with an exciting double-barrelled prospect – Dr Frankenstein and Hedda Gabler: This is Not a Love Story. \nIf what unfolds on stage is half as arresting as the fantastic posters – and rehearsals suggest that is a likely prospect – then this will be a cracking start to the season at the Newcastle theatre . \nIt’s one cast of actors, two plays – one, Dr Frankenstein, to be directed by Lorne Campbell, Northern Stage artistic director, and the other, Hedda Gabler, to be directed by Selma Dimitrijevic. \nSelma, who is artistic director of Newcastle-based theatre company Greyscale, is also credited as the writer, having adapted these two famous works by famous writers for the Newcastle stage. \nFor the ensemble of actors, there have been more lines to learn than usual with the two plays being rehearsed simultaneously. \nPolly Frame plays Dr Victoria Frankenstein (yes, that’s right, she’s a woman) in one play and Berte, a servant, in Hedda Gabler. \n“I’m really looking forward to exploring how two powerful women operate in a world that is not yet ready for them,” she says. \n“Mounting these two plays side by side will be a real challenge but so exciting and I’m hoping each will give insight into the other in surprising ways.” \nVictoria Elliott, meanwhile, has the title role of Hedda Gabler but is also cast as Elizabeth Frankenstein, sister of the doctor, in the other play. \nAlso appearing are Ed Gaughan, Scott Turnbull, Donald McBride, Libby Davison and Rachel Denning. \nThe designer of both these Northern Stage/Greyscale co-productions is a man whose name might ring a bell. \nTom Piper won acclaim for the famous First World War poppies installation which he created with artist Paul Cummins. \nIt was seen by many thousands of people at the Tower of London and then attracted North East crowds when part of it was displayed at Woodhorn, Northumberland, in autumn 2015. \nTom also worked with former Northern Stage boss Erica Whyman on her Royal Shakespeare Company production of A Midsummer Night’s Dream which toured the country last year. DR FRANKENSTEIN Polly Frame as Dr Frankenstein and Rachel Denning as Justine in rehearsals (Photo: Northern Stage) \nMary Shelley’s novel, Frankenstein, was published anonymously in 1818, when she was just 20 (she’d started writing it two years earlier). \nLorne Campbell says: “The novel was written by a woman and I’ve always read it as being about women – most likely influenced by Shelley’s mother, Mary Wollstonecraft, herself a writer and a hugely influential early feminist thinker. \n“It’s about responsibility but from a female perspective, so it seemed fitting that our Dr Frankenstein was a woman. \n“Shelley was writing against a backdrop of a Europe tearing itself to pieces while the Industrial Revolution, imperial expansion and capitalism were forming the future. \n“The Creature (created in the novel by Victor Frankenstein, a gifted scientist who learns how to bring inanimate matter to life) and how he is perceived stands as a metaphor for the fear of ‘the other’ – xenophobia, racism, sexism and the diminshing of all those different from ourselves.” \nHe adds that “in a world that is facing, or trying to avoid facing, the realities of financial crisis, globalisation, war in the Middle East, the refugee crisis, climate change, Trump, Brexit etc, this feels very pertinent”. \nThe back story to the Northern Stage production is that women are not allowed to study medicine in England so Victoria travels to Ingolstadt, Bavaria, to pursue her dream and become Dr Frankenstein. \nSelma Dimitrijevic adds: “The feeling I wanted to recreate was the same one I had when I first read it as a teenager: I was \nterrified! \n“In our version, the Creature is not necessarily what people might expect it to be. \n“As well as looking at what is Victoria’s responsibility, I was also interested in what the world might look like from the Creature’s perspective. \n“What does he do if he is seen as less than human? Does he demand equality? And if it’s denied him, how long can he be attacked and persecuted before he starts thinking of retaliation? And finally, if he does retaliate, whose fault is it – his or ours?” \nDr Frankenstein is on at Northern Stage on various dates and at various times between Friday, February 3 and Saturday, March 11. Read More HEDDA GABLER: THIS IS NOT A LOVE STORY Donald McBride as Judge Brack and Victoria Elliott as Hedda in rehearsals (Photo: Northern Stage) \nHenrik Ibsen’s play, full of intrigue and unintended consequences, was first performed in Munich in 1891. It tells of Hedda Gabler, the recently (and unhappily) married wife of an academic, who dreams of better things and is prepared to get her hands dirty in order to make them happen. \nGabler, like Hamlet, has come to be regarded as one of the theatre’s great roles. \nSelma Dimitrijevic’s addition of ‘This is Not a Love Story’ to Ibsen’s title is because, she says, the play is often mistaken as such. \nInstead it is “a funny, shocking and powerful exploration of the nature of identity and the desperation and absurdity of trying to be something you’re not”. \nEnlarging on this, Selma says: “I am not interested in what Hedda meant a hundred years ago or how it’s been interpreted since. \n“I am interested in what this play can tell us about today – what’s it like to be told you are something you are not; what to do when you are not allowed to dress the way you want, speak the way you want or behave the way you want. \n“And, most importantly, who has the right to create those rules and why? \n“Hedda finds herself boxed into a life she never chose for herself and basically has only three options – to submit, to put a bullet in her own head or to stick two fingers up at the world and change the rules.” \nHedda Gabler: This is Not a Love Story runs at Northern Stage between Thursday, February 16 and Wednesday, March 8. \nTo book tickets for either show (you can see both for £30 if you book in the same transaction) tel. 0191 2305151 or visit www.northernstage.co.uk/whats-on/2-shows-for-30", "external_links": [], "published": "2017-02-01T01:00:00.000+02:00", "crawled": "2017-01-31T21:23:40.013+02:00", "highlightTitle": ""}