{"organizations": [], "uuid": "3e07ef89f9025dbe4b0bbafab029d77bfaa2d232", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30036392/15782399.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/booming-britain-sets-new-car-record/story-30036392-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Booming Britain sets new car record | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Booming Britain sets new car record | Leicester Mercury", "spam_score": 0.781, "site_type": "news", "published": "2017-01-06T22:30:00.000+02:00", "replies_count": 0, "uuid": "3e07ef89f9025dbe4b0bbafab029d77bfaa2d232"}, "author": "Chris Russon", "url": "http://www.leicestermercury.co.uk/booming-britain-sets-new-car-record/story-30036392-detail/story.html", "ord_in_thread": 0, "title": "Booming Britain sets new car record | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "chris russon", "sentiment": "negative"}, {"name": "mike hawes", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "leicester mercury booming britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "ford focus", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "vauxhall corsa", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "ford fiesta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Booming Britain sets new car record By RTWhyte | Posted: January 06, 2017 By Chris Russon 0 COMMENTS SHARES NO1: The Ford Fiesta out sold the second placed Vauxhall Corsa by more than 40,000 cars VIEW GALLERY Booming Britain sets new car record X \nCopy link to paste in your message / NO1: The Ford Fiesta out sold the second placed Vauxhall Corsa by more than 40,000 cars NO2: The Vauxhall Corsa slots in between two very popular Fords NO3: Selling 70,545, the Ford Focus is the nation's favourite family hatchback Comments (0) \nA RECORD number of new cars was sold in Britain in 2016 according to the latest figures from the Society of Motor Manufacturers and Traders. \nIt is the fifth consecutive year of growth in sales which last year topped out at almost 2.7 million models. The top selling car remains the Ford Fiesta followed by the Vauxhall Corsa with the Ford Focus in third spot. In total 2,692,786 cars were registered in 2016, up 2.3 per cent on the previous year. The SMMT said that buyers were attracted by a range of new cars and attractive finance deals. \nThere are now 44 mainstream car brands offering nearly 400 different model types in Britain - and 2017 looks set to be another busy year with almost 70 new models due to arrive in the next 12 months. \nMike Hawes, SMMT chief executive, said:\"Despite 2016's political and economic uncertainties, the UK's new car market delivered another record performance as car makers offered an incredible range of innovative and high tech models.\" \nBut he was cautious about the future post-Brexit months, adding: \"2017 may well be more challenging as sterling depreciation raises the price of imported goods but, with interest rates still at historic lows and a range of new models arriving in 2017, there are still many reasons for consumers to consider a new car in 2017. \n\"Looking longer term, the strength of this market will rest on our ability to maintain our current trading relations and, in particular, avoid tariff barriers which could add significantly to the cost of a new car.\" \nAnalysing trends, the SMMT revealed that fleet buyers were responsible for most of the growth, with demand growing to a record 1.38 million units. \nThe private market remained at a historically high level, with more than 1.2 million private buyers registering a new car in 2016, although demand fell over the latter three quarters of the year and December sales were down slightly by -1.1 per cent year on year with 178,022 new cars registered in the month. \nElectric cars saw significant growth with more than 10,000 buyers in 2016, up 3.3 per cent on 2015. \nOther so-called alternative fuel vehicles such as hybrids and plug-in hybrids saw demand rise by 41.9 per cent and 25.1 per cent respectively while diesel sales were up slightly at 1,285,160 units. Petrol powered vehicles remained the most popular at 1,318,707 – a rise of almost three per cent compared to 2015. \nThe top ten sellers in 2016 were: \n1. Ford Fiesta 120,525 ", "external_links": [], "published": "2017-01-06T22:30:00.000+02:00", "crawled": "2017-01-06T19:44:25.528+02:00", "highlightTitle": ""}