{"organizations": [], "uuid": "8e07c1eb3e3ae5de907aa186a5fecf9b1cdfcdea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12462990.ece/ALTERNATES/s1200/BRITAIN_NewZealand_153944.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/no-half-measures-were-leaving-12462784", "country": "IE", "domain_rank": 21960, "title": "No half measures - we're leaving the EU entirely, says Theresa May - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "No half measures - we're leaving the EU entirely, says Theresa May - Chronicle Live", "spam_score": 0.017, "site_type": "news", "published": "2017-01-17T12:00:00.000+02:00", "replies_count": 0, "uuid": "8e07c1eb3e3ae5de907aa186a5fecf9b1cdfcdea"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/no-half-measures-were-leaving-12462784", "ord_in_thread": 0, "title": "No half measures - we're leaving the EU entirely, says Theresa May - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "global britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "welt am sonntag", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Britain's Prime Minister Theresa May (Photo: AP Pool) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe United Kingdom is going to quit the European Union entirely to become “an independent, self-governing” nation, Prime Minister Theresa May will say on Tuesday. \nMrs May will make it clear that there is no question of a so-called “soft Brexit” in which the UK continues to be bound by EU rules or remains a member of EU institutions. \nIn a long-awaited speech, she will say: “We seek a new and equal partnership – between an independent, self-governing, Global Britain and our friends and allies in the EU. \n“Not partial membership of the European Union, associate membership of the European Union, or anything that leaves us half-in, half-out. \n“We do not seek to adopt a model already enjoyed by other countries. We do not seek to hold on to bits of membership as we leave. \n“The United Kingdom is leaving the European Union. My job is to get the right deal for Britain as we do.” \nMrs May is to set out plans for a new strategic partnership with the EU, and insist that the UK will continue to be “best friend and neighbour to our European partners”. \nBut she will say the Brexit vote provides an opportunity for the UK to become “truly global” country which “gets out into the world to build relationships with old friends and new allies alike”. Prime Minister Theresa May \nThe Prime Minister will reject suggestions from some remain campaigners that people who voted ‘leave’ in last year’s referendum were misled or didn’t know what they were voting for. \nShe will say: “A little over six months ago the British people voted for change. They voted to shape a brighter future for our country. They voted to leave the European Union and embrace the world. \n“And they did so with their eyes open: accepting that the road ahead will be uncertain at times, but believing that it leads towards a brighter future for their children – and their grandchildren too.” \nMrs May will attempt to reassure EU nations that the UK continues to be “reliable partners, willing allies and close friends”. Read More What would be the difference between hard and soft Brexit? \nShe will say: “We want to buy your goods, sell you ours, trade with you as freely as possible, and work with one another to make sure we are all safer, more secure and more prosperous through continued friendship.” \nBut she will say that this means negotiating “a new, positive and constructive partnership between Britain and the European Union” rather than attempting to continue with existing arrangements. \nIt comes after Chancellor Philip Hammond said freedom of movement between EU countries and the UK “has to stop”. \nThe tough stance means the UK could continue to welcome migrant workers from EU countries, but it would have the power to stop the coming in if it chose. Chancellor Philip Hammond \nAnd it means the UK is almost certain to leave the single market, which allows UK firms to export to EU countries without restrictions, although a new trade deal with the EU could be signed. \nSpeaking to German newspaper Welt am Sonntag, Mr Hammond said: “The message from the referendum is that we must control our immigration policy. \n“So there will be a decision that the British government make about how we manage immigration from outside the UK, We would take the decision in the interest of the UK. \n“But that does not mean that we would close our doors to European migrants coming to work in the UK. We have over three million European migrants working in our economy and we have full employment. So clearly we need people to come and work in our economy to keep it functioning. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now ", "external_links": [], "published": "2017-01-17T12:00:00.000+02:00", "crawled": "2017-01-17T07:06:48.036+02:00", "highlightTitle": ""}