{"organizations": [], "uuid": "c11139bb9f35c26c3f7639042f7a64e2b2a0a137", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.liverpoolecho.co.uk/incoming/article12283906.ece/ALTERNATES/s1200/JS106374186.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mayors-north-say-brexit-bad-12469701", "country": "GB", "domain_rank": 21960, "title": "Mayors of the North to have a say on Brexit - too bad the North East doesn't have one", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Mayors of the North to have a say on Brexit - too bad the North East doesn't have one", "spam_score": 0.0, "site_type": "news", "published": "2017-01-18T04:00:00.000+02:00", "replies_count": 0, "uuid": "c11139bb9f35c26c3f7639042f7a64e2b2a0a137"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mayors-north-say-brexit-bad-12469701", "ord_in_thread": 0, "title": "Mayors of the North to have a say on Brexit - too bad the North East doesn't have one", "locations": [], "entities": {"persons": [{"name": "andy burnham", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "kirsty wigglesworth/pa wire", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "catherine mckinnell  newcastle north", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "burnham", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "merseyside", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "north-west", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "redcar & cleveland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Thank you for subscribing!   \nThe North of England will be consulted about the Government’s plans for Brexit , Ministers have revealed - but it seems much of the North East will be excluded. \nIt’s because the North East region isn’t going to have an elected regional mayor. \nDavid Davis, the Secretary of state for Exiting the European Union , told MPs he planned to invite the “mayors of the North” to meet him for a summit in York to discuss how their regions can be protected as the UK quits the European Union. \nMerseyside, Greater Manchester and Teesside are to hold elections for a mayor on May 4 this year, \nMr Davis’ announcement means that they will be invited to the meeting. \nBut plans to elect a “North East” mayor serving County Durham, Gateshead, Newcastle, North Tyneside, Northumberland , South Tyneside and Sunderland were scrapped last year. \nLeaders of Newcastle, Northumberland and North Tyneside are working on a smaller devolution deal, but it is not clear if it will involve a mayor. Even if it did, the election would now have to wait until 2018. \nIt apparently means the much of the North East will apparently be excluded from the talks, although the Teesside mayor, serving Darlington, Hartlepool, Middlesbrough, Redcar & Cleveland and Stockton, will be included. Catherine McKinnell \nNewcastle North MP Catherine McKinnell said the North East needed a voice throughout the UK’s Brexit negotiations. \nShe said: “Our future trading arrangements with the European Union are particularly important to the North East’s economy and local jobs, so the Government’s complete failure to acknowledge that leaving the EU – and particularly the Single Market – will affect different parts of the country in different ways is deeply concerning. \n“The North East’s voice and interests should be important as anyone else’s throughout this process, and it’s not good enough for the Government to plough ahead with a negotiating strategy which could damage our region more than others.” Read More Here's Theresa May's 12-point plan for Brexit - what do you think? \nMr Davis was quizzed in the House of Commons by Andy Burnham, Labour’s candidate to become mayor of Greater Manchester. \nMr Burnham said: “I see in the Prime Minister’s speech she makes specific mention of protecting the interest of Cardiff, Edinburgh, Belfast, the City of London, but there is mention of the North-West of England, Greater Manchester or indeed any English region. \n“Rather than leaving these crucial decisions to London centric right-wing clique around the Prime Minister, isn’t it time to open up this debate, give Greater Manchester a voice in it and establish Brexit committee for the nations and regions?” Prime Minister Theresa May (Photo: Kirsty Wigglesworth/PA Wire) \nMr Davis told him: “As he might imagine, I am acutely conscious of the needs of the north and what I am intending to do, I had intended to announce it – I hadn’t intended to announce it today but I will as he asked - after the mayoral elections I intend to invite all mayors of the north to come and have a meeting in York to discuss precisely that.” \nIn a major speech setting out her Brexit plans, Mrs May talked about ensuring Scotland, Wales and Northern Ireland had a say in negotiations. \nShe said: “We have already received a paper from the Scottish Government, and look forward to receiving a paper from the Welsh Government shortly. Both papers will be considered as part of this important process. We won’t agree on everything, but I look forward to working with the administrations in Scotland, Wales and Northern Ireland to deliver a Brexit that works for the whole of the United Kingdom. Read More No half measures - we're leaving the EU entirely, says Theresa May \n“Part of that will mean working very carefully to ensure that – as powers are repatriated from Brussels back to Britain – the right powers are returned to Westminster, and the right powers are passed to the devolved administrations of Scotland, Wales and Northern Ireland.” \nThe majority of voters in Scotland voted to stay in the EU, as did the majority in Northern Ireland, and the Prime Minister’s determination to include them in talks may reflect a desire to ensure that Brexit doesn’t encourage demands for independence in Scotland, or calls for Northern Ireland to leave the UK. Read More", "external_links": [], "published": "2017-01-18T04:00:00.000+02:00", "crawled": "2017-01-17T23:49:41.979+02:00", "highlightTitle": ""}