{"organizations": [], "uuid": "d23135406750f9622934e3d90f959462e5533d00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12389798.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heres-theresa-mays-12-point-12467926", "country": "GB", "domain_rank": 21960, "title": "Here's Theresa May's 12-point plan for Brexit - what do you think?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Here's Theresa May's 12-point plan for Brexit - what do you think?", "spam_score": 0.0, "site_type": "news", "published": "2017-01-17T23:00:00.000+02:00", "replies_count": 0, "uuid": "d23135406750f9622934e3d90f959462e5533d00"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heres-theresa-mays-12-point-12467926", "ord_in_thread": 0, "title": "Here's Theresa May's 12-point plan for Brexit - what do you think?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "mrs may", "sentiment": "none"}, {"name": "stefan rousseau/pa wire", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "steve parsons/pa wire", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "gulf states", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "neutral"}, {"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "border force", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "People of Sunderland talk about Brexit 6 months on from vote Share this video Watch Next \nThat’s the union that makes up the United Kingdom, of course - not so much the European Union. \nShe said: “At this momentous time, it is more important than ever that we face the future together, united by what makes us strong: the bonds that unite us as a people, and our shared interest in the UK being an open, successful trading nation in the future.” \nMrs May said Scotland, Wales and Northern Ireland will have a say in the negotiations with the EU. But there was no sign of anything for English regions like the West Midlands 4. Maintain the Common Travel Area with Ireland \nWe had an open border with Ireland even before freedom of movement became established in the EU. Mrs May wants it to continue once we leave. \n“There has been a Common Travel Area between the UK and the Republic of Ireland for many years. Indeed, it was formed before either of our two countries were members of the European Union. And the family ties and bonds of affection that unite our two countries mean that there will always be a special relationship between us.” 5. Control of immigration A Border Force officer checking passports (Photo: Steve Parsons/PA Wire) \n“Britain is an open and tolerant country. We will always want immigration, especially high-skilled immigration, we will always want immigration from Europe, and we will always welcome individual migrants as friends. \n“But the message from the public before and during the referendum campaign was clear: Brexit must mean control of the number of people who come to Britain from Europe. And that is what we will deliver.” 6. Rights for EU nationals in Britain, and British nationals in the EU \nMrs May said she wants to be able to promise EU nationals currently in the UK that they can stay - but repeated her warning that she’ll only do so if other EU nations make the same promise to Brits living in their countries. Read More Brexit Britain will leave the single market: North East reaction to Theresa May's speech 7. Protect workers’ rights \n“Not only will the Government protect the rights of workers’ set out in European legislation, we will build on them.” 8. Free trade with European markets The European Union and the Union flag sit together (Photo: 2016 Getty Images) \nThe UK will leave the Single Market, which currently allows us to trade with the rest of the EU without restrictions \n“Instead we seek the greatest possible access to it through a new, comprehensive, bold and ambitious Free Trade Agreement.” 9. New trade agreements with other countries \n“We want to get out into the wider world, to trade and do business all around the globe. Countries including China, Brazil, and the Gulf States have already expressed their interest in striking trade deals with us. \n“We have started discussions on future trade ties with countries like Australia, New Zealand and India. \n“And President Elect Trump has said Britain is not “at the back of the queue” for a trade deal with the United States, the world’s biggest economy, but front of the line.” 10. The best place for science and innovation \n“From space exploration to clean energy to medical technologies, Britain will remain at the forefront of collective endeavours to better understand, and make better, the world in which we live.” 11. Cooperation in the fight against crime and terrorism \n“A Global Britain will continue to cooperate with its European partners in important areas such as crime, terrorism and foreign affairs.” 12. A smooth, orderly Brexit Prime Minister Theresa May (Photo: Stefan Rousseau/PA Wire) \nMrs May said she didn’t want a sudden “cliff-edge” change from one set of arrangements to another - and so there could be a “phased process” of quitting the EU. \nShe said that an agreement about how things will work should be agreed by the time the two-year negotiations between the UK and the EU end. That probably means by March 2019. \n“From that point onwards, we believe a phased process of implementation, in which both Britain and the EU institutions and member states prepare for the new arrangements that will exist between us, will be in our mutual self-interest. This will give businesses enough time to plan and prepare for those new arrangements. \n“This might be about our immigration controls, customs systems or the way in which we cooperate on criminal justice matters. Or it might be about the future legal and regulatory framework for financial services. \n“For each issue, the time we need to phase-in the new arrangements may differ. Some might be introduced very quickly, some might take longer. And the interim arrangements we rely upon are likely to be a matter of negotiation.” Read More", "external_links": [], "published": "2017-01-17T23:00:00.000+02:00", "crawled": "2017-01-17T19:14:38.199+02:00", "highlightTitle": ""}