{"organizations": [], "uuid": "2a743e72d5c8691affb811819597b2445eb55f8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30079482/15814560.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/crisps-and-other-foods-cooked-at-a-high-temperature-linked-to-cancer/story-30079482-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Crisps and other foods cooked at a high temperature linked to cancer | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Crisps and other foods cooked at a high temperature linked to cancer | Leicester Mercury", "spam_score": 0.466, "site_type": "news", "published": "2017-01-23T19:50:00.000+02:00", "replies_count": 0, "uuid": "2a743e72d5c8691affb811819597b2445eb55f8e"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/crisps-and-other-foods-cooked-at-a-high-temperature-linked-to-cancer/story-30079482-detail/story.html", "ord_in_thread": 0, "title": "Crisps and other foods cooked at a high temperature linked to cancer | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "gavin shears", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "food standards agency", "sentiment": "none"}, {"name": "fsa", "sentiment": "none"}, {"name": "international agency for research", "sentiment": "none"}, {"name": "us environmental protection agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Crisps and other foods cooked at a high temperature linked to cancer By Leicester Mercury | Posted: January 23, 2017 2 COMMENTS SHARES Crisps have been placed on a list of danger foods Crisps and other foods cooked at a high temperature linked to cancer X \nCopy link to paste in your message / \nCrisps could be linked to cancer, health officials claim. \nExperts say eating certain foods that have been cooked at high temperatures could be damaging to humans. \nThey have included Britain's favourite snack on a list of dangerous foods that also includes chips, toast, biscuits, crackers, breakfast cereals and coffee \nOther dangers include pizza bases, black olives and cereal-based baby foods, experts have said. \nAlso on the list are root vegetables such as potatoes, sweet potatoes, beetroot, turnip, swede and parsnips once they have been fried until dark brown or crispy. \nExperts say these foods, when cooked at high temperatures (above 120C), can emit a chemical compound called acrylamide. \nAnd, worryingly, studies on mice have shown that high levels of it can cause neurological damage and cancer. \nStudies in humans, though, have proved inconclusive. \nBut the US Environmental Protection Agency has said it is \"likely to be carcinogenic to humans\". \nAnd the International Agency for Research on Cancer described it as a \"probable human carcinogen\". \nAcrylamide forms from the chemical reaction between some sugars and the amino acid asparagine. But the reaction is less likely when food is steamed, boiled or even microwaved. \nThe UK's Food Standards Agency recommends people should only fry, roast, bake or toast starchy food until it is a golden yellow colour. \nRead more Walkers to increase crisp prices by 10 per cent - blaming Brexit \nPeople should also not keep potatoes in the fridge, the FSA said. This is because it can increase the level of acrylamide. \nInstead, Brits are urged to store raw potatoes in a dark and cool place, preferably at a temperature above 6C. \nA senior policy adviser in contaminants at the FSA, Gavin Shears, said there was no need for people to \"radically change\" their diets - if they are already eating a balanced selection of foodstuffs. \nHe added: \"If you slightly overdo your roast potatoes on a Sunday, it's not that you have to throw them away. We're not asking people to cut out certain foods. \n\"This is about reducing your overall lifetime risk through simple steps.\" ", "external_links": [], "published": "2017-01-23T19:50:00.000+02:00", "crawled": "2017-01-23T20:20:21.417+02:00", "highlightTitle": ""}