{"organizations": [], "uuid": "05161e9abe7ac0aed420cfbe1a07c6da2994fb4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12402734.ece/ALTERNATES/s1200/Next-results.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/high-street-giant-retail-next-12402620", "country": "GB", "domain_rank": 21960, "title": "High street giant retail Next warns of tough times for retail after poor Christmas", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "High street giant retail Next warns of tough times for retail after poor Christmas", "spam_score": 0.0, "site_type": "news", "published": "2017-01-04T17:19:00.000+02:00", "replies_count": 0, "uuid": "05161e9abe7ac0aed420cfbe1a07c6da2994fb4a"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/high-street-giant-retail-next-12402620", "ord_in_thread": 0, "title": "High street giant retail Next warns of tough times for retail after poor Christmas", "locations": [], "entities": {"persons": [{"name": "wolfson", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}, {"name": "richard lim", "sentiment": "none"}, {"name": "pro-brexit", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "retail economics", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nike uk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business High street giant retail Next warns of tough times for retail after poor Christmas Sales fell over Christmas and the company warned of a challenging year ahead with prices likely to rise Share Next has revealed further trading woes as it said its high street sales fell 5.9% in the third quarter (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHigh street giant Next says it is bracing for “tougher times” in 2017 as it warned over sales and profits after a worse-than-expected festive performance . \nThe fashion and homewares giant said sales in the 54 days to December 24 fell 0.4%, defying hopes of a fourth quarter turnaround, while it posted a 7% plunge in end-of-season clearance sales. \nNext said profits for the year to January 2017 were expected to fall by around 3.6%, and sales and profits would remain under pressure in a “challenging” year ahead. \nNext said sales trading woes were set to deepen in 2017, sending profits tumbling potentially as much as 14% in a worst case scenario for the year to January 2018. \nIt repeated warnings over cost pressures from the Brexit-hit pound, which the group has already said will probably see it hike prices by up to 5%. \nThis, together with a continuing shift away from spending on clothing and footwear, could see total full-price sales in the range of minus 4.5% to 1.5%, the group warned. \nA central forecast of a 1.5% drop in sales would be “marginally worse” than the current year, although it hopes for a boost of around 1% from overseas revenues due to the weak pound. \nNext - headed by pro-Brexit chief executive Lord Wolfson - also took aim at the Government over its handling of the UK’s exit from the EU . \nIt said there was “little visibility of the approach the UK Government will be taking to Brexit”. Read More Newcastle's Fenwick paints gloomy picture for future of UK retail sector \nThe group had been hoping for a fourth quarter rise in sales after a difficult 2016, described by one analyst recently as its “annus horribilis”. \nBut it said the end-of-year blow meant profits were expected to come in at £792m for the 12 months to January 2017, depending on January trade, which would be a 3.6% fall on a year earlier. \nThe group added: “The year ahead looks set to be another challenging year; therefore we are preparing the company for tougher times.” \nNext shares plunged as much as 14% after the update in a dismal start to the sector’s festive reporting season. Read More Nike UK in Sunderland runs up £65m in revenues after strong year \nShares in Next and other retailers had already fallen on Tuesday ahead of the update after poor footfall figures suggested a poor start to the January clearance sales. \nNext - seen as a retail bellwether - said it suffered a 3.5% fall in full-price sales across its high street stores in the 54 days to Christmas Eve. \nIt saw a better performance across its Directory catalogue arm, with sales up 5.1%, but this was not enough to offset the fall across its store estate. \nThe chain expects full-price sales in the current year to fall by around 1%. \nIts forecasts for 2017/18 show profits expected in the range of £680 million to £780 million - a fall of between 14% and 2%. \nRichard Lim, chief executive of consultancy Retail Economics, branded the Next update “miserable”. \nHe added: “These latest figures from Next confirm that underlying conditions on the high street remain desperate for clothing and footwear retailers.” Like us on Facebook", "external_links": [], "published": "2017-01-04T17:19:00.000+02:00", "crawled": "2017-01-04T13:21:52.452+02:00", "highlightTitle": ""}