{"organizations": [], "uuid": "a6e7f3966ba9664f6e72b84137f41313ffb3b0af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12223885.ece/ALTERNATES/s1200/Car-production-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/nissans-sunderland-plant-produces-more-12507467", "country": "GB", "domain_rank": 21960, "title": "Nissan's Sunderland plant produces more than 507,000 cars in a year, new figures show", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan's Sunderland plant produces more than 507,000 cars in a year, new figures show", "spam_score": 0.0, "site_type": "news", "published": "2017-01-26T07:01:00.000+02:00", "replies_count": 0, "uuid": "a6e7f3966ba9664f6e72b84137f41313ffb3b0af"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/nissans-sunderland-plant-produces-more-12507467", "ord_in_thread": 0, "title": "Nissan's Sunderland plant produces more than 507,000 cars in a year, new figures show", "locations": [], "entities": {"persons": [{"name": "kevin fitzpatrick", "sentiment": "none"}, {"name": "owen humphreys/pa wire", "sentiment": "none"}, {"name": "mike hawes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "merseyside", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "vauxhall astra", "sentiment": "none"}, {"name": "european manufacturing", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}, {"name": "jaguar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan's Sunderland plant produces more than 507,000 cars in a year, new figures show The Sunderland car plant has published production volumes which are the second highest recorded in its history Share Nissan's plant in Sunderland (Photo: Owen Humphreys/PA Wire) Share Get business   \nNorth East motor manufacturer Nissan made more than half a million vehicles in its 30th anniversary year, cementing its position as the largest UK car plant in history. \nThe Sunderland base of the Japanese juggernaut said 507,430 vehicles rolled off production lines last year – the second highest total ever recorded at the plant. \nAnd having posted new records for its electric LEAF and second generation Qashqai models, Nissan bosses said the firm is making solid progress with investments to help drive future growth. \nTotal volume at the plant, which produced 6.5% more cars in 2016 compared to 2015, is now approaching nine million vehicles since the first car was made at the factory in 1986. \nDirectors said other milestones on the horizon include the launch of a refreshed Qashqai and the introduction of autonomous drive technology, which will see Nissan will bring driverless cars to city streets by 2020. \nNew facilities under development at the company’s Sunderland plant include a new £37m extra large press line, due to start production within weeks, the £22m Qashqai capacity expansion and £26.5m to be spent on manufacturing a future generation of electric vehicle (EV) batteries in the UK. \nLast October the firm announced it would build the next-generation Qashqai at Sunderland as well as its new X-Trail SUV. Workers at Nissan's plant in Sunderland on the production line for the Infiniti Q30 \"active compact\" vehicle (Photo: Owen Humphreys/PA Wire) \nThe new models mean Nissan will add an extra shift onto the second production line at Sunderland, potentially creating up to 1,000 jobs. \nOther highlights from 2016 included the installation of 19,000 new solar panels alongside the plant’s existing 10 wind turbines, taking the contribution of renewables to 7% of the plant’s total electricity requirements. \nKevin Fitzpatrick, Nissan Divisional Vice President, European Manufacturing, said: “Since the birth of our factory three decades ago, North East England has become one of the major international automotive centres. \n“Britain is now home to Nissan’s best-selling and most technologically-advanced models in Europe, covering our market-leading crossover range, the world’s best-selling electric vehicle and two premium models for global export. \n“This has been achieved through hard work, innovative thinking, ingenuity and strong partnerships with forward-thinking local companies. With future models secured and new facilities in development, congratulations to all of my colleagues in Sunderland and across the UK on another great year.” \nFollowing the start of production of the Infiniti Q30 in late 2015, a second Infiniti model, the QX30, went into production for global markets in 2016 – which also represented the first time vehicles have been exported from Sunderland to the USA and China. \nThe firm said it injects £3bn a year into the British economy through suppliers, services and wages, while £650m of ongoing investment in new facilities and future models in Sunderland will take the total capital investment by Nissan in the plant since it opened to beyond £4bn. \nNissan published its figures in tandem with the release of latest figures from the Society of Motor Manufacturers and Traders (SMMT), which showed the number of cars built in the UK has now reached a 17-year high. \nAround 1.7m cars rolled off production lines last year, an increase of 8.5% over the previous year, with exports reaching a record 1.35m. \nHowever, investment fell last year amid uncertainty over the future of the economy because of the impact of leaving the EU , new figures show. \nThe SMMT said global demand for British-built cars increased by more than 10%, leading to four of every five cars built in this country being exported to one of 160 markets. Read More Nissan will review its Sunderland plant after Brexit, boss says \nSMMT chief executive Mike Hawes predicted that car production will reach an all-time high before 2020, but he sounded a note of caution after revealing that investment by the industry fell to £1.66bn last year, compared with £2.5bn in previous years. \nThere were signs that firms were delaying investment decisions because of the greater uncertainty sparked by the referendum decision, he said, adding that if tariffs were imposed after the UK leaves the single market, the price of cars could increase by £1,500. \n“We don’t want tariffs - it’s a red line for the car industry. There would be an impact on demand and jobs - that’s a cliff edge we want to avoid,” he said. \n“We want trade deals but they must be the right deals, not rushed deals. Failure to do so could damage UK automotive manufacturing beyond repair.” \nJaguar Land Rover, which has three sites in the Midlands and Merseyside, increased production by 11% last year to 544,000, the Mini by 4.9% to 210,000 and Honda by 12% to 134,000. Production of Toyota models fell by 5% to 180,000. \nThe top 10 British best-sellers worldwide last year were the Nissan Qashqai, Toyota Auris, Mini, Vauxhall Astra, Range Rover Sport and Evoque, Land Rover Discovery Sport, Honda Civic, Jaguar F-Pace and Jaguar XE. Like us on Facebook", "external_links": [], "published": "2017-01-26T07:01:00.000+02:00", "crawled": "2017-01-26T02:27:21.003+02:00", "highlightTitle": ""}