{"organizations": [], "uuid": "b279ce58f75038dfccad85fcb9283785f491c65f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article8820105.ece/ALTERNATES/s1200/JS58879103.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/chris-day-outlines-mission-make-12418643", "country": "GB", "domain_rank": 21960, "title": "Chris Day outlines his mission to make Newcastle University a world leader", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Chris Day outlines his mission to make Newcastle University a world leader", "spam_score": 0.0, "site_type": "news", "published": "2017-01-08T20:00:00.000+02:00", "replies_count": 0, "uuid": "b279ce58f75038dfccad85fcb9283785f491c65f"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/news/north-east-news/chris-day-outlines-mission-make-12418643", "ord_in_thread": 0, "title": "Chris Day outlines his mission to make Newcastle University a world leader", "locations": [], "entities": {"persons": [{"name": "chris day", "sentiment": "neutral"}, {"name": "chris brink", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "oliver james", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "christopher edwards", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "tynemouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "peterborough", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "freeman hospital", "sentiment": "none"}], "organizations": [{"name": "newcastle university", "sentiment": "neutral"}, {"name": "international centre for life", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "newcastle hospitals trust", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "medical research council", "sentiment": "none"}, {"name": "higher education and research bill", "sentiment": "none"}, {"name": "state for health jeremy hunt", "sentiment": "none"}, {"name": "freeman hospital", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "cambridge university", "sentiment": "none"}, {"name": "newcastle university medical school", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "faculty of medical sciences", "sentiment": "none"}, {"name": "marden high school", "sentiment": "none"}, {"name": "academy of medical sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chris Day outlines his mission to make Newcastle University a world leader Newcastle University's new vice-chancellor on league tables, Brexit and being an important part of regional life Share Professor Chris Day. Video Available. Secretary of State for Health Jeremy Hunt visits the Centre for Life as Newcastle University academics announce a breakthrough in DNA research. Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe new head of Newcastle University is a local man on a mission to make the institution one of the best in the world. Graeme Whitfield meets him. \nWHEN Prof Chris Day took up the post of vice-chancellor of Newcastle University - following Prof Chris Brink and Prof Christopher Edwards - it was as if he was desinted for the job. \nBut a useful first name aside, Prof Day broke the mould in some ways when he get the nod to step up from leading the university’s medical school to taking on the top job. \nInstead of the usual global search for an academic star, Prof Day was an internal candidate - the first Newcastle has appointed the VC’s chair in decades - and a local lad, born in Tynemouth and educated at Marden High School before working at Newcastle’s Freeman Hospital. \nNot that he was appointed without a reputation of his own, having been both a leading doctor and a high-profile academic with a global renown as a researcher into the causes of alcohol-related liver disease. \nHe has also accumulated professional positions on a number of national bodies, becoming vice-president of the Academy of Medical Sciences and a council member of the Medical Research Council while closer to home he is a director of the Newcastle Hospitals Trust and a a board member of the International Centre for Life. \nUnder the nine years of his leadership, Newcastle’s medical school rose to be ranked in the world’s top 50, and he now hopes to see the university as a whole improve its standing on the global stage. Professor Chris Day, Pro-Vice-Chancellor, Faculty of Medical Sciences, Newcastle University \nHis ambition - to get the university into the Top 100 in the world - is not simply a matter of personal or even regional pride, however. With universities increasingly gaining income from foreign students who often base their choices of global rankings, improving Newcastle’s position in the league tables has economic consequences. \nHigher ranked universities also find it easier to attract star academics from around the world, and with many foreign governments refusing to fund students to universities outside of the top 200 in the world - something Newcastle is not far away from - the need to improve the university’s reputation is more pressing than ever. \nIn the six years of the current Times Higher Education rankings, Newcastle has fallen from 152nd in the world to 190th, and has also lost pace to a number of British competitors, going from 23rd in the UK to 31st. \nThat fall coincided with a push by Prof Day’s predecessor, Prof Chris Brink, to make Newcastle a “civic university” which played a key role in improving the life of its region. \nWhile not rowing back from Prof Brink’s mantra of “what are we good at, but what are we good for?”, Prof Day first week in the job saw him highlighting the need for Newcastle to concentrate on improving its reputation for academic excellence. Read More Newcastle University aiming to be in the global Top 100 \n“We want to be a civic university with a reputation for global excellence,” he said. “When you are 190th in the world rankings and the mid-20s in most UK league tables, it starts to raise questions about that. \n“Without doubt we are world leading in several areas but across the board we’re not in the top 100 in the world, and nowhere near the top 50, in our missions of research and teaching. \n“For me, to be a really world class civic university, which is our strapline, we have to be more academically excellent, which would be reflected in league tables. \n“For a university like Newcastle to aspire to get into the top 100 in the world is a very realistic ambition. \n“When you look at the UK universities in the top 100, it’s not just Oxford and Cambridge, it is good provincial universities, and we should be aiming to be there.” Prof. Chris Day pictured at Newcastle University Medical School \nIf breaking into the world’s top 100 is a tough ask, Prof Day isn’t showing it. He described the vice-chancellor’s position as his “dream job” and ponders how he would ever have applied for VC positions anywhere else had he not got the job at Newcastle. \nGrowing up in Tynemouth, he trained as a doctor at Cambridge University and came to the Freeman Hospital early in his career, falling under the influence of liver specialist Oliver James and following him to the medical school before taking charge of it nine years ago. \nHe said: “I realised the exciting challenges of academic leadership, thinking it’s just as interesting putting a group of scientists and clinicians together to address interesting questions and seeing them flourish as doing it yourself. \n“A lot of people don’t feel like that, they want to do their own work, but I’ve found that building bridges, creating groups, solving personality clashes between two brilliant scientists - I really enjoyed that and I got that in buckets for the nine years I was head of the medical school.” \nSince being appointed in the summer, Prof Day has spent the time before taking up the top job at the start of January getting to know parts of the university he knew less than the medical faculty. \nTo reach the world’s top 100, he said, the university will have to do better-rated research in all of its faculties, but also do more to enhance its reputation, with a requirement for him to be more public than his predecessor. \n“If we fall to 210th next year, we immediately lose hundreds and hundreds of international students whose Governments won’t sponsor them to come here, let alone the staff who won’t want to come here,” he said. \n“So to not have that as at least one of the targets to aim at would be a crazy thing for a current VC in 2017. We’re in a massively competitive world. \n“Of course you hope that by doing all the other things – being a great university, doing fantastic research, fantastic teaching, that’s the core businesss. But if we market that properly, if we shout about it enough, naturally both those things will lead to us rising up the league tables. \n“It’s not Aim 1 to rise up the league tables, Aim 1 is to do great research and great teaching and that it has societal impact. But necessarily, that will lead to us going up the tables.” \nOther challenges are also landing in Prof Day’s in-box: a Higher Education and Research Bill that is proving controversial for measures seen as impinging on the independence of universities, not to mention the fall-out of the Brexit vote and recent anti-immigration rhetoric from the Government Ministers that is highly concerning to the higher education sector. European Union flag in front of Big Ben (Photo: PA) \nBrexit threatens the university’s 1,200 EU students, its reputation in the wider world and its 600 EU staff. \nAlso at risk are the many millions the university has attracted in EU grants - guaranteed by the Government up to 2020 but not after that - but most important, Prof Day believes, are the Europe-wide research groups that have allowed Newcastle to make key breakthroughs in areas such as cancer and muscular dystrophy treatments. \n“How Brexit plays out in terms of movement of students and staff, our ability to play into those European networks, I think that’s going to be the key thing,” he said. \n“I don’t think that’s what Brexit was about. It was about Polish people taking jobs in Peterborough and Brussels supposedly making our laws. \n“But an unintended consequence of Brexit is that universities are stuffed in many of their core missions. So we’ve got to make sure that whatever a Brexit deal looks like that universities are as protected as they can be.” Like us on Facebook", "external_links": [], "published": "2017-01-08T20:00:00.000+02:00", "crawled": "2017-01-08T16:06:17.037+02:00", "highlightTitle": ""}