{"organizations": [], "uuid": "e0fda91449620642db3e5cc74bf13e1aeb0731ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12466634.ece/ALTERNATES/s1200/Dean-Turner-director-and-economist-at-UBS.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/households-poorer-2017-north-east-12466626", "country": "GB", "domain_rank": 21960, "title": "Households will be poorer in 2017 but North East businesses may thrive, says UBS", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Households will be poorer in 2017 but North East businesses may thrive, says UBS", "spam_score": 0.0, "site_type": "news", "published": "2017-01-17T20:57:00.000+02:00", "replies_count": 0, "uuid": "e0fda91449620642db3e5cc74bf13e1aeb0731ff"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/households-poorer-2017-north-east-12466626", "ord_in_thread": 0, "title": "Households will be poorer in 2017 but North East businesses may thrive, says UBS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Households will be poorer in 2017 but North East businesses may thrive, says UBS Brexit has caused inflation to reach a two-year high while wages remain flat Share Dean Turner, director and economist at UBS (Photo: Headland Consultancy) Share Get business   \nHouseholds across the country will be poorer in 2017 as prices outstrip pay rises for the first time in several years, a leading economist has said on a visit to the North East. \nInflation soared to its highest level in two-and-a-half years last month, as air fares rose and the plunge in the pound started to affect food prices. \nThe Office for National Statistics (ONS) said the Consumer Price Index (CPI) measure of inflation hit 1.6%, up from 1.2% in November and higher than the expected 1.4%. \nBut Dean Turner, economist and director at wealth management company UBS, said the slide in the pound would have a silver lining in the North East by boosting exporters. \nHe said: “The momentum going into this year is quite strong, from a global economic backdrop. Not withstanding, the one thing that does change is what happens to real income growth. That is to do with inflation and the pound being 20% weaker. \n“We have had, effectively, 0% inflation against a 2% wage growth for some time. That is a positive outcome to households. Aiden Dunstan, executive director at UBS's Newcastle office \n“Going into next year with prices rising, I expect that inflation might be 2.8%. It’s going to be at, or higher than, wage growth this year.” \nHe added: “Inflation is at a level we have not seen for some time.” \nMr Turner also warned that unemployment across the country may also rise as companies put hiring plans on hold while they assess the changes to the market brought on by Brexit negotiations. Read More Inflation hits two-and-a-half year high as food prices rise \nBut the situation were not all doom and gloom as many North East exporting businesses may increase sales, after the lower value of the pound caused their goods to become 20% cheaper, \nAiden Dunstan, executive director at UBS’s Newcastle office, said: “Of the business owners I spoke to, the majority wanted to remain in the EU . But after getting their heads around it they have rolled up their sleeves and got on with it. They said ‘let’s make the most of what we know. This isn’t going to stop us running our business’. \n“The North East exports more than we import so they are benefitting.” \nThe comments mirror advice given by the Entrepreneurs’ Forum in November, which told North East businesses that the best way to grow and create jobs was through exporting goods. Like us on Facebook", "external_links": [], "published": "2017-01-17T20:57:00.000+02:00", "crawled": "2017-01-17T16:27:19.894+02:00", "highlightTitle": ""}