{"organizations": [], "uuid": "f6fa3517ad542a2a0d613b7ca36c2e1269ae58bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12481835.ece/ALTERNATES/s1200/Trump-Speaks-At-Luncheon-At-Trump-International-Hotel.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trump-might-actually-better-12481755", "country": "GB", "domain_rank": 21960, "title": "Why Donald Trump might actually be a BETTER US President for Britain and America", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why Donald Trump might actually be a BETTER US President for Britain and America", "spam_score": 0.0, "site_type": "news", "published": "2017-01-20T20:00:00.000+02:00", "replies_count": 0, "uuid": "f6fa3517ad542a2a0d613b7ca36c2e1269ae58bc"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trump-might-actually-better-12481755", "ord_in_thread": 0, "title": "Why Donald Trump might actually be a BETTER US President for Britain and America", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "melania trump", "sentiment": "none"}, {"name": "donald j. trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "brexit  barack obama", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "washington dc  trump", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}], "organizations": [{"name": "america news why donald trump", "sentiment": "negative"}, {"name": "all trump", "sentiment": "none"}, {"name": "getty images north america", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why Donald Trump might actually be a BETTER US President for Britain and America Billionaire reality TV star Donald Trump is set to be inaugurated as the 45th president of the United States on Friday Share Click to play Tap to play The video will start in 8 Cancel Play now Trump's Inauguration - what actually will happen? Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDonald Trump will be given the keys to the Oval Office when when he is sworn in as the next US President. \nWhile many fear for the future of America - and indeed the world - following his inauguration, the could actually be some positives for Britain. \nWhat are the benefits to having the billionaire in the White House for Britain? 1. Brexit \nBarack Obama infamously said Britain would be at the “back of the queue” when it came to negotiating a trade deal after we leave the EU. \nThe noises from Trump have been more positive, with Republican leaders saying we will be at the front of the line. \nThe danger is we strike a deal which could allow US firms access to the NHS and flood the UK with cheap food imports. Donald J. Trump prior to being sworn in as the 45th president of the United States (Photo: Getty Images North America) 2. Republicans could help \nThere is a chance that once in office Trump could prove to be more restrained and pragmatic than his campaign appearances suggested. \nBut if that is not the case, then many will hope the Republicans on Capitol Hill will block his worst policies. 3. He might clean up Washington DC \nTrump has repeatedly vowed to “drain the swamp” and take on the Washington establishment. \nHe could follow through his promises by restricting the power of lobbyists, instituting a limit on how long you can serve in Congress and cutting federal budgets. But don’t hold your breath. Donald J. Trump and wife Melania Trump (Photo: Getty Images North America) 4. Maternity leave \nAll Trump’s campaign announcements should carry a health warning but he did promise six weeks of paid maternity leave for new mothers and a bigger tax credit to make child care more affordable. \nUnfortunately, it is just for women. New fathers will not get paternity leave and stay-at-home dads will not get help with childcare. Read More Donald Trump protest in Newcastle on Friday could see hundreds turn up 5. The stimulus might work \nThe tax cuts, massive infrastructure expenditure and pressure on US firms to create jobs in the US could boost the economy. \nPredictions his election would cause a rush on Wall Street have been proved wrong. \nBut his plans will add to the US debt mountain and in the long term could undermine the country’s economic stability. Read More", "external_links": [], "published": "2017-01-20T20:00:00.000+02:00", "crawled": "2017-01-20T15:17:22.604+02:00", "highlightTitle": ""}