{"organizations": [], "uuid": "e16be261ec94532e35253789e62ed0e322d32bca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9414622.ece/ALTERNATES/s1200/JS63894039.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-ceo-condemns-global-policy-12472375", "country": "GB", "domain_rank": 21960, "title": "Sage CEO condemns global policy makers for ignoring small businesses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Sage CEO condemns global policy makers for ignoring small businesses", "spam_score": 0.0, "site_type": "news", "published": "2017-01-18T20:57:00.000+02:00", "replies_count": 0, "uuid": "e16be261ec94532e35253789e62ed0e322d32bca"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-ceo-condemns-global-policy-12472375", "ord_in_thread": 0, "title": "Sage CEO condemns global policy makers for ignoring small businesses", "locations": [], "entities": {"persons": [{"name": "stephen kelly", "sentiment": "negative"}, {"name": "sage", "sentiment": "none"}, {"name": "jacqueline de rojas", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "northern europe", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "wef", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "newcastle technology giant sage", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Sage CEO condemns global policy makers for ignoring small businesses Stephen Kelly has criticised the Davos summit and said small businesses should be better represented on the world stage Share Stephen Kelly, chief executive of Sage Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe head of Newcastle technology giant Sage has condemned global business leaders for ignoring small businesses at the World Economic Forum (WEF) in Davos. \nAs political and business leaders meet with showbiz stars in the Swiss ski resort, Sage CEO Stephen Kelly called for small businesses, which create two-thirds of all jobs, to be better represented in major economic discussions. \nHis comments come after research carried out by Sage showed that only 27% of small businesses feel they are represented by politicians in their country’s decision making. \nThe FTSE 100 CEO said that it was “crazy” that 60% of small business owners did not know that the WEF was taking place this week. \nMr Kelly added: “Business builders are the heroes of the economy. They toil away long after the rest of us have gone home, making personal sacrifices to grow their businesses, to support their families and build their communities. The logo of the World Economic Forum (Photo: PA) \n“Policy makers and big business must wake up to the fact that these heroes need to be supported and given a voice, if we are to ensure the future health and prosperity of the world’s economy.” \nMr Kelly’s comments follow similar interventions on behalf of small businesses and start-ups, with the company - which provides accounting software to thousands of SMEs around the world - positioning itself as a champion for smaller firms. \nIn September he published a blog saying the UK should copy Romania in developing cities with superfast broadband, while he later called for the voice of small business over Brexit to be heard “across all four corners of the country”. \nJacqueline de Rojas, managing director for UK, Ireland and Northern Europe, said: “We welcome the Prime Minister’s ambition to make Britain a country that works for everyone. Read More Sage boss calls for Government action to boost small businesses \n“This vision for a shared society and the forthcoming Industrial Strategy must set the framework for championing the whole business community right across the UK and not just in our major cities and not just for our major companies. This will contribute to the productivity gap and enable an agile business economy for everyone so that we can better compete at home and overseas. \n“In the shadow of Brexit it is essential that the UK reinvents itself as a digital nation of significance. Investment in digital infrastructure and skills to power the competitiveness of our country’s business builders is fundamental in driving confidence, innovation and growth. \n“The Government cannot ignore the contribution of small businesses and entrepreneurship, with technology being their great enabler.” \nTo help small businesses connect with policy makers Sage is launching a Forum for Business Builders platform. The forum is designed bring together entrepreneurs from around the world to create a collective voice that can be heard on the world stage. Like us on Facebook", "external_links": [], "published": "2017-01-18T20:57:00.000+02:00", "crawled": "2017-01-18T16:21:27.118+02:00", "highlightTitle": ""}