{"organizations": [], "uuid": "aa7322fd60ef978d1e0b595c0d46a0b1481c2671", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30044543/15787963.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/company-car-man-8203-andy-perkins/story-30044543-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published COMPANY CAR MAN: ​Andy Perkins", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published COMPANY CAR MAN: ​Andy Perkins", "spam_score": 0.0, "site_type": "news", "published": "2017-01-10T16:53:00.000+02:00", "replies_count": 0, "uuid": "aa7322fd60ef978d1e0b595c0d46a0b1481c2671"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/company-car-man-8203-andy-perkins/story-30044543-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published COMPANY CAR MAN: ​Andy Perkins", "locations": [], "entities": {"persons": [{"name": "andy perkins andy perkins", "sentiment": "negative"}, {"name": "tompegden", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}], "locations": [{"name": "hinckley road", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}, {"name": "town hall", "sentiment": "none"}, {"name": "new walk museum", "sentiment": "none"}, {"name": "fosse park", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}], "organizations": [{"name": "csl business machines", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Andy Perkins is director of CSL Business Machines, in Hinckley Road, Leicester \nQ - What car do you drive and tell us your reasons for doing so? \nA - I drive a Range Rover Sport and I love it. It's comfortable, reliable and surprisingly quick. And it's not too bad on fuel consumption for a car that weighs nearly two and a half tons. \nQ - If you were Prime Minister, how would you deal with the Brexit issue? \nA - I would remove any weak links within my Cabinet and then engage with the media and the people of the country in a very positive manner. Brexit could divide or unite our country and we all have a part to play to make it the latter. We know that the media can control confidence to a degree which can slow down the economy or, on rare occasions, encourage and introduce positivity. In times of adversity history shows that Great Britain will rise to the challenge and perform well. \nQ - How big of a loss will Fenwick be when it closes in Leicester? \nA - I've been in the Fenwick store once. It's always sad to see a local landmark disappear but as I said I only visited the store once. Every business has a temporary monopoly for a period and it's credit to Fenwick that it has survived for 54 years in Leicester but alas our buying habits and styles have changed . I often felt that its location did not help – perhaps a Fenwick in Fosse Park would improve footfall and interest. \nQ - What are your top five buildings in the city and county and why? \nA - From an architectural point of view, it's easy to admire the Town Hall, the railway station, Guildhall, the prison and New Walk Museum as they are all steeped in history. If I had to pick a modern building that certainly catches my eye and blends in most impressively it would be Curve, which I think is stunning. \nQ - What do you think will be the positive and negative aspects of Donald Trump's election as US President? \nA - It's quite refreshing that ordinary people can change the course of history through the ballet box and this might be seen as a positive. If Trump can learn to compromise and negotiate with congress then he will earn respect. The worrying area would be his views on foreign policy and defence in what is a very fragile world. \nQ - A rude second hand bookshop owner admitted he was wrong to call a customer a \"pain in the arse\". What is the worst customer service you have ever had? \nA - Our company revolves and survives around providing excellent customer service so I am always critical of the service I receive elsewhere. The worst service recently would be from a company with a great product but terrible customer service – Virgin Media. \nQ - Do we live in a post-truth era? \nA - Deception has become commonplace at all levels of common life. It erodes the foundation of trust. If you repeat something often enough to people they will start to believe it. \nQ - Will Leicester residents be better or worse off at the end of 2017? \nA - 2016 was a surprising year for all of us and I think this year will again be full of surprises. I would personally predict a very successful year ahead.", "external_links": [], "published": "2017-01-10T16:53:00.000+02:00", "crawled": "2017-01-10T14:40:40.212+02:00", "highlightTitle": ""}