{"organizations": [], "uuid": "352a7042263111fa3cc7dcb07445e36a7a312a7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12433242.ece/ALTERNATES/s1200/Real-ale-pub-walks.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-uk-ditch-metric-measuring-12433144", "country": "GB", "domain_rank": 21960, "title": "Is Brexit UK about to ditch the metric measuring system - and could your pint glass change with it?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Is Brexit UK about to ditch the metric measuring system - and could your pint glass change with it?", "spam_score": 0.0, "site_type": "news", "published": "2017-01-10T23:23:00.000+02:00", "replies_count": 0, "uuid": "352a7042263111fa3cc7dcb07445e36a7a312a7e"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-uk-ditch-metric-measuring-12433144", "ord_in_thread": 0, "title": "Is Brexit UK about to ditch the metric measuring system - and could your pint glass change with it?", "locations": [], "entities": {"persons": [{"name": "neil herron", "sentiment": "none"}, {"name": "cairns", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "pol roger", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "steve thoburn", "sentiment": "none"}, {"name": "warwick cairns", "sentiment": "none"}], "locations": [{"name": "brexit uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "southwick", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "none"}, {"name": "bwma", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "berry bros", "sentiment": "none"}, {"name": "british weights and measures association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A pint is passed across a bar (Photo: PA) Share Get daily   \nThe metric system is set to take a pounding as the UK prepares to leave the European Union . \nWe could soon see goods sold in measures of pounds and ounces rather than kilograms and grams, if campaigners have their way. \nIt follows call for the return of the traditional Crown stamps on Britain’s pint glasses - a decade after they began to disappear in favour of an EU-wide “European Conformity” mark and which guaranteed a full pint. \nWarwick Cairns, of the British Weights and Measures Association (BWMA), said: “I think we’re in a position where people should be free to use whatever they think is best.” \nHe said the European mark on the pint glass, as well as making it an offence to sell loose goods in imperial weights, was one of the ways the EU alienated itself from the UK. Warwick Cairns \n“People were happy [with the Crown mark]. It was a familiar symbol which meant it was the pint they knew and were familiar with. \n“What difference did it make to Brussels whether it was on the glass or not?” \nMr Cairns added: “As a group, we don’t have a political view on anything other than weights and measures. We could understand why people felt messed around and that it was an unwarranted interference in their every day lives.” \nThe 1985 Weights and Measures Act stipulates that traders must use metric measurements - grams, kilograms, millilitres or litres - when selling packaged or loose goods in England, Scotland or Wales. There are different rules in Northern Ireland. \nThe only products you can sell in imperial measures are draught beer or cider by pint; milk in returnable containers by pint; precious metals by troy ounce. \nTraders can also display an imperial measurement alongside the metric measurement but it can’t stand out more than the metric measurement. Steve Thoburn, with Neil Herron behind \nIt was this law Sunderland trader Steve Thoburn fell foul of when he was prosecuted for selling bananas by the pound at his stall and shop in Southwick, Sunderland, in July 2000. \nSteve was eventually given a six-month conditional discharge after he was found guilty of breaching the Act. Read More What would be the difference between hard and soft Brexit? \nThe BWMA has received a number of inquiries from traders about switching back to imperial measurements since the Brexit . \nMr Cairns said: “There are some instances where metric is better or people have got used to metric measures and they should stay. \n“To give one example, my hobby is photography and I carry a lens measured in millimetres - it would be stupid to change that to inches.” \nAnd it seems many think it will be a matter of ‘when’ and not ‘if’ the metric laws will be changed. \nBerry Bros, which supplies wine to the Queen, is in talks with French champagne maker Pol Roger to produce a ‘pint bottle’ of fizz - a measurement preferred by Winston Churchill. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-01-10T23:23:00.000+02:00", "crawled": "2017-01-10T18:49:01.003+02:00", "highlightTitle": ""}