{"organizations": [], "uuid": "ba5fad1ab76dbe27148648becbf393c02b345704", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12432850.ece/ALTERNATES/s1200/CFR_NJL_100117adderstone_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-adderstone-groups-see-profits-12432662", "country": "GB", "domain_rank": 21960, "title": "Newcastle's Adderstone Groups see profits rise after year of delivering student developments", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle's Adderstone Groups see profits rise after year of delivering student developments", "spam_score": 0.0, "site_type": "news", "published": "2017-01-10T22:37:00.000+02:00", "replies_count": 0, "uuid": "ba5fad1ab76dbe27148648becbf393c02b345704"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-adderstone-groups-see-profits-12432662", "ord_in_thread": 0, "title": "Newcastle's Adderstone Groups see profits rise after year of delivering student developments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle's Adderstone Groups see profits rise after year of delivering student developments The property firm last year finished schemes including Stepney Yard and Union Studios, and more housing projects are planned Share Stepney Yard, which has been developed by Adderstone Group (Photo: Adderstone Group) Share Get business   Thank you for subscribing!   \nNewcastle property firm Adderstone Group saw profits rise 38% following a strong year which saw the business deliver a number of developments. \nThe Ouseburn-based business declared annual profits of £4.33m on the back of consolidated turnover of £35m in the year ended March 31 2015, figures the firm said highlighted continued growth. \nThe firm said its continues to re-invest profits generated into group activities and has acquired a number of significant assets for investment and redevelopment purposes during the period, activities the firm is forging ahead with despite unvertainty created following the vote to leave the EU. \nThe last 12 months have seen the company deliver a number of developments throughout the region including the 266 bed Stepney Yard student accommodation and the 42 bed Union Studios scheme, to add to its existing student accommodation development Union Square. \nGroup finance director John Armstrong, said: “The impressive results for the year have been achieved despite the uncertainties surrounding Brexit. \n“We are already forecasting further growth in 2017/18, demonstrating that the strategy of refocussing on our core development and investment specialisms is working. \n“In November 2016 alone, we secured planning for developments worth a gross development value of £70m. \n“As a privately owned group from the North East we are proud that we have the resources and capabilities to continue to bring investment and job creation to our home region.” A view inside the Stepney Yard student development by Adderstone Group \nAdderstone Group’s development team continue to work with city planners in relation to their Christon Park and North Shore proposals. \nChriston Park is an ambitious brownfield housing development on the site of the former Greggs bakery in Gosforth and North Shore is a 16 storey landmark apartment development on Newcastle Quayside. \nTaemar Ltd, formerly known as Adderstone Construction Ltd and a subsidiary of Adderstone Group, is also involved in constructing a number of supermarket projects with grocery giant Lidl. \nAdderstone is also working with Newcastle-based Ryder Architecture on plans to create a luxury 122-apartment scheme on the site known as Plot 12 on Newcastle Quayside, the last undeveloped site in that area. Read More Newcastle city centre's empty buildings: What's in store for the future? \nThe firm is proposing to build a stepped structure of five towers on the 1.5-acre site, varying between 10 and 16 floors. The proposals include 122, one to three-bedroom, glass fronted apartments, all with balconies and views over the Tyne. \nMeanwhile, outside the region, Adderstone Group is about to submit a planning application for a residential tower in Salford and has embarked on a luxury housing scheme in Bermondsey, London, which will be delivered before summer this year. Like us on Facebook", "external_links": [], "published": "2017-01-10T22:37:00.000+02:00", "crawled": "2017-01-10T18:24:28.977+02:00", "highlightTitle": ""}