{"organizations": [], "uuid": "74265c84e7f439aa2e2211c509b2a3a65f939aea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.liverpoolecho.co.uk/incoming/article12429535.ece/ALTERNATES/s1200/corbyn.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-wants-give-more-12461783", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn wants to give more power to the North - so what does Labour's vision involve?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Jeremy Corbyn wants to give more power to the North - so what does Labour's vision involve?", "spam_score": 0.0, "site_type": "news", "published": "2017-01-16T22:04:00.000+02:00", "replies_count": 0, "uuid": "74265c84e7f439aa2e2211c509b2a3a65f939aea"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-wants-give-more-12461783", "ord_in_thread": 0, "title": "Jeremy Corbyn wants to give more power to the North - so what does Labour's vision involve?", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "neutral"}, {"name": "trickett", "sentiment": "none"}, {"name": "tickett", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "henry viii", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "jon trickett", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "neutral"}, {"name": "the labour party", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "yorkshire creating a bank of the north", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "council of north", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "northern investment bank", "sentiment": "none"}, {"name": "fabian society", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jeremy Corbyn wants to give more power to the North Share this video Get daily   Thank you for subscribing!   \nThe North of England could get its own dedicated council and bank as part of a major shift in the way the country is being governed. \nLabour has announced a raft of measures it hopes to introduce if it wins the 2020 general election. \nA ‘Council of the North’ is one policy drawn up by leader Jeremy Corbyn and the Shadow Cabinet, with the concept expected to feature heavily in the party’s election manifesto. \nMr Corbyn highlighted some of the proposals and attacked a lack of funding for the North East in a speech delivered to the Fabian Society, while Local Government Secretary Jon Trickett provided more detail in a speech to council leaders and trade unionists. The party’s plans include: Creating a Council of the North bringing together elected mayors, councils and MPs from across the North East, North West and Yorkshire Creating a Bank of the North, working closely with the council, to provide funding for investment for local authorities and businesses Abolishing the existing House of Lords and creating an elected second chamber with members representing every region of the country. Labour says this would end the current unfair system in which the Lords is dominated by people based in the south Creating a Commission for the North in the run-up to the next election, to give people and organisations in the North a say in Labour’s manifesto plans Dealing with unfair funding arrangements which rob the North East of investment. Labour Party leader Jeremy Corbyn (Photo: Daily Mirror) \nMr Corbyn said: “Tory misrule has not only created a postcode lottery in health but in jobs and economic prosperity as well. \n“Since 2010, only 2% of new jobs have been created in the North East. \n“By 2021, the amount spent every year per person on transport infrastructure will reach £1,900 in London. In the North East it will be less than £300. \n“And you’ve only to look to our second chamber, the House of Lords to see how skewed it is to the South. Nearly half of all peers making decisions for our nations and regions are based in London and the South East.” \nAnd speaking on the BBC’s Andrew Marr show, he said Labour backed an elected second chamber “that is representative of all regions and nations of the United Kingdom”. \nMr Tickett said Labour would revive an institution created in 1460 - and abolished in the time of Henry VIII. \nHe said: “I believe that the time has come now to recompose a powerful Council of North to make sure our voice is heard.” \nLabour would “build a mighty Council of the North bringing elected mayors, councils and MPs together for the whole region to plan a better future for each one of us”, he said. \nAnd the planned Commission for the North would look at how funding is distributed across the UK. \nHe said: “I will be announcing in due course the setting up of a new Commission for the North to produce a concrete plan for creating the Council of the North and the Northern Investment Bank. \n“The Commission will also be charged with making proposals for Fiscal Devolution from Whitehall in order to ensure fair funding for all our public services and a fair share of the money repatriated from the EU when we get to the other side of Brexit. \n“It will also examine what extra powers and funding will be required for intervention in the regional economy.” Ian Lavery MP for Wansbeck \nMr Trickett said Labour would also examine its internal structures, to look at ways the North could be given a bigger voice within the party. \nWansbeck MP Ian Lavery said: “It’s been a long time coming from any political party to actually focus on these disparities. \n“Jeremy mentioned as an example the funding for transport. \n“These are things that have been raised. I have raised them from the floor of the House of Commons and so have colleagues from the North East. \n“It’s a step forward in recognition that the North East has been left behind and we will not tolerate that in the future. \n“The Labour Party has got it firmly in the agenda to restore some equality between the North East and the rest of the country, and that’s just right.” Like us on Facebook", "external_links": [], "published": "2017-01-16T22:04:00.000+02:00", "crawled": "2017-01-16T17:53:54.847+02:00", "highlightTitle": ""}