{"organizations": [], "uuid": "a1838b6c62d46b2f2c967106ba284640c29ae1ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12477788.ece/ALTERNATES/s1200/JS99659507.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-construction-property-thrive-12477666", "country": "GB", "domain_rank": 21960, "title": "North East construction and property to thrive in 2017, specialists predict", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East construction and property to thrive in 2017, specialists predict", "spam_score": 0.0, "site_type": "news", "published": "2017-01-19T20:23:00.000+02:00", "replies_count": 0, "uuid": "a1838b6c62d46b2f2c967106ba284640c29ae1ed"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-construction-property-thrive-12477666", "ord_in_thread": 0, "title": "North East construction and property to thrive in 2017, specialists predict", "locations": [], "entities": {"persons": [{"name": "giles taylor", "sentiment": "none"}, {"name": "michael dall", "sentiment": "none"}, {"name": "taylor", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ouseburn", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cobalt park", "sentiment": "none"}], "organizations": [{"name": "duke of york", "sentiment": "none"}, {"name": "igloo developments", "sentiment": "none"}, {"name": "adderstone group", "sentiment": "none"}, {"name": "robertsons construction", "sentiment": "none"}, {"name": "barbour abi", "sentiment": "none"}, {"name": "stepney yard and union studios", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "economic and construction market review", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "bellway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East construction and property to thrive in 2017, specialists predict Affordable housing and student accommodation are sectors set to shine this year, according to KPMG Share New homes in the North East (Photo: Bellway) Share Get business   Thank you for subscribing!   \nThe North East’s property and construction industry is set to thrive in 2017 despite facing a raft of challenges, KPMG has predicted. \nGiles Taylor, the accountancy giant’s northern head of property and construction , predicts great activity within the region in the year ahead, with affordable housing being the main driver. \nAnd Mr Taylor said student housing schemes will continue to crop up in Newcastle, joining a plethora of plans already granted permission and nearing completion. \nHe said: “Demand for affordable housing across the North East remains high. This, combined with low interest rates, makes for a bright outlook for the residential construction market in 2017. \n“Housebuilders are already exploring innovative building solutions to capitalise on this demand, with Igloo Developments’ residential construction project on reclaimed brownfield land on the banks of the Ouseburn being just one example. \n“We also expect developers to continue to take advantage of the high demand for student accommodation in Newcastle, following growing regional firms like Adderstone Group, which posted a 38% profit rise on the back of its completion of the Stepney Yard and Union Studios student housing schemes in 2016. The Clavering Place student accommodation in Newcastle which has been completed by Robertsons Construction \n“There is also a healthy pipeline of commercial developments across the region. A great example is the continuing expansion of Cobalt Park, just outside Newcastle. \n“We’ve seen a number of large organisations put down roots here in the last year, with the construction of more office space firmly on the cards for 2017. This bucks the national trend that has seen schemes put on hold as some corporates delay investment decisions pending clarity on Brexit.” \nWhile the pipeline is strong, however, Mr Taylor said challenges remain, including the skills gap. \nHe said: “The industry as a whole has suffered from an endemic skills shortage in recent years. Read More Duke of York praises North East business at Dragons' Den style pitching event \n“To tackle this in 2017, firms across the North East need to make a concerted effort to retain the talent being nurtured in our universities and offer attractive, long-term opportunities for young people. \n“Additionally, rising material costs, the fall in the value of sterling, and the political uncertainty throughout 2016 have all hit the construction sector hard in the past 12 months. \n“It’s important to remember that amidst this macro-economic uncertainty, the fundamentals of business still apply. \n“Demand remains high and contractors that look beyond political and economic instability, plan for the long-term and produce a high-quality product, with high-quality customer service will succeed.” Giles Taylor of KPMG (Photo: KPMG) \nMr Taylor’s comments come as results of the Economic and Construction Market Review from industry analysts Barbour ABI are published, showing that, after a year of unpredictability for the economy as a whole, overall contract value figures for the construction sector dropped by 5% to £70bn. \nHowever, the analysts said housebuilding continued to grow across the majority of the year, with total value of contracts at £23.6bn, a year-on-year increase of 11%. \nPlanning activity also increased in 2016 with the total value of projects reaching an advanced planning stage of £49.8nn, an increase of 19.2% from the value in 2015. \nInfrastructure deals also soared by 1.9%, reaching £19.3bn and the sector also had nine of the top 10 highest value construction contracts in 2016, including the £650m Tees renewable 295MW energy plant. Read More Union Rooms is sold in Newcastle: All you need to know \nFour construction sectors saw a decrease in contract value across 2016: industrial, medical and health, education, and commercial & retail, which saw the biggest drop over the year, decreasing by 32.6%. \nMichael Dall, lead economist at Barbour ABI, said: “It is clear from our yearly figures that the housebuilding sector was the main component of growth across 2016. \n“Even after the initial shock of the Brexit vote, where many housebuilders share prices fell in excess of 20%, this did not hamper activity with both the current and future pipelines of work remaining strong. \n“With important political decisions likely to come in 2017 that could have implications on construction activity, particularly in the commercial sector, it would seem that the future will be difficult to predict, as Britain’s trading position remains unclear for now.” Like us on Facebook", "external_links": [], "published": "2017-01-19T20:23:00.000+02:00", "crawled": "2017-01-19T16:15:19.364+02:00", "highlightTitle": ""}