{"organizations": [], "uuid": "f82a4bf9da24c9876577a30951248e871d98a236", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12416551.ece/ALTERNATES/s1200/Opening-Of-The-Silverstone-Wing.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/sport/other-sport/back-british-grand-prix-risk-12416554", "country": "GB", "domain_rank": 21960, "title": "Back the British Grand Prix or risk losing it - Damon Hill's appeal over Silverstone future", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Back the British Grand Prix or risk losing it - Damon Hill's appeal over Silverstone future", "spam_score": 0.0, "site_type": "news", "published": "2017-01-06T22:06:00.000+02:00", "replies_count": 0, "uuid": "f82a4bf9da24c9876577a30951248e871d98a236"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/sport/other-sport/back-british-grand-prix-risk-12416554", "ord_in_thread": 0, "title": "Back the British Grand Prix or risk losing it - Damon Hill's appeal over Silverstone future", "locations": [], "entities": {"persons": [{"name": "damon hill", "sentiment": "negative"}, {"name": "silverstone", "sentiment": "negative"}, {"name": "hill", "sentiment": "none"}, {"name": "grant", "sentiment": "none"}, {"name": "john grant", "sentiment": "none"}, {"name": "lewis hamilton", "sentiment": "none"}, {"name": "ecclestone", "sentiment": "none"}, {"name": "bernie ecclestone", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "silverstone", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "monza", "sentiment": "none"}], "organizations": [{"name": "silverstone circuit", "sentiment": "negative"}, {"name": "press association sport", "sentiment": "none"}, {"name": "national lottery", "sentiment": "none"}, {"name": "brdc", "sentiment": "none"}, {"name": "formula one management", "sentiment": "none"}, {"name": "northamptonshire", "sentiment": "none"}, {"name": "liberty media", "sentiment": "none"}, {"name": "british racing drivers’ club", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Silverstone Circuit, (Photo: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe man who brokered the last deal to save the British Grand Prix has called on the UK Government to back the event financially or risk losing one of the country’s best “shop windows”. \nFormer Formula One world champion Damon Hill was president of the British Racing Drivers’ Club (BRDC) in 2009 when it signed a 17-year deal to keep the race at its long-standing home, Silverstone. \nThe Northamptonshire venue is owned and run by the BRDC but current chairman John Grant has issued a stark warning that the club may have to break the contract because if feels the fee it pays F1 for the right to host the race is too high. \nIn a letter to BRDC members, Grant wrote: “Your board would like to preserve the British Grand Prix at Silverstone for many years to come but only if it makes sense to do so. We have to protect our club against the potentially ruinous risk of a couple of bad years. \n“Without some change in the economic equation, the risk and return are out of kilter, and so we are exploring various ways in which this might be altered. \n“Among other alternatives, the board is considering whether we should give notice before the 2017 British Grand Prix (as required) of our intention to exercise the break clause in the contract at the end of 2019.” \nFor Hill, who was BRDC president during the last major dispute between Silverstone and F1 boss Bernie Ecclestone, first among those alternatives must be a big effort to persuade the Government to support one of the highlights of the British sporting summer, as happens with almost every other circuit on the F1 calendar and numerous other sports events in the UK. \nSpeaking to Press Association Sport, Hill said: “This is a much-loved national event but, for whatever reason, it has always been very difficult to get additional funding from government. \n“Maybe now is the time to look at the British Grand Prix in the context of what is happening elsewhere and realise that it is an extremely good shop window for waving our banner and pointing to our brilliance in this field. \n“When you think about post-Brexit Britain, you must wonder if this is exactly the type of thing we need to invest in to show off what we can do.” \nThat is a reference to the fact Silverstone is not only one of the best-attended, fastest and most historic venues in F1, but is also effectively the home track for most of the teams, as motorsport is a rare example of a British industry that is truly world-leading. \nHill explained that previous discussions with central government have resulted only in words of encouragement, although there has been some financial support from local government and the National Lottery has backed Silverstone’s plans for a new museum. \nBut the 56-year-old Englishman described the deal with Ecclestone’s Formula One Management company as “very marginal” in terms of profit, particularly as the hosting fee goes up by five per cent every year - from £12 million in 2010, to £17 million this year and £26 million in 2026. \nHill said the BRDC “effectively gambles every year” on being able to sell enough tickets to cover its costs, as most of the other revenue streams are controlled by F1. \nThat leaves the venue’s owners dependent on Lewis Hamilton’s continued success to stoke up domestic interest and even that has not stopped Silverstone’s holding company from posting losses in recent years. \n“We have been here before but I am genuinely concerned because John Grant would not say this if this wasn’t the reality of the situation,” said Hill. \n“The BRDC behaves like a charity as any money it makes on the race gets poured back into the sport - it cannot be expected to jeopardise its position.” \nThe 1996 world champion, however, is not entirely without hope as F1’s sale to Liberty Media does open the possibility of a renegotiation. \nThe US conglomerate is expected to complete its takeover from Ecclestone in the coming months and Hill said “it gets” the importance of iconic race venues such as Monaco, Monza and Silverstone in terms of global exposure. Like us on Facebook", "external_links": [], "published": "2017-01-06T22:06:00.000+02:00", "crawled": "2017-01-06T17:18:09.925+02:00", "highlightTitle": ""}