{"organizations": [], "uuid": "a67ca91b5ee4863c7b58e7d830a82024bc0d1f8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12430249.ece/ALTERNATES/s1200/Online-guilty-pleas-warning.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12446978", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Government mulls overhaul of fraud laws", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Government mulls overhaul of fraud laws", "spam_score": 0.0, "site_type": "news", "published": "2017-01-13T15:00:00.000+02:00", "replies_count": 0, "uuid": "a67ca91b5ee4863c7b58e7d830a82024bc0d1f8f"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12446978", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Government mulls overhaul of fraud laws", "locations": [], "entities": {"persons": [{"name": "jonathon manning thompsons", "sentiment": "negative"}, {"name": "david attenborough", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}, {"name": "joy-con", "sentiment": "none"}, {"name": "ewan venters", "sentiment": "none"}, {"name": "iain scott", "sentiment": "none"}, {"name": "john thompson", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "mason", "sentiment": "none"}, {"name": "prudhoe", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}, {"name": "sweco", "sentiment": "none"}, {"name": "venters", "sentiment": "none"}, {"name": "alison platt", "sentiment": "none"}, {"name": "thompsons", "sentiment": "none"}, {"name": "jonathon manning nintendo", "sentiment": "none"}, {"name": "tatsumi kimishima", "sentiment": "none"}], "locations": [{"name": "prudhoe", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "stockfield", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "rothera", "sentiment": "none"}, {"name": "antarctic", "sentiment": "none"}, {"name": "adelaide island", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "antarctic peninsula", "sentiment": "none"}, {"name": "antarctica", "sentiment": "none"}, {"name": "sweco", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "worldpay", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "prudhoe holding ltd", "sentiment": "none"}, {"name": "countrywide", "sentiment": "none"}, {"name": "natural environment research council", "sentiment": "none"}, {"name": "fortnum", "sentiment": "none"}, {"name": "sweco", "sentiment": "none"}, {"name": "nerc", "sentiment": "none"}, {"name": "fortnum & mason", "sentiment": "none"}, {"name": "wii u", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "antarctic survey", "sentiment": "none"}, {"name": "nintendo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Thompsons of Prudhoe breaks through £2m profit mark during strong year \nConstruction specialist Thompsons of Prudhoe enjoyed a strong year after profits at the earthworks and quarry company broke through the £2m mark. \nThe family business started life in 1948 as a small husband-and-wife partnership but has now grown into a group of companies employing 260 people. \nLatest accounts for Thompsons of Prudhoe Holding Ltd, for the year ended March 31 2016, show the profit for the financial year grew by 22% to reach £2.02m on sales of £29.7m, which had increased by 6.7%. \nJohn Thompson, director at the company, said in the financial statement accompanying the accounts: \nThe directors have considered the performance of the business during the financial year and are content with the continued progress that has been achieved. \nThe cash position of the group is managed by a bank overdraft facility provided to the group. At the year end the cash position of the group was £1.8m. \nDuring the year a bank loan of £1.05m was provided to assist with the acquisition of farm land, part of which is currently operated by the group an inert landfill site and quarry.” \nThe five-year bank loan was taken out to purchase the Merryshields farm in Stockfield. The facility will see the firm repay £7,124 per month at a total cost of nearly £430,000. \nAt the end of the year the company’s loan account had a balance of £1,012,500. Thompsons of Prudhoe's profit broke through the £2 million mark (Photo: Handout) 8:44 Jonathon Manning Nintendo gives date for new console launch \nNintendo’s new Switch console, which alternates between a home and mobile gaming system, will go on sale in the UK on March 3, the gaming giant has said. \nRevealed at the end of 2016, the Switch is Nintendo’s first home video games console since the Wii U. However a small portable screen can be removed from the main hub and connected to the device’s modular Joy-Con controllers to create a mobile, handheld gaming device. \nNintendo’s last major product, the Wii U, sold considerably less units than the Playstation 4 and Xbox One. By June 2016 the Wii U had sold 13.1m units while the Xbox One and Playstation 4 had sold 21.11m and 40.75m units respectively. \nThe system will be priced at £279.99 in the UK, Nintendo confirmed. \nNintendo president said Tatsumi Kimishima: \nNintendo Switch is a brand-new kind of home gaming system that offers a wide variety of play modes. \nWe will introduce the world to new experiences made possible by the unique characteristics of the Nintendo Switch hardware and the Joy-Con. \nThe modular controller has the ability to split into two and each be used by one player to create a local multi-player set-up, with the mobile screen used by both players. \nThe Joy-Con controllers will also include a touchpoint for amiibo figures - figures which can be added to games when triggered by the touchpoint - while it will also house an infrared motion camera that can be used to detect objects in certain games. For example Nintendo said it can be used to detect a player’s hand for a virtual game of rock, paper, scissors. A model puts the controller on to the Nintendo Switch during a presentation event of the new Nintendo Switch in Tokyo 8:35 KEY EVENT £100m Antarctica deal for Gateshead engineers Sweco to help modernise research facilities \nNorth East engineers have won a lucrative deal to work on a £100m project to modernise the UK’s Antarctic research facilities. \nGateshead-based engineering, environmental and design consultancy Sweco has teamed up with BAM in the exciting 10-year programme to breathe new life into the vital research centres, 9,000 miles away on the Antarctic Peninsula. \nThe two firms have been appointed to the British Antarctic Survey (BAS) Construction Partner framework which will see them provide design and construction services for the modernisation of the facilities on Adelaide Island, home to BAS’s labs, offices and workshops, alongside a crushed rock runway, hangar and wharf. \nAnd one of the Sweco’s first jobs is to overhaul the wharf to make room for the RRS Sir David Attenborough research vessel – the ship that the public originally wanted to be called RSS Boaty McBoatface in the non-binding online vote. \nThe £100m programme, commissioned by the Natural Environment Research Council (NERC), will unfold over the next ten years as part of a mission to make sure British scientists can continue much-needed research into major issues facing the planet. \nIain Scott, Sweco’s director of transportation, said: \nWe are extremely pleased to be BAM Nuttall’s design partner on this BAS project to modernise its research facilities. We look forward to applying our cold climate design and construction expertise on such a high profile project. \nEach stage of the modernisation work over the coming years will pose a number of significant challenges and will require a diverse range of skills, including civil and structural engineering, building services, energy and environment sectors. An aerial view of Rothera in Antarctica, where Gateshead engineers Sweco will soon be working on a £100m project (Photo: Sweco) 8:27 Jonathon Manning Luxury foods help Fortnum & Mason ring up 16% rise in festive sales \nSales at upmarket retailer Fortnum & Mason soared over Christmas, driven by a sharp increase in online orders. \nLuxury purchases such as caviar, hand-carved smoked salmon and white truffles helped Fortnum book a 16% rise in like-for-like sales in the five weeks to January 1. \nOnline sales grew 22%, peaking on December 12, and made up 34% of all Fortnum’s sales over the festive period. Fortnum recently began selling its luxury food items in a number of Fenwick department stores, including the one on Northumberland Street in Newcastle . \nThe company’s flagship store in London’s Piccadilly saw footfall increase by 10% and, on the Saturday before Christmas, a record 27,000 customers flocked through its doors. \nBoss Ewan Venters said: \nAt the end of a year of great financial uncertainty and upheaval, these are very encouraging results. \nOur excellent Christmas performance is a reflection on the improvements we have made in our offering across online and our range of stores, and is testament to the enduring appeal of great products and impeccable service. \nAt a challenging time for all retailers, we have shown that a quality experience is still highly attractive to customers around the world. \nNew figures from Worldpay on Friday show that “Brexit tourists” cashing in on the battered pound injected some much-needed Christmas cheer into the British high street with a “massive” surge in spending. \nLast year Mr Venters warned that prices will begin to rise in 2017 year as a result of the collapse in sterling, stating that there is “no avoiding” shop price inflation and rising costs. Fortnum and Mason comes to Fenwick in Newcastle 8:23 KEY EVENT Countrywide's revenue falls amid 'challenging sales market' \nCountrywide saw revenue dip in the final quarter of 2016 as Brexit jitters and changes to stamp duty continue to hit the property market. \nThe UK’s biggest listed estate agency said income fell over 8% to £179m in the fourth quarter, while for the year it was broadly flat at £737m. \nThe group said: \nThe level of market transactions in the fourth quarter continued to run below 2015 and we continue to expect full year 2016 market volumes to reflect a drop of circa 6% on 2015 levels. \nIn November Countrywide warned profits will come in at the “lower end of market expectations”, pinning the blame on changes in stamp duty and the EU referendum. \nOn Friday boss Alison Platt said: \nIt is pleasing to report modest full year revenue growth against the backdrop of a challenging residential sales market. \nWe continue to focus on delivering cost and productivity efficiencies across our business which will mitigate the impact of a 2017 sales market which is expected to show a reduction on 2016 volumes. \nCountrywide is also mulling the potential sale of its commercial property consulting business. Estate agent Countrywide saw its revenue dip (Photo: PA) 8:17", "external_links": [], "published": "2017-01-13T15:00:00.000+02:00", "crawled": "2017-01-13T11:05:24.160+02:00", "highlightTitle": ""}