{"organizations": [], "uuid": "434e02db01fe3aa5116ac718499fba5122cca7de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12509311.ece/ALTERNATES/s1200/JS110041986.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-tech-sector-provides-12509234", "country": "GB", "domain_rank": 21960, "title": "The North East tech sector provides the ideal arena for talented female entrants", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The North East tech sector provides the ideal arena for talented female entrants", "spam_score": 0.0, "site_type": "news", "published": "2017-01-27T15:00:00.000+02:00", "replies_count": 0, "uuid": "434e02db01fe3aa5116ac718499fba5122cca7de"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-tech-sector-provides-12509234", "ord_in_thread": 0, "title": "The North East tech sector provides the ideal arena for talented female entrants", "locations": [], "entities": {"persons": [{"name": "mark lane", "sentiment": "positive"}, {"name": "alice hall", "sentiment": "none"}, {"name": "de rojas", "sentiment": "none"}, {"name": "grant thornton", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "de rojas", "sentiment": "none"}, {"name": "jacqueline de rojas", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "northern europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "atlas cloud", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "debrett", "sentiment": "none"}, {"name": "invalid email  tech", "sentiment": "none"}, {"name": "right move plc", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "citrix", "sentiment": "none"}, {"name": "computer weekly", "sentiment": "none"}, {"name": "mckinsey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business The North East tech sector provides the ideal arena for talented female entrants Mark Lane discusses issues of diversity with Sage's managing director UKI - Northern Europe, Jacqueline de Rojas and discovers a sector full of opportunity Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nTech is a huge opportunity for the UK. \nWith potential to become a global player in the post-Brexit world, the time is now to make sure that the UK economy has a strong digital heartbeat. That opportunity is particularly important for the North East where a sizeable tech industry has grown over the last 15 years. \nWith opportunity comes challenge, and the information technology industry in the UK has an elephant in the room. While not quite a ticking time-bomb, the lack of skilled people with coding and software engineering skills is a huge challenge which is becoming increasingly pronounced as the UK becomes a more tech-focused economy . \nWe’ve also seen this issue in the North East. While Newcastle has reinvented itself as a tech hub in recent years, this metamorphosis has led to a situation where too many tech businesses are chasing too few staff – certainly at the highly-skilled, highly-specialised sharp end of the industry. \nWhile part of this problem is one of basic supply and demand – which is squeezing wages up in the tech sector – there is also another story. Walk into any tech business and, even as a casual observer, you will notice that there is a very clear demographic at play. Employees are young, white – and overwhelmingly male. This last detail is the most important point. I wasn’t quite aware how male-dominated the tech industry in the UK actually is but Jacqueline de Rojas of Sage – the UK’s largest listed tech company – soon put me right, informing me that across the UK, only around 16% of tech company employees are female. \nThis seems an extraordinary low number, and a monumental waste of creative talent (and this is key because at the real smart end of technology development, creativity is what differentiates the best from the rest). \nInterestingly, that same figure for Sage is 48% , a reflection of the fact that the company takes such issues seriously, and has done for a long time. Read More Six North East companies named among UK's best apprenticeship employers \nDe Rojas, who last year took up the position of Sage’s managing director UKI - Northern Europe, focused on the Newcastle-headquartered company’s UK and Ireland business, tells me a fascinating story about how tweaking the wording of a job description can have a huge impact in terms of the types of applicants attracted. \nShe says: “Part of what we do at Sage is shift perceptions. If you want more diversity you have to do something quite meaningful, but small changes make a difference too. For example, when we put out a job for a software engineer we call it a problem solver - as that is what it is. \n“That simple change in language can do a lot for diversity. Many of us are problem solvers in our daily lives or use the skills which are core to coding. Such as mums who are looking to return to work or school-leavers with a passion for technology and figuring things out. These can be untapped areas. \n“At Sage, we’re all about the entrepreneurs and business builders who use our products and solutions. The same perception shift applies. We want to make business processes and accounting software more useful for them. More intuitive, more automated, so we can help them save time and concentrate on the important things like running their businesses and spending time with their families. \n“And from a diversity point of view, we’re seeing more women entrepreneurs and start-ups which is really encouraging.” \nDiversity is an issue which is close to the heart of de Rojas. For example, as well as being president of techUK – the UK body representing tech companies and technologies – she is also the organisation’s board champion for women. \nYet diversity for diversity’s sake is not what she is about – far from it. Talking to her, it becomes clear that her vision of a more diverse UK workplace is one that is borne of pragmatism. Does a more diverse workforce make for a more profitable business which is less likely to fail? Yes it will, according to de Rojas – and she quickly points to research which backs this up. Read More Pink Boutique entrepreneur Alice Hall launches furniture venture with husband \nShe quotes Grant Thornton research which found that publicly-traded companies with male-only executive directors missed out on £430bn of investment returns last year. Meanwhile, McKinsey research found that companies in the top quartile for gender diversity are 15% more likely to have financial returns above their respective national industry medians. \nThere are many more such studies, and their findings should come as no surprise. \nBut could the UK be doing more to ensure that more women take up positions on boards with listed businesses? “I think we have certainly seen a rise in the number of women on boards in the past five years or so,” de Rojas says. “Where we need to make a difference is executive boards – the managing director level downwards. Research has shown that having just one woman on the executive board reduces the risk of bankruptcy by 20%.” \nThis is an astonishing statistic, and it is one of many which leaves de Rojas in no doubt at all. “Diversity leads to better decision making and you reach those decisions faster,” she says. \nBut why is this the case? This is a tough question, and one which is more likely to be answered by observing diverse teams in action compared to their all-male counterparts. In short, more qualitative research is needed on this issue. \nIn discussing this, de Rojas offers an interesting anecdote from her own career. She was sat in the boardroom of a large listed business. The chair of the business was concerned with the way things were going and suggested shareholders were not happy with the salary of the chief executive given the current business performance. \nThe chair proposed calling the CEO in and demanding he take an instant 10% pay cut. “This was the emotional reaction versus the rational one and I have seen it so often,” she tells me. \n“I suggested we asked the CEO the question in a slightly different, less confrontational way. I approached him gently to outline the challenge and he suggested that he was going to take a pay cut. This was the female-led context versus the alpha male demand - and that is diversity right there.” \nIt could be claimed that this inclination towards diplomacy is not unique to females in the workplace but that’s not really the point being made here. The broader point is one of men and women sometimes bringing different skills in different contexts and approaching different problems in different ways – to the benefit of business as a whole. \nI end our interview by asking de Rojas whether she would concur that there has never been a better time to be a woman in business? Choosing her words carefully, she tells me: “Yes. But I have to say it is not just about being a woman as any old woman will not do. It is a great time to be a woman in business if you are prepared to work hard. \n“This is also a great time to be a woman in the tech sector. A sector with innovation, excitement and opportunity. In the North East, salaries in the technology sector are increasing by 56% more than any other sector. Is this our time? Absolutely – there has never been a better time to seize the opportunity.” Read More Tech giant Sage links up with fellow Newcastle firm Atlas Cloud on product \nPROFILE: Jacqueline de Rojas \nA tech expert recognised as the most influential woman on the UK’s IT scene, Jacqueline de Rojas was last year appointed by Sage to lead its business across Northern Europe. \nHer job entails responsibility for continuing Sage’s transformation drive, generating recurring revenue growth and boosting software subscription revenues working with the company’s SME customers. \nDe Rojas, who has more than 25 years of operational experience in the software industry, joined Sage from Citrix, where she led the Northern European business as general manager and area VP. Previously, she held executive roles at global enterprise software companies, where she was responsible for customer facing-businesses driving revenues, aligning with key partners and growing market share. \nIn 2016 and 2015, de Rojas was named by Computer Weekly as the most influential woman in UK IT, and last year made Debrett’s list of 500 people of influence in social media and digital. \nShe holds several board and advisory positions and is a non-executive director on the board of Right Move plc. Like us on Facebook", "external_links": [], "published": "2017-01-27T15:00:00.000+02:00", "crawled": "2017-01-27T10:25:49.760+02:00", "highlightTitle": ""}