{"organizations": [], "uuid": "e302ecc1b94c657bf5f78b803f85d331f4ee1216", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30052584/15794660.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/council-labour-group-leader-quits-party-over-worry-that-jeremy-corbyn-is-unelectable/story-30052584-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Council Labour group leader quits party over fear that Jeremy Corbyn is unelectable | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Council Labour group leader quits party over fear that Jeremy Corbyn is unelectable | Leicester Mercury", "spam_score": 0.458, "site_type": "news", "published": "2017-01-12T17:55:00.000+02:00", "replies_count": 0, "uuid": "e302ecc1b94c657bf5f78b803f85d331f4ee1216"}, "author": "", "url": "http://www.leicestermercury.co.uk/council-labour-group-leader-quits-party-over-worry-that-jeremy-corbyn-is-unelectable/story-30052584-detail/story.html", "ord_in_thread": 0, "title": "Council Labour group leader quits party over fear that Jeremy Corbyn is unelectable | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "john legrys", "sentiment": "none"}, {"name": "sue mckendrick", "sentiment": "none"}, {"name": "terri eynon", "sentiment": "none"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "coun mckendrick", "sentiment": "none"}, {"name": "nick rushton", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "labour north west leicestershire", "sentiment": "none"}, {"name": "blackfordby", "sentiment": "none"}], "organizations": [{"name": "council labour", "sentiment": "negative"}, {"name": "leicester mercury council labour", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "comments shares council labour", "sentiment": "none"}, {"name": "coalville corbynistas", "sentiment": "none"}, {"name": "north west leicestershire tory", "sentiment": "none"}, {"name": "north west leicestershire district council's labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Council Labour group leader quits party over fear that Jeremy Corbyn is unelectable By danjmartin | Posted: January 12, 2017 0 COMMENTS SHARES Council Labour group leader quits party over fear that Jeremy Corbyn is unelecta... X \nCopy link to paste in your message / Comments (0) \nThe leader of North West Leicestershire District Council's Labour group has quit the party, saying she cannot support Jeremy Corbyn. \nCouncillor Sue McKendrick stepped down as leader of the 10-strong opposition group on Tuesday, the day Mr Corbyn made his high-profile \"relaunch\" with announcements on immigration and pay caps. \nCoun McKendrick, who will continue to sit as an independent member for the Blackfordby ward, said: \"I did stand down that day, but I had been thinking about it for some time. \n\"I have been finding that as leader of the Labour group on the council, I was finding it hard to maintain the national party line. \n\"I feel Jeremy Corbyn has not been clear about what he has been asking of us. \n\"On Brexit, I and others were out campaigning hard to remain, but it was hard to relay that to the voter when Jeremy Corbyn's position on the issue was unclear. \n\"He did have quite a lot of support on the doorstep, but many people were saying while he was leader they simply wouldn't vote Labour and that saddened me. \n\"It's him as an electable leader that worries me. \n\"I know he has strong grassroots support in the party – even though there are plenty of members that don't back him – but I don't think it's enough to get the Tories out.\" \nCoun McKendrick became leader of the council's Labour group last year. \nRead more: Uncertainty over future of 11 Leicester city centre buildings due to council cuts \nShe joined Labour in 2014 and was elected the following year. \nShe said she had not yet decided whether she would seek re-election in 2019, but had not considered crossing the floor to join another party. \nShe said: \"I feel I have made the right decision for me. As leader, it was my job to make sure everybody followed the party policy but I was becoming increasingly unhappy and unmotivated. \n\"The phone now rings less often and the e-mails have stopped, but I feel I will be able to represent the people in my ward more freely as an independent. \n\"I have had some supportive messages, but I am not foolish enough to think there won't be some adverse comments.\" \nDeputy group leader John Legrys has stepped up fill the gap on an interim basis until the annual general meeting after May's county council elections. \nLabour North West Leicestershire district councillor Dr Terri Eynon is disappointed by her former colleague's decision. \nShe said: \"Sue is someone I have a huge amount of personal respect for and I am sure she did not take the decision lightly. \n\"Leading the Labour group can be difficult. \n\"We are grateful she took an important role in the Labour team.\" \nTory district council cabinet member Councillor Nick Rushton said: \"I understand she couldn't get on with all the Coalville Corbynistas. \n\"Labour is losing its sensible, moderate people.\" \nNorth West Leicestershire Tory MP Andrew Bridgen said: \"This is just more evidence of Labour's meltdown in North West. They can't hang on to their leaders. \n\"It's yet more evidence they cant be trusted with power, locally or nationally.\" ", "external_links": [], "published": "2017-01-12T17:55:00.000+02:00", "crawled": "2017-01-12T15:55:03.233+02:00", "highlightTitle": ""}