{"organizations": [], "uuid": "3f8aeaa85f96f67e2fc5e8f1d15564f5f6f0dec1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11919631.ece/ALTERNATES/s1200/JS100289332.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/small-businesses-add-pressure-theresa-12500513", "country": "GB", "domain_rank": 21960, "title": "Small businesses add to pressure on Theresa May over single market access", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Small businesses add to pressure on Theresa May over single market access", "spam_score": 0.0, "site_type": "news", "published": "2017-01-25T07:01:00.000+02:00", "replies_count": 0, "uuid": "3f8aeaa85f96f67e2fc5e8f1d15564f5f6f0dec1"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/small-businesses-add-pressure-theresa-12500513", "ord_in_thread": 0, "title": "Small businesses add to pressure on Theresa May over single market access", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "cherry", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "federation of small businesses", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Small businesses add to pressure on Theresa May over single market access A survey by the Federation of Small Businesses says almost a third of its exporting members fear a drop in trade Share Mike Cherry, chair of the Federation of Small Businesses Share Get business   Thank you for subscribing!   \nTheresa May is facing renewed calls from business leaders to ensure the greatest possible access to the European single market after Brexit. \nA survey by the Federation of Small Businesses (FSB) found almost a third of its members involved in exporting feared their overseas sales would fall as a result of the decision to leave the EU. \nOf the 1,758 members who responded to the survey, 32% were engaged in overseas trade - either as exporters or importers - with the vast majority involved in trade with the single market. \nAs a result of Brexit , 29% of exporters said they expected a decline in the level of exports - as against 20% who expected to see an increase. \nAmong importers, 31% said they expected a decrease in their overseas trade compared with 7% who were predicting an increase. \nFSB national chairman Mike Cherry said: “Small business exports have been on the rise since the referendum with the lower value of the pound making UK goods and services more competitive. \n“As the UK leaves the single market any new agreement must maintain the current ease of trade with the EU and not lead to additional administrative or financial burdens. \n“For a truly global Britain, we need the Government to enhance specific support for small exporters to reach new customers and to negotiate ambitious UK-specific trade deals with large and emerging markets.” \nThe FSB report also highlights the importance of foreign workers to small businesses, with one firm saying it would have to close down if it wasn’t able to employ skilled workers from abroad. \nOne in five (21%) small business employers employ non-UK EU citizens, the FSB report says, with the majority of these employees already residing in the UK with the right to work here. \nAlmost half (47%) of small businesses that employ EU citizens predominantly rely on mid-skilled workers, such as mechanics or care workers. \nMr Cherry said: “FSB research clearly shows the importance small businesses place on being able to access the skills and labour they require, particularly mid-skilled workers, who are non-UK EU citizens recruited here in the UK. \n“Mid-level skills are vital for small firms, and businesses call for the right to remain for those EU citizens in the workforce here. The design of any future immigration system must ensure demand can be met, twinned with a supply-side focus on improving UK education and skills. \n“Equally, continuing to attract the very best high-skilled international talent is essential for small businesses operating in sectors such as digital and tech.” \nThe FSB has emerged as one of the more influential business groups since the EU referendum , where it retained a neutral stance. Prime Minister Theresa May invited the FSB it to her first meeting at Downing Street on taking office. Read More", "external_links": [], "published": "2017-01-25T07:01:00.000+02:00", "crawled": "2017-01-25T02:39:48.888+02:00", "highlightTitle": ""}