{"organizations": [], "uuid": "99524accba8e01f8eeffa7a9931ff52a91a13693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12351697.ece/ALTERNATES/s1200/GWR_-NJL_201216gardenvill_04.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/ponteland-garden-village-plan-still-12395149", "country": "GB", "domain_rank": 21960, "title": "Ponteland garden village plan 'still on' despite not being on Government list", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Ponteland garden village plan 'still on' despite not being on Government list", "spam_score": 0.0, "site_type": "news", "published": "2017-01-02T23:21:00.000+02:00", "replies_count": 0, "uuid": "99524accba8e01f8eeffa7a9931ff52a91a13693"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/ponteland-garden-village-plan-still-12395149", "ord_in_thread": 0, "title": "Ponteland garden village plan 'still on' despite not being on Government list", "locations": [], "entities": {"persons": [{"name": "peter jackson", "sentiment": "none"}, {"name": "gavin barwell", "sentiment": "none"}, {"name": "richard robson", "sentiment": "none"}, {"name": "harlow", "sentiment": "none"}], "locations": [{"name": "ponteland garden", "sentiment": "none"}, {"name": "taunton", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "aylesbury", "sentiment": "none"}, {"name": "lugano", "sentiment": "none"}, {"name": "dissington", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "gilston", "sentiment": "none"}, {"name": "ponteland", "sentiment": "none"}, {"name": "carlisle", "sentiment": "none"}, {"name": "dissington garden village", "sentiment": "none"}], "organizations": [{"name": "dissington", "sentiment": "none"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "trevor walker photography", "sentiment": "none"}, {"name": "department for communities and local government", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ponteland garden village plan 'still on' despite not being on Government list Developers behind proposals for 2,000 homes at Dissington, Northumberland, are hoping for approval next year Share Aerial view of site for Dissington Garden Village (Photo: Trevor Walker Photography) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDevelopers behind a controversial bid to build 2,000 homes in the North East countryside say their plans will continue despite not being on a list of Government-approved garden villages. \nNewcastle firm Lugano wants to build houses and other facilities on the Dissington estate near Ponteland but faces strenuous opposition in the local area from people who say that the village cannot cope with the massive increase in population the new homes would bring. \nThe firm has submitted an expression of interest to the Government to become on the new “garden villages” that Ministers want to see built to increase the amount of new housing in the UK. \nThe scheme has not been included on the Government’s list of 14 garden villages, but the Government says Lugano’s bid still has a chance of success and could be considered later this year. Read More Brexit makes North East an attractive place to do business, says EY senior partner \nA spokesman for the Department for Communities and Local Government said it had received a high number of applications to become garden villages and a second round of approvals could be made in 2017. \nLugano chairman Richard Robson said: “We were not expecting Dissington to be included in this first announcement because we need to be a little further on in relation to the planning process but we are in engaged in a very positive dialogue with the Department of Communities and Local Government and are confident that the Dissington Garden Village proposals will be included in a subsequent announcement.” \nLugano applied for outline planning permission for the development shortly before Christmas, saying it wants to build 2,000 homes, 600 of them affordable, along with education, leisure, medical, retail and employment facilities. \nIt said the development would also include a new relief road bypassing the centre of Ponteland and funds towards secondary education and a flood alleviation scheme to protect Ponteland town centre. Read More 2,000-home Ponteland garden village plans submitted with backing from top architect \nBut a number of community groups in Ponteland oppose the plans, which come after Lugano was refused permission for a 280-home development on the eduge of the village in 2015. \nPonteland councillor Peter Jackson, who is leader of the Conservative group on Northumberland County Council , said the Dissington plans did not meet any of the Government’s criteria for garden villages. \nHe said: “Northumberland Conservatives were clear from the outset that the Dissington Garden Village scheme could not be justified and that it did not comply with the criteria that the Government has set out. Read More South Shields company wins order on the largest container ship ever built \n“In particular the proposed scheme would have had an overwhelming impact on the infrastructure of Ponteland, it was obviously not a discreet and separate settlement and it has no local support in the community. Most important is the lack of evidence that there is any proven need for all of these extra houses.” \nThe row has come as the first wave of garden villages planned to create tens of thousands of new homes in England has been given the go-ahead. \nMinisters have backed 14 bids across the country that will develop new communities with between 1,500 and 10,000 properties. The nearest to the North East is plans for a site south of Carlisle called St Cuthberts. \nLarger scale garden towns in Aylesbury, Bucks, Taunton in Somerset and Harlow and Gilston, on the Essex-Herts border, have also been signed off by the Government. The plans are expected to create a series of new communities with green spaces, good transport links and high quality affordable homes to help tackle the country’s housing crisis. \nSome £6m in funding will go towards developing the new villages, which could generate 48,000 new homes, while £1.4m has been earmarked for the towns. \nHousing minister Gavin Barwell said: “Locally led garden towns and villages have enormous potential to deliver the homes that communities need. New communities not only deliver homes, they also bring new jobs and facilities and a big boost to local economies.” Like us on Facebook", "external_links": [], "published": "2017-01-02T23:21:00.000+02:00", "crawled": "2017-01-02T19:04:53.180+02:00", "highlightTitle": ""}