{"organizations": [], "uuid": "43c48889ba720e62977ae0618b3eec184ef65b76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12502850.ece/ALTERNATES/s1200/JS110033893.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12502853", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Britain could become more corrupt after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Britain could become more corrupt after Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-01-25T15:05:00.000+02:00", "replies_count": 0, "uuid": "43c48889ba720e62977ae0618b3eec184ef65b76"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12502853", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Britain could become more corrupt after Brexit", "locations": [], "entities": {"persons": [{"name": "kromek", "sentiment": "none"}, {"name": "francesca mcdonagh", "sentiment": "none"}, {"name": "stephen clarke", "sentiment": "none"}, {"name": "garfunkel", "sentiment": "none"}, {"name": "perrin", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}, {"name": "chiquito", "sentiment": "none"}, {"name": "benny", "sentiment": "none"}, {"name": "wh smith", "sentiment": "none"}, {"name": "mrs green", "sentiment": "none"}, {"name": "andre camara", "sentiment": "none"}, {"name": "peter williams", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "sarah green", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "banco santander", "sentiment": "none"}, {"name": "john waterworth", "sentiment": "none"}, {"name": "mcdonagh", "sentiment": "none"}, {"name": "frankie", "sentiment": "none"}, {"name": "clarke", "sentiment": "none"}, {"name": "herb kim", "sentiment": "none"}, {"name": "william perrin", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}, {"name": "nathan bostock", "sentiment": "none"}, {"name": "nicola thorp", "sentiment": "none"}, {"name": "bexit", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "northumberl", "sentiment": "none"}, {"name": "chester-le-street", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "north yorkshire", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "kromek", "sentiment": "none"}, {"name": "santander uk", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "cayton bay", "sentiment": "none"}, {"name": "parkdean holidays", "sentiment": "none"}, {"name": "trinity square", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "fallbarrow", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "barnard castle", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "great yarmouth", "sentiment": "none"}, {"name": "scarborough", "sentiment": "none"}, {"name": "lake district", "sentiment": "none"}, {"name": "sandy bay", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "kromek plc", "sentiment": "none"}, {"name": "onex", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "cbi leadership programme", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "cbi 9:00 restaurant group", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "fawcett society", "sentiment": "none"}, {"name": "retailer wh smith", "sentiment": "none"}, {"name": "digital union", "sentiment": "none"}, {"name": "vauxhall holiday park", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}, {"name": "consett", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "petitions committee and women and equalities committee", "sentiment": "none"}, {"name": "voice", "sentiment": "none"}, {"name": "business north", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "apprenticeship levy", "sentiment": "none"}, {"name": "restaurant group", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "frankie & benny", "sentiment": "none"}, {"name": "parkdean resorts", "sentiment": "none"}, {"name": "national living wage", "sentiment": "none"}, {"name": "team valley  banking", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:10 Newcastle’s Parkdean Resorts to invest £50m in holiday parks - including upgrade in Northumberland \nNorth East leisure company Parkdean Resorts has unveiled plans to plough £50m into its portfolio of holiday parks, a month after it was sold to new owners in a £1bn deal. \nThe Newcastle-headquartered business – formed in November 2015 following the merger of Parkdean Holidays and Park Resorts – is investing in its accommodation, retail and leisure facilities in time for the 2017 season. \nThe company now runs 73 holiday parks nationwide, having bought Vauxhall Holiday Park near Great Yarmouth for an undisclosed sum last year in its first acquisition since the merger. \nParkdean - which was sold to Canadian private equity house Onex for £1.35bn in December - is to spend £17m on a new range of lodges, caravans and glamping facilities, as well as £4m on refurbishing its existing caravans and lodges. \nThe firm will also spend some £5.5m on overhauling entertainment and leisure venues and children’s activity areas at many of the UK parks. \nChanges will soon be made at the Sandy Bay resort near Ashington, Northumberland, where a £1.4m makeover will unfold to result in more accommodation for holidaymakers and prospective owners, a refubished Boathouse Restaurant with al fresco dining terraces, a new bar and an indoor play area. \nThe amusement arcade is being extended and freshened up, and a new takeaway food outlet will also be added. \nElsewhere in the North, a £1.5m investment is being made in 19 marina retreat lodges at Fallbarrow in the Lake District, where there will be a revamped bar and lounge on park, and Cayton Bay near Scarborough in North Yorkshire will see a £900,000 upgrade to extend and refurbish its Boathouse Restaurant with an incorporated soft play area and dining terrace. A new fish and chip takeaway will also open this season at the park. John Waterworth, chief executive of Parkdean Holidays 9:05 Business leader from North East steps down from national role \nA business leader who provided a rare North East voice on the national stage is to step down from her job . \nSarah Green has been the CBI’s director of regions and nations since 2014, having previously been the organisation’s North East director. \nIn her current role, Mrs Green had led the CBI’s approach to growing regional prosperity and was the organisation’s main representative on Business North, a network set up to strengthen business engagement across the North East, the North West and the Yorkshire and Humber region. \nMrs Green, who remained living in Newcastle while working in London and touring the UK for the CBI, has now announced that she is leaving the organisation to do a PhD at Durham University and to develop non-executive and consultancy roles with businesses in the North. \nShe said: \nWith an offer of a scholarship PhD at Durham University I have decided the time is right to pursue this ambition and spend more time in the North developing a portfolio career including non exec roles, consultancy/training and academic study. \nThis will include continuing to support the CBI Leadership Programme which I am proud to have created. Sarah Green, CBI 9:00 Restaurant Group vows to reconsider pricing amid 'difficult' trading \nThe struggling owner of Frankie & Benny’s and Garfunkel’s has said trading continues to be challenging and a shake-up of the business will only begin to bear fruit towards the end of the year. \nThe Restaurant Group said like-for-like sales in the fourth quarter fell 5.9% and dropped 3.9% over the year. Total turnover increased by 3.7% in 2016 to £710.7m. \nLast year the firm announced it is shutting 33 under-performing sites as part of a strategic review. \nThe Restaurant Group admitted it has lost value-conscious customers at Frankie & Benny’s after significant price hikes and the firm pledged to “look at the pricing architecture of the menu” and “reinvigorate the value offer” in a bid to attract more families to its outlets. The next phase of the review will look at stablemates Chiquito, Coast To Coast, Joe’s Kitchen and Garfunkel’s. \nThe company said in a statement: \nWe expect the trading performance of the business in the first half of 2017 to remain difficult, but anticipate momentum improving towards the end of this transitional year as our initiatives start to take effect. \nThe group also pointed to a series of external cost pressures, such as increases in the National Living Wage, the Apprenticeship Levy, the revaluation of business rates, higher energy taxes and increased costs linked to the collapse in value of the pound. Frankie and Benny's in Trinity Square, Gateshead 8:54 North East tech sector gathers to discuss life after Bexit \n“Never let a good crisis go to waste” was the message driven home last night as the North East’s digital community came together in Newcastle to discuss its future in the wake of Brexit. \nOver 60 businesses from the sector descended on Campus North to take in the first of a series of topical networking dates, aptly named the Thinking Digital Sessions, as part of the Digital Futures programme. \nThe event was attended by software giant Sage and strategic digital agency Orange Bus and saw a keynote speech delivered by Tony Blair’s former policy advisor come social Entrepreneur, William Perrin. \nMr Perrin, who is also the director of the international digital consultancy firm Talk About Local, said: \n“It’s natural to have trepidation about any big change, but it we don’t look for opportunities we won’t find them. I was a remain campaigner, but I’m determined to make the best of this huge national change in direction. \nIt’s more important than ever now to come together, share information and stories and speak with one voice both to government and other countries. It’s a very complex and exciting time for the nation – only the best informed and best represented will prosper. \nNever let a good crisis go to waste. The North East tech sector needs to make its voice clear and loud in London, where they will have to take a lot of opportunities in a hurry. \nIt’s important that businesses expand their vision and outlook beyond Europe and actively look for opportunities in the USA, Latin America, Singapore, Australia, China. \nThe Thinking Digital Session, co hosted by CEO of Thinking Digital, Herb Kim, came just hours after the Government was informed it had lost out on its Brexit Vote appeal and businesses at the event used the opportunity to ask the honest question, where do we go from here in times of such uncertainty? \nMr Perrin, however, was eager to reinforce the fact that the Supreme Court ruling will not delay Brexit and the region may face a turbulent future if it doesn’t prepare and be wise to inevitable change. \nHe added: \nThere’s a huge amount going on in the region but it lacks clear leadership and a story to tell to people. The region needs a coherent voice, that needn’t be an elected politician or official, it could be a business leader an entre \npreneur or organisations such as Digital Union banging its drum even more on behalf with its members. \nAs the North East moves away from substantial EU funding post-Brexit, many opportunities will open up for entrepreneurs as the shape of the market changes. \nThose opportunities will be shaped by the market and private investors rather than formed in Brussels or London. It’ll be a tough change for those who are used to playing a bureaucracy game with state funders. Having skills will be vital which I know this region has in abundance. Talk About Local Director William Perrin 8:48 HSBC branch closures programme includes Alnwick, Consett and Team Valley \nBanking giant HSBC has announced plans to close 62 branches across the UK this year, including another three in the North East. \nLocal branches at Alnwick , Consett , and Team Valley will be closed throughout the year as part of the exercise. The closures come shortly after HSBC shut two branches in Barnard Castle and Chester-le-Street , County Durham . \nThe high street lender said it would be the only cut to its branch network it would make in 2017, bringing its total number of UK branches to 625. \nFrancesca McDonagh, HSBC head of retail banking and wealth management for UK and Europe, said: “The decision to close these branches ensures a more sustainable branch network for the future as we continue to invest in our digital platforms and our people.” \nThe cuts to the branch network could trigger up to 180 job losses, but the bank said it would try and redeploy staff where possible. \nHSBC has moved to slash its branch network after seeing a rise in the number of customers using online banking. \nIt said 90% of its interactions with customers now came through digital - an 80% rise on last year - while the number of customers using HSBC branches has dropped by nearly 40% in the past five years. \nMs McDonagh added: \nThe way our customers bank with us is changing. \nMore customers are using mobile and internet banking than ever before, innovation such as Touch and Voice ID has proved extremely popular, and fewer people are using branches. An HSBC branch (Photo: PA) 8:43 KEY EVENT Women told to wear high heels and dye hair, workplace study shows \nWomen workers have been told to dye their hair blonde, wear revealing outfits and constantly reapply make-up, a s tudy into workplace dress codes has found. \nThe “troubling” experiences suffered by female staff were unearthed by a parliamentary report into the case of a woman sacked for not wearing high heels. \nMore than 150,000 people signed a petition in support of London receptionist Nicola Thorp, who was sent home from work after refusing to wear high heels. \nThe 27-year-old arrived at finance company PwC to be told she had to wear shoes with a “2in to 4in heel” and when she refused and complained male colleagues were not asked to do the same, she was sent home without pay. \nThe Petitions Committee and Women and Equalities Committee said it became clear in the course of its inquiry that this was not an isolated incident. \nThe report said: \nWe heard from hundreds of women who told us about the pain and long-term damage caused by wearing high heels for long periods in the workplace, as well as from women who had been required to dye their hair blonde, to wear revealing outfits and to constantly reapply make-up. \nThe Government has said that the existing law is clear, and that the dress code that prompted this petition is already unlawful. Nevertheless, discriminatory dress codes remain widespread. \nIt is therefore clear that the existing law is not yet fully effective in protecting employees from discrimination at work. We call on the Government to review this area of the law and to ask Parliament to change it, if necessary, to make it more effective. \nThe Fawcett Society told the inquiry that requiring women to abide by gendered dress codes, often of a sexualised nature, sent out the message that their appearance was of more value than their skills, experience or voices. Women workers have been told to dye their hair blonde, wear revealing outfits and constantly reapply make-up, a study into workplace dress codes has found (Photo: PA) 8:39 \nThe FTSE-100 index opened at 7150.34. \nThe pound at 8am was 1.2495 dollars compared to 1.2531 dollars at the previous close. \nThe euro at 8am was 0.8575 pounds compared to 0.8581 pounds at the previous close. 8:35 KEY EVENT Kromek Plc seeks to raise £21m through share sale \nRadiation detection technology company based in County Durham is looking to raise £21m through a share sale consisting of a firm placing and an open offer. \nKromek Plc, which is based in Sedgefield, focuses on developing tech that can be used in the medical security and nuclear markets. \nThe firm placing has been undertaken with new and existing institutional investors in the company and was over-subscribed. \nSir Peter Williams, chairman of Kromek, said: \nWe are pleased with the support shown by our current shareholders and we welcome new blue-chip institutions to our register. The present fundraising will considerably strengthen our balance sheet, underpinning our plans for the sustained growth of the business and supporting increasing commercial activity through the deployment of our proprietary technology. \nKromek has made good progress this year, in which we achieved a number of important operational targets, enlarging our customer base and strengthening our relationship with our OEM partners. This resulted in significant contract wins over the past 18 months which have given us forward visibility over revenues in excess of 85% of market expectations for the current year. \nThe Board has great confidence in the future of Kromek and recommends all shareholders to vote in favour of the proposals, which we believe will allow us to deliver increased value to our investors. \nThe share sale will see a firm placing of 100m ordinary shares at the offer price of 20p per ordinary share. Investors who already own shares in the business will be able to access an open offer, which allows one new ordinary share to be purchased for every 30 already owned. 5,129,536 offer shares will be available on at 20p each. Sir Peter Williams, chairman of Kromek Plc (Photo: Andre Camara) 8:29 Santander warns of 'challenging' environment despite 'strong' 2016 performance \nHigh street lender Santander has notched up a 13% hike in annual UK profits despite seeing a sharp slowdown in customer growth at its flagship current account. \nThe banking giant posted underlying pre-tax profits of £2.03bn for 2016, up from £1.79bn the previous year. But Spanish owner Banco Santander saw the Brexit-hit pound knock profits from its UK operation, leaving its British earnings 14.7% lower last year. \nSantander UK revealed a marked slowdown in the number of new customers signing up to its popular 123 current account after it halved the top interest rate in November. It added another 483,000 123 customers in 2016, down from around 1m in 2015. \nSantander said its UK arm also put by another £114m in the fourth quarter of 2016 for the payment protection insurance (PPI) mis-selling scandal. \nNathan Bostock, chief executive of Santander UK, hailed a “strong performance” in 2016 as profits and lending grew, but cautioned over an uncertain 2017. He said: \nLooking ahead, we expect to see a changeable and more challenging macro environment in 2017. \nWe believe the transformation we have made in putting the customer at the heart of our business, coupled with a continued focus on costs and risk management, gives us solid foundations to succeed and confidence in the future. Santander KEY EVENT WH Smith upgrades profit forecast after travel sector preforms well \nRetailer WH Smith has upgraded its full year profit forecast after hailing another strong performance at its travel arm over the festive period. \nThe firm said like-for-like sales at its travel arm, which includes stores at airports and railway stations, rose 5% in the 21 weeks to January 21. This offset a 3% fall in comparable sales across high street stores and left overall group sales up 2% and 1% on a like-for-like basis. \nChief executive Stephen Clarke said: \nIn travel, we have delivered good sales growth across all our key channels in the period. \nThis was driven by ongoing investment in the business and continued growth in passenger numbers - particularly in our airport stores over the Christmas holiday period. \nAs a result of the performance in travel we expect group profit growth for the year to be slightly ahead of plan. \nThe company has been boosted by surging demand for food on the go across its stores based in airports and railway stations. \nThe dip in high street sales was explained by strong promotional activity and tough comparatives from last year when it saw strong sales of “colour therapy” titles. \nNevertheless, Mr Clarke described high street figures as a “good performance” and in line with expectations, pointing to strong sales of spoof humour books. \nHe added: \nWhile there is some uncertainty in the broader economic environment, we remain confident that the Group is well positioned for the year ahead as we continue to focus on profitable growth, cash generation and investing in new opportunities. \nTotal travel sales rose 10% while high street sales dipped 4% over the period. A WH Smith branch in London 8:15 The best and worst countries in world corruption rankings \nTransparency International’s 2016 Corruption Perceptions Index ranked Britain among the least corrupt countries in the world. Here are the best and worst performers on the index, based on a scale of 0 to 100. \nRANK COUNTRY SCORE (Best)", "external_links": [], "published": "2017-01-25T15:05:00.000+02:00", "crawled": "2017-01-25T11:59:35.779+02:00", "highlightTitle": ""}