{"organizations": [], "uuid": "fe21030a5c9da2091cbed398b507590eada55565", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12450282.ece/ALTERNATES/s1200/JS55417749.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-needs-champion-top-government-12447887", "country": "GB", "domain_rank": 21960, "title": "Why the North needs its own champion at the top of Government", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why the North needs its own champion at the top of Government", "spam_score": 0.0, "site_type": "news", "published": "2017-01-13T23:00:00.000+02:00", "replies_count": 0, "uuid": "fe21030a5c9da2091cbed398b507590eada55565"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-needs-champion-top-government-12447887", "ord_in_thread": 0, "title": "Why the North needs its own champion at the top of Government", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "beith", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "john sentamu", "sentiment": "none"}, {"name": "melvyn bragg", "sentiment": "none"}, {"name": "shipley", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "lord shipley", "sentiment": "none"}, {"name": "anna gowthorpe/pa wire", "sentiment": "none"}, {"name": "alan beith", "sentiment": "none"}, {"name": "john shipley", "sentiment": "none"}, {"name": "fiona hanson/pa wire", "sentiment": "none"}, {"name": "john prescott", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "hull east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "canterbury", "sentiment": "none"}], "organizations": [{"name": "government news why the north", "sentiment": "negative"}, {"name": "people of sunderland", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "government share archbishop of york", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "justice select committee", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "lib dem northumberland", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "archbishop of york", "sentiment": "none"}, {"name": "northern brexit negotiating committee", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "york minster, york", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why the North needs its own champion at the top of Government Brexit threatens the North, says top churchman who is fighting for a 'North Champion' at the top level of Government Share Archbishop of York Dr John Sentamu and The Rev Libby Lane and The Archbishop of Canterbury after a service at York Minster, York (Photo: Anna Gowthorpe/PA Wire) Share Get   Thank you for subscribing!   \nThe North needs a champion at the top level of Government to help it succeed after Brexit , a senior Church of England archbishop has urged. \nJohn Sentamu, the Archbishop of York, joined politicians including former Newcastle City Council leader John Shipley to warn that quitting the EU could set back the recovery of the North. \nBut he also said it could be an opportunity to create “a more diverse economy that draws on the skills of northern people”. \nThe Archbishop is a member of the House of Lords and spoke in a debate about a report by leading think tank IPPR North, which warned Brexit could increase poverty in the North by making it harder for firms to trade or to recruit skilled workers. \nPublished in December, the report called for the creation of a Northern Brexit Negotiating Committee involving local councils and other representatives, to give the wider region a strong voice in Brexit talks. \nThe Archbishop warned: “Unless we get things right in the North, the whole country will be more divided, less prosperous and unhappier. In short, the whole country needs the North to flourish.” \nBut he said quitting the EU could provide an opportunity to reduce the tendency of London to “suck energy and resources southwards”. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now People of Sunderland talk about Brexit 6 months on from vote Share this video Watch Next \nHe said: “We need more devolution from south to north — devolution of powers and of institutions. We need Cabinet-level figures to champion the North - people who know the qualities of the north from their own experience. Read More MP Chi Onwurah on the North's industrial heritage and a strategy to keep post-Brexit Britain wealthy \n“We need a more diverse economy that draws on the skills of northern people. If Brexit prompts a shift in that direction, it may just be worth the uncertainty that we are currently experiencing.” \nLord Shipley, a former Liberal Democrat leader of Newcastle City Council, set the Government must “to boost growth and productivity in the North”. \nHe highlighted on the need to improve schools, telling the House of Lords: “We need a major boost to our secondary schools, as there has been in London, which now has a much higher achievement rate than the North - and, of course, much higher funding per capita.” \nLord Shipley pointed out that employers’ body the CBI had said school standards were “a key factor in driving up productivity and therefore wages”. Read More What would be the difference between hard and soft Brexit? Chairman of the Justice Select Committee Sir Alan Beith (Photo: Fiona Hanson/PA Wire) \nTaking part in the same debate, former Lib Dem Northumberland MP Alan Beith urged the Government to revive plans which were abandoned last year to devolve power to the North East. But Lord Beith said the Government should drop its insistence that the region should have a new North East mayor, a proposal which is unpopular with many local councillors and MPs. \nJohn Prescott, a former Labour Deputy Prime Minister who was MP for Hull East, said there should be a strategy to grow the economy in the North as a whole, rather than separate strategies for each major city. \nAnd Melvyn Bragg, the TV presenter and Labour peer, called for better transport links. \nHe said: “It is shameful and ridiculous that there are no first rate transport links from Liverpool to Hull, and from Hull up to Newcastle.” Like us on Facebook", "external_links": [], "published": "2017-01-13T23:00:00.000+02:00", "crawled": "2017-01-13T18:13:21.864+02:00", "highlightTitle": ""}