{"organizations": [], "uuid": "0e204a2bee44fbb9fd4b74be599bbac2415a81d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30027964/15775838.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/goldsmiths-jewelers-owner-lining-up-potential-flotation-or-private-sale/story-30027964-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Goldsmiths owner Aurum being lined up for sale", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Goldsmiths owner Aurum being lined up for sale", "spam_score": 0.0, "site_type": "news", "published": "2017-01-04T12:42:00.000+02:00", "replies_count": 0, "uuid": "0e204a2bee44fbb9fd4b74be599bbac2415a81d4"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/goldsmiths-jewelers-owner-lining-up-potential-flotation-or-private-sale/story-30027964-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Goldsmiths owner Aurum being lined up for sale", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "mappin", "sentiment": "none"}, {"name": "braunstone frith", "sentiment": "none"}, {"name": "duffy", "sentiment": "none"}, {"name": "brian duffy", "sentiment": "none"}, {"name": "webb", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "aurum", "sentiment": "negative"}, {"name": "goldsmiths", "sentiment": "negative"}, {"name": "aurum holdings", "sentiment": "none"}, {"name": "apollo", "sentiment": "none"}, {"name": "hudson yards", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nThe company behind high class jeweler Goldsmiths is being lined up for a potential sale. \nThe private equity owners of Leicester-based Aurum Holdings are considering a flotation or private sale on the back of a post-Brexit boom in business. \nGoldsmiths and sister companies Watches of Switzerland and Mappin and Webb have benefited from wealthy European, US and Chinese shoppers travelling to Britain since the June referendum to exploit the low pound. \nAurum, which has 316 staff at its Braunstone Frith head office, was acquired in March 2013 by US private equity firm Apollo for a reported £180 million. \nSince then it has spent millions upgrading many of its top stores and invested heavily in its online offering. \nIt is planning a \"multi-million\" pound investment in its first US Watches of Switzerland store in the new $40 billion Hudson Yards neighbourhood being built on the west side of Manhattan. \nRead more: Sales of luxury watches ticking along nicely for Aurum \nTwo further New York shops are planned and other sites are being considered. \nSpeaking exclusively to the Mercury, Aurum chief executive Brian Duffy said it was standard procedure for private equity firms to invest then sell when the going was good. \nHe said it was possible a deal could be done this year. \nHe said: \"All that has happened is that they have taken advice on the private or IPO [initial public offering] markets, and on what they might think of our track record, which has been very good. \n\"They have appointed advisers but there is no sale process as yet. \nBrian Duffy promoting plans for the luxury New York shop \n\"We do not know if the separate parts of the business would be sold off but that's highly unlikely. \n\"Part of our strength is our size and scale and the integration of our businesses, and we are much more efficient as a group. \n\"We have done well through the last few years by following a great strategy of investment in stores and marketing and so on, and the business has been performing well. \n\"There is no question that we are benefiting from more tourists coming to the UK since the devaluation that followed the Brexit vote. \n\"Private equity businesses tend to own businesses for no more than seven or eight years – they spend and invest and look to liquidate their investments. It could happen in 2017 – it's a possibility. \n\"The important thing for us and our employees and our suppliers is that any change in ownership would not affect our strategy.\" \nAurum's turnover hit £415 million in the year to April 2015 – up a fifth on the previous year. That level of growth had continued, he said. \nThe business has around 2,210 staff across the UK, and Mr Duffy said there were no plans to leave Leicester. \nHe said: \"We would never risk losing anybody here. We have spent money on our facilities and offices here, responding to expansion of the online business, and are about to do the reception.\" \nHe said Aurum had benefited from the pound's devaluation because it bought stock – notably Swiss watches – in sterling. \nSwiss prices had gone up, he said, but that had affected all high end watch retailers. \nHe said: \"The net result is we still have a price advantage – albeit smaller – from the euro and an even bigger advantage over the dollar. \n\"Most importantly the UK – London in particular – is the favoured destination for international shoppers and has become a lot cheaper, whether you are talking about air fares, taxi fares or hotel rooms.\" \nHe said the business anticipated a busy Chinese new year at the end of the month.", "external_links": [], "published": "2017-01-04T12:42:00.000+02:00", "crawled": "2017-01-04T09:19:30.027+02:00", "highlightTitle": ""}