{"organizations": [], "uuid": "ffcabb5a3c7b815b89a5f1857bcb437dfcf00a2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article7158499.ece/ALTERNATES/s1200/Jonathan-Arnott.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/anyone-can-good-winner-politics-12507877", "country": "GB", "domain_rank": 21960, "title": "Anyone can be a good winner in politics - but right now we have too many bad losers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Anyone can be a good winner in politics - but right now we have too many bad losers", "spam_score": 0.0, "site_type": "news", "published": "2017-01-26T01:00:00.000+02:00", "replies_count": 0, "uuid": "ffcabb5a3c7b815b89a5f1857bcb437dfcf00a2b"}, "author": "Richard Kirkman", "url": "http://www.chroniclelive.co.uk/news/north-east-news/anyone-can-good-winner-politics-12507877", "ord_in_thread": 0, "title": "Anyone can be a good winner in politics - but right now we have too many bad losers", "locations": [], "entities": {"persons": [{"name": "paul nuttall", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nAnyone can be a good winner. \nBut in politics, from time to time we all lose battles. I joined UKIP in 2001, so in the early days, while the party was in its embryonic phase, I certainly experienced more than my fair share of defeats. \nThe Supreme Court ruled yesterday against my position on Brexit by a majority of 8 to 3. I lost. I have to accept the results. In America, I didn’t want either Donald Trump or Hillary Clinton. My view lost, as neither Republicans nor Democrats selected a candidate I like in the primaries. Again, I have to accept the results. My argument won through on Brexit, though, and I expect the same courtesy from the other side. \nThere is a new, pernicious attitude prevailing amongst the liberal left on both sides of the pond. Those who refuse to accept the results of an election or a referendum. \nPeople have a democratic right to protest against what they do not like, but scenes of riots in the streets against the election of Donald Trump show how little those people care about either democracy or the rule of law. \nWe do not have anti-Brexit riots here in the United Kingdom, but what we do have is a Labour Party intent upon sending a wrecking ball through the heart of our democracy. \nThe Labour party intends to submit a string of amendments to invoking Article 50. \nWhat Jeremy Corbyn ’s party is proposing is completely unworkable. The demand the public airing of parts of the negotiation process, which would inevitably make it harder to get a good deal. \nThey seek guarantees of certain policies ‘post-Brexit’, yet these are domestic matters: it is a fundamental principle of British law that no parliament may legally bind its successor. \nThe Labour party must surely understand this already. Attempts to amend where no amendment is necessary are simply a smoke screen designed to hide the fact that they intend to delay the process even further or to derail Brexit altogether (to the extent that a rudderless Labour Party can be said in any way to have a coherent plan). \nThe SNP and the inappropriately-named Liberal Democrats are more open in their attempts to sabotage the will of the British people as expressed at the ballot box in a referendum in which more people voted to leave the European Union than have ever voted for anything in British history. \nIn a democracy, it is natural that we all have different opinions. But why is it that so many establishment politicians are now completely incapable of graciously admitting defeat? Ultimately the job of politicians is to work for the people. If they cannot accept clear democratic mandates then perhaps they are in the wrong jobs. \nThe forthcoming Parliamentary by-election in Stoke will potentially have a profound impact here in the North East over a hundred miles away. \nIt has been a Labour seat ever since its inception in 1950. If the people of Stoke call time on a Labour Party which itself is stuck in the 1950s, you can rest assured that the shockwaves will be felt here too. \nThe strength of the Labour Party in its heartlands, whether in Stoke or closer to home, has always been found in the First Past The Post election system. Labour support has gradually eroded in those areas over the years without actually costing them too many seats, yet the rout of the Labour party in Scotland demonstrates that once the party falls below a certain threshold, collapse can be spectacular. \nIf UKIP can win in Stoke and get our new leader Paul Nuttall elected to Parliament, it could very well be the catalyst that UKIP needs to begin the process of supplanting the Labour party as the voice of working people in our region. \nMajor realignments of British politics rarely come along more than once in a generation. \nToday though, the conditions are right for precisely such a realignment. \nIf that happens, make no mistake about it: it will be the Labour Party’s inability to recognise the views of its own supporters, and to graciously accept defeat, that will have been the cause of its downfall. Jonathan Arnott is the Ukip MEP for the North East of England. Like us on Facebook", "external_links": [], "published": "2017-01-26T01:00:00.000+02:00", "crawled": "2017-01-25T20:27:56.771+02:00", "highlightTitle": ""}