{"organizations": [], "uuid": "71d5d93cc70500b5792329a5c9b8895bb8ed22f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.liverpoolecho.co.uk/incoming/article12408017.ece/ALTERNATES/s1200/JS108224261.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/simply-saying-immigration-go-down-12450758", "country": "GB", "domain_rank": 21960, "title": "Simply saying immigration will go down won't make it do so - as Theresa May's government is showing", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Simply saying immigration will go down won't make it do so - as Theresa May's government is showing", "spam_score": 0.0, "site_type": "news", "published": "2017-01-14T01:00:00.000+02:00", "replies_count": 0, "uuid": "71d5d93cc70500b5792329a5c9b8895bb8ed22f1"}, "author": "Thom Brooks", "url": "http://www.chroniclelive.co.uk/news/news-opinion/simply-saying-immigration-go-down-12450758", "ord_in_thread": 0, "title": "Simply saying immigration will go down won't make it do so - as Theresa May's government is showing", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jeremy corbyn  corbyn", "sentiment": "none"}, {"name": "thom brooks", "sentiment": "none"}, {"name": "ed miliband", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "none"}, {"name": "prime minister’s brexit", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "durham law school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJeremy Corbyn has received a lot of criticism. Since Ed Miliband stepped down after the 2015 General Election, Labour has been getting more negative mainstream press coverage than not. \nIt is said in Westminster that the hardest job in politics is being Leader of Her Majesty’s Opposition – and that goes for whoever has this title. \nWe saw the unveiling of what has been called Corbyn 2.0 this week – not a rebranding, but perhaps a renewal of priorities. I think it’s fair to say that many wrote this off before it began. \nWhat did Corbyn have to say about Brexit – or immigration? \nIn the last few days, we began to know more about Labour’s position on Brexit than Theresa May’s government. This should alarm Number 10. \nMay has given little away concerning her plans beyond “Brexit means Brexit” and it will be “red, white and blue”. This is like saying Brexit means gobbledygook and red, white and blue could mean Dutch courage or a French-styled revolution. We know little more now than we did more than six months go. Labour Leader Jeremy Corbyn \nCorbyn’s keynote speech earlier this week was a clear attempt to fill the vacuum May ’s silence created. This creates a real problem for the Government. May’s being tight lipped creates an opportunity for Labour to start defining the narrative of what Brexit means – and on their terms. Labour has a chance now to shape the Brexit debate. And it’s all thanks to an overly-cautious government that wants any discussion hush hush in a secret room no one else can find. \nCorbyn made clear he believes Britain can be better off after Brexit . And this raises the stakes for May’s government – they dare not disagree we’ll all benefit, but now everyone being better off could become part of what a successful Brexit means. Delivering Brexit is not good enough by itself. \nWhile accepting Britain is leaving the EU, Labour is making the Prime Minister’s Brexit plans a second referendum about the Government. Brexit means more than leaving the European Union – it is about making Britain “a better place for all its citizens”. \nThis will be no easy feat in an unequal economy fuelled by temporary work and zero-hour contracts. May will have a struggle ensuring Britain doesn’t lose jobs and investment we currently enjoy. Now thanks to her not wanting to provide a commentary on her plans, they’re being set for her – she must not only keep the lights on but make the room brighter. This ups the stakes considerably in a high-risk situation the political likes of which most of us have never seen. \nI was especially pleased to see Corbyn address immigration at some length. He made clear that Labour supports a fair policy that focuses on improving jobs and living standards for all. Migrants demonstrate near to the Jungle camp on the outskirts of Calais, northern France \nImportantly, this will not be done through making net migration targets that won’t be met. For those concerned about the number of immigrants coming to Britain, these have never been higher than since David Cameron promised to reduce net migration to the tens of thousands. Instead of going down as he and May have promised since 2010, they have reached all-time record highs. \nThe big problem here is seeing it as only a numbers game. “Net migration” is the total number of all persons coming or going into Britain – and the Tories are committed to bringing this number down considerably. But who is included? The Office for National Statistics tells us that over 80,000 each year are British citizens. Does the Government want more of us to leave and stay away? The answer must be yes if they follow their own logic – and it’s an embarrassment. Read More Why the North needs its own champion at the top of Government \nWhen citizens rightly raise concerns about immigration, the central worry is the impact of immigration on school places, hospitals, housing and transport. These worries are not always borne out by local realities. For example, the North East has the lowest foreign-born population in all of Britain. Put 100 people in a room and the only foreigner is probably me. Redcar and Cleveland has the fewest immigrants of any borough in the UK – sometimes perceptions are different from the realities. Simply saying immigration will go down won’t make it do so – and May’s government is a prime example of this. A European Union flag in front of Big Ben (Photo: Daniel Leal-Olivas/PA Wire) \nBut we also should not believe fewer migrants means less impact. Migrants are less likely to be patients at A&E and much more likely to be GPs in local surgeries. Fewer migrants might mean less people to queue, but the queue would actually move more slowly with fewer doctors to provide advice and treatment. \nMigrants live in housing, but they build it too. Having less of one does not mean more of another. This fact may seem counterintuitive, but that does not make it any less true. If Labour can address the impact from migration through policies like a Migration Impacts Reduction Fund paid for by a surcharge on immigration applications, then this could bring the support local communities need without playing to myths or common stereotypes that don’t solve the problems hard working families face. Read More Liberal Democrats snatch second Sunderland council seat in by-election \nCorbyn’s speech also made clear that Labour would guarantee the rights of EU citizens currently in Britain. This is a message the Government has been unwilling to give. They seem happy to use EU citizens as pawns in a political game where our own citizens living abroad may lose big. \nThese policies are not new for Labour and some parts of Corbyn’s remarks echo his speech from Labour’s autumn conference last Liverpool. But now we know more about where things stand – and much more than where the Government is. \nMany will cease his claim that Labour is not wedded to freedom of movement, but nor is it being surrendered. Labour’s Brexit test for Theresa May is showing not only that leaving the EU can be done in an orderly way, but that living standards for all will improve. This may prove a potent strategy if negotiations don’t go smoothly or if living standards remain squeezed. In short, Brexit is about Britain’s future. \nIf May won’t tell us what it looks like, Corbyn is now seizing that space. While critics might have wanted this speech to come earlier, May’s failure to put much flesh on bones has left an open goal for Labour – and they’re ready to play ball. Thom Brooks is Head of Durham Law School and author of Becoming British (Biteback 2016) \n@thom_brooks", "external_links": [], "published": "2017-01-14T01:00:00.000+02:00", "crawled": "2017-01-13T20:39:50.150+02:00", "highlightTitle": ""}