{"organizations": [], "uuid": "1918b8c4984bb6adc1c165946c5cb27aee39ec28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12368146.ece/ALTERNATES/s1200/SSR_NEC_231216bridge_1jpeg.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-jobs-mayor-faux-pas-12512748", "country": "GB", "domain_rank": 21960, "title": "Brexit, jobs and a Mayor faux pas: 5 things we learned at Sunderland City Council meeting", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit, jobs and a Mayor faux pas: 5 things we learned at Sunderland City Council meeting", "spam_score": 0.0, "site_type": "news", "published": "2017-01-26T23:25:00.000+02:00", "replies_count": 0, "uuid": "1918b8c4984bb6adc1c165946c5cb27aee39ec28"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-jobs-mayor-faux-pas-12512748", "ord_in_thread": 0, "title": "Brexit, jobs and a Mayor faux pas: 5 things we learned at Sunderland City Council meeting", "locations": [], "entities": {"persons": [{"name": "emerson", "sentiment": "none"}, {"name": "coun alan emerson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "niall hodson", "sentiment": "none"}, {"name": "coun hodson", "sentiment": "none"}, {"name": "coun watson", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ghent", "sentiment": "none"}], "organizations": [{"name": "people of sunderland", "sentiment": "negative"}, {"name": "sunderland city council", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "dtw advertising & marketing ltd", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "People of Sunderland talk about Brexit 6 months on from vote Share this video Watch Next \nAs the formal activation of Article 50 draws closer, setting off at least two years of complex negotiations, Sunderland must wait nervously. \nTheresa May’s recent speech in which she indicated the UK would be getting out of the single market and customs union solicited some worrying comments from Nissan. \nFor the first time since they committed to operate in Sunderland post-referendum, Nissan gave a clear indication their commitment was short-term and conditional. \nNissan’s chief executive, Carlos Ghosn, said: “Obviously when the package comes, you are going to have to re-evaluate the situation, and say, ‘Okay, is the competitiveness of your plant preserved or not?’ \n“We are going to have to make decisions on investment within the next two to three years, so obviously the faster the Brexit results come, the better it is.” Read More \nAsked if he had faith in the Prime Minister’s ability to get a good deal for the city and the country, Coun Watson said: “I trust the Prime Minister about as far as I can throw her. \n“The recent announcement regarding a hard Brexit is pretty difficult for the North East to swallow.” \nCoun Watson didn’t respond directly to the Nissan boss’ comments but he said it was vital that the UK remains in the single market. \nThe prospect of a Nissan-less Sunderland also raises questions about the IAMP: without that critical mass at the heart of the North East automotive sector, will IAMP be a success? 4. Damage to the New Wear Crossing? It’s ‘fake news’, says the leader The first section of the New Wear Crossing extends over the river (Photo: Hand in from DTW Advertising & Marketing Ltd) \nThere were a few images floating around on social media of what appeared to be damage to the pylon of the New Wear Crossing. \nThe images were taken after the 105m structure had completed its long journey from the Port of Ghent in Belgium. \nIt would have been a little embarrassing if the centre piece of the £117m project turned up with a big dent in it. \nSo were the images authentic? \nAbsolutely not, says Coun Watson, who attacked what he considered sneering when the pictures emerged. \nHe rejected the pictures as “fake news” (a buzzword which is quickly catching on among Sunderland councillors) and assured the chamber that the pylon is in good shape. \nThe huge structure will be heaved into place in a few weeks’ time. 5. That’ll be ‘Mr Mayor’ to you \nOne of the more bizarre exchanges of the evening was between the Mayor of Sunderland, Coun Alan Emerson, and Liberal Democrat councillor Niall Hodson. \nFor reasons known only unto himself, he repeatedly refused to refer to the Mayor as “Mr Mayor”, as is customary in the chamber. \nHe argued that there was no rule dictating how elected officials should speak in the chamber and, despite several warnings, persisted with the small act of defiance. \nThe reaction of the hordes of Labour councillors to this mild transgression was heckling and chuntering, with several calling for Coun Hodson to be banned from speaking for the rest of the meeting. \nMayor Emerson duly obliged, triggering protests from the public gallery, some of whom shouted “let him talk”. \nCuriously, the leader of the council didn’t suffer the same fate when he accidentally referred to the Mayor as ‘madame’. Like us on Facebook", "external_links": [], "published": "2017-01-26T23:25:00.000+02:00", "crawled": "2017-01-26T18:55:26.421+02:00", "highlightTitle": ""}