{"organizations": [], "uuid": "e50659234e00f1dcb9abc0ae9873b4744f932a49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12483780.ece/ALTERNATES/s1200/The-United-Kingdom-Goes-To-The-Polls-In-The-EU-Referendum.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/voters-soon-take-something-along-12483628", "country": "GB", "domain_rank": 21960, "title": "Voters will soon have to take something along with them to cast their ballots", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Voters will soon have to take something along with them to cast their ballots", "spam_score": 0.0, "site_type": "news", "published": "2017-01-22T15:00:00.000+02:00", "replies_count": 0, "uuid": "e50659234e00f1dcb9abc0ae9873b4744f932a49"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/voters-soon-take-something-along-12483628", "ord_in_thread": 0, "title": "Voters will soon have to take something along with them to cast their ballots", "locations": [], "entities": {"persons": [{"name": "chi onwurah", "sentiment": "none"}, {"name": "eric pickles", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "luftur rahman", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "bradford", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Voters will soon have to take something along with them to cast their ballots You can just turn up at a polling station and give a name and address to vote - but is all that about to change? Share Ballot papers on a table marked 'remain' (Photo: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPlans to make voters show identification at polling stations have provoked a fierce debate among North East MPs. \nAt the moment, voters don’t need to show any form of identification when they turn up to vote in an election. \nAnd although many will bring the polling card that was delivered through their letter box, they don’t even need that. Voters simply need to provide their name and address, and they will be given a ballot paper as long as they’re on the electoral register and at the right polling station. \nBut this is set to change, in response to what the Government says is concern about voting fraud. \nNext year, voters in some parts of the country will be told they need a driving licence or passport to vote - and the policy is likely to be extended across the country if the pilot schemes are deemed to be a success. Guy Opperman \nThe idea of telling voters to bring identification was welcomed by Guy Opperman , Conservative MP for Hexham in Northumberland. \nIn a statement posted to his website, he said: “Voter ID pilot is a good thing - it is already the law in Northern Ireland and most other countries, and prevents voter fraud \n“Plans to demand proof of identity before voting in a bid to combat electoral fraud are quite right in my view.” \nHe said the Government wants to “ensure the integrity” of the electoral system. \nBut Chi Onwurah , Labour MP for Newcastle Central, takes a different view. \nShe said: “I think we should make it easier for people to vote.” \nThere was no evidence that fraud at polling stations was widespread, she said. \n“This is a sledgehammer to crack a nut and at the same time it is going to make it harder for people to vote.” \nAnd not everyone has a form of photo identification, she said. \n“Given that we have rejected ID cards, requiring ID for people to vote is particularly strange. \n“Not everyone has a passport and not everyone has a driving licence.” Chi Onwurah \nRequiring ID to vote has been a major bone of contention in the United States, where critics say it has been part of a deliberate attempt to prevent black people and voters from other ethnic minorities from taking part in elections. \nBut there are claims that fraud is more common in the UK than many people realise. \nThe Government appointed Sir Eric Pickles, the former Local Government Secretary, to lead an inquiry into our voting system after an election court removed former Tower Hamlets mayor Luftur Rahman from his post and said he was guilty of “corrupt and illegal practices”. \nThere have also been major voting scandals in cities such as Birmingham. \nBut in both cases, evidence was found of fraudulent postal votes being cast. This is not a problem that can be solved by demanding voters show ID in polling stations. Read More Brexit Britain will leave the single market: North East reaction to Theresa May's speech \nIn a report last year, Sir Eric warned that authorities are in a “state of denial” and are “turning a blind eye” to election fraud. \nAnd he said that there is evidence of voter fraud “especially in communities of Pakistani and Bangladeshi background” but that the cases have been ignored because of “over-sensitivities about ethnicity and religion”. \nTrials voter ID are to take place in cities such as Bradford and Birmingham, which are seen as most vulnerable to fraud, but if they are found to be a success then they would be extended nationwide. Like us on Facebook", "external_links": [], "published": "2017-01-22T15:00:00.000+02:00", "crawled": "2017-01-22T10:52:54.960+02:00", "highlightTitle": ""}