{"organizations": [], "uuid": "665fef1c2124275a54a630f409b9ac19d77cf1cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12524425.ece/ALTERNATES/s1200/Copeland-by-election.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/pressure-mounts-jeremy-corbyn-over-12524323", "country": "GB", "domain_rank": 21960, "title": "Pressure mounts on Jeremy Corbyn over Labour's stance on Article 50 and Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Pressure mounts on Jeremy Corbyn over Labour's stance on Article 50 and Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-01-29T23:31:00.000+02:00", "replies_count": 0, "uuid": "665fef1c2124275a54a630f409b9ac19d77cf1cf"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/pressure-mounts-jeremy-corbyn-over-12524323", "ord_in_thread": 0, "title": "Pressure mounts on Jeremy Corbyn over Labour's stance on Article 50 and Brexit", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "jon", "sentiment": "negative"}, {"name": "chi onwurah  she", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "peston", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "proctor", "sentiment": "none"}, {"name": "jon proctor", "sentiment": "none"}, {"name": "mr proctor", "sentiment": "none"}], "locations": [{"name": "north tyneside", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "north tyneside labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "shadow cabinet", "sentiment": "none"}, {"name": "labour against brexit", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "eurosceptic", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Pressure mounts on Jeremy Corbyn over Labour's stance on Article 50 and Brexit Remain voter Jon Proctor, 24, of North Tyneside, is leading a campaign to get Labour to oppose triggering Article 50 Share Click to play Tap to play The video will start in 8 Cancel Play now Corbyn grills May on Brexit Share this video Get daily updates   \nLabour’s grassroots has turned on the party leadership over Jeremy Corbyn ’s decision to support the triggering of Article 50. \nFollowing the Supreme Court’s ruling that Parliament must vote on Article 50 before it can be triggered, Mr Corbyn announced he would seek to force his MPs to support the Government and vote in favour of beginning the UK’s departure from the EU. \nBut the imposition of the three-line whip has proved to be unpopular with some sections of his own party. \nThis week has already seen two high-profile resignations from the Shadow Cabinet, amid widespread criticism of Corbyn’s position. \nAnd an open letter, started by North Tyneside Labour party activist Jon Proctor, calls for Mr Corbyn to lead Labour against triggering Article 50. It has already received backing from 5,000 grassroots members. Jeremy Corbyn (Photo: PA) \nMr Proctor, 24 and chair of the Labour Against Brexit campaign, said: “We are arguing that the Labour party’s current policy on triggering Article 50 is wrong. \n“It goes against Labour values of protecting those at the lower end of society because the poorest will be the hardest hit by Brexit. \n“The country did not vote to leave the single market or the customs union and we don’t want the Labour party to be giving the Conservatives a blank check on this.” \nAlthough Mr Proctor admits he would be inclined to oppose even a ‘soft Brexit’, there is one situation in which he could accept the UK’s departure from the EU. \nHe said: “The people should have the final say once the final Brexit deal is done and, if people vote in favour of it, we will have to accept that.” \nMr Corbyn’s position over EU membership has become hugely divisive in the party and was one of the sparks for the 2016 challenge to his leadership. \nThe historically Eurosceptic MP was lambasted by critics for what was perceived as lukewarm support for the ‘remain’ campaign, as well as claims he was obstructive towards key campaign figures behind the scenes. \nBut Mr Proctor, who says he opposed Mr Corbyn in the 2016 contest despite backing him in 2015, says the open letter should not be viewed as an attack on the leader. \nHe said: “We are not here to oppose to Jeremy Corbyn’s leadership - we just oppose his stance on this issue.” \nChi Onwurah , MP for Newcastle Central, says she is currently consulting with her constituents over how she should vote on the Article 50 bill. \nShe said she welcomes the debate in Labour over Brexit, adding: “We are a political party, not a Stalinist cult. \n“People have the right to express their opinions and people need to be respectful of that.” MP Chi Onwurah \nShe admits that it’s “impossible” to take a position which would unite her constituents but her aim is to represent Newcastle, rather than simply defer to “party discipline”. \nShe added: “It’s important to have some opposition to what the Government is doing when it’s not in the best interests of the country.” \nAppearing on ITV’s Peston on Sunday, Mr Corbyn indicated he would be willing to sack members of his Shadow Cabinet for going against him. \nHe said: “It’s obviously impossible to carry on being in the Shadow Cabinet if you vote against a decision made after a very frank and long discussion of the Shadow Cabinet earlier this week.” \nMr Corbyn is in a tricky situation over the Article 50 vote. Read More MPs could be given just five days to debate the UK's Brexit bill \nThroughout his political career he has been the archetypal ‘rebel’, defying his party’s position on several key issues. \nNow, he needs to convince his MPs - many of whom are predisposed not to trust his political instincts - to put aside their convictions and follow his lead. \nOn the prospect of front-bench sackings over the vote, Mr Proctor said: “It would be the height of hypocrisy for him to do that. \n“I will campaign with any MP sacked by Jeremy Corbyn over this issue. \n“Any MP who is being threatened will be supported by our campaign in any way we can.” \nMPs will begin a five-day debate on the Brexit bill on Tuesday. \nThe Government’s official timetable is to have begun the process of withdrawal by the end of March. Read More", "external_links": [], "published": "2017-01-29T23:31:00.000+02:00", "crawled": "2017-01-29T19:15:23.227+02:00", "highlightTitle": ""}