{"organizations": [], "uuid": "1850bf6ca44541b6ce67a2a7265d77a7ac27c223", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12498751.ece/ALTERNATES/s1200/Dixons-Carphone-trading-update.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/dixons-carphone-hails-good-christmas-12498706", "country": "GB", "domain_rank": 21960, "title": "Dixons Carphone hails good Christmas after 'ground-breaking' deals", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Dixons Carphone hails good Christmas after 'ground-breaking' deals", "spam_score": 0.0, "site_type": "news", "published": "2017-01-24T19:03:00.000+02:00", "replies_count": 0, "uuid": "1850bf6ca44541b6ce67a2a7265d77a7ac27c223"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/dixons-carphone-hails-good-christmas-12498706", "ord_in_thread": 0, "title": "Dixons Carphone hails good Christmas after 'ground-breaking' deals", "locations": [], "entities": {"persons": [{"name": "james", "sentiment": "none"}, {"name": "george salmon", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}, {"name": "seb james", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "dixons carphone plc", "sentiment": "negative"}, {"name": "dixons carphone", "sentiment": "negative"}, {"name": "invalid email  electricals", "sentiment": "none"}, {"name": "dixons", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "dyson hairdryer", "sentiment": "none"}, {"name": "hargreaves lansdown", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "nordics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dixons Carphone Plc said the Brexit vote had not put consumers off from hitting the shops as it cheered \"strong\" trading (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nElectricals and mobile phones giant Dixons Carphone hailed its fifth year in a row of Christmas sales growth after luring in shoppers with “ground-breaking” deals. \nThe group said it notched up a 6% surge in like-for-like sales across stores in the UK and Ireland over the 10 weeks to January 7, although 4% of this was thanks to sales transferred from closed stores. \nDixons confirmed expectations for a “meaningful” hike in annual profits after its solid festive performance, in line with market forecasts for between £475m and £495m for the year to April 29. \nSeb James, group chief executive of Dixons Carphone, said: “I am pleased to be reporting another good Christmas period of growth - our fifth consecutive year.” \nHe added: “This year, as a result of our scale in all of our markets, we were able to offer prices that were truly ground-breaking during both our Black Friday week and our annual Boxing Day week sales - while maintaining margins - and we believe that we have outperformed the market during the period.” \nThe group said sales growth was particularly strong for UK and Ireland electricals, with like-for-like sales growth of 9%, although again much of this was down to the transfer of sales from closed stores. \nIts festive sales hike came after its biggest ever Black Friday trading in November, while it also cheered a strong online performance - particular for white goods, such as fridges and dishwashers. \nDemand was robust for large screen televisions - a “bellweather for consumer sentiment”, according to Dixons. \nIt said it saw more than 10 times the number of shoppers buying 70 inch televisions. Read More 100 Greggs jobs could be lost with restructuring in Scotland \nOther best-sellers included the Dyson Hairdryer, while it sold one cordless vacuum cleaner every five seconds over the festive season. \nBut it said sales of phones and tablets were hit by “patchy availability” of the larger models and so-called “phablet” smartphones as manufacturers underestimated demand. \nMr James said around 30% of shoppers buying phones wanted the very large models, such as the Samsung Note and Google Pixel XL, but they were in “short supply”. \nDixons said overall group like-for-like sales rose 4% in the 10 week festive period, with sales 1% lower in the Nordics and 5% higher in southern Europe. \nShares in Dixons fell 5% despite its Christmas trading cheer. Read More Newcastle law firm Ward Hadaway in merger to create top 40 business \nGeorge Salmon, equity analyst at Hargreaves Lansdown, cautioned 2017 may prove more challenging for the retailer. \nHe said: “While it enjoys a key advantage in being the last remaining retailer of any scale that customers can visit to buy those must-have electronics, sterling’s weakness makes it increasingly difficult to sell its imported items at knock-down prices and stay competitive with the likes of Amazon.” \nMr James said on announcing half-year results last November the group was planning for “more uncertain times ahead”. \nDixons Carphone buys around 90% of its products in sterling, although its manufacturers are expected to start increasing prices as the Brexit-hit pound sends their costs soaring. \nThe group is hoping to offset this and believes customers will be unlikely to see any noticeable hike in prices. Like us on Facebook", "external_links": [], "published": "2017-01-24T19:03:00.000+02:00", "crawled": "2017-01-24T15:46:18.379+02:00", "highlightTitle": ""}