{"organizations": [], "uuid": "13b1624337b0b722a5bf60d23ba446137ee58c4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30048833/15791554.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/shoe-zone-sees-drop-in-sales-rise-in-profits/story-30048833-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Shoe Zone sees drop in sales, rise in profits | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Shoe Zone sees drop in sales, rise in profits | Leicester Mercury", "spam_score": 0.405, "site_type": "news", "published": "2017-01-11T18:04:00.000+02:00", "replies_count": 0, "uuid": "13b1624337b0b722a5bf60d23ba446137ee58c4e"}, "author": "", "url": "http://www.leicestermercury.co.uk/shoe-zone-sees-drop-in-sales-rise-in-profits/story-30048833-detail/story.html", "ord_in_thread": 0, "title": "Shoe Zone sees drop in sales, rise in profits | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "shoe zone", "sentiment": "negative"}, {"name": "nick davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "johnathan fearn", "sentiment": "none"}], "locations": [{"name": "leicester mercury shoe zone", "sentiment": "none"}, {"name": "humberstone road", "sentiment": "none"}, {"name": "shoe zone", "sentiment": "none"}, {"name": "kirkstall bridge", "sentiment": "none"}, {"name": "launceston", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "shoe zone  shoe zone", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}], "organizations": [{"name": "leeds", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shoe Zone sees drop in sales, rise in profits By Lauren_Mills | Posted: January 11, 2017 0 COMMENTS SHARES Shoe Zone sees drop in sales, rise in profits X \nCopy link to paste in your message / Comments (0) \nSales at Leicester footwear chain Shoe Zone dropped last year, while profits rose. \nThe Humberstone Road business – the UK's largest value footwear retailer – said revenue fell 4.2 per cent from more than £166 million to £159.8 million in the year to October 1. \nThe company said this reflected the \"planned closure of loss making stores\" and \"difficult trading conditions\". \nProfits increased by 1.1 per cent from £10.1 million to £10.3 million, helped by a rise in gross margin from 61.5 per cent to 62 per cent. \nRelated: Brexit fails to knock Shoe Zone \nShoe Zone boss Nick Davis said: \"I am pleased with the group's performance in what was a challenging retail environment. \n\"The group's new branding is resonating well with our customer base and we will continue to update the estate through our store rationalisation and refit programme. \n\"Our 'Big Box' trial, which started in August 2016, is delivering encouraging results while attracting a broader customer demographic and we plan to open a further six new stores across the UK in 2017. \n\"We continue to make good progress on our strategic objectives and have traded in line with expectations for the first quarter of the year. \n\"The board remains positive for the outlook of the group and looks forward to updating shareholders on the progress of our Big Box trial.\" \nRelated: Johnathan Fearn steps into role of Shoe Zone finance director \nShow Zone ended the year operating from 510 stores with 17 new store openings (including 10 relocations). The company said it completed 41 refits during the year, costing a total of £3.4 million. \nThe company said: \"As part of our ongoing investment in updating our store portfolio we have developed new store branding with a more contemporary feel. The new modern logo will be rolled out with future store refits and has already been adopted in all instore and web marketing.\" \nShoe Zone launched its Project 'Big Box' trial in August and Septembr last year when it opened two stores, in Launceston, Cornwall, and Durham, followed by Kirkstall Bridge, Leeds, after its financial year-end. \nThe company said these stores are on average twice the size of its largest outlets and benefit from \"an enhanced branded product range\", driving a higher average transaction value in an enhanced shopping environment. \nShoe Zone said: \"The three trial stores are all located out of town and therefore this concept creates significant opportunity for Shoe Zone in this space with all future openings being out of town locations or in larger high street units. \nThis new growth opportunity is a key strategic development for the business, broadening the reach of the Shoe Zone brand and enabling us to improve our market share.\" ", "external_links": [], "published": "2017-01-11T18:04:00.000+02:00", "crawled": "2017-01-11T14:43:55.538+02:00", "highlightTitle": ""}