{"organizations": [], "uuid": "1535cab5a222c7fddff205ee7f7e5293cc759377", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30099487/15829279.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/business-opinion-may-must-oppose-trump-not-get-into-bed-with-him/story-30099487-detail/story.html", "country": "US", "domain_rank": 48128, "title": "BUSINESS OPINION: May must oppose Trump, not join him | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "BUSINESS OPINION: May must oppose Trump, not join him | Leicester Mercury", "spam_score": 0.132, "site_type": "news", "published": "2017-01-31T18:05:00.000+02:00", "replies_count": 0, "uuid": "1535cab5a222c7fddff205ee7f7e5293cc759377"}, "author": "", "url": "http://www.leicestermercury.co.uk/business-opinion-may-must-oppose-trump-not-get-into-bed-with-him/story-30099487-detail/story.html", "ord_in_thread": 0, "title": "BUSINESS OPINION: May must oppose Trump, not join him | Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nI can't imagine there is anyone out there whose jaw didn't hit the floor when Donald Trump clutched Theresa May's hand as they walked outside the White House last week, writes business editor Tom Pegden . \nThe image – apparently he is scared of steps and ramps – sums up the barmy times we are in. \nAnd I'm sure many of us were left dismayed when Mrs May smiled politely as the BBC's political editor Laura Kuenssberg questioned the leader of the free world on his support for torture, his love of Russia, his stance on abortion and plans to ban some Muslims from coming to America. \nThe lack of official condemnation from the British Government for what Trump is doing makes one fear that Mrs May is backing us into a corner. \nAnti-Trump protests have been held around the UK \nAs we desperately look for new trade partners while turning our back on friends in Europe, one of those with the most potential – the USA – has appointed a President who seems to live in his own special bubble. \nI wouldn't want to do business with someone who won't employ Muslims. \nRead more: Joules profits up as customer numbers grow \nNor would I want to humour a neighbour who thinks it best that the world's refugees are left to die in their homelands. \nYet Mrs May doesn't appear – openly at least – to want anything to get in the way of building links with this man and his political administration which was built on lies and hatred. \nRead more: 100,000 jobs to be created in Leicester and Leicestershire over next 20 years \nNobody likes a bully, which is what many see Mr Trump as. \nRegardless of how important it is for Britain to show we can do business with the world, we should be opposing Trump, not trying to get into bed with him. \nBritain's political situation is not helped by the lack of official opposition. \nThe Lib Dems lost credibility after supporting David Cameron in the coalition – the very person who put us in these dire straits by offering the EU referendum in a desperate bid to avoid a split in his party, and to win the popular vote. \nAnd Jeremy Corbyn seems happy to be in a permanent state of opposition with everyone around him – hardly the sort of person who can force the Government to get its house in order. \nDespite the Brexit vote, Britain's economy has not collapsed. \nHaving said that the Government needs to show strength against the States if it is to win its arguments during negotiations with the EU. \nDonald Trump's isolationist stance must not be allowed to infect the UK in these turbulent times – that is something the British economy most definitely cannot afford. ", "external_links": [], "published": "2017-01-31T18:05:00.000+02:00", "crawled": "2017-01-31T14:41:09.858+02:00", "highlightTitle": ""}