{"organizations": [], "uuid": "fec9dbe8ae5c9600222b876dc778a747d5ce1922", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12500567.ece/ALTERNATES/s1200/Supreme-Court-Rules-On-Governments-Brexit-Appeal.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mps-reveal-whether-12500549", "country": "GB", "domain_rank": 21960, "title": "North East MPs reveal whether they'll vote to trigger Article 50 to leave the EU", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East MPs reveal whether they'll vote to trigger Article 50 to leave the EU", "spam_score": 0.0, "site_type": "news", "published": "2017-01-24T22:30:00.000+02:00", "replies_count": 0, "uuid": "fec9dbe8ae5c9600222b876dc778a747d5ce1922"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mps-reveal-whether-12500549", "ord_in_thread": 0, "title": "North East MPs reveal whether they'll vote to trigger Article 50 to leave the EU", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News North East MPs reveal whether they'll vote to trigger Article 50 to leave the EU After the Supreme Court, ruling we ask our MPs which way they will vote when it comes before parliament Share Click to play Tap to play The video will start in 8 Cancel Play now Supreme Court says Article 50 must be triggered by parliament Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nParliament will have its say on the UK’s departure from the European Union after the Government lost its landmark Supreme Court appeal. \nIn its judgment, the court ruled by a majority of eight justices to three that MPs and peers must give their consent before the Government can trigger Article 50 and formally initiate Brexit . \nAfter Tuesday’s ruling, we contacted North East MPs of all parties to see if they would vote for the process to begin. \nThose who have reached a decision all said they would vote for triggering Article 50, while a small number adopted a ‘wait and see’ attitude. Conservative MP for Berwick Anne-Marie Trevelyan \nAnne-Marie Trevelyan, Conservative MP for Berwick and staunch ‘leave’ supporter, said: “I will vote in favour. \n“The nation, the North East and my constituency have voted clearly to leave the EU and I shall take great delight in voting to uphold the democratically-expressed view of the people.” \nHer party colleague Guy Opperman , who represents Hexham, said: “It is well known in the North East that I campaigned for ‘remain’ in the referendum, but I fully accept the result. \n“You don’t get to pick and choose your democracy - of course I will vote to trigger Article 50.” \nMr Opperman was amused by reports that “arch rebel” and now Labour leader Jeremy Corbyn is to enforce a three-line whip compelling his party’s MPs to vote for the triggering of Article 50. \nThere is talk of around 30 rebelling against his him, although no MPs from the North East we contacted revealed they might take this line. \nKevan Jones , Labour MP for North Durham, said: “Yes I will be voting to invoke Article 50. I accept the result of last year’s referendum to leave the EU and Article 50 is the mechanism to start that process, so I will vote for that process to begin.” \nHe added: “The more difficult job is now to determine what a post-EU Britain looks like. The top priority for the North East must be jobs and tariff free access to the EU for North East exports.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now People of Sunderland talk about Brexit 6 months on from vote   \nMeanwhile Labour’s Emma Lewell-Buck, who represents South Shields, said: “I have always said I accept and respect the referendum result and that I would not vote against the triggering of Article 50. Today’s result has not changed my position. \n“The Government has wasted taxpayers’ money in the courts trying to avoid any democratic scrutiny of their plans to exit the EU. \n“Today’s defeat has proved that only parliament, not Theresa May, has the power to trigger Article 50. \n“In the debates that follow I will press for the best deal possible for my constituents; a deal that protects jobs, the economy and livings standards and a deal that doesn’t sweep away hard fought for social and economic protections.” \nSharon Hodgson, MP for Washington and Sunderland West , has indicated she will vote to trigger Article 50 if she thinks the bill is suitable. \n“It is welcome that this costly and lengthy court case, brought to the Supreme Court by the Prime Minister, is over and we now have clarity to move us forward in the process of leaving the EU,” she said. \n“What is important now is we get on with the task of scrutinising the Bill that will trigger Article 50, which should have been brought before parliament months ago instead of getting embroiled in legal proceedings. \n“Parliament is sovereign in this country, and it is important that we should be consulted on triggering our exit from the EU. \n“I have made clear that I will vote for Article 50 when the time comes, but the Government must be held to account to ensure that jobs and livelihoods are protected as the negotiations begin and we leave the EU.” MP Dave Anderson (Photo: John Stilwell/PA Wire) \nAnd Dave Anderson , Labour MP for Blaydon, said: “I will be voting in line with the Party policy to support the triggering of Article 50. \n“That’s in line with the view if the majority in both my constituency and the nation. We will of course be trying to limit that damage that the extremes of the Tory party will be pushing in negotiations.” Read More \nRoberta Blackman-Woods, Labour’s City of Durham MP , said she has yet to make up her mind how she will vote. Roberta Blackman-Woods, MP for Durham City and Deputy Minister for the North \nShe explained: “I want to wait and see what the Government says in the Bill itself, and what amendments are put down by Labour to the Bill before I make my final decision.” \nNorth East MEP, Jonathan Arnott, of UKIP, said he was “disappointed” by the Supreme Court’s ruling.   now wants to stay in the European Union according to our Brexit poll \nHe added: “There were strong legal arguments put forward on both sides, and ultimately I had hoped that the Government’s case would prevail because it would have reduced the risk of even greater delay to the British people’s decision to leave the European Union. \n“Nevertheless, the ruling has now been made. In the United Kingdom, when something goes against us - an election, a referendum, the final process in a legal case - we accept the result and move on. \n“That is the nature of living in a democracy. I fully accept that this result has gone against my views, and now it is the responsibility of our Westminster parliament to enact the will of the British people and get us out of the European Union.” Like us on Facebook", "external_links": [], "published": "2017-01-24T22:30:00.000+02:00", "crawled": "2017-01-24T17:56:32.368+02:00", "highlightTitle": ""}