{"organizations": [], "uuid": "ddb2b649bcd4d95d67671ac481e2d41eb926f251", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12483611.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/post-brexit-vision-uk-becomes-12483568", "country": "GB", "domain_rank": 21960, "title": "The post Brexit vision of the UK becomes clearer - and it's a jungle out there", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The post Brexit vision of the UK becomes clearer - and it's a jungle out there", "spam_score": 0.0, "site_type": "news", "published": "2017-01-22T01:00:00.000+02:00", "replies_count": 0, "uuid": "ddb2b649bcd4d95d67671ac481e2d41eb926f251"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/news-opinion/post-brexit-vision-uk-becomes-12483568", "ord_in_thread": 0, "title": "The post Brexit vision of the UK becomes clearer - and it's a jungle out there", "locations": [], "entities": {"persons": [{"name": "boris johnson", "sentiment": "negative"}, {"name": "francois hollande", "sentiment": "negative"}, {"name": "mainwarings", "sentiment": "none"}, {"name": "hollande", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "george soros", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "françois hollande", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "hsbc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boris Johnson (left) and Francois Hollande (Photo: PA) Share Get daily   Thank you for subscribing! Could   \nSince last June, those who backed Brexit have been boasting about the state of the economy since the EU referendum . \nThey pointed out, rightly, that experts had predicted it would be immediate doom and gloom if we voted to leave the Europe. \nSince June the stock market has soared, the economy has grown, and we are told - despite the UK being overrun by illegal immigrants stealing all our jobs - record numbers are in work, although the value of sterling did plunge, but, hey, that was good because it made exports cheaper. \nThis led many to wonder what all the fuss was about and ask why didn’t we leave Europe earlier? \nWell, we’re going to find out as the serious stuff is soon to start kicking in. We may have voted to leave the EU, but we’re still in it at the moment and what’s buoyed the markets and the economy is the thought that some quasi EU membership deal could be done. Read More Theresa May accused of betraying the North East over total Brexit plan \nNot anymore. The reaction to Prime Minister Theresa May’s speech last week has revealed a post Brexit view that isn’t so rosy. \nI’m not talking about the ludicrously over-the-top reaction of the Captain Mainwarings in the right wing press who quickly anointed her as Iron Lady II after May talked of walking away from the single market, ironically a single market that was championed by Iron Lady I, Margaret Thatcher, who wrote of it in her 1993 book, The Downing Street Years: “Advantages will indeed flow from that achievement well into the future.” \nIt’s the reaction of business community. The day after May’s speech, HSBC bank and UBS financial services company suggested each could move 1,000 workers out of London, just as the sector had warned before last June’s vote. Financier George Soros (Photo: Getty Images) \nMeanwhile financier and philanthropist George Soros who effectively did for John Major’s Tory government on Black Wednesday in 1992 when he made a £1bn in a run on the pound, said: “At the moment the people in the UK are in denial. The current economic situation is not as bad as was predicted and they live in hope. But as the currency depreciates, and inflation will be the driving force, this will lead to declining living standards.” \nIt all brought to mind French President François Hollande’s comments last October that the UK would have to pay a price for leaving the EU. \nIt’s going to need a lot of diplomacy to ensure not too high a price will be paid. So why am I not reassured that Boris Johnson as Foreign Minister will be at the forefront of these diplomatic efforts? \nJohnson said this week: “If Mr Hollande wants to administer punishment beatings to anybody who seeks to escape, in the manner of some World War Two movie, I don’t think that is the way forward, and it’s not in the interests of our friends and partners.” \nAfter slagging off Donald Trump because of his divisive rhetoric during his presidential campaign, Johnson now seems determined to become the UK version of him. Like us on Facebook", "external_links": [], "published": "2017-01-22T01:00:00.000+02:00", "crawled": "2017-01-21T20:15:12.961+02:00", "highlightTitle": ""}