{"organizations": [], "uuid": "19650a7c2449da68648831c8b1f9b22dcec25b23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30020060/15770431.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/celebrities-and-community-leaders-set-out-their-hopes-for-2017/story-30020060-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Celebrities and community leaders set out their hopes for 2017 | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Celebrities and community leaders set out their hopes for 2017 | Leicester Mercury", "spam_score": 0.453, "site_type": "news", "published": "2017-01-01T13:00:00.000+02:00", "replies_count": 0, "uuid": "19650a7c2449da68648831c8b1f9b22dcec25b23"}, "author": "", "url": "http://www.leicestermercury.co.uk/celebrities-and-community-leaders-set-out-their-hopes-for-2017/story-30020060-detail/story.html", "ord_in_thread": 0, "title": "Celebrities and community leaders set out their hopes for 2017 | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "sam bailey", "sentiment": "none"}, {"name": "edward argar", "sentiment": "none"}, {"name": "ibrahim mogra", "sentiment": "none"}, {"name": "peter soulsby", "sentiment": "none"}, {"name": "alan duncan", "sentiment": "none"}, {"name": "jersey budd", "sentiment": "none"}, {"name": "geoff rowe", "sentiment": "none"}, {"name": "tom joule", "sentiment": "none"}, {"name": "dharmesh lakhani", "sentiment": "none"}, {"name": "alan birchenall", "sentiment": "none"}, {"name": "melton", "sentiment": "none"}, {"name": "abu taher", "sentiment": "none"}], "locations": [{"name": "greece", "sentiment": "none"}, {"name": "golden mile", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}], "organizations": [{"name": "leicester mercury celebrities", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "belgrave business association", "sentiment": "none"}, {"name": "official comedy party", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Celebrities and community leaders set out their hopes for 2017 By Tom_Mack | Posted: January 01, 2017 0 COMMENTS SHARES Leicester people's hopes for 2017 Celebrities and community leaders set out their hopes for 2017 X \nCopy link to paste in your message / Comments (0) \nX Factor winner Sam Bailey \n\"My New Year's resolution is to be slim and fit for my tour in 2017 and also for my 40th birthday. I reckon 40 is the new 21! \n\"The past year has been great and I've been busy so hopefully 2017 will be as good – I've already got lots of holidays booked and I'm going to Florida for my 40th and also off to Greece and Turkey, which will be great.\" \nCity mayor Peter Soulsby \n\"I'd like to see Leicester winning the Champions League – but I'm not holding my breath! \n\"I don't think we're going to find any more royal bones, but they say good things come in threes, so who knows what 2017 may have in store for us.\" \nLeading Leicester imam Ibrahim Mogra \n\"The past year has been painful and we've heard much more about human tragedies than the things we should celebrate about humanity. \n\"I hope that humanity will be able to rediscover it's soul and live peacefully in a hospitable, generous and compassionate way in 2017. \n\"I hope we can learn to resolve disagreements in a peaceful and just way. \n\"I hope it can be a year in which refugees, the poor, the sick and the homeless will be cared for just as we care for our own.\" \nLeicester City ambassador Alan Birchenall \n\"Just staying alive would be my New Year resolution! \n\"Hopefully the team can start to move up the Premier League table as well, and – most importantly – we all enjoy it whatever happens. \n\"For the club, 2016 was the best ever but very sad things have been going on around the world and I just hope lots of these things going on can be resolved. \n\"But my thing is to just keep smiling and enjoy every minute that you can.\" \nCharnwood MP Edward Argar \n\"No one can deny that 2016 was an eventful year, and, while 2017 may well be equality eventful, I hope that it will see an end to the terrible conflicts in Syria, Yemen, and around the world; and that in our own country we will seek to focus on continuing to bring our country and communities together in the spirit of tolerance and mutual respect that has always characterised the UK, and our own county.\" \nRestaurateur and Bangladeshi community leader Abu Taher MBE \n\"It was a great thing to experience the Brexit vote in 2016 and hopefully 2017 will bring us very good things. \n\"Leicester's economy is not bad at all – businesses are growing and people are getting jobs and that will improve further in the future. \n\"In Bangladesh democracy is increasing, more women are getting into politics and there are more opportunities for girls to get free education, which are good things.\" \nMarket Harborough clothes business owner Tom Joule \n\"I hope that in 2017 Mrs May sorts things out - there's a lot of uncertainty around at the moment and I think that eventually that will bite. \n\"But things for Joules are going well so hopefully that will continue in 2017. \n\"We've been trading to expectations and I think that in this industry the companies that are getting it right are doing well.\" \nSinger/songwriter Jersey Budd \n\"I don't make resolutions – I just carry on as usual.. \n\"My album, The Gathering Dust, is out in February so hopefully people will enjoy that in 2017 and come along to see me on tour and have a good time. \n\"I'm also going to be a dad again, so I'm looking forward to that. \n\"We've lost quite a few musicians and stars in 2016 and I hope it's not like that again.\" \nLeicester Comedy Festival and Official Comedy Party founder Geoff Rowe \n\"I hope the Official Comedy Party get elected in Government – that would be my biggest wish for 2017. \n\"I think 2016 was pretty depressing – it's been pretty bleak – so I think people could do with cheering up so hopefully the Leicester Comedy Festival in February will raise a smile.\" \nRutland and Melton MP Sir Alan Duncan \n\"I hope for an end to conflict in Syria and to see productive negotiations with the European Union about our mutual future. \n\"It's been a year of turmoil and instability. Improving things will require strong global leadership for the times ahead.\" \nBelgrave Business Association committee member Dharmesh Lakhani \n\"The past year has been a very bad one for my family with my wife's brother dropping dead at the age of 42 and my father falling ill. So we look forward to putting 2016 behind us. \n\"From a business perspective we didn't have a bad year and we're looking forward to the New Year with optimism.\" \n\"Hopefully there will be some news about the regeneration of the Golden Mile – that all stalled a bit. \n\"And it would be good to see something happening on the former Sainsbury's site.\" ", "external_links": [], "published": "2017-01-01T13:00:00.000+02:00", "crawled": "2017-01-01T10:17:09.931+02:00", "highlightTitle": ""}