{"organizations": [], "uuid": "075221c23773772afd719f3c90c4d9352dfd16ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12474188.ece/ALTERNATES/s1200/Press-Reaction-To-British-Prime-Ministers-Brexit-Speech.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-accused-betraying-north-east-12474073", "country": "GB", "domain_rank": 21960, "title": "Theresa May accused of betraying the North East over total Brexit plan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May accused of betraying the North East over total Brexit plan", "spam_score": 0.0, "site_type": "news", "published": "2017-01-19T01:00:00.000+02:00", "replies_count": 0, "uuid": "075221c23773772afd719f3c90c4d9352dfd16ab"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-accused-betraying-north-east-12474073", "ord_in_thread": 0, "title": "Theresa May accused of betraying the North East over total Brexit plan", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "francois hollande", "sentiment": "none"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "hollande", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "farron", "sentiment": "none"}, {"name": "joseph muscat", "sentiment": "none"}, {"name": "sadiq khan", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "muscat", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu single market", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "malta", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "lancaster house", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "european parliament", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}, {"name": "government", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "die welt", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May accused of betraying the North East over total Brexit plan Exports will suffer if the UK presses ahead with 'hard' Brexit and EU 'divorce', Prime Minister Theresa May told Share A selection of German front pages feature images and stories on British Prime Minister Theresa May's Brexit (Photo: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May was accused of “betraying” the North East after revealing plans for a total divorce from the European Union. \nLiberal Democrat leader Tim Farron claimed the “reckless” scheme would put North East exports at risk. \nIt follows Mrs May’s speech this week, in which she said the UK would leave the EU Single Market but instead “seek the greatest possible access to it through a new, comprehensive, bold and ambitious Free Trade Agreement”. \nMr Farron said: “Over half of all exports from Newcastle and the North East go to the Single Market. \n“This Conservative government’s reckless plans to leave the Single Market would put the success of our proud manufacturing industries at risk. \n“Many people who voted Leave wanted to stay in the common market. Now Theresa May has thrown this possibility out of the window, before negotiations have even begun.” British Foreign Secretary Boris Johnson (Photo: AP) \nBrexit dominated debate at Westminster as Foreign Secretary Boris Johnson came under fire for appearing to accuse EU leaders of considering Nazi-style “punishment beatings” on Britain in revenge for Brexit. \nReferring to French president Francois Hollande, he said during a visit to India: “If Mr Hollande wants to administer punishment beatings to anybody who seeks to escape, in the manner of some World War Two movie, I don’t think that is the way forward, and it’s not in the interests of our friends and partners.” British Prime Minister Theresa May leaves number 10 Downing Street to attend Prime Minister's Questions, just a day after her speech outlining Brexit negotiations (Photo: Getty Images Europe) \nDowning Street insisted that he wasn’t comparing anyone to a Nazi. \nAs the implications of Mrs May’s speech sunk in, it was reported that she planned to call an election if her agreement with the EU was rejected. \nThe Prime Minister has promised that Parliament will get the chance to vote on the UK’s deal with the EU once negotiations have taken place, but it is unclear exactly what will happen if she loses the vote, which is not likely to take place for at least a year. \nReaction in other parts of the EU was mixed. Read More Here's Theresa May's 12-point plan for Brexit - what do you think? \nEuropean Council president Donald Tusk praised Mrs May, comparing her to Sir Winston Churchill in her “warm” support for a successful European Union after she said the UK still wanted to see the EU succeed. \nBut he suggested that her plan to leave the single market was a victory for the remaining 27 EU nations , because it meant the UK had accepted it could not remain in the single market unless it also accepted freedom of movement - something Mrs May says the Government cannot agree to. \nhad come out on top in the first major dispute of the withdrawal negotiations. Read More \n“PM May’s speech proves that unified EU27 position on indivisibility of Single Market finally understood and accepted by London,” wrote Mr Tusk. Prime Minister Theresa May speaking at Lancaster House in London where she outlined her plans for Brexit \nMeanwhile the Prime Minister of Malta, which holds the six-month rotating presidency of the Council, has warned that any Brexit deal granted to the UK will be “inferior” to the terms it enjoys as an EU member. \nJoseph Muscat warned that negotiations under Article 50 of the EU treaties will be “arduous” and said there was “unity” among the 27 remaining members that the principles of free movement of people, goods, services and capital must be maintained. Mrs May’s speech amounted to a confirmation of the EU position that the single market and the four freedoms are “one package”, he said. \n“We want a fair deal for the UK but that deal necessarily needs to be inferior to membership,” Mr Muscat told the European Parliament in Strasbourg. \nEuropean Commission president Jean-Claude Juncker said he would do everything he could to ensure the talks “yield good results”. \nGermany’s Die Welt newspaper has accused Theresa May of “leading Great Britain into isolation”. \nScottish First Minister Nicola Sturgeon hinted a second independence referendum for Scotland is now more likely, saying the Scottish people “did not vote for the direction set out in the Prime Minister’s speech.” Read More North East now wants to stay in the European Union according to our Brexit poll \nAnd London mayor Sadiq Khan said: “A hard-line approach to Brexit may hold the Conservative Party together, but it could rip Britain apart.” \nLabour leader Jeremy Corbyn accused Theresa May of “demeaning” her office and her country by threatening to make the UK an offshore tax haven if she cannot get the Brexit deal she wants from the EU. \nIt follows the Prime Minister’s warning that the UK would be free to set “competitive tax rates” if there is no EU deal. \nMeanwhile, the Supreme Court is to give its judgment in the legal battle over Brexit on January 24. \nIt is considering whether to reject or allow a Government appeal against a High Court ruling which blocked the Government from triggering Britain’s exit from the European Union without Parliament having a say. Like us on Facebook", "external_links": [], "published": "2017-01-19T01:00:00.000+02:00", "crawled": "2017-01-18T20:52:17.232+02:00", "highlightTitle": ""}