{"organizations": [], "uuid": "e6f6738771dee3ceba950694ed2bbb6c6e21c1b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12433628.ece/ALTERNATES/s1200/CFR_NJL_100117kpmg_01.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/kpmg-newcastle-names-david-elliott-12433585", "country": "GB", "domain_rank": 21960, "title": "KPMG in Newcastle names David Elliott as new office senior partner as Mick Thompson retires", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "KPMG in Newcastle names David Elliott as new office senior partner as Mick Thompson retires", "spam_score": 0.0, "site_type": "news", "published": "2017-01-11T07:01:00.000+02:00", "replies_count": 0, "uuid": "e6f6738771dee3ceba950694ed2bbb6c6e21c1b4"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/kpmg-newcastle-names-david-elliott-12433585", "ord_in_thread": 0, "title": "KPMG in Newcastle names David Elliott as new office senior partner as Mick Thompson retires", "locations": [], "entities": {"persons": [{"name": "david elliott", "sentiment": "negative"}, {"name": "mick thompson", "sentiment": "negative"}, {"name": "david", "sentiment": "none"}, {"name": "nick plumb", "sentiment": "none"}, {"name": "chris hearld", "sentiment": "none"}, {"name": "mick", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}, {"name": "thomas swan", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}, {"name": "thompson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "kpmg", "sentiment": "negative"}, {"name": "cbi council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business KPMG in Newcastle names David Elliott as new office senior partner as Mick Thompson retires Mick Thompson will retire from the firm in Spring 2018, and he will hand over the role to David Elliott this March Share KPMG in Newcastle has announced David Elliott as the new office senior partner (Photo: KPMG) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAccountancy giant KPMG has announced David Elliott is to take the firm’s leadership position in the region as Newcastle office senior partner, following Mick Thompson’s retirement from the role. \nMr Elliott is currently the professional services firm’s head of tax and has spent his 30-year career in Newcastle, having joined KPMG from PwC nine years ago to lead the firm’s tax practice in the region \nThe firm said he has since been instrumental in its growth and success, alongside that of its clients in the region, and he will take on the top job as of March 1, ahead of Mr Thompson’s retirement in Spring 2018. \nMick Thompson, who also sits on the regional CBI Council and is an active partner of the North East England Chamber of Commerce, will retire from the firm next year, having spent nine years in the top role. \nMr Elliott will continue to run KPMG’s tax team in the North East, while Mr Thompson will continue to work with audit senior partner Nick Plumb, serving the needs of the firm’s large and varied audit client base. \nIn his current role at the 150-strong Newcastle office he advises a wide variety of clients, including private equity-backed and family firms, also working closely with listed companies and the UK interests of overseas owned businesses, involved in a wide variety of sectors including mining, manufacturing, retail, financial services and property and construction. Mick Thompson is retiring from KPMG (Photo: KPMG) \nHe said: “Having played an active role in this vibrant, regional economy for many years, I am delighted to lead one of the area’s most prestigious firms. \n“The excellent KPMG team based here on the Quayside and our superb client portfolio makes the North East an exciting and rewarding place to work. Read More Thomas Swan plans investment and overseas expansion as turnover tops £25m \n“There’s a great deal going on within KPMG and we need to maintain the momentum of our Enterprise focus alongside our continued commitment to the public sector and listed company arenas, and ensure those leading the region’s organisations know of our appetite to work with them. In terms of projects, we are increasingly calling on an unrivalled combination of technology and colleagues to support clients addressing cyber security, IT transformation, customer experience issues, and of course the impact of the Brexit vote.” \nChris Hearld, KPMG’s North Region Chairman, added: “David is North East through and through, with a longstanding reputation in the regional market. \n“The success he has delivered for our tax practice, developing deep specialisms, for example in capital allowances, innovation reliefs and incentives and M&A tax, plus his energy and appetite for client service makes him a superb fit for this market critical role, driving our strategy for further profitable growth in the future. \n“After a hugely successful, multi award winning tenure as our leader in the region I’m pleased we will continue to benefit from Mick’s tremendous work for a further year as he manages an orderly handover to David and continues to lead on some of our key audit clients, including Greggs and Renew, which will be invaluable at a time when the audit market is more dynamic than ever.” Like us on Facebook", "external_links": [], "published": "2017-01-11T07:01:00.000+02:00", "crawled": "2017-01-11T03:10:15.371+02:00", "highlightTitle": ""}