{"organizations": [], "uuid": "df8a3bad47471a0b9ed388b9368560e8ee941d72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30099274/15828998.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/joules-profits-up-as-customer-numbers-grow/story-30099274-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Joules profits up as customer numbers grow | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Joules profits up as customer numbers grow | Leicester Mercury", "spam_score": 0.672, "site_type": "news", "published": "2017-01-31T16:50:00.000+02:00", "replies_count": 0, "uuid": "df8a3bad47471a0b9ed388b9368560e8ee941d72"}, "author": "", "url": "http://www.leicestermercury.co.uk/joules-profits-up-as-customer-numbers-grow/story-30099274-detail/story.html", "ord_in_thread": 0, "title": "Joules profits up as customer numbers grow | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "joules", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "colin porter", "sentiment": "none"}, {"name": "porter", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicester mercury joules", "sentiment": "negative"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "next plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Joules profits up as customer numbers grow By TomPegden | Posted: January 31, 2017 0 COMMENTS SHARES Joules clothes continue to appeal VIEW GALLERY Joules profits up as customer numbers grow X \nCopy link to paste in your message / Joules clothes continue to appeal Joules is famous for its wellies Comments (0) \nLeicestershire's Joules goes from strength to strength, despite the problems faced by some of its high street competitors. \nThe Market Harborough headquartered country clothing confirmed today that sales were up more than 16 per cent in the six months to November 27, compared with a the same period a year earlier. \nTotal revenue for the business, which specialises in bright coloured men's, women's and kids clothes and wellies, was £81.4 million – up from £70.1 million. \nPre-tax profits for the six months were up a fifth to £7.5 million. \nThe number of shoppers on the Joules database was also up 30 pre cent to 922,000. \nDespite the bright outlook, shares in the business were down marginally this morning to 217p. \nPosting interim results this morning, Joules chief executive Colin Porter said the success was driven by strong growth in its own stores and its supplies to big chains such as Next and John Lewis. \nMr Porter said: \"Joules has continued to perform well during the first half of the financial year with strong growth delivered across the brand's distribution channels and target markets. \n\"This significant progress reflects the quality and design of our products and the growing demand for the Joules brand, both in the UK and internationally. \n\"Group trading over the Christmas period and in the second half of the year to date has been strong and in line with expectations. \n\"The board remains confident in the brand's continued development both in the UK and internationally.\" \nRead more: Nearly 120,000 new homes needed in Leicester and Leicestershire by 2036 \nThe positive news comes just three weeks after Enderby-based fashion and homewares giant Next said it was bracing for a tough 2017 following a worse-than-expected Christmas. \nNext Plc said sales in the 54 days to December 24 fell 0.4 per cent compared to the same time a year earlier, defying hopes of a fourth quarter turnaround, while it posted a 7 per cent plunge in end-of-season clearance sales. \nThe chain said profits for the year to January 2017 were expected to fall by around 3.6 per cent, and sales and profits would remain under pressure in a \"challenging\" year ahead. \nIt also said sales trading woes were set to deepen in 2017, sending profits tumbling potentially as much as 14 per cent in a worst case scenario for the year to January 2018. \nNext also repeated warnings over cost pressures from the Brexit-hit pound, which the group has already said will probably see it hike prices by up to 5 per cent. \nBy contrast, Joules said sales within its own stores – such as the one in Market Harborough town centre – were up almost 16 per cent for the six months, with online sales up almost a third and store sales up more than 11 per cent. \nSales to bigger chains were up 17 per cent, reflecting what the company called \"the growing appeal of the Joules brand\". \nAnd things have been even better in the subsequent seven weeks to January 8, with stores sales up almost 22.3 per cent. ", "external_links": [], "published": "2017-01-31T16:50:00.000+02:00", "crawled": "2017-01-31T14:41:07.037+02:00", "highlightTitle": ""}