{"organizations": [], "uuid": "dbe59e5ebb0b7fc3d7b6fe8cc89be41af50b44a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12274685.ece/ALTERNATES/s1200/JS106630012.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12508989", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: RBS sets aside $3.8bn for mis-selling scandal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: RBS sets aside $3.8bn for mis-selling scandal", "spam_score": 0.0, "site_type": "news", "published": "2017-01-26T14:55:00.000+02:00", "replies_count": 0, "uuid": "dbe59e5ebb0b7fc3d7b6fe8cc89be41af50b44a1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12508989", "ord_in_thread": 0, "title": "Business Breakfast LIVE: RBS sets aside $3.8bn for mis-selling scandal", "locations": [], "entities": {"persons": [{"name": "jonathon manning tsb", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "jeremy darroch", "sentiment": "none"}, {"name": "rupert murdoch", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "jonathon manning sky", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "seaham", "sentiment": "none"}, {"name": "sabadell", "sentiment": "none"}, {"name": "paul pester", "sentiment": "none"}, {"name": "carney", "sentiment": "none"}, {"name": "laith khalaf", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "mike regnier", "sentiment": "none"}, {"name": "robert halfon", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "grey street", "sentiment": "none"}, {"name": "wiesbaden", "sentiment": "none"}, {"name": "grosvenor house hotel", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "u.s. capitol", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "rbs", "sentiment": "negative"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "nifco", "sentiment": "none"}, {"name": "norwich & peterborough", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "blu sky tax", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "yorkshire building society", "sentiment": "none"}, {"name": "deutsche bundesbank", "sentiment": "none"}, {"name": "hargreaves lansdown", "sentiment": "none"}, {"name": "global", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "n&p", "sentiment": "none"}, {"name": "hays travel", "sentiment": "none"}, {"name": "news corporation", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "tsb", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "rsb", "sentiment": "none"}, {"name": "great annual savings group", "sentiment": "none"}, {"name": "yorkshire bank", "sentiment": "none"}, {"name": "banco de sabadell", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "21st century fox", "sentiment": "none"}, {"name": "northumbria healthcare nhs foundation trust", "sentiment": "none"}, {"name": "lloyds tsb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning TSB warns of 'significant' hit to profit after promising staff bonuses \nAfter promising to pay out £28m to staff in bonuses after a strong year high street bank TSB has warned of a “significant” hit to profits in 2017 as it faces soaring costs, low interest rates and an ongoing drop in some of its lending portfolios. \nThe lender is still working to completely separate itself from Lloyds Banking Group’s IT system, and expects outsourcing fees to increase by £100m this year. \nIt said profits would be affected by those costs, as well as rock-bottom base rates and the continued roll-off its Mortgage Enhancement and Whistletree Loans portfolios. But the group said its IT charges are expected to be short-lived, as TSB plans to migrate to its own platform built by Sabadell later this year. \nTSB said: \nIn the meantime, we are continuing to invest in both our digital offering and branch network, to make sure customers experience excellent levels of service however they choose to bank with us. \nWe were delighted to launch the first of our new, purpose-built, flagship branches in Birmingham and Aberdeen at the end of 2016. \nTSB added that it was also keeping an eye on Britain’s economy but was “mindful of the challenges ahead”, including uncertainty surrounding Brexit. Lloyds TSB on Grey Street 8:53 Jonathon Manning Global markets race ahead as investors cheer potential boost from Trump policies \nGlobal markets raced ahead on Wednesday as investors cheered a potential boost from the economic policies of US President Donald Trump. \nIn America, the Dow Jones Industrial Average broke through the psychologically significant 20,000 mark for the first time in its history, while Germany’s Dax reached its highest level since the summer of 2015. \nHowever, trading was more subdued on London’s top flight index, with sterling’s jump to a six-week high against the US dollar holding back progress. The FTSE 100 Index closed up 14.09 points to 7,164.43, with financial and mining stocks leading the charge on the top-flight. \nLaith Khalaf, senior analyst at Hargreaves Lansdown, said the Trump jump had “propelled the Dow Jones to an unprecedented level” as investors snapped up US stocks in anticipation of lower corporate taxes and more government spending. \nAcross Europe, Germany’s Dax rose 1.8% and the Cac 40 in France was 0.9% higher. On the currency markets, sterling was up 0.8% versus the greenback at 1.261, helped by the weakened US dollar and renewed optimism after the Supreme Court ruling on Brexit. \nThe pound had stumbled in the previous session after the Supreme Court ruled the Government does not have to consult the devolved assemblies before kickstarting the Brexit process, but soon regained its poise. Traders said that with a Brexit bill now set to be published on Thursday, there are hopes of less uncertainty, that has plagued the pound in recent months. \nAgainst the euro, the pound was also up 0.7% at 1.174. President Donald Trump delivers his inaugural address on the West Front of the U.S. Capitol (Photo: Getty Images) 8:44 Jonathon Manning Sky upbeat about financial results despite hike in Premier League costs \nPay-TV giant Sky has seen its half-year earnings fall 9% after being hit by a big hike in the costs of broadcast rights to Premier League football matches. \nThe group reported underlying operating profits of £679m for the six months to December 31, following a £314m rise in Premier League costs. \nJeremy Darroch, group chief executive of Sky, said: \nIn a year in which we are absorbing significantly higher programming costs, as a result of the step up in Premier League costs, our financial performance has been good. \nSky has accepted an £11.7 billion takeover offer from Rupert Murdoch’s 21st Century Fox, which already owns 39% of the company and bid to buy the remaining 61% of the business late last year. \nFox needs shareholder approval and the green light from regulators in both the UK and Europe for the offer, which comes five years after the media tycoon’s last tilt at taking full control of the business through News Corporation. Sky HD TV remote control (Photo: PA) 8:40 KEY EVENT Six North East companies named among UK's best apprenticeship employers \nSix companies from the North East have been named among the country’s top 100 employers for developing apprenticeships. \nCompanies from around the UK have been praised at the 13th National Apprenticeship Awards, with North Shields accountancy firm Blu Sky Tax and Seaham’s the Great Annual Savings Group being highly commended. \nNewcastle technology firm Sage , Sunderland travel agent Hays Travel, Stockton’s Nifco and the Northumbria Healthcare NHS Foundation Trust were also included in the national Top 100 Apprenticeship Employers list . \nAfter a selection process, the top employers from all of the National Apprenticeship Awards employer categories went forward to feature in the Top 100 list, which showcases the breadth of employers who now offer apprenticeships. \nSkills and Apprenticeships Minister Robert Halfon said: \nApprenticeships work. They give people of all ages and all backgrounds the ladder of opportunity to get paid experience in work and a top class qualification at the same time. \nThe National Apprenticeship Awards ensure apprenticeships get the prestige they deserve, while shining a light on the fantastic work that both apprentices and their employers do. \nCongratulations to all the winners - they are champions showcasing how apprenticeships to give everyone the chance to get on. Top 100 Apprenticeship Employers 2016 at the National Apprenticeship Awards ceremony at The Grosvenor House Hotel, London (Photo: Hays Travel) 8:33 Jonathon Manning Growing Fintech may risk financial stability without proper rules, warns Carney \nThe Governor of the Bank of England has warned that burgeoning fintech could put financial stability at risk without proper regulation. \nMark Carney said bank profit could suffer if fintech firms start siphoning off “stable” retail income, and cautioned that the reliability of peer-to-peer lending through business cycles has yet to be proven. \nHe also explained that algorithms used in wholesale banking and market trading can lead to excess volatility in financial markets. \nMr Carney added that distributed ledgers - like those using Blockchain technologies - need to meet the highest standards of privacy and reliability. While none of these poses systemic risks on their own, he said regulators need to address emerging vulnerabilities. He said: \nOn the positive side, fintech could reduce systemic risks by delivering a more diverse and resilient system where incumbents and new entrants compete along the value chain. \nAt the same time, some innovations could generate systemic risks through increased interconnectedness and complexity, greater herding and liquidity risks, more intense operational risk and opportunities for regulatory arbitrage. \nMr Carney delivered his warning in a speech at the Deutsche Bundesbank G20 conference in Wiesbaden, Germany. Governor of the Bank of England, Mark Carney 8:28 Jonathon Manning Yorkshire Building Society to close branch in Northumberland town \nA building society branch is to close in a Northumberland town as part of a national restructuring programme . \nThe proposed closure of the Yorkshire Building Society branch in Alnwick comes just a day after it was announced that high street bank HSBC is also to close its branch in the town. \nYorkshire said the closures of 48 branches and the axeing of its Norwich & Peterborough brand would take place over the next 18 months, with around 440 jobs at risk. \nMike Regnier, chief executive of Yorkshire Building Society, said: \nThe driving forces behind the proposed branch closures are shifts in market conditions and an increasing desire among customers to transact digitally rather than on the high street. \nWe therefore no longer believe it is the right commercial position for us to continue to maintain these 48 branches across the N&P and Yorkshire network. Yorkshire Bank logo Jonathon Manning TSB staff to share £28m windfall after bank's profits rise 169% \nDespite the news of RSB’s US fine, it’s not all doom and gloom in the banking sector this morning. TSB has promised to pay out £28m to its 7,700 employees after an impressive jump in pre-tax profit last year. \nThe bank said statutory pre-tax profit rose 169% to £182m in 2016 from £67.6m a year earlier, amid an 11.4% jump in lending to £29.4bn, and a 13.6% rise in customer deposits, which also reached £29.4bn. When stripped of one-off items and currency effects, pre-tax profit rose 68.1% to £177.7m. \nTSB is now preparing to shell out £28m to its 7,700 employees - a £2.5m rise on the bonus award paid out last year. Most will receive a payout equivalent to more than six weeks’ pay or 12.5% of their basic salary. \nChief executive Paul Pester said: \nWhen we launched TSB back in 2013, we set out to do our bit to break the stranglehold of the big five banks and bring a different sort of banking to the UK. Three years on, we’ve shown that a bank focused on serving local communities can really thrive. \nWe’ve grown at twice the pace we aspired to back in 2014. More people chose TSB than ever before in 2016 and we are now Britain’s most recommended high street bank. \nTSB was spun out from Lloyds Banking Group in 2013 and then taken over by Spanish rival Banco de Sabadell in 2015. Lloyds TSB bank logo. TSB was spun out of Lloyds in 2013 8:21", "external_links": [], "published": "2017-01-26T14:55:00.000+02:00", "crawled": "2017-01-26T11:09:32.451+02:00", "highlightTitle": ""}