{"organizations": [], "uuid": "4e160862772cb7fec2b7f38be4d8f6fd0fe8abd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30064437/15803490.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/day-to-remember-for-will-and-pixie-thanks-to-a-little-help-from-friends/story-30064437-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "CathyBuss published 'We are so grateful' - couple enjoy crowdfunding wedding after...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "CathyBuss published 'We are so grateful' - couple enjoy crowdfunding wedding after...", "spam_score": 0.0, "site_type": "news", "published": "2017-01-18T02:30:00.000+02:00", "replies_count": 0, "uuid": "4e160862772cb7fec2b7f38be4d8f6fd0fe8abd3"}, "author": "CathyBuss", "url": "http://www.leicestermercury.co.uk/day-to-remember-for-will-and-pixie-thanks-to-a-little-help-from-friends/story-30064437-detail/story.html", "ord_in_thread": 0, "title": "CathyBuss published 'We are so grateful' - couple enjoy crowdfunding wedding after...", "locations": [], "entities": {"persons": [{"name": "cathybuss", "sentiment": "negative"}, {"name": "cathyb", "sentiment": "negative"}, {"name": "will", "sentiment": "none"}, {"name": "will moore", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "katy wheatley", "sentiment": "none"}], "locations": [{"name": "nottingham", "sentiment": "none"}, {"name": "clarendon park", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "newfoundpool", "sentiment": "none"}], "organizations": [{"name": "highcross  read", "sentiment": "none"}, {"name": "pixie dodd", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "sherwood forest visitors", "sentiment": "none"}, {"name": "east midlands ambulance service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'We are so grateful' - couple enjoy crowdfunding wedding after groom gets cancer diagnosis By CathyBuss | Posted: January 17, 2017 0 COMMENTS SHARES Will and Pixie - a day to remember 'We are so grateful' - couple enjoy crowdfunding wedding after groom gets cancer... X \nCopy link to paste in your message / Comments (0) \nA paramedic and his partner had a day to remember thanks to the kindness and generosity of friends and strangers. \nWill Moore and Pixie Dodd had intended to marry in the summer, but when Will was diagnosed with testicular cancer and told he would need immediate chemotherapy, they wanted to bring the date forward. \nIn a bid to do this, the couple set up a crowdfunding web page to see if they could raise £1,000 to pay for the wedding ahead of the original July 17 date. \nWithin a few weeks, they had smashed the target with donations of more than £4,000. \nIn addition, they had a host of offers from businesses willing to help. Watch flash mob marriage proposal at Highcross \nRead more Amazing flash mob marriage proposal at Leicester's Highcross shopping centre \nWill, an emergency medical technician with East Midlands Ambulance Service , said: \"I have to have three, thick cycles of chemotherapy, and by the time it got to July, when we had originally planned to get married, I would not have been fit enough to enjoy the day.\" \nWill had to have two emergency sessions of chemotherapy but was able to walk down the aisle for the wedding at the Sherwood Forest Visitors' Centre in front of some 60 guests. \nWill, 39, began having problems a little over a year ago but despite tests doctors did not detect that it was cancer and further scans proved \"inconclusive\". \nHowever, following a biopsy at the Queen's Medical Centre in Nottingham he was diagnosed with testicular cancer. \nRead more Leicestershire couples wanted for new series of 'Don't Tell The Bride' \nAt the start of December, Will, from Newfoundpool , Leicester, had his left testicle removed. \nBut since then, he has suffered a number of complications including sepsis and a haematoma, an abnormal collection of blood outside the blood vessels. \nDoctors decided that he needed to begin chemotherapy immediately. \nWill had two treatments before the big day on Thursday, January 5. \nBrexit How would you have voted now we know Theresa May's plan? \nAs he prepares for intensive treatment Will said: \"The wedding was fantastic and we don't have the words to thank people who helped us to make it happen. \n\"It is unreal. There haven't just been financial donations but there are people who have come forward with practical help such as a wedding cake, someone offered to make up wedding favours and there was free make-up session for Pixie - it's been a bit like DIY SOS. \n\"We didn't think we would be able to afford a wedding like this so soon - we are so grateful.\" \nPixie, 23, added: \"We have been through such a lot and this was a day to really enjoy.\" \nKaty Wheatley, a friend of the couple from Clarendon Park who was at the wedding, added: \"It was really nice to see Will and Pixie get married and to see how happy they were.\"", "external_links": [], "published": "2017-01-18T02:30:00.000+02:00", "crawled": "2017-01-17T22:10:38.412+02:00", "highlightTitle": ""}