{"organizations": [], "uuid": "9bc902764ae0920dcaf397753597b98c48969b8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12459302.ece/ALTERNATES/s1200/New-Lord-Speaker-And-Leader-Of-The-House-Take-Up-Their-Positions.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-going-happen-government-departments-12459308", "country": "GB", "domain_rank": 21960, "title": "What is going to happen when Government departments try to defuse their Brexit bombshells?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What is going to happen when Government departments try to defuse their Brexit bombshells?", "spam_score": 0.0, "site_type": "news", "published": "2017-01-17T01:00:00.000+02:00", "replies_count": 0, "uuid": "9bc902764ae0920dcaf397753597b98c48969b8d"}, "author": "Evening Chronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-going-happen-government-departments-12459308", "ord_in_thread": 0, "title": "What is going to happen when Government departments try to defuse their Brexit bombshells?", "locations": [], "entities": {"persons": [{"name": "paul benneworth", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}], "organizations": [{"name": "higher education and research", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion What is going to happen when Government departments try to defuse their Brexit bombshells? North East born academic Paul Benneworth, who works in the Netherlands, says the Government is in denial over Brexit Share The House of Lords chamber (Photo: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEven if the Brexit vote hasn’t led to Britain’s immediate implosion, the spectre of a messy departure is now seriously haunting us. Recent holidaymakers will have noticed just how pricey things seem as foreign currency markets back away from our lemming-like plunge plans. \nMore personally, a number of good friends of mine recently decided they no longer feel at home here. A surprising number of foreign university colleagues have silently slipped away from the UK in the last 6 months to better pastures abroad. \nNone of them have shouted that from the rooftops because most have left with a dominating sense of upset that a country that they’ve grown to love has taken leave of its collective senses. \nThese highly-skilled people have sensed Britain’s changing mood music and decided that there’s better chances elsewhere. \nBut so what?, you might ask if you were a fervent Brexiteer. “If we kick the foreigners out, we can look after our own! \nWe can give local jobs to our local just-about-managing academics”. \nBut UK higher education is an export industry worth billions precisely because it’s a place where any talented person would naturally want to come to better themselves. \nAnd this talent attraction improves the quality of education ‘our’ ‘local’ students receive, with diverse classrooms helping to prepare them for an increasingly diverse outside world. Read More Has the Labour Party fired the starting gun on the 2020 general election? \nThis slow ebb of talent from Britain’s shores is a small symptom of a terrifying political crisis that is starting to engulf our political masters. \nAnd even though no-one’s trumpeting this crisis of political ineptitude from the ramparts, it’s becoming increasingly clear that Theresa May’s government is failing to take decisive action just when we need it most. \nCorbyn’s witless vacillation over immigration policy means you probably missed the absolute clobbering the Government took this week over universities. \nThe House of Lords fundamentally ripped the guts out of the Government’s Higher Education and Research Bill in a way almost unprecedented in recent memory. \nThe scale of the defeat was less shocking than the fact of the defeat, because it’s a problem of the Government’s own making. Every sensible voice in higher education and research in the land has unanimously pleaded with the government to abandon its unworkable ideas for allowing three men and a dog to set up universities. \nBut the Government blithely sought to impose these new rules, and expected universities to suck it up. \nThe Government’s cack-handed politicking saw the unelected Lords stepping up to save our bacon. \nA mightier U-turn is unimaginable as a bill creating a free market for universities ended up defining universities as non-market organisations. \nThis shows clearly how the Government is sliding further by the day into a fantasy bunker mentality where it is right and critics are wrong. Forced by Brexit to deny facts on a daily basis, it now seems the government has lost any remaining grip on reality. Read More \nAt a time when the Government should be legislating to help universities withstand the pains of being ripped from Europe, the Minister is ripping up his bill and starting again. \nSo just imagine the mess when other departments try to defuse their own Brexit bombshells. \nHow will small business, agriculture, the environment, transport, or health cope with vexing events after six years on austerity’s starvation rations? \nJust imagine the pain we’ll all feel when a vital service collapses disastrously because of Whitehall denialism. \nThe university debacle is just a beginning of a coming debacle delivered by a paralysed government obsessed with Brexit and blinded to the public sector’s current parlous state. \nUnless the Government rapidly admits some serious home truths about the current scale of the public service crisis, then 2017 could be the year the whole house of cards comes tumbling down. Like us on Facebook", "external_links": [], "published": "2017-01-17T01:00:00.000+02:00", "crawled": "2017-01-16T20:46:54.049+02:00", "highlightTitle": ""}