{"organizations": [], "uuid": "f31edd57bb1ba2b0189e5bf416145fa9181e5397", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.liverpoolecho.co.uk/incoming/article12463844.ece/ALTERNATES/s1200/JS109265300.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trump-protest-newcastle-friday-12479268", "country": "GB", "domain_rank": 21960, "title": "Donald Trump protest in Newcastle on Friday could see hundreds turn up", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Donald Trump protest in Newcastle on Friday could see hundreds turn up", "spam_score": 0.0, "site_type": "news", "published": "2017-01-19T23:26:00.000+02:00", "replies_count": 0, "uuid": "f31edd57bb1ba2b0189e5bf416145fa9181e5397"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trump-protest-newcastle-friday-12479268", "ord_in_thread": 0, "title": "Donald Trump protest in Newcastle on Friday could see hundreds turn up", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "daniel kebede", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "laura pidcock  ms onwurah", "sentiment": "none"}, {"name": "kebede", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jessie joe jacobs", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington dc", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "us capitol", "sentiment": "none"}, {"name": "dc", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "newcastle unites", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Donald Trump protest in Newcastle on Friday could see hundreds turn up The demonstration at the Monument is one of many protests being staged around the world as Donald Trump is sworn in Share Click to play Tap to play The video will start in 8 Cancel Play now Trump's Inauguration - what actually will happen? Share this video Get daily   \nOrganisers say hundreds of people are expected to gather at the Monument in Newcastle on Friday to protest against US president-elect Donald Trump. \nThe North East demonstration is timed to coincide with the inauguration of Mr Trump in Washington DC in the US. \nDaniel Kebede of the Newcastle Unites group which has helped set up the event in the North East explained the reason behind it. \nHe said: “It’s part of a protest across the UK, the USA and the world to show Donald Trump we don’t accept the racist, sexist and Islamophobic message he has been pushing. \n“It’s important to demonstrate that we can’t let the most powerful leader in the world to abuse his position with such a divisive message.” Jessie Joe Jacobs \nAmong the speakers at the event with be Newcastle Central MP Chi Onwurah , Northumberland councillor and campaigner Laura Pidcock and award winning charity boss and activist Jessie Joe Jacobs. Councillor Laura Pidcock \nMs Onwurah said: “The reason I’m speaking is that during his campaign Donald Trump said a lot of things that were unacceptable and harmed my constituents; women who don’t like the thought of being grabbed, Muslims who don’t like the idea of being discriminated against and not being allowed in the US. \n“It shouldn’t be about building walls but building bridges.” MP Chi Onwurah (Photo: PA) \nMeanwhile across the Atlantic observers say Washington will be turned into a virtual fortress as 1m people are expected in the city for the inauguration ceremony which includes the swearing-in on the steps of the US Capitol and a parade to the White House along streets thronged with spectators. Read More How Donald Trump's presidency will affect people's lives in the UK \nMany of those attending, like Mr Kebede said, will be protesters irate about the New York real estate developer’s demeaning comments about women, immigrants and Muslims, as well as his vow to repeal the sweeping healthcare reform law known as Obamacare and plans to build a wall along the US to Mexico border. Protesters join together for a rally and march \"to prevent the Trump/Pence regime from coming to power,\" on January 17, 2017 in Washington, DC (Photo: Getty Images North America) \nThere are fears they might clash with Trump’s supporters who are also descending on the city, including a cavalcade of bikers. \nMr Kebede said: “We’re living in challenging times whether this message of division is gathering some traction. Not only do we need to oppose what is happening in the US, we need to build movements against racism in the UK.” Read More Donald Trump inauguration: When is it, where can I watch it on TV and what actually happens? \nHe said that Prime Minister Theresa May had “made it pretty clear” that attacking immigration was part of her post Brexit strategy. \n“It’s not immigrants and migrants who are to blame for the NHS crisis, the shortage of school placers and housing but by pushing this divisive message it’s letting them off the hook.” Like us on Facebook", "external_links": [], "published": "2017-01-19T23:26:00.000+02:00", "crawled": "2017-01-19T18:44:42.446+02:00", "highlightTitle": ""}