{"organizations": [], "uuid": "83ad5934152f69fca1c30c3899a7d5c841596699", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30044829/15788239.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/topps-tiles-reports-sluggish-sales/story-30044829-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published Topps Tiles reports sluggish sales", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Lauren_Mills published Topps Tiles reports sluggish sales", "spam_score": 0.0, "site_type": "news", "published": "2017-01-10T18:07:00.000+02:00", "replies_count": 0, "uuid": "83ad5934152f69fca1c30c3899a7d5c841596699"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/topps-tiles-reports-sluggish-sales/story-30044829-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published Topps Tiles reports sluggish sales", "locations": [], "entities": {"persons": [{"name": "topp", "sentiment": "negative"}, {"name": "williams", "sentiment": "none"}, {"name": "matthew williamson", "sentiment": "none"}], "locations": [{"name": "wimbledon village topps tiles", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "topps tiles", "sentiment": "negative"}, {"name": "topps", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Topps Tiles reports sluggish sales By Lauren_Mills | Posted: January 10, 2017 0 COMMENTS SHARES Topps Tiles boutique style store in Wimbledon Village Topps Tiles reports sluggish sales X \nCopy link to paste in your message / Comments (0) \nThe UK's biggest tile retailer reported sluggish sales in the weeks running up to Christmas, with the firm blaming \"softer trading conditions\" for the slowdown. \nEnderby-based Topps Tiles said same-store sales rose 0.3 per cent in the 13 weeks to December 31, compared to an increase of 1.4 per cent in the previous three months. \nTaking into account an extra trading day in the period, due to the timing of public holidays, Topps reckons underlying sales were down 0.3 per cent on a like-for-like basis – which ignores added growth from new store openings. \nRead more: Tiling giant reveals £2m office revamp \nChief executive Matthew Williamson said: \"We experienced softer trading conditions during the first quarter but we remain confident that we have continued to outperform the overall tile market.\" \nHe added: \"Post-Brexit vote elements are there in terms of consumer confidence and some is down to the change to stamp duty for second homes. \n\"I think longer term drivers and the macro outlook are still stong with wages rising and higher employment. \n\"Against this background, our proven strategy, well-invested business and market leading position, leave Topps well-placed for further market share gains in the year ahead.\" \nTopps opened five new stores during the first quarter to bring its total to 356 stores, including 15 boutique stores. \nThe firm expects to open around 15 new stores in the current financial year. \nThe company said it is committed to continued investment in the business, adding it continued to make good progress with its strategy of \"out-specialising the specialists\". \nTopps said it has expanded its trade rewards and loyalty programme in an effort to drive trade sales. \nIt added its decision to stop selling \"low margin\" real wood flooring was paying off, with its wood effect tile ranges delivering \"strong growth\" and its extra-large ranges trading \"ahead of initial expectations\". \nWeak trading at Topps in the first quarter marks a step change from the record sales and profits the company reported in the year to October 1. \nRead more: Topps Tiles CEO feeling calm post-Brexit vote \nBack then the company said record sales pushed up profits by 10 per cent. \nThe tile chain reported pre-tax profits of £22 million in 2016, up from £20.4 million a year earlier. \nTotal sales were £215 million, 1.3 per cent up on 2015. \nThe business said gross margin was up to 61.9 per cent from 61.2 per cent, reflecting improved \"sourcing\" and a focus on evolving product lines. \nDespite the positive 2016 figures, like-for-like growth slowed slightly in that year to 4.2 per cent, from 5.4 per cent in 2015. \nThe business added that there was a drop in consumer confidence after the EU vote, with the longer-term impact still \"unclear.\" \nCommenting on the full-year results, Mr Williams said in October: \"I am pleased to report that Topps has delivered a strong performance for the year, with our unrivalled combination of range, inspiration and convenience resonating with more customers and driving sales to a new record.", "external_links": [], "published": "2017-01-10T18:07:00.000+02:00", "crawled": "2017-01-10T14:40:08.456+02:00", "highlightTitle": ""}