{"organizations": [], "uuid": "65cc146f0dc57c20c40a0d7c5aa465c0ad27a6c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30091282/15823445.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/keith-vaz-send-back-polish-and-romanian-prisoners-before-brexit/story-30091282-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Keith Vaz: 'Send back Polish and Romanian prisoners before Brexit' | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Keith Vaz: 'Send back Polish and Romanian prisoners before Brexit' | Leicester Mercury", "spam_score": 0.991, "site_type": "news", "published": "2017-01-27T16:57:00.000+02:00", "replies_count": 0, "uuid": "65cc146f0dc57c20c40a0d7c5aa465c0ad27a6c4"}, "author": "", "url": "http://www.leicestermercury.co.uk/keith-vaz-send-back-polish-and-romanian-prisoners-before-brexit/story-30091282-detail/story.html", "ord_in_thread": 0, "title": "Keith Vaz: 'Send back Polish and Romanian prisoners before Brexit' | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "keith vaz", "sentiment": "negative"}, {"name": "sam gyimah", "sentiment": "none"}, {"name": "vaz", "sentiment": "none"}], "locations": [{"name": "leicester east", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "albania", "sentiment": "none"}], "organizations": [{"name": "leicester city council", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "prison service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (5) \nKeith Vaz has called on the Government to return foreign prisoners in British prisons to their own countries before the UK quits the EU. \nThe Leicester East MP has highlighted the fact that thousands of inmates from European countries are currently incarcerated in the in British jails at huge annual expense to the taxpayer. \nThe Labour MP raised the issue in Parliament saying it would help reduce pressure on a stretched Prison Service. \nHe said: \"It remains a mystery to me why 12 per cent of our country's prison population happens to be foreign national prisoners. \"Half that 12 per cent —more than 4,000 prisoners —are from EU countries. \n\"Bearing in mind the fact that we will continue to be a member of the EU for the next two years, it is extraordinary that we have not been able to send back more foreign national prisoners from our prisons. \n\"What is the point of undertaking negotiations and signing transfer agreements with EU colleagues if they are unable to take back their own citizens? \nRead more: Thousands of tax non-payers owe Leicester City Council £21m \n\"It must be a priority for the Government to ensure that, in the two years available before Brexit, citizens from countries such as Poland and Romania, which are top of the list in terms of numbers, should be returned to their countries.\" \nMr Vaz added: \"We have heard recently that, under the agreement with Albania, only 17 Albanian prisoners have been transferred from our prisons. \n\"It is not that we are against foreign national prisoners, we are just in favour of their being able to serve their sentences in their countries of origin. \n\"If that happens, it will reduce the prison population by 10,000 and save the taxpayer £169 million, so I very much hope that the Minister will give us some new information that will encourage the House to believe that this issue is being taken very seriously.\" \nPrisons minister Sam Gyimah told MPs this week: \"As of September 30 there were 6,688 foreign national offenders serving a custodial sentence in our prisons. \n\"A further 2,374 foreign nationals are being held in prison on remand or in immigration detention centres. \n\"We are committed to increasing the number of foreign national offenders removed from our prisons, whether they are removed under the prisoner transfer agreement or the early removal scheme. \n\"In 2015-16, 5,810 foreign nation offenders were removed from prisons and immigration removal centres. \n\"That is the highest number since records began, and since 2010 33,000 have been removed.\" \nHe added: \"We have already been in touch with the Department for Exiting the European Union on prisoner transfer agreements.\" ", "external_links": [], "published": "2017-01-27T16:57:00.000+02:00", "crawled": "2017-01-27T14:48:34.212+02:00", "highlightTitle": ""}