{"organizations": [], "uuid": "aa57d7dd7220ca07786fbc98d91f141443a6f255", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12432639.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-would-difference-between-hard-12432571", "country": "GB", "domain_rank": 21960, "title": "What would be the difference between hard and soft Brexit?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What would be the difference between hard and soft Brexit?", "spam_score": 0.0, "site_type": "news", "published": "2017-01-10T23:00:00.000+02:00", "replies_count": 0, "uuid": "aa57d7dd7220ca07786fbc98d91f141443a6f255"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-would-difference-between-hard-12432571", "ord_in_thread": 0, "title": "What would be the difference between hard and soft Brexit?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What would be the difference between hard and soft Brexit? We hear a lot about soft Brexit and hard Brexit but what do the terms mean and what will the difference be? Share EU and Union flags (Photo: PA) Share Get daily   Thank you for subscribing!   \nTheresa May wants to begin the process of leaving the European Union in March this year. \nThat’s when the Prime Minister says she plans formally to tell our EU partners that the UK wants to quit, in line with a process set out in article 50 of the Lisbon Treaty. \nWe won’t leave straight away. There will be up to two years of negotiations. \nBut it does mean that the the UK needs to decide what exactly it hopes to achieve from those talks - and what sort of relationship it wants to have with the EU once we are no longer a member. \nAnd Mrs May’s self-imposed deadline is now just two months away. \nTwo key issues are likely to be trade and immigration. Will we still be free to trade with the EU without restrictions and tariffs, or not? \nAnd will people from EU countries be free to move to the UK, and vice versa, as they are now? \nThe different options are often described as “hard Brexit” and “soft Brexit”. \nThere’s no clear definition for either of these terms. But here’s what they might mean in practice. Read More Manufacturers should prepare for a 'bumpy ride', says North East business leader Hard Brexit \n* Taking the UK entirely out of “freedom of movement”, the current arrangements which allow people from any EU country to move to any other part of the EU. \n* This is likely to mean leaving the EU single market, which currently allows UK firms to trade across the EU without restrictions. \n* The UK could sign a new free trade deal with the EU, but EU nations may be reluctant to agree to anything if freedom of movement is not included. \n* Until a new trade deal is signed, the UK would still be able to trade with the EU under rules set out by the World Trade Organisation (WTO). This would probably mean British exporters had to pay a tariff on some goods exported to the EU. \n* Critics of “hard Brexit” say trading under WTO rules would provide little protection for British firms, because in practice EU countries would be free to discriminate in favour of EU firms when awarding contracts. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-01-10T23:00:00.000+02:00", "crawled": "2017-01-10T18:24:23.332+02:00", "highlightTitle": ""}