{"organizations": [], "uuid": "c05cb4b28d0b18d3236f78fb1fbd40d56a869046", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12469989.ece/ALTERNATES/s1200/CS39240164.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12465094", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE:EE fined £2.7m for overcharging customers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE:EE fined £2.7m for overcharging customers", "spam_score": 0.0, "site_type": "news", "published": "2017-01-18T14:50:00.000+02:00", "replies_count": 0, "uuid": "c05cb4b28d0b18d3236f78fb1fbd40d56a869046"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12465094", "ord_in_thread": 0, "title": "Business Breakfast LIVE:EE fined £2.7m for overcharging customers", "locations": [], "entities": {"persons": [{"name": "leigh day", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "chris watt", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "andy haldane", "sentiment": "none"}, {"name": "tim martin", "sentiment": "none"}, {"name": "coreena ford deliveroo", "sentiment": "none"}, {"name": "coreena ford wetherspoon", "sentiment": "none"}, {"name": "bob middleton", "sentiment": "none"}, {"name": "will shu", "sentiment": "none"}, {"name": "michael fish", "sentiment": "none"}, {"name": "jd wetherspoon", "sentiment": "none"}], "locations": [{"name": "deliveroo", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "burghfield", "sentiment": "none"}, {"name": "aldermaston", "sentiment": "none"}, {"name": "fitzrovia", "sentiment": "none"}, {"name": "cannon street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "apprenticeship levy", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "coreena ford", "sentiment": "negative"}, {"name": "independent workers union of great britain", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "ministry of defence", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford AWE workers set for strike action \nWorkers at the Atomic Weapons Establishment (AWE) are today launching the first of two strikes in a long-running dispute over pensions. \nUnite said 600 of its members at AWE’s two sites at Aldermaston and Burghfield in Berkshire will walk out for 48 hours, and again from January 30. \nThe union said workers felt “deeply betrayed” as promises made a quarter of a century ago guaranteeing their pensions, when they were transferred from the Ministry of Defence to the private sector, have been broken. \nThe union is protesting at plans to close the defined benefit scheme at the end of the month and replace it with a defined contribution one. \nUnite regional officer Bob Middleton said: “It was in the House of Commons in the early 1990s that the then-Tory government made copper-bottomed promises to AWE workers regarding the future of their pensions, once they transferred to the private sector. \n“It is quite clear that this pledge has been shattered and our members feel deeply betrayed. The hallmark of this dispute is a litany of broken promises. \n“The most just course of action would be for the pension scheme to be taken back by the MoD.” The logo for Atomic Weapons Establishment (AWE) 8.25 Coreena Ford Wetherspoon warns of lower sales and higher costs \nPub and restaurant giant JD Wetherspoon has warned that it will be stung by significantly higher costs in the second half of the year, adding that it expects sales to slow. \nThe pubs group said a combination of higher wages, an additional £7m bill for business rates, a £2m hit from the Apprenticeship Levy and “cost increases” mean that it remains cautious. \nChairman Tim Martin said: “In view of these additional costs and our expectation that like-for-like sales will be lower in the next six months, the company remains cautious about the second half of the year.” \nIn the first half, Wetherspoon said like-for-like sales rose 3.4% and total sales increased by 1.6%. \nThe firm said it expects a “slightly improved” trading outcome for the current financial year compared with 2016 and will increase the level of investment in existing pubs from £34m to around £60m. \nBrexit-backing Mr Martin, who has previously accused European leaders of taking a “bullying” approach to the UK, once again used the company’s trading statement to deliver a diatribe on the state of the nation following the EU referendum. \nHe said that Bank of England chief economist Andy Haldane calling economists’ forecasts a “Michael Fish moment” demonstrated a “deep misunderstanding” of the situation. \n“Michael Fish’s predictions were a misinterpretation of data on one evening, under great time pressure. In contrast, the majority of economists, economic institutions, politicians and intellectuals has consistently misunderstood the implications of the euro, its predecessor the exchange rate mechanism and the implications of leaving the EU, over a period of about 30 years,” said Mr Martin. \n“The underlying reason for their catastrophically poor judgement is a semi-religious belief in a new type of political and economic system, represented by the EU, which lacks both proper democratic institutions and the basic ingredient for a successful currency - a government.” JD Wetherspoon chairman Tim Martin 8.20 Coreena Ford Deliveroo to serve up 300 new jobs \nDeliveroo, the restaurant delivery firm, is dishing up more than 300 new jobs as it bids to create one of the “largest technology hubs in the UK”. \nThe hiring spree will create hundreds of new “high-skilled, high-tech jobs” in anticipation of a summer move to its new London headquarters on Cannon Street. \nDeliveroo, which handles tens of thousands of deliveries for 20,000 restaurants, said global orders had rocketed by 650% last year - but it declined to break down the numbers. \nFounder and chief executive Will Shu said the recruitment drive was a sure sign that the firm was going from strength to strength. \nHe said: \nLondon is where I founded this company and it’s from our headquarters here that we export our British-born technology around the world. \nThat’s why we’re now on the lookout for over 300 people to join our engineering team. \nWhen so many of the success stories in the on-demand economy have been grown from America, I am particularly proud to be doing this here in Britain. \nThe fast-rising technology firm, which allows customers to have restaurant food delivered on-demand using an app, employs more than 1,000 people worldwide. \nIt said it will aim to hire experts in software engineering, behavioural economics and algorithm development, which will join its 125-strong tech team. \nThe Independent Workers Union of Great Britain announced last year it was seeking recognition on behalf of Deliveroo drivers in north London. \nLaw firm Leigh Day said it is advising Deliveroo riders on a potential legal action over rights including holiday pay and the national minimum wage. \nRevenues at Deliveroo were on course to hit £130m for 2016, according to reports in June last year. \nThe company is currently based in Fitzrovia, London. Deliveroo Delivery (Photo: Chris Watt Photography) 8.15", "external_links": [], "published": "2017-01-18T14:50:00.000+02:00", "crawled": "2017-01-18T10:33:22.125+02:00", "highlightTitle": ""}