{"organizations": [], "uuid": "e3b01bf9261d1cab237d85bddde610f2c41dfbc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12469294.ece/ALTERNATES/s1200/TMP_NEC_170117JuliaCharlton02JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northumbria-university-staff-survey-reveals-12469240", "country": "GB", "domain_rank": 21960, "title": "Northumbria University staff survey reveals stress, bullying and employees seeking new jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Northumbria University staff survey reveals stress, bullying and employees seeking new jobs", "spam_score": 0.0, "site_type": "news", "published": "2017-01-18T01:25:00.000+02:00", "replies_count": 0, "uuid": "e3b01bf9261d1cab237d85bddde610f2c41dfbc1"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northumbria-university-staff-survey-reveals-12469240", "ord_in_thread": 0, "title": "Northumbria University staff survey reveals stress, bullying and employees seeking new jobs", "locations": [], "entities": {"persons": [{"name": "charlton", "sentiment": "none"}, {"name": "julia charlton", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumbria ucu", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "northumbria university", "sentiment": "negative"}, {"name": "the university", "sentiment": "none"}, {"name": "ucu", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "university and college union", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "northumbria university campus at manors", "sentiment": "none"}, {"name": "the university and college union", "sentiment": "none"}, {"name": "newcastle  ms charlton", "sentiment": "none"}, {"name": "university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northumbria University staff survey reveals stress, bullying and employees seeking new jobs The Northumbria branch of the University and College Union has highlighted damning results from the survey Share UCU union rep at Northumbria University Julia Charlton (Photo: newcastle chronicle) Share Get daily   Thank you for subscribing!   \nNorthumbria University is facing a backlash from academics over changes which they say have increased stress and left nearly half of staff looking for new jobs. \nIn a recent staff survey, 48% of those who responded said they would seek new work within the year, while two-thirds were worried about their job security and half felt “unduly stressed” at work. \nAlthough the university refused to publish the results of the survey publicly, the Northumbria branch of the University and College Union (UCU), which represents academic staff, has issued a response to its findings, highlighting some of the results which it described as “stark but not surprising”. \nJulia Charlton, chair of the Northumbria UCU branch, said: “The atmosphere has definitely deteriorated. We have a staff survey every two years, and since 2008 the numbers of people saying they’re looking for new jobs, or they don’t trust the hierarchy, are getting worse and worse. \n“Clearly the staff are not happy, they are not feeling valued, they are not feeling included. \n“People are feeling very stressed because there’s a new workload calculator which has actually increased their workload significantly, especially as we’ve lost significant numbers of support staff over the last year.” \nMore than 100 support roles at the University were slashed last year, in a cost-cutting exercise designed to save £15. UCU union rep at Northumbria University Julia Charlton (Photo: newcastle chronicle) \nUCU representatives plan to meet with university leaders to discuss concerns arising from the survey, which found that two-thirds of staff are worried about their job security and only a quarter think that the university is well managed. It even highlighted some instances of staff feeling bullied at work. \nMs Charlton said: “The university needs to sit down with the campus unions to work collaboratively with us. The staff survey shows significant numbers of staff (over 5%) complaining of being bullied but afraid to report it. \n“This is a deplorable state of affairs which the university needs to address immediately.” Read More Dozens of Northumbria University jobs already axed despite 'two-year' plan - with more on the way \nThe union has also raised concerns about a university push to improve performance in national league tables and to boost its academic reputation. \nMany staff have suggested that by attempting to compete with the likes of Newcastle University , Northumbria may lose sight of its traditional strengths, including widening access to higher education and offering a wide range of more vocational courses for local people, as well as older and part-time students. The Northumbria University Campus at Manors, Newcastle \nMs Charlton said: “By attempting to rise up the rankings they’ve increased the grades they’re asking for, and in some courses they’re asking for more than Newcastle. \n“But if what we should be doing is serving our local community, we have an obligation to take some less privileged students from the area who will stay and give back to this community, to offer places to people with lower results and more potential. \n“We’re not Newcastle, we’re not Durham — they shouldn’t throw away who we are, and what we do well. We are very good at training up nurses, architects, quantity surveyors, and we should focus on that.” Read More Anger over North East university staff picking up six figure salaries as teaching staff are laid off \nA spokesperson for Northumbria University said: “Our staff are our greatest asset. \n“The staff survey is one of a number of ways in which we seek and welcome regular feedback. \n“It is a barometer which our senior leadership team acknowledges and takes seriously.” \nThe spokesperson insisted that the “positive and constructive discussions” were being held with the campus unions, and that by engaging with staff views they could “continually improve and enhance the overall experience of working and studying at Northumbria”. \nHe added: “All universities are now operating in an increasingly competitive environment, with the implications of Brexit also adding to an unprecedented level of change for the sector. \n“The University has a clear strategy in place to meet these challenges, which is already succeeding across a range of measures. \n“The findings of the survey will help the University improve how it engages with staff to take this strategy forward.” Like us on Facebook", "external_links": [], "published": "2017-01-18T01:25:00.000+02:00", "crawled": "2017-01-17T21:20:45.661+02:00", "highlightTitle": ""}