{"organizations": [], "uuid": "46f5139ad8df347b82098bd757fe19a392cd377c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11945636.ece/ALTERNATES/s1200/JS52178198.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-economy-shows-first-12400566", "country": "GB", "domain_rank": 21960, "title": "North East economy shows first signs of slowdown ahead of potentially turbulent year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East economy shows first signs of slowdown ahead of potentially turbulent year", "spam_score": 0.0, "site_type": "news", "published": "2017-01-04T00:17:00.000+02:00", "replies_count": 0, "uuid": "46f5139ad8df347b82098bd757fe19a392cd377c"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-economy-shows-first-12400566", "ord_in_thread": 0, "title": "North East economy shows first signs of slowdown ahead of potentially turbulent year", "locations": [], "entities": {"persons": [{"name": "north", "sentiment": "neutral"}, {"name": "mike matthews", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "nifco uk", "sentiment": "none"}, {"name": "east england chamber of commerce", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "nifco", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East economy shows first signs of slowdown ahead of potentially turbulent year Survey by North East England Chamber of Commerce shows signs of lower growth in the region Share Mike Matthews MBE, managing director of Nifco UK and European operations officer Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North East economy is showing warning signals of a slowdown ahead of a potentially turbulent year, a new survey suggests. \nFindings of the most recent quarterly economic survey from the North East England Chamber of Commerce show that scores have dropped across a series of key indicators, including domestic sales and workforce, illustrating slower growth rates. \nThe survey also recorded a negative score by export sales, showing a fall during the quarter, though the picture is more positive for exports in the manufacturing sector. \nWith negotiations due to start over leaving the EU, big decisions due in the region over devolution and a new US President bringing potential changes to international markets, the Chamber has warned that decision-makers must be careful to protect growth. \nChamber president Mike Matthews, who is managing director of Teesside car parts manufacturer Nifco (UK), said: “It is vital that Government listens to businesses’ concerns, and goes into this next period with an absolute commitment to maintain confidence and competitiveness in our economy. \n“Local leaders must also do everything to ensure our business conditions in this region are as strong as possible – the onset of devolution in Tees Valley gives a perfect opportunity to ensure this happens. \n“Our members have delivered significant growth in 2016, not least in employment, and our region can’t afford to let that slip in the year ahead.” \nThe Chamber report says that the main issues of concern for businesses are inflation and exchange rates. Read More North East business organisation lays out priorities for 2017 in annual manifesto \nBut there were also some positives in the report, with companies surveyed saying that investment had risen following a pause in the aftermath of last year’s EU referendum. \nExpectations of turnover and profitability for the year ahead remain relatively strong and are above the average level in the survey’s 21-year history. \nThe quarterly survey has been released a day after the Chamber put out its manifesto for 2017, which contained a range of measures it said would make the North East the best place in the country to do business. \nPriorities for the Chamber in the year ahead include lobbying the Government on trade deals and flexible immigration in the light of the Brexit vote, improving the skills of the region’s workforce and doing more to support female entrepreneurs. Like us on Facebook", "external_links": [], "published": "2017-01-04T00:17:00.000+02:00", "crawled": "2017-01-03T19:31:36.391+02:00", "highlightTitle": ""}