{"organizations": [], "uuid": "1db9b43d7fc8447596e2b16ea632f5f1ea89d5d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11875228.ece/ALTERNATES/s1200/JS24862014.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/worry-less-live-your-life-12424262", "country": "GB", "domain_rank": 21960, "title": "Worry less, get on and live your life - the message I took from a visit Down Under", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Worry less, get on and live your life - the message I took from a visit Down Under", "spam_score": 0.0, "site_type": "news", "published": "2017-01-09T18:00:00.000+02:00", "replies_count": 0, "uuid": "1db9b43d7fc8447596e2b16ea632f5f1ea89d5d7"}, "author": "Bernard Trafford", "url": "http://www.chroniclelive.co.uk/news/north-east-news/worry-less-live-your-life-12424262", "ord_in_thread": 0, "title": "Worry less, get on and live your life - the message I took from a visit Down Under", "locations": [], "entities": {"persons": [{"name": "bernard trafford headmaster", "sentiment": "negative"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "poms", "sentiment": "none"}], "locations": [{"name": "barossa", "sentiment": "none"}, {"name": "adelaide", "sentiment": "none"}, {"name": "panama", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "uluru", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "royal grammar school", "sentiment": "negative"}, {"name": "liberal", "sentiment": "none"}, {"name": "aaa", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dr Bernard Trafford Headmaster of the Royal Grammar School, Jesmond Share Get daily   Thank you for subscribing! Could   \nDistance lends enchantment, they say. It also provides perspective. I don’t think our recent three-week holiday in Australia rendered me starry-eyed about the UK to which I’ve just returned, but it didn’t put me off it. \nAustralia’s very different: for a start, it felt bizarre to celebrate Christmas in temperatures above 30 degrees, let alone on a coral island at the southern end of the Great Barrier Reef. \nWhen at last baking sun briefly gave way to rain, it seemed, momentarily, a little more like a UK Christmas! \nOtherwise reindeer, Santas and Christmas trees appeared incongruous in high summer. On the other hand, snorkelling around a coral reef and following turtles and eagle-rays, not to mention the odd small shark, made for a memorable Christmas for all the family. \nVisiting Poms inevitably stick out like sore thumbs. My appearances in chic Sydney beach resorts marked me out: in stark contrast to the resident surf dudes, I was either flabbily pallid or lobster-pink from sunburn. It’s also possible my white linen shirt, very English shorts and Panama hat distinguished me from the locals in their T-shirts and boardies. \nWhen travelling, once I’ve got over the initial sense of difference, I can rarely resist homing in on the similarities I perceive to my home country. We Brits have plenty in common with Oz, including the same language, ethnically and culturally diverse populations and driving on the left. \nOther major countries in the world have English as their first language: the USA, for example. To me, though, there’s a closeness to Australia and Australians in the strongly European flavour that underlies the fiercely patriotic Australian psyche. \nTalking to Australians is easy: their opening gambit, like ours, is to talk about the weather. Christmas brought (mostly) day after day of hot, dry, sunny conditions; even when Sydney’s inhabitants complained of disappointingly cool days, we Poms found 20-25 degrees acceptable. \nI wouldn’t fancy commuting to work in central Sydney in those temperatures, but it was a holiday period. Besides, there’s a fantastic train system (air conditioned and mostly underground); and workers catch water buses and ferries from points all around the massive (and beautiful) Sydney harbour. \nThe weather wasn’t all great. We were booked to go to Uluru, the famous Ayer’s Rock, between Christmas and New Year. Back in the UK you probably saw pictures of waterfalls running down that great monolith: for us an exceptional storm meant a flooded hotel and a cancelled trip. \nInstead we arranged a last-minute trip to Adelaide, a city even more European in nature, with a strong German link. Read More Take a look at the rock art of Northumberland and feel the power of these ancient carvings \nThe storm followed us there and, while it didn’t stop us doing anything, it knocked the power out across the Barossa wine-growing region, which we toured by coach. \nAustralians were furious about the disruption caused by flooding. All the wrangling felt rather familiar. Then there are Australia’s politics. \nThey haven’t (yet) experienced parallels to the Trump election or Brexit, but the centre-right Liberal party seems ready to tear itself apart, its left wing at war with those who lean more towards the right and its nationalist coalition partner. \nWhile the UK’s credit rating dropped to AA in 2016, Australia still enjoys AAA – for now. Pundits reckon it too will be downgraded within 18 months if it doesn’t reduce its budget deficit. \nDifferent country and continent – the other side of the world, in fact – but the same problems with pensions, public services and successive governments borrowing too much. \nNo wonder we felt at home in Oz for three weeks! The same difficulties appear to face all old Western democracies at present. If that’s true (and I fear it is), perhaps I should worry less than I have been recently. \nIn the end, even after the Brexit vote and before a Trump presidency, and even if we consider our politicians incompetent, useless, corrupt or any combination of the three, life goes on: business continues to function; people still buy and rent homes. They have to. \nThe dictum of my great, flawed hero, Winston Churchill, was KBO: Keep B*ggering On. \nIs that what I’ve learned, then? Worry less, get on, and live your life. \nSuch advice appears equally applicable on the other side of the world. Happy new year! Like us on Facebook", "external_links": [], "published": "2017-01-09T18:00:00.000+02:00", "crawled": "2017-01-09T13:09:57.752+02:00", "highlightTitle": ""}