{"organizations": [], "uuid": "e03c9de1cc2e85facef60a63a0ab702e2ab37f6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12486591.ece/ALTERNATES/s1200/Donald-Trump-Is-Sworn-In-As-45th-President-Of-The-United-States.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-president-trump-brexit-both-12486550", "country": "GB", "domain_rank": 21960, "title": "How President Trump and Brexit will both affect North East people living abroad", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "How President Trump and Brexit will both affect North East people living abroad", "spam_score": 0.0, "site_type": "news", "published": "2017-01-22T12:00:00.000+02:00", "replies_count": 0, "uuid": "e03c9de1cc2e85facef60a63a0ab702e2ab37f6a"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-president-trump-brexit-both-12486550", "ord_in_thread": 0, "title": "How President Trump and Brexit will both affect North East people living abroad", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "neutral"}, {"name": "trump", "sentiment": "neutral"}, {"name": "morbihan", "sentiment": "none"}, {"name": "macleod", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "melania", "sentiment": "none"}, {"name": "debbie macleod", "sentiment": "none"}, {"name": "brittany", "sentiment": "none"}, {"name": "tiffany", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "getty images north america", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "wetherby", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north yorkshire", "sentiment": "none"}, {"name": "normandy", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "france property exhibition", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "leggett immobilier", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How President Trump and Brexit will both affect North East people living abroad The possible cost of healthcare in Europe and Trump's clampdown on illegal workers isn't just worrying Mexicans Share U.S. President Donald Trump takes the oath of office as his wife Melania holds the bible (Photo: Getty Images North America) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFirst the Brexit vote and now Donald Trump becoming US President - the consequences of both decisions are set to have a big impact on North East people living abroad. \nThose who emigrated to the European Union , many to France and Spain seeking out the sun, may be forced to return to the UK unless the government guarantees that their healthcare will continue to be reimbursed by the NHS. \nAnd in the US, Trump has vowed to crackdown on illegal immigrants and deport them during his election campaign to create more work opportunities for Americans. \nMuch has been made of his promises to build a wall and keep so-called Mexican ‘illegals’ out. \nLess well known is the fact among the hundreds of thousands of Brits who live legally in the US, a significant number are also illegals, including some from the North. U.S. President Donald Trump acknowledges the audience after taking the oath of office as his wife Melania (L) and daughter Tiffany watch (Photo: Getty Images North America) \nWe spoke to one man who was ironically back home on Tyneside as an anti Trump protest was staged at the Monument in Newcastle on Friday. \nThe man, who didn’t want to be named, said: “It’s my first trip home in a while, I don’t want to say how long and give too much away. \n“I went out there with my girlfriend about 10 years ago. She had friends working out there, I had no job back in the North East - I’m from Gateshead - and just went out for the crack. \n“We started in Chicago and ended up in the Midwest. My girlfriend’s a childminder, I’m a personal trainer now. \n“It’s not a bad life, it’s cool, but to be honest we’ve always been half looking over our shoulder, waiting for the knock. \n“Now Trump’s made a big thing about it, it’s not just Mexicans who are worried.” \nAfter the June 23 Brexit vote there was a reported rush in people looking to move to an EU country, with France a popular choice. \nNext week The France Show is being staged at London’s Olympia. From January 27 to 29 visitors will get an insight into the French style of living. \nIt is one of the major exhibitions for Francophile in this country with wine tasting, food and entertainment as well as estate agents giving tips about properties abroad. Three bed country cottage in Normandy, £112,000 (Photo: Leggett Immobilier) \nEvent organiser Debbie Macleod said: “Many visitors just come for the day to get a brief flavour of France. \n“The France Property Exhibition is a bit different and a better indicator of interest in emigrating. More people who are seriously considering the move to France go to that. Visitor numbers have remained about the same.” Read More \nIt takes place in May at Wetherby in North Yorkshire and is always popular with people from the North. Three bed house Morbihan, Brittany, £120,000 (Photo: Leggett Immobilier) \nMs Macleod said: “People are biding their time, waiting to see what happens. To be honest people are always returning to the UK from France - as many as those who go out there. Health reasons and to be closer to family when they get older are the usual reasons. \n“The exchange rate as much as anything is putting people off at the moment. Sterling is down 20% on last year to about 1.16 euros.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-01-22T12:00:00.000+02:00", "crawled": "2017-01-22T09:36:14.774+02:00", "highlightTitle": ""}