{"organizations": [], "uuid": "a5a484ba16c9ca316805c4f3074cb4d46ce661fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12426303.ece/ALTERNATES/s1200/CFR_NJL_090117nixon_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-nixon-hire-acquires-depot-12426028", "country": "GB", "domain_rank": 21960, "title": "Newcastle's Nixon Hire acquires depot from rival Hewden which collapsed amid Brexit uncertainty", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle's Nixon Hire acquires depot from rival Hewden which collapsed amid Brexit uncertainty", "spam_score": 0.0, "site_type": "news", "published": "2017-01-09T20:27:00.000+02:00", "replies_count": 0, "uuid": "a5a484ba16c9ca316805c4f3074cb4d46ce661fe"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-nixon-hire-acquires-depot-12426028", "ord_in_thread": 0, "title": "Newcastle's Nixon Hire acquires depot from rival Hewden which collapsed amid Brexit uncertainty", "locations": [], "entities": {"persons": [{"name": "nixon hire", "sentiment": "negative"}, {"name": "morris leslie", "sentiment": "none"}, {"name": "heaton", "sentiment": "none"}, {"name": "nixon", "sentiment": "none"}, {"name": "graham nixon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "hewden", "sentiment": "none"}, {"name": "north east  five", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "business newcastle", "sentiment": "negative"}, {"name": "nixon hire", "sentiment": "none"}, {"name": "hewden", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle's Nixon Hire acquires depot from rival Hewden which collapsed amid Brexit uncertainty A number of jobs have also been saved by Nixon Hire as part of the multi-million pound deal Share Nixon Hire has made a Nottingham acquisition (Photo: Nixon Hire) Share Get business   Thank you for subscribing!   \nNorth East plant hire firm Nixon Hire has made a multi-million pound acquisition of a depot from a rival company which collapsed into administration after being hit by Brexit uncertainty. \nHeavy machinery rental company Hewden, headquartered in Manchester, called in administrators from EY at the end of last year, having previously warned how it had been affected by uncertainty following the vote to leave the EU. \nNow Newcastle-headquartered Nixon Hire has acquired the Nottingham depot, one of 40 previously owned by Hewden. \nThe deal saw Nixon Hire, which won Company of the Year at the North East Business Awards in 2014, take ownership of the plant equipment and premises from midnight on December 20, and a number of jobs have also been saved in the move. \nManaging director Graham Nixon said: “I’m delighted that we have been able to successfully negotiate taking ownership of this site and the associated equipment. \n“I’m also extremely pleased that we have been able to provide employment to staff left uncertain of the depot’s future following the collapse of Hewden. \n“It was very important to us to retain the knowledgeable, experienced and local staff to help us take the business forward. Read More Bottle shop opens in Heaton as coffee entrepreneur expands into craft beer \n“Nottingham is a prime location for Nixon Hire and falls in line with our plans for expanding our depot network further south. \n“I can confirm that this depot will offer products from each of our divisions to include plant, accommodation, toilet and welfare facilities. \n“We already have a strong customer base in the south thanks to our rehire and sales divisions however we are confident that having a physical presence will further bolster customer relations and provide an opportunity for business growth. \n“We are excited about this new venture for Nixon Hire. As 2017 see’s Nixon Hire celebrate 50 years of trading, it’s quite fitting that we have this exciting project to look forward to in such an important year for the business.” Read More New CrossFit centre in Newcastle's Ouseburn to be first of many in North East \nFive former Hewden employees have now transferred over to Nixon Hire and the firm is in the process of recruiting for remaining vacancies, some of which have been filled by ex-Hewden employees. \nEY has sold off various parts of Hewden to other UK plant hire operations, including four other depots to fellow rental firm Morris Leslie. \nIt is understood around 200 jobs have been saved out of Hewden’s 750-strong workforce so far, as part of the deals. Like us on Facebook", "external_links": [], "published": "2017-01-09T20:27:00.000+02:00", "crawled": "2017-01-09T15:48:59.527+02:00", "highlightTitle": ""}