{"organizations": [], "uuid": "2170437e07408d7fb8783e63d3a2f876f9759524", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12028731.ece/ALTERNATES/s1200/JS102309985.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/hedgehog-lab-launches-new-office-12485276", "country": "GB", "domain_rank": 21960, "title": "hedgehog lab launches with new office in Denmark before Brexit bites", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "hedgehog lab launches with new office in Denmark before Brexit bites", "spam_score": 0.0, "site_type": "news", "published": "2017-01-23T07:01:00.000+02:00", "replies_count": 0, "uuid": "2170437e07408d7fb8783e63d3a2f876f9759524"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/hedgehog-lab-launches-new-office-12485276", "ord_in_thread": 0, "title": "hedgehog lab launches with new office in Denmark before Brexit bites", "locations": [], "entities": {"persons": [{"name": "post-brexit", "sentiment": "none"}, {"name": "mark forster", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "paul morris", "sentiment": "none"}, {"name": "sarat pediredla", "sentiment": "none"}], "locations": [{"name": "denmark", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "university of the arts london", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "mitsubishi", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "news uk", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "nordics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "hedgehog lab launches with new office in Denmark before Brexit bites The mobile app developer said it was 'essential' that the firm had access to the Single Market Share hedgehog lab CEO Sarat Pediredla, left, with chief operating officer Mark Forster Share Get business   Thank you for subscribing! Could   \nNewcastle app developer hedgehog lab has opened an office in Denmark as the tech firm looks to grow its business in Europe and ensure access to the Single Market following the Brexit vote. \nThe Copenhagen office has initially launched as a sales and customer centre but the tech firm hopes to further develop the site into its European headquarters. \nThe move follows research into the Nordic market, which showed that while the region is home to large consultancies and many micro-businesses, there was a demand for mid-sized firms specialising in mobile technology. \nSarat Pediredla, hedgehog lab’s CEO, said: “We’d been interested in the Nordics for quite some time and, although we explored alternative options, Denmark - which is an hour-and-a-half from Newcastle on a plane - emerged as the best location. \n“We are committed to keeping our global headquarters here in the North East, but post-Brexit felt it essential we had access to the Single Market. We expect Copenhagen to be as a big as our US business in five years’ time and are tremendously excited about this new opportunity.” \nhedgehog lab is already an international business with offices in Austin, Boston, London and India, as well as Newcastle. \nThe firm’s first US office was opened in Boston while the firm was still classed as a micro-business. The Austin office was later opened in 2016. Denmark has repeatedly been voted the best place in the world to do business but it also offers hedgehog lab access to other areas of mainland Europe, including Germany. Read More Nissan will review its Sunderland plant after Brexit, boss says \nThe app developer conducted “extensive research” into the Nordic market, which showed that there was a clear demand for mid-sized firms specialising in mobile development. \nThe Denmark launch is being overseen lead strategist Paul Morris, who has relocated to Copenhagen until a permanent managing director is appointed. hedgehog lab head strategist Paul Morris, who is launching the company's Denmark office (Photo: Hedgehog Lab) \nMr Morris said: “I see this as a chance to take my skills and experience overseas to promote the Hedgehog Lab brand in a highly promising market. \n“The role will see me networking, forging new relationships and making connections on the ground to form a strong foundation from which the European office can thrive.” \nhedgehog lab has developed products for AkzoNobel, Mitsubishi, News UK, Channel 4, and the University of the Arts London. \nCo-founder Mark Forster has also been appointed as chief product officer at the tech firm. The move has been made as Hedgehog Lab looks to develop its own products on top of its consultancy work. Like us on Facebook", "external_links": [], "published": "2017-01-23T07:01:00.000+02:00", "crawled": "2017-01-23T03:19:22.785+02:00", "highlightTitle": ""}