{"organizations": [], "uuid": "b74bc4d35b0b4c1546cd9df50acecf05b4f75915", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12441559.ece/ALTERNATES/s1200/Barratt-Developments-results.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/housebuilder-barratt-developments-slows-land-12441488", "country": "GB", "domain_rank": 21960, "title": "Housebuilder Barratt Developments slows land spending in the wake of Brexit vote", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Housebuilder Barratt Developments slows land spending in the wake of Brexit vote", "spam_score": 0.0, "site_type": "news", "published": "2017-01-12T17:03:00.000+02:00", "replies_count": 0, "uuid": "b74bc4d35b0b4c1546cd9df50acecf05b4f75915"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/housebuilder-barratt-developments-slows-land-12441488", "ord_in_thread": 0, "title": "Housebuilder Barratt Developments slows land spending in the wake of Brexit vote", "locations": [], "entities": {"persons": [{"name": "newcas", "sentiment": "negative"}, {"name": "david thomas", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "barratts", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "housebuilder barratt developments", "sentiment": "negative"}, {"name": "business housebuilder barratt developments", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "invalid email  housebuilder barratt developments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Housebuilder Barratt Developments slows land spending in the wake of Brexit vote The Newcastle-founded business also said it is on course for a half-year profits boost as strong demand for new homes continues Share Signs on a Barratt Developments site (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHousebuilder Barratt Developments has cheered the “healthy” UK housing market, as strong demand looks set to boost half-year profits. \nFounded in Newcastle in the 1950s, the FTSE 100 firm said it predicts pre-tax profits to rise 7% to around £315m for the six months to the end of December, driven by “robust consumer demand”. \nYet while the land market remains attractive to Barratts, it said the amount it spent on securing operational land opportunities dropped in the wake of the Brexit vote . \nDuring the period the purchase of £328.2m of operational land was approved, lower than the £558.7m spent in the same period last year, equating to 39 sites and 5,262 plots. \nThe firm said it had remained cautious following last June’s referendum, prompting the lower spend compared to historical levels. \nIn a stock market statement the group said: “For the period this is lower than historical levels impacted by our caution immediately following the EU referendum. \n“We expect to approve around 15,000 plots in FY17 as a whole and we remain on track to achieve our targeted owned land bank of at least 3.5 years by the year end. \n“We continue to invest in strategic land and approved the options on 17 strategic sites equating to 6,562 plots. \n“We remain on track to deliver in excess of 25% of completions from strategic land in the medium term.” Read More Housebuilders have 'licence to print money' as housing boom drives up sales \nThe developer said completions outside London had hit their highest level for nine years at 6,813, up from 6,784 for the six months in 2015, and the firm saw stronger reservation trends, particularly in Scotland, the North of England, the North West and West Midlands. \nHowever, total completions fell 6% to 7,180, triggered by a 56% drop in completions across the capital to 367, down on the comparable period’s 842, as the firm’s planned building schedule impacted the availability of wholly-owned sites. \nThe firm said it is also committed to investing in the future of housebuilding as the largest employer of apprentices in the industry, and that it continues to develop, trial and implement modern methods of construction which can help address industry-wide skills challenges and support future growth. Read More Construction industry booms - but Brexit uncertainty creeps in \nChief executive David Thomas said the group was in a strong position for the second half of the year after seeing total forward sales rise 15.8% to £2.3 billion. \nHe said the fundamentals of the housing market were robust and the firm was focused on delivering “attractive shareholder returns”. \n“This has been another good half year for the Group. \n“Consumer demand is strong benefiting from good mortgage availability and ongoing government support. Our healthy forward order book and this strong demand leaves us on track to deliver on our volume guidance for the full year. \n“Barratt’s continued commitment to quality design, build and excellence in market‐leading customer service is reflected in our strong performance and ensures we remain a housebuilder of choice. Our focus remains on maintaining good operational and financial performance, and delivering attractive shareholder returns. The fundamentals of the market are robust.” Like us on Facebook", "external_links": [], "published": "2017-01-12T17:03:00.000+02:00", "crawled": "2017-01-12T12:35:52.292+02:00", "highlightTitle": ""}