{"organizations": [], "uuid": "96d447032f121f8cd505d38472dda263b719245c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12465070.ece/ALTERNATES/s1200/Inflation-figures.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/inflation-hits-two-half-year-12465055", "country": "GB", "domain_rank": 21960, "title": "Inflation hits two-and-a-half year high as food prices rise", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Inflation hits two-and-a-half year high as food prices rise", "spam_score": 0.0, "site_type": "news", "published": "2017-01-17T17:42:00.000+02:00", "replies_count": 0, "uuid": "96d447032f121f8cd505d38472dda263b719245c"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/inflation-hits-two-half-year-12465055", "ord_in_thread": 0, "title": "Inflation hits two-and-a-half year high as food prices rise", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "mike prestwood", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Inflation figures are higher than economists expected, reaching a two-and-a-half year high (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nInflation soared to its highest level in two and a half years last month, as air fares rose and the plunge in the pound started to affect food prices. \nThe Office for National Statistics (ONS) said the Consumer Price Index (CPI) measure of inflation hit 1.6%, up from 1.2% in November. \nEconomists were expecting a rise of 1.4%. \nThe move pushed CPI to its highest level since July 2014, when it also reached 1.6%. \nSeparate figures for the Producer Price Index (PPI) showed that factory gate prices rose 2.7% year-on-year in December, as manufacturers started to pass through higher input costs following the collapse of the pound. \nONS head of inflation Mike Prestwood said: “This is the highest CPI has been for over two years, though the annual rate remains below the Bank of England’s target and low by historical standards. \n“Rising air fares and food prices, along with petrol prices falling less than last December, all helped to push up the rate of inflation. \n“Rising raw material costs also continued to push up the prices of goods leaving factories.” \nThe jump in food prices was one of the biggest contributors to rising CPI, with a hike in the cost of vegetables helping push overall food up by 0.8% between November and December, having been flat a year earlier. \nThe ONS said the 12-month rate for food prices was still negative, down 1% on the year, but that was still the highest since July 2014. \nSupermarkets have been locked in a bitter price war, with discount grocers putting pressure on competitors. However, there are signs that the Brexit-hit pound is starting to push up prices at the till, particularly for imported goods. \nSterling weakness was a factor in rising food prices, but was not the sole contributor to the jump, the ONS said. \nIt follows a significant drop in sterling, with renewed Brexit jitters having sent the pound as low as 1.21 against the US dollar in December, a 19% drop from its pre-referendum high on June 23. Read More \nA bumper 49% rise in air fares between November and December contributed to a 2.9% jump in overall transport prices. \nThat is compared with a rise in air fares of 46% a year earlier. \nThe cost of living was also pushed up by fuel prices which fell by a smaller amount than they did a year earlier, dropping 0.4% between November and December, compared with 2.8% over the same period in 2015. Read More Port of Tyne to celebrate record year for cruise ships \nThe price of petrol at the pump fell by 0.8p per litre to 114.6p in December, while diesel was steady at 118p. \nThat was affected by oil production cuts announced by the Opec cartel in November, with wholesale crude prices up from around 49.09 US dollars per barrel (£40.72) to nearly 54.86 US dollars per barrel (£45.50) by December 30. \nThe Retail Prices Index (RPI) - a separate measure of inflation that includes housing costs - rose to 2.5%, up from 2.2% in November. Like us on Facebook", "external_links": [], "published": "2017-01-17T17:42:00.000+02:00", "crawled": "2017-01-17T12:54:15.427+02:00", "highlightTitle": ""}