{"organizations": [], "uuid": "83b19588e4090fa6e0812fb378a549b0141bb3e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30064656/15804740.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/globe-trotting-couple-to-spend-a-year-travelling-the-world-while-working-remotely/story-30064656-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Mattioli Woods couple to spend year travelling world - while...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published Mattioli Woods couple to spend year travelling world - while...", "spam_score": 0.0, "site_type": "news", "published": "2017-01-18T02:05:00.000+02:00", "replies_count": 0, "uuid": "83b19588e4090fa6e0812fb378a549b0141bb3e5"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/globe-trotting-couple-to-spend-a-year-travelling-the-world-while-working-remotely/story-30064656-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Mattioli Woods couple to spend year travelling world - while...", "locations": [], "entities": {"persons": [{"name": "mattioli woods", "sentiment": "neutral"}, {"name": "hinckley", "sentiment": "none"}, {"name": "suzanne", "sentiment": "none"}, {"name": "suzanne walker", "sentiment": "none"}, {"name": "chris smith", "sentiment": "none"}, {"name": "sara andrews", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "phnom penh", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "kuala lumpur", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}], "organizations": [{"name": "comments shares office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mattioli Woods couple to spend year travelling world - while working remotely By danjmartin | Posted: January 17, 2017 0 COMMENTS SHARES Office workers take remote working to the EXTREME Mattioli Woods couple to spend year travelling world - while working remotely X \nCopy link to paste in your message / Comments (0) \nA globe-trotting couple are taking remote working to a new level. \nChris Smith and Suzanne Walker are spending 2017 visiting 12 cities in a once-in-a-lifetime travel adventure spanning more than 35,000 miles. \nBut unlike most people with a passion to see the world, Chris and Suzanne haven't had to quit their full-time careers to go on the epic, year-long tour. \nInstead, bosses at wealth management company Mattioli Woods, in Leicester, are allowing them to keep their jobs – working their normal contracted hours via the internet from far off places such as Kuala Lumpur, Phnom Penh and Bogota. \nBrexit How would you have voted now we know Theresa May's plan? \nChris, 36, said: \"Technology means people no longer have to be tied to the office to get their work done each day. \n\"We might not always be working at the exact same time as our colleagues back in the UK because of different time zones. But we will always be contactable and, thanks to the digital age, we will have the means to fulfil our work duties just as though we were at our desks\". \nThe couple, from Hinckley , have jetted out to Mexico City on the first leg of a trip combining business with pleasure in some of the world's greatest cities. \nThey will spend a month in each of the 12 locations, working remotely from serviced offices during the day and connecting with local cultures and business ecosystems. They will reserve evenings, weekends and holidays for sightseeing and exploration. \nSuzanne, 33, says: \"Most tourists have to cram in so many things in a very short space of time. We won't have that pressure, as we'll have a month at each destination to fit in everything we want to do. \n\"It's incredibly exciting to be the first people in the company to trial this arrangement. Everyone at work has been really supportive and positive about it\". \nRead more Old five pound notes will soon cease to be legal tender \nTechnical specialist Suzanne and Chris, a senior customer relations manager, will join a party of more than 70 fellow professionals – known as \"digital nomads\" – on an expedition organised by US specialists Remote Year. Most of the other travellers are from America. \nThe company has put together a package including travel arrangements, accommodation and office facilities. \n\"We will fly to each destination with the rest of the group and there is opportunity to meet up with them whenever we want to, but most of the time we'll be doing our own thing and exploring the surroundings\", adds Suzanne. \nRead more Households watching pirate TV can expect a scary letter through the door soon \nMattioli Woods' chief people officer, Sara Andrews, said: \"To retain key talent we sometimes have to make things happen that are outside our comfort zone. \n\"I am delighted that, as a business, we have been able to support Suzanne and Chris on the Remote Year programme, which enables them to combine work with their dream of travelling. \n\"We look forward to regular updates from their destinations, but also to see how effective and productive remote working can actually be.\" Travel log– the couple's itinerary \nJanuary – Mexico City, Mexico", "external_links": [], "published": "2017-01-18T02:05:00.000+02:00", "crawled": "2017-01-17T22:10:46.615+02:00", "highlightTitle": ""}