{"organizations": [], "uuid": "aa04555f2e2707e32aa770c2292dd7380e061afb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12389245.ece/ALTERNATES/s1200/trumpcorbyn.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hard-right-left-policies-more-12385401", "country": "GB", "domain_rank": 21960, "title": "The hard right and left policies more popular with the public than people realise", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The hard right and left policies more popular with the public than people realise", "spam_score": 0.0, "site_type": "news", "published": "2017-01-01T12:00:00.000+02:00", "replies_count": 0, "uuid": "aa04555f2e2707e32aa770c2292dd7380e061afb"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hard-right-left-policies-more-12385401", "ord_in_thread": 0, "title": "The hard right and left policies more popular with the public than people realise", "locations": [], "entities": {"persons": [{"name": "chris grayling", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "farr", "sentiment": "none"}, {"name": "martin farr", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "victoria station", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "southern rail", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The hard right and left policies more popular with the public than people realise Opinion polls reveal the public is more radical than the politicians who represent them, as we found out Share Donald Trump (left) and Jeremy Corbyn (right) show how the public in 2016 embraced radical politics Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWith Brexit, the re-election of Jeremy Corbyn as leader of the Labour party , the rise of UKIP and even Donald Trump being President-elect of the US, a new wave of radical politics has washed over the world in 2016. \nYet while political experts have scratched their heads as to what has caused it, the obvious answer is they are reflecting the public mood. \nFor opinion polls published even before these seismic political happenings showed that the public is still in many ways more radical than the politicians who are supposed to represent them. \nAnd this applies to policies seen as hard left and hard right. \nFor a start, re-nationalising the railways. There has been growing talk of this of late with the ongoing chaos on Southern Rail. \nHowever underfire Transport Secretary Chris Grayling has dismissed it out of hand. Commuters stage a protest at Victoria Station, London (Photo: PA) \nYet an opinion poll by YouGov revealed 59% support for it against 21% who oppose it. And Tory supporters also backed it by 48% to 35%. \nDespite this, political expert Dr Martin Farr from Newcastle University thinks it has still some way to go before it becomes policy for Labour. \n“Once it does, the Tories and all the private rail companies will launch their campaign against it. \n“It would be costly and complicated for a start and once you start talking about this, will the public still back it?” \nAnother left wing policy which has proved popular is upping the National Living Wage to £10 an hour. The public back such an increase by 61% to 19%. \nAnd while there is always much scoffing at suggestions by the left of increasing the tax rate for high earners as more a reflection of wealth envy than political reality, this too has considerable public support. \nA poll which asked people if they would back a 60p rate for those who earned over £150,000 had 52% backing against 23% who opposed it. \nDr Farr said: “It sounds great and who, for a start, wouldn’t want the less well off to get more money. \n“But again the financial reality could see higher income tax rates to afford it, businesses would struggle to cope, the people who Labour need to attract. \n“In theory these policies seem fine but they are easily unpicked.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-01-01T12:00:00.000+02:00", "crawled": "2017-01-01T07:24:56.574+02:00", "highlightTitle": ""}