{"organizations": [], "uuid": "5928f5ce8b8557bee8fc2ce17efed73effa0398f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12400218.ece/ALTERNATES/s1200/Heathrow-Terminal-Five-Official-Opening.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/county-durham-roofing-staff-receive-12400047", "country": "GB", "domain_rank": 21960, "title": "County Durham roofing staff receive company-wide bonus after profits increase", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "County Durham roofing staff receive company-wide bonus after profits increase", "spam_score": 0.0, "site_type": "news", "published": "2017-01-03T23:19:00.000+02:00", "replies_count": 0, "uuid": "5928f5ce8b8557bee8fc2ce17efed73effa0398f"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/county-durham-roofing-staff-receive-12400047", "ord_in_thread": 0, "title": "County Durham roofing staff receive company-wide bonus after profits increase", "locations": [], "entities": {"persons": [{"name": "hall", "sentiment": "none"}, {"name": "kevin hall", "sentiment": "none"}], "locations": [{"name": "heathrow airport", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}], "organizations": [{"name": "akzo nobel", "sentiment": "none"}, {"name": "costco", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "hathaway roofing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A general view of the new Terminal 5 at Heathrow Airport (Photo: Getty Images)   \nDurham-based Hathaway Roofing has awarded all of its staff a bonus after adding £5.6m to its turnover last year. \nDespite the company saying it had a tough start to the year due to poor weather and floods in the region, the business grew its turnover by 28%, from £19.7m to £25.3m. \nProfits also soared from £144,000 to £321,000 last year, which allowed the firm to issue the company-wide bonus. \nHathaway Roofing declined to comment on the exact size of the bonus pot although the company’s wage bill increased by £500,000 over the year. \nKevin Hall, managing director at Hathaway Roofing, said: “Our preferred market sectors continue to provide us with suitable opportunities and we remain ‘contractor of choice’ for many large manufacturing and industrial facilities where our specialist skills set us apart from our competitors. \n“We have been successful in securing a significant level of business for the next financial year with existing and new clients. This underpins our aims of sustainable growth and the potential for increased profitability thus strengthening out optimism for the future.” \nThe bonus pot was shared across Hathaway Roofing’s 79 employees. As well as growing financially, the businesses increased its headcount by three after hiring two members of staff in its manufacturing division and one in its back office team. Read More UK manufacturing reaches two-and-a-half year high at end of 2016 \nSenior management at the roofing business also benefited from the increased profitability with the five directors taking home a total of £756,000. This is up £123,000 on 2015. The highest paid director received £196,000 last year. \nHathaway Roofing’s total borrowing also fell with the total amount the business owed to the bank falling from £754,000 to £661,000. \nTurnover at the Bishop Auckland business has sat around the £19m mark during the previous two years after increasing by £4m in 2014. \nDespite the recent growth, Hathaway Roofing’s turnover has still not returned to its 2011 high when the company brought in £29.6m. \nCommenting on the next financial year Mr Hall said: “Despite not knowing how the Brexit vote will impact on our future, the directors continue to have an optimistic view based on a healthy order book and an increasing work stream of potential projects. \n“We have continued to invest in the training of our staff and adding additional resources in strategic positions within the business. This coupled with the support of our loyal supply chain, strong balance sheet and strict policy of insuring all debt, ensures that we are best placed to manage the increased activity envisaged.” \nHathaway Roofing has completed work on Heathrow Airport, paint manufacturer Akzo Nobel’s Ashington plant , as well as a number of Costco stores. Like us on Facebook", "external_links": [], "published": "2017-01-03T23:19:00.000+02:00", "crawled": "2017-01-03T19:00:58.155+02:00", "highlightTitle": ""}