{"organizations": [], "uuid": "cd661bfa609d01b4a4600c05cd67f653fcc5aff1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11816587.ece/ALTERNATES/s1200/JS69403219.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12402571", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Barclays app to offer SMEs loans in less than an hour, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Barclays app to offer SMEs loans in less than an hour, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2017-01-05T14:50:00.000+02:00", "replies_count": 0, "uuid": "cd661bfa609d01b4a4600c05cd67f653fcc5aff1"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12402571", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Barclays app to offer SMEs loans in less than an hour, plus latest news", "locations": [], "entities": {"persons": [{"name": "ian rand", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}, {"name": "duncan davidson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "rand", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "persimmon homes and westbury partnerships", "sentiment": "none"}, {"name": "cpg photography ltd", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "smes  barclays", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FTSe and pound latest \nThe FTSE-100 index opened at 7189.74. \nThe pound at 8am was 1.2317 dollars compared to 1.2300 dollars at the previous close. The euro at 8am was 0.8560 pounds compared to 0.8515 pounds at the previous close. (Photo: Chris Radburn/PA Wire ) KEY EVENT Housebuilder Persimmon driven up healthy demand from homebuyers \nHousebuilding giant Persimmon has cheered healthy demand from homebuyers as it reported a 10% surge in sales in the last half of 2016. \nAhead of posting full-year results next month, the housing firm, which was founded by Northumberland entrepreneur Duncan Davidson, said the autumn selling season had seen robust sales reservations, driven by readily available mortgage deals. \nIt legally completed the sale of 599 homes in 2016 - up 4% at 15,171 - while group revenues lifted 8% to £3.14bn. \nThis marks a slowdown on the growth rates seen in 2015, when legal completions rose 8% and revenues were 13% higher, but the York-headquartered company hailed a strong performance in the face of uncertain conditions caused by the Brexit vote in June. \nIts legal completions rose 9.6% to 7,933 between June and the end of December as it sold 695 more homes than in the first half of the year, while its private sales rate in the second half was 15% higher year-on-year. \nPersimmon, which also trades as Persimmon Homes and Westbury Partnerships, said price growth held largely firm on 2015, rising by 4% on average to around £206,700. It added that forward sales stood at around £1.2 billion at the end of 2016, up 12% on a year earlier. \nThe firm said: \nWe continue to see good opportunities to acquire additional land whilst remaining mindful of the risks associated with the uncertainty arising from the UK’s decision to leave the EU. \nSales reservations through the autumn season were strong with healthy customer demand for new homes. \nBuying a new-build home remains a compelling choice supported by competitive mortgage offers which continue to make a new home purchase very affordable. Persimmon plc (Photo: Lewis Stickley/PA Wire) 8.00 KEY EVENT Barclays app set to speed up loans for SMEs \nBarclays is rolling out a new service on its mobile banking app which it says can help small businesses access loans in less than an hour. \nIt claims to be the first UK bank able to approve and transfer full loans to small and medium enterprise accounts via its mobile app - in some cases within 60 minutes. \nThose loans can otherwise take weeks to approve, it said. \nIan Rand, chief executive of business banking at Barclays, said: “We recognise that some businesses are cautious about applying for a loan, whilst many more simply do not have the time. “Our new, pre-assessed lending gives customers the ability to see how much they could borrow on their mobile and we can get that money to them more quickly than ever so they can invest in and focus on running their businesses.” \nBarclays has offered online pre-assessment since 2013, but this is the first time businesses can take on the whole process via the mobile app. Retail customers already have access to loans through mobile banking. \nBarclays said that easier access to loans could help to unlock £34.25 billion in economic growth from UK SMEs by 2021, with subsequent growth resulting in as many as 194,000 jobs. \nHowever, the bank said that 39% of small business are not planning to apply for a loan, despite acknowledging it could help their business, and that nearly 24% of SMEs currently believe it will be harder to borrow 2017 due to political and economic uncertainty surrounding Brexit. \nBut Barclays said it will continue to offer loans to business customers, despite Brexit jitters. \nMr Rand added: \nSince the EU Referendum, our appetite for lending has not diminished and we continue to lend to an SME in the UK every four minutes. \nWe want to help SMEs be confident in their future business plans, including looking at new opportunities to export. We are particularly determined to reach out to those businesses who believe lending will be more difficult next year to see where we can help. \nApp-based loans are the bank’s latest innovation, having launched contactless cash withdrawals in November, which allows customers to withdraw money without inserting their bank cards at in-branch cash machines. Barclays says the app's new feature will speed up loans. Last year the firm launched the UK's first contactless cash service (Photo: CPG Photography Ltd) Share", "external_links": [], "published": "2017-01-05T14:50:00.000+02:00", "crawled": "2017-01-05T10:14:50.754+02:00", "highlightTitle": ""}