{"organizations": [], "uuid": "b12dc811ca5ef5df4c59452ec199c68fdcc1f26b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11963210.ece/ALTERNATES/s1200/JS101110115.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/helping-poor-families-buy-nutritious-12466655", "country": "GB", "domain_rank": 21960, "title": "Helping poor families buy nutritious food could be way forward for farmers after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Helping poor families buy nutritious food could be way forward for farmers after Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-01-17T20:43:00.000+02:00", "replies_count": 0, "uuid": "b12dc811ca5ef5df4c59452ec199c68fdcc1f26b"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/farming/helping-poor-families-buy-nutritious-12466655", "ord_in_thread": 0, "title": "Helping poor families buy nutritious food could be way forward for farmers after Brexit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Helping poor families buy nutritious food could be way forward for farmers after Brexit Farming group suggests range of ways in which British farmers could be incentivised after withdrawal from the EU Share A combine harvester in a field (Photo: Owen Humphreys/PA Wire) Share Get business   \nA scheme that provides poor families with vouchers to buy sustainably-produced nutritious food could help farmers and the environment after Brexit , it has been suggested. \nSchools and hospitals could also buy food certified by a sustainable food standard programme , to create a market for farmers to produce food that boosts nutrition, helps wildlife and soils, reduces flooding and stores carbon. \nIt is part of a proposal set out by the Farming and Wildlife Advisory Group South West, for a sustainable future for farming and nature post-Brexit. \nOther elements of the plan include revenue payments by government and the private sector for services such as improving water quality by reducing pesticide use or growing wildlife-rich grasses which can be used to produce green gas for energy. \nAnd environmental initiatives should be built from the ground up, so local farmers and communities can manage their areas strategically, rather than imposing targets from above, a paper from the advisory group said. \nThe future for farming subsidies, currently paid under the European Union’s Common Agricultural Policy (CAP) and mostly focused on direct payments for land owned, is uncertain following the vote to leave the bloc. \nConcerns have been raised that if the Government does not continue with payments made under the CAP for wildlife-friendly farming, hundreds of thousands of acres of land managed for nature could be ploughed up by farmers trying to make a living. \nAnnual payments for creating and looking after habitats are “crucial” to support sustainable land use, the paper from the advisory group said. \nBut there are also opportunities for restoring the land through a market to provide natural services, with water utilities, energy companies or other organisations paying for measures such as flood reduction, water quality or green energy products. \nAnd support could be given to a food assurance scheme that recognised high quality produce farmed sustainably in the UK, currently a niche market that is too expensive for many people to buy or for many farmers to produce. \nThe Government could use funding to provide vouchers to people on low incomes and welfare to buy certified, sustainably produced food. Read More Veg shortage predicted as cold snap in Europe hits suppliers \nGovernment funding could also support public procurement of the certified sustainable food for institutions such as schools and hospitals. \nA food standard could build on existing assurance systems such as the LEAF (Linking Environment And Farming) Marque, which recognises sustainably-farmed products, and see currently voluntary public procurement policies become compulsory. \nThe advisory group’s senior farm conservation adviser Jenny Phelps said: “An overarching sustainable food scheme could give government funding to people on low incomes or welfare who can’t always afford more sustainably-produced food, which can be more expensive. \n“This would create a market to help farmers produce food in a way to restore their soils and rebuild natural capital on their land, while making a living, while producing healthy nutritious food with multiple benefits, such as reducing flood risk, capturing carbon and restoring biodiversity for the benefit of all.” Read More \nThe paper warned that if direct payments to farmers were withdrawn, it should be done over a long transition period while methods to support sustainable farming are developed. Like us on Facebook", "external_links": [], "published": "2017-01-17T20:43:00.000+02:00", "crawled": "2017-01-17T16:27:20.947+02:00", "highlightTitle": ""}