{"organizations": [], "uuid": "365743cd34fe8328c04145eeb4c5186a57fadd96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12510104.ece/ALTERNATES/s1200/JS109997229.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/special-features/how-greener-cleaner-safer-economically-12503103", "country": "GB", "domain_rank": 21960, "title": "How a greener, cleaner, safer and economically thriving Durham can defy Brexit and austerity cuts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "How a greener, cleaner, safer and economically thriving Durham can defy Brexit and austerity cuts", "spam_score": 0.0, "site_type": "news", "published": "2017-01-27T07:00:00.000+02:00", "replies_count": 0, "uuid": "365743cd34fe8328c04145eeb4c5186a57fadd96"}, "author": "Anne Fletcher", "url": "http://www.chroniclelive.co.uk/special-features/how-greener-cleaner-safer-economically-12503103", "ord_in_thread": 0, "title": "How a greener, cleaner, safer and economically thriving Durham can defy Brexit and austerity cuts", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "simon henig", "sentiment": "none"}, {"name": "simon henig", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "dalton park", "sentiment": "none"}, {"name": "barnard castle", "sentiment": "none"}, {"name": "durham city", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "durham city park", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "seaham", "sentiment": "none"}], "organizations": [{"name": "bishop auckland food festival", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "salvus house", "sentiment": "none"}, {"name": "lumiere", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertorial How a greener, cleaner, safer and economically thriving Durham can defy Brexit and austerity cuts Durham County Council leader SIMON HENIG outlines plans to make the region a prosperous place to live, work and invest Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDespite uncertainty surrounding Brexit and ongoing austerity cuts, in Durham we remain committed to striving for excellence and there is much to look forward to over the coming months. \nWe are focusing on our key priorities – encouraging the continued growth of the local economy, redoubling our efforts to make Durham a safe, clean and green place to live and promoting a thriving visitor economy and cultural sphere. Durham County Council leader Simon Henig \nI was privileged to be present as the first Hitachi train assembled on the production line at the Newton Aycliffe plant was unveiled recently. This was an historic moment for the county, as train building returned to the region – the cradle of the railways. \nMany companies from the county supply components for the trains and the Hitachi plant serves as a great example of how working together can bring huge benefits to the region, justifying the many years of hard work that brought Hitachi to the county, beating off competition from more than 40 other sites across the UK. \nHitachi is just one of several success stories the county has to celebrate, including the expansion of Dalton Park, investment by customer contact centre ResQ in Seaham and the opening of new offices and a business incubator at Salvus House in Durham City. Award-winning... Salvus House is situated among the thriving business community at Durham City Park \nDuring 2017 we can look forward to much more, including the next phase of expansion at NetPark in Sedgefield, a new facility to expand GlaxoSmithKline in Barnard Castle and the ongoing redevelopment along the Durham City riverbanks, to enhance retail and cinema offers, all creating more job opportunities for local people. \nThe county also continues to host some of the UK’s most popular and ground-breaking events including Kynren – described as the country’s largest outdoor performance since the London Olympics, Lumiere – the UK’s largest light festival, which promises to be bigger, bolder and brighter than ever before and our annual festivals Brass, The Durham Book Festival and Bishop Auckland Food Festival, which will all entertain thousands of local people and visitors alike. Epic tale of England... Kynren \nAll in all, 2017 is a very promising year for the county in the face of budget cuts from national Government which now total almost £200million. Despite the sheer size of those spending cuts and the uncertainties as we await details of the Brexit deal, we remain fiercely ambitious for Durham and committed to making this county a prosperous place to live, work and invest. \nTo find out more about what the county could offer your business, visit www.durham.gov.uk/PlaceOfLight Like us on Facebook", "external_links": [], "published": "2017-01-27T07:00:00.000+02:00", "crawled": "2017-01-27T02:13:39.402+02:00", "highlightTitle": ""}