{"organizations": [], "uuid": "36e9e899470e7b79f17d85de58f6e0a5f562c9ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12498450.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/supreme-courts-brexit-ruling-mean-12498369", "country": "GB", "domain_rank": 21960, "title": "Will the Supreme Court's Brexit ruling mean a second EU referendum? Your questions answered", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Will the Supreme Court's Brexit ruling mean a second EU referendum? Your questions answered", "spam_score": 0.0, "site_type": "news", "published": "2017-01-24T18:37:00.000+02:00", "replies_count": 0, "uuid": "36e9e899470e7b79f17d85de58f6e0a5f562c9ec"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/supreme-courts-brexit-ruling-mean-12498369", "ord_in_thread": 0, "title": "Will the Supreme Court's Brexit ruling mean a second EU referendum? Your questions answered", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "michel euler", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "gina miller", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "supreme court", "sentiment": "neutral"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "cancel play now supreme court", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Will the Supreme Court's Brexit ruling mean a second EU referendum? Your questions answered Judges ruled eight to three against the Government and said parliament should vote on triggering Article 50 Share Click to play Tap to play The video will start in 8 Cancel Play now Supreme Court says Article 50 must be triggered by parliament Share this video Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe Government has lost its historic battle in the Supreme Court over Brexit. \nThe highest court in the land rejected an appeal by ministers against a High Court judgment blocking their decision to begin Britain’s exit from the European Union without Parliament having a say. \nBut how will the Supreme Court ruling that Article 50 can only be triggered with the consent of parliament affect Brexit - and does it open the door to a second referendum? \nThese and other questions answered. So, what happened on Tuesday morning? \nJudges in the Supreme court ruled eight votes to three that the Government cannot trigger Article 50 to start the process to leave the European Union without an act of parliament Who brought the case in the first place? Gina Miller speaking outside The Supreme Court in London after Britain's most senior judges ruled that Prime Minister Theresa May does not have the power to trigger the formal process for the UK's exit from the European Union without Parliament having a say (Photo: PA) \nBusinesswoman Gina Miller brought the case which was originally heard in the High Court in December and found in her favour. Government lawyers claimed the Prime Minister had the Royal prerogative to do so without the official vote of MPs. They appealed the High Court decision which has been upheld by the Supreme Court. So that’s it then, parliament does have the final say on when Article 50 is triggered? \nIf Mrs May has a sense of irony, she could instruct lawyers to further appeal the case to the European Court of Justice, but this is very unlikely. Couldn’t the Prime Minister just ignore the court and press ahead regardless? British Prime Minister Theresa May (Photo: Michel Euler) \nTheoretically Mrs May could still trigger Article 50 on her own using royal prerogative powers. Exercising this collection of executive powers could be controversial because they effectively bypass parliament. It is most likely the Government will accept the ruling. If the Government does accept the court’s ruling, what happens then? \nIt will most likely rush out a draft bill giving the Government power to start the process of leaving the EU and the timing of triggering Article 50 – and that is most likely to happen before March. \nMPs will then have the choice to approve the bill, reject it or pass it with amendments. Will it cause a delay in the UK’s exit from the EU? A man waves a flag outside the Supreme Court in London where Britain's most senior judges will rule if Theresa May has the power to trigger the formal process for the UK's exit from the European Union (Photo: PA) \nIt’s unlikely as the Government seems confident that the legislation will pass by its March deadline. Read More Nissan will review its Sunderland plant after Brexit, boss says What about the opposition parties, can’t they still throw a spanner in the works? \nIf they wanted to, as the Government hasn’t got a large majority in the Commons. However, Labour leader Jeremy Corbyn is expected to order his MPs to vote in favour of triggering Article 50 - although this could well prompt a rebellion of around 30 MPs, including several frontbenchers, especially those with largely urban constituencies that voted ‘remain’, are known to be agonising about whether to defy the party line. But not enough to put a dent in the Tory majority. Read More How President Trump and Brexit will both affect North East people living abroad And the Lib Dems want a second referendum. Is that possible? Gina Miller speaking outside The Supreme Court in London after Britain's most senior judges ruled that Prime Minister Theresa May does not have the power to trigger the formal process for the UK's exit from the European Union without Parliament having a say (Photo: PA) \nLeader Tim Farron has said his party will oppose Article 50 unless the final deal is put to a public vote. However the party only has nine MPs, so the chances of a second referendum are slim, to say the least. Some have said this is a constitutional clash between ministers and judges. Is this true? \nNo. Judges have made it clear that the are deciding only a legal point, not a political one. Like us on Facebook", "external_links": [], "published": "2017-01-24T18:37:00.000+02:00", "crawled": "2017-01-24T14:17:34.889+02:00", "highlightTitle": ""}