{"organizations": [], "uuid": "fc1da79f89b3e2a728f5928bb6ed62ab2479dd85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12437742.ece/ALTERNATES/s1200/Paul-Wilson-CEO-at-Nigel-Wright-Group.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nigel-wright-brings-166m-brexit-12437706", "country": "GB", "domain_rank": 21960, "title": "Nigel Wright brings in £16.6m as Brexit makes North East 'more competitive'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nigel Wright brings in £16.6m as Brexit makes North East 'more competitive'", "spam_score": 0.0, "site_type": "news", "published": "2017-01-11T21:03:00.000+02:00", "replies_count": 0, "uuid": "fc1da79f89b3e2a728f5928bb6ed62ab2479dd85"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/nigel-wright-brings-166m-brexit-12437706", "ord_in_thread": 0, "title": "Nigel Wright brings in £16.6m as Brexit makes North East 'more competitive'", "locations": [], "entities": {"persons": [{"name": "nigel wright", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "paul wilson", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "gothenburg", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "invalid email  recruitment", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nigel wright group", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nigel Wright brings in £16.6m as Brexit makes North East 'more competitive' The Newcastle-headquartered recruitment firm saw turnover grow 9% to £16.6m over the year Share Paul Wilson, CEO at Nigel Wright Group (Photo: Nigel Wright Group) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nRecruitment specialist Nigel Wright has claimed that Brexit has helped North East businesses grow after the firm’s turnover soared to £16.6m. \nPaul Wilson, chief executive officer at Nigel Wright, said that the vote to leave the EU initially shocked UK businesses but many within the region have quickly recovered. \nMr Wilson said: “At the moment we are seeing that the pound continued to be sold down by traders and nervousness about the triggering of Article 50. \n“Personally, I think it’s a little irrational but the result is that it does make the region more competitive. \n“As The North East is a big exporting region, both to Europe and the rest of the world, I think those strong conditions will continue.” \nMr Wilson’s comments come as the recruitment company saw its turnover grow by 9% to £16.6m while it gross profit also jumped 8% to £12m. \nThe results show that the firm is continuing to improve its financial position after previously running at a loss for a number of years, with latest accounts for the year ended April 30 2016 showing EBITDA grew 34% to £943,000. \nThe year also marked a significant growth in the firm’s headcount, which now stands at its highest ever level of 140 people, having opened two offices in Gothenburg, Sweden, and on Teesside. \nThe Teesside base is permanently manned by six members of staff working across finance, sales, marketing, and IT. \nThe office is also used by employees from the company’s larger Newcastle headquarters . \nThe company also reestablished an office in Amsterdam, bringing its total number of offices to 13. \nMr Wilson, who joined the group in 2014, said that the firm was now working hard to get its international offices working together “more effectively”. Read More Newcastle recruitment consultancy Nigel Wright Group narrows operating loss \nHe added: “The results reflect the hard work and commitment of the management team and all the employees here at Nigel Wright. \n“We have a strong reputation for delivering the highest levels of service and we will always look to improve customer satisfaction. \n“We continued to gain market share and develop relationships with SMEs, private equity backed businesses and multinational corporations, as well as preserving long standing connections with companies in the North East from where our origins began. \n“In addition to the new offices, we broke various internal records during the year. \n“We now employ nearly 140 people across Europe, the greatest number of consultants in our history, had the highest number of new starters last year and are placing candidates in more territories than ever before. A testament to the dedication of all our people through the year. \n“I firmly believe that our unique approach, where we pride ourselves on being truly global and operating as one business without internal barriers, assists these results and reflects the skills, knowledge and expertise we have in our teams across all territories and disciplines. \n“We are well positioned for the future, our brand has an excellent, worldwide reputation and we are determined to build and develop our company and employees for the longer term.” Like us on Facebook", "external_links": [], "published": "2017-01-11T21:03:00.000+02:00", "crawled": "2017-01-11T16:21:00.840+02:00", "highlightTitle": ""}