{"organizations": [], "uuid": "4648ca895208175f8a71a51e5d6c4363f46b6aaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12389798.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-makes-north-east-attractive-12387010", "country": "GB", "domain_rank": 21960, "title": "Brexit makes North East an attractive place to do business, says EY senior partner", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit makes North East an attractive place to do business, says EY senior partner", "spam_score": 0.0, "site_type": "news", "published": "2017-01-01T18:00:00.000+02:00", "replies_count": 0, "uuid": "4648ca895208175f8a71a51e5d6c4363f46b6aaf"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-makes-north-east-attractive-12387010", "ord_in_thread": 0, "title": "Brexit makes North East an attractive place to do business, says EY senior partner", "locations": [], "entities": {"persons": [{"name": "sandra thomp", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "sandra thompson", "sentiment": "none"}, {"name": "thompson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "invalid email  brexit", "sentiment": "none"}], "organizations": [{"name": "onex", "sentiment": "none"}, {"name": "alstom", "sentiment": "none"}, {"name": "parkdean resorts", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "nomad digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit makes North East an attractive place to do business, says EY senior partner EY's Sandra Thompson believes international firms are seeing the potential of buying local companies Share Brexit vote has been good for the North East, says expert (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBrexit has made the North East an “attractive place to do business” for international companies, according to EY’s Newcastle head Sandra Thompson. \nLast week saw foreign companies snap up two major businesses in the region for significant sums of cash. \nIn one of the North East’s biggest ever deals, holiday park operator Parkdean Resorts was sold for £1.35bn to Canadian investment house Onex. \nTwo days later train WiFi pioneer Nomad Digital was acquired by multinational transport giant Alstom for an undisclosed sum. \nSandra Thompson, North East senior partner at EY, said the result of the EU referendum has made businesses in the region an attractive choice for international companies. \nMs Thompson said: “Brexit has not been a deterrent in the North East. It seems as if we have been here a couple of months and Brexit has not had an impact. \n“I genuinely think the North East is an attractive place to do business.” Nissan's plant in Sunderland (Photo: Owen Humphreys/PA Wire) \nFollowing the Brexit vote the value of the pound fell by 20% and has yet to rise to its previous level. Ms Thompson argues that this fall in price has helped local businesses attract international buyers. \nShe said: “Overseas investors are seeing a great bargain. Parkdean Resorts sold for £1.35bn which is an impressive number. A lot of people see the North East as back water but it isn’t. Read More Parkdean Resorts sold for £1.35bn to Canadian investment giant \n“It’s seen as an attractive place due to Brexit. The pound is weaker so it’s a cheap deal.” \nMs Thompson also believes that the focus Nissan has brought to the North East has caused other international businesses to sit up and take notice of the region. \nAlthough it is unlikely that deals of this size will take place so soon after Parkdean Resorts’ £1.35bn acquisition, she said more foreign businesses may look to cash in on the successes in the region. \nMs Thompson added: “If I’m honest I would be surprised if you’d have this much investment again [after last week’s deals]. \n“You might get a domino effect as more investors might want a piece of the action. So you may get more deals off the back of it.” Like us on Facebook", "external_links": [], "published": "2017-01-01T18:00:00.000+02:00", "crawled": "2017-01-01T13:41:42.725+02:00", "highlightTitle": ""}