{"organizations": [], "uuid": "40ab35eddcf781d6ee46cd2fa176442dfb9cd72c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12432639.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/perhaps-after-good-dose-trumpism-12489848", "country": "GB", "domain_rank": 21960, "title": "Perhaps after a good dose of Trumpism, the EU will look more appealing", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Perhaps after a good dose of Trumpism, the EU will look more appealing", "spam_score": 0.0, "site_type": "news", "published": "2017-01-22T23:00:00.000+02:00", "replies_count": 0, "uuid": "40ab35eddcf781d6ee46cd2fa176442dfb9cd72c"}, "author": "Kate Thick", "url": "http://www.chroniclelive.co.uk/news/news-opinion/perhaps-after-good-dose-trumpism-12489848", "ord_in_thread": 0, "title": "Perhaps after a good dose of Trumpism, the EU will look more appealing", "locations": [], "entities": {"persons": [{"name": "kate thick", "sentiment": "positive"}, {"name": "trump", "sentiment": "none"}, {"name": "guy verhofstadt", "sentiment": "none"}, {"name": "xi", "sentiment": "none"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mr trump", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "positive"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Perhaps after a good dose of Trumpism, the EU will look more appealing Kate Thick says that Brexit will not herald a golden era and that the North East must find its own reset button Share EU and Union flags (Photo: PA) Share     \nThe effect of human activity on our climate is no longer subtle, surmised a scientist. \nThis brought to mind Mr Trump, a man not known for subtlety, and the humiliating scramble among Britain’s politicians to be the first to shake his hand. \nClimate change, Trump and Brexit – three oncoming trains picking up speed. \nAt their annual jamboree, the elite at Davos discussed saving the world, their world that is. \nMrs May told leaders at Davos the UK will be a “world leader” on trade. Our gigantic trade deficit and a glance at a world map suggest this is a bit fanciful. \nChinese President Xi Jinping spoke up for global cooperation on trade, climate change and security. China is hardly subtle either in its self-interest but Xi spotted an opportunity and made friends at Davos (where they’re too polite to ask him about trivia like human rights) by holding up a flag for international obligations. While Trump debunks global warming and builds fuel-guzzling vehicles nobody outside the US wants, China is investing in renewable energy and electric cars. \nAs Xi said, attempting to cut off the flow of capital, goods and people between economies is simply no longer possible. This flow requires rights and regulations applicable across borders, it needs equity and good management. Sovereignty is secondary. \nDo you think trade with China, Australia, India or the US would come without reams of demands and bureaucracy? \nBritons cling to the delusion, fostered by the government, that the EU needs Britain more than Britain needs the EU. The UK will eventually strike a deal of sorts with the EU and increase free trade with the rest of the world but it is going to take years, and it will be on mostly unfavourable terms. \nMay the gods help us if our future prosperity depends on the likes of Trump. If you think the EU constrains on our sovereignty, you ain’t seen nothing yet. \nEmerging nations like India insist on free movement of people as a condition to free trade in goods and services. The UK is overwhelmingly a services-based economy and India is heading that way too; a deal will require granting Indian students and workers easy passage into the UK. \nModern trade agreements are less about tariffs (low anyway between the UK and US) than ensuring laws and regulations don’t obstruct the free flow of capital. The US describes our food and farming regulations - which prevent the sort of high-intensity, high-chemical, low-animal welfare farming common in the US - as a trade barrier. \nFarmers provide the building blocks to the largest manufacturing sector in our economy; US demands could open up our small farmers to devastating competition with US agribusiness. \nBritain, whose economy is one-sixth the size of America’s, would have little bargaining power. American health-care firms expect to snap up NHS contracts. Geography will limit the impact of a British-American trade deal; ‘gravity models’ show nearby countries trade more with each other. Read More How President Trump and Brexit will both affect North East people living abroad \nMeanwhile, as the world’s sixth-largest economy, we are without sufficient resources or political will to properly care for an ageing society or adequately educate our young. \nMeanwhile, authoritarian and nationalist rhetoric seeps deeper into the world system and will do so until the Davos elite and governments close the gap between the super-rich and the rest of society. \nGlobalisation may have lifted 600 million people out of poverty but it now needs a reset button. \nThe EU is a model, albeit flawed and incomplete, of cooperation over competition that could change the rules. I hope the EU survives. Perhaps after a good dose of Trumpism, the EU will look more appealing. \nMrs May’s Industrial Strategy, to be unveiled next week, will hopefully support small businesses, identify funding for training, infrastructure and de-industrialised areas, and prioritise regional economies. \nThe North East exports more than it imports so power to our elbow. \nGuy Verhofstadt, chief Brexit negotiator for the European parliament, said Brexit will be a sad, costly and exhausting process. It will affect the poor more than the rich. \nBritain is not about to enter a golden era; the North East must find its own reset button. Like us on Facebook", "external_links": [], "published": "2017-01-22T23:00:00.000+02:00", "crawled": "2017-01-22T18:24:39.054+02:00", "highlightTitle": ""}