{"organizations": [], "uuid": "2f6d30494d75dc6c7815ee528a89553b1dec5a71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30081742/15815958.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/mps-get-vote-on-triggering-article-50-after-government-loses-supreme-court-brexit-appeal/story-30081742-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin commented Supreme Court Brexit decision: MPs get vote on triggering...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin commented Supreme Court Brexit decision: MPs get vote on triggering...", "spam_score": 0.0, "site_type": "news", "published": "2017-01-24T17:03:00.000+02:00", "replies_count": 0, "uuid": "2f6d30494d75dc6c7815ee528a89553b1dec5a71"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/mps-get-vote-on-triggering-article-50-after-government-loses-supreme-court-brexit-appeal/story-30081742-detail/story.html", "ord_in_thread": 0, "title": "danjmartin commented Supreme Court Brexit decision: MPs get vote on triggering...", "locations": [], "entities": {"persons": [{"name": "theresa ma", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "neuberger", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "thomas", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "tory brexiteer andrew bridgen", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "scott knowles", "sentiment": "none"}, {"name": "jeremy wright", "sentiment": "none"}, {"name": "deir dos santos", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "gina miller", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "north west leicestershire", "sentiment": "none"}], "organizations": [{"name": "supreme court brexit", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "east midlands chamber of trade", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (5) \nThe Government has lost its Brexit battle in the Supreme Court over whether Theresa May can trigger Article 50 without a vote in parliament. \nThe highest court in the land rejected an appeal by ministers against a High Court judgment blocking their decision to begin Britain's exit from the European Union without Parliament having a say. \nSupreme Court justices ruled, by a majority of eight to three, that Prime Minister Theresa May cannot lawfully bypass MPs and peers by using the royal prerogative to trigger Article 50 of the Lisbon Treaty and start the two-year process of negotiating the UK's divorce from its EU partners. \nThe ruling is a blow to Mrs May, who has repeatedly said she intends to trigger Article 50 by the end of March following the clear majority in favour of Brexit in the June 2016 referendum. \nConservative Loughborough MP and remain supporter Nicky Morgan said the ruling was 'quite right'. \nShe tweeted: \"So, Parliament to 'take back control' - quite right. Opportunity for MPs to represent ALL views in constituencies in debates on Bill.\" \nHowever Tory Brexiteer Andrew Bridgen, who represents neighbouring North West Leicestershire, said: \"It's disappointing if not totally surprising. \n\"It was a split decision which has in many ways it has been over taken by events. \n\"While the judges were making their decision the issue has moved on and we know what Theresa May has set out to get Brexit. \n\"I do not think it will delay Article 50. \n\"I'm confident MPs will vote it through as the public would expect of them. Labour has said they will not oppose triggering article 50. \nThe case was brought by a wide-ranging group of anti-Article 50 campaigners led by investment manager Gina Miller, 51, and hairdresser Deir Dos Santos. \nSupreme Court President Lord Neuberger said: \"By a majority of eight to three, the Supreme Court today rules that the Government cannot trigger Article 50 without an Act of Parliament authorising it to do so.\" \nAlthough the Government lost the challenge, the justices unanimously ruled that there was need to consult with the devolved powers in Scotland, Wales and Northern Ireland. \nOn the steps of the court, Attorney General Jeremy Wright said the Government was \"disappointed\" by the Supreme Court ruling but will comply with it. \nIn a statement released immediately after the ruling, Labour leader Jeremy Corbyn said his party would not \"frustrate the process for invoking Article 50\" but would seek to amend the Government's bill. \nIn one of the most important constitutional cases in recent British legal history, three High Court judges ruled in November that ministers lacked authority to invoke Article 50 without parliamentary approval. \nThe Lord Chief Justice, Lord Thomas, sitting with two other senior judges, upheld the \"powerful constitutional principle\" that Crown prerogative powers could not be used \"to alter the law of the land\".Last December, Brexit Secretary David Davis led the Government's attempt to overturn the ruling in a four-day hearing before a record 11 Supreme Court justices. \nA team of Government QCs argued the High Court was wrong in law and it was \"a fundamental pillar\" of the constitution that prerogative powers could be used to make and unmake treaties with foreign governments and not an affront to Parliamentary sovereignty. \nBusiness leaders say the ruling could create uncertainty for companies seeking reassurance on the Brexit process. \nChief executive of the East Midlands Chamber of Trade Scott Knowles said: \"The decision by the Supreme Court could have two significant impacts on business. It could delay the triggering of Article 50, which would create further doubt and uncertainty for business, and it could cause further fluctuations in the value of Sterling. \n\"It is essential that Prime Minister Theresa May acts immediately to assuage any doubts that could harm UK plc and reassure business that she will meet her previously stated goal of triggering Article 50 by the end of March so that business continues to have a fixed timetable for Brexit.\"", "external_links": [], "published": "2017-01-24T17:03:00.000+02:00", "crawled": "2017-01-24T15:09:43.153+02:00", "highlightTitle": ""}