{"organizations": [], "uuid": "f2ec8863c1002863fb3a23c2f03f8a41a1acc308", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12435024.ece/ALTERNATES/s1200/JS84846794.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mp-chi-onwurah-norths-industrial-12434534", "country": "GB", "domain_rank": 21960, "title": "MP Chi Onwurah on the North's industrial heritage and a strategy to keep post-Brexit Britain wealthy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "MP Chi Onwurah on the North's industrial heritage and a strategy to keep post-Brexit Britain wealthy", "spam_score": 0.0, "site_type": "news", "published": "2017-01-11T23:00:00.000+02:00", "replies_count": 0, "uuid": "f2ec8863c1002863fb3a23c2f03f8a41a1acc308"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mp-chi-onwurah-norths-industrial-12434534", "ord_in_thread": 0, "title": "MP Chi Onwurah on the North's industrial heritage and a strategy to keep post-Brexit Britain wealthy", "locations": [], "entities": {"persons": [{"name": "chi onwurah", "sentiment": "negative"}, {"name": "graham wylie", "sentiment": "none"}, {"name": "clive lewis", "sentiment": "none"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "mariana mazzucato", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "rachel parsons", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "george stephenson", "sentiment": "none"}, {"name": "parsons", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "thatcher", "sentiment": "none"}, {"name": "stephenson", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "united state", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "birtley", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "invalid email  newcastle", "sentiment": "neutral"}, {"name": "labour", "sentiment": "none"}, {"name": "armstrong", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "armstrong works", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "aei", "sentiment": "none"}, {"name": "aie cables", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "energy and industrial strategy", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle Central MP Chi Onwurah on the North’s industrial heritage and a strategy to keep post-Brexit Britain wealthy \nThe North East is a region of makers and creators. \nGrowing up in the shadow of Stephenson, Parsons, Armstrong and other greats of our industrial past was part of what inspired me to study electrical engineering as a young woman. \nWorking as an Engineer in Britain and around the world, I saw first-hand the contribution successful industries make to strong communities in countries from the United State to France to Nigeria. \nI’m now proud to be Labour ’s Shadow Minister for Industrial Strategy, part of our Business, Energy and Industrial Strategy team under Shadow Secretary of State Clive Lewis. \nIt’s our job to lay out Labour’s vision for Britain as a prosperous and outward-looking twenty-first century economy . As the party of workers, forged in the original industrial revolution, we’re proud to represent the values of the builders and creators who shaped our country. Workshop of the World: The Geordie Workforce of the Armstrong Works, April 1948 (Photo: archives@twmuseums.org.uk) \nUnfortunately, the Tories don’t seem to share these values. It was the Conservative government of Margaret Thatcher that forced de-industrialisation on much of the country in the 1980s, creating an avoidable source of social trauma that affects us to this day. \nThe North East suffered hugely, no-one who lived here in the Thatcher era will ever forget that combination of neglect and malice which destroyed our economic livelihood. \nSince then, successive Conservative Governments – including the pre-2015 Conservative-Liberal coalition – have been obsessed with cutting, deregulating, and reducing the size of the state. \nThis has had disastrous effects: not just on manufacturing jobs and wages in Newcastle and the North East, but on our country’s self-image as a confident, exporting nation. \nThis hasn’t changed under Theresa May . It’s clear that while the Prime Minister is happy to talk the talk on the economy, she’s not prepared to follow-through with the hard work it will take to create a genuinely forward-looking industrial strategy. \nWe’ve seen nothing to indicate that this government will remedy the economic mistakes of the Cameron era, from stagnant wages to the explosion of zero-hour contracts. \nMeanwhile the pain continues for working people in the North East and beyond. Nissan’s announcement last October that it would continue to build its new model cars in Sunderland was very great news for the region. \nWe also need to think about the workers whose employers can’t rely on the Prime Minister to negotiate a special deal to keep them investing – that means a coherent, credible strategy for British industry post-Brexit. AEI cables based in Birtley, Gateshead (Photo: Newcastle Chronicle) \nLast week, 175 years of cable production in came to an end in Birtley as AIE Cables shut down production. That’s a tragedy for the workers and the community, and further weakens our industrial foundations. \nPreventing this sort of disaster requires a clear and positive vision for our economic future with specific measures so people, communities, and businesses have the certainty to plan for a prosperous future. Tied up with undeliverable Brexit promises and internal Tory party bickering, it’s clear that the Government is neither capable of nor interested in providing this. \nThat’s why Labour is hard at work creating the industrial strategy our country needs – a vision for a high-wage, high-growth economy that provides working people with the jobs and skills they need to succeed. Read More 15 remarkable images of the Tyne's shipbuilding heritage \nOnly Labour can create what innovation economist Mariana Mazzucato calls an ‘entrepreneurial state’: a bold, risk-taking government that stands shoulder-to-shoulder with business in the creation of new jobs and industries. \nFurthermore, unlike the Conservatives we understand that to be successful any industrial strategy has to be in tune with the needs and values of working people across the country. \nIt’s for this reason that we’ve launched a consultation on industrial strategy to find out what kind of economy British workers and businesses want to see. \nWe don’t think that managed decline under this Conservative Government is good enough for the region of inventors and builders such as George Stephenson, Rachel Parsons and Graham Wylie, and we’re willing to bet that you don’t either. \nRespond to our consultation on industrial strategy at www.labourbeis.org Like us on Facebook", "external_links": [], "published": "2017-01-11T23:00:00.000+02:00", "crawled": "2017-01-11T18:29:06.840+02:00", "highlightTitle": ""}