{"organizations": [], "uuid": "bd35508f65b208d041affe6ff16eed2f4ea775ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11351573.ece/ALTERNATES/s1200/JS89365436.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12497137", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Greggs restructure will put 100 Scottish jobs at risk, union claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Greggs restructure will put 100 Scottish jobs at risk, union claims", "spam_score": 0.0, "site_type": "news", "published": "2017-01-24T14:55:00.000+02:00", "replies_count": 0, "uuid": "bd35508f65b208d041affe6ff16eed2f4ea775ff"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12497137", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Greggs restructure will put 100 Scottish jobs at risk, union claims", "locations": [], "entities": {"persons": [{"name": "greggs", "sentiment": "negative"}, {"name": "richard blenkinsop", "sentiment": "none"}, {"name": "ferguson", "sentiment": "none"}, {"name": "luke johnson", "sentiment": "none"}, {"name": "pauline langourieux", "sentiment": "none"}, {"name": "jonathon manning sky", "sentiment": "none"}, {"name": "mick pilsworth", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "tom clancy", "sentiment": "none"}, {"name": "mick", "sentiment": "none"}, {"name": "jane millichip", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "glassdoor", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "stefan rousseau/pa wire", "sentiment": "none"}, {"name": "rupert murdoch", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "andrew chamberlain", "sentiment": "none"}, {"name": "john ferguson", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "gavin patterson", "sentiment": "none"}, {"name": "ghosn", "sentiment": "none"}, {"name": "blenkinsop", "sentiment": "none"}, {"name": "jonathon manning nissans", "sentiment": "none"}, {"name": "sara smith", "sentiment": "none"}, {"name": "chris wright", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "halifax", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "glassdoor", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "jonathon manning finance", "sentiment": "negative"}, {"name": "activision", "sentiment": "none"}, {"name": "the times", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "bt italy", "sentiment": "none"}, {"name": "nissan brand centre", "sentiment": "none"}, {"name": "pizza express", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bt group ethics and compliance", "sentiment": "none"}, {"name": "ubisoft leamington", "sentiment": "none"}, {"name": "watch dogs", "sentiment": "none"}, {"name": "ubisoft reflections  leading north east", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "ubisoft", "sentiment": "none"}, {"name": "news corporation", "sentiment": "none"}, {"name": "leamington spa", "sentiment": "none"}, {"name": "nasa", "sentiment": "none"}, {"name": "jonathon manning lloyds banking group", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "news international", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "chrysalis vision", "sentiment": "none"}, {"name": "the sun", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "chrysalis vision  sky", "sentiment": "none"}, {"name": "indie growth fund", "sentiment": "none"}, {"name": "bank of scotland", "sentiment": "none"}, {"name": "21st century fox", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "ubisoft reflections", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Finance, tax and auditing among best jobs in Britain in 2017, report claims \nManagerial posts in finance, tax and auditing will be among the best jobs in Britain this year, a report predicts. \nJobs site Glassdoor said that based on earning potential, job satisfaction and the number of openings, finance managers top the list, with a median salary of £68,000. \nTax manager was second (£59,000), followed by design manager (£55,000), audit manager (£59,500), human resources manager (£50,000), data scientist (£45,000), supply chain manager (£53,000) and solutions architect (£65,000). \nAnother top job was said to be scrum master - described as a “facilitator for a development team”, with a median salary of £55,000. \nDr Andrew Chamberlain, of Glassdoor, said: \nThis report reinforces that the best jobs are highly-skilled and are staying ahead of the growing trend toward workplace automation. \nThe finance and tech industries are well represented on this list, both of which the UK is renowned for. \nIn particular for tech jobs, companies across all industries are hiring workers for these much needed positions. \nAny organisation today with a mobile app, web presence or digitised data are struggling to fill positions like data scientists, solutions architect and mobile developers. Finance, tax and audit jobs will be Britain's best jobs 9:00 Jonathon Manning North East warn MPs warn Theresa May on damage to Nissan and car industry \nDozens of North East MPs have warned Prime Minister Theresa May that her stance on hard Brexit will have a “damaging” impact on the region . \nThe 24 Labour MPs have written to Mrs May with a series of questions about the region’s car making industry after the Prime Minister’s speech last week signalled the UK would not leave both the single market and the customs union when the country pulls out of the European Union. \nThe letter follows comments from Nissan chief executive Carlos Ghosn at the end of last week that the company would have to “re-evaluate” the efficiency of its Sunderland plant after Brexit. \nMr Ghosn said Nissan trusted previous Government assurances on the future competitiveness of the automotive industry, but his comments have re-ignited concerns over the future of the company’s plant on Wearside. \nNissan employs 6,700 people at Sunderland with thousands more in the supply chain, and yesterday’s announcement of a £50m grant to the nearby International Advanced Manufacturing Park highlighted the importance of the industry to the North East. \nThe letter, organised by the pro-single market Open Britain campaign, says that “Nissan’s investment in Sunderland was secured last year on a promise to maintain the status quo and is now jeopardised by your embrace of a hard Brexit.” Workers at Nissan (Photo: Owen Humphreys/PA Wire) 8:53 Jonathon Manning Lloyds Banking Group fought off three-day cyber attack \nLloyds Banking Group has fended off a three-day-long cyber attack designed to overwhelm the bank’s systems and disrupt its digital services. \nCyber criminals made millions of fake requests intermittently between Wednesday January 11 and Friday January 13, which stopped some customers from using their online accounts. \nThe series of distributed denial of service (DDos) assaults came from overseas servers and affected the Lloyds, Halifax and Bank of Scotland brands. \nIn a game of cat and mouse, Lloyds defended its systems using a “geoblocker” that stops all traffic coming to its website from a particular country, but can also prevent customers in that region from accessing their accounts. \nWhile some customers could not log into their digital accounts or experienced a slow online service, the attack did not result in any customer bank accounts being hacked. \nA spokesman for Lloyds Banking Group said: \nWe experienced intermittent service issues with internet banking between Wednesday morning and Friday afternoon the week before last and are sorry for any inconvenience caused. \nWe had a normal service in place for the vast majority of this period and only a small number of customers experienced problems. In most cases if customers attempted another log-in they were able to access their accounts. \nWe will not speculate on the cause of these intermittent issues. Lloyds cash machines (Photo: Stefan Rousseau/PA Wire) 8:47 New MD at Newcastle computer games developer Ubisoft Reflections \nLeading North East computer games developer Ubisoft Reflections has a new managing director . \nRichard Blenkinsop, who originally comes from Newcastle , is to lead the Gosforth-based team behind bestselling games including Watch Dogs and Tom Clancy’s The Division. \nThe firm’s French owner Ubisoft has also demonstrated its commitment to the UK creative sector through the acquisition of FreeStyleGames, which it has acquired from Activision in Leamington Spa. \nThe studio will be renamed Ubisoft Leamington, which Mr Blenkinsop will also head up. \nHe replaces former MD Pauline Langourieux who, after four years in charge, has decided to move into a more hands-on production role within the studio. \nMr Blenkinsop has more than 17 years experience within the industry, having worked as a producer, senior producer and executive producer on a variety of titles at Codemasters and Activision, including the likes of Blur, Rome: Total War and Call of Duty 3. \nHe returned to his native Newcastle to join Reflections in 2012, where he has been part of the team behind The Crew and Tom Clancy’s The Division. Richard Blenkinsop (inset) and Tom Clancy's The Division (main pic) 8:43 Jonathon Manning Nissans to come in 'unlimited' colours thanks to Sunderland man's idea \nNissan cars could be available in an unlimited number of colours after an IT worker at its Sunderland plant won a European innovation competition. \nJohn Ferguson, 36, from Sunderland , beat off competition from 2,000 entries to win Nissan’s Chairman’s innovation awards. \nMr Ferguson - who has won a trip at the Nasa headquarters in Florida as his prize - came up with the idea to use the technology in digital e-ink and e-paper, as used in Amazon’s Kindle and other e-readers, to allow customers limitless choice of colours for their cars. \nHe was one of two winners in Nissan’s Chairman’s Innovation Awards, which gives company employees the opportunity to take ideas from drawing-board to reality, with six months out of their day job plus financial and mentoring support. \nOver 2,000 entries were received from across nine European regions, with 20 finalists being invited to the Nissan Brand Centre in Barcelona to pitch their ideas to a judging panel. Nissan employees were also given a say on the winners using a “people’s vote” function on the company’s employee app. \nMr Ferguson said: \nIt’s been incredible. My wife was in tears when I phoned home to tell her that I’d won. \nI love technology and gadgets and started to think about how e-paper could be used by Nissan in our cars. \nIt’s very unusual for someone doing my job to sit in front of the chairman and the members of the board. I was a little nervous and we only had a short time to pitch our ideas. \nI met some really wonderful people and listening to the other presentations was really inspiring. I feel proud to work for a company that gives this sort of opportunity to its employees. John Ferguson, competition winner at Nissan (Photo: matthew.walker@nissan-nmuk.co.uk) 8:37 KEY EVENT BT Shares plunge over Italian division scandal \nBT has warned on profits after saying it expects to take a £530m hit from the fallout of accounting irregularities at its Italian division, up from a previous estimate of £145m. \nThe telecoms giant said, following an independent review of the business by KPMG, the “extent and complexity of inappropriate behaviour in the Italian business were far greater than previously identified”. \nAn investigation has revealed improper accounting practices and a “complex set of improper sales, purchase, factoring and leasing transactions”, BT added. \nShares in BT plunged 16% following the warning. \nThe net result is there has been an overstatement of earnings at BT’s Italian business over a number of years, leading to the upwards revision in the value of the write down. \nBT chief executive Gavin Patterson said: \nWe are deeply disappointed with the improper practices which we have found in our Italian business. \nWe have undertaken extensive investigations into that business and are committed to ensuring the highest standards across the whole of BT for the benefit of our customers, shareholders, employees and all other stakeholders. \nThe group first revealed the accounting errors in October last year and on Tuesday said the investigation is now “substantially complete”, adding it is attempting to establish how the £530m hit should be reflected in its financial statements for current and previous periods. \nHowever, the firm said it expects the fiasco to result in a reduction in its third quarter adjusted revenue and adjusted earnings of around £120m. For the financial year as a whole, BT expects adjusted revenue to decrease by around £200m and adjusted earnings by £175m. It expects to take a similar hit next year. \nIt added the outlook for UK public sector and international corporate markets has “deteriorated”. For business and public sector, it is pencilling in a double-digit year-on-year percentage decline in fourth quarter underlying earnings. The group said in a statement: \nThe improper behaviour in our Italian business is an extremely serious matter, and we have taken immediate steps to strengthen the financial processes and controls in that business. \nWe suspended a number of BT Italy’s senior management team who have now left the business. \nWe have also appointed a new chief executive of BT Italy who will take charge on 1 February 2017. \nHe will review the Italian management team and will work with BT Group Ethics and Compliance to improve the governance, compliance and financial safeguards in our Italian business. \nThe Italian business accounts for around 1% of its total earnings. \nBT is also conducting a broader review of financial processes, systems and controls across the group and its remuneration committee will “consider the wider implications” of the BT Italy investigation. The company will issue a third quarter trading update on Friday. 18:32 Jonathon Manning Sky invests in TV production companies True North and Chrysalis Vision \nSky is ramping up its TV production portfolio by taking stakes in British indie firms Chrysalis Vision and True North for an undisclosed sum. \nThe broadcaster’s majority stake in True North marks the end of Channel 4’s involvement with the Leeds-based production house, which was previously backed by Channel 4 Indie Growth Fund. \nTrue North - known for a number of hit series including Teen Mom UK, Homes By The Sea, A New Life In The Sun and Building The Dream - will stay based in the north of England, growing its base in both Leeds and Manchester following the investment. \nSky’s minority stake in Chrysalis Vision will see it gain a foothold in a TV drama production house co-founded by serial entrepreneur and former Pizza Express chairman Luke Johnson, and media executives Chris Wright and Mick Pilsworth. \nSky Vision will become the commercial and distribution partner for content for both companies, though existing agreements with other broadcasters and distributors will be upheld. \nJane Millichip, managing direction at Sky Vision, said: \nWe’re excited to be investing in True North... We’re also delighted to be working with Mick and Chris, who have a great track record in building successful, creative businesses, and the whole team at Chrysalis Vision which will bolster our drama ambitions. \nThe announcement comes just days ahead of Sky’s half-year results, set to be released on Thursday. Investors will be eyeing the report for any update regarding the £11.7bn takeover bid by Rupert Murdoch’s 21st Century Fox, which was formally tabled in December. \nFox’s offer of £10.75 per share for the 61% of Sky it does not already own values the Game Of Thrones broadcaster at £18.5bn. \nThe deal, which shareholders will still have to vote on, comes five years after the media tycoon’s last tilt at taking full control of the business through News Corporation. \nThat bid was derailed after the company - which owns The Sun and The Times - was forced to abandon the bid when it became embroiled in the phone-hacking scandal involving News International. But the media mogul’s renewed attempt to take full control of the broadcaster has sparked controversy and the Labour Party has urged the Government to block the move, with Deputy Leader Tom Watson raising fears that the deal could result in too much media power being concentrated in too few hands. Sky has increased its interest in British indie firms 8:27 Jonathon Manning Fraud in the North East soared by 25%, according to new study \nThe number of fraud cases taking place across the North East is on the rise, a new report says. \nMajor fraud cases, those valued at over £100,000, increased by 25% over the last year, from 16 in 2015 to 22 in 2016, while the value of fraud perpetrated by employees in the region has more than tripled, from £274,000 to £851,000. \nThe figures, in a report by professional services firm KPMG, some after police said fraud was now the most commonly perpetrated crime in the UK, with nearly one in 10 adults falling victim to scams. \nThe value of fraudulent activity in the North East decreased by 86% to £19.4m in 2016, though this was partly due to one £111m case in 2015 that skewed that year’s figures. \nAmong the cases hitting the headlines in the region last year included a jeweller from Houghton-le-Spring, County Durham, who was jailed for three years over a £1.25m tax scam involving the sale of luxury watches. \nSara Smith, senior manager at KPMG Forensic in the North East, said: \nFraud is on the up and dominated by low-value cases, suggesting individuals are stealing less significant amounts of money in an attempt to avoid detection. \nThe fact employee fraud has more than doubled in comparison to last year is also concerning. \nIt’s a stark warning that business owners need to be vigilant when it comes to keeping an eye on potential fraudulent activity in their own organisations, and highlights the importance of implementing appropriate fraud prevention measures. Only by doing so will management teams be able to effectively mitigate risk and protect their business. \nKPMG said the total value of alleged fraud reaching the UK courts broke the £1bn barrier in 2016. This was the first time since 2011 that fraud had exceeded £1bn due to an increase in “super fraud” cases valued at over £50m. Sara Smith, senior manager KPMG Forensic in the North East (Photo: MARTIN@DORCHESTERLEDBETTER.CO.UK) 18:23", "external_links": [], "published": "2017-01-24T14:55:00.000+02:00", "crawled": "2017-01-24T11:59:28.071+02:00", "highlightTitle": ""}