{"organizations": [], "uuid": "e2ef9fbea4bbae7d9c25b3ff1d0f168f1a9e9618", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10924883.ece/ALTERNATES/s1200/JS50178969.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-recruitment-drive-hundreds-jobs-12472384", "country": "GB", "domain_rank": 21960, "title": "Nissan recruitment drive and hundreds of jobs up for grabs in North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan recruitment drive and hundreds of jobs up for grabs in North East", "spam_score": 0.0, "site_type": "news", "published": "2017-01-18T21:05:00.000+02:00", "replies_count": 0, "uuid": "e2ef9fbea4bbae7d9c25b3ff1d0f168f1a9e9618"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-recruitment-drive-hundreds-jobs-12472384", "ord_in_thread": 0, "title": "Nissan recruitment drive and hundreds of jobs up for grabs in North East", "locations": [], "entities": {"persons": [{"name": "newbiggin", "sentiment": "none"}, {"name": "damian hinds", "sentiment": "none"}, {"name": "steve mccall", "sentiment": "none"}, {"name": "sandy bay", "sentiment": "none"}, {"name": "whitley bay", "sentiment": "none"}, {"name": "mccall", "sentiment": "none"}], "locations": [{"name": "berwick", "sentiment": "none"}, {"name": "haggerston castle holiday park", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "cresswell towers", "sentiment": "none"}, {"name": "sports assistants", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "jobcentre plus northumberland tyne", "sentiment": "none"}, {"name": "bourne leisure", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan recruitment drive and hundreds of jobs up for grabs in North East New work opportunities revealed as latest figures reveal jobless total in North East has flatlined Share Two millionth Nissan Qashqai on the production line in Sunderland Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHundreds of jobs are up for grabs in the North East which includes an ongoing recruitment drive at Nissan. \nThe Japanese carmakers, which employs around 7,000 staff at its Sunderland plants , has taken on great symbolic importance after the EU referendum result . \nIt was thought a Brexit vote might force it to slash investment in the North East as it could cut it off from European markets. \nHowever a secret deal last year in which the government is believed to have offered it support has seemingly persuaded bosses they should stay. \nIts recruitment drive was outlined by Steve McCall of Jobcentre Plus Northumberland Tyne and Wear today as the latest quarterly employment figures were revealed. \nHe revealed Nissan is regularly interviewing for new staff, taking on around 15 people a month to work in its factory or its supply chain. \n“They go on a two work training course which gives them an insight into the work and Nissan want to continue working with Jobcentre Plus throughout 2017.” Damian Hinds, employment minister \nMeanwhile the North East unemployment rate has flatlined at 6.8% - but is still the highest in the rest of the UK with an average of 4.8%. The jobless total in this region for the three months to November was 87,000. \nThe amount of people in work is 1.2m, down 13,000 on the previous quarter, though up 4,000 for the same September to November period for 2015. \nMr McCall said: “The employment rate is a bit bumpy this time of year so we look at the year-on-year figure which shows employment is up.” \nHe said Nissan was among a number of recruitment drives in the region in the New Year. \nMr McCall said: “Go North East is looking to recruit 250 drivers. \n“We are working closely with Bourne Leisure who own Haggerston Castle Holiday Park near Berwick who are recruiting across a range of job roles, including bar staff, waiting staff, kitchen porters, sport assistants, lifeguards, chefs, Lifeguards and Sports Assistants. On offer is 10 months of work.” \n• More details can be found on www.bournejobs.co.uk/search \n“We also expect recruitment to start soon for Parkdean Holidays with parks at Cresswell Towers, Sandy Bay, Newbiggin and Whitley Bay. These jobs aren’t yet on their website. \n“And Alnwick Castle and Gardens are also recruiting for the 2017 season.” \n• More details found on", "external_links": [], "published": "2017-01-18T21:05:00.000+02:00", "crawled": "2017-01-18T16:38:35.803+02:00", "highlightTitle": ""}