{"organizations": [], "uuid": "f6c42ada18ebaa5d1816ff6dd018f821b5e346fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12472520.ece/ALTERNATES/s1200/Childrens-Christmas-online-posts-concern.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-go-bubble-new-social-12472421", "country": "GB", "domain_rank": 21960, "title": "What is Go Bubble, the new social media site dubbed the 'Facebook for kids'?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What is Go Bubble, the new social media site dubbed the 'Facebook for kids'?", "spam_score": 0.0, "site_type": "news", "published": "2017-01-18T21:09:00.000+02:00", "replies_count": 0, "uuid": "f6c42ada18ebaa5d1816ff6dd018f821b5e346fd"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-go-bubble-new-social-12472421", "ord_in_thread": 0, "title": "What is Go Bubble, the new social media site dubbed the 'Facebook for kids'?", "locations": [], "entities": {"persons": [{"name": "henry platten", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "pegi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "pan european gaming information", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What is Go Bubble, the new social media site dubbed the 'Facebook for kids'? The app and website lets children chat online with school friends and share jokes, pictures and videos Share Click to play Tap to play The video will start in 8 Cancel Play now What is Go Bubble? The new social media site dubbed the 'Facebook for kids' Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA ‘Facebook for kids’ app and website has been launched with kids as young as seven able to sign up. But is it really safe for youngsters to use? \nWe take a look at what ‘Go Bubble’ is, how it works and tell you how you get sign up. Firstly, remind us what the age limit on using sites like Facebook? \nThe age limit on using sites like Facebook is 13, but four out of five primary school kids have admitted to using social media at least once a day. So what is this new app and whose idea was it? \nGo Bubble and was created specifically with younger children from the age of seven in mind. It’s the brainchild of former police sergeant and e-safety guru Henry Platten who co-founded the multi-award winning eCadets. He was determined to give parents and teachers the tools to deal with the growing trend of children on social media. How different is it to other sites? \nIt lets children chat online with school friends, share jokes, pictures or videos. \nBut the main difference is that it puts the child’s school at the centre of their social media network and teachers will be able to monitor activity. The new social media platform is aimed at making the internet safer for children Read More How Brexit could hit you in the pocket with iPhone and iPad apps set to increase by 25% How does it work? \nThe school signs its pupils up, with parental approval, and children can safely talk to children in their own class, school, or even with children the same age in schools around the world. And the result of this is? \nGo Bubble puts an end to unwanted friend requests, dubious content and the potential for cyber-bullying - allowing children to take advantage of the best bits of social media without any of the negative aspects. \nAll posts are automatically moderated through the system’s safety features, ensuring any inappropriate video, images, text, audio or emojis, are removed before going live. \nThere’s also an award-winning live moderation team who review any flagged messages. And it has been awarded a PEGI 3 rating – the safest age rating available from the governing body (Pan European Gaming Information). Read More The dangerous new craze sweeping across UK schools - here's everything parents need to know When does it come into operation? \nSchools are already using the platform to help children collaborate on school projects, learn about new cultures, develop pen pals, teach children about safe social media use, and send parents messages via the site. How do you get hold of it? \nThe web and app version of Go Bubble is available free to schools. Outside of school, parents and children can access Go Bubble via the web for free or have the option of downloading the app onto their tablet, laptop or mobile device for £3 a year. Like us on Facebook", "external_links": [], "published": "2017-01-18T21:09:00.000+02:00", "crawled": "2017-01-18T16:41:22.287+02:00", "highlightTitle": ""}