{"organizations": [], "uuid": "69e563af9184487de5cdcd2b3cffc384ac774952", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10074261.ece/ALTERNATES/s1200/rolls-royce-dawn-23edx-0057.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/incoming/north-east-business-news-live-12424171", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Rolls-Royce vows to stay in UK after sales jump", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Rolls-Royce vows to stay in UK after sales jump", "spam_score": 0.0, "site_type": "news", "published": "2017-01-09T15:00:00.000+02:00", "replies_count": 0, "uuid": "69e563af9184487de5cdcd2b3cffc384ac774952"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/incoming/north-east-business-news-live-12424171", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Rolls-Royce vows to stay in UK after sales jump", "locations": [], "entities": {"persons": [{"name": "muller-otvos", "sentiment": "none"}, {"name": "stefan rousseau/pa wire", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "torsten muller-otvos", "sentiment": "none"}, {"name": "antonio horta-osorio", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "bognor regis", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "goodwood", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "logistics centre", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "west essex", "sentiment": "none"}], "organizations": [{"name": "rolls-royce", "sentiment": "negative"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk financial investments", "sentiment": "none"}, {"name": "rolls-royce motor cars", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Share \nHello and welcome to the Journal Business team's morning live blog for Monday, January 9. \nI'm Jonathon Manning and I'm running the live blog to bring you regular updates on all the breaking business news from across the North East and beyond. \nThe business breakfast live blog covers the latest big stories from the region's business community, as well as national news, FTSE updates and stock exchange announcements from the Journal region's listed companies and national firms - anything and everything from the world of business basically. \nToday's big news is that British luxury car manufacturer Rolls-Royce has pledged to stay in the UK after sales increased by 6% last year. \nLloyds Banking Group is also a step closer to being returned to private hands after the Government reduced its stake in the group to less than 6%. The deal means that the taxpayer is no longer the business's largest shareholder. \nI'll be reporting on all the latest news as it breaks as well as sharing some of the best business news from across the North East that you may have missed. \nIf you'd like to contribute tweet at @jnlbusiness to share your opinions, drop me a line at jonathon.manning@trinitymirror.com or tweet me at @JonnyAManning 8:06 Jonathon Manning Government reduces stake in Lloyds Banking Group to less than 6% \nThe Government has reduced its stake in Lloyds Banking Group to less than 6%, meaning the taxpayer is no longer the group’s largest shareholder and takes the lender one step closer to being returned to private hands. \nUK Financial Investments, which manages the Government’s stake in Lloyds, cut its holding in the lender by one percentage point. It means the taxpayer’s stake in the bank now stands at 5.95%, with more than £18bn being returned to Government coffers since the lender’s £20.3 billion bailout. \nIt is the latest in a series of share sales by the Government, which said in October it hoped to offload its remaining shares in Lloyds within a year. \nLloyds boss Antonio Horta-Osorio said: \nToday’s announcement that the UK Government is no longer our largest shareholder is a key milestone in the journey of Lloyds Banking Group back to full private ownership, returning taxpayers’ money at a profit. \nIt also reflects the hard work undertaken by everyone at Lloyds over the last five years to transform the Group into a simple, low-risk and customer-focused bank that is committed to helping Britain prosper. \nThe Government has progressively sold down its original 43% stake in Lloyds and Chancellor Philip Hammond ditched plans for a share sale to the public in October, opting instead to offload the holding to institutional investors. Lloyds cash machines (Photo: Stefan Rousseau/PA Wire) 8:01 Jonathon Manning Rolls-Royce Motor Cars renews UK commitment after sales hike \nRolls-Royce Motor Cars has renewed its commitment to Britain after a double-digit jump in UK revenues helped the German-owned company notch up its second highest sales record in over a century. \nThe Essex-based company - which is owned by auto giant BMW - sold 4,011 cars in 2016, up 6% from a year earlier, thanks to record demand in countries including the US, Japan, UK and Germany. \nIt comes despite difficulties in the Middle East, where Rolls-Royce said demand for all luxury goods was dampened by economic and political uncertainties. \nRolls-Royce Motor Cars saw a 26% sales spike in its UK home market, while sales in the US jumped 10%, China rose 23% and Japan soared 51%. \nChief executive Torsten Muller-Otvos said the figures prove there is still appetite for Britain’s luxury brands, and promised the company would not be giving up its UK roots. He said: \nThis remarkable result emphatically affirms the global appeal of the very finest British luxury goods to the world’s most discerning patrons. \nWe are deeply committed to a long term, sustainable, successful growth strategy and this result, amidst a backdrop of global uncertainty, affirms this approach. 2016 has proven the perfect year to sign off the successful first chapter of the renaissance of Rolls-Royce. \nSuccess for Rolls-Royce is success for Great Britain and we reaffirm our commitment to maintaining the home of Rolls-Royce in the UK. \nThe Brexit vote has raised questions as to whether foreign-owned companies will maintain manufacturing hubs in the UK, especially if the Government opts to leave the EU’s single market, resulting in higher tariffs for exported goods including luxury vehicles. \nMr Muller-Otvos’s comments follow reports that the chief executive wrote to workers in March, warning them that an exit from the European Union would drive up costs and prices and could affect the company’s “employment base”. \nHowever, Rolls-Royce says it is planning to extend its 30,000 square metre Technology and Logistics Centre in Bognor Regis - close to its manufacturing hub in Goodwood, West Essex - in 2017 by nearly 10,000 square metres “to meet growing demand and in readiness for future models”. \nHigher demand also pushed Rolls-Royce to create another 100 new jobs in Goodwood last year. The company now employs 1,700 people, a near 500% increase on its 350-strong team in 2003. \nMr Muller-Otvos said: \nOur business model, which is rooted in our unique and detailed understanding of the multifaceted world of luxury, is producing growth at just the right pace for a truly rare and exclusive brand. This is what our customers demand of us and this is what we will continue to deliver. A Rolls-Royce car", "external_links": [], "published": "2017-01-09T15:00:00.000+02:00", "crawled": "2017-01-09T10:11:25.754+02:00", "highlightTitle": ""}