{"organizations": [], "uuid": "481ece454e2cf4c4ad874a036dd8c32d7e9055c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11581888.ece/ALTERNATES/s1200/JS74554082.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-launches-consultation-manifesto-jobs-12432162", "country": "GB", "domain_rank": 21960, "title": "Labour launches consultation on manifesto for jobs and industry", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Labour launches consultation on manifesto for jobs and industry", "spam_score": 0.0, "site_type": "news", "published": "2017-01-11T12:00:00.000+02:00", "replies_count": 0, "uuid": "481ece454e2cf4c4ad874a036dd8c32d7e9055c8"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-launches-consultation-manifesto-jobs-12432162", "ord_in_thread": 0, "title": "Labour launches consultation on manifesto for jobs and industry", "locations": [], "entities": {"persons": [{"name": "chi onwurah", "sentiment": "none"}, {"name": "clive lewis", "sentiment": "none"}, {"name": "onwurah", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "birtley", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}], "organizations": [{"name": "news labour", "sentiment": "negative"}, {"name": "aei cables", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "invalid email  labour", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "aei", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour launches consultation on manifesto for jobs and industry Industrial strategy will be a key part of Labour's next general election manifesto and Chi Onwurah is helping to shape it Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour is asking employers and workers across the North East to help write an industrial strategy which will be a key part of the general election manifesto. \nNewcastle Central MP Chi Onwurah is overseeing the consultation in her role as a shadow business minister, alongside Shadow Business Secretary Clive Lewis. \nThe consultation will help the party draw up policies for the entire country and one of the questions Labour is considering is how to ensure that economic growth is balanced regionally so that jobs and wealth come to the North as well as to London and the south east. \nMs Onwurah highlighted the announcement earlier this month that AEI Cables in Birtley, Gateshead , is ending production with the loss of 185 jobs, and said a future Labour government needed an industrial strategy that would prevent this type of closure. AEI cables based in Birtley, Gateshead \nShe said: “That’s a tragedy for the workers and the community, and further weakens our industrial foundations. \n“Preventing this sort of disaster requires a clear and positive vision for our economic future with specific measures so people, communities, and businesses have the certainty to plan for a prosperous future. \n“Tied up with undeliverable Brexit promises and internal Tory party bickering, it’s clear that the government is neither capable of nor interested in providing this.” \nLabour said it wants to hear proposals for ways a future government could work with employers, trade unions, universities and others to create an economy that is “prosperous and competitive” and that “leaves no one behind”. \nPriorities include backing successful industries such as advanced manufacturing, the automotive sector, aerospace, digital industries, bio-technologies and the cultural and creative industries. \nLabour also said the industrial strategy must be designed to “take our whole country with it”. MP Chi Onwurah \nA paper published by Labour ’s shadow industry team said: “Expanding our economy’s centre of gravity from London is a necessity, to Londoners suffering a cost of living crisis, as much as for the regions left behind.” \nAnd it said a future government should “unlock the potential” of towns and villages, in contrast to what Labour said is the Government’s focus on big cities. \nLabour also said it was committed to supporting employees by ensuring training was available, and creating a “healthy business culture” by encouraging firms to take a long-term view rather than aiming for short-term profits. Read More Call for laws to ensure more women get a seat in future parliaments \nThe North East has the worst economic output in England, according to figures from the Office for National Statistics. Output per person is £18,927 in the North East, lower than in any part of the UK except for Wales and significantly lower than the South East figure of £27,847. \nHowever, the economy is growing in the North East faster than in most other parts of the country. \nMs Onwurah said: “We need an industrial strategy to deliver the high-skill, high-wage economy the British people want. \n“Whilst the Government dithers around Tory party internal politics, Labour is getting on with the job. Our industrial strategy will be challenge-led, mission-orientated, values-driven and reflect the contributions of stakeholders large and small. Please get involved and have your say on the jobs of the future.” \nTo take part in the consultation visit www.labourbeis.org . Like us on Facebook", "external_links": [], "published": "2017-01-11T12:00:00.000+02:00", "crawled": "2017-01-11T07:44:23.137+02:00", "highlightTitle": ""}