{"organizations": [], "uuid": "e27470ba3e510c5b5bc3699e221f5e47cf8c2558", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12491867.ece/ALTERNATES/s1200/A19-Sunderland.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/backing-5000-job-north-east-12491837", "country": "GB", "domain_rank": 21960, "title": "Backing for 5,000-job North East business park in Government's new industrial strategy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Backing for 5,000-job North East business park in Government's new industrial strategy", "spam_score": 0.0, "site_type": "news", "published": "2017-01-23T15:57:00.000+02:00", "replies_count": 0, "uuid": "e27470ba3e510c5b5bc3699e221f5e47cf8c2558"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/backing-5000-job-north-east-12491837", "ord_in_thread": 0, "title": "Backing for 5,000-job North East business park in Government's new industrial strategy", "locations": [], "entities": {"persons": [{"name": "clive lewis", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "michel euler", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "energy", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "green paper", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east local enterprise partnership", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Downhill Lane junction on the A19 (Photo: Handout) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May is to announce a £50m grant for job-creating projects in the North East, including an International Advanced Manufacturing Park in South Tyneside and Sunderland which is expected to create 5,000 roles. \nThe cash will go to the North East Local Enterprise Partnership , which involves councils and employers, as part of the Government’s new Industrial Strategy. \nThere will also be £21.8m for the Tees Valley area, as Mrs May explains how she intends to keep her promise to ensure every part of the country succeeds as the UK leaves the European Union. \nOther measures include deals with specific industries such as car manufacturers. The Prime Minister is ending the traditional Conservative approach of backing the free market while letting businesses succeed or fail on their own. Instead, she argues that Government should intervene to help employers. \nMrs May said: “The modern Industrial Strategy will back Britain for the long term: creating the conditions where successful businesses can emerge and grow, and backing them to invest in the long-term future of our country. \n“It will be underpinned by a new approach to government, not just stepping back but stepping up to a new, active role that backs business and ensures more people in all corners of the country share in the benefits of its success.” Read More Theresa May accused of betraying the North East over total Brexit plan \nThe International Advanced Manufacturing Park is set to be completed by 2027 at a 285-hectare site that bridges South Tyneside and Sunderland, just north of the Nissan plant. \nIt’s a joint venture between Sunderland City Council and South Tyneside Council, designed to provide a “world-class environment for high-tech industries and advanced manufacturing businesses”. \nAnd it will receive a share of £556m to be distributed to Local Enterprise Partnerships in the north of England, including the North East, North West and Yorkshire. The money comes on top of existing grants. \nA Green Paper will also set out technologies where the UK can lead the world, such as robotics and artificial intelligence, and 5G mobile network technology. A new Industrial Strategy Challenge Fund will support research and development in these sectors. British Prime Minister Theresa May (Photo: Michel Euler) \nIndustries will also be invited to negotiate deals with government to help them succeed. For example, carmakers across the UK could set out the support they need to lead the world in electric cars. \nIt means different firms across the UK will be encouraged to come together to negotiate, either through existing trade bodies or by making new arrangements. \nThe Government says it is ready to invest in research, provide training, improve infrastructure such as internet services and help firms obtain finance such as loans. \nBut Labour said they did not trust Mrs May to deliver on her promises. Read More Location of £300m Tyneside manufacturing park set to be put before residents \nClive Lewis, Shadow Secretary of State for Business, Energy and Industrial Strategy, said: “This belated attempt to develop a proper industrial strategy is a step in the right direction, but once again what the Tories are offering looks like too little too late.” \nAs well as Mrs May, the strategy is led by Greg Clark, the Business Secretary, who grew up in Middlesbrough. He said: “We are inviting businesses and workers to contribute to this vision to help us create a high-skilled economy where every place can meet its potential.” \nEmployers welcomed the strategy. Mike Cherry, National Chairman for the Federation of Small Businesses (FSB), said: “We are proud to be influencing a major government economic blueprint and particularly pleased with the push on skills, infrastructure and connectivity as important drivers of productivity and industry.” Like us on Facebook", "external_links": [], "published": "2017-01-23T15:57:00.000+02:00", "crawled": "2017-01-23T12:41:43.123+02:00", "highlightTitle": ""}