{"organizations": [], "uuid": "f6c79a2ead28118cdb5cf825a3b051a9235b7481", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12421062.ece/ALTERNATES/s1200/MKR_NEC_070116copeland_02.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-couple-launch-separate-bids-12420996", "country": "GB", "domain_rank": 21960, "title": "Newcastle couple launch separate bids to become Cumbrian MP", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle couple launch separate bids to become Cumbrian MP", "spam_score": 0.0, "site_type": "news", "published": "2017-01-08T12:00:00.000+02:00", "replies_count": 0, "uuid": "f6c79a2ead28118cdb5cf825a3b051a9235b7481"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-couple-launch-separate-bids-12420996", "ord_in_thread": 0, "title": "Newcastle couple launch separate bids to become Cumbrian MP", "locations": [], "entities": {"persons": [{"name": "stephen lamber", "sentiment": "negative"}, {"name": "reed", "sentiment": "none"}, {"name": "rachel holliday", "sentiment": "none"}, {"name": "lambert", "sentiment": "none"}, {"name": "stephen lambert", "sentiment": "none"}, {"name": "thomas docherty", "sentiment": "none"}, {"name": "coun lambert", "sentiment": "none"}, {"name": "margaret murning", "sentiment": "none"}, {"name": "usman ahmed", "sentiment": "none"}, {"name": "stephen lambert  like much of the north", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "jamie reed", "sentiment": "none"}, {"name": "copeland", "sentiment": "none"}], "locations": [{"name": "shropshire", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "egremont", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "cleator moor", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "copeland", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "northumberland labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ladbroke", "sentiment": "none"}, {"name": "paddy power", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "dunfermline", "sentiment": "none"}, {"name": "cancel play now labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "whitehaven", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle couple launch separate bids to become Cumbrian MP Newcastle councillor Stephen Lambert, and wife Margaret Murning, have both put themselves forward for selection in the Copeland by-election Share Click to play Tap to play The video will start in 8 Cancel Play now Labour: Deselection and reshuffle rumours top of Corbyn's agenda Share this video Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA Newcastle couple have launched separate bids to become Labour MPs. \nStephen Lambert, a Newcastle city councillor, who has submitted his name alongside his wife Margaret Murning, to be named as Labour candidates to fight for the Copeland seat in Cumbria. \nThe by-election was triggered when Jamie Reed announced his surprise resignation in the run-up to Christmas. \nCopeland, and its predecessor seat, have been held by the party since the 1930s but Reed’s majority was just 2,564 over the Conservatives at the last general election, \nWhile neither Coun Lambert, nor Ms Murning, know if they will make the ballot paper they have joitn fears UKIP could be the biggest threat to Labour holding the seat. \nCoun Lambert said: “It’s a marginal seat and the campaign will be fought like its a marginal seat.” \nAnd he said if chosen he would tackle UKIP on its favoured policy ground - immigration. \nMr Lambert, 58, who describes himself as a Labour moderate, said: “UKIP clearly are a major threat to Labour in the North West - as they are in the North East. \n“We really need to grasp this issue of immigration. We need to have selected immigration, it can’t be unskilled immigration coming from eastern Europe. Whatever people say, it is having an impact on our communities. And we have to face up to the fact that doing nothing is not an option.” Margaret Murning and Stephen Lambert \nLike much of the North, the Copeland constituency heavily in backed Brexit - in its case 62% voted to leave the European Union - mainly because of concerns over immigration. \nAsked if this meant ‘out-UKIP-ing UKIP on immigration control, Mr Lambert said: “I don’t think it is. I am fully aware of the economic and cultural benefit immigrants have brought to this country, I have no issue with that at all. \n“I also believe in taking in refugees - not economic migrants - and I think we should be doing more as an advanced nation. \n“We can’t dismiss people’s lived experiences. For too long Labour has simply not listened to the concerns of the white working class community.” \nA date for the by-election has yet to be set while the deadline for Labour candidates to throw their hats in the ring is Monday. \nOther names mentioned who could be in the running include Usman Ahmed, a Shropshire councillor; Thomas Docherty the former Dunfermline and West Fife MP, who lost his seat in 2015; and mum-of-two Rachel Holliday, a Whitehaven health campaigner who was named Cumbria Woman of the Year for fighting to set up a hostel for homeless veterans in Egremont. \nMeanwhile Mr Lambert’s wife explained why she wanted to be selected to fight the seat. \nMs Murning, 55, of Gosforth, Newcastle, said: “I was born and bred in Cleator Moor which is at the heart of the constituency. I went to school there, have friends and strong connections to the area - my father who died recently still has a house there. \n“When I was growing up I had to move out to get an education, that’s a problem for Copeland, the brain drain of young people. \n“Another serious local issue is the dreadful affect the cuts have had on the health service there. I’ve been a health visitor for nearly 30 years and am aware of the concerns people in Copeland have and I’d love to have that opportunity to help.” Read More 'Labour don't stand a cat in hell's chance' - Northumberland Labour councillor's outburst \nSpeaking about going head-to-head with her husband for selection she said: “We’ve been married since 1996. We’re a team, we’ve always supported each other and may the bets person win.” \nWhoever wins could be in for a fight as the bookie all have the Tories as favourites at Evens with Labour at 6/5 against. \nUKIP odds are as short as 13/2 with Paddy Power going out to 10/1 with Ladbroke’s. \nMeanwhile the Lib Dems trail in fourth with odds ranging from 40/1 to 66/1. \nThe shortest odds for the Green party are 150/1. Like us on Facebook", "external_links": [], "published": "2017-01-08T12:00:00.000+02:00", "crawled": "2017-01-08T07:34:07.110+02:00", "highlightTitle": ""}