{"organizations": [], "uuid": "e423e87143943f353460b9014153a5ba661f9f4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12483570.ece/ALTERNATES/s1200/Chesterton-windmilll.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/northumberland-farm-business-grainco-sees-12483403", "country": "GB", "domain_rank": 21960, "title": "Northumberland farm business Grainco sees sales plunge by more than £20m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Northumberland farm business Grainco sees sales plunge by more than £20m", "spam_score": 0.0, "site_type": "news", "published": "2017-01-20T21:18:00.000+02:00", "replies_count": 0, "uuid": "e423e87143943f353460b9014153a5ba661f9f4e"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/farming/northumberland-farm-business-grainco-sees-12483403", "ord_in_thread": 0, "title": "Northumberland farm business Grainco sees sales plunge by more than £20m", "locations": [], "entities": {"persons": [{"name": "susan duck", "sentiment": "none"}, {"name": "grianco", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "northern england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wilton", "sentiment": "none"}, {"name": "invalid email  north east", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "grainco", "sentiment": "negative"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northumberland farm business Grainco sees sales plunge by more than £20m The grain drying business said the closure of a bioethanol plant in Teesside had impacted its business Share Fields of wheat (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East grain co-operative Grainco has seen sales plunge by more than £20m after the closure of a bioethanol facility on Teesside. \nThe Tyne Dock firm saw its turnover fall to £153.1m, and said that the 2015 closure of Ensus’ fuel plant in Wilton had reduced its UK sales and make it more reliant on exports. \nIn Grainco’s financial accounts, company secretary Susan Duck said: “The 2015/16 trading year was export driven due to the closure of Ensus, reducing domestic demand combined with excellent yields increasing the surplus available within our trading region. \n“Record volumes of grain and oilseeds were exported from our key ports in Northern England and Scotland.” The Ensus plant at Wilton (Photo: Handout publicity) \nThe Ensus bioethanol plant produces fuel from UK-grown surplus wheat. The plant has been repeatedly shut down and reopened due to changes in demand for bioethanol. \nEnsus’s Wilton site, which employed around 100 people, last closed down in February 2015 but was reopened on a trial basis last summer. The closure of the plant now appears to have had serious knock-on effects for other businesses in the region. \nGrainco managed to increase its exports from £4.2m to £34.9m over the year. Sales to European countries increased from £4.2m to £20.2m. The firm also began exporting outside of Europe for the first time, which generated revenues of £14.7m. Read More Helping poor families buy nutritious food could be way forward for farmers after Brexit \nHowever, Grianco’s export figures were not enough to mitigate its loss in domestic sales. Revenue generated in the UK fell from £169.1m, to £118.2m. \nThe drop in turnover also led to the firm’s profit falling by 78.7% to £669,000. In 2015 the company’s bottom line was £3.1m. \nMrs Duck added: “Grainco remains as the dominant farmer controlled business in the North East of England and Scotland serving both the domestic and export markets. Grainco has increased its number of farmer clients and maintained the record volumes achieved in the prior financial year, further gains in farm inputs were also achieved.” \nDespite the drop in the firm’s financial results, Grainco did hire an additional two members of staff within its operational division. The hire takes the company’s headcount to 50. Like us on Facebook", "external_links": [], "published": "2017-01-20T21:18:00.000+02:00", "crawled": "2017-01-20T16:38:07.867+02:00", "highlightTitle": ""}