{"organizations": [], "uuid": "3c927af8b257fc869037de881c00c3e02fb78e8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12406482.ece/ALTERNATES/s1200/Conservative-leadership-bid.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farm-regulations-cut-brexit-minister-12406400", "country": "GB", "domain_rank": 21960, "title": "Farm regulations to be cut with Brexit, Minister pledges", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Farm regulations to be cut with Brexit, Minister pledges", "spam_score": 0.0, "site_type": "news", "published": "2017-01-04T23:39:00.000+02:00", "replies_count": 0, "uuid": "3c927af8b257fc869037de881c00c3e02fb78e8e"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farm-regulations-cut-brexit-minister-12406400", "ord_in_thread": 0, "title": "Farm regulations to be cut with Brexit, Minister pledges", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "andrea leadsom", "sentiment": "negative"}, {"name": "rachael maskell", "sentiment": "none"}, {"name": "leadsom", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "oxford farming conference", "sentiment": "none"}, {"name": "eac", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "environmental audit committee", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ms leadsom", "sentiment": "none"}, {"name": "invalid email  farming", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farm regulations to be cut with Brexit, Minister pledges Environment Secretary Andrea Leadsom says leaving the EU will free up the UK's agriculture industry Share Andrea Leadsom (Photo: Chris Radburn/PA Wire) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFarming regulations will be cut to free up the industry as the UK leaves the European Union, Environment Secretary Andrea Leadsom has pledged. \nEU rules that required farmers to grow three different crops each year should be abandoned with Brexit, allowing 40,000 farmers to grow the crops they want, she said. \nComplicated regulations to protect the environment that define what makes a hedge a hedge or dictates when a puddle turns into a pond could also be relaxed, she added. \nFlood-hit farmers would face less paperwork when claiming support for repairs and the number of Government inspections to show compliance with EU rules would be reduced by streamlining them or replacing them with better use of aerial photography. \nChanges could mean farmers will also no longer have to display billboards which show that they receive EU farming subsidies - though they will be losing the £3bn of funding from Brussels a year the signs indicate. \nThe Government has pledged to continue to provide direct payments to farmers up to 2020, but there is growing debate about what will happen in the long term to the financial support landowners currently receive under the EU-wide Common Agricultural Policy (CAP). \nSpeaking at the Oxford Farming Conference, Ms Leadsom said dealing with “red tape” and farm inspections is estimated to cost £5m a year to the industry and takes up 300,000 hours. \nCutting the regulations will free up farmers to grow more food, she argued. \n“For too long, a bureaucratic system which tries to meet the needs of 28 countries has held farmers back. But now, leaving the EU means we can focus on what works best for the United Kingdom. \n“By cutting the red tape that comes out of Brussels, we will free our farmers to grow more, sell more and export more great British food whilst upholding our high standards for plant and animal health and welfare. \n“My priority will be common sense rules that work for the United Kingdom.” Read More Farmers faced a year of challenges but new opportunities lie ahead \nThe Government is consulting farmers later this year on areas of regulation they would like to see reformed. \nMs Leadsom has previously suggested it would be possible to secure a free trade agreement with Brussels in a short amount of time because UK regulations were aligned with the EU’s, though she has also said Brexit is an opportunity to change rules in areas such as farming. \nMs Leadsom’s announcement came as a report from the parliamentary Environmental Audit Committee (EAC) suggested any new system of subsidies brought forward by the Government to replace the CAP should strike a better balance between supporting agriculture and protecting the environment. \nRachael Maskell, shadow environment secretary, said: “Despite some warm words from Andrea Leadsom today, her department’s continued failure to outline a plan for Brexit is deeply disappointing. Rural communities, and the farming and fishing industries that help sustain them, deserve better.” Like us on Facebook", "external_links": [], "published": "2017-01-04T23:39:00.000+02:00", "crawled": "2017-01-04T22:01:45.573+02:00", "highlightTitle": ""}