{"organizations": [], "uuid": "d7a7894e1af5c183c50d8c8dc5e1a70d6c1cf4c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14805056.ece/ALTERNATES/s1200/SGP_NEC_031117NIGHT05JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastles-theatres-could-ruined-new-14805034", "country": "GB", "domain_rank": 21960, "title": "Newcastle's theatres could be ruined by a new EU rule", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-19T20:00:00.000+03:00", "replies_count": 0, "uuid": "d7a7894e1af5c183c50d8c8dc5e1a70d6c1cf4c3"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastles-theatres-could-ruined-new-14805034", "ord_in_thread": 0, "title": "Newcastle's theatres could be ruined by a new EU rule", "locations": [], "entities": {"persons": [], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "people’s theatre", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle's theatres could be ruined by a new EU rule Theatres could be faced with huge bills to replace lighting equipment due to new regulations Share Northern Stage, Theatre Royal, Live Theatre and People’s Theatre have also confirmed they would be hit by the changes (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAs Newcastle prepares to host the biggest cultural event in the country, its respected theatres are facing financial devastation due to new EU regulations.\nThe Great Exhibition of the North will see thousands descend on the city to celebrate what the region has to offer but behind the scenes theatre bosses are sweating over million pound bills.\nDue to European Union rule changes aimed at phasing out older, inefficient light bulbs, theatres have until 2020 to replace their entire lighting rigs. Read More How safe standing is closer to becoming a reality than ever before\nThe cost of purchasing the new equipment and installing it could cost theatres up to £1m, a sum which the boss of the Tyne Theatre and Opera House admitted could cause financial ruin.\nNorthern Stage , Theatre Royal, Live Theatre and People’s Theatre have also confirmed they would be hit by the changes.\nAt present, theatres are exempt from efficiency guidelines as the technology required to light a theatre using low-watt bulbs is lagging behind.\nBut as of 2020, that exemption will no longer apply and the lights theatres rely on will be outlawed from European markets - and because the UK looks highly likely to replicate EU standards to facilitate a trade deal, Brexit won’t change anything.\nLabour councillor John-Paul Stephenson will put forward a motion at next week’s full council meeting calling on the local authority to put pressure on the European Commission to find a compromise. Heaton councillor John-Paul Stephenson (Image: John-Paul Stephenson)\nAlthough some theatre bosses say the EU is engaging and a compromise could be in the making, the Heaton councillor warned the city needs to be alive to the threat to Newcastle’s cultural scene.\nCoun Stephenson, who is an observer to the board of the Tyne Theatre, said: “What the EU are attempting to achieve with these changes comes from a good place but there’s no common sense.\n“It wouldn’t just mean replacing the bulbs, it would mean getting whole new lighting rigs in some cases, which would mean the environmental impact of doing the work could outstrip any efficiency savings.\n“Newcastle is renowned for its cultural scene and the theatres are a large part of that.\n“The EU have made some positive noises in recent weeks but we need to get behind them and make it clear just how much good will there is for these institutions in our city.” Read More What time are Newcastle Quayside's fireworks on Friday to mark the Great Exhibition of the North?\nFrank Lloyd, chair of the governing body of the Tyne Theatre and Opera House, warned there would be a real threat of closure if the theatre faced having to carry out the work.\nHe said: “Most theatres wont be able to foot the £1m bills we’re talking about and it will impact on the quality of the light too.\n“We don’t even make that sort of profit in a year so we’d be looking at a very serious situation where we could face closure, a lot of theatres will.”\nKate Denby, executive director of Northern Stage commended the EU’s environmental initiatives but warned the effect on the theatre would be massive.\nShe said: “Replacing our lighting rig and existing infrastructure could easily exceed £1million, and would also entail a significant loss of income as we would need to close for several weeks while the work is carried out.\n“As a charity with an annual turnover of £3.5 million, this would be incredibly hard to budget for and implement within the next two years. Live Theatre Broad Chare (Image: Newcastle Chronicle)\n“Theatrical performances rely on theatrical lighting; it is the glue that binds every aspect of a performance together, and it relies on having the right tools available.\n“Theatrical lighting manufacturers have identified that no suitable lighting fixtures will be available by September 2020, meaning that in reality we would be unable to replace equipment with more efficient fixtures in that time frame, because no suitable replacements will be available.“\nShe also pointed out stage lighting isn’t a big use of power as it is only used sparingly during performances and added the theatre had a 10-year plan to introduce more efficient LED lighting.\nThe Theatre Royal has made a submission to the EU via an industry body calling for the exemption to be kept in place.\nA spokesperson said they were confident there would be an agreement but the terms had not been agreed.\nCoun Stephenson’s motion calling on council to support the Save Stage Lighting campaign and lobby the EU will be debated on June 27. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-19T20:00:00.000+03:00", "crawled": "2018-06-20T01:48:15.003+03:00", "highlightTitle": ""}