{"organizations": [], "uuid": "674bf23c7b4359782f3ada7795e46668afdebb85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1663566.ece/ALTERNATES/s1200/Plastic-Gove.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/councils-need-more-uniformity-recycling-1663248", "country": "GB", "title": "'Councils need more uniformity on recycling' says environment secretary Michael Gove", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-11T17:12:00.000+03:00", "replies_count": 0, "uuid": "674bf23c7b4359782f3ada7795e46668afdebb85"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/councils-need-more-uniformity-recycling-1663248", "ord_in_thread": 0, "title": "'Councils need more uniformity on recycling' says environment secretary Michael Gove", "locations": [], "entities": {"persons": [{"name": "gove", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "joel cooper", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}], "organizations": [{"name": "share click environment", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "north devon council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Councils need more uniformity on recycling' says environment secretary Michael Gove Mr Gove said Conservative MPs have been \"at the forefront\" of the fight against plastic Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nEnvironment secretary Michael Gove has said there needs to be a \"more uniformed approach\" to recycling by local authorities in Devon.\nSpeaking on his visit to Devon last week, Mr Gove said the different ways in which councils approach recycling \"can lead to confusion\" and low recycling rates.\nDevonLive chief reporter Joel Cooper questioned Mr Gove about our Plastic Free Devon campaign and asked if he though standardising the materials recycled by all councils would help improve the problem. Michael Gove and DevonLive's Joel Cooper\nAt the moment, the type of materials - particularly plastics - that are collected for recycling varies depending on your council.\nFor example, North Devon Council will not collect any black plastic, whereas Exeter City Council has no such restriction. Read More\nOther anomalies apply across Devon which has left some members of the public confused about what they can recycle where.\nMr Gove praised the group Surfers Against Sewage for their work on the plastic free campaigns.\nHe said: \"Conservative MPs have been at the forefront of supporting action by local groups who are determined to make sure we rely less on plastic and deal with waste more effectively. Plastic free Devon Surfers Against Sewage logo\n\"One of the things that central Government needs to do is to think about supporting local Government more effectively so we've got a more uniform approach towards recycling.\n\"The different ways in which local authorities approach recycling can lead to confusion and means recycling rates are not as high as they should be.\" Read More Plymouth is now the UK's first 'plastic free' city\nSpeaking to DevonLive last week, Mr Gove said he believes failing free schools can be turned around , after being questioned about the \"inadequate\" Route 39 Academy in North Devon which he personally backed.\nHe also shared his thoughts on his colleague Boris Johnson's comments about Brexit negotiations heading to \"meltdown\" - saying simply \"Boris is Boris\". Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "http://www.route39.org.uk/"], "published": "2018-06-11T17:12:00.000+03:00", "crawled": "2018-06-11T17:37:42.000+03:00", "highlightTitle": ""}