{"organizations": [], "uuid": "13882b847f8d824cbce1d54c2d55a6954bc90748", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14803892.ece/ALTERNATES/s1200/Tesco-chairman-John-Allan.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/barratt-chairman-appointed-president-business-14803777", "country": "GB", "domain_rank": 21960, "title": "Barratt chairman appointed president of business group CBI", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-19T18:07:00.000+03:00", "replies_count": 0, "uuid": "13882b847f8d824cbce1d54c2d55a6954bc90748"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/barratt-chairman-appointed-president-business-14803777", "ord_in_thread": 0, "title": "Barratt chairman appointed president of business group CBI", "locations": [], "entities": {"persons": [{"name": "john allan", "sentiment": "negative"}, {"name": "paul drechsler", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "cbi barratt", "sentiment": "negative"}, {"name": "barratt", "sentiment": "negative"}, {"name": "cbi", "sentiment": "negative"}, {"name": "tesco", "sentiment": "negative"}, {"name": "teesside ici", "sentiment": "none"}, {"name": "barratts", "sentiment": "none"}, {"name": "barratt developments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Barratt chairman appointed president of business group CBI John Allan, who is also chairman of Tesco, has criticised the Government over its handling of Brexit Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nThe chairman of Newcastle-founded housebuilder Barratts has been appointed president of the business group CBI.\nJohn Allan, who has been chairman of Barratt Developments since 2014, succeeds former Teesside ICI executive Paul Drechsler in the role.\nHe said: “It is a great honour to be elected CBI president at this critical time for the UK’s economy and businesses.\n“As a country we face great challenges and I will try to ensure that the CBI’s rational, evidence-based solutions are presented clearly and forcefully to all concerned, and in particular to the Government.\n“Whether it is finding the best possible outcome to Brexit or focussing energy upon the long-term issues, like the Industrial Strategy, skills and infrastructure, we will campaign honestly and clearly for a future which is good for the British economy and good for the British people.\n“Paul has been an outstanding president helping to steer the business agenda through challenging waters. I look forward to carrying his work forward and to working closely with Carolyn and all the rest of the very talented CBI team.”\nAs well as his role at Barratt, Mr Allan has been chairman of Tesco since 2015 and has also held senior roles at Worldpay, Dixons Retail and Deutsche Post DHL.\nIn 2006, he was made a CBE for services to freight transport and he has advised organisations that include the Home Office, Care UK Health and Social Care and London First.\nCBI director-general Carolyn Fairbairn said: “It’s a great pleasure to welcome John to the CBI as our new president.\n“His passion, and the breadth of his experience and knowledge – formed over decades at some of the largest employers in the country – will be of tremendous value to us at such an important juncture for British industry.”\nIn an interview published earlier this week, Mr Allan said that Brexit was going to impact the UK economy and called for the the process to be done in “the most orderly way that maximises our chances of success thereafter”.\nHe also criticised the Government and said that Brexit was distracting Ministers from other important challenges facing the economy. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-19T18:07:00.000+03:00", "crawled": "2018-06-19T19:18:38.018+03:00", "highlightTitle": ""}