{"organizations": [], "uuid": "7880fd81de6fcd9b7d534e35d627d00b884a5943", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13216043.ece/ALTERNATES/s1200/BELGIUM_Brexit_105858.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/alarm-north-east-eu-advises-14751248", "country": "GB", "domain_rank": 21960, "title": "Alarm in North East as EU advises businesses not to buy British products", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-06T17:19:00.000+03:00", "replies_count": 0, "uuid": "7880fd81de6fcd9b7d534e35d627d00b884a5943"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/alarm-north-east-eu-advises-14751248", "ord_in_thread": 0, "title": "Alarm in North East as EU advises businesses not to buy British products", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "state", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Alarm in North East as EU advises businesses not to buy British products Goods and cars manufactured in the UK could face much higher import tariffs when they arrive in the EU after Brexit Share EU Chief Brexit Negotiator Michel Barnier, right, and British Secretary of State David Davis make statements as they arrive at EU headquarters in Brussels on Monday, June 19, 2017 (Image: AP) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nEuropean authorities are advising their companies to avoid British products ahead of Brexit in a move that will alarm many businesses in the North East.\nThe region’s automotive industry in particularly could be hard hit after both the EU and the Dutch Government issued advice warning businesses that British-made products will no longer receive trade benefits.\nMost free trade agreements include “rules of origin” regulations which mean that goods manufactured in an area like the EU can benefit from lower tariffs.\nBut the uncertainty around Brexit has raised the likelihood that products containing British components will no longer have that protection.\nFor car manufacturers based on the continent, this means using British-made components could harm their access to countries the EU has free trade agreements with, making it more attractive for them to get parts from mainland Europe instead. Nissan Qashqai (Image: Handout)\nIn an advice bulletin to businesses, the EU has said that “EU-27 exporters and producers, intending to claim preferential tariff treatment in an EU FTA partner country as from the withdrawal date, are advised to treat any United Kingdom inputs as ‘non-originating’ when determining the EU preferential origin of their goods; and take appropriate steps to be able to prove the EU preferential origin of their goods, in case of subsequent verification, without taking account of any United Kingdom inputs as ‘EU content’.”\nThe Dutch Government, meanwhile, has told firms that “Brexit will also have consequences for exports outside the European Union. If you use lower import duties on the basis of a trade agreement, you might not be able to benefit from this after Brexit”. Read More More than 60 jobs created as Utility Alliance expands into Tyneside - and more will follow\nA number of reports have previously raised the possible harm to the UK automotive industry if it loses access to the EU single market.\nThe automotive sector is a particularly important employer in the North East, with around 7,000 people working at the Nissan plant in Sunderland, thousands more in the supply chain and hopes to create even more jobs with an automotive park being planned at Sunderland and South Tyneside. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nBut it is seen to be particularly at risk because of the number of times components cross national borders before a finished product is made.\nJonathan Walker, head of policy and campaigns, North East England Chamber of Commerce said: “We have made it clear to Government that avoiding harm to the regional economy should be the number one priority for Brexit negotiations.\n“Ensuring our businesses can continue to sell products in the single market and retain membership of the customs union would give exporters certainty and allow us to build on our strong trading relationship with the EU.”\nEarlier this week, a coalition of business groups in the North East issued a report calling for continued access to the single market. Read More Former Wardley coal depot could become key site for North East economy\nThe North East Brexit Group - which comprises business groups, unions, universities and charities - said the region had already lost its position as an exporting region while local businesses had lost work to European competitors.\nResponding to that report, the Department for Exiting the EU said the Government would not “seek membership of the Single Market after we leave the EU, but a bold and ambitious new economic partnership.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-06T17:19:00.000+03:00", "crawled": "2018-06-06T17:48:02.037+03:00", "highlightTitle": ""}