{"organizations": [], "uuid": "6d20e1d9d75eed132eff3c3afed76921159b2ff5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14578775.ece/ALTERNATES/s1200/Car-production-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14824405", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: UK car industry suffering 'death by a thousand cuts'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-26T09:55:00.000+03:00", "replies_count": 0, "uuid": "6d20e1d9d75eed132eff3c3afed76921159b2ff5"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14824405", "ord_in_thread": 0, "title": "Business Breakfast LIVE: UK car industry suffering 'death by a thousand cuts'", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "none"}, {"name": "ukar", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "northern rock", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "jonathon manning northern rock", "sentiment": "negative"}, {"name": "northern rock", "sentiment": "none"}, {"name": "hm treasury", "sentiment": "none"}, {"name": "uk government investments", "sentiment": "none"}, {"name": "bradford & bingley", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Northern Rock assets could all be sold by 2021\nThe organisation responsible for winding down the assets of failed bank Northern Rock has said it is likely that all of the bank’s remaining assets will be sold by 2021.\nUK Asset Resolution (Ukar) - the state-owned group that winds down mortgage books of failed lenders - has said that its work selling off the assets of Northern Rock and Bradford & Bingley would most likely be completed in the next three years.\nThe organisation shrunk its balance sheet by £14.5bn during the year ending March 31, leaving it with just £17.5bn. Since 2010 Ukar has reduced its balance by £96bn.\nUkar said:\nAs always, we will need to satisfy ourselves, UK Government Investments and HM Treasury that whatever option we choose represents value for money for the taxpayer but, subject to the continuation of supportive market conditions, we believe that it is probable that the process can be completed by 2021. Northern Rock Crisis - Queues outside Northern Rock in Newcastle 9:05 Jonathon Manning Historic Newcastle banquet hall to be turned into drinking and dining courtyard\nA former Newcastle banquet hall which once entertained the landed gentry of the North East is set to become a drinking and dining courtyard , plans reveal.\nBack in the 18th Century the Market Lane pub on Pilgrim Street was the site of a grand house for the Simpson family, powerful figures and merchants in Newcastle who used their adjoining Banqueting House to entertain the great and the good of the region.\nThe pub is still a popular city centre haunt, currently undergoing a refurbishment from its owners Malhotra Group, but the the banqueting hall is in a poor state of repair and is too dangerous to enter.\nThe Malhotra Group originally planned to restore the hall to its former glory as part of a two-phase, £500,000 makeover for the Market Lane – which has been serving pints for more than 150 years and is affectionately known as the Monkey bar.\nThe care, property and leisure group took over adjoining, empty part of the Grade II Listed property, and had plans to restore the former banqueting hall in plans which will see the venue double in size and creating new areas including a function room, two outdoor terraces and a restaurant.\nThe plan for the hall has had to be altered, however, because it is in such a poor state, prompting a revised plan which will result in part of the walls and the top of the building being peeled back to reveal an open courtyard, with parts of the historic fabric building to be used in the design, including reclaimed bricks, doors and windows.\nDocuments have been sent to Newcastle city council by BXB Interiors and Architecture, seeking permission to change the use of the vacant outbuilding to rear of the Market Lane inn, to form an external courtyard for drinking and dining purposes. The former Banqueting House to the rear of the Market Lane Inn (Image: Newcastle city council planning site - Malhotra Group) 8:55 Jonathon Manning Last big four accountancy firm gains licence to practice law\nDeloitte has become the last of the big four accountancy firms to gain a licence that will allow it to practice law in the UK.\nDeloitte has gained an Alternative Business Structure, which allows law firms to be formed with non-lawyers holding senior management positions.\nKPMG, EY, and PwC have all practised law in the UK for a number of years, disrupting the traditional legal market.\nIn a statement Deloitte said:\nThe SRA has granted Deloitte LLP an Alternative Business Structure (ABS) licence to operate as a multi-disciplinary practice, meaning that we are able to provide legal services from the 15th June 2018. 8:49 Jonathon Manning Sunderland car battery firm to begin powering offices with its technology\nBattery technology created in the North East could soon be used to power homes and offices around the world.\nHyperdrive Innovation produces battery packs that are used within electric vehicles, but the company’s managing director Stephen Irish has said the company will also be using its batteries to help solve the UK’s energy crisis.\nThe system works by using solar panels to charge batteries which can then be used to power homes when electricity prices are at their highest.\nIn the past those with solar panels were only able to send the electricity they produced back to the grid, but the new tech means people are now able to use the electricity themselves.\nMr Irish said:\nIf you have a battery in your home, you can decouple the supply and demand mis-match and it means anyone can use their own energy.\nIf you link them together it also means you can buy and sell the energy or lend it to others.\nThis linked network means that energy that you store during the day can be directed to your neighbour’s home, if they are low on their own supply.\nUsing batteries to power homes is already being trialled in Cologne, Germany, as part of the SmartCity project, which aims to find new ways of tackling climate change.\nSmartCity Cologne has also provided its residents with smart energy devices, which show the price of electricity at different times allowing them to choose to use their devices at the cheapest times.\nHyperdrive Innovation has also said that the company will also be working with businesses who want to use shipping containers full of batteries to help power their offices. 8:42 KEY EVENT Government turns down £1.3bn tidal lagoon power plant\nThe Government has rejected plans to build the “world first” tidal lagoon project to generate clean energy from the tides.The plans were rejected on cost grounds.\nTidal Lagoon Power wanted subsidies similar to those for new nuclear power to build the £1.3bn facility. The work would have consisted of a U-shaped sea wall with turbines in Swansea Bay.The lagoon had been backed as a “pathfinder” project to develop the tidal technology by an independent review for the Government.\nHowever, Business Secretary Greg Clark told the House of Commons the project did not demonstrate value for money.Tidal Lagoon Power’s founder and chief executive Mark Shorrock reacted furiously to the news, arguing Swansea Bay would add just 30p to consumer bills while new nuclear power plant Hinkley Point C would add £12 or more.He accused the Government of “a vote of no interest in Wales, no confidence in British manufacturing and no care for the planet”.He pledged to work with the Welsh Government to deliver a UK tidal lagoon industry centred in Wales and said:\nSwansea Bay Tidal Lagoon remains key to our vision.\nBut he also warned greater emphasis would be put on projects elsewhere in the world, including northern France.In his statement to MPs, Mr Clark said generating power from the tidal lagoon would be much more expensive than offshore wind or nuclear.As a result it would not be appropriate to lead the company to believe public funds could be justified, he said.He said the electricity generated by the lagoon programme by 2050 could cost up to £20bn more to produce compared to generating that same electricity through a mix of offshore wind and nuclear.That would cost the average British household consumer up to an additional £700 between 2031 and 2050, he said.Analysis of additional economic benefits suggested Swansea Bay would only provide 28 long-term jobs and there would be limited scope for innovation and cost reduction in following schemes, he said.He also played down any export potential of the technology and warned the electricity from the tides would be variable, not constant.\nHe said:\nThe inescapable conclusion of an extensive analysis is that, however novel and appealing the proposal, even with these factors taken into account the cost that would be incurred by consumers and taxpayers would be so much higher than alternative sources of low-carbon power that it would be irresponsible to enter into a contract with the provider.\nBut the move was immediately criticised by MPs and local politicians from across south-west Wales, who described the news as “devastating” for the region which would have benefited from an economic boost.The Welsh Conservatives described the decision as “desperately depressing”.And Plaid Cymru tabled a vote of no confidence in the Secretary of State for Wales Alun Cairns at the National Assembly for Wales following the Government announcement.\nEnvironmental groups also criticised the scrapping of the scheme.Emma Gibson, Senior Campaigner at Greenpeace UK, said:\nA government that styles itself as an international leader in tackling climate change has just rejected the opportunity to become the international leader in developing tidal lagoons that produce clean energy day and night, and whose prices would have fallen after this first demonstration project. An artist's impression how the world's first tidal lagoon power plant would have looked in Swansea Bay, South Wales 8:35 KEY EVENT Knights breaks record with £103.5m law firm float\nLaw firm Knights has successfully raised £103.5m after floating on the London Stock Exchange, in a move that nets £20, for its founders and top bosses.The group - a regional law firm with annual revenues of £35m - confirmed the pricing of shares at 145p each, raising around £50m to fund expansion plans.The firm will be admitted to AIM on June 29 after it saw strong demand from institutional investors for the share pacing, which was “significantly oversubscribed”.\nIt is the biggest law firm flotation since Gateley’s IPO in 2015. Gateley was the first UK law firm to go public and raised £100m.\nThe flotation will also deliver a massive windfall for chairman Bal Johal and other selling shareholders, Karl Bamford, Joanne Beech and Mark Beech, who will receive around £20m as part of the deal.Chief executive David Beech retains a shareholding in the company of around 45.5%.Mr Johal will hold a stake of around 1.7%, while other management will together have a stake of around 3.4%.Knights said the initial public offering (IPO) will allow it to “accelerate its growth strategy, both through organic and acquisition-led growth”.Mr Beech said the flotation marks an “exciting milestone in the growth of Knights”.He added:\nWe believe that the admission to AIM will provide us with a platform to continue our rapid growth, attracting business organically and boosting our profile to secure acquisitions. London Stock Exchange (Image: PA) 8:30 Jonathon Manning Wallsend's Benbecula Group continues expansion after buying two North East firms\nA Tyneside engineering group has continued its rapid expansion after making its third acquisition this month .\nWallsend’s Benbecula Group has carried out a string of acquisitions over the last 12 months including the purchase of three North East firms this month.\nThe acquisitions include Washington hydraulic cylinder manufacturer The Cylinder Service Centre, as well as Tyne and Wear Oils - which produces engineering fluids.\nGary Davison, managing director of Cylinder Service Centre, said:\nWe are delighted to be joining such a progressive and forward thinking group of companies within the Benbecula Group and we are very excited with the opportunities this move presents us to further develop and grow both businesses.\nWe look forward to providing additional services to our existing customers and securing new business opportunities which may not have been previously attainable.\nIn total Benbecula has purchased seven companies over the last nine months. The expansion has been carried out to diversify the firm and offer its customers a wider variety of products.\nCommenting on the deals Benbecula’s CEO Ally MacDonald, who is also chairman at Tekmar Group, said:\nWe are delighted with recent acquisitions which were completed over a short period of time and compliment the existing businesses Lift-rite Engineering, Tyne Gangway and DDS Metals and Plastics which were acquired in October 2017. We are now in a position to offer our existing and new customers a much wider product and service offering locally here in the North East as well as in the national and International markets.\nWe are also pleased to retain the existing employees and management teams who together with the strong supply chain in the North East allows us to move forward with our expansion and growth plans. Gary Davison of Cylinder Service Centre and Ally MacDonald of Benbecula Group (Image: Unknown) 8:25 Jonathon Manning Jobs at risk if Brexit deal ignores service industries, London's mayor warns\nA large number of jobs are being put at risk because the Government is ignoring the UK’s service industries throughout the Brexit talks, according to London’s mayor Sadiq Khan.Mr Khan appeared before MPs to claim that that Prime Minister Theresa May “has her priorities all wrong” during the negotiations. He warned that talks were focusing on trade goods rather than sectors such as financial services, accountancy and the legal profession.The Labour mayor will tell the Public Administration and Constitutional Affairs Committee that trade in services accounts for around 40% of UK exports to the EU.Around 92% of London’s economy is made up of the service sector, the same as Manchester, while it accounts for 91% in Edinburgh, 83% in Leeds and 82% in Birmingham.Ahead of the committee meeting, Mr Khan said:\nThe United Kingdom has a vibrant services industry responsible for employing more than 20 million people across the country.\nAny deal struck by the Government that focuses just on goods, at the expense of services, could seriously damage our economy.\nThe Government’s current approach is further evidence, as if we even needed it, that the Prime Minister has her priorities all wrong.\nLondon is unquestionably the best place in the world to do business. The city is built on strong foundations of innovation, entrepreneurship, creativity and a world-class financial hub - and that is not going to change.\nBut we are already seeing major banks establishing subsidiaries in other EU countries, or moving part of their business out of the capital because EU law requires them to be legally compliant from the day the UK leaves the European Union.\nIf the Government does not change its approach and strike a deal that secures access to the single market for services, this trend will only continue.\nThe result will be fewer jobs, less investment and less prosperity the length and breadth of the country. Mayor of London Sadiq Khan (Image: PA) 8:20 KEY EVENT Newcastle's Blackett Street to be transformed into fairground for six weeks over summer\nNewcastle’s Blackett Street is set to be transformed into a family friendly fairground for six weekends over the summer as part of plans to boost city centre businesses.\nFrom Saturday the usually busy bus route will be closed to motorists on weekends while the road is fitted with outdoor games - such as giant Jenga and Connect 4 - and a host of fairground rides.\nTo give the street a park-like feel, 1,000sq m of artificial grass will be placed on the road from Old Eldon Square to Pilgrim Street for the duration of the weekends, while an avenue of trees will run along the north side of Blackett Street.\nBean bags, mini deck chairs, and an artificial grass sofa will also be brought out to make the street more accessible to both adults and children.\nThe idea for the fairground was devised by Newcastle’s Business Improvement District NE1, which organises a range of programmes to bring people into the city centre. These include Alive After Five, the Quayside Seaside, Newcastle Motor Show, and Restaurant Week.\nStephen Patterson, director of communications at NE1, said:\nThe idea is to create places for people, to make it more pedestrian friendly, and far more welcoming to families. We will see different types of seating. We will have fairground rides towards Old Eldon Square and on part of Blackett Street where the buses would usually pick up.\nHe added:\nClosures start on the June 30 and run for 10 weeks. We are programming six of those as family fun weekends and one will be the motorshow. Other weekends will be taken up by Newcastle Pride, Newcastle Mela and the HSBC Bike Ride.\nThe road closures will coincide with the return of the Screen on the Green to Old Eldon Square on Monday. The screen will show TV coverage of the Wimbledon Championship until the competition ends on July 15, and will then screen films. Screen on the Green will coincide with a fairground that is appearing on Blackett Street this summer (Image: Unknown) 8:15 Jonathon Manning Carpetright swings to loss as it shuts stores in bid to stay afloat\nCarpetright has swung to a loss as the retailer battled with rapidly declining sales and pushed through store closures in a bid to stay afloat.The retailer made an underlying loss before tax of £8.7m for the year to 28 April, having made profit of £14.4m the year before.Carpetright’s statutory loss before tax was £70.5m, compared to a profit of £900,000 in the prior year, which the firm said was driven by the cost of its store closure programme.Group revenue at Carpetright fell by 3% year-on-year, down from £457.6m to £443.8m.In the UK, like-for-like sales were down by 3.6%, with the sales decline accelerating from 0.7% in the first half of the year to 7.8% in the second half.Carpetright’s results come after the company pushed through a Company Voluntary Agreement (CVA), a restructuring procedure allowing it to shut 81 stores.The store closure programme, which is due to be completed by the end of September, will lead to the loss of hundreds of jobs.Carpetright said trading was “heavily impacted” while it was putting together its CVA as some suppliers withdrew their supplies, leading to stock shortages.Net debt jumped to £53m, up from £9.8m, which Carpetright said was due to suppliers tightening their credit terms in response to the distress in the business.Wilf Walsh, Carpetright’s chief executive, said:\nAfter a difficult trading year impacted by reduced consumer spend, increased competition and the legacy of an unsustainable, over-rented store portfolio - the CVA and recapitalisation offers us the chance to rebuild Carpetright which remains the clear market leader in floor coverings with outstanding consumer brand awareness.\nThis will be a transitional year for the group as we work through our recovery plan. Carpetright CEO Wilf Walsh (Image: PA) 8:10", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14824405;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-26T09:55:00.000+03:00", "crawled": "2018-06-26T11:23:07.001+03:00", "highlightTitle": ""}