{"organizations": [], "uuid": "d3463250ceef7a3cea3b5b8f4b2f3d8481ad743d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12711311.ece/ALTERNATES/s1200/Computer-hacker-stealing-information-with-laptop.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14777413", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Hackers attack Dixons Carphone stealing millions of card details", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-13T10:30:00.000+03:00", "replies_count": 0, "uuid": "d3463250ceef7a3cea3b5b8f4b2f3d8481ad743d"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14777413", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Hackers attack Dixons Carphone stealing millions of card details", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "negative"}, {"name": "denison", "sentiment": "none"}, {"name": "steve denison", "sentiment": "none"}], "locations": [{"name": "pricew", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "dixons carphone", "sentiment": "negative"}, {"name": "taveta group", "sentiment": "none"}, {"name": "financial reporting council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning PwC partner handed £325,000 fine and 15-year ban over BHS audit\nA partner at PricewaterhouseCoopers (PwC) who audited the accounts of failed retailer BHS has been fined £325,000 and banned from the profession for 15 years.\nSteve Denison admitted misconduct in relation to the 2014 audit of BHS and the Taveta Group, according to the Financial Reporting Council.\nMr Denison had audited Taveta since 2008 and signed off the BHS accounts as a “going concern” days before it was sold for £1.It later collapsed into administration in 2016, affecting 11,000 jobs and around 19,000 pension holders, leaving a £571m pension deficit.\nPwC was also given a £10m fine, which will be reduced to £6.5m for early settlement.The regulator also fined PwC £10m, which will be reduced to £6.5 million for early settlement.A PwC UK spokeswoman said:\nAt its core this is not a failure in our audit methodology, the methodology simply was not followed.\nAs a result of our internal reviews, we took swift action to enhance our monitoring procedures.\nWhilst the failings did not contribute to the collapse of BHS over one year later, they were serious and this is reflected in the Financial Reporting Council’s settlement. BHS, Northumberland Street, Newcastle, 2013 (Image: Newcastle Chronicle) 9:20 Jonathon Manning Business rates appeals still unresolved from 2010\nMore than 133,000 companies are still waiting for an appeal over their business rates valuation from 2010 to be resolved, it has been revealed.The Local Government Association (LGA) said more than one million challenges to business rates bills have been received over the past eight years.The LGA said councils have been forced to divert £2.5bn from stretched local services over the past five years to cover the risk of business rates appeals, as they have to fund half the cost of any backdated refunds.Ahead of a Westminster Hall debate on Wednesday on business rates, the LGA is calling on the Government to take the financial risk from business rates appeals away from local government.John Fuller, vice chairman of the LGA’s Resources Board, said:\nOngoing delays in tackling business rate appeals from 2010 are heaping further financial uncertainty and pressure on our local services at a time when every penny counts to give councils the best chance of protecting services over the next few years.\nIt is right that a business is able to challenge their valuation if they genuinely believe it to be incorrect.\nDespite not setting business rates or ruling on appeals, councils are having to take billions of pounds away from already stretched local services, such as adult social care, protecting children and supporting businesses and boosting local growth, to cover the financial risk and uncertainty arising from this backlog of appeals. This is completely unfair.\nAs we move towards a system where councils will keep more of the business rates they collect locally, communities need to be protected from the shifting of resources to address the risk of business rates appeals. Business rate challenges are still being heard from 2010 9:15 Jonathon Manning Mulberry launched into South Korea as UK sales soften\nHandbag manufacturer Mulberry has unveiled plans to launch itself into South Korea after finding a joint venture partner.\nThe high end fashion company is partnering with SHK Holdings to expand into the region. It is expected that Mulberry Korea will launch in the autumn.\nThe two firms will invest £4.6m in the expansion. £3.1m will come from Mulberry while £1.5m will come from SHK.\nA new head office will be opened in Seoul, where the distribution and digital sales will be managed.\nMulberry chief executive Thierry Andretta said:\nWe are pleased to have signed an agreement with our longstanding partner, SHK.\nThe new business will further develop the omni-channel platform in South Korea and focus on enhancing the customer experience.\nTaking a direct participation in this important market for luxury goods marks a key milestone in our international development strategy.\nWe look forward to celebrating the new business with an exciting customer event in Seoul during September.\nThe news comes as Mulberry reported that its sales in the UK had fallen 1% on a like-for-like basis to £106.3m for the year to March 31. Group sales were up 1% to £169.7m, with international sales jumping 20% to £25.7m. Reported profit at the brand was down 8%, falling from £7.5m to £6.9m. Univerasl Design Studio - Mulberry, Manchester 9:09 Jonathon Manning Northern Bear to post strong results after acquisition\nNorth East building services firm Northern Bear has said it is on track to post strong revenue and operating profit figures for 2018.\nIn a trading update the firm said its figures will surpass last year’s results, even after the impact of transaction costs associated with its acquisition of interior fit out business H Peel.\nSteve Roberts, executive chairman of Northern Bear, said:\nAs a board, we are again delighted to be reporting another strong performance for the group in the year ended 31 March 2018.\nI am pleased to report that H Peel has made a positive contribution to results following its acquisition last year and is trading in line with our expectations. We continue to believe that H Peel will be a real asset to the group.\nOur revolving and overdraft bank facilities provide us with the resource to continue with our progressive dividend policy whilst having the financial wherewithal to look at similar acquisitions without the need to raise new equity. Northern Bear's headquarters in Prestwick Park, Newcastle 9:00 Jonathon Manning The Quarry pub in Whitley Bay to receive £230,000 renovation\nThe Quarry pub in Whitley Bay is receiving a £237,000 makeover that will overhaul the outside and inside of the pub.\nThe refurbishment work is being carried out by Star Pubs & Bars, Heineken’s pub business, and its licensees Carl and Sam Cramman.\nFull length windows will be installed in the pub to bring more light into the building. A catering kitchen is being fitted to allow fresh home-cooked food to be made, while the bar itself will be renovated.\nThe layout of the pub will also change to include a large, dog-friendly bar, a separate dining area, and a snug.\nThe Quarry will also be redecorated outside, including new signage, lighting and a paved terrace equipped with patio furniture.\nCommenting on the refurbishment, Mr Cramman said:\nI used to be a regular at The Quarry as a friend of mine played for the pub football team. Sam and I are really excited by the refurbishment and the prospect of breathing new life into the pub.\nThe area is crying out for a great quality local and regulars are relishing the fact that they’ll have one on their doorstep serving fresh food for the first time.\nThe Quarry has lots of potential and is in a brilliant location, two minutes from the seafront and opposite the Quarry wildlife park. We love Whitley Bay’s relaxed atmosphere as everyone is really friendly. We’re looking forward to playing a part in the community in the years ahead. (L-R) Carl and Sam Cramman outside The Quarry pub (Image: Unknown) 8:55 KEY EVENT Weatherspoon's scraps Champagne in favour of UK drinks before Brexit\nPub chain Weatherspoon’s is planning to scrap French Champagne and German wheat beers from its menu in favour of UK made drinks in the run up to Brexit.\nThe pubs will instead serve sparkling wines from the UK and Australia, along with British made wheat beers.\nThe change will come into force on July 9 and affect all of the chain’s 880 pubs.\nChairman Tim Martin, who is a strong supporter of Brexit, said:\nThis move helps us to broaden our horizons so that we create an improved offer for the two million customers who visit our pubs each week.\nIt is the start of a review all products in the next six to 24 months, with the object of making our business more competitive.\nThe EU’s customs union is a protectionist system which is widely misunderstood.\nIt imposes tariffs on the 93% of the world that is not in the EU, keeping prices high for UK consumers.\nTariffs are imposed on wine from Australia, New Zealand and the US, and also on coffee, oranges, rice and more than 12,000 other products.\nThere will be an inevitable transfer of trade post-Brexit to countries outside the EU, which will reduce prices in shops and pubs.\nThe products we are now introducing are at lower prices than the EU products they are replacing.\nWe intend to honour existing contracts with EU suppliers, some of which have several years to run.\nHowever, we are starting to make the transition to non-EU trade now. The Weatherspoons pub The High Main, on Shields Road in Byker 8:50 Popular Newcastle garden centre Cowells saved from becoming residential housing estate\nA much-loved garden centre has been saved from closure , safeguarding 50 jobs at the site.\nThe future of Cowell’s Garden Centre, at Woolsington on the edge of Newcastle, had been put in doubt with its lease on the site coming to an end and the landlord pursuing plans to sell it for a housing development.\nThe Woolsington garden centre was originally set up by Alan and Mavis Cowell in 1978, and a search for a new home for the business had been launched in 2012 by current companies co-directors: Alan and Mavis’ children, Martin Cowell and Jane Keating.\nBy 2017, however, the family were still struggling to find a new home for the business and the company brought in a team of advisors who suggested the business offer to buy the land from the landlord.\nThat offer has now been accepted and the company has been saved form closure.\nMartin Cowell said:\nWe are delighted to have been able to safeguard the future of the business and our employees’ livelihoods as we celebrate four great decades, and we look ahead to the next 40 years, and beyond.\nSecuring the site forms a key part of our strategic growth plan which will allow the business to thrive, as we further expand our range of plants and nursery products over the next three to five years, whilst creating new jobs. 8:45", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14777413;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-13T10:30:00.000+03:00", "crawled": "2018-06-13T18:00:57.003+03:00", "highlightTitle": ""}