{"organizations": [], "uuid": "0f71dd70e050a51834b14e8b3398330823671180", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14003523.ece/ALTERNATES/s1200/SGP_NEC_060617DEBATE04JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/operation-sanctuary-victims-need-support-14777082", "country": "GB", "domain_rank": 21960, "title": "Operation Sanctuary victims 'need support for decades to come', North East MP says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-13T07:00:00.000+03:00", "replies_count": 0, "uuid": "0f71dd70e050a51834b14e8b3398330823671180"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/operation-sanctuary-victims-need-support-14777082", "ord_in_thread": 0, "title": "Operation Sanctuary victims 'need support for decades to come', North East MP says", "locations": [], "entities": {"persons": [{"name": "chi onwurah", "sentiment": "negative"}, {"name": "onwurah", "sentiment": "none"}, {"name": "spicer", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "operation sanctuary", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Operation Sanctuary victims 'need support for decades to come', North East MP says Chi Onwurah has demanded funding to ensure survivors of sexual abuse in Newcastle get support in the long term Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNewcastle Central MP Chi Onwurah has insisted Operation Sanctuary victims “deserve not merely our sympathy, but our concrete, committed and long term support”.\nShe led a House of Commons debate calling for funding to support victims of sexual abuse in Newcastle.\nMs Onwurah praised the “bravery, strength and perseverance” of the victims.\nShe highlighted the Spicer review of Operation Sanctuary, which praised the “hub” set up in Newcastle to support victims and called for its work to continue.\nCalling on the Government to ensure long-term funding for the Hub, Ms Onwurah said: “Does the Minister expect that Newcastle City Council , with a budget that has already been decimated, should continue to shoulder the burden of funding the Hub?” Newcastle MP Chi Onwurah (Image: Newcastle Chronicle)\nShe asked Ministers to guarantee that support would still be available in ten years.\nOperation Sanctuary was a complex three year investigation into the sexual exploitation of vulnerable women and girls which culminated with 18 guilty verdicts last August.\nMs Onuwrah said: “I called this debate to help ensure victims of Operation Sanctuary have the support they need from all required agencies.\n“No convictions would have been secured if it wasn’t for the bravery of the victims and we owe it to them to provide the support they need, for as long as they need it.\n“The Government needs to show that it truly believes in supporting victims by properly responding to the Spicer review making funds available for the long-term support of Sanctuary victims.” Read More\nA total of 18 people were jailed for 180 years between them as a result of Operation Shelter, Northumbria Police’s investigation into a network of predators who targeted vulnerable women and girls.\nIt was part of a wider police operation called Operation Sanctuary.\nVictims were plied with drugs and alcohol and used for sex.\nA Serious Case Review has warned that girls and vulnerable adults in Newcastle were not given support, and were made to relive the appalling crimes committed against them.\nResponding on behalf of the Government, Victoria Atkins, the Minister for Women, said the Government welcomed the case review, because it showed the improvements that had to be made. Read More Brexit: Theresa May wins key vote after making concessions to remain MPs\n“I am very pleased to hear of the work that the Hub is doing and I understand the Police and Crime Commissioner has received £1.56m plus £116,000 for victims of child sexual abuse, and indeed the Ministry of justice is reviewing long term funding, not just for the hub but also for all local and national provision.\n“Because we do take the point that victims of these terrible crimes live with the consequences for many years and decades to follow.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-13T07:00:00.000+03:00", "crawled": "2018-06-13T07:37:53.013+03:00", "highlightTitle": ""}