{"organizations": [], "uuid": "6b8a488b2aa7511f74cd3ac385da90921a90d5d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14573476.ece/ALTERNATES/s1200/TSB-online-problems.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14747175", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: TSB to be investigated by financial regulator over IT migration", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-06T10:00:00.000+03:00", "replies_count": 0, "uuid": "6b8a488b2aa7511f74cd3ac385da90921a90d5d5"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14747175", "ord_in_thread": 0, "title": "Business Breakfast LIVE: TSB to be investigated by financial regulator over IT migration", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "negative"}, {"name": "wh smith", "sentiment": "none"}, {"name": "jonathon manning wh smith", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "easyjet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Mexican restaurant Lobo Rojo set to spice up North Shields Fish Quay\nA Mexican restaurant is set to spice up the Fish Quay in North Shields , bringing new life to a listed building that has stood empty for almost a year.\nLobo Rojo – which means red wolf – currently serves up a mix of Mexican treats every Saturday at the Flash House Brewery, where its quesadillas and taco trios are building up a faithful following.\nNow the firm, which only launched at the start of this year, is gearing up to open its own restaurant on the site of the former Irvins Brasserie in the Grade II-listed Irvin Building.\nThe owners hope to create between 15 and 20 jobs in the venture, which will hopefully open in the next month.\nBosses Robbie and John said:\nThis our first business venture and we’re aiming to be very hands on. With us being locals, we want to build a reliable team that interacts with our customers and makes the place feel like part of the community.\nWe think it’s a fantastic building and very much a gateway to the Fish Quay. We’ve always had our eye on the area anyway, we always saw potential in it. I think with some of the new businesses establishing themselves or setting up down there coupled with the amount of development taking place convinced us to take the chance when we did. It’s a landmark building and we feel very lucky to be able to bring our idea to that location. Lobo Rojo will soon open in North Shields (Image: Screengrab of Lobo Rojo website) 9:10 Facebook shared user data with Chinese firms\nFacebook has admitted sharing data about its users with several Chinese handset manufacturers.Chinese firms Huawei, Lenovo, Oppo and TCL were among numerous handset makers that were given access to Facebook data in a “controlled” way approved by the social media giant, its vice president of mobile partnerships, Francisco Varela, said in a statement on Tuesday.\nThe comments come after The New York Times published an article claiming Facebook had given tech device makers access to the information it holds about users’ friends without explicit consent. The information included work history, relationship status and likes on device users and their friends.\nFirms such as Huawei gave been banned by some US government agencies due to security concerns. Facebook told the newspaper it would end its data partnership with Huawei by the end of this week.Senator Mark Warner, the top Democrat on the Senate Intelligence Committee, said the news raised legitimate concerns and wanted to know how Facebook ensured data was not transferred to Chinese servers.\nA spokesman at Facebook said:\nGiven the interest from Congress, we wanted to make clear that all the information from these integrations with Huawei was stored on the device, not on Huawei’s servers. (Image: Edward Smith/PA Photos) Jonathon Manning Labour launches push for Brexit deal retaining single market benefots\nLabour will push for a “new single market” deal for the UK after Brexit as the Government faces crunch votes in the Commons next week.\nThe opposition has tabled amendments to the Brexit Bill, which calls for the UK to keep “full access” to the EU internal market but that stops short of calling for full single market membership.\nThe measures aim to deliver the same benefits as single market membership.Jeremy Corbyn said:\nWe are confident we can build a new relationship with the EU. We want the UK to have a better deal than the Norway model.\nIt is understood Labour MPs will abstain on the Lords EEA amendment but will be asked to back the party’s call for a “bespoke” deal which would see shared UK-EU institutions and regulations.Shadow Brexit secretary Sir Keir Starmer said:\nLabour will only accept a Brexit deal that delivers the benefits of the single market and protects jobs and living standards.\nUnlike the Tories, Labour will not sacrifice jobs and the economy in the pursuit of a reckless and extreme interpretation of the referendum result.\nExisting single market agreements that the EU has negotiated with third countries, including Norway, are bespoke deals negotiated with the EU to serve the best interests of those countries.\nWe need to learn from them and negotiate our own more ambitious agreement, which serves our economic interests and which prevents a hard border in Northern Ireland.\nTwo years on from the referendum it is clear that the Government has no plan for how it will protect jobs and the economy, and guarantee no hard border in Northern Ireland.\nLabour’s amendment, along with a commitment to negotiate a new comprehensive customs union with the EU, is a strong and balanced package that would retain the benefits of the single market.\nParliament should have the opportunity to debate and vote on it. Jeremy Corbyn (Image: Steve Bainbridge - 2017) 8:50 Jonathon Manning North East's tech sector aims to fix its problems with diversity\nTech companies from across the North East came together this morning to discuss how to tackle diversity and retention within the sector.\nThe Driving Diversity in Tech event was held at the Baltic Centre for Contemporary Art in Gateshead, and saw representatives from software giant Sage, Accenture and Durham’s Atom Bank shared their tips on how to encourage staff members to stay within their company and the sector as a whole.\nIn the past the tech sector has suffered from talented female workers leaving the sector due to the male culture often present in firms.\nDuring a panel discussion, HR experts from Sage, Accenture, Atom Bank and recruitment specialists Ions Talent talked about the benefits of introducing “family friendly policies” such as flexible working. These policies can allow team members to work at home to help manage their work life balance.\nOpening up the policies to all those with families also means that individuals do not feel awkward when requesting to work flexibly.\nJo McGovern, senior operations manager at Accenture, said:\nWhat we do is we live and breathe our family friendly policies. We have regular contact with all our people where they can talk about things such as when they work flexibly.\nThe key thing for me is to talk to your staff. By finding out what they want you can build on that retention.\nThe breakfast event was organised by the Tech Talent Charter, which works to drive diversity and address gender imbalance within technology roles. Major companies such as Microsoft, Dominos, and the BBC have all signed up to the charter. The Tech Talent Charter's panel. (L-R) Ions Talent CEO Mark Ions, Accenture senior operations manager Jo McGovern, atom Bank's head of people experience Anne-Marie Lister, and Sage's Diane Keller (Image: Staff) 8:45 Jonathon Manning Nearly 1,000 easyJet flights cancelled in May amid air traffic strikes\nLow-cost air carrier easyJet has revealed that it was forced to cancel nearly 1,000 strikes last month due to air traffic control strike action. An easyJet aeroplane (Image: PA) 8:40 Jonathon Manning WH Smith thanks rail and air passengers for sales boost amid high street slump\nA jump in passenger numbers bolstered third-quarter sales at WH Smith’s travel arm, helping offset a decline at its high street stores amid broader economic “uncertainty”.The retailer reported a 4% rise in group sales over the 13 weeks to June 2, while like-for-like sales grew 1%, compared with a year earlier.Those figures were supported by an 8% rise in its travel business - which accounts for shops based in the likes of railway stations and airports - where like-for-like sales grew 3%.\nThe company said:\nThis good performance reflects our continued investment in our UK and international businesses and growth in passenger numbers.\nIt helped make up for a 1% decline in both total and like-for-like sales across its high street business in the third quarter, which the retailer stressed was its “quietest trading period.”WH Smith also defended the division by noting that gross margins have continued to “improve”, cost savings have been delivered in line with its plans, and that it is continuing to trial new store formats.Chief executive Stephen Clarke said:\nWe have delivered a good sales performance in the third quarter in both our travel and high street businesses.\nWhilst there is some uncertainty in the broader economic environment, WH Smith serves millions of customers each week and continues to grow both internationally and in the UK.\nWe continue to focus on profitable growth, cash generation and investing in the business to position us well for the future. We remain confident in the outcome for the full year. WH Smith (Image: PA) KEY EVENT Durham firm develops bulletproof armour for kids to prevent school shootings\nA North East firm has raised more than £100,000 through crowdfunding to develop bulletproof armour for school children .\nThe GC Shield is a lightweight, flexible shield that can fit into a child’s schoolbag to protect them against gun fire and knife attacks.\nThe product is being developed by Graphene Composites - which is based on Sedgefield NETPark - using ultrastrong graphene, aerogel and other advanced materials.\nCEO Sandy Chen came up with the idea while he worked as a City banker and came into contact with a company developing graphene. He was then inspired to make a product suitable for children after hearing about a number of horrific school shootings that have taken place in America.\nMr Chen said:\nOur most recent idea is the GC Shield which is designed to protect school children. It’s sad but you watch a lot of the news about school shootings in the States and the only response that people have is to arm people.\nIt occurred to me when we were developing this armour that it is something that people could just have in their rucksacks. If anything did happen then the instinctive thing to do would be to grab your rucksack and run. The shield would be perfect to protect you when you run for cover.\nYou don’t want to put your children in an armour vest every time they go to school but actually you can just throw this in their rucksack and they can have some protection. The graphene/aerogel composite used to create the GC Shield (Image: Unknown) 8:30 KEY EVENT Illegal tattooist ordered to halt by courts\nAn illegal tattooist operating in Middlesbrough has been forced to stop trading to protect the public.\nTeesside magistrates court issued a court order preventing 30-year-old Tony Learmount from trading as a tattooist with immediate effect.\nMr Learmount came to the attention of the courts after Middlesbrough Council received complaints from members of the public about the tattooists hygiene standards when he was carrying out work at addresses in Rainsford Crescent and Park Lane.\nThe order forced Mr Learmount to stop practising as a tattoo artists and also required his equipment to be seized and destroyed.\nJudith Hedgley, Middlesbrough Council’s Head of Public Protection, said:\nWe work with our tattooist businesses to ensure compliance with safety standards because a lack of understanding of good hygiene practices and inadequate premises and equipment poses a serious risk to their clients.\nMany people assume the tattooists they are visiting are legal, registered and meet the expected standards.\nThe role of the Council is to ensure standards are met and, also protect the public by dealing with those tattooists who put people’s health at risk.\nTattooing involves puncturing the skin with a needle. With this comes the risk of serious, possible life threatening blood-borne infections, such as HIV and Hepatitis.\nAs well as the health risk, unregistered tattooists are also damaging the trade of legitimate tattooists who work hard to operate legally to the highest possible health and hygiene standards. Teesside Magistrates Court 8:25 Bid to out Elon Musk as Tesla chairman rejected by shareholders\nTesla CEO Elon Musk has staved off an attempt to overhaul the company’s board of directors and oust him as chairman.\nIt comes despite concerns raised over Tesla’s shaky finances and its inability to meet production goals for its first mass-market sudan.\nTesla operates a nine-member board, and all three directors seeking re-election will remain in their seats. The company said that Antonio Gracias, James Murdoch and Elon’s brother, Kimbal Musk, won by a wide margin.\nThe rebellion was led by activist firm CtW Investment Group, which represents labour union pension funds. The firm said that the three directors did not know about the car industry at a critical time.The company said a “supermajority” of shareholders also rejected a proposal to force Mr Musk to step down as Tesla’s chairman, a position he has held since 2004 - four years before he also assumed the CEO job.Elon Musk holds a 22% stake in Tesla, increasing the degree of difficulty for shareholders trying to challenge his authority. Elon Musk (Image: Brian Lawless/PA Wire) 8:20 North East firm headed by 28-year-old plans £70m stock market flotation\nA North East manufacturer that protects subsea cables and umbilicals has revealed it intends to float on the London Stock Exchange.\nTekmar, which is based in Newton Aycliffe and employs around 110 people, is attempting to list on AIM by the end of the month.\nThe company operates two main divisions. Its offshore wind farm division focuses on protecting transmission cables between offshore wind turbines, while its subsea division protects umbilicals and flexible pipes in the oil and gas market.\nThe flotation will allow Tekmar to expand its business, although the firm has yet to release any financial details regarding the listing.\nJames Ritchie, chief executive officer of Tekmar, said:\nWe are delighted to announce our intention to float. Our plans to join the AIM market follow a period of consistent, strong organic growth supported by the group’s current owners, Elysian Capital.\nTekmar is already the undisputed leader in offshore wind cable protection systems and it is our objective to become the partner of choice for the supply of subsea protection equipment to the global offshore energy markets. Admission to AIM will enhance our profile and brand recognition further in our sectors and allow us to execute our strategy to grow in both existing and new markets and geographies.\nThe North East firm has a 74% market share across all installed offshore wind farm assets. The group’s revenue for the year ending March 31 2018 was £21.9m, and an adjusted EBITDA of £4.9m.\nThe offshore wind farm division’s sales pipeline with a potential aggregate sales value of £68m.\nFollowing the flotation Tekmar said it will grow its business by increasing its market share in the subsea oil and gas market, as well as by making a number of “selective acquisitions”. It will also look to make new products to increase demand from customers. Offshore technicians assembling Tekmar’s patented TEKLINK cable protection system during offshore installation on an offshore wind farm (Image: Unknown) 8:15\nThe FTSE-100 index at 7:44am was unchanged at 7686.80.\nThe pound at 8am was 1.3403 dollars compared to 1.3358 dollars at the previous close.\nThe euro at 8am was 0.8744 pounds compared to 0.8741 pounds at the previous close. 08:10 KEY EVENT City watchdog to investigate TSB IT migration\nThe Financial Conduct Authority (FCA) is investigating TSB’s troubled IT migration, which left nearly two million customers unable to access their banks accounts.\nThe head of the FCA said in a letter to Treasury Committee chairwoman Nicky Morgan that the regulator would carry out a joint investigation with the Prudential Regulation Authority.Andrew Bailey, chief executive of the FCA, said:\nWe do not normally make this information public, but, given the level of public interest, I want to be clear that we will be conducting this work.\nMrs Morgan released correspondence with the watchdog in which Mr Bailey said TSB chief executive Paul Pester’s evidence to the committee in May was “an optimistic view” and “greater caution would have made sense”.\nMr Bailey said Dr Pester could have shared “more detail with the committee”, including the initial views of a team of experts from IBM who were drafted in to help solve the crisis.Up to 1.9 million people using TSB’s digital and mobile banking found themselves locked out of their bank accounts following the migration of data on customers from former owner Lloyds’ IT system to a new one managed by current owner Sabadell.Last month, Dr Pester told MPs on the Treasury Committee that he took “absolute responsibility” for the problems, but said the migration of billions of customer records was successful “to the penny” and the underlying engine of the bank was “working well”.He is due to appear in front of the committee again on Wednesday.In his May 30 letter responding to Mrs Morgan’s request for information, Mr Bailey wrote:\nThe FCA has been dissatisfied with TSB’s communications with its customers and we have had concerns that TSB was not being open and transparent about the issues experienced,” adding that the bank’s response “could reduce trust in TSB and in the banking sector as a whole.\nHe also said TSB had not met regulations to refund all relevant customers as soon as practicable or by the end of the business day after the day which it became aware of the fraud.Mrs Morgan said:\nThe regulator does not make such criticisms lightly. I am deeply concerned by TSB’s poor communications about the scale and nature of the problems it has faced, by its response to customer fraud and by the quality and accuracy of the oral and written evidence provided by Dr Pester to the committee.\nThe committee will discuss Mr Bailey’s letter, and the ongoing problems faced by TSB customers, when it sees Dr Pester and other TSB board members, as well as the FCA, on Wednesday. TSB chief executive Paul Pester who has apologised after IT problems left online customers unable to access their money and some able to see other people's accounts (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14747175;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-06T10:00:00.000+03:00", "crawled": "2018-06-06T10:54:50.015+03:00", "highlightTitle": ""}