{"organizations": [], "uuid": "3a0126570ea2a3c68a803ababc8362d1ca243b38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14772156.ece/ALTERNATES/s1200/SGP_NEC_110618MP01seqnJPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-minister-lord-callanan-nissan-14772127", "country": "GB", "domain_rank": 21960, "title": "Brexit minister Lord Callanan on Nissan and David Davis resignation rumours", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-11T21:32:00.000+03:00", "replies_count": 0, "uuid": "3a0126570ea2a3c68a803ababc8362d1ca243b38"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-minister-lord-callanan-nissan-14772127", "ord_in_thread": 0, "title": "Brexit minister Lord Callanan on Nissan and David Davis resignation rumours", "locations": [], "entities": {"persons": [{"name": "callanan", "sentiment": "negative"}, {"name": "david davis", "sentiment": "negative"}, {"name": "hundr", "sentiment": "none"}, {"name": "lord callanan", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "department", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Brexit minister Lord Callanan on Nissan and David Davis resignation rumours The Newcastle-born former MEP, who is now a minister at the Department for Exiting the European Union, discussed the Brexit talks Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBrexit minister Lord Callanan has insisted North East businesses will flourish outside the EU, but remained coy about reports his boss was poised to resign this weekend.\nSpeaking to ChronicleLive, he said car manufacturers like Nissan are set to prosper under the Brexit deal being negotiated by the Department for Exiting the European Union led by David Davis.\nHe said he remained optimistic the UK could secure a good deal for exporting regions despite the process being the most complex ever carried out by a British Government .\nThe precarious and high stakes context of those negotiations were no better demonstrated by an announcement minutes after his conversation with ChronicleLive, revealing that Jaguar Land Rover were moving UK jobs to the EU. Brexit 0 Seconds\nHundreds of British production roles will shift from Birmingham to Slovakia, weeks after the company cited Brexit as one of the factors impacting on their financial performance.\nSpeaking before the negative car industry news broke, he assured North East workers that Nissan’s Sunderland plant was a key priority for his department.\nHe said: “We’re working very closely with Nissan and they’re at the forefront of our minds.\n“We have one of the best and most successful car industries in the whole of the EU.\n“The Government is bearing [Nissan’s] concerns in mind and looking to put a deal in place that will guarantee them access to EU markets just as big continental manufacturers will have access to the UK’s market”. Lord Martin Callanan (Image: Newcastle Chronicle)\nHe refused to “get in to the details of confidential discussions” which led Nissan to commit their medium term future to the region despite concerns over the referendum but added the Government is in “regular dialogue” with the firm.\nLord Callanan, who represented the North East in the European Parliament between 1999 - 2014, was given a job in the Brexit department in October.\nPressed on whether he’d seen internal Government studies which assured him the North East would prosper outside the EU, he said he had but could not divulge details.\nLord Callanan said: “I can’t comment on private briefings and papers that are there but I’m confident the overall Brexit process will be a success.\n“It will be a difficult negotiation of course, and complex, but it will be a success for the North East.” Read More Nexus accused of hypocrisy after blocking anti-Brexit posters on the Metro\nThe Government have kept impact studies a closely guarded secret but a high profile leak in February revealed one assessment found the North East’s economy shrinking under every post-EU scenario.\nA Government spokesperson said at the time the study was “provisional” and did not represent the official position.\nBrexit secretary David Davis dominated the news over the weekend due to reports of a clash between him and Theresa May, with the Brexit secretary rumoured to be prepared to walk out of the cabinet. Brexit Secretary David Davis (Image: Getty Images Europe)\nLord Callanan refused to be drawn on the veracity of the reports, saying: “I’m not going to comment on all of this supposed insider gossip and leaks.\n“All I can say is I met with him many times last week, I’ll be meeting with him many times this week and he’s doing an excellent job negotiating on behalf of the country.\n“I’m sure he’s getting on with the job and ignoring the newspaper tittle tattle.”\nHe laughed off suggestions he was one of the cabal of ministers willing to follow Davis out the door, saying: “All I know is we are getting on with the job.” Read More North East businesses look to relocate to Europe as Brexit nears, report finds\nAssessing the progress of negotiations so far, Lord Callanan said: “It’s going well. Obviously this is the most difficult and complex negotiation any Government has ever embarked upon and we’re doing it in a very difficult political environment, given the numbers in Westminster.\n“But in December we agreed the first phase for citizens rights and the Brexit bill and we agreed in March the details of the implementation period to provide businesses certainty up to the end of 2020.\n“There’s been a lot of political froth and controversial issues but behind the scenes we’re quietly getting on with it and meeting our deadlines and we’ll continue to negotiate in good faith.\n“The withdrawal agreement is already three quarters completed in terms of a legal text and we’re confident of having it agreed by October when we’ll take it to Parliament to start the next phase of implementing the decision of the people of the North East and UK.”\nTheresa May faces two crunch days of votes on Tuesday and Wednesday on the EU Withdrawal Bill. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-11T21:32:00.000+03:00", "crawled": "2018-06-12T01:00:51.036+03:00", "highlightTitle": ""}