{"organizations": [], "uuid": "a3b1e0b21043b28b7497425beb5010b43d9d7190", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14753461.ece/ALTERNATES/s1200/JS153858760.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14812766", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: House of Fraser's D-Day arrives for rescue plan vote", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-22T10:10:00.000+03:00", "replies_count": 0, "uuid": "a3b1e0b21043b28b7497425beb5010b43d9d7190"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14812766", "ord_in_thread": 0, "title": "Business Breakfast LIVE: House of Fraser's D-Day arrives for rescue plan vote", "locations": [], "entities": {"persons": [{"name": "fraser", "sentiment": "negative"}, {"name": "moon", "sentiment": "none"}, {"name": "james moon", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "coreena ford young northumberland", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}, {"name": "aermoon", "sentiment": "none"}, {"name": "moonjet group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Young Northumberland entrepreneur raises $90m to take on global aircraft companies\nAN entrepreneur is set to reach new heights in the aviation world by raising $100m to launch a global aircraft-leasing venture .\nJames Moon is already making waves in the sector with his Moonjet Group firm, which sells second-hand aircraft, from helicopters to Boeing 767s, around the world.\nThe 24-year-old, who became one of the UK’s youngest pilots when he was 17, remarkets the unwanted aircraft and has an unrivalled list of contacts within the industry, including top players in airlines around the world.\nAnd after discovering that many airlines are seeking to hire aircraft, he is almost over the line in a $100m fundraising drive for his new firm AerMoon, an airliner aircraft-leasing business which is already in talks with 148 flight firms in 68 countries.\nTogether with 11 experienced engineers and technicians, Mr Moon is promoting the business as a challenger airliner lessor, and has raised $90m of a hoped-for $100m, which will be used to buy a Boeing 777 from a Middle Eastern firm, which will then be leased to an airline.\nHe said: “It’s exciting times. The plan then is to purchase several airliner aircraft that are currently on lease to several airlines and to then build our own aircraft lease portfolio. So far I have raised $90m and feel like we are getting closer and closer to the figure.” James Moon of Moonjet Group who has now launched a new venture called AerMoon (Image: Moonjet Group) 8.50 Coreena Ford Eurozone agrees deal to pave way for end to Greece's bailout\nEurozone nations have agreed on the final elements of a plan to get Greece out of its eight-year bailout programme and make its massive debt more manageable.\nThe finance ministers of the 19 nations took day-long talks into this morning and reached a surprisingly hard-fought compromise which had seemed within easy reach for the past few days.\nThe ministers needed to finalise a deal between Greece and its international creditors that would allow it to safely emerge from its third and final bailout program on August 20 and face the markets again.\n“Greek debt is sustainable going forward,” said eurogroup president Mario Centeno.\nFrench Finance minister Bruno Le Maire said going into the meeting that “we have to recognise that Greece has really made the job - they have fulfilled their commitments.”\nGreece has needed massive financial aid from eurozone nations and international creditors to survive financially for the past eight years. In return, it had to commit to stringent budget austerity programmes that hurt the finances of ordinary Greeks and caused a major rift between Athens and many euro nations. The Acropolis of Athens, Greece (Image: Getty Images) 8.45 Coreena Ford Games and raffles could soon be used to solve the UK's energy crisis\nGames, competitions and even raffles could soon be used by North East organisations to encourage drivers to help solve the UK’s energy crisis .\nNewcastle University, Northern Powergrid and Teesside’s EnAppSys have teamed up to investigate how gamification can be used to encourage the owners of electric vehicles to use vehicle-to-grid (V2G) technology.\nThe £400,000 Government-funded project will see the three organisations explore how virtual currencies, competitions and raffles can be used to make V2G technology more popular with the public.\nV2G tech allows electric cars to transfer energy from their cars back into the National Grid during peak times, when power stations often struggle to meet the country’s energy demands.\nCurrently, there are 150,000 electric vehicles on UK roads meaning that such technology could play a major part in increasing the electricity available to homes and businesses. An electric car charging (Image: HANDOUT) 8.38 Government reaction to Airbus' Brexit warning\nA Government spokeswoman said:\nWe have made significant progress towards agreeing a deep and special partnership with the EU to ensure trade remains as free and frictionless as possible, including in the aerospace sector, and we’re confident of getting a good deal that is mutually beneficial.\nGiven the good progress that we are continuing to make in the negotiations we do not expect a no-deal scenario to arise.\nThe Government is working closely with companies to understand their concerns ahead of leaving the EU and alongside industry will invest almost £4 billion by 2026 to ensure the UK remains a world leader in civil aerospace.\nHere are some facts and figures about the aerospace firm.\n- Airbus employs more than 14,000 people at 25 sites across the UK.\n- Factories in Broughton, Flintshire, and Filton, Gloucestershire, are responsible for assembling the wings and landing gear for the company’s commercial aircraft.\n- More than 1,000 wings are produced every year at Broughton.\n- The company also provides helicopter design, manufacturing, support, maintenance and training at sites in Aberdeen, Belfast, Hawarden and Oxford.\n- According to a 2017 report by Oxford Economics, Airbus’ global operations supported a £7.8 billion contribution to the UK economy in 2015. This was larger than the economy of Newcastle, and nearly a third bigger than the economy of Oxford.\n- The study also found that the number of jobs supported by Airbus in 2015 was 117,400 - meaning more than 100,000 people who did not work for the firm had jobs linked to it in some way.\n- According to its website, it spends £500 million a year in research and technology in the UK and has collaboration agreements with more than 20 universities across the country. easyJet's new Airbus A320neo (Image: Manchester Evening News) 8.30 Coreena Ford Digital Minister reveals talks are under way to tackle North East skills gap\nThe North East could soon be working with the Government to tackle the skills gap in the region’s tech sector, according to a Cabinet Minister.\nCulture Secretary Matt Hancock revealed that his department is in talks with the North East and Tees Valley Local Enterprise Partnerships (LEPs) to form a Digital Skills Partnership (DSP).\nThe North East could soon be working with the Government to tackle the skills gap in the region’s tech sector, according to a Cabinet Minister.\nCulture Secretary Matt Hancock revealed that his department is in talks with the North East and Tees Valley Local Enterprise Partnerships (LEPs) to form a Digital Skills Partnership (DSP).\nSo far DSPs have been piloted in Lancashire and the South West but Mr Hancock has revealed that one could soon be launched in the North East.\nSpeaking at the Dynamo 18 conference in Newcastle, Mr Hancock said: “One of the main reasons there is such growth across the country in tech is because the industry is sucking in talent and skills where ever it can find it.\n“The task here is to make sure we keep getting the brightest and best from around the world, and that we bring in the world’s best coding talent while doing much more to support our home grown talent.\n“With the Digital Skills Partnership the aim is to improve the digital skills capability right across the country.” Matt Hancock, Minister for Digital, Culture, Media and Sport, at Dynamo 18 (Image: Handout) 8.25 Coreena Ford Playtech given green light for takeover of Italian rival\nGambling software firm Playtech has been given the green light by Italy’s market authority to complete its 846 million euro (£741m) takeover of rival Snaitech.\nConsob, Italy’s financial markets watchdog, has cleared the way for Playtech to purchase the remaining 19% stake in the business it does not already own.\nIt follows an initial acquisition of around 70.6% of the company, first announced in April, and further market purchases of another 10.3%.\nPlaytech has said the takeover will establish a strong presence in Italy, which has been cast as Europe’s largest and growing gaming market with a relatively under-developed online sector.\nIt also hailed Snaitech’s leading market position in retail betting and its experienced management team, which is staying on board after the acquisition is complete. 8.20 KEY EVENT Airbus warns it could leave UK in event of 'no deal' Brexit\nA warning from aerospace firm Airbus that it could pull out of the UK with the loss of thousands of jobs in the event of a “no-deal” Brexit should serve as a “wake-up” call, politicians have said.\nThe company, which employs 14,000 people at 25 sites across the country, said it would “reconsider its investments in the UK, and its long-term footprint in the country” if Britain crashed out of the single market and customs union without a transition agreement.\nThe firm has published a Brexit “risk assessment” on its website, calling on the Government to extend the planned transition period due to run until December 2020 if a deal is agreed, saying it was too short for the business to reorganise its supply chain, which is understood to employ around 110,000 people in a host of firms around the UK.\nIf there was no extension it would “carefully monitor any new investments in the UK and refrain from extending the UK suppliers/partners base”, it said.\nThe news was greeted by anger from Labour MPs. Darren Jones, whose Bristol North West constituency contains Airbus’s Filton wing plant, attacked the Government for only listening to “hardline pro-Brexit MPs and not to the businesses that employ thousands of British workers, including Airbus”.\nFormer shadow chancellor Chris Leslie wrote: “And we’re all supposed to go along with this Government’s disastrous £Brexit strategy?! Constituents in manufacturing & service sectors who jobs are at risk will be unforgiving of any more MP fence-sitting ‘constructive ambiguity’.”\nChuka Umunna questioned: “What will it take for the establishments running Westminster to wake up!” while Conservative MP Stephen Crabb described the news as a “wake-up call”.\nThe former Secretary of State for Wales, who represents Preseli Pembrokeshire, said: “The enormous Airbus factory in North Wales is one of the jewels in the crown of UK manufacturing. This is a wake-up call. A pragmatic, sensible Brexit that protects trade & jobs is vital.” Airbus - which employs 14,000 people around the UK - has warned it could leave the UK 8.15 Coreena Ford North East HR&D community celebrates the best of the sector at CIPD Awards\nHundreds of people from the region’s HR&D community have turned out to celebrate the best of their profession.\nThe CIPD North East of England HR&D Awards, held in association with The Journal and associate sponsors Nigel Wright Recruitment, were held last night at the Marriott Hotel at Gosforth Park.\nWinners on the night included Bernicia, the Northumberland National Park Authority and Newcastle Building Society, with the top award - the HR&D Team of the Year - going to Formica Group.\nThe event featured eight main categories celebrating the best work in areas including learning and development, health and wellness, and diversity. Other winners included Sage UK, Coveris Rigid, the Newcastle upon Tyne Hospitals NHS Foundation Trust and Houghton International.\nThe full list of winners and a host of photos from the night can be found here . CIPD awards evening at the Gosforth Park Marriott (Image: Newcastle Chronicle) 8.10 KEY EVENT D-Day arrives for House of Fraser's rescue plan vote\nCreditors will vote today on plans put forward by House of Fraser to rescue the business by closing 31 of its stores - including two in the North East.\nThe 169-year-old chain announced earlier this month plans to close stores in Middlesbrough and Darlington as part of a major rescue deal that will see over half of its stores bring down shutters, impacting around 6,000 jobs.\nFrank Slevin, chairman of House of Fraser, said: “The retail industry is undergoing fundamental change and House of Fraser urgently needs to adapt to this fast-changing landscape in order to give it a future and allow it to thrive.\n“Our legacy store estate has created an unsustainable cost base, which without restructuring, presents an existential threat to the business.\nIf the rescue plan fails, administration is highly likely - and it is uncertain whether House of Fraser’s proposals will be accepted as many high street landlords are deeply unhappy about being the creditors who have to shoulder the burden of financial losses.\nLast week House of Fraser bowed to pressure from Newcastle United owner Mike Ashley and handed a business plan to the tycoon following legal action.\nThe Newcastle United owner, who owns an 11% stake in House of Fraser through Sports Direct , filed a court injunction earlier this year to demand a copy of the document, claiming he had been “frozen out”.\nMr Ashley, who holds stakes in a string of retailers including Debenhams, has long been linked with a takeover of House of Fraser - and the document is understood to hand him crucial information that could aide a dramatic swoop on the business. The rescue plan for House of Fraser goes to the vote today (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14812766;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-22T10:10:00.000+03:00", "crawled": "2018-06-22T11:48:06.002+03:00", "highlightTitle": ""}