{"organizations": [], "uuid": "3d39bec06cd0df9a4ee1770b23302c968f1f4222", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1642699.ece/ALTERNATES/s1200/highheels.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/your-workplace-dress-code-discriminate-1642640", "country": "GB", "title": "Does your workplace dress code discriminate?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-07T02:00:00.000+03:00", "replies_count": 0, "uuid": "3d39bec06cd0df9a4ee1770b23302c968f1f4222"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/your-workplace-dress-code-discriminate-1642640", "ord_in_thread": 0, "title": "Does your workplace dress code discriminate?", "locations": [], "entities": {"persons": [{"name": "browne jacobson", "sentiment": "none"}, {"name": "rachel billen", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [], "organizations": [{"name": "eu workers", "sentiment": "none"}, {"name": "government equalities office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsored Does your workplace dress code discriminate? Rachel Billen, associate at Browne Jacobson explains the rights and wrongs of high heels and manicures Share Employers beware of killer high heels in the workplace. Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA dress code can help an employer’s workforce to convey its corporate image or to comply with health and safety legislation, but getting it wrong can lead to complaints of discrimination under the Equality Act 2010. For example, an employer could be discriminating on grounds of sex if it requires, without sufficient justification, female staff to wear high heeled shoes, but places no footwear requirements on male staff. Read More What happens to EU Workers after Brexit?\nIn May, the Government Equalities Office issued new guidance: “Dress codes and sex discrimination – what you need to know”. It is intended to help employers who have implemented dress codes avoid inequality of treatment between employees, whether this is related to gender or other another protected characteristic. Rachel Billen, associate at Browne Jacobson\nIn brief, the guidance says:\nWhilst a dress code does not have to be identical between the genders, the standards imposed should be equivalent.\nEmployers should avoid requiring staff to wear gender specific clothing e.g. high heels, make-up or manicured nails.\nA dress code should not impose requirements of dress which make employees vulnerable to unwanted sexual attention and harassment.\nReasonable adjustments to the dress code should be made for disabled employees where its requirements place them at a substantial disadvantage.\nTransgender staff should be allowed to follow their employer’s dress code in a way which they feel is appropriate to their gender identity.\nEmployers should consider the health and safety implications of any particular requirement.\nEmployers should not set dress codes which prohibit religious symbols that do not interfere with an employee’s work.\nConsulting with staff and unions on a proposed code will help ensure that the code is acceptable to staff.\nHaving read the guidance, an employer might feel that simply asking staff to dress “appropriately” might avoid some of the minefields above, but the lack of guidance could result in misunderstandings and the loss of a consistent standard of dress. Read More Do you know what your employees are doing with your data?\nAs a result, employers must have clear reasons why a dress code needs to be implemented in the first place and how the requirements they are making relate directly to the positions the code applies to. The code should be implemented evenly and applied consistently. Read More How to manage the challenges of staff absence\nThe guidance does not provide all the answers for an employer looking to implement a lawful dress code. For example, whether a role is customer facing or not is hugely relevant to codes of dress. If in doubt, seek further specialist advice.\nRachel Billen is an associate at Browne Jacobson. To find our more contact her via email or by calling 01392 458737. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-07T02:00:00.000+03:00", "crawled": "2018-06-07T02:23:10.001+03:00", "highlightTitle": ""}