{"organizations": [], "uuid": "93ab44d4a21bc0e74f38595be56bc0c0fd4da95b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14483047.ece/ALTERNATES/s1200/Carillion-crisis.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14838740", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Carillion faces examination from financial watchdog over insider dealing", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-28T10:00:00.000+03:00", "replies_count": 0, "uuid": "93ab44d4a21bc0e74f38595be56bc0c0fd4da95b"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14838740", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Carillion faces examination from financial watchdog over insider dealing", "locations": [], "entities": {"persons": [{"name": "ghosn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "renault-nissan-mitsubishi alliance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Nissan is 'in the dark' around Brexit, CEO says\nNissan has revealed that it is “in the dark” over Brexit, according to comments made by the company’s CEO.\nspeaking to the BBC Carlos Ghosn said:\nSo far we have absolutely no clue how this is going to end up.\nMr Ghosn, who is chief executive of the Renault-Nissan-Mitsubishi alliance, said the uncertainty surrounding Brexit left him unable to make long-term decisions about Nissan’s UK operations.\nHis comments have once again sparked concerns over the future of the car manufacturer’s factory in Sunderland, which produces nearly one third of the cars made in the UK.\nHe said:\nWe don’t want to take any decisions in the dark. We don’t want to take any decisions we might regret in future.\nHe added:\nI don’t think any company can maintain its activity if it is not competitive. If competitiveness is not maintained, little by little you’re going to have a decline. It may take some time, but you’re going to have a decline.\nNissan has said it plans to build two new models in Sunderland, but future investment plans have been put on the back burner. However, Mr Ghosn did say that leaving the EU could turn out to be positive for the economy.\nThere is no reason to say Brexit is going to be bad. Maybe Brexit will be better than we think it’s going to be. 9:13 Jonathon Manning Union newsletter reveals concerns leading up to TSB IT meltdown\nTSB boss Paul Pester is facing pressure after details have emerged that the bank rushed preparations for a major IT migration which sparked a banking meltdown in April.\nThe Treasury Select Committee has released union newsletters containing staff concerns over the project dating back to September. THe committee has been scathing in TSB’s handling of the IT meltdown and has called for the chief executive to be sacked.\nThe TBU union - which is not recognised by the bank but represents around 4,000 staff - quoted bank branch workers as saying there was a “growing concern that we are running out of time” on training ahead of a planned migration of customer data from former owner Lloyds’ IT system to a new one managed by current owner Sabadell.\nIt also claimed some branch managers were rated “off-track” for failing to train staff in time for the original November deadline, which was usually delayed.\nThe union newsletter also noted rumours that the delays were caused due to the system not being functional, and that some of the coding was “not up to scratch”.\nIn a response to the union newsletters, a TSB spokeswoman said:\nAs we have said throughout, we would never have moved across to the new system if we didn’t believe we were ready.\nWe are of course undertaking a full investigation. TSB's online banking service is running at only 50% for customers (Image: Gareth Fuller/PA Wire) 9:08 Oil giant BP buys electric charging firm\nOil giant BP has bought Chargemaster, the UK’s largest electric vehicle charging firm.\nChargemaster, which is based in Luton, has more than 6,500 charging points across the UK.\nTufan Erginbilgic, chief executive of BP’s downstream division, said:\nBringing together the UK’s leading fuel retailer and its largest charging company, BP Chargemaster will deliver a truly differentiated offer for the country’s growing number of electric vehicle owners.\nAt BP we believe that fast and convenient charging is critical to support the successful adoption of electric vehicles.\nCombining BP’s and Chargemaster’s complementary expertise, experience and assets is an important step towards offering fast and ultra-fast charging at BP sites across the UK and to BP becoming the leading provider of energy to low carbon vehicles, on the road or at home. An electric vehicle is re-charging at a point (Image: Getty Images Europe) 9:03 Jonathon Manning Next set to close Gateshead store, putting 60 jobs in jeopardy\nRetail giant Next is believed to be planning to shut one of its North East stores, putting scores of jobs in jeopardy.\nIt is is understood that the fashion and home retailer has told the 60 staff at its store at Team Valley’s Retail World in Gateshead of its intention to bring down the shutters this September, with all staff being offered redundancy.\nA member of staff said:\nAll of the staff have been informed they can either take redundancy or they will try and match their contract at another local next store, however at the moment there aren’t the hours available in the region to accommodate all of the staff.\nI’m not in a union but I know some of my colleague are looking into it as they are currently full-time and Next are no longer offering full-time contracts in any store so they are going to lose out when the store closes.\nNext were said to be signing a deal to launch a new Costa in store in the autumn alongside a new store refit – however the plans have been pulled. They were only in last week doing the plans.\nThere’s really low morale in the store after we all found out and we’re all angry. Even the store management didn’t know until recently so they are devastated too.\nNext is one of 26 major retailers based at Retail World, which is owned by fund manager ARES and managed by property consultancy GVA. It has been based at the shopping estate for more than 15 years. A Next store (Image: PA) 8:55 Jonathon Manning Developers unveil £250m plan for Newcastle Quayside urban village\nDevelopers have unveiled grand plans to transform a derelict site on Newcastle into a £250m urban village of 1,500 homes, which could create more than 1,000 jobs.\nNorth Yorkshire developer Newby wants to take on the former Calders Site on Skinnerburn Road, overlooking the River Tyne, and create a network of apartment buildings as well as commercial and leisure properties.\nKnown as Quayside West, the development could deliver up to 575 permanent jobs in addition to more than 600 construction and supply chain jobs.\nA public consultation on the proposals will now start ahead of a planning application being submitted.\nThe former Calders site is a central plank of Newcastle City Council’s ambitious plans to redevelop the area between Central Station and the Quayside at Skinnerburn Road. Known as Forth Yards, the council published a Development Framework for the area in March 2015. The former Calders site was identified by the council for a new mixed-use development, to include housing, leisure and commercial opportunities.\nNewby director Nick Moody said:\nOur 10-year vision for Quayside West is ambitious, but ultimately deliverable. Working with award-winning local architects, FaulknerBrowns, we have created a development which will bring a stepchange for the city in the form of a brand-new, high-quality and vibrant urban community on this important but neglected site.\nThe Calders site has stood empty for almost 20 years, despite previous planning approvals for new housing.\nNewcastle City Council has had the vision to identify the Forth Yards area for major redevelopment and Quayside West will act as the catalyst. Although this would be a privately funded development, we have had positive discussions with the council regarding these proposals. How the development at West Quayside will look when it is completed (Image: Newby) 8:48 Jonathon Manning Stagecoach 'learns lessons' after £85.6m hit from failed East Coast line\nTransport giant Stagecoach has said it has learned “lessons” for future bids after confirming an £85.6m hit after being stripped of the East Coast Main Line franchise by the Government.The group, which ran the line as a joint venture with Virgin, said it was “disappointed” by the costs of the failed franchise.The East Coast Main Line - a vital route between London and Scotland - was taken back into public control by the Government on Sunday after Stagecoach and Virgin failed to achieve revenue targets.It is now being run by the Department for Transport’s (DfT) Operator of Last Resort, and branded as London North Eastern Railway (LNER).Details of the financial impact of losing the franchise came as Stagecoach reported a 4.1% fall in underlying pre-tax profits to £144.8m for the year to April 28.On a statutory basis, profits rose to £95.3m from £17.9m the previous year, when it was hit by £133m of one-off costs.Stagecoach chief executive Martin Griffiths said:\nI am disappointed to be reporting significant exceptional costs in respect of Virgin Trains East Coast but I am pleased that there is now clarity for both customers and shareholders.\nHe added:\nWe have examined our bid for and operation of the franchise closely and have also looked more broadly at our rail bid governance.\nWe involved external advisers in that, and we have made changes to our processes to strengthen our approach to bidding and contract management in UK rail. The lessons learnt have been reflected in our subsequent bids.\nStagecoach saw annual operating profits slump 12.6% to £24.9m at its rail division, while revenues tumbled 30.8% to £1.5bn.But like-for-like rail revenues lifted 3.6% over the year. Martin Griffiths (Image: Mirror/Stagecoach) KEY EVENT Vivienne Westwood fashion store closes doors in Newcastle\nUpmarket retailer Vivienne Westwood has closed its Newcastle store after 11 years as one of the city’s most exclusive fashion brands .\nWhen the doyenne of British design announced the opening of the Hood Street boutique in 2007, fashionistas were clamouring for her ranges, and retail sector observers saw it as a huge vote of confidence in the city.\nAt the time, the then Sunderland manager Roy Keane claimed footballers were steering clear of the North East because the shops weren’t good enough for their WAGs, and the arrival of Vivienne Westwood clearly refuted his claims.\nThe store has now closed its doors, however, making Yorkshire the nearest place to travel for one of the firm’s remaining seven standalone UK stores.\nA sign in the window now reads:\nUnfortunately Vivienne Westwood is sadly saying goodbye to Newcastle on Sunday 24th June. From 25th June your closest store will be Leeds.\nNewcastle property firm Bradley Hall is now marketing the unit, which has annual rent costs of £36,000. The Vivienne Westwood store in Newcastle has closed down (Image: Coreena Ford) 8:37 Jonathon Manning Vianet to continuing to grow smart machines division\nInternet-of-things company Vianet is set to tell investors that trading is in line with expectations, and that it is continuing to grow its smart machines division, at the company’s AGM later today.\nJames Dickson, chairman, will provide the following trading update at today’s meeting:\nBenefiting from solid momentum into the new financial year, the Group’s trading in the first two months is broadly in line with the Board’s expectations. The business is also making good strategic progress through our focus on strong growth opportunities in the Smart Machines division.\nThe Smart Machines division, where there is real emphasis on taking advantage of our leading position in coffee vending and contactless payment device connectivity, is building sales momentum which will fuel growth. The integration of Vendman is also progressing well and traction is increasing as we seek to overlay c 200,000 Vendman mobile connections with higher value Smart Machines connections and also cross sell from the portfolio to existing customers and vending operators internationally.\nIn the Smart Zones division trading is marginally behind last year so far due to installation phasing although there is encouraging progress with revenue growth in our managed compliance service.\nThe Board remains confident that Vianet’s long term strategy is the right one and that the Group is well positioned to deliver earnings growth and expand the future strategic options for Vianet. This is reflected in the Board’s decision to recommend maintaining the final dividend at 4p per share. James Dickson, chairman of Vianet (Image: Barry Pells / VisualMedia) 8:28 KEY EVENT Gateshead College, Ubisoft Reflections, O Communications and Muckle win Best Places to Work awards\nGateshead College, Ubisoft Reflections, O Communications and Muckle LLP were the big winners at the North East’s first celebration of the region’s Best Places to Work .\nThe college was ranked top place to work in the region and also took the prize for the best non-profit organisation in an initiative run by The Journal as part of our Invest in the North East campaign.\nNewcastle computer game company Ubisoft Reflections was named best large company while fellow city firms Muckle LLP and O Communications took the medium and small business prizes.\nThere were also prizes for Hoults Ltd, operators of the Hoults Yard business village in Newcastle’s east end, which took the prize for best perk for giving staff free driving lessons, discounts at on-site hairdresses, regular social events and even pole-dancing classes.\nNorthumberland chipboard manufacturer Egger UK won the prize for community involvement for a range of projects in Hexham, support for the Northumbria Blood Bikes charity and for providing an annual bursary to put a young person through university.\nThe best office award went to Newcastle’s NBS, which has turned the city’s old post office on St Nicholas Street into much-admired offices for its fast-growing global base.\nAnd the event was rounded off with Gateshead College principal Judith Doyle - described by Ofsted as a “dynamic and inspirational” leader - winning the prize for best boss.\nThe event, which was sponsored by Northern Gas & Power with support from Muckle LLP and Penshaw View Training, was held at the Biscuit Factory in Newcastle before a sell-out audience. Winners of Best Large Company sponsored by Muckle LLP - Ubisoft Reflections - Max Everingham, Julia Melvin, Emily Abbott and Craig Pearn with Jason Wainwright of Muckle LLP (Image: Newcastle Chronicle) 8:23 Jonathon Manning '12,000 jobs under threat' as report warns of 2,400 more bank closures\nBritain’s biggest five banks could be on track to axe up to 2,400 more branches, putting 12,000 jobs at risk, according to new research.\nThe report by banking and financial services analyst David Black, of DJB Research, and commissioned by the Nottingham Building Society, pointed to estimates suggesting that a network of just 600 branches could deliver “effective nationwide customer coverage”.\nMr Black said:\nLooking at the number of branches the top five banks have today, I estimate that, if this strategy was adopted, some 2,400 branches could still be closed.\nThe figure is around 25% of the branches at Lloyds, RBS, NatWest,Barclayse and HSBC.\nResearch from consumer group Which? shows that 670 branches have already been closed this year, with the figure for the whole of 2018 on track to eclipse last year’s figure of 879 closures.\nMr Black added:\nThere is little doubt that more bank and building society branches will close - this is inevitable as the way people manage their money is changing.\nHowever, the extent to which they are closing could be radically reduced if branches took on new services and approaches. A man using a cash machine (Image: John Stillwell/PA Wire) 8:17", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14838740;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-28T10:00:00.000+03:00", "crawled": "2018-06-29T11:51:36.010+03:00", "highlightTitle": ""}