{"organizations": [], "uuid": "3cbe524a929bc230982016da5df9fe7b30907d8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14822063.ece/ALTERNATES/s1200/NUFC-gossip.jpg", "site_section": "http://www.thejournal.co.uk/sport/?service=rss", "section_title": "ChronicleLive - Sport", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/sunday-gossip-newcastle-linked-four-14821749", "country": "GB", "domain_rank": 21960, "title": "Sunday gossip: Newcastle linked with FOUR players as swap deal mooted, Mitrovic 'adamant' on future", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-24T14:30:00.000+03:00", "replies_count": 0, "uuid": "3cbe524a929bc230982016da5df9fe7b30907d8d"}, "author": "Chris Waugh", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/sunday-gossip-newcastle-linked-four-14821749", "ord_in_thread": 0, "title": "Sunday gossip: Newcastle linked with FOUR players as swap deal mooted, Mitrovic 'adamant' on future", "locations": [], "entities": {"persons": [{"name": "mitrovic", "sentiment": "negative"}, {"name": "martin dubravka", "sentiment": "none"}, {"name": "roy hodgson", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}, {"name": "benitez", "sentiment": "none"}, {"name": "ruben loftus-cheek", "sentiment": "none"}], "locations": [{"name": "chelsea", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "slovakia", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle united fc", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "invalid email newcastle united", "sentiment": "none"}, {"name": "crystal palace", "sentiment": "none"}, {"name": "st james", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "magpies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Newcastle United FC updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNewcastle United return for pre-season training a week on Monday - and, as things stand, Rafa Benitez will be disappointed by the lack of new faces who will report to the first session.\nOnly Martin Dubravka has signed for the Magpies so far this summer, and the Slovakia international had already been at St James’ Park on loan with a pre-agreed option to buy which United subsequently activated.\nBut Benitez is working hard behind the scenes to try and lure players to Tyneside in the coming weeks - while agents are also attempting to drum up interest in their clients. Read More Aleksandar Mitrovic may want away - but Newcastle United still waiting to receive acceptable offer\nAs a result, there are always plenty of Newcastle-related transfer rumours, and this weekend has been no different.\nSaturday brought quotes from Crystal Palace manager Roy Hodgson that he expects Newcastle target Ruben Loftus-Cheek to stay at Chelsea for the 2018/19 campaign - but The Sunday Mirror claims the England midfielder is “expected to head out on loan” again. England's Ruben Loftus-Cheek (Image: PA)\nThe 22-year-old impressed during a season-long loan at Palace last term, and the Eagles want to lure Loftus-Cheek back to Selhurst Park this summer.\nHowever, they face stiff competition from Newcastle - with Benitez understood to be a long-term admirer - and Everton, who the report claims are “front of the queue” due to Chelsea believing a spell at Goodison Park would best aid Loftus-Cheek’s development.\nIn Belgium, meanwhile, Club Brugge winger Anthony Limbombe continues to be linked with a move to the Premier League. Read More Jose Enrique receives heartfelt message from cancer survivor Jonas Gutierrez after tumour diagnosis\nHLN claims Newcastle have joined Southampton and Huddersfield Town in the chase for the winger, with the Terriers reportedly having offered £13m for Limbombe already.\nSchalke and RB Leipzig are also named as potential destinations for Limbombe, but it is claimed that a move to the Premier League is most likely.\nAccording to reports in Italy, the Magpies remain keen on Juventus midfielder Stefano Sturaro - with the Serie A champions hopeful of “creating a Premier League auction” for the 25-year-old.\nTuttoMercatoWeb claims Newcastle have already offered €13million (£11.5m) for the midfielder - but West Ham United and Leicester City are also interested, so Juventus will try and recoup €20m (£17.5m) for Sturaro. Joshua King of Norway (Image: Getty Images Europe)\nElsewhere, The Sun carries one of the most bizarre transfer rumours of the summer so far, with the claim that Newcastle and AFC Bournemouth are “discussing” a potential swap deal.\nIt is suggested that the Magpies have made £20m-rated Josh King their primary striker target, but are unable to meet Bournemouth’s valuation.\nAs a result it is claimed that the Cherries have asked for their former winger Matt Ritchie in part-exchange, and that Newcastle are considering the proposal. Read More\nAt this stage this report should be treated with some healthy scepticism given that Ritchie is an integral member of Benitez’s first-team squad, but signing a striker is a priority for Newcastle this summer. Matt Ritchie of Newcastle United (Image: Newcastle United)\nMeanwhile, any Newcastle supporters who watched Belgium’s hammering of Tunisia on BBC on Saturday afternoon will have heard the commentary team claim that Hamdi Nagguez was a Magpies transfer target in January.\nThe Tunisia defender, who can play either centre-half or full-back, joined Egyptian outfit Zamalek during the mid-season window instead. Read More Newcastle's asking price for Chancel Mbemba revealed - with United still targeting permanent sale\nThere was no suggestion that the 25-year-old remains a Newcastle target, though Benitez is actively looking to bring in extra full-back cover this summer.\nIn terms of potential out-goings, El Desmarque reports that Benitez will not allow Florian Lejeune to leave this summer unless Sevilla make an offer which is simply too good to refuse.\nThe Spanish club are understood to have made the Frenchman their top centre-back target, but Newcastle do not want to sell Lejeune. Read More Brexit will affect how Premier League transfers work - and loan proposals could impact on Newcastle\nWhat’s more, The Mirror claims that Aleksandar Mitrovic is “adamant” a deal has already been agreed between Fulham and himself, and he is just waiting on the Cottagers to meet Newcastle’s £20million asking price.\nMitrovic scored for Serbia during his nation’s 2-1 defeat to Switzerland in Russia on Friday, and it is suggested his future will remain unresolved until the World Cup is over. Like us on Facebook", "external_links": ["http://eldesmarque.com/sevilla/sevilla-futbol-club/1105005-benitez-no-quiere-dejar-salir-a-lejeune", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://www.mirror.co.uk/sport/football/transfer-news/everton-boss-marco-silva-plots-12777388", "https://www.tuttomercatoweb.com/serie-a/tmw-newcastle-sturaro-le-cifre-di-offerta-e-richiesta-1125816"], "published": "2018-06-24T14:30:00.000+03:00", "crawled": "2018-06-24T14:52:36.002+03:00", "highlightTitle": ""}