{"organizations": [], "uuid": "1064b6cab5f328985c538f25d2055c692591fa2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14807407.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/four-north-east-men-charged-14807292", "country": "GB", "domain_rank": 21960, "title": "Four North East men charged in cockfighting investigation by police and RSCPA", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-20T16:09:00.000+03:00", "replies_count": 0, "uuid": "1064b6cab5f328985c538f25d2055c692591fa2d"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/four-north-east-men-charged-14807292", "ord_in_thread": 0, "title": "Four North East men charged in cockfighting investigation by police and RSCPA", "locations": [], "entities": {"persons": [], "locations": [{"name": "hambleton", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "north yorkshire", "sentiment": "none"}], "organizations": [{"name": "rspca", "sentiment": "none"}, {"name": "north yorkshire police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Four North East men charged in cockfighting investigation by police and RSCPA The four men, from Northumberland and Durham, have been charged in connection with alleged animal fighting Share Four men have been charged with cockfighting Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nFour men have been charged with cockfighting after a rural raid by police and the RSPCA.\nThe men, who come from Durham and Northumberland , were arrested at a countryside location in North Yorkshire in connection with alleged cockfighting.\nThe raid in Hambleton on January 13 was launched as part of an investigation by North Yorkshire Police and the RSPCA.\nThe four men have now been charged with offences under Section 8 of the Animal Welfare Act 2008.\nThe men, aged 53, 31, 29 and 23, have been charged with causing an animal fight to take place, keeping or training a cock for use in connection with an animal fight and for being present at an animal fight.\nThe 29-year-old man has also been charged with keeping premises for use for an animal fight, and being present at an animal fight on other occasions.\nAll four are due to appear at Northallerton Magistrates’ Court on July 10.\nDetectives have also released photographs of three other men they would like to speak to in connection with the investigation, as it is believed they may have important information. Read More Brexit vote showdown LIVE: Theresa May set to clash with rebels over 'meaningful say' on final deal\nRSPCA inspector Geoff Edmond said: “Four individuals have been charged with animal welfare offences, however the wider investigation is ongoing.”\nSergeant Kevin Kelly, from North Yorkshire Police’s rural taskforce, added: “If you recognise these men, please contact North Yorkshire Police, as they may have important information that could assist the investigation.\n“Please dial 101, select option 2 and ask for the Rural Taskforce, or email ruraltaskforce@northyorkshire.pnn.police.uk, quoting reference number 12180007024.\n“Alternatively, you can contact the independent charity Crimestoppers anonymously on 0800 555 111 or via their Anonymous Online Form at www.crimestoppers-uk.org .” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-20T16:09:00.000+03:00", "crawled": "2018-06-20T16:53:34.014+03:00", "highlightTitle": ""}