{"organizations": [], "uuid": "4aa2c999dbec01bab99e62bc9679cfb1b256295a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14776848.ece/ALTERNATES/s1200/Ministers-Attend-Cabinet-Meeting-at-Downing-Street.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-set-showdown-over-demands-14804917", "country": "GB", "domain_rank": 21960, "title": "Theresa May set for showdown over demands for a 'meaningful vote' on Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-20T10:00:00.000+03:00", "replies_count": 0, "uuid": "4aa2c999dbec01bab99e62bc9679cfb1b256295a"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-set-showdown-over-demands-14804917", "ord_in_thread": 0, "title": "Theresa May set for showdown over demands for a 'meaningful vote' on Brexit", "locations": [], "entities": {"persons": [{"name": "brexit theresa may", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "brexit tory", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "eu withdrawal bill", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May set for showdown over demands for a 'meaningful vote' on Brexit Tory rebels could defeat the Prime Minister over Brexit, but it's unclear whether they have the numbers Share Prime Minister Theresa May (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTheresa May faces a Brexit confrontation with rebel Conservative MPs , after delaying the battle last week.\nMPs are to vote once again on adding proposals to the EU Withdrawal Bill which would allow Parliament to dictate the course of action the Government must take, if it fails to agree a satisfactory deal with the EU.\nMrs May last week bought off rebels by promising that some of their proposals would be added to the Bill. But some Conservative MPs felt they had been misled, after the Government’s proposed changes were published and did not go as far as expected. Read More Jeremy Corbyn suffers rebellion as 74 Labour MPs vote to keep UK in single market\nHowever, it remains to be seen whether Tory rebels, led by former Attorney General Dominic Grieve, have the numbers to defeat the Government.\nLabour will officially support the rebel motion, but around nine pro-Brexit Labour MPs are likely to disobey orders from the party leadership and back the Government.\nIt means around 14 disgruntled Conservative backbenchers would need to vote against the Government to defeat it.\nMr Grieve’s comment on Sunday that rebels “could collapse the Government” may have discouraged some backbench colleagues from supporting him.\nHe has since denied that the Government will fall if it suffers a defeat in the Commons on its flagship Brexit bill.\nWhile the Government has promised that Parliament will have the chance to vote on the deal agreed with the EU, it has also warned that rejecting the deal would mean the UK quits without any agreement when Brexit takes place on March 29 2019.\nLabour and some Conservatives say this is not good enough and a “meaningful vote” has to include the option of rejecting the deal but also rejecting a no-deal Brexit.\nHow this would actually work in practice is unclear. Parliament is unlikely to hold a vote on the deal until October at the earliest, which means there would be little time to negotiate any changes before Brexit day.\nMr Grieve said on Tuesday that he still hoped it would be possible to come to a “sensible compromise” that would address the concerns of both sides.\nHowever, he dismissed suggestions that the rebels would bring down the Government if it was defeated.\n“That is complete nonsense. This is the end stage of the detailed consideration of a piece of legislation,” he told the BBC Radio 4 Today programme. Read More Damning report finds Universal Credit is an expensive failure causing misery for thousands\nMrs May on Monday warned against any moves to “tie her hands” during negotiations with Brussels, saying that Parliament must not be able to “overturn the will of the British people”.\nShe insisted she had been listening to the concerns of critics but said the legislation must not restrict her freedom in talks with Brussels.\nUnder Government plans, if MPs reject the agreement reached by Mrs May with Brussels, or if no deal has been obtained by January 21, Parliament will be offered the opportunity to vote on a “neutral motion” stating it has considered a minister’s statement on the issue.\nCrucially, the motion will be unamendable, meaning MPs cannot insert a requirement for Mrs May to go back to the negotiating table, extend the Brexit transition or revoke the UK’s withdrawal under Article 50.\nLeading backbencher Brexiteer Jacob Rees-Mogg said that the meaningful vote was being used to “obstruct Brexit” and “thwart the referendum result”. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-20T10:00:00.000+03:00", "crawled": "2018-06-20T11:56:22.021+03:00", "highlightTitle": ""}