{"organizations": [], "uuid": "0502148ec3b8b658187c26f2a03adca72fb4f93d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13446253.ece/ALTERNATES/s1200/CFR_NJL_080817nissan_01.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-been-left-in-dark-14839310", "country": "GB", "domain_rank": 21960, "title": "Nissan has been left 'in the dark' on Brexit and warns of slow decline", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-28T12:05:00.000+03:00", "replies_count": 0, "uuid": "0502148ec3b8b658187c26f2a03adca72fb4f93d"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-been-left-in-dark-14839310", "ord_in_thread": 0, "title": "Nissan has been left 'in the dark' on Brexit and warns of slow decline", "locations": [], "entities": {"persons": [{"name": "carlos", "sentiment": "negative"}, {"name": "ghosn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}, {"name": "david parry/pa wire", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "renault-nissan-mitsubishi alliance", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Nissan has been left 'in the dark' on Brexit and warns of slow decline Nissan's CEO Carlos Ghosn said he cannot make any future decisions about its UK operations because of Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nFresh concerns have been raised over the future of Sunderland’s Nissan factory after the company’s CEO said he is “in the dark” over Brexit.\nCarlos Ghosn, who is chief executive of the Renault-Nissan-Mitsubishi alliance, said that the uncertainty surrounding Brexit left him unable to make long-term decisions about Nissan’s UK operations.\nSpeaking to the BBC Mr Ghosn said: “So far we have absolutely no clue how this is going to end up.” Nissan chief executive Carlos Ghosn (Image: David Parry/PA Wire)\nHis comments have once again sparked concerns over the future of the car manufacturer’s factory in Sunderland, which produces nearly one third of the cars made in the UK.\nHe said: “We don’t want to take any decisions in the dark. We don’t want to take any decisions we might regret in future.”\nHe added: “I don’t think any company can maintain its activity if it is not competitive. If competitiveness is not maintained, little by little you’re going to have a decline. It may take some time, but you’re going to have a decline.”\nHis comments echoed similar ones made by Society of Motor Manufacturers and Traders chief executive Mike Hawes that the UK automotive sector could face “a death by a thousand cuts” as investment is cut back. Electric vehicles at Nissan's manufacturing plant at Sunderland (Image: nissan)\nThere has also been a warning from Japanese Ambassador Koji Tsuruoka that firms would likely leave the UK if bad Brexit deals left them unprofitable. The North East is home to a number of major Japanese manufacturers such as Nissan, Hitachi and Komatsu.\nNissan has said it plans to build two new models in Sunderland, but future investment plans appear to have been put on the back burner. However, Mr Ghosn did say that leaving the EU could turn out to be positive for the economy.\n“There is no reason to say Brexit is going to be bad. Maybe Brexit will be better than we think it’s going to be,” he said.\nNissan has already announced this year that it plans to make hundreds of its staff in Sunderland redundant following a move to introduce a new range of automotive parts into its facility. The company is introducing a new range of powertrains to the site, which will ultimately led to its plant volumes decreasing. Read More Japanese firms could leave the North East after Brexit, top ambassador warns\nThe Society of Motor Manufacturers and Traders (SMMT) released new figures this week showing that investment by automotive firms in new car models and facilities fell by nearly half during the first six months of 2018 - from £647.4m to just £347m.\nThe research could mean that the UK automotive sector is entering a decline due to Brexit, with reduced investment in facilities showing a lack of confidence in the UK as a hub for car manufacturing. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-28T12:05:00.000+03:00", "crawled": "2018-06-28T13:34:40.010+03:00", "highlightTitle": ""}