{"organizations": [], "uuid": "9a6b0bf1c33c793529a71d7d541f5a0732f498af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14637352.ece/ALTERNATES/s1200/SGP_NEC_060617DEBATE04JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/chi-onwurah-mp-explains-wont-14781111", "country": "GB", "domain_rank": 21960, "title": "Chi Onwurah MP explains why she won't back Labour Brexit rebels", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-13T19:00:00.000+03:00", "replies_count": 0, "uuid": "9a6b0bf1c33c793529a71d7d541f5a0732f498af"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/chi-onwurah-mp-explains-wont-14781111", "ord_in_thread": 0, "title": "Chi Onwurah MP explains why she won't back Labour Brexit rebels", "locations": [], "entities": {"persons": [{"name": "chi onwurah", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "newcastle central", "sentiment": "negative"}, {"name": "labour brexit", "sentiment": "negative"}, {"name": "eu withdrawal bill", "sentiment": "none"}, {"name": "invalid email newcastle central", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chi Onwurah MP explains why she won't back Labour Brexit rebels The Newcastle Central MP has set out why she doesn't support membership of the European Economic Area Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNewcastle Central MP Chi Onwurah has set out her Brexit position in detail ahead of a crunch vote.\nLabour peers have tabled an amendment to the EU Withdrawal Bill designed to keep UK membership of the European Economic Area.\nThe position is at odds with the party’s official stance, but is supported by some Labour MPs who favour a soft Brexit.\nHere, the Newcastle MP explains why she won’t be backing that amendment:\nOn Tuesday and Wednesday this week we are voting on the amendments to the Great Withdrawal Bill.\nFifteen amendments returned to us from the Lords, and then further amendments were made by colleagues in the Commons.\nThere has quite rightly been a huge amount of interest in my voting intentions and I am sorry that I have not been able to make them public as my time has been taken up listening to the arguments as well as preparing for my Adjournment Debate on Long Term Support for the Victims of Sexual Exploitation.\nSome of the social media comments have suggested it is a choice between country and party.\nI am a Labour Party MP and the vast majority of those who voted for me did so because I represent the Labour Party. Newcastle Central MP Chi Onwurah (Image: Newcastle Chronicle)\nI joined the Labour Party at the age of 16 because I support and hope to embody its enduring values of equality, solidarity and fairness.\nI believe a Labour Government is in the interest of the vast majority of my constituents.\nAnd I believe that is why they voted for me.\nThat said, I also believe my primary duty is to my constituents and my conscience.\nThere may be, and often are, difficult decisions where constituents themselves are divided or when it is a choice between competing bad options – but I am clear where my duty lies.\nThat is why I have always supported Labour’s position of a ‘jobs first’ Brexit – jobs are clearly in the interests of my constituency and as an exporting region, the European Market is of huge importance.\nI have been pleased to be a part of the way in which the Labour Party – under Keir Starmer’s reasoned and reasonable, pragmatic and inclusive approach – has led the debate from a jobs first Brexit to a transitional agreement to a Customs Union and now to continued access to a new Single Market - all whilst keeping the vast majority of Labour MPs united.\nAnd that is important. Labour’s great strength on Brexit is that we represent the full diversity of Britain’s Brexit vote. MPs during Prime Minister's Questions in the House of Commons, London (Image: PA)\nThere are many Labour MPs whose constituencies voted overwhelmingly to leave, many whose constituencies voted overwhelmingly to remain, and many, like myself, whose constituencies were divided right down the line.\nWe need to move forward as a party because that is to bring the country together, difficult as that may sound.\nThere are two existential threats to our country which I believe are more profound even than Brexit.\nThe first is to our existence as a democratic country whose Government is legitimate in the eyes of its citizens.\nThe second is to our existence as a nation with a commonly held sense of purpose.\nDecades of Thatcherite division and neo-liberal indifference to inequality, followed by extreme-right austerity has divided our country.\nBrexit was both a symptom of that and a cause of deepening division.\nThe country needs to come together around a Brexit which enables as far as possible the prosperity we so need everyone to benefit from.\nThe amendments which our Labour team negotiated in the Lords help to do that: such as on the environment, on a meaningful vote, and on working rights.\nThe amendment requiring membership of the European Economic Area does not. For the following reasons:\nIt is the Norway model and we are not Norway, we have ten-times more people, and an economy approximately seven times larger in which agriculture does not play as significant a part.\nNorway are not in the Customs Union.\nWe do not want to be rule takers but active participants in a Single Market that reflects both the value of immigration and the ways in which freedom of movement is current exploited by the unscrupulous, as I set out in my 2016 article and which my colleague Alison McGovern described today.\nFor these reasons I will not be supporting Amendment 51.\nAnd there is one other reason.\nIt has no chance of being agreed.\nAs we saw yesterday, Tory rebels are much fewer in the lobbies then they are on the front pages.\nI am all for symbolic gestures where they make a real difference to the lives of my constituents.\nThis is a symbolic gesture which by dividing the party and the country pushes the possibility of a long term constructive, unifying relationship with the EU further away.\nSince the referendum, the Conservative Party have done everything possible to further divide the nation.\nThey have acted as if the 48% who voted to remain should have no voice, and the 52% who voted to leave voted en block for a hard Brexit. I have watched with dismay the increasing division in the Brexit debate, the uncontained venom apparent on both sides.\nThose who call all Brexiteers racist, ‘Gammon’ isolationists and those who treat all Remainers as at traitors to the Union Jack would be well served to join me on Newcastle’s doorsteps this weekend.\nAs we voted 50.7% to 49.3% to remain, an hours door-knocking would provide a range of views and even the most rabid ideologue would learn that reasonableness, national interest, kindness or logic are not the preserve of any one ‘side’.\nThese last few days have demonstrated that there is a limit to our ability to manage Brexit in the national interest so long as we have a government that literally doesn’t know what it’s doing.\nWe to move to a close relationship with the European Union but we need to do so through thoughtful negotiations.\nThe paralysis and division of the Tories means the only option is to attempt to manage the process by Prime Ministerial edict – and there are limits to that approach.\nWe need a government that is unified around doing the right thing for Britain - not one that is fundamentally divided and unable to engage in productive dialogue with the EU about our mutual interests. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-13T19:00:00.000+03:00", "crawled": "2018-06-13T21:17:42.000+03:00", "highlightTitle": ""}