{"organizations": [], "uuid": "e9948c9dadaede552a3a06af1b54772c66b70bf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14746025.ece/ALTERNATES/s1200/Rail-timetable-changes.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/george-osborne-wants-strip-department-14745949", "country": "GB", "domain_rank": 21960, "title": "George Osborne wants to strip the Department for Transport of responsibility for North rail services", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-05T15:01:00.000+03:00", "replies_count": 0, "uuid": "e9948c9dadaede552a3a06af1b54772c66b70bf8"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/george-osborne-wants-strip-department-14745949", "ord_in_thread": 0, "title": "George Osborne wants to strip the Department for Transport of responsibility for North rail services", "locations": [], "entities": {"persons": [{"name": "george osborne", "sentiment": "neutral"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}], "locations": [{"name": "newcastle central sta", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "department for transport", "sentiment": "neutral"}, {"name": "northern rail", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News George Osborne wants to strip the Department for Transport of responsibility for North rail services Chaos on the Northern Rail franchise shows the region should oversee its own rail services, says former Chancellor Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Department for Transport should be stripped of responsibility for rail services in the North following “ongoing chaos” on the network, according to former Chancellor George Osborne .\nHe spoke out after Transport Secretary Chris Grayling faced repeated calls to resign during a Commons savaging over rail cancellations and delays.\nNorthern Rail services have been cancelled and delayed because of a lack of drivers, following the introduction of a new timetable.\nAnd Mr Osborne said they should be overseen by Transport for the North, the new transport authority led by council leaders and directly-elected mayors. Passengers and a Northern train at Newcastle Central Station (Image: PA)\nHe said on Twitter: “Ongoing chaos on northern railways makes case for devolving full power and responsibility to the new Transport for the North overwhelming.\n“It was always what we intended. Whitehall will resist but decisions about the north should be taken in the north.”\nIt would mean train operators were accountable to the Transport for the North board, which includes Newcastle City Council leader Nick Forbes.\nMisery for commuters continued on Tuesday, June 5, with Northern Rail listing 22 train cancellations.\nIn keeping with previous days, most cancelled services were in the North West. Some services to Leeds were also affected. Former Chancellor George Osborne (Image: PA)\nBut they included the 9.59am from Hexham to Nunthorpe, calling at Gateshead, Newcastle and Sunderland, which was cancelled due to a train breaking down.\nThere were changes to a further 42 services, including delayed trains and services that failed to stop at all the usual stations.\nEasington MP Grahame Morris has asked Mr Grayling for assurances that the problems won’t be repeated when further timetable changes are introduced in December.\nSpeaking in the House of Commons, he said: “Most of the trains serving mine only have two carriages to begin with, so they are already overcrowded even before any cancellations. It is clearly a failure of planning and co-ordination and a lack of integration.”\nThe Transport Secretary told him: “We are working extremely hard to make sure that this does not happen again. We have to deal with the short-term problem. We also have to make sure that this is not repeated with the December timetable change or future timetable changes.” Read More Northern Rail LIVE: Updates across northern England as pressure mounts on train firm\nGateshead MP Ian Mearns was one of a number of MPs calling on Mr Grayling to resign.\nHe said on Twitter: “Literally thousands of train cancellations and partial cancellations Thousands upon thousands of passengers stranded and left high and dry all over the North of England.\n“Face up to responsibility Failing Grayling really should just go!”\nLabour shadow transport secretary Andy McDonald has called on Mr Grayling to “do the right thing and step aside”, drawing cries from the Labour benches of “resign, resign”.\nMr Grayling expressed his frustrations over services, saying: “I feel for every single passenger who has waited for a cancelled train in the last week.\n“I get the train every day, I’m as fed up with this as everybody else. But the reality is this is the consequence of change that results from a massive investment programme in the railways.” Read More Give us a deal or you won't get your £40bn, pro-Brexit MP tells European Union\nMr Grayling said the benefits of the changes must be seen “pretty quickly”.\nHe announced that the Department for Transport would assess whether and Northern “met their contractual obligations in the planning and delivery of this timetable change”.\nThe Department would also look into Govia Thameslink Railway in the same way, he said, following cancellations on Thameslink trains in the south of England. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-05T15:01:00.000+03:00", "crawled": "2018-06-05T16:03:23.000+03:00", "highlightTitle": ""}