{"organizations": [], "uuid": "63fd2faf07c748860586dc09d3accc3dfade6b52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14776848.ece/ALTERNATES/s1200/Ministers-Attend-Cabinet-Meeting-at-Downing-Street.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-chaos-conservative-rebels-no-14790678", "country": "GB", "domain_rank": 21960, "title": "Brexit chaos: Why Conservative rebels no longer trust Theresa May", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-17T07:00:00.000+03:00", "replies_count": 0, "uuid": "63fd2faf07c748860586dc09d3accc3dfade6b52"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-chaos-conservative-rebels-no-14790678", "ord_in_thread": 0, "title": "Brexit chaos: Why Conservative rebels no longer trust Theresa May", "locations": [], "entities": {"persons": [{"name": "theresa may click", "sentiment": "negative"}, {"name": "dominic grieve", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThere were a number of important votes about Brexit in the House of Commons this week.\nBut now we’re due for another one - which may be even more significant.\nThe day of drama is Wednesday when MPs will once again consider the question of how much control they should have over the Brexit process if Theresa May and her Government fail to agree a deal with the EU.\nAnd this time there will be added tension because some Conservative backbenchers feel Mrs May has lied to them.\nA group of Conservative MPs, including former Attorney General Dominic Grieve, threatened to vote against the Government this week. Prime Minister Theresa May (Image: Getty Images Europe)\nBut they were persuaded not to by the Prime Minister, who promised that the Government would put forward its own compromise proposals which took their concerns into account.\nThey feel that she’s broken her promise.\nSo once again, they’re threatening to rebel. And they no longer feel able to trust Mrs May.\nThe arguments that threaten to tear the Conservative Party apart centre on the European Union (Withdrawal) Bill.\nThis is legislation that repeals the European Communities Act 1972, the law that took the UK into the organisations that later became the EU.\nIt’s a vital part of Brexit.\nThe House of Lords, where the Government does not have a majority, tabled a series of amendments to the Bill, including one that would have allowed Parliament to seize some control over negotiations between the EU and the UK.\nThat’s the last thing Mrs May wants. And Conservative MPs were urged to delete this amendment.\nOn Tuesday, however, Conservative whips began to fear that the Government was going to lose the vote. Read More Jeremy Corbyn suffers rebellion as 74 Labour MPs vote to keep UK in single market\nTory rebels were threatening to join forces with Labour and other opposition parties to support the Lords, and although the number of rebels was small they may have been enough to inflict defeat on the Government.\nAs a result, Mrs May promised that the Government would introduce its own proposals to give Parliament more control over the process, based on a compromise drawn up by Mr Grieve.\nIt worked. The rebel Conservative MPs (with the exception of two, Ken Clarke and Anna Soubry) backed down and voted to delete the Lords amendment.\nBut when the Government actually published its proposals on Thursday, it fell far short of what the rebel Tories expected.\nInstead of allowing MPs to “direct” the Government if it fails to agree a deal with the EU, the new amendment just promises a debate.\nConservative rebels feel betrayed. Mr Grieve described the Government’s proposal as “unacceptable.”\nThe Bill will go back to the House of Lords on Monday, June 18.\nThe Lords are likely to amend it again, and once again to insist that MPs should have the power to tell the Government what to do if Brexit talks fail. Read More Damning report finds Universal Credit is an expensive failure causing misery for thousands\nThen the Bill will go back to the Commons. And, once again, the Government is expected to urge MPs to delete the Lords amendment.\nBut this time, Mrs May will find it hard to convince unhappy Tory backbenchers to listen to her. They’ve had their fingers burnt once already. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-17T07:00:00.000+03:00", "crawled": "2018-06-17T08:38:16.034+03:00", "highlightTitle": ""}