{"organizations": [], "uuid": "66fdc5de2d7e2c68edda95de0c6698ef4657f40e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14776848.ece/ALTERNATES/s1200/Ministers-Attend-Cabinet-Meeting-at-Downing-Street.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-theresa-wins-key-vote-14776801", "country": "GB", "domain_rank": 21960, "title": "Brexit: Theresa May wins key vote after making concessions to remain MPs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-12T21:19:00.000+03:00", "replies_count": 0, "uuid": "66fdc5de2d7e2c68edda95de0c6698ef4657f40e"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-theresa-wins-key-vote-14776801", "ord_in_thread": 0, "title": "Brexit: Theresa May wins key vote after making concessions to remain MPs", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "bill", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "house of commons chamber", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Theresa May (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTheresa May managed to avoid defeat on a key Brexit vote by issuing a personal appeal to Conservative rebels.\nShe held a meeting with 14 backbenchers to plead for the support, while a debate on the European Union (Withdrawal) Bill was taking place in the House of Commons Chamber.\nThe Prime Minister was forced to offer a major concession in order to convince rebels to back the Government.\nBut her approach worked, and just two Conservatives voted against the Government when the vote was held - while five Labour MPs rebelled against their own party and voted to back the Government.\nThe vote was on proposals to give MPs a “meaningful vote” on the Brexit deal once it is agreed with the EU.\nMembers of the House of Lords had previously voted for legislation to force the Government to follow instructions from Parliament, if no deal could be agreed.\nThe Government was desperate to avoid this, and asked the House of Commons to delete the Lords amendment.\nBut it appeared on Tuesday that Labour, the other opposition parties and Conservative rebels were joining forces to inflict a humiliating defeat on Mrs May. EU and Union Flags fly outside Parliament (Image: AP Photo/Kirsty Wigglesworth)\nIn remarkable scenes as the debate got under way, solicitor general Robert Buckland began openly negotiating with Conservative rebels.\nSpeaking in the Chamber of the House of Commons, he said that the Government would introduce its own amendment giving Parliament more control over Brexit - if they voted against the House of Lords proposal.\nMrs May held talks with rebel Tory MPs outside the Chamber.\nOnce the vote was held, the Government was victorious. The Commons voted to delete the Lords “meaningful vote” amendment, by 324 to 298.\nBut it remains to be seen exactly what the rebels were promised in order to win their support.\nTwo Conservative MPs voted against the Government despite the compromise. They were Ken Clarke and Anna Soubry.\nFive Labour rebels voted with the Government. They were Blyth Valley Ronnie Campbell, Frank Field, Kate Hoey, John Mann and Graham Stringer.\nKelvin Hopkins, a Labour politician who has been suspended from the Parliamentary party and is currently an independent MP, also voted with the Government. Read More 83 North East MPs demand Northern is stripped of its rail franchise\nRemainer Conservative MP Stephen Hammond described how the Prime Minister won over potential rebels.\nHe told BBC Radio 4’s PM programme: “We have spoken in a room with the Prime Minister this afternoon, 10 minutes before the first round of voting.\n“I absolutely trust what the Prime Minister says to us.”\nShadow Brexit secretary Sir Keir Starmer said: “Facing the prospect of a humiliating defeat, Theresa May has been forced to enter negotiations with her backbenchers and offer a so-called concession.\n“We will wait and see the details of this concession and will hold ministers to account to ensure it lives up to the promises they have made to Parliament.”\nLiberal Democrat Brexit spokesman Tom Brake said: “At the 59th minute of the 11th hour, as has become a tradition in Brexit negotiations, the Tories have been forced to cobble together a compromise.\n“Time will tell as to whether this is just another attempt to buy off the rebels or a real attempt at consensus. But if we face the prospect of a ‘meaningless process’ rather than a ‘meaningful vote’, Parliament will be enraged.” Read More Twitter abuse forces Newcastle MP to take a break from social media\nThe Government could face trouble ahead.\nIt has promised to propose its own amendment ensuring MPs have a “meaningful vote” on Brexit, once the European Union (Withdrawal) Bill returns to the Lords.\nHowever, once the amendment is published, it’s possible that pro-remain Tories may be disappointed. Alternatively, if the Government’s proposal goes far enough to make remainers happy, there is a risk of sparking a rebellion from furious pro-Brexit Tories.\nAnd it’s also possible that the House of Lords could simply insist on once again adding its own amendment to the legislation, which goes further than the Government wants. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-12T21:19:00.000+03:00", "crawled": "2018-06-12T22:08:36.032+03:00", "highlightTitle": ""}