{"organizations": [], "uuid": "8184596285e5b13703cf2c6e642e54cfd85d47e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14746045.ece/ALTERNATES/s1200/SGP_NEC_170318LABOUR05JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labours-brexit-policy-progression-says-14751687", "country": "GB", "domain_rank": 21960, "title": "Labour's Brexit policy is a 'progression' says shadow business minister Chi Onwurah", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-06T18:09:00.000+03:00", "replies_count": 0, "uuid": "8184596285e5b13703cf2c6e642e54cfd85d47e9"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labours-brexit-policy-progression-says-14751687", "ord_in_thread": 0, "title": "Labour's Brexit policy is a 'progression' says shadow business minister Chi Onwurah", "locations": [], "entities": {"persons": [{"name": "chi onwurah labour", "sentiment": "negative"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "chi onwurah share chi onwurah", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "chi onwurah news labour", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "invalid email labour", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour's Brexit policy is a 'progression' says shadow business minister Chi Onwurah Labour led the way on the need for a transition deal and customs union - now it's leading on the single ,market, says Chi Onwurah Share Chi Onwurah (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLabour’s new policy on Brexit will protect jobs in the North East, shadow business minister Chi Onwurah says.\nMs Onwurah, Labour MP for Newcastle Central, said Labour’s proposals to retain “full access to the EU’s Single Market” were a “progression” of the party’s previous position.\nShe said the type of deal Labour wanted with the EU would have to include an agreement about immigration, but it would not mean support for unlimited freedom of movement.\nThe shadow minister spoke to the Chronicle after Labour tabled amendments to the Government’s Brexit legislation calling on ministers to negotiate “a new single market deal” giving full access to the EU’s Single Market, with shared UK-EU institutions and regulations.\nThere has been some confusion at Westminster about what the proposals mean. MPs will next week vote on proposals from the House of Lords for the UK to join the European Economic Area (EEA), effectively staying in the single market, but Labour is likely to abstain on this. The EU and Union flags (Image: PA)\nSome Labour backbenchers who are sceptical about Brexit are angry with the party leadership, because they believe the best hope of ensuring Brexit doesn’t destroy jobs is to join the EEA.\nHowever, Ms Onwurah said that joining the EEA - a position known as the Norway option, because Norway is currently an EEA member - would mean the UK had to obey rules made in Brussels rather than helping to make them.\nAnd she said it might also mean accepting freedom of movement as it exists today, which would be unacceptable to many of those who supported the winning side in the 2016 EU referendum.\nLabour’s new policy was “a progression of our approach to Brexit,” she said.\n“We were the first to recognise that a transition period was required, and we get the Tories to follow us. Newcastle Central MP Chi Onwurah (Image: Newcastle Chronicle)\n“We recognised continued membership of a customs union was required, and that’s what we’ll be voting on and hopefully winning the vote on next Tuesday.\n“And now we’re recognising that continued to a single market is required for our economy, and that this means shared institutions and regulations.\n“That is a position around which the Labour Party can unite. And it’s when we are united that we can hope to defeat the Government.”\nLabour could not accept the Norway model, she said. Read More Ivory ban could threaten future of traditional Northumbrian music, says MP\n“I am not convinced that it’s a model around which the country can unite for our long term sustainable relationship with the European Union.”\nSome critics of Labour’s policy say they do not believe the UK would be willing to give the UK a bespoke deal in which the UK helped to make the rules.\nBut Ms Onwurah pointed out that the EU already had arrangements with countries including Norway and Turkey.\nShe said some sort of agreement on immigration was likely to be part of any EU deal, but it would have to reflect “where the country is”, or UK public opinion in other words.\n“In terms of freedom of movement there is already discussion and debate around how to make freedom of movement compatible with where the country is and where the European Union is, and that’s something for negotiation.”\nShe added: “Businesses across the country but particularly in the North East, as the country’s only region with a positive balance of trade, say that staying in the customs union and having access to a single market will be conditions for a jobs-first Brexit.”\nPrime Minister Theresa May was grilled by Labour leader Jeremy Corbyn in the House of Commons over when the Government would publish a promised white paper setting out its plans for Brexit.\nThe white paper had been expected before a summit with European leaders later this month.\nBut officials said this week that Mrs May now planned to publish the 150-page white paper after a European Council meeting, on June 28 to 29.\nThe Prime Minister is said to be at loggerheads with Brexit Secretary David Davis, who is reportedly keen to push ahead with the publication of the document. Read More Transport Secretary promises Heathrow third runway will benefit regional airports\nAsked when the white paper would appear, the Prime Minister attempted to avoid the question.\nShe told Mr Corbyn: “The Brexit Secretary and I agree that we want to publish a White Paper that goes beyond the speeches and the papers that have been given and published so far, that does go into more details and that ensures that when we publish that White Paper we are able to negotiate with our European Union and European Commission colleagues on the basis that this an ambitious offer from the United Kingdom for an ambitious trade deal and security partnership in the future.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-06T18:09:00.000+03:00", "crawled": "2018-06-06T19:44:35.003+03:00", "highlightTitle": ""}