{"organizations": [], "uuid": "9d819316a0520b1bf81406022494924fd12bf39e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14063171.ece/ALTERNATES/s1200/PNP_NEC_271115night_011JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14799448", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Debenhams share price tumbles after announcing more cuts to come", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-19T10:30:00.000+03:00", "replies_count": 0, "uuid": "9d819316a0520b1bf81406022494924fd12bf39e"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14799448", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Debenhams share price tumbles after announcing more cuts to come", "locations": [], "entities": {"persons": [{"name": "mccarth", "sentiment": "negative"}, {"name": "fenton", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "stone", "sentiment": "none"}, {"name": "clive fenton", "sentiment": "none"}], "locations": [{"name": "south east", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "debenhams", "sentiment": "negative"}, {"name": "coreena ford retirement housebuilder mccarthy & stone", "sentiment": "negative"}, {"name": "coreena ford new metro", "sentiment": "none"}, {"name": "mccarthy & stone", "sentiment": "none"}, {"name": "wear metro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Retirement housebuilder McCarthy & Stone's CEO to leave\nRetirement housebuilder McCarthy & Stone said chief executive Clive Fenton is leaving as it warned over full-year earnings. The group said a fall in reservation rates amid economic uncertainty caused by Brexit was set to see full-year operating profit fall to between £65 million and £80 million. This compares with earnings of £96 million the previous year.\nMcCarthy & Stone said Mr Fenton will leave on August 31 and confirmed it had launched the search for his successor. Shares in the group tumbled 16%.\nThere has been a noticeable decline in reservation rates as potential customers have exercised more caution due to ongoing economic uncertainty, a slower secondary market and a softening of pricing, particularly in the South East. 9.15 Coreena Ford New Metro project brings global train manufacturers to the North East\nThe race to find the firm who will build the next generation of Tyne and Wear Metro trains has brought global train manufacturers to the region .\nTrain providers from around the world arrived on Tyneside for a market industry event, held to outline the public body’s £362m project to deliver a new fleet of carriages.\nManufacturers are being invited to register their interest in building fleet of carriages to serve passengers across Tyne and Wear and replace the outdated trains currently in operation.\nThe successful bidder won’t be named until the end of next year, but Nexus will start to whittle down the contenders at the event, being held at The Sage Gateshead, through the launch of a formal questionnaire.\nFormal tender documents are to be released at the end of the summer, culminating in detailed negotiations taking place before a winner is chosen.\nNexus managing director Tobyn Hughes said: “Metro is an iconic brand in North East England and that has ensured global interest in our exciting plans to buy a new fleet and build a new depot.\n“Today we have hosted train builders from around the world who are all interested in winning this contract. This was our chance to speak directly to potential bidders, and a chance for them to find out more about what we want.\n“We want our new fleet to transform the customer experience on Metro. We are looking for a long-term partner we will work with to provide an excellent Metro for decades to come.” A mock up of a potential Metro design - the final look will depend on the manufacturer (Image: Nexus ) 9.05 Coreena Ford Consumers worried for future of high streets\nAlmost two out of three people are worried about the future of their local high street following a spate of shop closures, a study has found.\nA survey of more than 2,000 adults by online savings firm Groupon showed that two out of five have noticed local businesses closing since the Brexit vote. Half of those questioned wanted to shop locally because they liked having stores close to home. Jon Wilson, managing director of Groupon UK, said: “In light of the potential post-Brexit economic shift, it’s heartening to know that British shoppers have a firm desire to support local businesses.”\nGroupon said a separate poll of 1,000 small businesses revealed that an “alarming” number were not exploring how to capitalise on shoppers’ support, with over two out of five admitting they had no strategy to attract new customers.\nThe survey comes as Marks & Spencer confirmed two North East stores will be among the first to shut their doors as part of a national closure programme with the shutters coming down in less than two months.\nM&S announced earlier this year it was accelerating a transformation programme that will lead to 100 shop closures, with proposals to shut stores in Stockton and Darlington. Both will close in August , following on from the Durham closure earlier this year. The Marks and Spencer store in the centre of Durham City which has now closed (Image: Newcastle Chronicle) 9.00 Coreena Ford Hyena Comedy Club could be turned into Newcastle's newest hotel\nA new hotel is set to be created within the former home of the Hyena Comedy Club amid plans to revive the building.\nThe city’s oldest comedy club closed its doors within the Grade II-listed Leazes Arcade three years ago and was soon snapped up after being put up for sale.\nThe current owner turned the ground floor of the historic building into a restaurant but has now applied for permission to change its use, paving the way for the creation of a 10-bedroom hotel which would also create around eight new jobs.\nChartered architect Simon Timperley, based in Hexham, Northumberland, has submitted documents in support of the conversion to Newcastle City Council, detailing how Leazes Arcade was originally built as a synagogue in 1880.\nThe property was converted to an arcade of shops and a basement bar in 1984 but was ravaged by fire in 1989, leaving just the external walls of the original structure standing, though partially collapsed.\nAs part of the plans, the seating area of the Hyena will be subdivided into 10 ensuite bedrooms which will be accessed through the adjoining Soho Bar, which will act as the entrance and reception to the hotel accommodation. Former Hyena Comedy Club Coreena Ford Water companies 'badly let down' customers following Beast from the East\nMany customers, including thousands of homes and businesses who were left without running water, were “badly let down” by their water company when the Beast from the East hit the UK, according to the water regulator Ofwat.\nIts review of how water companies dealt with the Polar blast which hit the UK in February and March - called Out in the Cold - found that over 200,000 customers in England and Wales were left without water for more than four hours and over 60,000 customers did not have a water supply for more than 12 hours. Some people were without water for a week.\nOfwat has now given four water companies, Thames Water, Severn Trent, Southern Water and South East Water, three months to provide a detailed, externally audited, action plan setting out how they are tackling the concerns raised.\nIt has vowed to take further action against any water company which does not show it will be ready to perform well in the future.\nNorthumbrian Water, United Utilities, Wessex Water and Yorkshire Water were named among the better performing companies. Water running from a household tap (Image: Rui Vieira/PA Wire) 8.50 Coreena Ford Good retailer news....Bonmarche posts a profit surge\nValue womenswear retailer Bonmarche has chalked up a surge in annual profits after boosting online sales and cutting costs to weather tough high street trading.\nThe group reported a 38.1% rise in bottom line pre-tax profits to £8m for the year to March 31, while profits were 27% higher on an underlying basis. It thanked a 34.5% jump in online sales for helping offset “disappointing” high street sales, with like-for-like store sales down 4.5%.\nThe group said trading since the year-end had also been stronger so far.\nThe chain saw shares plunge at the start of the year after revealing a collapse in Christmas trading. But in its annual results, it blamed “external factors” for a particularly poor high street performance in October, December and March, with the Beast from the East thought to have impacted its final quarter in particular.\nHelen Connolly, chief executive of Bonmarche, said: “We have made good progress in all areas, particularly online, where we have seen strong growth whilst also making improvements through a number of other self-help initiatives including the product proposition, the loyalty scheme and developing a more agile supply base.\n“Whilst we expect the market to remain difficult, trading since the beginning of the new financial year has been stronger than during the second half of full-year 2017-18.”\nBonmarche - which was founded in 1982 - has been revamping its online offering after poor website sales in 2016-17, making it more customer-friendly and improving its marketing tactics. The group also overhauled its supplier base over the past year and cut costs where possible to counter difficult retail conditions and a hit from the weak pound, which pushed up buying costs. A Bonmarche store Coreena Ford More than 18 million people visit Newcastle and Gateshead as tourism numbers increase\nMore than 18m people visited Newcastle and Gateshead last year, highlighting the importance of the tourism industry in the run-up to the Great Exhibition of the North.\nThe 2017 visitor numbers - a 3% rise on the year before - mean tourism continues to be the fourth largest business sector in the North East, contributing £1.62bn to the regional economy.\nOvernight visitors stayed for a total of 5.19m nights and more than 15,000 were directly employed in tourism, rising to almost 20,000 in the supply chain.\nSarah Stewart, chief executive at the NewcastleGateshead Initiative, said: “On the eve of the biggest event in England in 2018 opening in NewcastleGateshead, it’s great news that the number of visitors to the region has continued to increase, as the variety of what the destination has to offer also grows.\n“We saw a number of exciting new venues open in 2017, including cocktail bar and restaurant The Laundrette, French restaurant Côte Brasserie and the Travelodge on Newcastle’s Quayside, thanks in part to the increase in visitors to the region.\n“Our major events, attractions and experiences, alongside our growing and evolving food and drink offering, ensure that NewcastleGateshead is an attractive visitor destination.” 8.35 Coreena Ford Footasylum issues profit alert amid investment\nShoe retailer Footasylum has warned over a more “modest” growth in earnings amid plans to invest in its stores and online offering. Shares plunged 39% after the profit alert.\nThe warning came as Footasylum reported a 4% rise in underlying pre-tax profits to £8.4 million for the year to February 24. Statutory pre-tax profits fell to £1.9m from £8.1m the previous year.\nClare Nesbitt, chief executive of Footasylum, said: “While our core target market of the 16 to 24-year-old consumer has proved to be comparatively resilient in a downturn, our trading since the beginning of the new financial year has undoubtedly been impacted by the widely-documented weak consumer sentiment on the high street.\n“Despite this, we are confident that continued investment in digital and in our stores will allow the company to deliver strong revenue growth for the full year in line with market expectations.\n“This includes increased investment in our consumer offering ahead of our usual peak trading period in the second half and delivering additional store upsizes alongside new store openings.\n“However, this will have an associated increase in both expected capital expenditure and property costs for the current year and, as a result, we now anticipate that, adjusted EBITDA (underlying earnings) for full-year 2018-19 is likely to show more modest growth than in full-year 2017-18.”\nThe firm’s investment plans include the forthcoming move into a larger unit within the intu Metrocentre, close to its existing store. Footasylum shares have fallen after issuing a profit alert 8.30 KEY EVENT Debenhams shares fall following latest cuts announcement\nDebenhams shares tumbled more than 16% in early trading today, after announcing it is to drive through further cost cuts.\nThe cuts news follows a fresh profit warning on the back of market weakness and competitor discounting.\nThe department store company - which has stores in Newcastle, the Metrocentre, South Shields, Stockton, Middlesbrough and Sunderland - said trading was “below plan” in May and early June, despite weak comparatives, forcing it to “reassess” expectations for the remainder of the year.\nFull year pre-tax profits are expected to come in between £35m and £40m, down from estimates of £50.3m.\nThe firm said this means more cuts are to come, which will be focused on “self-help and prioritising cash generation”.\nThe company added: “We also intend to conduct a strategic review of non-core assets, aiming to focus investment behind our strategy.”\nThe company stopped short of announcing store closures, but, as previously announced, it is still assessing whether to shutter 10 of its outlets over the next five years, a spokesman said.\nThe footprint of up to 30 of its stores may also be reduced, while the leases of 25 locations may be renegotiated as they come up for renewal over the next five years. The spokesman said no job cuts are currently planned.\nChief executive Sergio Bucher said: “It is well-documented that these are exceptionally difficult times in UK retail and our trading performance in this quarter reflects that. “We don’t see these conditions changing in the near future and, because it is our priority to maintain a robust balance sheet, we are making very careful choices about how we deploy capital.” Debenhams in Newcastle (Image: Newcastle Chronicle) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14799448;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-19T10:30:00.000+03:00", "crawled": "2018-06-19T14:34:33.012+03:00", "highlightTitle": ""}