{"organizations": [], "uuid": "7071941c4271e8350f52b922be3689000a0119af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14741365.ece/ALTERNATES/s1200/Offshore-technicians-assembling-Tekmars-patented-TEKLINK-cable-protection-system-during-offshore-in.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-call-action-14805304", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Tekmar launches on London Stock Exchange with market cap of £65m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-20T10:15:00.000+03:00", "replies_count": 0, "uuid": "7071941c4271e8350f52b922be3689000a0119af"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-call-action-14805304", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Tekmar launches on London Stock Exchange with market cap of £65m", "locations": [], "entities": {"persons": [{"name": "semore kurdi", "sentiment": "none"}, {"name": "kurdi", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle fal", "sentiment": "negative"}, {"name": "coreena ford newcastle falcons", "sentiment": "negative"}, {"name": "london stock exchange", "sentiment": "negative"}, {"name": "newcastle rugby ltd", "sentiment": "none"}, {"name": "newcastle thunder", "sentiment": "none"}, {"name": "aviva premiership", "sentiment": "none"}, {"name": "newcastle falcons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Newcastle Falcons optimistic for future despite reporting widening losses\nNewcastle Falcons directors remain optimistic for the rugby club’s future despite seeing its operating loss widen by more than £700,000 .\nThe club has also just enjoyed its most successful period on the pitch for 20 years, finishing fourth in the English Premiership and qualifying for the European Champions Cup.\nNow accounts have been filed for Newcastle Rugby Ltd, which include figures for both the Aviva Premiership team Newcastle Falcons and Newcastle Thunder rugby league club, show how operating losses grew to £2.8m in the year ended June 30 and group’s net liability position at the year end grew by almost £3m to £18.5m.\nBut the directors – including major shareholder Semore Kurdi – highlighted continuing investments at the club and growing revenue streams throughout the year, which triggered a turnover leap of 6.1% to £9.66m.\nThey also said the loss for the year was “satisfactory” considering trading conditions.\nIn a report accompanying the accounts Mr Kurdi said: “Investment in the group’s infrastructure, playing/coaching staff and academy/youth programmes has continued ,which is critical to the continues progression of the club.\n“The group has seen growing match day attendances which is anticipated to continue as a result of strong relations with supporters, sponsors, the local community and an exciting match day experience.\n“The directors consider the loss for the year to be satisfactory in light of current conditions and are optimistic about the long term prospects for continued growth both on and off the pitch.” Newcastle Falcons celebrate a try in the final moments of the Aviva Premiership match between Newcastle Falcons and Sale Sharks at Kingston Park (Image: Getty Images Europe) 9.03 Coreena Ford Historic coach house in Newcastle destined to be turned into luxury homes\nA North East company which specialises in developing historic buildings has joined forces with the owners of a prestigious property to create a new housing scheme.\nThe Coach House, on The Drive in Gosforth, is poised to be transformed into luxury homes by FiftyTwo Group, which has teamed up with the property’s owners McDougall Dodds.\nSubject to planning approval, the joint venture will retain all of the historic features of the building, which has been owned by family-run McDougall Dodds since the 1970s.\nIt is now working with FiftyTwo Group, which was set up by North East entrepreneurs Fergus Bell and Daniel Gibson and which attracted international interest in its conversion of the former Durham County Club. General view of The Coach House, 62 The Drive in Gosforth (Image: David Wood) 8.50 Coreena Ford HSS agrees refinancing deal with banks\nEmbattled tool hire firm HSS has secured a refinancing deal with its banks as it ploughs ahead with a turnaround plan.\nThe group, which recently revealed it sunk deeper into the red with annual losses of more than £85m, said it had refinanced its £245m of debt. Paul Quested, chief financial officer at HSS, said: “We are very pleased to have successfully secured the long-term refinancing of the group.\n“This now ensures that we have the appropriate facilities in place to continue delivering on our strategic priorities and the group’s full potential.”\nThere had been concerns over its ability to secure a deal with its banks for the refinancing, given its trading woes, which have led to a series of profit warnings since floating in 2015.\nThe management has since embarked on an overhaul, slashing costs and axing branches to save around £13m a year.\nIt has also been leading a transformation programme to integrate a new national distribution and engineering centre.\nHSS saw its losses surge to £85.2m in 2017, compared with a £17.4m loss in 2016. In April’s full-year results, it admitted 2017 was a “difficult year” but insisted its turnaround was bearing fruit, with trading in 2018 “solid”. HSS Hire branch Coreena Ford Less than 0.5% of business angels are based in the North East, new report reveals\nFewer than half a percent of business angels are operating in the North East , highlighting one of the main challenges for companies in the region looking to scale up.\nResearch by the British Business Bank surveyed more than 2,500 deals involving over 650 business angels, and found that only two were based in the North East - around 0.3%.\nBy contrast, 57% of business angels are based in London and the South East and much of their investment was concentrated on the ‘golden triangle’ between London, Oxford and Cambridge.\nThe British Business Bank is now launching a new commercial programme to support developing clusters of business angels outside London.\nThe Government-backed body, which was set up in 2014 to boost growth finance for SMEs around the country, is also pledging to increase its presence in regions like the North East. Keith Morgan, chief executive of the British Business Bank (Image: MHP Communications) 8.36 KEY EVENT Newton Aycliffe firm Tekmar floats for first time on 'historic day'\nCounty Durham manufacturer Tekmar has become the latest North East firm to float after joining the AIM market this morning on what its chief executive has described as ‘an historic day’.\nThe Newton Aycliffe firm, which manufactures protection system for subsea cables and umbilicals, announced its intention to float earlier this month, stating that it would use the funds raised to expand its business and increase its market share.\nTekmar Group’s first stock announcement said that on admission the company will have a market capitalisation of approximately £65m, following a successful total fundraise of approximately £61.8m (before expenses).\nThe fundraise, which was well supported by blue chip institutional investors, will be used principally to fund the cash consideration payable under the Acquisition Agreement to acquire Tekmar Limited, to repay debt within the Group and to provide approximately £10m for the Company to fund future expansion and acquisitions.\nJames Ritchie, CEO of Tekmar, said:\n“Today is an historic day for Tekmar, marking the start of the next phase of our planned expansion and development. Being an independent quoted company brings additional advantages and prestige to the Group and we firmly believe it will enable us to accelerate our growth and maximise our potential.\n“I thank everyone who helped Tekmar Group plc achieve this successful flotation, especially our driven management and our loyal employees, who are the heartbeat of this business.” Offshore technicians assembling Tekmar’s patented TEKLINK cable protection system during offshore installation on an offshore wind farm (Image: Unknown) 8.29 Coreena Ford Former Sunderland owner Ellis Short among bidders for Network Rail's 5,500 railway arches\nThe former owner of Sunderland AFC and the owner of Northumbrian Water are believed to be among the shortlisted firms bidding to take over thousands of commercial property sites owned by Network Rail .\nThe organisation announced last November that it was selling its commercial estate business because it is a non-core asset, putting all of its 5,500 railway arch properties up for sale – including 470 properties across the North East – in one portfolio believed to be valued at around £1.3bn.\nThe organisation said all proceeds from the sale will be retained to help fund its railway upgrade plan – and now a shortlist of potential bidders has emerged.\nThe list includes Kildare Partners, the London-based real estate investment firm which was set up by former Sunderland owner Mr Short five years ago, and Northumbrian Water owner CK Asset Holdings, wich was founded by Asia’s richest man Li Ka-shing.\nThe shortlisted is reported to be rounded off by a joint offer from funds managed by Goldman Sachs and Wellcome Trust, Britain’s biggest medical research charity, Terra Firma Capital Partners, the buyout firm run by financier Guy Hands, and a consortium comprising property group Telereal Trillium and Blackstone, the world’s biggest real estate investor.\nMeanwhile, an action group called The Guardians of the Arches, made up of hundreds of affected archway businesses, has launched a petition calling for Network Rail to back down from the sale, claiming thousands of small businesses face “extermination” if the property deal goes ahead. Former Sunderland AFC owner Ellis Short (Image: Sunderland AFC) 8.23 FTSE and pound latest\nThe FTSE-100 index opened at 7603.85.\nThe pound at 8am was 1.3153 dollars compared to 1.3174 dollars at the previous close. The euro at 8am was 0.8797 pounds compared to 0.8786 pounds at the previous close. 8.15 Coreena Ford Profits rise 15% at housebuilder Berkeley Group\nProperty firm Berkeley has released full-year results showing pre-tax profit rising 15.1% to £934.9m over the 12 months to April 30.\nThat was despite a 0.7% fall in revenues to £2.7bn. The company said it sold 3,536 homes over the year at an average price of £715,000. It is now raising its pre-tax profit guidance by £75m to £1.57bn for the two years ending April 30 2019.\nBerkeley Group chief executive Rob Perrins noted some of the challenges facing the London housing market and said the company has been “cautious” in its investments.\nHe said: “We have chosen to focus our operations around one of the world’s pre-eminent cities. London’s attributes are unique and well-known, and will endure well into the future.\n“At present, political and economic uncertainty, in part due to the uncertainty around Brexit, weigh on sentiment but do present opportunities for customers who can look beyond this short-term volatility.\n“Berkeley, with its unrivalled financial strength, land position and expertise is able to look past this prevailing uncertainty with measured confidence but, like all responsible businesses, is cautious in its investment in this environment, and this will determine the speed with which it delivers the value from its assets in the medium-term.” A house being built (Image: PA) 8.10 Coreena Ford Business chiefs urge action over 'hidden barriers' to workplace diversity\nAction is needed to break down “hidden barriers” holding back diversity in workplaces, business leaders have said.\nDespite progress in recent years a study has revealed that only 11% of people taking up apprenticeships are non-white, while few women launch careers in sectors such as engineering.\nA group founded by Leo Quinn, chief executive of Balfour Beatty, said action was needed by industry and government.\nMr Quinn said: “The diversity and inclusion deadlock can be broken and action must be taken immediately given the skills gaps which exist across our economy.\n“Businesses need to collect better data, think outside the box in how they recruit, and ensure workplaces and business cultures are inclusive and welcoming to people from different backgrounds.\n“The Government must also play its part, using the levers it has available. It must provide balanced careers advice, educating teachers, young people and parents from all backgrounds about the range of earn and learn opportunities available, as well as encouraging young people - especially girls - to study Stem (science, technology, engineering and maths) subjects.\n“The Government must also use their role as a major procurer of goods and services to encourage greater emphasis on diversity among their own suppliers.” (Image: Getty)", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14805304;"], "published": "2018-06-20T10:15:00.000+03:00", "crawled": "2018-06-20T11:56:20.070+03:00", "highlightTitle": ""}