{"organizations": [], "uuid": "43cc32c2b1b773ff2306377e359f4119f8bf553b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14742816.ece/ALTERNATES/s1200/JS153561556.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mi5-share-intelligence-bid-stop-14742224", "country": "GB", "domain_rank": 21960, "title": "MI5 to share intelligence in bid to stop terror plots earlier as it's revealed 3,000 may be threats", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-04T17:25:00.000+03:00", "replies_count": 0, "uuid": "43cc32c2b1b773ff2306377e359f4119f8bf553b"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mi5-share-intelligence-bid-stop-14742224", "ord_in_thread": 0, "title": "MI5 to share intelligence in bid to stop terror plots earlier as it's revealed 3,000 may be threats", "locations": [], "entities": {"persons": [{"name": "sajid javid", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MI5 to share intelligence in bid to stop terror plots earlier as it's revealed 3,000 may be threats Home Secretary Sajid Javid reveals the police are watching 3,000 people as he outlined the 'Contest' strategy Share Click to play Tap to play The video will start in 8 Cancel Play now Thank you for subscribing!\nPolice and security services are investigating 3,000 people who may be terrorist threats, Home Secretary Sajid Javid has revealed.\nAnd they have foiled 25 Islamist-linked terror plots in the past five years.\nMr Javid said: “That would mean without their vigilance and hard work, we could have seen one attack every two months.”\nHe revealed the ongoing level of the terrorist threat as he published a new strategy setting out how the Government plans to keep us safe.\nUnder the Government’s plans, MI5 intelligence will be shared with bodies outside the security community in a drive to stop terror suspects before attack plots can crystallise. Home Secretary Sajid Javid (Image: PA)\nThe Home Secretary also said it would be “wrong and reckless” to reduce security co-operation between the EU and the UK, in a criticism of the European Commission’s plan to treat the UK as a “third country” after Brexit.\nMeasures in the anti-terror strategy include:\n• Security services to intervene more quickly in terror plots\n• Longer prison sentences and better management of terrorist offenders\n• UK to work closely with international partners\n• The Government to work more closely with the private sector on a range of issues including protecting economic and physical infrastructure, gaining faster alerts to suspicious purchases and continuing to make it difficult for terrorists to use the internet for propaganda\n• Continuing with the Prevent strategy, which aims to identify people at risk of becoming radicalised. Mr Javid said he acknowledged concerns that this targeted Muslims but believed it was essential.\nMr Javid said: “Our security and intelligence agencies are, right now, handling over 500 live operations, they have 3,000 ‘subjects of interest’.\n“And there are a further 20,000 people who have previously been investigated, so they may still pose a threat.\n“The biggest threat is from Islamist terrorism – including Al Qa’ida, but particularly from Daesh.”\nHe added: “Extreme right-wing terrorism is also an increasing threat.\n“This was tragically demonstrated by the Finsbury Park attack and by the shocking murder of Jo Cox.”\nReferring to the Westminster terrorist attack in March 2017, Mr Javid said: “Four extreme right wing plots have been foiled since the Westminster attack.” Read More North East leaders throw weight behind Heathrow's third runway as Government decision imminent\nThe security service will pass information to bodies such as councils, local police or Government departments, who will work alongside intelligence agencies to determine the best course of action to manage the risk.\nGreater intelligence-sharing is seen as necessary to minimise the threat posed by suspects who are rapidly radicalised to the point of violence before security services can detect the shift.\nSalman Abedi, the Manchester Arena bomber, was categorised as a “closed subject of interest” at the time of the attack, and so not under active investigation.\nThere are an estimated 20,000 individuals who have previously featured in terrorism probes, either as active targets or on the periphery of inquiries. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-04T17:25:00.000+03:00", "crawled": "2018-06-04T19:37:05.049+03:00", "highlightTitle": ""}