{"organizations": [], "uuid": "838803a4964b12d82481dace76511df5e364c23a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14805704.ece/ALTERNATES/s1200/Politics-Wed-1.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-showdown-live-theresa-14805706", "country": "GB", "domain_rank": 21960, "title": "Brexit vote showdown LIVE: Theresa May set to clash with rebels over 'meaningful say' on final deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-20T11:52:00.000+03:00", "replies_count": 0, "uuid": "838803a4964b12d82481dace76511df5e364c23a"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-showdown-live-theresa-14805706", "ord_in_thread": 0, "title": "Brexit vote showdown LIVE: Theresa May set to clash with rebels over 'meaningful say' on final deal", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "neutral"}, {"name": "corbyn", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "David Davis is on his feet to start the debate: 14:01 KEY EVENT EU withdrawal bill - all you need to know\nPrime Minister Theresa May is facing yet another close Brexit vote as the EU (Withdrawal) Bill returns to the House of Commons amid divisions over the role of MPs in the final legislation.\nHere are some of the questions being asked about this week’s votes:\n- What is the purpose of this Bill? The EU (Withdrawal) Bill revokes the 1972 Act which took the UK into the European Economic Area, but also transposes all relevant EU law into British statute so there are no holes in the law book at the point of Brexit. - What is Wednesday’s vote about? MPs will vote on an amendment to the Bill, introduced in the House of Lords on Monday by Viscount Hailsham, which would allow the Commons to have a “meaningful vote” on the final Brexit deal with the EU. - What is the “meaningful vote”? The Government has promised MPs a vote on the final Brexit deal, but initially said it would be a simple “take it or leave it” choice.The House of Lords originally amended the Bill so that if MPs reject the deal, they can direct ministers to go back and renegotiate. - I thought they had voted on this already? Yes, last week the Government saw off a rebellion by pro-European Tory backbenchers by agreeing to concessions.But rebels led by former attorney general Dominic Grieve believe the concessions publicly made are not those agreed with the Prime Minister in private. - What’s the Government’s new plan? It has tabled a Bill offering MPs a vote on a “neutral motion”, if the agreement reached by Mrs May with Brussels is rejected by the Commons, or if no deal has been obtained by January 21. - Why is this unpalatable to the rebels? It would be unamendable, meaning MPs cannot insert a requirement for Mrs May to go back to the negotiating table, extend the Brexit transition or revoke the UK’s withdrawal under Article 50. - Is the Government likely to get what it wants? All sides believe they can win Wednesday’s vote.The rebels believe they can inflict a stinging defeat on the Government, but Brexiteers are also said to be increasingly confident of victory.It will be yet another busy day for the Tory whips. Corbyn: May's NHS figures 'so dodgy they belong on the side of a bus'\nTheresa May’s figures on extra NHS spending are “so dodgy they belong on the side of a bus”, Jeremy Corbyn has claimed as he urged the Prime Minister to be straight with voters on tax rises to fund the plans.\nThe Labour leader asked why Mrs May was pushing her own “Mickey Mouse” figures, following the Government’s announcement of a £20.5 billion-a-year boost to the NHS budget.\nDuring Prime Minister’s Questions, Mr Corbyn claimed Mrs May had said there would be £600 million a week more being spent on the NHS through a “Brexit dividend”.\nHe said:\n“Our net contribution to the European Union is about £8.5 billion a year - £600 million a week is over £30 billion a year.\n“Her figures are so dodgy they belong on the side of a bus.\n“We do expect that from the Foreign Secretary but why is the Prime Minister pushing her own Mickey Mouse figures?”\nMrs May suggested Mr Corbyn spend more time listening to what she says.“There will indeed be around £600 million more being spent on the NHS every week in cash terms as a result of a decision taken by this Conservative Government to secure the future of the NHS.“That will partly be funded by the money we no longer spend on the European Union and as a country we will be contributing a bit more, we will listen to views on that, and the Chancellor of the Exchequer will bring forward that package before the spending review.” 12:26 KEY EVENT 'Which taxes are going up?' May asked\nJeremy Corbyn urged Theresa May to be “straight” with voters by outlining which taxes will increase to fund extra NHS spending.\nThe Labour leader said the Prime Minister had acknowledged the £20.5 billion a year boost for the NHS would come from Brexit, economic growth and tax.He asked at Prime Minister’s Questions:\n“There can be no Brexit dividend before 2022, economic growth is the slowest since 2009 - so which taxes are going up?”\nMrs May said a long-term plan for the NHS had been set out, with money no longer sent to the EU available for the health service.\nIn response to heckles from Opposition MPs, Mrs May quoted Mr Corbyn saying he would “use the funds returned after Brexit” to invest in public services.\nMr Corbyn replied by telling the PM he said the money should be ring-fenced to replace structural funds to regions, agriculture, the fishing industry and research for universities.\nHe added: “Can she be straight with people - which taxes are going up and for whom?”\nMrs May said Chancellor Philip Hammond will set out the full funding package before the spending review.\nShe claimed there will be one circumstance in which there will be no money returning from the EU, telling MPs: “That’s if we adopted Labour’s policy of getting a deal at whatever the price.” PMQs Corbyn grills May over NHS funding\nHere’s a flavour of some of the exchanges currently taking place: 12:15 No North East MPs set to ask questions\nHere are the backbenchers picked to ask questions: 12:00\nPrime Minister’s Questions are about to get under way. 11:46 Rebels 'could collapse the Government'\nFormer Attorney General Dominic Grieve said on Sunday that rebels “could collapse the Government” may have discouraged some backbench colleagues from supporting him.\nHe has since denied that the Government will fall if it suffers a defeat in the Commons on its flagship Brexit bill.\nWhile the Government has promised that Parliament will have the chance to vote on the deal agreed with the EU, it has also warned that rejecting the deal would mean the UK quits without any agreement when Brexit takes place on March 29 2019.\nLabour and some Conservatives say this is not good enough and a “meaningful vote” has to include the option of rejecting the deal but also rejecting a no-deal Brexit.\nHow this would actually work in practice is unclear. Parliament is unlikely to hold a vote on the deal until October at the earliest, which means there would be little time to negotiate any changes before Brexit day.\nMr Grieve said on Tuesday that he still hoped it would be possible to come to a “sensible compromise” that would address the concerns of both sides.\nHowever, he dismissed suggestions that the rebels would bring down the Government if it was defeated.\n“That is complete nonsense. This is the end stage of the detailed consideration of a piece of legislation,” he told the BBC Radio 4 Today programme. 11:05 Worry for the government?\nSky’s political correspondent Lewis Goodall suggests there may be some worry creeping in from the government: Labour 'This isn't about stopping Brexit'\nThis is the message from Labour’s Keir Starmer - the shadow Brexit secretary - about today’s vote: 10:59 'Parliament deserves to have a proper role'\nPhillip Lee, who resigned as a government minister in order to back a strengthened role for Parliament, acknowledged there had been a concerted effort to win over would-be rebels, including the “dark arts” of persuasion in the corridors of power.\nBut he claimed the rebels may have the strength to defeat the Prime Minister - who he said he still counts as a friend - unless an eleventh-hour concession is agreed.\nDr Lee told BBC Radio 4’s Today:\n“We were always going to get the normal dark arts of Westminster taking place, fully expected, but my understanding is that the position taken by a number of colleagues is solid, which is why the Government is still in negotiations.”\nAsked if there were enough rebels to defeat the Government, he said: “Potentially, yes. But... this for me personally is a position of integrity, that I think Parliament deserves to have a proper role in this process, a truly meaningful vote.”He rejected some of the claims made about the consequences of a Government defeat which would give Parliament a greater role in the event of a failure to agree a Brexit deal.He added:\n“I cannot follow the argument, in fact I think it’s nonsense, that somehow this makes it harder for the Prime Minister to do a deal in Brussels.\n“I continue to be hopeful that the Government will accept our position but fundamentally this is not about the Government, this is about Parliament and - I would argue - this is about my country, this is about securing a Brexit deal which is good for my country in the longer term.\n“I think, in the unlikely event that Government fails to get a deal, Parliament should play a part in trying to find a solution.” 10:17 Can the Government be defeated?\nWith Labour set to oppose the Government’s bill, it means around 14 disgruntled Conservative backbenchers would need to vote against the Government to defeat it. (Image: PA) Brexit vote Where do Labour stand?\nLabour will officially support the rebel motion, but around nine pro-Brexit Labour MPs are likely to disobey orders from the party leadership and back the Government. (Image: Daily Mirror) KEY EVENT Theresa May set for showdown\nTheresa May faces a Brexit confrontation with rebel Conservative MPs , after delaying the battle last week. (Image: PA)\nMPs are to vote once again on adding proposals to the EU Withdrawal Bill which would allow Parliament to dictate the course of action the Government must take, if it fails to agree a satisfactory deal with the EU.\nMrs May last week bought off rebels by promising that some of their proposals would be added to the Bill. But some Conservative MPs felt they had been misled, after the Government’s proposed changes were published and did not go as far as expected.\nHowever, it remains to be seen whether Tory rebels, led by former Attorney General Dominic Grieve, have the numbers to defeat the Government.\nWe will have live updates, comment and reaction throughout the day. More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14805706;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-20T11:52:00.000+03:00", "crawled": "2018-06-20T15:19:05.008+03:00", "highlightTitle": ""}