{"organizations": [], "uuid": "d2ca966af31519e5252292ed51b4c263a0ccc510", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1639086.ece/ALTERNATES/s1200/David-Hall-court-case.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/leicester-news/brexit-court-abusive-emails-mps-1639078", "country": "GB", "domain_rank": 48128, "title": "Court hears content of abusive and racial emails sent by Brexit supporter to MPs", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-04T18:49:00.000+03:00", "replies_count": 0, "uuid": "d2ca966af31519e5252292ed51b4c263a0ccc510"}, "author": "leicestermercury", "url": "https://www.leicestermercury.co.uk/news/leicester-news/brexit-court-abusive-emails-mps-1639078", "ord_in_thread": 0, "title": "Court hears content of abusive and racial emails sent by Brexit supporter to MPs", "locations": [], "entities": {"persons": [{"name": "david hall", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "dominic grieve", "sentiment": "none"}, {"name": "ms morgan", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "david lammy", "sentiment": "none"}, {"name": "heidi allen", "sentiment": "none"}], "locations": [{"name": "castlecroft", "sentiment": "none"}, {"name": "wolverhampton", "sentiment": "none"}, {"name": "windsor gardens", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "walsall magistrates' court", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Court hears content of abusive and racial emails sent by Brexit supporter to MPs David Hall said that a number of MPs 'deserved to hang' after EU withdrawal bill vote Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA retired engineer who sent racist and threatening emails to six MPs, including Loughborough’s Nicky Morgan, has been given a nine week suspended jail sentence.\nDavid Hall admitted sending six grossly offensive, indecent or obscene messages via a public communication network.\nThe 72-year-old, of Windsor Gardens, Castlecroft, Wolverhampton, had previously denied six charges of sending grossly offensive and menacing messages.\nBut he changed his plea to guilty at Walsall Magistrates' Court today.\nThe pensioner sent emails last December to Nicky Morgan , Dominic Grieve, David Lammy, Anna Soubry and Heidi Allen in the wake of an EU withdrawal bill vote in parliament.\nThe email to Conservative politician Ms Morgan and other MPs, littered with capital letters and exclamation marks, had the subject line \"YOUR BACK STABBING TREACHERY\". Pensioner David Hall arrives at Walsall Magistrates' Court (Image: Matthew Cooper/PA Wire)\nIt read: \"You deserve to be HUNG for your attack on our democracy yesterday.\n\"WE VOTED OUT OUT OUT and your attack on the British VOTE to leave the PARASITIC FRAUDSTERS in the EU amounts to an act of TREASON.\n\"In WW2 you would have 'SWUNG' for this act of TREACHERY – You join a long list of British TRAITORS – MAY YOU BURN IN HELL FOR ETERNITY.\"\nMs Morgan attended court and had been expected to give evidence against Hall until his change of plea.\nSpeaking after his guilty plea, she said: “I am also very grateful to West Midlands Police and to the CPS for the fact they have taken this action and prosecuted this case.\n\"MPs are of course subject to robust debate, scrutiny ... challenge, which is what we should be. Nicky Morgan arrives at Walsall Magistrates' Court (Image: Matthew Cooper - PA Wire)\n\"But when things tip over into threats of violence or death, then I think a line has been crossed and I think it's important for the sake of our healthy democracy that these things are challenged.\"\nThe court was told that Hall, a Ukip supporter, was previously cautioned for threatening behaviour in 2011 after getting involved in an altercation while putting political leaflets and posters on lampposts near his home. Read More 'Being anti-Semitic is not a political view, it is a hate crime' - Student's anger over racist graffiti in Leicester\nThe court heard that an email to Mr Lammy read: \"I would like to give you a friendly warning.\n\"As you attack the White population of Britain in your aims to gain Black Supremacy in this country, remember what happened to Jo Cox.\n\"I AM NOT ONE OF THEM but there are those out there who would like to see you suffer the same fate. Be careful!!\"\nLabour MP Jo Cox was murdered in her Batley and Spen constituency by Thomas Mair in 2016.\nHall, who appeared in the dock wearing a leather jacket, slacks and slip-on shoes, also sent an email to Wolverhampton MP Eleanor Smith last July, calling for her to be put on \"the first banana boat\" to the \"jungle clearing you came from\".\nAs well as being handed a jail term suspended for 12 months, Hall was ordered to complete 25 days of rehabilitation work and pay £735 in costs and a victim surcharge. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-06-04T18:49:00.000+03:00", "crawled": "2018-06-04T20:17:02.011+03:00", "highlightTitle": ""}