{"organizations": [], "uuid": "832ecdb795941e2303c84072e5fc2b4cbdfc7ed0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13899153.ece/ALTERNATES/s1200/Amazon-results.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14833465", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Amazon to expand across EU but gives no guarantees around Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-27T10:00:00.000+03:00", "replies_count": 0, "uuid": "832ecdb795941e2303c84072e5fc2b4cbdfc7ed0"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14833465", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Amazon to expand across EU but gives no guarantees around Brexit", "locations": [], "entities": {"persons": [{"name": "burkland", "sentiment": "none"}, {"name": "japan.bill burkland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "amazon business", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "amazon business uk", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning ITV finance chief to step down\nITV’s chief operating officer Ian Griffiths will step down in the next year, the company has revealed.Mr Griffiths has been at ITV since September 2008, and has been credited with leading a turnaround at the company.Since January, ITV has been headed up by Carolyn McCall, the first female chief executive of the media firm.She said Mr Griffiths had helped refresh the company’s strategy, and will continue to work on implementing it while ITV looks for a successor.Sir Peter Bazalgette, chairman of ITV, said:\nIan has been a key part of the management team that transformed ITV’s performance.\nThe strategy that Ian helped develop and deliver has created a strong platform for our future success and delivered real value for shareholders.\nOn behalf of the board and our shareholders I would like to thank Ian for all he has done for ITV.\nIn the first quarter of the financial year, ITV’s external revenue was up 5% to £772m.Mr Griffiths said:\nI am immensely proud of everything that we have achieved at ITV, not least in keeping the business together through the financial crisis and then delivering strong shareholder returns from 2010 onwards. File photo dated 20/01/15 of the logo of broadcaster ITV which has bolstered its profits for the sixth consecutive year despite falling audience figures. PRESS ASSOCIATION Photo. Issue date: Wednesday March 2, 2016. See PA story CITY ITV. Photo credit should read: Lynne Cameron/PA Wire 9:17 KEY EVENT Opening date revealed for Gateshead riverside shipping container village\nA food-and-drink village in the shadows of the Tyne Bridge will welcome its first visitors this weekend , developers have revealed.\nThe leisure company behind the Wylam Brewery in Newcastle announced in April exciting plans to plough £1.5m into converting the patch of land in the shadow of the Tyne Bridge in Gateshead into By The River Brew Co, a shipping container village housing a collection of independent operators.\nThe announcement of the plans – which will create around 100 jobs – came soon after attempts to bring forward a garden leisure destination by another company were scrapped.\nNow developers Rob Cameron and Dave Stone have revealed the first customers will be able to sample the delights of the new Hillgate Quays venue from this Sunday.\nThe pair, who also launched gastro pubs the Town Wall and The Bridge Tavern in Newcastle, will lead phased openings of the micro brewery, tap room, restaurant, hawker’s market and custom build bike and coffee shop, which will also feature a number of local firms.\nA team of around 50 people have constructed the container village over the last three months, which will remain in place for four years.\nA host of jobs for bartenders, floor staff, chefs, kitchen staff, mixologists and baristas have also been created.\nThe team has revealed a series of phased openings, starting with the brewery and tap room which will open at midday on Sunday. The Backyard Bike Shop and Coffee Shop, which has moved to the site from its original base in Ouseburn, will also be open from 12pm on Sunday and it will be serving cocktails all day.\nThe By The River Brew Co will open this weekend(Image: Graeme Whitfield)\nThe village will not be serving food on Sunday, but its open flame restaurant – called Träkol – will open for the first time at 5pm next Monday, and the firm is now inviting reservations.\nThe restaurant takes its name and inspiration from the Swedish word for charcoal and the menu has been crafted by the firm’s executive chef Tony Renwick.\nFrom next Tuesday, the brewery and tap room will be open every day from 12pm to 11pm and midnight on Fridays and Saturdays, while Träkol will be open every day serving lunch from 12pm to 3pm and reopening for dinner service at 5pm, with last food orders at 9pm. 9:10 Jonathon Manning DeepMind co-founder to advise Government on AI\nThe co-founder of Google-owned artificial intelligence (AI) firm DeepMind is set to advise the Government’s new Office for Artificial Intelligence.Dr Demis Hassabis will explain how the UK can take advantage of the growth of artificial intelligence, which the Government says is part of its industrial strategy to make the UK a world leader in the technology.The Department for Digital, Culture, Media and Sport also confirmed that fellow AI expert Tabitha Goldstaub has been named chairwoman and spokeswoman of the AI Council, a new industry body designed to promote adoption of AI.Ms Goldstaub is the co-founder of AI firm CognitionX, an online platform which provides information and access to experts from the world of artificial intelligence.Digital minister Matt Hancock said:\nWhether it’s improving travel, making banking easier or helping people live longer, AI is already revolutionising our economy and our society.\nBritain is already an authority in AI, with the world’s best AI company and the leading use of AI in Government. We are determined to capitalise on this position.\nCutting-edge technology is the basis of the future of our economy.\nUnder this Government, investment in the tech sector doubled in the last year, is growing at three times the pace of the rest of the economy, unemployment is at a 40-year low, inequality is falling, and we are seeing the first sustained fall in debt in a generation. We must build on these strengths. ‘How will artificial intelligence affect the UK economy?’ (Image: PwC) 9:05 Jonathon Manning Less than two hours' notice given to agencies to find substitute teachers\nRecruitment agencies often receive less than two hours’ notice from schools when they need teachers, according to a survey.The Recruitment & Employment Confederation (REC) said specialist agencies believe finding teachers quickly is the main reason schools use them to fill temporary placements.REC director of policy Tom Hadley said:\nOur members tell us that they are often under immense pressure to find high quality teachers at great speed.\nWhen a teacher can’t be in the classroom for any reason, pupils can’t just be passed off to existing teachers or teaching assistants in the place of a fully qualified teacher.\nWe all understand the cost pressures on schools but these costs must be put in context and weighed against the cost of employing more permanent staff or having in house recruitment banks replicate the work of specialised agencies in sourcing, and placing suitably skilled substitute teachers. School children (Image: Aldi) Jonathon Manning Thousands of North East car industry jobs being put at risk by Brexit\nThe UK’s motor industry could be be about to suffer a “death by a thousand cuts” due to Brexit, a leading industry figure has warned.\nThe automotive sector is a key employer in the North East, with more than 6,000 people working at the Nissan factory in Sunderland, thousands more in the supply chain and hopes for thousands more at the International Advanced Manufacturing Park being built at Sunderland and South Tyneside.\nBut figures showing investment in new car models and facilities fell by nearly half during the first six months of 2018 - from £647.4m to just £347m - have raised alarms over the future of the industry.\nThe Society of Motor Manufacturers and Traders (SMMT), which released the figures, has blamed the lack of investment on uncertainty created because of the slow progress of Brexit negotiations. The trade associations is now calling for the Government to safeguard jobs in the sector.\nSpeaking to the BBC, SMMT chief executive Mike Hawes said:\nIt won’t be an overnight closure but it could be a death by a thousand cuts.\nGradually the competitiveness of the UK is eroded, making it that much harder to attract the investment, and it’s the investment that makes it so competitive. We still need to see significant additional progress on Brexit.\nThe concerns from the car industry follows similar warnings from motor manufacturers, MPs and other bodies about the automotive sector.\nThe sector is seen as particular vulnerable in the event of a bad deal on Brexit as it relies on parts crossing country borders multiple times and is based on a “just in time” model where delays significantly impact on costs and productivity.\nMr Hawes, who spoke of a “growing frustration in global boardrooms” at the slow pace of negotiations, added:\nThere is no Brexit dividend for our industry, particularly in what is an increasingly hostile and protectionist global trading environment.\nHoughton and Sunderland South MP Bridget Phillipson has tweeted:\nAnother day, another warning from business. Investment in Britain’s car industry has fallen by half with thousands of jobs at risk as ministers refuse to listen. SMMT make clear time is running out. Workers at Nissan (Image: PA) 8:50 KEY EVENT Tony Blair warns UK should extend Brexit deadline\nTheresa May could delay the March 2019 Brexit date becasue of a political impasse over the UK’s future outside the EU, Tony Blair is expected to say.The former prime minister will use a major speech to hit out at both the Tories and Labour over the state of the Brexit process. He will demand a more assertive Parliament and a referendum on a deal with the EU.He will tell the Chatham House foreign affairs think tank that he has “never been more worried about the future of our country” as a result of the Brexit process.\nHe will say:\nWe should plan now for the possibility we need to extend the March 2019 deadline.\nPresently, we are drifting towards March 2019 with no clear negotiating position, no resolution of the Northern Ireland question, still vaguely hoping Europe will allow us access to the single market without abiding by its rules which it will never do, and with senior Cabinet members openly debating the merits of a negotiating position which ‘threatens’ Europe with a no-deal Brexit.\nThis is the equivalent of holding a negotiation on the top floor of a high-rise building and ‘threatening’ to jump out of the window if our demands are not met.\nThe whole thing has become so protracted that it has numbed our outrage.\nThe Prime Minister is “more a hostage than a leader” as a result of the competing factions in the Conservative Party.Mr Corbyn, meanwhile, “neglects to lead the fight here at home over an issue which literally determines the future of Britain”.Mr Blair will say:\nParliament must assert itself because neither Government nor Opposition can or will.\nThen the people must make the final decision because only they have the right to decide what version of Brexit they want or whether in the light of all they now know they prefer to remain. Tony Blair (Image: Newcastle Chronicle) 8:42 Jonathon Manning Purplebricks told to clarify advertising around fees\nOnline estate agent Purplebricks has been warned to clarify its advertising around its fees after a watchdog found it was likely to mislead consumers.The Purplebricks website stated that consumers could “instruct us to sell for £849”, with small text adding that the fee rose to £1,199 in London and surrounding areas.\nThe website also reveals an additional one-off fee of £300 for the company to conduct viewings of the property. This is revealed when a certain icon is hovered over.Hunters Property Group, which understood that the average fee paid to Purplebricks was higher than £849, complained that the information was misleading.It also complained that the website was misleading because it did not make clear that the £849 fee, unlike estate agent commission, had to be paid irrespective of whether or not the property was sold and before the sale was completed.Purplebricks said £849 was the figure that most people paid to sell their property and around 40% of people paid an optional £300 for their viewing service.They said they made it clear in the section entitled “What’s included in our fee” when the fee was payable, and also included this information in their FAQs.The Advertising Standards Authority (ASA) said consumers would understand the figures to mean the total prices they would pay for Purplebricks’ services and would assume that the agency conducted viewings on behalf of sellers as part of their fee.The ASA said:\nBecause the ad did not make clear that the viewings service had a separate fee, payable in addition to the £849 and £1,119 prices, we considered the ad was likely to mislead.\nIt said it was standard practice for traditional estate agencies to only levy their fee in the event of a successful sale, and after that sale was complete, and said consumers were likely to assume the same.The ASA said:\nWe therefore considered that the ad should have made clear that the fee would always need to be paid, even if the property was not sold and potentially before any sale was complete. Because it did not do so, we concluded that it was misleading. Purplebricks' TV advert KEY EVENT Port of Tyne chief executive to leave after announcing recovery in port's performance\nPort of Tyne chief executive Andrew Moffat has announced he is leaving his job after unveiling a recovery in the port’s performance.\nMr Moffat will leave at the end of the year after 10 years in his post.\nThe Port has suffered a difficult few years as a global collapse in coal imports saw turnover slip from £71.5m in 2014 to £45.9m in 2016.\nBut efforts to diversify into new areas of operation have paid off with a small growth in turnover to £47m in 2017 and forecasts for this year for income to reach £56m.\nThe port - which is celebrating its 50th anniversary as a trust port - saw investment of more than £100m completed in 2017 on its south bank estate at South Shields, where new facilities to handle expanded volumes of wood pellet for the Lynemouth power station have been under construction.\n2017 saw growth in four of its five areas of operation, with container volumes increasing by 8% and record numbers at the port’s cruise and ferry operation.\nMr Moffat said:\n2017 was better than 2016 but 2018 is going to be ever better - that’s it in a nutshell.\nDuring 2017, the number of cars handled at the port’s car terminals increased and it retained its position as the UK’s second largest car exporting port.\nThe International Passenger Terminal welcomed 52 cruise ships, bringing 120,000 cruise passengers into the region and handling the largest ever number of DFDS ferry passengers at 600,000. Andrew Moffat, Port of Tyne CEO (Image: handout from Port of Tyne) 8:32 Jonathon Manning Costa Coffee sales fall as Whitbread readies chain for separation\nCosta Coffee owner Whitbread has said sales at the coffee chain were dented in the first quarter by Britain’s high street woes, adding that it is making “good progress” in preparing for the chain to be demerged.Comparable sales at Costa fell by 2% in the UK in the period, dragging down group like-for-like figures at Whitbread, which came in 1.3% lower.The UK high street has been hit hard by rising costs and falling consumer confidence. It has also suffered from several big name closures such as Maplins.Emma-Lou Montgomery, at Fidelity Personal Investing, said:\nAnother day, another warning about a lack of consumer spending.\nNow it seems that Brits have woken up and smelt the coffee. All those tips on how to stop frittering money away have hit home - and hit Whitbread’s bottom line.\nWhitbread shares opened flat in morning trade on the London Stock Exchange.Total sales at Whitbread, including international, rose 3.2%, and 4.9% at Costa.Revenue at Whitbread’s hotels chain, Premier Inn, was up 2.2% over the quarter.Boss Alison Brittain said:\nBoth the budget hotel market and the coffee market present long-term structural growth opportunities, and, whilst we are cautious of shorter-term trading conditions in the UK, due to well-publicised consumer trends, we are confident that we have the right strategies in place to enhance our UK and international market positions and ensure each business is well-positioned to thrive as a separate entity. 8:25 Jonathon Manning World's largest asset manager in £20m Quorum Business Park refinance deal\nThe world’s largest shadow bank BlackRock has ploughed £20m into a refinance deal at Quorum Business Park which has been hailed as a vote of confidence in the region’s property market.\nBlackRock Real Assets – which has assets under management worth $6.2trn – has provided a £20m first mortgage loan to an affiliate of US private equity firm Cerberus Capital Management to refinance eight of the 15 buildings at the office park.\nThe North Tyneside business park now has 500,000sqft of Grade A office space, run by Broadoak Asset Management, which is home to firms including Greggs, Tesco Bank, Home Group, Insure the Box and TSG.\nThe firm’s director Fergus Trim said the deal represented a vote of a vote of confidence in Quorum and the wider Newcastle office market.\nHe said the investment will be used to invest further in the portfolio to reach out to new markets, including the growing small business sector.\nMr Trim said:\nThis financing showcases the increasing institutional demand for investments in the UK regional office markets. Attracting international investors of the calibre of Cerberus and BlackRock is a vote of confidence in both Quorum and the Newcastle office market.\nThis enables us to continue investing in our portfolio. We are now creating units from six desks upwards to meet the growth within the SME market.\nWe’ve had five new lettings in the first six months of this year, representing some 35,000sqft, and we’ve got some good take up of our smaller sizes, so we want to continue to invest in providing for these firms.\nThere’s good activity in the SME market at the moment with quite a few companies that are growing and taking on more staff. We are on site at the moment and will be ready to launch Q10 in September. We have already done Q11 and the majority of those units have now gone, so these new funds have helped us press the button on the new Q10 where we are supplying 35,000sqft in the building, splitting it into 15 smaller units. Quorum Business Park (Image: North Tyneside Council) 8:20 KEY EVENT Budget airline FastJet warns it could go bust\nBudget airline FastJet has warned shareholders that it risks going bust unless it receives more funding.\nThe airline - which offers cheap flights across a number of African countries - said it is in “active discussions” with major shareholders about raising equity.\nIt added that without the additional cash “the group is at risk of not being able to continue trading as a going concern”.\nFastJet added:\nWhilst initial discussions with certain shareholders have been positive, discussions are ongoing and there can be no guarantee of a successful outcome.\nIt is expected that any equity fundraise will be concluded in conjunction with the announcement of the company’s annual results for the year ended 31 December 2017.\nThe group said that if the fundraising is not successful it will result in FastJet being suspended from trading.\nShares in FastJet fell by 60% this morning. Google screen grab, Africa", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14833465;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-27T10:00:00.000+03:00", "crawled": "2018-06-27T10:17:10.003+03:00", "highlightTitle": ""}