{"organizations": [], "uuid": "257376c1413929cd1ed18e005e5788b977e52960", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article443916.ece/ALTERNATES/s1200/Flybe.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/cant-flybe-make-profit-1692152", "country": "US", "title": "Why can't Flybe make a profit?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-19T16:47:00.000+03:00", "replies_count": 0, "uuid": "257376c1413929cd1ed18e005e5788b977e52960"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/cant-flybe-make-profit-1692152", "ord_in_thread": 0, "title": "Why can't Flybe make a profit?", "locations": [], "entities": {"persons": [{"name": "christine ourmières-widener", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why can't Flybe make a profit? There are a number of headwinds for the Exeter-based airline Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nIf you've ever flown from Exeter airport, the chances are you've flown with Flybe.\nThe city is proud to have its very own airline - it is one of the region's biggest companies, employing more than 2,000 staff.\nThis morning, figures for Year End 2017/18 revealed that Flybe has cut its pre-tax losses from £48million to £9million as revenue increased by six per cent.\nHowever, it posted adjusted loss before tax of £19.2m in the year to March 2018, up from £6.7m in the prior year.\nChief Executive Christine Ourmières-Widener, who has been in post for just over a year, said operations have improved over the last year despite the loss increase. Read More\nShe has been transforming the business, cutting less-profitable routes and implemented an IT systems overhaul.\nWhile losses have widened, Flybe's revenue has risen 8.3% to £732.0m.\nAnd it is making more from every seat - 10.1% higher at £53.79.\nWe look at the reasons why Flybe isn't making a profit:\n1. Passengers are feeling the pinch\nJust like the high street, Flybe is at the mercy of the consumer. It means things like the 'Beast from the East' puts people off flying or means flights are cancelled. And if consumers are losing jobs or feeling the pinch because of rising household bills, the first thing to drop off the budget is a trip abroad.\n2. Brexit\nThe risks associated with Brexit and what regulation will look like for the aviation industry is a worry. Will there be additional tariffs and visas to think about. Air passenger duty continues to concern airlines - especially Flybe which has a lot of routes and partnerships with other airlines in mainland Europe.\n3. Cost of fuel and the impact of the dollar\nCar drivers will sympathise with this one. Flybe buys its fuel in dollars and the average market price in US Dollar was up 19.1% at $560. Currency is a changeable beast and policy makers like President Trump can and does affect the price. (Image: Flybe)\n4. Planes are expensive\nCapital investment from the outset is high and Flybe has been reducing the number of plane sit has from a peak of 85 in May last year to ensure that they are running at peak profitability. It needs to make sure that its planes are full to be most efficient. It is also cancelling its unprofitable routes.\nAviation is heavily regulated and the airline spends a lot on maintenance. Read More\nIt has also overhauled its IT and digital systems to make sure that customers can book their flights on their mobile devices. Flybe's award winning maintenance team\n5. Flybe is a small company\nFlybe may be one of the region's biggest players but it is small compared to the likes of its competitors Easyjet, Ryanair and BA. It means that the back room costs take up a higher proportion of its outlay. It costs about the same to pay for things like maintenance, HR and online bookings for 200 planes as it would for 80, for example. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-19T16:47:00.000+03:00", "crawled": "2018-06-19T17:00:18.019+03:00", "highlightTitle": ""}