{"organizations": [], "uuid": "21ca515c6a0bb98c2cb68e94227aeb1d2ec35f35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14090061.ece/ALTERNATES/s1200/Institute-for-Public-Policy-Research-report.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/64000-jobs-newcastle-could-replaced-14754888", "country": "GB", "domain_rank": 21960, "title": "64,000 jobs in Newcastle could be replaced by computers - with particular roles most at risk", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-07T15:00:00.000+03:00", "replies_count": 0, "uuid": "21ca515c6a0bb98c2cb68e94227aeb1d2ec35f35"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/64000-jobs-newcastle-could-replaced-14754888", "ord_in_thread": 0, "title": "64,000 jobs in Newcastle could be replaced by computers - with particular roles most at risk", "locations": [], "entities": {"persons": [{"name": "liam byrne", "sentiment": "none"}, {"name": "byrne", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "house of commons library", "sentiment": "none"}, {"name": "red shift", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily Thank you for subscribing! Could\nMore than 64,000 jobs in Newcastle are at “high risk” of being lost to automation, according to research published by Labour MPs.\nAnd working class occupations will be the hardest hit.\nThe findings were published by a Labour think tank called Red Shift at an event in the House of Commons.\nResearch by the House of Commons Library found 2,128,000 jobs nationwide are at high risk of automation. This is about a quarter of low paid jobs.\nThey include 64,355 in Newcastle, as well as 17,629 in the Gateshead constituency. Robots on a production line (Image: PA)\nRed Shift is attempting to spark debate about how to deal with the problem. Leading members include Liam Byrne, a Labour shadow minister responsible for digital issues, although in this case his proposals are not necessarily Labour Party policy.\nHe has suggested ideas including a radical reform of universities.\nMr Byrne said: “If what you learn on a three-year degree becomes quickly dated after the moment you leave, then one has to ask why are we offering three-year degrees? “Why not ten-year degrees offered a year at a time every decade of your life?”\nOther proposals include increasing corporation tax to help pay for a massive re-training programme.\nThe prospect of increased automation is sometimes called the “rise of the robots”, but that’s a little misleading.\nMost of us would think of a robot as a machine with moving parts. The problem isn’t so much that we’re getting better at making those – it’s that we’re getting better at making computer software. Labour MP Liam Byrne\nTransportation is an example of an industry that might be affected. The day is approaching when self-driving vehicles will be a common sight.\nThat may be good news for supermarket chains, which need to get stock from their warehouses to their shops, but clearly it’s bad news for lorry drivers.\nShop workers are also likely to be particularly hard hit.\nBut even if you can create new jobs to replace the old ones, there’s a problem.\nIncreased automation means increased productivity. Businesses can make more money with fewer staff.\nThat’s a good thing in many ways, as low productivity is seen as one of the biggest problems facing the UK economy today.\nBut it means that people who receive the profits from successful businesses are likely to get richer, while many of those who depend on selling their labour to survive are going to find their jobs become more insecure and their wages fall. A mother paying for shopping at a checkout (Image: iStockphoto)\nThat’s not only unfair, but it makes for an angry and unstable society.\nMaybe, however, there is an alternative. Perhaps we can make automation work for all of us?\nThat’s the question Red Shift is asking.\nThere has to be action to ensure wealth is shared fairly, said Mr Byrne. Read More\nHe called this a “moral economy”, warning: “Without a plan to recreate a semblance of the moral economy, I can tell you technophobia is going to become a national religion.”\nOne of the side effects of automation was a tendency towards the creation of monopolies, he said.\nFirms like Amazon, for example, don’t really have any competition.\nLooking at changes to the US economy, Mr Byrne said: “They are assumed unprecedented market power – including the power to hold down wages – and mark-up prices ... and this largely explains why wage share of national income is falling.”\nSolutions might include a major increase in investment in skills and education, and a rethink of the university system,\nBut there is also a need for Government action to break up monopolies, he said.\n“This will need tougher competition policy to breakup new monopolies, proper regulation of monopsony (when workers have only one potential employer), new minimum wage rules, stronger collective bargaining and corporate governance reform to make sure new skills earn the pay they should.”\nAnd the Government should start drawing up plans now to re-train people working in areas which it knows will see massive job losses, such as transportation and retail.\nHe also said it should be easier for Government to borrow money to invest in education and training. Read More Labour's Brexit policy is a 'progression' says shadow business minister Chi Onwurah\nThis would mean re-thinking existing Treasury rules, which allow for borrowing to invest in physical infrastructure – such as buildings or roads – but count education and training as “revenue spending” which should be funded through taxation.\nThere’s evidence that voters are already worried – which means there could be rewards for the political party which is ready to take action.\nA survey by Opinium for Red Shift found a third of workers think it is likely that human jobs or tasks will be replaced by automation in the next ten years.\nBut this rises to nearly half in the North East.\nMr Byrne said: “We are at a fork in the road. Unless we take dramatic steps now to help people adapt to changing technology, it’ll be impossible to reverse massive trends in rising inequality for the rest of the 21st century.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-07T15:00:00.000+03:00", "crawled": "2018-06-07T19:00:06.008+03:00", "highlightTitle": ""}