{"organizations": [], "uuid": "a2c9fd23c41006086ad8967f8bbbc935a7cd39f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1697937.ece/ALTERNATES/s1200/sarsa.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/government-accused-dirty-tricks-bid-1697929", "country": "GB", "title": "Government accused of dirty tricks in bid to win vital Brexit deal vote - Devon MPs react", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-20T20:16:00.000+03:00", "replies_count": 0, "uuid": "a2c9fd23c41006086ad8967f8bbbc935a7cd39f7"}, "author": "Keith Rossiter", "url": "https://www.devonlive.com/news/government-accused-dirty-tricks-bid-1697929", "ord_in_thread": 0, "title": "Government accused of dirty tricks in bid to win vital Brexit deal vote - Devon MPs react", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "dominic grieve", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "none"}, {"name": "exeter labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " Thank you for subscribing!\nThe Government has narrowly defeated an amendment aimed at giving MPs a “meaningful vote” on the final Brexit deal by a slender majority.\nTotnes MP Sarah Wollaston was among six Conservatives who supported the “meaningful vote” amendment tabled in the name of Dominic Grieve, the former Attorney General.\nExeter Labour MP Bradshaw accused the Conservatives of forcing unwell opponents into the division lobby against longstanding convention in an effort to win.\nUnder the convention, MPs who are too ill to make their way through the voting lobbies can be “nodded through” from an ambulance or car parked in the parliamentary courtyard.\nMr Bradshaw raised the matter with the Speaker before the debate. A senior Downing Street source said he was not aware of Conservatives refusing to co-operate. Read More\nMr Bradshaw said after the vote, which gave the Government a 319 to 303 majority: “I know of at least one colleague who has discharged herself from hospital against medical advice to be here and one who is on morphine.\n“She had to be wheeled in to vote in a wheelchair and looked dreadful.\n“All the way through this sorry process the Government has treated democracy and Parliament with contempt. Their tearing up of the decades-old convention that seriously sick MPs on whichever side should be able to vote from cars or ambulances downstairs is the latest example of this.\n“Before their latest concession, the Government clearly thought it was going to lose the vital vote on the amendment guaranteeing MPs a meaningful vote in the event of no deal on Brexit. So it resorted to such despicable and undemocratic tactics. It’s disgusting.”\nWatch: Theresa May: Brexit won't see lower environmental standards in UK Video Loading\nMr Grieve pulled support for his own European Union (Withdrawal) Bill amendment, tabled by Viscount Hailsham in the Lords, which aimed to give Parliament a “meaningful vote in the Brexit process”.\nHe criticised the “atmosphere of bullying” which prevents people from want to compromise.\nHe said there was enough madness around to make him question if the “collective sanity in this country has disappeared”, adding sensible and reasoned arguments presented to the Commons resulted in vilification, abuse and death threats for MPs. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-20T20:16:00.000+03:00", "crawled": "2018-06-20T21:15:42.007+03:00", "highlightTitle": ""}