{"organizations": [], "uuid": "d3f98587b94ada750839524936cae59315e058fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1028381.ece/ALTERNATES/s1200/SofSatBabcock.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-build-mods-next-250million-1731793", "country": "US", "title": "Will Devon get to build the MoD's next £250million warships?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-29T19:06:00.000+03:00", "replies_count": 0, "uuid": "d3f98587b94ada750839524936cae59315e058fa"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/devon-build-mods-next-250million-1731793", "ord_in_thread": 0, "title": "Will Devon get to build the MoD's next £250million warships?", "locations": [], "entities": {"persons": [{"name": "keith rossiter", "sentiment": "none"}, {"name": "will devon", "sentiment": "none"}, {"name": "babcock", "sentiment": "none"}, {"name": "laird leander", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "arrowhead", "sentiment": "none"}], "organizations": [{"name": "ministry of defence", "sentiment": "none"}, {"name": "bae", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Will Devon get to build the MoD's next £250million warships? Keith Rossiter looks at what big ship-building contracts are likely to be in the news later this year and the continued development of the Oceansgate marine cluster in Plymouth Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Get daily updates pushed directly to you Subscribe to notifications\nThe big news to look out for this year is likely to be the contract to design and build the Ministry of Defence’s new Type 31e (e for export) frigates.\nThe investment decision is expected to be made at the end of the year, and the competition has come down to two contenders: the Babcock/Team 31 Arrowhead-140 and the BAE Systems/Cammel Laird Leander.\nBabcock unveiled its Arrowhead 140, a revised design, at the end of May.\nThe warships will be built in the UK, with a price cap no more than £250 million per frigate for the first batch of five. Some observers have questioned whether a ship delivered at that price would be attractive to the export market. Topping out at Oceans Gate Plymouth - a beacon for the marine sector in the South West\nBabcock is leading a bid with BMT, Harland & Wolf, Ferguson Marine and Thales, and hopes that its success with Thales in the Aircraft Carrier Alliance will swing it.\nAppledore built some modules for the Royal Navy’s new Queen Elizabeth-class aircraft carriers, and Babcock chief executive Archie Bethel said: “Team 31 will allow Babcock and Thales to take forward the key lessons from the Aircraft Carrier Alliance and apply them in a new and highly capable team with Harland & Wolff, BMT and Ferguson Marine.”\nDuring a visit to Appledore in January, Defence Secretary Gavin Williamson said: “The South West is crucial for our military, with a particularly special connection with our Royal Navy and Royal Marines.”\nThe MoD spent £4.4 billion in the South West region last year, equivalent to £810 per person and more than in any other region in the UK. That direct spending is estimated to sustain 30,000 jobs. Read More\nThe Appledore yard has also been working to deliver the fourth of a new class of offshore patrol vessels for the Irish Naval Service. LÉ George Bernard Shaw successfully floated in April is due to complete this month(July).\nWorkers at Appledore will be counting on the Type 31e work to fill the gap.\nAnother one to watch over the next 12 months is the development of the Oceansgate marine cluster in Plymouth.\nThe city council is transforming the 35 hectare former Devonport South Yard into a major centre for maritime science and technology, and is working with councils right along the South Coast, as far as Portsmouth.\nPhase one is completed. The first three tenants – Surejust, Trend Marine and the Maritime & Coastguard Agency – were announced at the formal opening ceremony in April.\nOnce complete, Oceansgate will provide 25,000 square metres of flexible employment space for marine businesses in the country’s first exclusively Marine Enterprise Zone.\nEnterprise Zone status means business can be eligible for up to 100% business rate discount and 100% tax relief if they make large investments in plant and machinery in the Phase 3 waterside development.\nCouncil leader Tudor Evans said: “What is really exciting is the way the sector is beginning to develop. Our partnership with councils across the South Coast is beginning to pay dividends.\n“This can be a game-changer for the maritime industries across the South West in the year ahead. The facilities at Oceansgate and the ability to get to the waterfront will be transformational.” The most normal sight in the world... to us (Image: Penny Cross)\nNorth Yard at Devonport continues to service the Royal Navy. The Trident nuclear submarine HMS Vanguard is nearing the end of a four-year refit, which started in December 2015 with a contract value of around £200 million. This has been the largest single submarine refit package in the UK and has involved about 2,000 personnel at Devonport.\nIn its 2018 annual report, Dockyard operator Babcock Marine said it had an £18 billion order book and £13 billion pipeline of long term contracts and framework agreements.\nThe company is predicting low to mid single digit underlying revenue growth with stable margins in its marine sector in this financial year. Read More Gritters are out on Devon's melting roads Princess Yachts' luxury boats\nThe high end of the leisure market is also thriving. Sales at Plymouth-based yacht builder Princess Yachts have reached record levels with advanced orders also passing £750 million for the first time.\nIn the 12 months to December 31, 2017, the company turned over £274 million, up 26% on 2016, and generated an operating profit before exceptional items of £7.9 million.\nIn May the company unveiled the latest addition to its Flybridge range, the Princess 70, one of six new models it hopes to announce this year.\nPrincess Yachts has taken on more than 500 staff to support growth. The Aquila's refit won Pendennis Shipyard a top international award (Image: Pendennis Shipyard)\nSuperyacht builder Pendennis Shipyard at Falmouth Docks has signed a contract to build another custom Hoek Truly Classic 128ft sailing yacht.\nThis is the fourth new build in the Truly Classic series direct from the drawing boards of the world renowned Hoek design office in Holland.\nIn May Pendennis delivered its first Hoek new build, SY Vijonara.\nThis year is Pendennis’s 30th anniversary – and the latest order is its 30th new build.\nMike Carr, managing director, said the company had continually invested in its facilities and skills base, enabling it to grow into a global contender. “Signing such a prestigious contract in this, our milestone year, is a true testament to that,” he said.\nElsewhere in Falmouth Docks the future looks less certain. Falmouth continues to be the Westcountry’s top cruise liner destination, but hopes of boosting that business further are looking gloomy.\nAfter an 18-year struggle, the project to dredge a deep-water channel for big cruise ships appears to be disappearing over the horizon, thanks to environmental concerns.\nThe dredging was part of a port masterplan which would make Falmouth the “gateway to Cornwall” with a dedicated cruise ship berth and new port infrastructure. Read More Food and drink in Devon and Cornwall is the best - and this is why\nA&P Falmouth would have been able to use it a major ship repair berth, enabling it to attract larger commercial ships.\nEarlier this year the European Sea Ports Organisation warned that if Brexit results in new border controls, ports will have to invest to reorganise the layout of their terminals to accommodate the increase of border inspections, to avoid congestion and to facilitate as much as possible the smooth flow of goods.\nThe organisation called on the European Commission to consider the costs of making ports that depend on EU-UK trade “Brexitproof”. There has been no signal from the UK Government of similar support for our own ports.\nTeignmouth, one of ABP’s two short sea ports in the Westcountry, is now importing/exporting more than ever, thanks to a new Mantsinen HybriLift 90M wheeled crane, installed in May last year.\nThe port now handles in the region of 400,000 tonnes a year including about 200,000 tonnes of ball clay, along with animal feed, grain, stone chippings and other dry bulks.\nFurther west, ABP’s Port of Plymouth handles around 250,000 tonnes a year, some of it in cross-Channel trade. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-29T19:06:00.000+03:00", "crawled": "2018-06-29T19:43:33.005+03:00", "highlightTitle": ""}