{"organizations": [], "uuid": "390c59be41d58b63c87c842bea1a4e0e50d25906", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12095524.ece/ALTERNATES/s1200/JS103524325.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/awkward-situation-north-east-labour-14756362", "country": "GB", "domain_rank": 21960, "title": "Awkward situation for North East Labour MPs as party hints it will oppose Heathrow expansion", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-07T20:00:00.000+03:00", "replies_count": 0, "uuid": "390c59be41d58b63c87c842bea1a4e0e50d25906"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/awkward-situation-north-east-labour-14756362", "ord_in_thread": 0, "title": "Awkward situation for North East Labour MPs as party hints it will oppose Heathrow expansion", "locations": [], "entities": {"persons": [{"name": "ian lavery", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "andy mcdonald", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "north east labour", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "shadow transport", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Awkward situation for North East Labour MPs as party hints it will oppose Heathrow expansion Labour Chair Ian Lavery and Chief Whip Nick Brown have both campaigned in favour of a third runway Share A plane taking off at Heathrow airport (Image: Daniel Leal-Olivas/PA Wire) Share Get daily Thank you for subscribing! Could\nSenior North East Labour MPs face embarrassment if their party comes out against the expansion at Heathrow.\nOpposition Chief Whip Nick Brown, Labour chair Ian Lavery and Shadow Transport Secretary Andy McDonald have previously claimed that expanding Heathrow is vital “to connect the North East to the rest of the world”.\nBut the party could now come out against plans for a third runway, after a senior Labour source told journalists that Labour is “sceptical” about whether the third runway plan meets a series of tests it has set.\nConservatives are also divided over the runway proposal. Newcastle MP Nick Brown (Image: Newcastle Chronicle)\nOfficially, Labour says it hasn’t made a decision about whether it will support Heathrow expansion when the House of Commons holds a vote later this month.\nBut Shadow Transport Secretary Andy McDonald, the MP for Middlesbrough, said the expansion must meet four tests. These are that it provides the extra aviation capacity required; that noise and air quality issues are fully addressed; that the UK’s climate change obligations are met in their entirety; and that growth across the country is supported.\nThe tone of his comments was far from supportive, telling Transport Secretary Chris Grayling: “We will not rely on the Secretary of State’s assurances.”\nAnd a senior Labour source has told journalists the party is “sceptical” over whether the tests can be met.\nOpposing Heathrow expansion might please Shadow Chancellor John McDonnell, whose constituency is in west London and who has been campaigning against a third runway for years, Transport Secretary Chris Grayling (Image: PA)\nBut if the party does go down this road than it may have to allow a free vote, or to come up with a mechanism which allows senior MPs to ignore the official line.\nNorth East Labour MPs have been firm supporters of Heathrow expansion, on the grounds that it will benefit Newcastle International Airport and Durham Tees Valley Airport.\nLabour MPs who backed expansion include Newcastle East MP Nick Brown, now Labour’s Chief Whip; Ian Lavery, now Labour’s Chair, and Mr McDonald.\nThey signed a letter dated November 3 2015, which stated: “Alongside the North East Chamber of Commerce and Newcastle International Airport, we have supported growth at Heathrow as the best way for the whole of the UK to capitalise on having a successful hub airport, and to ensure that capacity remains at Heathrow to connect the North East to the rest of the world. Read More Labour's Brexit policy is a 'progression' says shadow business minister Chi Onwurah\n“Heathrow is the North East’s biggest hub connection and compliments our other hub services from Emirates, United, KLM, Air France and others.\n“Expanding Heathrow would give security to our regular flights from Newcastle Airport to Heathrow, and expand the number and variety of connections available to passengers from the North East looking to travel from the UK to the Far East and South America.”\nThey continued: “Crucially, growing our hub will encourage tourists and investors to come to Britain and travel to the North East.\n“Indeed, the Airports Commission figures show that up to 5,100 jobs could be created in our region with Heathrow expansion.” Ian Lavery (Image: Daily Mirror)\nThe letter was addressed to Lilian Greenwood, who was Labour’s Shadow Transport Secretary.\nMr Brown, Mr Lavery and Mr McDonald were backbench MPs at the time, and it’s not at all unusual for backbenchers to toe the party line once they gain a front-bench role.\nBut voting against Heathrow expansion would mean they were voting against a policy they recently said was vital for the prosperity of the North East.\nConservatives are also divided over expansion of Heathrow.\nThe Government’s policy is to back a third runway. But Foreign Secretary Boris Johnson, whose Uxbridge constituency in west London is not too far from Heathrow, is implacably opposed.\nTheresa May has been forced to relax the principle of Cabinet collective responsibility and allow Mr Johnson to speak out against the official line. But he can only do it in his role as a local MP - and has been told he can only make comments on the issue to his local media.\nIt’s unclear whether this means the Uxbridge Gazette or whether it stretches to London’s Evening Standard newspaper, one of the most widely-read newspapers at Westminster. Read More Transport Secretary promises Heathrow third runway will benefit regional airports\nMr Johnson will also apparently be allowed to miss the Commons vote, perhaps by undertaking a pressing overseas trip on the day it takes place.\nWhatever Labour does, and even if there is a small Conservative rebellion, the House of Commons is likely to vote in favour of expansion because SNP MPs will join the vast majority of Tories in backing it. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-07T20:00:00.000+03:00", "crawled": "2018-06-07T20:24:59.000+03:00", "highlightTitle": ""}