{"organizations": [], "uuid": "fa2e4c83dcb17f5d0b5364c625239b014b37edd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14746025.ece/ALTERNATES/s1200/Rail-timetable-changes.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/83-north-east-mps-demand-14775650", "country": "GB", "domain_rank": 21960, "title": "83 North East MPs demand Northern is stripped of its rail franchise", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-12T18:00:00.000+03:00", "replies_count": 0, "uuid": "fa2e4c83dcb17f5d0b5364c625239b014b37edd5"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/83-north-east-mps-demand-14775650", "ord_in_thread": 0, "title": "83 North East MPs demand Northern is stripped of its rail franchise", "locations": [], "entities": {"persons": [{"name": "chris g", "sentiment": "negative"}, {"name": "ian mearns", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "newcastle central station", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "transport", "sentiment": "negative"}, {"name": "arriva", "sentiment": "none"}, {"name": "northern", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News 83 North East MPs demand Northern is stripped of its rail franchise Transport Secretary Chris Grayling is told by MPs from across the North that chaos on the railway must stop now Share Passengers and a Northern train at Newcastle Central Station (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nMore than 80 MPs from across the North have told Transport Secretary Chris Grayling to strip Northern of its rail franchise, following weeks of travel chaos.\nThey said Northern , owned by transport giant Arriva, should lose the right to run rail services.\nInstead, trains should be returned to public control, MPs said.\nThe letter was written by Ian Mearns , Labour MP for Gateshead, and signed by 82 Labour colleagues from across the North East, North West, Yorkshire and Humberside.\nMore than 2,000 Northern trains have been cancelled completely, around 2,000 have been “part cancelled” and hundreds of services have been confined to shortened trains. Ian Mearns\nIt follows the introduction of a new timetable.\nNorthern runs services between Carlisle and Middlesbrough, via Hexham, Gateshead’s MetroCentre and Newcastle. It also runs trains in the North West, Yorkshire and across the Pennines, and much of the disruption has affected services in the North West.\nMr Mearns said: “It is obvious that, first and foremost, Northern Rail passengers, our constituents, deserve much better than the service that they are being given.\n“Secondly, it is clear that Chris Grayling and the Conservative Government should have been attempting to fix these problems before they reached crisis point. Why have they been allowed to reach this stage?\n“If it is clear to me, and the majority of the travelling public, that the current system does not work, then how is it not clear to the Government? Transport Secretary Chris Grayling (Image: PA)\n“Returning the rails to public control is an overwhelmingly popular policy. To not do so is a simple case of the Tories putting their out of touch ideology before the needs of the people of the country.”\nThe 83 Labour MPs call upon the Government to abolish the franchise system and return the rails to public ownership and public control.\nThey told Mr Grayling in their letter: “Northern Rail’s passengers, our constituents, have been left in the lurch, with cancellations and delays causing complete chaos. We in the North have passengers who cannot travel to work, children who cannot travel to school, with some commuters reporting that more than 70% of their journeys have been delayed over the past six months.”\nAnd they said: “The franchise system is not fit for purpose and the travelling public would, by vast majority, welcome a radical solution to this systemic failure and a return to public ownership and public control. Read More Twitter abuse forces Newcastle MP to take a break from social media\n“It is what the majority of the travelling public want, and it is what they deserve: trains which run, and run on time. It is the very least that our constituents should expect.”\nMr Grayling has told the House of Commons that the cancellations are unacceptable, and ordered an inquiry into what went wrong at Northern and at Thameslink, a rail network in the south, which has also experienced delays.\nHe told the House of Commons: “I want to be absolutely clear: passengers on these franchises are facing totally unsatisfactory levels of service.\n“It is my and my Department’s No. 1 priority to make sure that the industry restores reliability for passengers to an acceptable level as soon as possible.\n“I assure the passengers affected that I share their frustration about what has happened, and that I am sorry that this has taken place.” Read More Theresa May faces Commons showdown over who is in charge of Brexit\nDavid Brown, managing director of Northern, said in an interview with the Manchester Evening News: “The service we have offered recently has not been adequate and we accept that and we’ve apologised, and we apologise again for that.\n“All our effort at Northern is going in to getting that sorted. Nobody, including me, our staff at stations, our planners, want to be providing this level of service and that’s why we are putting all our efforts into the recovery plan and getting it sorted. We are absolutely fixated on getting it sorted.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-12T18:00:00.000+03:00", "crawled": "2018-06-12T18:21:53.013+03:00", "highlightTitle": ""}