{"organizations": [], "uuid": "3412552a0f6866145a7dfb84e55b0216350779bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10749616.ece/ALTERNATES/s1200/JS21814868.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14843741", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Tata Steel merger could be completed within days, report claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-29T10:00:00.000+03:00", "replies_count": 0, "uuid": "3412552a0f6866145a7dfb84e55b0216350779bc"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14843741", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Tata Steel merger could be completed within days, report claims", "locations": [], "entities": {"persons": [{"name": "baroness joyce quin", "sentiment": "none"}, {"name": "anna turley", "sentiment": "none"}, {"name": "julie elliott", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "paul brannen", "sentiment": "none"}, {"name": "paul williams", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}, {"name": "jude", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}], "organizations": [{"name": "nine north east mps", "sentiment": "negative"}, {"name": "tata steel", "sentiment": "negative"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT North East MPs call for final vote on Brexit deal\nNine North East MPs and MEPs have written an open letter warning of the risk Brexit poses to the region and calling for a final vote on the Brexit deal.\nThe letter was written following concerns raised by Nissan - one of the largest employers in the region - that it was still “in the dark” about how Brexit might affect its business.\nThe signatories are Bridget Phillipson MP (Houghton and Sunderland South), Julie Elliott MP (Sunderland Central), Phil Wilson MP (Sedgefield), Anna Turley MP (Redcar), Paul Brannen MEP (North East of England), Catherine McKinnell MP (Newcastle North), Paul Williams MP (Stockton South), Jude Kirton-Darling MEP (North East of England), Baroness Joyce Quin (Former MEP and Minister of State for Europe).\nThe letter reads:\nAs MPs, MEPs and Peers from Sunderland and across the North East of England, we have a duty to our constituents to make sure we are representing them and securing the best possible future for them and their families.\nThat is why we cannot ignore recent warnings from Nissan’s chief executive Carlos Ghosn that the company is “in the dark” over proposed plans for Brexit and that the company has no option but to pause investment plans in the UK until they get more clarity from Downing Street.\nOver 7,000 people are employed by Nissan in Sunderland, while 30,000 more across the North East rely on the plant as part of the manufacturing chain. Any risk to those jobs and our region’s prosperity shows why we believe that the Brexit deal being negotiated by the Government represents a serious threat to our future.\nThe Government hopes to get a final deal on Brexit in March next year, but that’s no use for our businesses in the North East, whether they are large or small, who need to make investment decisions sooner rather than later. With the current mess being made of Brexit that confidence is at risk of quickly slipping away.\nWhatever you think of Brexit, whether you think it’s a good deal or a bad deal, there’s no denying it’s a big deal for the North East. That’s why more and more people are supporting the idea of a People’s Vote on the final Brexit deal. An anti Brexit rally at the Monument attended by a large crowd (Image: Newcastle Chronicle) 9:14 Jonathon Manning North East businesses show improved confidence\nNorth East businesses are among the most confident in the country according to a recent survey.\nLloyds Bank’s Business Barometer found that confidence had risen by 35% across the region, while 41% of businesses said they were optimistic about the economy.\nLeigh Taylor, regional director for the North East at Lloyds Bank Commercial Banking, said:\nOverall confidence in the North East is above the national average, and is based on rising optimism about the economy overall, which also bucks the trend across the UK.\nWe are seeing significant investment across the region at the moment, particularly in the manufacturing sector where two major projects have been announced this month alone.\nWith an increasing number of other local firms looking to hire more staff in the next year, I’m cautiously optimistic that businesses’ own confidence will rise in the months to come. Leigh Taylor, area director at Lloyds Bank 9:06 Jonathon Manning Prime Minister hails £20bn Australian warships contract for BAE\nTheresa May has hailed the award of a £20bn contract to the British defence giant BAE Systems to build a new generation of warships for Australia.BAE will supply nine Type 26 submarine hunter ships for the Royal Australian Navy under the terms of a 30-year contract.Although the ships will be built in Australia, the Prime Minister said the export of a British design for the frigates would be an “enormous boost” for the UK economy.The deal is part of a A$200bn (£112bn) spending programme by the Canberra government.The award of the contract comes after four years of high-level engagement by the UK, with Mrs May raising it at talks with Australian Prime Minister Malcolm Turnbull at Chequers earlier this year.Foreign Secretary Boris Johnson, Defence Secretary Gavin Williamson and International Trade Secretary Liam Fox have also visited Australia over the course of the last 18 months to expound the benefits UK’s design and engineering.Mrs May said:\nThe sheer scale and nature of this contract puts the UK at the very forefront of maritime design and engineering, and demonstrates what can be achieved by UK industry and Government working hand-in-hand.\nWe have always been clear that as we leave the EU we have an opportunity to build on our close relationships with allies like Australia. This deal is a perfect illustration that the Government is doing exactly that.\nWhile this is an enormous boost for the UK economy, it will also cement our strategic partnership with one of our oldest and closest friends for decades to come.\nBAE Systems chief executive Charles Woodburn said the selection of the company as preferred tenderer reinforced its position as a “leading designer and builder of complex maritime platforms”.\nHe said:\nI am proud that our world-class anti-submarine warfare design and our approach to transferring technology and skills to the nations in which we work is expected to contribute to the development of an enduring world-class naval shipbuilding industry in Australia. BAE Systems in Washington (Image: Newcastle Chronicle) 9:00 Jonathon Manning FastJet shares take off as company outlines rescue plan\nStruggling airline FastJet has seen its shares boosted after the company outlined a rescue plan that would save it from collapse. Google screen grab, Africa Jonathon Manning 300 cash machines closing each month, new study claims\nCash machines around the UK have been shutting down at a rate of 300 every month , a study has found.\nWhich? said the rate of closures cast “serious doubt” on pledges by cash machine network Link to protect access in rural areas.\nThe watchdog’s findings come ahead of changes to the way the ATM network is funded, which come into effect on July 1.\nLink is to cut the fees operators receive from banks when ATMs are used, but some in the industry have warned that thousands of free cash machines could be at risk of being removed or changed to fee-charging, with the possibility of “cash deserts” being created across the UK.\nLink said there would be a phased reduction in the interchange fee - the fee card issuers pay ATM operators - starting next week.\nThe position will then be reviewed annually, taking into account the impact on consumers, with a 20% reduction in interchange fees eventually anticipated after four years.\nLink said the effect was expected to be “a modest decline in the number of ATMs in areas where they are heavily concentrated but with no diminution in the overall geographical coverage”.\nBut Which? found that almost 1,500 machines closed between November last year and April, which it said was a near six-fold increase from a steady rate of fewer than 50 closures a month since 2015.\nThe investigation found that machines in rural communities were at least as badly hit as urban areas - down 2.1% and 2% respectively - across the UK.\nWhich? said such closures would hit rural communities especially hard at a time when bank branch closures were also gaining pace.\nWarnings have previously been issued that Northumberland is one of the areas most at risk from cashpoint closures.\nWhich? said the closures accelerated as operators began to learn of the plans from Link. It has called on the regulator to “urgently intervene” and halt the cuts until a “thorough analysis of the impact on communities is conducted”. A person withdrawing money from a cashpoint (Image: PA) 8:48 Jonathon Manning Amigo plans to list with £1.3bn valuation\nAmigo, which provides finance to individuals with poor credit histories, is set to list on the London Stock Exchange and will be valued at more than £1.3bn.\nThe company provides loans of between £500 and £10,000 for up to a year, at a rate of more than 40%. Repayments are guaranteed by someone connected to the customer.\nAmigo will list at a price of 275p per share.\nFounder James Benamor, who started the firm when he was 21, will sell his stake in the company during the listing. his company, Richmond Group Limited will make £326.8m through the listing.\nGlen Cawford, chief executive of Amigo, said:\nToday is a significant milestone for all of us at Amigo.\nWe are delighted with the level of support and interest we have received from our new investors.\nWe look forward to further growth and success as a listed company and helping even more people who need alternative finance options. London Stock Exchange (Image: PA) 9:40 Jonathon Manning Reach Plc adds £7.5m to phone-hacking payout provisions\nThe owner of the Daily Mirror newspaper has set aside an additional £7.5m to settle phone-hacking cases.\nReach Plc - which was previously known as Trinity Mirror - informed shareholders that it had upped its provision for claims in a statement to shareholders. However, the company said it had made “Good progress” on settling claims, with the majority of claims now being settled.\nThe group said:\nThe costs associated with settling these claims, predominantly the legal fees of the claimants’ lawyers, are expected to be higher than previously estimated.\nTherefore, we have increased the provision for settling these historical claims by £7.5m.\nThe newspaper publisher also warned it was expecting to suffer another fall in advertising revenue.\nRevenue across the group is expected to grow by 11% due to the recent acquisition of Northern & Shell - the owner of the Daily Express and the Daily Star papers. But like-for-like revenue excluding the Express & Star is set to fall by 8% across the 26 weeks leading up to July 1.\nPublishing revenue is tipped to be down 8%, with print falling by 10% and digital increasing by 1%. Classified advertising is expected to fall by 19%.Boss Simon Fox said:\nWe have seen some improvement in May and June, driven by stronger national print advertising.\nFollowing the welcome clearance by the Secretary of State, we will start the process of integrating Express & Star in order to accelerate the benefits that our combined scale will deliver Simon Fox, Chief Executive of Trinity Mirror (Image: PA) 8:32 KEY EVENT Loch Fyne in Gosforth to close its doors within days - throwing site's future into doubt\nPopular seafood restaurant Loch Fyne is to close its Gosforth eaterie within days, throwing the future of the site into doubt.\nThe upmarket restaurant, which grew out of an oyster-selling business in Scotland, first opened to great fanfare in a converted church on Gosforth High Street in 2006.\nNow Loch Fyne Seafood & Grill – which has more than 20 restaurants around the UK – has confirmed it will trade for the last time next week, with staff also issuing a message of thanks through its website and social media.\nA message on the site reads:\nWe are sorry to say that our Gosforth restaurant will be permanently closed from 8 July 2018 and we wanted to say thank you for being a loyal customer.\nWe are aware that some of you may have placed bookings with us and we are sorry that we will be unable to deliver these for you. A member of the team will be in touch to resolve this with you directly.\nIt is not known how many jobs will be affected by the closure but it is understood that Loch Fyne owner’s Greene King is consulting with staff over opportunities to be deployed into other Loch Fyne restaurants around the UK.\nWhat will happen once Loch Fyne closes, however, is not clear as Greene King will not disclose its plans, despite having a number of years left on its tenancy agreement.\nThe building is owned by Kane Property Group, which acquired it in 2013 with Loch Fyne as tenants over a 25-year term.\nConfirmation of the Newcastle closure comes as Greene King, the brewer and pub operator also behind Chef & Brewer and Hungry Horse, is reported to have put the chain up for sale. Loch Fyne Seafood & Grill restaurant on Gosforth High Street (Image: Michael Baister Photography) 8:25 KEY EVENT Is Sports Direct a more innovative company than Apple?\nSports Direct has proudly announced to the London Stock Exchange that it has been named as the fourth most innovative retailer in the world - ahead of tech giant Apple.\nThe sports retailer - which is owned by billionaire Mike Ashley - came in at number four on the Internatinoalisation Retail Index, which is produced by Loqate in partnership with Planet Retail RNG and Retail Week Connect.\nThe only companies that were found to be more innovative were Amazon, Boohoo, and Asos.\nApple came in at number five followed by Topshop Arcadia. John Lewis was number 11.\nThe index has attempted to rank businesses based on their success selling internationally. It takes into account more than 70 attributes, such as online capabilities such as language and currency conversion, to raw numbers like non-domestic sales, international locations and forecasted global growth.\nSports Direct was evidently pleased with the news and sent out a message informing its shareholders of its success.\nIn the statement, head of elevation Michael Murray said:\nI’m pleased that Sports Direct is starting to be mentioned in the same breath as other great companies like Apple and John Lewis. It’s a huge accolade for all our people, whom I’d like to thank for their loyalty and hard work.\nThis index shows that our elevation strategy, along with our approach to innovative initiatives such as our strategic investments and partnerships, is continuing to gain traction. (Image: Newcastle Chronicle) Jonathon Manning Founder of Durham's Atom Bank helps set up Australian challenger\nAtom Bank founder Anthony Thomson is helping to set up a new digital bank in Australia.\nMr Thomson, who left Durham’s Atom in January to promote a book, has been appointed chair of 86 400, a digital bank that aims to take on the established players in the Australian banking market.\nMr Thomson, who grew up in Newcastle and also founded Metro Bank, has teamed up with a number of big players in the Australian finance market to help launch the new company.\nThe mission of the new firm, which is named after the number of seconds in a day, will be familiar to those close to Atom, which aims to become a challenger in the UK banking sector with a mobile-focussed banking service.\nMr Thomson helped set up Atom in 2014 and guided it through the process of getting a banking licence and raising more than £250m of capital to become one of the fastest growing start-ups in the UK. Since launching, Atom bank has taken over £1bn of deposits and has now lent over £1bn to small businesses and homeowners.\nMr Thomson said:\nAustralians deserve more from banking. They expect better treatment and a better experience, and that’s exactly what we’re here to provide.\nHe added:\nFor too long, banks have put profits before their customers - that’s become the great malaise of the industry. We firmly believe that profit is a by-product of doing something great for the customer. Anthony Thomson (seated) with the new team at Australian start-up bank 86 400 (Image: Copyright unknown) 8:15", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14843741;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-29T10:00:00.000+03:00", "crawled": "2018-06-29T11:51:14.005+03:00", "highlightTitle": ""}