{"organizations": [], "uuid": "aaec7972a6ad0d31b66151984e28d1739b9af7db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14746940.ece/ALTERNATES/s1200/SWR_NJL_170714taste_02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/farming/four-north-east-farms-open-14746898", "country": "GB", "domain_rank": 21960, "title": "Four North East farms to open their doors to the public this Sunday", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-05T16:56:00.000+03:00", "replies_count": 0, "uuid": "aaec7972a6ad0d31b66151984e28d1739b9af7db"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/farming/four-north-east-farms-open-14746898", "ord_in_thread": 0, "title": "Four North East farms to open their doors to the public this Sunday", "locations": [], "entities": {"persons": [{"name": "paul norris", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "ty durham", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}], "organizations": [{"name": "wheelbirks farm", "sentiment": "none"}, {"name": "m&j dryden", "sentiment": "none"}, {"name": "broom house", "sentiment": "none"}, {"name": "ahdb", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Four North East farms to open their doors to the public this Sunday Farms in Northumberland and County Durham are taking part in Leaf Open Farm Sunday Share Icecream, at Wheelbirks Farm, in Northumberland (Image: Paul Norris) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nFour North East farms will be open their doors to the public this weekend as part of a nationwide initiative to educate the public about the importance of British farming.\nWheelbirks and North Bellshill farms in Northumberland , plus Broom House and M&J Dryden in County Durham are taking part in Leaf Open Farm Sunday, which opens up working farms to give consumers a greater insight into the realities of modern agriculture.\nResearch on previous events has shown that 91% of people who visited farms were more appreciative of the work farmers do and 89% said they felt more connected to the farmers that produce our food.\nThe initiative has won the backing of Environment Secretary Michael Gove, as well as organisations including the NFU, Defra, AHDB and most of the major supermarkets. Read More North East kids given chance to experience rural life via 'a classroom in the countryside'\nAnnabel Shackleton, LEAF’s Open Farm Sunday Manager said: “At Leaf we totally agree with the Secretary of State that public access is a public good. Mr Gove made it clear that public access is rightly going to be at the heart of the new direction for farming support, post Brexit and this couldn’t happen at a more important time.\n“With 84% of respondents who visited a farm for Leaf Open Farm Sunday in 2017 saying that it had changed the way they think about farming, we are urging all farmers to take part this year on June 10.\n“The benefits of Leaf Open Farm Sunday are proven and extensive and for farmers it is one of the best possible ways to show the public what you do and to encourage them to support British farming by buying British produce.” Read More Ouseburn Farm unveils extension plans that could help make it financially 'self-sustaining'\nNorth Bellshill Farm, at Belford, and Wheelbirks, near Stocksfield, will be opening at 10am, with free entry to the farm. North Bellshill is offering the chance to meet its animals and walk a farm trail, as well as offering refreshments. Wheelbirks will have tractor and trailer rides, walking tours, a guide to its ice cream making facilities and market stalls.\nM&J Dryden, at Murton, will have farmer-guided walks at 10.30am and 1.30pm, plus information on crops, farm machinery and animals. Broom House, near Witton Gilbert, is asking for a £1 donation to go to the Zambezi Sunrise Trust, and will have activities including tractor rides, beekeeping and sheep shearing. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-05T16:56:00.000+03:00", "crawled": "2018-06-06T00:37:29.010+03:00", "highlightTitle": ""}