{"organizations": [], "uuid": "0f4621f9a489797a4bf80febb3729ba84c196908", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/news/local-news/article618634.ece/ALTERNATES/s1200/House-of-Fraser.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/exeters-house-fraser-saved-plymouths-1649082", "country": "US", "title": "Exeter's House of Fraser saved, but Plymouth's will be shut down", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-07T10:49:00.000+03:00", "replies_count": 0, "uuid": "0f4621f9a489797a4bf80febb3729ba84c196908"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/exeters-house-fraser-saved-plymouths-1649082", "ord_in_thread": 0, "title": "Exeter's House of Fraser saved, but Plymouth's will be shut down", "locations": [], "entities": {"persons": [{"name": "fraser", "sentiment": "none"}, {"name": "paul slater", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}], "organizations": [{"name": "plymouth", "sentiment": "none"}, {"name": "share neil shaw head of digital", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}, {"name": "cva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter's House of Fraser saved, but Plymouth's will be shut down The 169-year company has announced plans to shut 31 of its 59 stores Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 08:49, 7 JUN 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Exeter branch of House of Fraser has not been included on a list of 31 shops sets to be closed by the struggling retailer - more than half its outlets.\nBut Plymouth’s huge department store will be closed as part of a plan to save the company.\nThe 169-year company has announced plans to shut 31 of its 59 stores across the UK and Ireland as part of a rescue deal, with the potential loss of about 6,000 jobs.\nPlymouth’s flagship store is on the list, but Exeter’s is given a reprieve. (Image: Paul Slater)\nThe winners and losers on the high street - according to you\nUnder the terms of a proposed Company Voluntary Agreement (CVA), House of Fraser intends to shut the store in Plymouth, which will leave a gaping hole in New George Street, alongside the outlets in Altrincham, Aylesbury, Birkenhead, Birmingham, Bournemouth, Camberley, Cardiff, Carlisle, Chichester, Cirencester, Cwmbran, Darlington, Doncaster, Edinburgh Frasers, Epsom, Grimsby, High Wycombe, Hull, Leamington Spa, Lincoln, London Oxford Street, London King William Street, Middlesbrough, Milton Keynes, Shrewsbury, Skipton, Swindon, Telford, Wolverhampton and Worcester.\nTwo stores are excluded from the CVA proposals – Dundrum in the Republic of Ireland and Beatties in Solihull because they are separate legal entities.\nHouse of Fraser said it has already informed those whose jobs are affected by its plans.\nThe proposed CVA – an insolvency procedure which allows firms to renegotiate with landlords to slash rents but usually at the cost of store closures – will require approval from creditors who will make their decision on June 22, 2018.\nFrank Slevin, chairman of House of Fraser, said: \"The retail industry is undergoing fundamental change and House of Fraser urgently needs to adapt to this fast-changing landscape in order to give it a future and allow it to thrive.\n\"Our legacy store estate has created an unsustainable cost base, which without restructuring, presents an existential threat to the business.\n\"So whilst closing stores is a very difficult decision, especially given the length of relationship House of Fraser has with all its locations, there should be no doubt that it is absolutely necessary if we are to continue to trade and be competitive.\"\nIn May, House of Fraser went cap in hand to landlords, in Plymouth’s case British Land, asking for rent reductions.\nWhy Plymouth's city centre will look incredible by 2021\nAnd the same time the company announced an injection of capital from a new Chinese investor: the Hamleys owner C.banner.\nHouse of Fraser made a £43.9million pre-tax loss – blaming Brexit, terrorist attacks and increased online competition – for the 12 months to December 31, 2017.\nThis compared to a profit of £1.5million in 2016.\nFigures released as part of the takeover of the firm by C.Banner, the Chinese owner of Hamleys, also show the retailer's sales fell from £840.9million to £787.8million in 2017 – a drop of 6.3 per cent.\nThe retailer has been struggling under the cost of its property portfolio.\nIt rents 4,400,000sq ft of retail space, and is stuck in long-term leases, with the average remaining lease life on its stores standing at 29 years.\nMany retailers have had a depressing 2018 — the worst since 2013 — as they face increasing costs and taxes while struggling to fill their stores with customers who are increasingly buying online or heading to out-of-town shopping parks.\nMaplin, the electronics retailer, and the UK division of Toys R Us went into administration while Mothercare, Carpetright and New Look have been renegotiating terms with landlords or lenders. Retail woes: the stores affected by the shopping crisis\nThe UK's retail sector is quaking as inflation and taxes mount and consumer spending slips. Plymouth is not immune. These are the firms that have caught a cold, or are beyond life support, so far in 2018:\nToys R Us - The advertising jingle sang of toys in their millions, all under one roof, but the huge outlet in Western Approach is now empty as the toy store chain became the first big casualty of the UK's retail meltdown. All Toys R Us stores nationwide are now closed or closing.\nBargain Booze - The off-licence chain Bargain Booze went into administration in April 2018 following a warning that earnings would be £5.2million less than expected. The chain, which has five outlets in Plymouth and another in Saltash, warned earnings for this financial year would be “below current market expectations”. But administrators were able offload the retail division to food wholesaler Bestway in a £7million deal.\nDebenhams - Beleaguered Debenhams could shut floors in its Plymouth department store as it looks at solutions to the retail meltdown which has seen its pre-tax profits slump by 84 per cent. The chain is understood to be looking to downsize at least 30 stores blaming “profound change” in shopping habits and bad weather for its latest woes.\nHouse of Fraser - Troubled department store chain House of Fraser has made a £43.9million loss – and is blaming Brexit, terrorist attacks and increased online competition. Figures released as part of a takeover by the Chinese owner of Hamleys, showed the retailer's sales fell from £840.9million to £787.8million in 2017 – a drop of 6.3 per cent.\nNew Look - The budget retailer has had to weighs up “options” amid dismal sales figures and in April 2018 announced it could close 100 stores putting 1,500 jobs at ris. Private equity-owned Poundworld, which has a huge Plymouth store in New George Street, said it is considering its future as speculation mounts that it will opt to restructure the business.\nMarks & Spencer - Retail bellwether Marks & Spencer, which has a huge store in Plymouth city centre, is closing 100 of its biggest stores, about a third of all those selling clothes and homeware, by 2022 after it reported a 62.1 per cent fall in pre-tax profit to £66.8million in the year to March 31, 2018.\nMothercare - The baby and maternity products chain issued a profits warning after like-for-like sales fell by 7.2 per cent during the 12 weeks to December 30, 2017. Mothercare has now decided to move out of Drake Circus mall, but will relocate to a unit more than double the size at the under-construction Plymouth Gateway Retail Park at Marsh Mills. The retailer is looking to shut anything up to more than 50 stores and its March 2018 trading update revealed total UK sales were down 5.6 per cent in the 12 weeks to March 24, compared with the same period in 2017.\nCarpetright - Carpet and furniture giant Carpetright issued its second profit warning of 2018 and is entering talks with lenders. The firm, which has two huge Plymouth outlets, has warned it is set to disclose a full-year loss. In March 2018 it shut three Devon stores, but kept the two in Plymouth open.\nMaplin - Electrical goods retailer Maplin collapsed into administration in February 2018 putting jobs at risk. The company, which employs 2,500 people in the UK and has a large store in Plymouth’s Cornwall Street, said the capital needed to prop up the business – and shield it against tough trading conditions – had proved “impossible to raise”. The store had a huge closing down sale in April 2018 and was unable to say how much longer it would be able to continue trading.\nPoundworld - The budget retailer has had to weighs up “options” amid dismal sales figures and in April 2018 announced it could close 100 stores putting 1,500 jobs at risk. Private equity-owned Poundworld has a huge Plymouth store in New George Street.\nLaura Ashley - Womenswear and home furnishings retailer Laura Ashley postied its third profit warning in just a year. The business, which has a large outlet in Plymouth’s Armada Centre shopping mall, has been hit by adverse currency movements and a slump in demand for furniture and wallpaper throughout the UK.\nH&M - Fashion giant H&M has said it is braced for further sales falls across its stores in 2018, including its Plymouth outlet in Drake Circus Shopping Centre. But it hopes an online push and investment in new brands will deliver a “somewhat better result” than in 2017.\nPoundstretcher - Credit insurers aretightening terms for suppliers to Poundstretcher, a move which is generally seen as an indicator of concerns a retailer is about to go bust. Poundstretcher, which has a huge outlet at Plymouth’s Friary Retail Park, in Exeter Street, saw a £3.4million profit turn into a £3.5million loss in 2017.\nMoss Bros - In March 2018 Moss Bros saw share values plunge 23 per cent after announcing profits for the 2017/18 financial year would be “materially lower” than expected. The clothing chain, which has a large outlet on New George Street, blamed stock shortages, tepid demand for suit hire and lower consumer confidence. But by May 2018 the chain was reporting improved trading though warned of a \"fragile consumer environment\".\nGame Digital - Profits at Game, which has two stores in Plymouth city centre, nosedived by more than a quarter – amid a tough market for consoles – leaving the retailer looking to revive its fortunes through the fast-rising e-sports sector.\nHomebase - The chains Australian owner admitted it may shut outlets as it tries to sell the struggling DIY chain. The company wants to slim down its £1billion rent bill and started disposing of outlets and could close up to 40 of the worst-performing stores.\nTopshop, Topman, Dorothy Perkins, Burton, Evans and Wallis - In May 2018 Sir Philip Green's Arcadia Group reported profits dipped by 42 per cent from £215.2million to £124.1million and sales fell 5.6 per cent in the year to August 26, 2017, sliding from £2.01billion to £1.91billion. Like us on Facebook", "external_links": ["https://www.plymouthherald.co.uk/news/business/plymouths-city-centre-look-incredible-1607097", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-07T10:49:00.000+03:00", "crawled": "2018-06-07T11:10:22.004+03:00", "highlightTitle": ""}