{"organizations": [], "uuid": "801472dc3dfbb2178a1dd25623d2c6c6f661841d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1645551.ece/ALTERNATES/s1200/TP_TEM_060618Magna_02.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/college-1k-students-could-built-1645321", "country": "GB", "domain_rank": 48128, "title": "College for 1,000 students could be built at Magna Park to prepare teens for 'distribution career' - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "801472dc3dfbb2178a1dd25623d2c6c6f661841d"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/college-1k-students-could-built-1645321", "ord_in_thread": 0, "title": "College for 1,000 students could be built at Magna Park to prepare teens for 'distribution career' - Leicestershire Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "magna park", "sentiment": "none"}, {"name": "lutterworth", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicestershire live college", "sentiment": "negative"}, {"name": "institute of technology for logistics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "College for 1,000 students could be built at Magna Park to prepare teens for 'distribution career' There are thousands of logistics jobs in the region Share Click to play Tap to play The video will start in 8 Cancel Play now Get Business Thank you for subscribing!\nThe Government has given its backing to a new training college for workers in transport and warehousing in south Leicestershire.\nThe owners of Magna Park, which is just outside Lutterworth , want to create a 1,000 student Institute of Technology for logistics there, to prepare teenagers for a career in distribution.\nIt would be in the heart of what is called a “golden triangle” - representing the biggest concentration of logistics operations in Britain, addressing the so-called skills gaps by bringing together education providers with industry experts and employers.\nThe region is seeing huge growth in logistics, with big plans to expand in and around Magna Park and work well underway on the £700million East Midlands Gateway logistics park at Castle Donington – a 700-acre ‘inland port’ which will include its own freight rail terminal.\nThat alone is expected to create 7,250 jobs, 900 construction jobs and 3,000 indirect jobs. One of the big sheds at Magna Park Read More Controversial Magna Park expansion plan rejected by just 2 votes\nThe planned Magna Park college would provide vocational training and education, with a research and innovation centre, to meet the needs of the distribution and logistics industry.\nIt will be led by North Warwickshire & South Leicestershire College in partnership with Magna Park owners IDI Gazeley and Aston University.\nPlans for the college can now proceed to the second stage, which will see a detailed business plan put forward to the Department for Education.\nWith final sign-off for the new Institutes of Technology expected later this year, it will form part of a network of colleges offering practical apprenticeships in higher level technical skills up to degree level and beyond.\nMarion Plant OBE is principal and chief executive of North Warwickshire and South Leicestershire College which has campuses in Hinckley and Nuneaton. Looking for a job in Leicestershire? There are hundreds here\nShe said: “We are delighted that our proposal has been accepted for further evaluation by the Government and we look forward to working on the next stage of the bidding process.\n“Alongside our higher education partners Aston University, we are working closely with Gazeley who manage Magna Park, a leading local airport, and advanced technology company Holovis on the proposals which will include a learning hub campus for up to 1,000 students.” Magna Park Tougher planning rules needed on major industrial parks - Alberto Costa\nMagna Park is the biggest distribution park in Europe, with more than 9,000 employees smack bang in the centre of the country.\nOnce funding is secured, the new institute will provide technical training and will also act as a research and innovation centre to meet the needs of the logistics industry and the wider supply chain.\nIts mission will be to “develop skills, knowledge and competencies that will enable sustainable growth, innovation and post-Brexit prosperity” and inspire employees with rewarding jobs and careers.\nThe planned site will deliver around 40,000 sq ft of learning, research and demonstration space, accessible by around 25 blue-chip companies and their staff.\nBoth the Leicester and Leicestershire local enterprise partnership and Blaby District Council have pledged support, which they hope will have a positive impact on employment and the local economy. Read More", "external_links": [], "published": "2018-06-06T03:00:00.000+03:00", "crawled": "2018-06-06T21:29:40.024+03:00", "highlightTitle": ""}