{"organizations": [], "uuid": "b0d86747a53a1a8a70ebbdd6b64f1d881fe30661", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14820621.ece/ALTERNATES/s1200/Convention-North-Newcastle-Crowne-Plaza.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/northern-politicians-joined-forces-newcastle-14820488", "country": "GB", "domain_rank": 21960, "title": "Why Northern politicians have joined forces in Newcastle to give us one powerful voice", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-23T17:37:00.000+03:00", "replies_count": 0, "uuid": "b0d86747a53a1a8a70ebbdd6b64f1d881fe30661"}, "author": "Lisa Hutchinson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/northern-politicians-joined-forces-newcastle-14820488", "ord_in_thread": 0, "title": "Why Northern politicians have joined forces in Newcastle to give us one powerful voice", "locations": [], "entities": {"persons": [{"name": "politica", "sentiment": "negative"}, {"name": "jake berry", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "crowne plaza hotel", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "news why northern", "sentiment": "negative"}, {"name": "northern power house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why Northern politicians have joined forces in Newcastle to give us one powerful voice Political leaders came under one roof for the Convention of the North to ensure the north of England speaks with one strong voice Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nPolitical leaders from across the north of England joined forces at a summit i n Newcastle to make sure our part of the country is heard.\nElected mayors and council chiefs, along with Northern Power House Minister Jake Berry, gathered under one roof for a “Convention of the North” to work out a common position on issues such as rail investment, Brexit and the need to ensure decisions that affect our area are made in the North, rather than in London.\nThey united at the Crowne Plaza Hotel in the city at an influential meeting to ensure the north of England is able to speak with one strong voice to national government and Brussels.\nAnd they called for northern businesses and organisations to come together over the summer and agree a way forward on the big issues likely to define the area over the coming years.\nThey gathered on Saturday, following the start of the Great Exhibition of the North, to discuss the steps needed to bring together the northern leaders for the wider Convention due to be held this summer. Newcastle City Council leader Nick Forbes at the Convention of the North (Image: Newcastle Chronicle)\nNewcastle City Council leader Nick Forbes said: “We want to bring together a Convention of the North that can champion and challenge, promoting all that is best about the north while ensuring government works with us on creating a stronger more prosperous UK.\n“We want representatives from across the north to get involved in creating a vision for the north, and we’ll be setting out more details shortly.\nHe added: “I have been hosting a meeting with political leaders from right across the north and meeting with Northern Power House Minister Jake Berry. The purpose is for us to come together and speak with a clear united voice and talk about the priorities of the north, whether that’s around skills, around transport or in dead how we respond to Brexit and how we get the best deal for the north as part of the national negotiations. It is really important we come together so we’re not picked off and divided by government and we have a clear united voice around the opportunities that the north has to offer for the future, because we think we’ve got great potential. What we need is help unlocking it and the first step to that is making sure we are all coming together and singing from the same hymn sheet.” The Convention of the North takes place at the Crowne Plaza Hotel in Newcastle (Image: Newcastle Chronicle)\nAndy Burnham, Mayor of Greater Manchester, said: “Today’s meeting should send a clear message to Whitehall - the North of England is getting organised and its voice is getting louder. People here have put up with second-class service for too long and there is a growing and unstoppable call for change.\n“The Convention of the North brings together political and business leaders in making a united call for the powers and investment to build the Northern Powerhouse promised to us by the Government.” Read More The Great Exhibition of the North: See how Newcastle and Gateshead kicked off summer event\nHe added: “It’s about the north of England getting organised, coming together, speaking with one voice and working with the powers that be in Westminster to get the investment that we all need, particularly in our transport system. I think this is about the North finding it’s identity.” Greater Manchester mayor Andy Burnham at the Convention of the North (Image: Newcastle Chronicle)\nMr Burnham also gave the thumbs up to the Great Exhibition of the North after watching the opening extravaganza on Friday.\nHe said: “It’s brilliant the Great North Exhibition is happening, Newcastle looked fantastic last night. I think the drone display pointed to the future of the north and the cutting edge of new technology, leading a new industrial revolution. It was brilliant being there and hopefully this is a moment of real change.”\nOne of the key issues they discussed was the Northern Powerhouse Rail project, an ambitious plan to turn the HS2 high speed rail scheme - which links the North West, Yorkshire and the West Midlands with London - into a truly national rail network connect cities such as Newcastle, Hull, Manchester and Liverpool, as well as other rail improvements. The Convention of the North takes place at the Crowne Plaza Hotel in Newcastle with northern council leaders and elected mayors taking part (Image: Newcastle Chronicle)\nThe convention also provided an opportunity for northern leaders to repeat their call for a seat at the Brexit discussions.\nCurrently, the Mayor of London and devolved administrations in Scotland, Wales and Northern Ireland can have their say, but there is no permanent seat at the table for the English regions. Read More Great Exhibition of the North explodes into action with whistles, bangs and a firework spectacular\nAnd it also allowed political, civic and business leaders to set out plans for further and faster devolution, giving the North the chance to shape its own future.\nOthers who attended included; Judith Blake, Leader of Leeds City Council and chair of Core Cities group; Peter Box, chair of Key Cities group; Susan Hinchcliffe, Chair of West Yorkshire Combined Authority; Peter Jackson, Leader of Northumberland County Council; Sue Jeffrey, Leader of Redcar and Cleveland Borough Council; Simon Henig, leader of Durham County Council; Samantha Dixon, Leader of Cheshire West and Chester Council; Steve Rotherham, Liverpool City Region Metro-Mayor; and Dan Jarvis, Mayor Sheffield City Region. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-23T17:37:00.000+03:00", "crawled": "2018-06-23T22:08:54.017+03:00", "highlightTitle": ""}