{"organizations": [], "uuid": "22c2fbb34096577bab754d52a8fdd1a94b1a809a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13245677.ece/ALTERNATES/s1200/Northgate-Plc-saw-its-profits-fall-by-96-last-year.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/northgate-sees-turnover-top-700m-14830817", "country": "GB", "domain_rank": 21960, "title": "Northgate sees turnover top £700m but UK vehicle rentals fall", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-26T16:33:00.000+03:00", "replies_count": 0, "uuid": "22c2fbb34096577bab754d52a8fdd1a94b1a809a"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/northgate-sees-turnover-top-700m-14830817", "ord_in_thread": 0, "title": "Northgate sees turnover top £700m but UK vehicle rentals fall", "locations": [], "entities": {"persons": [{"name": "kevin bradshaw", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "northgate", "sentiment": "none"}, {"name": "cannock", "sentiment": "none"}], "organizations": [{"name": "northgate plc", "sentiment": "none"}, {"name": "invalid email van", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northgate sees turnover top £700m but UK vehicle rentals fall The van rental company saw its turnover soar but its profits dipped Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nVan rental company Northgate Plc added more than £34m to its total revenue last year after introducing a new strategy aimed at growing the firm.\nThe company saw its turnover jump 5.1% during the year ending April 30, from £667.4m to £701.7m.\nThe growth was attributed to Northgate’s new strategy which focuses on defending and growing its market share; gaining share in minimum term markets; and converting van ownership into rental contracts.\nNorthgate also signalled that it is looking to acquire other firms specialising in the light commercial vehicle resale market. Northgate Plc's workshop in Cannock (Image: Unknown)\nSpeaking in the company’s accounts, CEO Kevin Bradshaw said: “During the year we comprehensively overhauled Northgate’s rental strategy to address the compelling growth opportunity in our markets, and we have made good progress implementing this, ending the year with real momentum in both our main territories.\n“Our self-help turnaround programme in the UK started to deliver tangible results, with more competitive pricing, commercial agility and competitive new propositions reversing the previous decline in vehicle on hire (VOH), which ended the year 6.9% higher on a like-for-like basis than at the same time last year.\n“We have now acquired more than 3,400 vehicles following a competitor’s entry into administration, reinforcing our momentum in the market.”\nAlthough Mr Bradshaw explained that the company’s vehicle on hire figures were up 6.9% on a like-for-like basis at the end of the year, overall UK vehicle hire figures fell by 2.9%. This led to turnover from UK rentals falling by 3.1% to £263.8m.\nThe company also adopted a new policy surrounding the management of its fleet of vans. Northgate has now chosen to keep its vehicles for longer periods of time before selling them on in order to improve its return on investment. Read More Thousands of North East car industry jobs being put at risk by Brexit\nDavid Tilston, interim CFO, said: “Following an extensive review of vehicle economics in all territories, it was concluded that holding vehicles for longer periods would improve cash returns, and this policy was applied during the fourth quarter.\n“This will extend average vehicle holding periods by between three and nine months, unless constrained by operational factors such as mileage or the condition of the vehicle.\n“Implementing this policy will lead initially to a reduction in vehicle sales, with a corresponding reduction in replacement vehicle purchases, so that for the period over which the fleet is aged, the revenue and profits from disposals, net replacement capex, and net debt levels will all be lower than they would have been under the previous policy. There will be no impact on EBITDA or operating cashflow.” Read More Historic Newcastle banquet hall to be turned into drinking and dining courtyard\nDespite the new strategy, Northgate was unable to convert its revenue growth into increased profits. Operating profit fell by £21% from £81.5m to £64.1m.\nFollowing the publication of Northgate’s financial results, the company also revealed it had ended its hunt for a new CFO. Philip Vincent will step into the role from July 16.\nMr Vincent recently worked as SABMiller as regional finance director for Asia Pacific. Before joining the firm he spent three years as chief financial officer of BBC Worldwide. Mr Tilston will remain in the business for a short period of time to facilitate the handover. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-26T16:33:00.000+03:00", "crawled": "2018-06-27T02:53:33.000+03:00", "highlightTitle": ""}