{"organizations": [], "uuid": "e90a724ee336c6053fa365823715e48b59d1cfc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14018741.ece/ALTERNATES/s1200/FILE-Premier-League-club-Newcastle-United-have-been-put-up-for-sale-by-owner-Mike-Ashley.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/brexit-affect-how-premier-league-14817631", "country": "GB", "domain_rank": 21960, "title": "Brexit will affect how Premier League transfers work - and loan proposals could impact on Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-23T10:00:00.000+03:00", "replies_count": 0, "uuid": "e90a724ee336c6053fa365823715e48b59d1cfc9"}, "author": "Chris Waugh", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/brexit-affect-how-premier-league-14817631", "ord_in_thread": 0, "title": "Brexit will affect how Premier League transfers work - and loan proposals could impact on Newcastle", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "christian atsu", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}, {"name": "kasey palmer", "sentiment": "none"}, {"name": "ruben loftus-cheek", "sentiment": "none"}, {"name": "benitez", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "kenedy", "sentiment": "none"}], "organizations": [{"name": "newcastle united fc", "sentiment": "negative"}, {"name": "newcastle lee charnley", "sentiment": "negative"}, {"name": "premier league", "sentiment": "negative"}, {"name": "chelsea", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "magpies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lee Charnley and Mike Ashley (Image: Getty Images Europe) Share Get Newcastle United FC\nLoans have become an integral part of Newcastle United’s transfer strategy over the past two seasons - and the Magpies appear likely to exploit that market again this summer.\nRafa Benitez has already made it clear to former club Chelsea that he wants to sign a player on loan from the Blues for the third season in succession.\nThe Magpies signed Christian Atsu on a temporary basis in 2016, making the deal permanent a year later, before loaning Kenedy from the Blues in January.\nAnd, while another temporary move for Kenedy or a loan deal for Ruben Loftus-Cheek is the priority for Benitez, the Spaniard has also been kept informed of the progress of a number of other Chelsea youngsters and fringe players who could be made available. Kenedy (Image: Newcastle United)\nMidfielder Kasey Palmer - who has been linked with United in the national media - is one of the players who Newcastle manager Benitez has been keeping tabs on, with the Blues prospect expected to head out on loan again next term following successful temporary switches to Huddersfield Town and Derby County over the past two seasons.\nBut the 21-year-old England youth international is not believed to be a priority target, rather he is seen as a potential back-up option.\nUnder Premier League rules, Newcastle can only sign one player on loan from a fellow top-flight side, and Kenedy is their No 1 choice, followed by Loftus-Cheek.\nThe Magpies have already registered an interest in signing players on loan from other top-six sides too, with Benitez hoping to use his connection at Liverpool to try and bring talent from Merseyside to Tyneside, for example. An anti-Brexit protester waves an EU flag outside the Houses of Parliament (Image: PA)\nIn the future, however, Newcastle’s ability to loan players could be affected by new Football Association regulations which have been proposed by English football’s governing body.\nAccording to The Times, the FA is considering overhauling the loan system to restrict the temporary transfers of non-British and Irish players between top-flight clubs after Brexit.\nThe report claims that the FA is working with the Premier League and the Government in order to establish new immigration rules for footballers once the UK leaves the European Union on March 29, 2019. Read More Chelsea prospect Kasey Palmer on Newcastle's radar - but Kenedy or Loftus-Cheek is the priority\nSeemingly the governing body views this as the perfect opportunity to increase the opportunities for England-qualified players to feature within Premier League squads, with a proposal for only British- and Irish-qualified players to be loaned between top-flight squads.\nRather than introduce a formal quota system on foreign players post-Brexit - the Premier League will resist any moves to restrict the current open market for the transfer of EU players - The Times claims this domestic loan idea is currently favoured by the FA, given that only six of the 15 players loaned between top-flight clubs were ‘homegrown’ last season.\nUnder such proposals, Newcastle would not have been able to loan either Kenedy from Chelsea nor Islam Slimani from Leicester City last January.\nHowever, another idea being floated is for the FA to lobby FIFA to introduce a “development loan” system, whereby clubs could sign an additional homegrown player in the event of an injury crisis.\nWhat’s more, the very definition of what a ‘homegrown player’ is could change in the coming years, unless the UK stays within the EU single market of European Economic Area.\nCurrently, European players who spend three-straight seasons in the UK before their 21st birthday - such as Tim Krul and Kevin Mbabu at Newcastle in the past - count as ‘homegrown’, but that is expected to change post-Brexit. Read More Mitrovic, Mbemba or Aarons? Assessing the chances of 7 Newcastle players 'doing a Gouffran' in 18/19\nBenitez is merely concentrating on trying to salvage something from the current transfer window, never mind consider the long-term impact that Brexit will have on football - but the Newcastle hierarchy needs to.\nIn their latest accounts, the Magpies cite as one of the “principal risks and uncertainties” the club faces going forward as being “changes to the rules and regulations... affecting eligibility of players and operation of the transfer market”.\nThe market in which Premier League clubs currently operate will change dramatically once the UK exits the EU, and Newcastle must ensure they understand the ramifications of that.\nLoans are just one area which Brexit will impact upon the nuanced football market, and Newcastle need to be alert to any changes which occur. Like us on Facebook", "external_links": ["https://www.thetimes.co.uk/article/fa-wants-brexit-to-create-chances-for-native-players-nllgzx3w2", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-23T10:00:00.000+03:00", "crawled": "2018-06-23T10:20:38.000+03:00", "highlightTitle": ""}