{"organizations": [], "uuid": "1da09b97a2c74d8d018f08ed311281d473184cb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1702935.ece/ALTERNATES/s1200/europe-2069495_1280.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/half-want-second-brexit-referendum-1702934", "country": "US", "title": "Half of us want a second Brexit referendum - Cornwall Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "1da09b97a2c74d8d018f08ed311281d473184cb8"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/half-want-second-brexit-referendum-1702934", "ord_in_thread": 0, "title": "Half of us want a second Brexit referendum - Cornwall Live", "locations": [], "entities": {"persons": [{"name": "neil shaw", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Half of us want a second Brexit referendum Surveys suggest a vote today would lead to a different result Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 07:57, 22 JUN 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAlmost half of voters want a second referendum on Brexit, according to a new poll released on the eve of the second anniversary of the historic vote to leave the EU.\nAnd the survey for ITV1's Good Morning Britain suggested that a fresh poll would produce a very different outcome, with the UK voting to remain in the EU by a margin of 53% to 47%.\nThe projected result effectively reverses the referendum of June 23 2016, when Leave took 52% of votes, compared to 48% support for Leave.\nPollsters Survation found that 48% of those questioned wanted a second referendum on the final Brexit deal, against just 25% who did not. Some 18% said they did not have an opinion and 9% did not know. Read More Land Rover moves production of Discovery out of UK\nThose supporting a new referendum included 35% of Leave voters and 66% of those who back Remain.\nThe survey found that 43% of voters back a \"soft Brexit\" - in which the UK would stay in both the single market and customs union - while 37% favour a \"hard Brexit\" in which Britain would leave both.\nSome 57% of 2017 Labour voters backed a soft Brexit, against 23% who prefer a hard version.\nAlmost half (47%) of more than 1,000 people questioned thought leaving the EU without a deal would be bad for Britain, compared to 32% who said it would be good for Britain.\nOnly 35% of people said Brexit would be good for the UK economy, while 39% said it would be bad.\nLabour MP Chuka Umunna, a leading supporter of the People's Vote campaign for a second referendum, said: \"This new polling shows just how much momentum is building behind the campaign for a People's Vote on the final Brexit deal. Read More Exeter's House of Fraser saved, but Plymouth's will be shut down\n\"This Saturday will see tens of thousands from all over the UK marching for a People's Vote in London and support is growing across the country.\n\"With the negotiations in chaos, with the Government making a total mess of Brexit and with Parliament paralysed, now is the time for people to take back control of the process.\"\nEloise Todd of the Best for Britain campaign said: \"MPs from all parties risk being two years out of date. It's time to follow the will of the people and put the terms of the Brexit deal to them in a people's vote.\n\"Across the country, doubts about Brexit mean people have started to change their mind - politicians must not ignore that; the public would never forgive them.\"\nThe survey also found limited understanding among voters of some of the key issues in the Brexit debate.\nJust 17% of those taking part could identify the correct definition of the customs union, while 38% chose the correct description of the single market. Read More Poundworld faces collapse after potential buyer walks away\nNearly two-fifths (39%) said they had a 'limited' understanding of the issues around the Irish border, while a further fifth (19%) said that they didn't know anything about or hadn't heard of the issue.\nSome 40% thought Brexit would make the relationship between Northern Ireland and Republic of Ireland more distant, compared to 30% who thought it would make no difference and 10% that it would make the relationship closer.\nMeanwhile, 42% thought Brexit would make the relationship between the Republic of Ireland and the UK as a whole more distant, against just 8% who said it would benefit the relationship and 32% that it would be unchanged. Like us on Facebook", "external_links": [], "published": "2018-06-22T03:00:00.000+03:00", "crawled": "2018-06-22T10:00:39.015+03:00", "highlightTitle": ""}