{"organizations": [], "uuid": "9e7548e119be88451b93bc9a533f91e3ec29367b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14772700.ece/ALTERNATES/s1200/SINGAPORE_Summit_073080.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/donald-trump-kim-jong-summit-14772698", "country": "GB", "domain_rank": 21960, "title": "Donald Trump meets Kim Jong-un: What was said and what does the unprecedented summit mean?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-12T10:44:00.000+03:00", "replies_count": 0, "uuid": "9e7548e119be88451b93bc9a533f91e3ec29367b"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/donald-trump-kim-jong-summit-14772698", "ord_in_thread": 0, "title": "Donald Trump meets Kim Jong-un: What was said and what does the unprecedented summit mean?", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "kim jong-un", "sentiment": "negative"}, {"name": "kim", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "dprk", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nUS President Donald Trump says de-nuclearisation will start “very quickly”, after a historic meeting with North Korean dictator Kim Jong-un.\nAfter a year of trading insults, the two leaders sat down together in Singapore, before signing a “comprehensive” document.\nTuesday’s meeting marked the first time a sitting US President had ever met with a North Korean leader.\nAnd rhetoric from both sides suggested big strides had been made.\n“We’ve decided to leave the past behind,” Mr Kim said. “The world will see major changes.” (Image: AP)\nMr Trump said he had “developed a very special bond” with the North Korean leader, the third ruler from a dynasty which has overseen a secretive, isolated regime notorious for its repression and brutal prison camps.\nHe said the meeting went “better than anybody could have expected”.\nThe four key points, as set out in the declaration signed by the two leaders, are:\n- The United States and the DPRK [Democratic People’s Republic of Korea] commit to establish new US-DPRK relations in accordance with the desire of the peoples of the two countries for peace and prosperity. Read More Theresa May faces Commons showdown over who is in charge of Brexit\n- The United States and the DPRK will join their efforts to build a lasting and stable peace regime on the Korean Peninsula.\n- Reaffirming the April 27, 2018 Panmunjom Declaration, the DPRK commits to work towards the complete de-nuclearisation of the Korean peninsula.\n- The United States and the DPRK commit to recovering POW/MIA remains including the immediate repatriation of those already identified. (Image: AP)\nSo what does this actually mean?\nWill the summit make a big difference in world politics?\nBoth leaders seem to think so: Mr Kim called the sit-down a “good prelude for peace” and Mr Trump pledged that “working together we will get it taken care of”.\nThe “complete de-nuclearisation” of the Korean peninsula may sound like a significant step, but it is actually something Mr Kim has already agreed to.\nIn April, he met with South Korean President Moon Jae-in, and the two released a statement announcing their goal of “a nuclear-free Korean peninsula through complete denuclearisation”.\nThe agreement to work towards peace in the Korean Peninsula is certainly a major change in attitude from less than a year ago, when Mr Trump was threatening “fire and fury” against Mr Kim, who in turn called the US leader a “mentally deranged US dotard”.\nBut the document does not contain any more specific measures for how this peace will be attained or what exactly will change. There is no mention of missiles, which is a significant part of what caused tension between the pair in the first place. And the complete de-nuclearisation mentioned in the document is of the whole peninsula (including South Korea) which would be a smaller step than forcing just the North to lose its nuclear capability.\nMeanwhile, the agreement will also lead to the recovery of the remains of prisoners of war from the conflict between North and South Korea, and the immediate repatriation of those already identified.\nMr Trump had little time for any suggestion that establishing friendly relations with a dictator like Chairman Kim was anything other than a positive move.\nOn Twiter, the President said: “The fact that I am having a meeting is a major loss for the U.S., say the haters & losers. We have our hostages, testing, research and all missle [sic] launches have stoped,[sic] and these pundits, who have called me wrong from the beginning, have nothing else they can say! We will be fine!” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-12T10:44:00.000+03:00", "crawled": "2018-06-12T15:26:51.027+03:00", "highlightTitle": ""}