{"organizations": [], "uuid": "1d345ae89728178de5b8645731fefb6ecbbc0c90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14830191.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/thousands-north-east-car-industry-14829844", "country": "GB", "domain_rank": 21960, "title": "Thousands of North East car industry jobs being put at risk by Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-26T14:47:00.000+03:00", "replies_count": 0, "uuid": "1d345ae89728178de5b8645731fefb6ecbbc0c90"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/thousands-north-east-car-industry-14829844", "ord_in_thread": 0, "title": "Thousands of North East car industry jobs being put at risk by Brexit", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}], "organizations": [{"name": "smmt", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Thousands of North East car industry jobs being put at risk by Brexit Industry body warns that car manufacturers could suffer \"death by a thousand cuts\" after investment almost halves Share Workers at Nissan (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe UK’s motor industry could be be about to suffer a “death by a thousand cuts” due to Brexit , a leading industry figure has warned.\nThe automotive sector is a key employer in the North East, with more than 6,000 people working at the Nissan factory in Sunderland, thousands more in the supply chain and hopes for thousands more at the International Advanced Manufacturing Park being built at Sunderland and South Tyneside .\nBut figures showing investment in new car models and facilities fell by nearly half during the first six months of 2018 - from £647.4m to just £347m - have raised alarms over the future of the industry.\nThe Society of Motor Manufacturers and Traders (SMMT), which released the figures, has blamed the lack of investment on uncertainty created because of the slow progress of Brexit negotiations. The trade associations is now calling for the Government to safeguard jobs in the sector.\nSpeaking to the BBC, SMMT chief executive Mike Hawes said: “It won’t be an overnight closure but it could be a death by a thousand cuts.\n“Gradually the competitiveness of the UK is eroded, making it that much harder to attract the investment, and it’s the investment that makes it so competitive. We still need to see significant additional progress on Brexit.”\nThe concerns from the car industry follows similar warnings from motor manufacturers, MPs and other bodies about the automotive sector.\nThe sector is seen as particular vulnerable in the event of a bad deal on Brexit as it relies on parts crossing country borders multiple times and is based on a “just in time” model where delays significantly impact on costs and productivity.\nMr Hawes, who spoke of a “growing frustration in global boardrooms” at the slow pace of negotiations, added: “There is no Brexit dividend for our industry, particularly in what is an increasingly hostile and protectionist global trading environment.”\nHoughton and Sunderland South MP Bridget Phillipson has tweeted: “Another day, another warning from business. Investment in Britain’s car industry has fallen by half with thousands of jobs at risk as ministers refuse to listen. SMMT make clear time is running out.”\nSedgefield MP Phil Wilson added: “The trickle of companies going public about the risks they face from Brexit is becoming a flood. This stark warning from the car industry that they need frictionless trade with Europe to avoid haemorrhaging highly-skilled jobs is simply too important for squabbling government ministers to continue to ignore.\n“The car industry in this country either employs directly or supports the jobs of nearly a million people, in every corner of the UK, including 6,500 jobs at Nissan in the Northeast with around 30,000 more in the supply chain. It is a huge and crucial sector of our economy that must not be sacrificed on the altar of a hard Brexit.” Read More Tech firm ITPS to create new jobs following £3m finance deal to fuel expansion\nConcerns over the handling of the Brexit negotiations were also echoed by the manufacturers’ association EEF, which called for more action to be taken by the Government to improve trade.\nA spokesman for the EEF said: “These figures are not surprising and are the inevitable consequence of the increasing uncertainty around what our future relationship with the EU will look like.\n“The Automotive Sector and the supply chain are critically important to the future of manufacturing and the jewels in the crown of our economy. The clock is now ticking ever faster and we urgently need Government to set out how it is going to achieve a deal that brings frictionless trade to a deal with the EU.”\nCar giant BMW has also aired concerns over the future of the motoring industry post-Brexit. The German giant employs around 8,000 people in the UK, with its plant in Oxford producing the popular Mini range.\nBut senior director Stephan Freismuth said delays in importing components would put the operation under serious threat, potentially forcing UK closures. Read More World's largest asset manager in £20m Quorum Business Park refinance deal\nNorth East Automotive Alliance Paul Butler said the SMMT’s figures needed to be taken into context, arguing that the UK automotive sector has received record levels of investment since 2010.\nHe said: “But could more be done? Undoubtedly yes, the UK needs incentives similar to those available on the continent to allow us to compete on a level playing field. Then the investment decisions come down to supply chain competitiveness and the productivity of the workforce and I’m sure the NE and the wider UK would win more than its fair share of investment, after all we do have the most productive automotive sector workforce in Europe.”\nThe news comes after plane manufacturer Airbus warned it could also pull out of the UK with the loss of thousands of jobs if Britain crashes out of the EU without a deal.\nA Nissan spokesman said: “Nissan continues to work with the UK government to ensure the company’s long-term success and investment in the UK.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-26T14:47:00.000+03:00", "crawled": "2018-06-26T16:05:46.068+03:00", "highlightTitle": ""}