{"organizations": [], "uuid": "51e91e5982c7b4a9bd76dc5172e77e1cb7eb206f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1604032.ece/ALTERNATES/s1200/EMA-new-MD-Karen-Smart.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/east-midlands-airport-boss-backs-1642573", "country": "GB", "domain_rank": 48128, "title": "East Midlands Airport boss backs UK commitment to regional airports after Heathrow expansion go-ahead", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-05T17:36:00.000+03:00", "replies_count": 0, "uuid": "51e91e5982c7b4a9bd76dc5172e77e1cb7eb206f"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/east-midlands-airport-boss-backs-1642573", "ord_in_thread": 0, "title": "East Midlands Airport boss backs UK commitment to regional airports after Heathrow expansion go-ahead", "locations": [], "entities": {"persons": [{"name": "alistair langham", "sentiment": "negative"}, {"name": "sha", "sentiment": "negative"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "new east midlands airport", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "department for transport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New East Midlands Airport MD Karen Smart is flying high (Image: Alistair Langham- The Studio 17) Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe new boss of East Midlands Airport has welcomed a Government commitment to regional airports, following the decision to allow a third runway to be built at Heathrow.\nAs well as announcing the London plans the Department for Transport today published a document showing how it wanted to \"make the best use of existing runways\".\nIt said the Government was \"minded to be supportive of all airports who wish to make best use of their existing runways... subject to environmental issues being addressed.\"\nIt added: \"Therefore the government is supportive of airports beyond Heathrow making best use of their existing runways.\n\"However, we recognise that the development of airports can have negative as well as positive local impacts, including on noise levels.\n\"We therefore consider that any proposals should be judged by the relevant planning authority, taking careful account of all relevant considerations, particularly economic and environmental impacts and proposed mitigations.\" Read More\nManagement at East Midlands Airport have said previously they want to double passenger numbers by 10 million a year within 20 years or less.\nThe airport also hopes to triple freight shipments to one million tonnes a year within 10-20 years.\nKaren Smart, managing director of the Castle Donington airport, said: \"We welcome the government’s commitment to unlock the potential of regional airports to make best use of existing capacity.\n\"It is vital for the UK economy that the there is support for airports like East Midlands that can deliver greater access to world markets.\n\"As the region’s global gateway, EMA plays a critical role in getting people and products to overseas markets.\n\"As the country’s busiest airport for dedicated cargo traffic, it is already a key driver of the UK economy. Read More Hundreds of jobs could be created with latest addition to massive Leicestershire distribution park\n\"Further investment in the airport would help meet the demand for growing connectivity to global markets over the next decade at a time when other major airports will run out of capacity.\n\"This would benefit both the UK as a whole, and stimulate regional imports and exports and local business growth.\n\"The Government must now match its support for Heathrow with specific and practical proposals to maximise EMA’s global connectivity in the period to 2030, including support for better rail connectivity serving East Midlands Parkway, and backing regional transit infrastructure to link the proposed HS2 Toton to the airport.\" A plane lands at Heathrow Airport in west London (Image: PA)\nAfter years of discussions and arguments the decision to build a new runway at Heathrow was approved at a meeting of ministers on the Cabinet's economic sub-committee.\nMPs will be given a vote on the scheme by early July. Read More The £35m plan to build complex to house precious Leicestershire artefacts\nTransport Secretary Chris Grayling told the Commons: \"Today I am laying before Parliament our final proposal for an Airports National Policy Statement (NPS) which signals our commitment to securing global connectivity, creating tens of thousands of local jobs and apprenticeships, and boosting our economy for future generations by expanding Heathrow Airport.\"\nHe added: \"My department has met with local residents and fully understands their strength of feeling, but this is a decision taken in the national interest and based on detailed evidence.\"\nMr Grayling told MPs: \"The time for action is now.\n\"Heathrow is already full and the evidence shows the remaining London airports won't be far behind.\n\"Despite being the busiest two-runway airport in the world, Heathrow's capacity constraints means that it is falling behind its global competitors, impacting the UK's economy and global trading opportunities.\n\"Expansion at Heathrow will bring real benefits across the country including a boost of up to £74 billion to passengers and the wider economy.\n\"This is a project with benefits which reach far beyond London.\" Going places - new East Midlands Airport MD Karen Smart (Image: Alistair Langham- The Studio 17)\nMr Grayling acknowledged the concerns of people living around the airport, but said there was a £2.6 billion package for local communities towards the costs of compensation, noise insulation and improvements to public amenities.\nHe said the scheme - including £700 million for noise insulation for homes and £40 million to insulate schools and community buildings - was comparable \"with some of the most generous in the world\".\nScott Knowles, chief executive at East Midlands Chamber also welcomed the Heathrow news. Read More UK's second ever drive-thru Greggs set to open in Leicestershire - and it'll be 24 hour\nHe said: \"From the moment that airports expansion was mooted, the Chamber has supported growth at Heathrow in preference to either Gatwick or Stansted.\n\"Heathrow is better located for the country and is one the most popular among our members for passenger travel.\n\"However, we have also said throughout that alongside the provision a third runway there needs to be investment in road and rail connectivity to the airport from the East Midlands and the north of the country generally and we will continue to petition for this.\n“While understanding and, to some extent, accepting the London-centric focus of planners and the desire to increase capacity at one of the busiest airports in the world, we maintain that there are distinct advantages to be gained from encouraging long-haul operators to use regional airports, opening up wider international opportunities for regional businesses. Read More Results of vote on changing school term times in Leicestershire revealed\n\"We will continue to urge Government to realise this capacity, especially during what will be a lengthy construction period.\n“Heathrow has a huge supply chain involving thousands of companies and organisations all over the country which, in turn, sustains thousands of jobs here in the East Midlands and beyond.\n“The expansion at the airport will create a raft of opportunities for further jobs creation and here in the East Midlands we have hundreds of businesses more than ready to step up to be part of the supply chain for this nationally-important infrastructure project that will show the world that UK plc is open for business despite Brexit.”\nLast month Karen Smart told the Leicester Mercury she wanted to make East Midlands the go-to airport for business people wanting to avoid the hustle and bustle of Gatwick and Heathrow.\nMrs Smart, who became managing director in April, said she wants to make more of the underused East Midlands Parkway railway station, and is lobbying the Department for Transport to up the number of services stopping there.\nOn top of that she wants to build stronger links with European hub airports such as Frankfurt and Berlin to connect the region to the biggest global markets. Karen Smart will replace Andy Cliffe at the Castle Donington airport next month\nMrs Smart said she would even like to create a college on the Castle Donington airport campus to train up the next generation of airport workers and staff for the neighbouring Pegasus Business Park, growing UPS, DHL and Royal Mail operations and the £700 million East Midlands Gateway logistics park being build on a vast site to the north.\nShe said: “Heathrow and Gatwick are full and Stansted is filling up fast so there is an opportunity for Londoners to come up on the Midlands Mainline to Parkway. Read More\n“We also want to encourage staff to come from areas they may not be travelling from now and the station could play a part in that.\n“Parkway is a fabulous station, but it’s all about having reliable transport at the right time. Read More\n“We are working with the Department for Transport for London in the run-up to the new franchise and want more frequent trains.\n“Another issues is that last mile of getting from the station to the airport.” Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-06-05T17:36:00.000+03:00", "crawled": "2018-06-05T17:59:31.009+03:00", "highlightTitle": ""}