{"organizations": [], "uuid": "d7ec1ee891283b043ecb8d86a66dd54ebb474721", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13329406.ece/ALTERNATES/s1200/Theresa-May-interview.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/uk-news/brexit-vote-mps-live-updates-14773839", "country": "GB", "domain_rank": 21960, "title": "Brexit vote LIVE: MPs to make crucial EU withdrawal vote at Westminster", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-12T13:35:00.000+03:00", "replies_count": 0, "uuid": "d7ec1ee891283b043ecb8d86a66dd54ebb474721"}, "author": "Jonathan Walker-NEC", "url": "https://www.chroniclelive.co.uk/news/uk-news/brexit-vote-mps-live-updates-14773839", "ord_in_thread": 0, "title": "Brexit vote LIVE: MPs to make crucial EU withdrawal vote at Westminster", "locations": [], "entities": {"persons": [{"name": "ms soubry", "sentiment": "none"}, {"name": "soubry", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "john bercow", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "north east labour", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "westminster 13:13 jonathan walker the government", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu withdrawal bill", "sentiment": "none"}, {"name": "jonathan walker north east labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "14:51 Jonathan Walker\nSir Edward Leigh says there are many things he doesn’t understand about the Brexit negotiations. Max Fac, backstop, etc.\nBut Parliament musn’t go against the decision of the people to leave the EU, he says. 14:49 Jonathan Walker\nBackbench pro-Brexit Conservative MP Sir Edward Leigh says the House of Lords has tried to “frustrate” Brexit.\nHe says if the House of Lords had their way “it would be a catastrophe for the Government”.\nBut more importantly, those who support the House of Lords are dressing up their arguments in terms of Parliamentary sovereignty ... but what they really want to do is create a situation in which the whole process is frustrated.”\nHe says the decision to leave the EU has already been taken and every MP should accept it. 14:38 Negotiations are taking place inside the Chamber\nWhile the debate continues, Tory whips are holding quiet talks with MPs 14:19 Jonathan Walker\nConservative MP Ken Clarke is now speaking and backing the Lords plan for a “meaningful vote”. In other words, he’s disagreeing with the Government.\nHe insists that the proposal would not strip the Government of control of the Brexit process, as the Government claims. 13:51 Jonathan Walker\nLabour MP Frank Field says that some MPs actually want to prevent Brexit.\nHe says: “In this house spme people have been quite clear thy want to prevent Brexit. Others disguise that fact”\nHe says some members of the House of Lords were at least honest enough to say that they did want to stop Brexit.\nLabour Shadow Brexit Minister Matthew Pennycook insists that the Labour front bench, in backing Lords amendments, is not trying to block Brexit. 13:48 Jonathan Walker\nLabour Shadow Brexit Minister Matthew Pennycook says the amendment to give Parliament a “meaningful vote” on the final Brexit deal is in many ways the “most important” amendment to be discussed. 13:47 Jonathan Walker\nThe first vote taken by MPs was on the timetable for debates about the EU Withdrawal Bill. The Government wanted to have debates today and Wednesday, with six hours each day.\nLabour opposed this, saying the Commons should have more time.\nThere was a vote, which the Government won. But the division list showed two Tory MPs - Ken Clarke and Anna Soubry - rebelled to vote against the two-day timetable to consider Lords amendments in the Commons. Two Labour MPs - Kate Hoey and Frank Field - rebelled to vote in favour of the timetable. 13:44\nMatthew Pennycook, a Labour Shadow Brexit Minister, is now responding for Labour 13:38 David Davis says some of the Government's critics want to stop Brexit\n“They want to reverse the result of the referendum” says David Davis, the Brexit Secretary 13:36 Jonathan Walker\nLabour MP Frank Field says that if the Commons defeats the Government on the “meaningful vote” then the UK “will be sending our negotiators back naked into the negotiating room”.\nThe EU would know that the Government has been “beaten”, he says. 13:34 Jonathan Walker\nDavid Davis says the Lords’ call for a “meaningful vote” is an “unconstitutional shift which risks undermining our negotiations with the European Union”.\nHe says it would allow Parliament to “dictate” the Government’s negotiating position.\nSome MPs shout “what’s wrong with that?”\nLabour MP Chuka Umunna intervenes and says the proposal simply reasserts the authority of Parliament.\nThe Lords added the “meaningful vote” amendment to the EU Withdrawal Bill, and the Government is today asking MPs in the House of Commons to delete it. 13:23 Jonathan Walker The debate begins\nBrexit Secretary David Davis says this Bill has “a simple, clear purpose” - which is to ensure UK laws make sense on the day we leave the EU.\nHe points out that “exit day” will be determined by international law, rather than by an act of Parliament. (As things stand, the UK will exit the EU on March 29 2019). 13:13 Jonathan Walker\nThe Government has won a vote. MPs voted by 321 to 304 to accept the Government’s timetable for debate of the EU Withdrawal Bill.\nThat means six hours of debate today and six hours of debate tomorrow. 13:11 Jonathan Walker North East Labour MEPs back second referendum\nNorth East Labour MEPs are backing a second referendum on Brexit. This is not Labour policy. 13:09 Jonathan Walker Are MPs scared to vote for what they believe?\nTory former minister Anna Soubry has told MPs that she is aware of at least one colleague who will not vote with their conscience on the Brexit bill for fear of reprisals.\nMs Soubry, who is a Remainer and has herself been a target of abuse, told the House of Commons: “To my knowledge at least one honourable member on these benches will today and tomorrow not vote in accordance with their conscience because of threats to their personal safety, to members of their parliamentary staff and members of their family.”\nMs Soubry asked Speaker John Bercow if he would condemn the abuse that has been meted out to MPs in the course of the Brexit bill’s passage. 12:46 Jonathan Walker Labour MP Chuka Umunna condemns newspaper headlines\nLabour MP Chuka Umunna has raised a “point of order” in the Commons complaining about newspaper headlines.\nHe also Tweeted about this last night. 12:41 Jonathan Walker Theresa May says losing today's votes would weaken her position in Brussels\nTheresa May has told senior ministers that votes over the coming two days on the EU Withdrawal Bill were ‘’important in terms of the message they send to Brussels’’, her spokesman told reporters.\nSpeaking at the regular weekly meeting of Cabinet in Downing Street, Mrs May said: ‘’Anything that undermines the Government at home will make negotiations with the EU more difficult.’’ 12:07 Jonathan Walker Labour leader Jeremy Corbyn faces a rebellion over the single market\nLabour MP Phil Wilson has made it clear he will rebel in a vote on Wednesday over membership of the European Economic Area.\nThis is a group of countries that are in the EU Single Market. In practice, it’s a vote about staying in the single market.\nBoth Labour and the Conservatives have a policy of leaving the single market but somehow retaining all the benefits of membership.\nSome Labour MPs believe this just won’t work - and will disobey orders from their leader, Jeremy Corbyn, by voting in favour of European Economic Area (EEA) membership. Sedgefield MP Phil Wilson (Image: Unknown)\nMr Wilson highlighted research which found failing to join the European economic area would cost the North East £1.1 billion a year and the UK as-a-whole more than 300,000 jobs by 2030.\nHe said:\nIf we are outside of the single market and not in the EEA, our future will be to rub along the borders of the EU seeking continuous frictionless realignment. Far from being frictionless, sparks will fly as regions of the UK, such as the North East of England, suffer the economic consequences of not being part of the single market. Even the government’s own economic impact assessment show there will be negative consequences.\nOpen Britain estimate that leaving the EEA will cost the region £1.1bn every year by 2030. That would be like losing the pits a second time.\nThe EEA is the only available option that mitigates the worst excesses of Brexit. I will be supporting the Lords amendment because the UK economy will suffer enough from the disruption to come and our priority should now be to minimise risk.\nI fundamentally do not believe people voted to leave the EU to make themselves poorer.\nThat means taking the only available way of staying in the single market.\nThe only alternative to access to the single market outside of the EEA will be through a free trade agreement as a third country, which will never give us rights and benefits comparable to those we have now. 12:01 Jonathan Walker Theresa May avoids showdown over Customs Union\nThe Prime Minister appeared to have defused a potentially explosive row over the EU customs union on Monday night as Tory pro-Europe rebels Sir Oliver Letwin and Nicky Morgan and Brexiteers Jacob Rees-Mogg and Sir Bill Cash came together to table a separate compromise amendment backing “a customs arrangement” with the EU.\nGovernment sources signalled to the Press Association that ministers were set to back the move.\nHowever, the compromise is only likely to delay a full-blown showdown on the customs union until trade legislation returns to the Commons in July. 12:00 Jonathan Walker Brexit Secretary David Davis pleads for unity\nBrexit Secretary David Davis has issued a plea to potential Tory rebels, warning that they cannot undo the EU referendum, PA reports.\n“A meaningful vote is not the ability to reverse the decision of the referendum, he told BBC Radio 4’s Today.\n“We will put in front of Parliament the decision for them to vote ... after that there will be a process of primary legislation to put the actual details of it in Parliament, so Parliament will actually decide on the application of the detail.”\nAsked what would happen if they voted against the deal, he said: “If they throw it out, well, they throw it out. We will have to go away, think about it and come back and make a statement, which is what I am saying to the House this afternoon.” Brexit Secretary David Davis (Image: Getty Images Europe) 11:57 Here's the statement from Phillip Lee, the Minister who resigned over Brexit\nJustice Minister Phillip Lee has resigned from the Government.\nHe said:\nOur Parliament should be able to direct our Government to change course in our interests.\nIn all conscience, I cannot support the Government’s decision to oppose this amendment because doing so breaches such fundamental principles of human rights and Parliamentary sovereignty.\nA vote between bad and worse is not a meaningful vote. And I cannot bring myself to vote for it in the bastion of liberty, freedom and human rights that is our Parliament\nIf Brexit is worth doing, then it is certainly worth doing well; regardless of how long that takes. It is, however, irresponsible to proceed as we are.\nIt’s clear from what he said that he’s concerned about proposals to give MPs a “meaningful vote” about Brexit.\nUnder the Government’s plans, MPs will have a vote on the final Brexit deal. This will probably happen in October.\nBut they’ll only get to choose between accepting the deal or leaving the EU without any deal at all.\nSome MPs say that’s not good enough. They say that if they reject the deal then they should be able to tell the Government what to do next. 11:53 Government Minister resigns over Brexit\nTheresa May has suffered a ministerial resignation ahead of the crunch Commons votes on Brexit.\nPhillip Lee quit as a justice minister and issued a statement hitting out at the Government’s “irresponsible” approach, and demanding a second referendum on Brexit. Bracknell MP Dr Phillip Lee who has resigned as a justice minister.\nHe resigned so that he would be able to go against the Government in a key vote later.\nMPs will consider proposals to give the House of Commons and House of Lords a “meaningful vote” on the final Brexit deal - and to allow them to take control of negotiations with the EU.\nThe Government opposes this but Dr Lee signalled he would support it.\nAnd he also called for a second EU referendum, giving voters a chance to reject or support the final Brexit deal.\nHe said: “When the Government is able to set out an achievable, clearly defined path, one that has been properly considered, whose implications have been foreseen, and that is rooted in reality and evidence, not dreams and dogma, it should go to the people, once again, to seek their confirmation.” 11:51 Jonathan Walker The key amendment being debated today\nHere’s the most difficult vote facing the Government. The vote today will be on whether to delete this amendment. 11:48 Here's the timetable for today and tomorrow\nHere’s roughly what we can expect, although it’s subject to change:\nToday, Tuesday\nThe debate begins around 1pm. There is three hours set aside for the first group of amendments, which are on: so called ‘Henry VIII powers the exit date Meaningful vote Future EU laws\nThese are amendments that have been added to the Bill by the House of Lords, and the Government is asking the Commons to delete them.\nVotes on these amendments take place around 4pm.\nThe Commons then moves to a second group of amendments, which are on the topic of devolution and the role of devolved governments.\nVotes on these take place around 7pm.\nWednesday\nOn Wednesday, providing there are no Urgent Questions or Statements, we expect the debate to begin at around 13:00.\nThere will be debates on amendments related to: Customs Union membership European Economic Area and internal market membership# Citizens’ EU legal rights EU Charter of Fundamental Rights Protecting the environment\nVotes on all these issues take place around 7pm More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14773839;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-12T13:35:00.000+03:00", "crawled": "2018-06-12T15:21:34.000+03:00", "highlightTitle": ""}