{"organizations": [], "uuid": "4048aa59437a1da86cf588ce0e16a0496a21b78b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14767292.ece/ALTERNATES/s1200/TMP_NEC_250318AntiBrexitRally14JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-businesses-look-relocate-14762169", "country": "GB", "domain_rank": 21960, "title": "North East businesses look to relocate to Europe as Brexit nears, report finds", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-11T02:01:00.000+03:00", "replies_count": 0, "uuid": "4048aa59437a1da86cf588ce0e16a0496a21b78b"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-businesses-look-relocate-14762169", "ord_in_thread": 0, "title": "North East businesses look to relocate to Europe as Brexit nears, report finds", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East businesses look to relocate to Europe as Brexit nears, report finds The region's largest business organisation has also advised firms to review any expansion plans Share An anti Brexit rally at the Monument attended by a large crowd (Image: Newcastle Chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nSome North East businesses are looking to relocate to Europe as they prepare for Brexit while others are being advised to review any expansion plans, research by the region’s largest business organisation has found.\nThe North East England Chamber of Commerce has surveyed members before launching a ‘ Brexit toolkit’ to help companies be as ready as possible for the country leaving the EU.\nThe Chamber research found concerns among businesses over foreign markets, the availability of labour, regulatory issues and access to finance. Read More Three North East firms among first to sign up to Social Mobility pledge\nNow firms in the region - which leaked Government research said would be the hardest hit by Brexit - are being urged to get themselves as prepared as possible for the disruption that Brexit will bring.\nThe Brexit toolkit, which the Chamber has prepared with Newcastle legal firm Square One Law, highlights how access to finance will change significantly after Brexit as there will not be EU programmes such as the Jeremie scheme, which has supported hundreds of North East companies.\nAs a result, the Chamber is advising companies in the region to pay off any outstanding debt where possible, and to review any development and expansion plans for the next five years.\nThere are also concerns that the potential loss of skilled EU workers, and fewer European students at North East universities, will worsen the region’s skills gap and reduce the talent pool of graduates coming into the workforce. James Ramsbotham, North East England Chmaber of Commerce (Image: Handout)\nChamber chief executive James Ramsbotham said: “What is very clear from our research is how far-reaching the impact of Brexit will be in our region.\n“It will have impact on everyone from our international retailers who will have to cope with major currency uncertainties for imports and exports and even our football clubs who may be affected by the Bosman law where players can get a free transfer towards the end of their contract.\n“The likely new bureaucracy post-Brexit will be a very difficult minefield for many businesses who have enjoyed frictionless trade with the EU. We hope this toolkit gives them the essential tips for successful exporting going forward.” Neil Warwick (Image: Handout)\nNeil Warwick, head of EU and competition law at Square One Law, said: “We know that Brexit is very fluid at the minute with the EU Withdrawal Bill coming back to the Commons this week and the crucial EU Council in a month’s time and it is understandable that businesses are uncertain about what to do.\n“However time is potentially running out and we would advise that it is essential that businesses have a contingency plan, even if they are not yet ready or willing to implement it.”\nThe Chamber is recommending companies carry out audits of their workforce and the skills needed for the next five to 10 years, as well as identifying the skills of their current teams.\nIt has also raised concerns over potential tariffs, pointing out that some products can have more than 1,000 components in them that could have a range of tariffs on each one. Read More Poundworld to appoint risk\nThe new report comes less than a week after an unprecedented coalition of regional business leaders said the North East had lost its position as an exporting region and that businesses had lost work to European competitors because of the Brexit vote.\nThe North East Brexit Group – which is made up business groups, unions, universities and charities – called on the Government to maintain access to the European Single Market but this was immediately rejected by the Department for Exiting the EU. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-11T02:01:00.000+03:00", "crawled": "2018-06-11T12:33:23.001+03:00", "highlightTitle": ""}