{"organizations": [], "uuid": "4a5137eb7ff1c7caeb72583fc618619b26ac25b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14812085.ece/ALTERNATES/s1200/Heathrow-expansion.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-mp-urges-labour-colleagues-14812048", "country": "GB", "domain_rank": 21960, "title": "Newcastle MP urges Labour colleagues to support Heathrow third runway plans", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-21T18:00:00.000+03:00", "replies_count": 0, "uuid": "4a5137eb7ff1c7caeb72583fc618619b26ac25b1"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-mp-urges-labour-colleagues-14812048", "ord_in_thread": 0, "title": "Newcastle MP urges Labour colleagues to support Heathrow third runway plans", "locations": [], "entities": {"persons": [{"name": "catherine mckinnell", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "greg hands", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "news newcastle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "invalid email newcastle", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle MP urges Labour colleagues to support Heathrow third runway plans Labour opposes a third runway at the airport but is allowing MPs to have a free vote on the matter Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNewcastle MP Catherine McKinnell has confirmed she will back a third runway at Heathrow when the Commons votes on Monday.\nLabour is opposing the expansion, but will give its MPs a “free vote”, which means they are allowed to disobey the party line.\nMs McKinnell, MP for Newcastle North, urged Labour colleagues to do just that, saying: “I would strongly urge my colleagues to also back the North East by backing Heathrow expansion next week.”\nThere are divisions within both major parties and the battle over whether to expand the London airport took a dramatic turn as Conservative MP Greg Hands announced he was resigning from his role as a trade minister. MP Catherine McKinnell (Image: Newcastle Chronicle)\nHe said he intends to vote against the expansion, which is backed by the Government.\nIn a bid to rally support for the scheme, the Department for Transport announced that it would reserve some slots at Heathrow for domestic flights.\nMinisters said they wanted about 15% of the new capacity to be used for flights linking Heathrow with regional airports, ensuring that the economic benefits of expansion stretch beyond London and the South East.\nAviation Minister Baroness Sugg said: “Heathrow is situated in the South East of England, but the benefits of expansion will be felt throughout the UK.\n“About 15% of the new capacity will be used for flights to destinations within the UK or Crown Dependencies. Aviation Minister Baroness Sugg at Newcastle Airport (Image: Newcastle Chronicle)\n“And now we are going even further by confirming that the UK Government will act to protect domestic flights from Heathrow for the first time.”\nThe Government said it would use Public Service Obligations to protect routes between Heathrow and airports in nations and regions around the UK. Read More Theresa May wins Brexit vote after Conservative rebels back down\nThis would also exempt them from Air Passenger Duty, which comes to £26 per passenger per return flight.\nIt also confirmed that Scotland can expect to benefit from an extra 100 flights a week to and from Heathrow if a third runway is built, in a move likely to firm up SNP support for a third runway. A plane lands at Heathrow Airport (Image: PA)\nMr Hands is not the only Conservative to oppose expanding Heathrow. Justine Greening, a former Transport Secretary, claimed this week that it would actually mean fewer international flights from regional airports such as Newcastle International.\nBoris Johnson, the Foreign Secretary, has been a staunch opponent of a third runway, but appears set to miss the vote thanks to a summit taking place in Luxembourg at the same time.\nThere is a danger that Mr Hands’s decision to resign and take a stand over the issue will make Mr Johnson look rather faint-hearted by comparison.\nMs McKinnell said: “Delivering additional aviation capacity is one of the most pressing infrastructure issues we face as a country – and will be critical in shaping the future of the UK economy, particularly given the quite obvious challenges of Brexit in the years to come.\n“I’ve long made the case that the decision on how this takes place must be taken in the interests of the whole of the country, including our region.\n“And I firmly believe that expanding Heathrow is the right strategic decision for both the North East and the rest of the UK.\n“That’s also the firmly-held view of both the North East Chamber of Commerce a nd Newcastle International Airport, as well as the TUC and Unite and GMB trade unions nationally. Read More Heathrow third runway plan safe as Labour says it will give MPs a 'free vote'\n“Creating additional capacity is crucial for the North East to secure its connectivity to Heathrow and therefore the rest of the world, it will create around 5,000 jobs in our region alone – and I’ll continue to work closely with others to help secure one of Heathrow’s logistics hubs here in the North East with all the benefits that would bring.”\nAndy McDonald MP, Labour’s Shadow Transport Secretary, said: “Labour opposes a third runway at Heathrow because it doesn’t meet our 4 tests and we are calling for a free vote for all parties on Monday.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-21T18:00:00.000+03:00", "crawled": "2018-06-21T18:30:48.017+03:00", "highlightTitle": ""}