{"organizations": [], "uuid": "711311d66cf90616301cf8264eb99b3697add65d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14767296.ece/ALTERNATES/s1200/KOR_NJL_071116james_01JPG.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-businesses-exasperated-brexit-14818633", "country": "GB", "domain_rank": 21960, "title": "North East businesses are 'exasperated' by Brexit talks, PM is told", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-25T02:01:00.000+03:00", "replies_count": 0, "uuid": "711311d66cf90616301cf8264eb99b3697add65d"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-businesses-exasperated-brexit-14818633", "ord_in_thread": 0, "title": "North East businesses are 'exasperated' by Brexit talks, PM is told", "locations": [], "entities": {"persons": [{"name": "james ramsbotham", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "north east england cham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "business north east", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "commerce", "sentiment": "none"}, {"name": "north east england chmaber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East businesses are 'exasperated' by Brexit talks, PM is told North East England Chamber of Commerce has written to Theresa May to highlight concerns over Government's progress with Brexit Share James Ramsbotham, North East England Chmaber of Commerce (Image: Handout) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBusinesses in the North East are “exasperated” with the Government’s handling of Brexit as they lose skilled staff and investment, the Prime Minister has been told.\nTheresa May has been lambasted by the head of the North East England Chamber of Commerce, the region’s largest business organisation, who has described the Government’s progress with Brexit negotiations as “poor”.\nChamber CEO James Ramsbotham has written a stinging letter to the Prime Minister to highlight the concerns North East businesses have raised over Brexit.\nIt comes after a number of reports highlighted the North East as the region most likely to lose out from leaving the EU, with the region’s crucial automotive industry seen as being particularly at risk if tariffs are put on UK exports and imports.\nMr Ramsbotham said: “Whilst we have accepted the referendum result, our members are exasperated at the lack of tangible progress towards a positive deal which is clearly hindering business planning. British Prime Minister Theresa May (Image: Getty Images Europe)\n“While our regional economy currently remains robust, we regularly hear about lower investor confidence, projects being delayed and skilled workers leaving for other countries due to uncertainty over our future business landscape. This is being compounded by a lack of clarity from Government over its own preferred approach to Brexit.\n“At the heart of this lies woefully underwhelming levels of engagement and consultation by Government with local businesses. There are perfectly valid fears among our exporters that the Government’s stance on the Customs Union and Single Market will only serve to harm our ability to trade with our biggest export market.” Read More House of Fraser rescue deal means Metrocentre store is saved - for now\nThe North East economy has the potential to be adversely affected by Brexit as 62% of the region’s exported goods are shipped to the EU.\nThe Government’s own analysis says the North East economy will shrink by between 11% and 16% depending on whether the UK can strike a trade deal with Europe, while the House of Commons Business Committee has warned of huge damage to the region’s automotive sector if the UK loses access to the EU single market.\nThe Chamber has also reminded the Government of a manifesto commitment to close the gap between London and regions like the North East, which it described as “the biggest prize in Britain today.”\nMr Ramsbotham said: “We presume the Government believes the ultimate outcome of the Brexit negotiations will both be better overall and significantly better for North East England, given its manifesto commitments.\n“However, we’re yet to see any firm evidence on which to base this view. We have repeatedly heard Chamber member views raised by regional MPs in the House of Commons, but are yet to receive a sufficient answer in that place, or a response to the Chamber directly. Read More Sage's UK boss Alan Laing leaves software firm a year after MD appointment\n“How can we expect North East businesses to gain reassurance, when Government fails to address their legitimate concerns?”\nThe letter has been sent to Mrs May ahead of the European Council meeting this week. The Chamber has also produced a Brexit toolkit to help its members tackle issues such as how to access new markets, hire staff, and gain finance after Brexit. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-25T02:01:00.000+03:00", "crawled": "2018-06-25T03:16:43.027+03:00", "highlightTitle": ""}