{"organizations": [], "uuid": "190f63843962465430d3d0b0dc391ad01af55bb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14446850.ece/ALTERNATES/s1200/DPP_SAH_WL180142_109JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14823472", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Heathrow vote is 'biggest transport decision in a generation'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-25T10:00:00.000+03:00", "replies_count": 0, "uuid": "190f63843962465430d3d0b0dc391ad01af55bb5"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14823472", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Heathrow vote is 'biggest transport decision in a generation'", "locations": [], "entities": {"persons": [{"name": "jonathon manning uk", "sentiment": "negative"}, {"name": "nick south", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "barcelona.the uk", "sentiment": "none"}, {"name": "bcg", "sentiment": "none"}, {"name": "boston consulting group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning UK tumbles in list of most desirable countries to work in\nThe UK has fallen from second to fifth in a global study of the most desirable country to work in.Research conducted by the Boston Consulting Group (BCG) and totaljobs has revealed the slip on the table, which is thought to have occurred as a result of the Brexit vote two years ago.\nThe US, Germany, Canada and Australia now all rank higher than Britain in terms of attractiveness, a survey of 400,000 workers in 200 countries discovered.London was said to be the most desirable city for overseas workers worldwide - beating New York, Berlin and Barcelona.The UK’s popularity fell particularly among European countries, as well as the UAE and China.The study also found that more UK residents than ever before are prepared to move abroad for work. Almost two thirds said they were open to working overseas, compared to 44% in a previous study in 2014.Nick South, of the Boston Consulting Group, said:\nThis research demonstrates the scale of the talent challenge facing organisations in the UK.\nDespite London’s enduring appeal, the UK as a whole has become less attractive to international workers.\nAt the same time, British workers’ willingness to work abroad has significantly increased.\nTogether, these two talent trends create a major challenge for the UK. It is critical for UK private and public sector organisations to get on the front foot and proactively take steps to attract and retain top class talent to ensure their future success. The London Eye Jonathon Manning Countrywide shares slump as estate agent warns over subdued market\nShares in Countrywide tumbled after the troubled estate agency warned over profits and said it will raise fresh funds to cut debt.The group - Britain’s biggest listed estate agency and owner of brands including Hamptons and Bridgfords - said on Monday that the property market in the first half has continued to be “subdued” as it continues to experience longer transaction cycles.As a result, it now expects interim earnings to come in at around £20m lower than last year and does not expect the shortfall to be recovered in the second half.Shares crashed 25% on the news.Countrywide also said that it is looking to put in place a “long term capital structure” to support a turnaround plan.The group wants to reduce debt by at least 50% through additional equity finance.Its major shareholder, Oaktree, and the company’s lenders are supportive of the plan, the firm said.In March, Countrywide’s shares also slumped after the company swung to an annual loss and warned over further pain to come in 2018.At the time it said it was going “back to basics” after what it described as three years of under-performance in its main sales and lettings business.It is axing around a third of its 450-strong central office team as part of cost-cutting efforts to help turn around its fortunes.Countrywide said:\nThe market in the first half has continued to be subdued and we have experienced longer transaction cycles.\nOur focus remains on building back the sales pipeline and we expect to substantially close the pipeline gap by the end of the year. Countrywide (Image: PA) Jonathon Manning House of Fraser rescue deal means Metrocentre store is saved - for now\nA deal that saves House of Fraser’s Metrocentre store has been given the green light.\nThe struggling retail chain had put forward plans earlier this month to shut 31 of its 59 outlets through a Company Voluntary Arrangement (CVA), which will also allow it to secure rent reductions on its remaining shops.\nClosures will affect up to 2,000 House of Fraser staff and a further 4,000 across brands and concessions. Stores in Middlesbrough and Darlington were among those earmarked for closure.\nHouse of Fraser boss Alex Williamson had warned that the store closures and job losses represented the “last viable” option to save the retailer, with the group at risk of entire collapse had the CVA been rejected.\nNow the company has secured the backing of more than 75% of creditors, including landlords, for the CVA.\nIt was voted through despite anger among landlords, who have complained that they are being forced to stomach a financial hit at the same time as House of Fraser enjoys new investment.\nAlongside the CVA, Hamleys owner C.banner is being lined up to buy a 51% stake in the firm and invest £70m into what remains of the business.\nAt the meeting, furious landlords berated House of Fraser’s management and their advisers at KPMG over how the CVA was conducted.\nThey complained that their share of the vote had been structured unfairly in an attempt to push through the restructuring proposal.\nDespite their protestations, a representative for two of House of Fraser’s landlords said there had been “no give” from the top team.\nMr Williamson and chairman Frank Slevin were both in attendance at the creditor vote.\nHouse of Fraser said the shops earmarked for closure, including its Oxford Street store, would remain open until early 2019.\nThe group also plans to relocate its Baker Street head office and the Granite House office in Glasgow to help slash costs and “secure House of Fraser’s future”. House of Fraser at the Metrocentre, Gateshead (Image: Publicity Picture) 9:05 KEY EVENT Rail boss David Horne insists his appointment at LNER is 'right thing to do'\nThe former boss of failed rail franchise Virgin Trains East Coast (VTEC) has defended his appointment of its publicly owned replacement as the right thing to do”.\nDavid Horne was managing director of VTEC before the franchise failed but has been given the same title at London North Eastern Railway - its nationalised replacement.LNER began operating the vital route between London and Scotland on Sunday after VTEC’s deal to pay the Government £3.3bn to run services was ended early because the bid was too ambitious.In an interview with the Press Association, Mr Horne insisted that he “was not involved” in the 2013/14 bidding process that saw the franchise over promise and under deliver on its service.\nHe said:\nIn these circumstances, it’s absolutely the right thing to do.\nHe explained that stability and continuity are “really important” for LNER.\nThe fact I’m transferring and everybody in the company is transferring will give us stability so we can remain focused on ensuring that we continue to deliver a successful train service for our customers.\nWith the transition date only announced by Transport Secretary Chris Grayling on May 16, LNER has had “a really short period of time to prepare”, he said.“Normally when you change a franchise you have a lot longer.”VTEC, a joint venture between Stagecoach (90%) and Virgin (10%), began operating in March 2015.The firms agreed to pay the Government £3.3bn to run trains until 2023, but the contract was ended prematurely after they failed to achieve revenue targets.LNER will operate until a public-private partnership takes responsibility for both trains and track operations in 2020.The switch from VTEC to LNER is costing an estimated £8m, which includes marketing, rebranding and IT set up.VTEC is the third private operator to fail to complete the full length of a contract to run East Coast services. File photo dated 15/08/12 of a Virgin train. Virgin Trains East Coast (VTEC) is running services on the East Coast Main Line for the final day on Saturday following the failure of the franchise. PRESS ASSOCIATION Photo. Issue date: Saturday June 23, 2018. Trains on the route will be brought back under public control from Sunday, with the London North Eastern Railway (LNER) brand being resurrected from the 1940s. See PA story RAIL EastCoast. Photo credit should read: Rui Vieira/PA Wire 8:57 Jonathon Manning Mind gym float to net founders £50.8m\nThe stock market flotation of behavioural science firm Mind Gym will net its owners, including Octavius Black, £50.8m.Mr Black, an Eton alumnus and friend of David Cameron, his wife Joanne and the company’s co-founder Sebastian Bailey will pocket the windfall when Mind Gym lists with a market value of £145 million.Mind Gym uses behavioural science to encourage its clients’ staff to approach work differently and tackle problem solving in inventive ways.Co-founded by Mr Black and Mr Bailey in June 2000, the firm has worked with 62% of the current FTSE 100 and 59% of S&P 100 companies.It has a presence in the UK and a growing US and Singapore operation.Shares will list on the London Stock Exchange’s junior AIM market at 146p per share.Mr Black, his wife and Mr Bailey will retain 64.6% of the company.In addition, former TalkTalk boss Baroness Dido Harding will become an independent non-executive director at the group.Mr Black said:\nToday behavioural science comes of age. When we started out 18 years ago at my kitchen table, it was readily dismissed; now, the way businesses use behavioural science determines their success.\nMind Gym’s IPO will raise our profile and help us lead the development of psychological tools to make companies more diverse, ethical, agile, productive, innovative, healthy and profitable.\nIn the year ended March 31 2018, Mind Gym generated revenues of £37m and profit after tax of £4.4m.Mind Gym has a portfolio of more than 300 products, typically bite-size 90-minute sessions delivered face-to-face in virtual classrooms or digitally through a network of 293 coaches.\nMr Black added:\nWe are delighted by the level of support we have received from such reputable investors.\nTogether with our team of ever-curious and deeply committed colleagues, we look forward to leading the thinking on thinking, and so transforming the performance of businesses and the lives of the millions of people who work in them. London Stock Exchange (Image: PA) 8:46 Jonathon Manning Teesside engineering firm targets £1.6m turnover\nTeesside’s Prosafe Engineering is aiming to increase its turnover to £1.6m next year after officially opening its new premises on Riverside Park Industrial Estate.\nThe new base was officially opened by Middlesbrough MP Andy McDonald, and marks a major milestone for the company which initially started as a two-man office by directrs Greg Hynes and Mike Styan.\nThe new base includes a workshop, boardroom, office space and training room.\nThe firm now has 11 members of staff and is planning to create four more jobs by mid-2019.\nMr Hynes said:\nIt’s been an exciting journey so far. When we first started out, we didn’t get paid for about four months. But when 2017 arrived, from the first week in January until this moment in time it has just been relentless.\nAll of our hard work started to come to fruition, and it ended up where a decision had to be made where we had to move into larger premises.\nWhat we’ve moved into is five years away but everything is under one roof now and will help us grow. Middlesbrough MP Andy McDonald cut the ribbon to open the new premises of Pro Safe in Middlesbrough (Image: Pic Doug Moody Photography) 8:41 Jonathon Manning Nielsen and Ebiquity face in-depth probe over possible merger\nThe proposed merger of Nielsen and the advertising arm of Ebiquity will be subkect to an in-depth probe after the companies failed to satisfy concerns raised by the competition watchdog.The Competition and Markets Authority (CMA) previously warned that the two firms faced limited competition if they joined forces, and asked them to provide “acceptable undertakings” to avoid a more rigorous investigation.However, on Monday the CMA said Nielsen and Ebiquity had not provided the necessary solutions.In a statement, the CMA said:\nNielsen and Ebiquity have not offered any undertakings and the CMA will now refer the merger for an in-depth investigation by an independent group of panel members, supported by a team of CMA staff. Magnifying glass held over a dictionary to highlight the word Spell 8:35 Jonathon Manning Newcastle firm offering free hand cream for nurses beats crowdfunding target\nA hand cream company whose products have been specifically designed for nurses has pledged to double the amount of freebies it gives out to NHS workers as part of its crowdfunding campaign.\nDue to the number of times healthcare workers are required to wash their hands many nurses suffer from dry and cracked hands. Nursem’s hand cream has been designed so that it can be used by nurses and midwives while working on hospital wards.\nThe company initially wanted to raise £20,000 on Crowdfunder to finance its first bathc of products. But now the firm has raised its target to £25,000 after a successful campaign.\nAs an incentive to backers, everytime a donation is received Nursem sends a bottle of its handcream to the backer and a nurse.\nWith three days to go before its campaign ends, Nursem has received £23,158 towards its project. To help it raise the remaining cash the company has promised to double the amount of freebies it hands out to nurses for every new pledge.\nExplaining the changes to its backers on Crowdfunder, the Nursem team said:\nWe can’t quite believe it! Massive thank you to everyone that has pledged so far and helped us begin our mission to give free hand cream to nurses and midwives.\nFor every new pledge, we’ll give twice as much free hand cream to nurses and midwives, if we reach our stretch goal of £25,000. Jonny and Antonia Philp (Image: Unknown) 8:30 KEY EVENT CYBG-Virgin Money tie-up may start wave of banking deals\nCYBG’s £1.7bn takeover of Virgin Money could spark a wave of M&A in the banking sector, according to the global chairman of PwC.\nBob Moritz said that the takeover of the Newcastle bank could spark a string of deals, with smaller lenders snapped up by larger firms.\nSpeaking to the Press Association, Mr Moritz said:\nYou’re probably going to see it more so in the mid-tiers regardless of the country, even though there’s lots of rumours with some of the larger institutions - obviously particularly coming out of the UK.\nThe mid tiers are the ones that I think have historically been limited by what they can do with their capital because of the regulatory requirements.\nI also think they’re looking for the return and they are more likely to be challenged, and therefore they probably need a little bit more scale because of the cost of doing business.\nRumours are already circling the market that Barclays is eyeing a takeover of Standard Charter.\nTechnology is likely to play a key decision in whether acquisitions go ahead.\nSpeaking to journalists earlier this week, CYBG chief executive David Duffy framed the Virgin Money deal in a similar light.\nCustomers want more from their banks, there are new entrants emerging all the time, the technology is changing and with all the regulatory changes, we know PSD2 and Open Banking puts a lot of challenges out there.\nHe also noted the opportunity to scale up quickly, with the combined group set to double in size “on day one” with six million customers, and assets worth about £83.5bn.\nWhat’s important is that at our size and level we move out of the challenger bank market. A branch of Virgin Money (Image: Rob Browne/ WalesOnline) 8:23 Jonathon Manning North East businesses are 'exasperated' by Brexit talks, PM is told\nBusinesses in the North East are “exasperated” with the Government’s handling of Brexit as they lose skilled staff and investment, the Prime Minister has been told.\nTheresa May has been lambasted by the head of the North East England Chamber of Commerce, the region’s largest business organisation, who has described the Government’s progress with Brexit negotiations as “poor”.\nChamber CEO James Ramsbotham has written a stinging letter to the Prime Minister to highlight the concerns North East businesses have raised over Brexit.\nIt comes after a number of reports highlighted the North East as the region most likely to lose out from leaving the EU, with the region’s crucial automotive industry seen as being particularly at risk if tariffs are put on UK exports and imports.\nMr Ramsbotham said:\nWhilst we have accepted the referendum result, our members are exasperated at the lack of tangible progress towards a positive deal which is clearly hindering business planning.\nWhile our regional economy currently remains robust, we regularly hear about lower investor confidence, projects being delayed and skilled workers leaving for other countries due to uncertainty over our future business landscape. This is being compounded by a lack of clarity from Government over its own preferred approach to Brexit.\nAt the heart of this lies woefully underwhelming levels of engagement and consultation by Government with local businesses. There are perfectly valid fears among our exporters that the Government’s stance on the Customs Union and Single Market will only serve to harm our ability to trade with our biggest export market.\nThe North East economy has the potential to be adversely affected by Brexit as 62% of the region’s exported goods are shipped to the EU.\nThe Government’s own analysis says the North East economy will shrink by between 11% and 16% depending on whether the UK can strike a trade deal with Europe, while the House of Commons Business Committee has warned of huge damage to the region’s automotive sector if the UK loses access to the EU single market.\nThe Chamber has also reminded the Government of a manifesto commitment to close the gap between London and regions like the North East, which it described as “the biggest prize in Britain today.” James Ramsbotham, North East England Chmaber of Commerce (Image: Handout) 8:18", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14823472;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-06-25T10:00:00.000+03:00", "crawled": "2018-06-25T13:48:13.081+03:00", "highlightTitle": ""}