{"organizations": [], "uuid": "a043028c6f69954244337affb78391c65159df64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14746212.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/dominic-cummings-fake-news-inquiry-14745875", "country": "GB", "domain_rank": 21960, "title": "Vote Leave's Dominic Cummings may face order to answer questions on fake news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-05T15:27:00.000+03:00", "replies_count": 0, "uuid": "a043028c6f69954244337affb78391c65159df64"}, "author": "Agency Staff", "url": "https://www.chroniclelive.co.uk/news/north-east-news/dominic-cummings-fake-news-inquiry-14745875", "ord_in_thread": 0, "title": "Vote Leave's Dominic Cummings may face order to answer questions on fake news", "locations": [], "entities": {"persons": [{"name": "dominic cummings", "sentiment": "negative"}, {"name": "cummings", "sentiment": "negative"}, {"name": "damian collins", "sentiment": "none"}, {"name": "john bercow", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "news vote leave", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "durham school", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "sports committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Vote Leave's Dominic Cummings may face order to answer questions on fake news Mr Cummings, who was born in Durham and attended Durham School, could be ordered to give evidence to an MPs inquiry Share Vote Leave chief Dominic Cummings (Image: parliamentlive.tv) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nOne of the key architects of the Leave campaign in the EU referendum could be ordered by the House of Commons to give evidence to an MPs’ inquiry into fake news.\nIn a new report, an influential Commons committee said that former Vote Leave director Dominic Cummings was in “flagrant contempt of the House” after he refused repeated calls to answer its questions.\nDamian Collins, the chair of the Digital, Culture, Media and Sports Committee, has written to Speaker John Bercow asking for an early debate and vote by MPs on an order for him to attend, backed by the authority of the House.\nMr Cummings, from Durham, has previously accused the committee of “grandstanding”, telling them: “Your threats are empty... I will not come to your committee regardless of how many letters you send or whether you send characters in fancy dress to hand me papers.” The Vote Leave campaign bus (Image: PA)\nThe committee is investigating the use of targeted online advertising during the 2016 referendum campaign, following allegations that Facebook users’ private data may have been misused.\nIt wants to question former Durham School pupil Mr Cummings about Vote Leave’s use of online ad firm Aggregate IQ, which has been linked to SCL Group - the parent company of Cambridge Analytica - and which received 40% of the official Brexit campaign’s entire advertising budget.\nTuesday’s report details his refusal to give evidence to hearings on three different dates in May, despite a summons requiring him to attend the latest session.\nRefusal to comply with an Order of the House would be likely to result in his case being referred to the Commons Privileges Committee, which can recommend a finding of contempt. Read More Theresa May accused of 'contempt for democracy' after packing EU votes into one day\nHowever, it is not clear what punishment could result from a contempt finding, which must be approved by the House.\nIn theory, the Commons can order imprisonment or issue fines, but neither of these sanctions has been used for many years and a 2012 report said its powers were “untested in recent times”.\nTwo News International executives found in contempt over misleading evidence to a select committee were admonished by the House in 2016.\nIn its special report, the committee said Mr Cummings had refused to give evidence on the grounds that he was subject to investigations by the Information Commissioner’s Office (ICO) and the Electoral Commission. Read More George Osborne wants to strip the Department for Transport of responsibility for North rail services\nBut both watchdogs said they had “no objection” to him answering MPs’ questions.\nThe report said his failure to do so “constitutes a serious interference with the ability of this committee to discharge the task assigned to it by the House and a flagrant contempt of the House”.\nMr Cummings is married to Mary Wakefield, daughter of Sir Humphry Wakefield, of Chillingham Castle in Northumberland. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-05T15:27:00.000+03:00", "crawled": "2018-06-05T16:02:36.011+03:00", "highlightTitle": ""}