{"organizations": [], "uuid": "5a184886cfaa67fad77648738a92691965986b65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14843529.ece/ALTERNATES/s1200/JS129770810.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/race-remain-number-eu-citizens-14842155", "country": "GB", "domain_rank": 21960, "title": "The race to remain: Number of EU citizens applying to stay in North East after Brexit soars", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-30T10:00:00.000+03:00", "replies_count": 0, "uuid": "5a184886cfaa67fad77648738a92691965986b65"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/race-remain-number-eu-citizens-14842155", "ord_in_thread": 0, "title": "The race to remain: Number of EU citizens applying to stay in North East after Brexit soars", "locations": [], "entities": {"persons": [{"name": "catherine mckinnell", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "uk border force", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe number of EU citizens applying to stay permanently in the UK has increased soared since the Brexit referendum , it can be revealed.\nAnd it has gone up as much as SEVEN times in some parts of the North East.\nExclusive data obtained under Freedom of Information laws reveals there were 145 requests for permanent residence in Durham in the financial year 2017/18.\nThat compares with just 20 such requests in 2015/16.\nThe numbers shot up in the months after the UK voted to leave the European Union in June 2016. UK Border Force officer (Image: PA)\nAs long as the UK remains part of the European Union, EU citizens have the right to live and work here with few restrictions.\nBut that is expected to change once we leave.\nThe UK Government has promised that EU citizens who are already here will be welcome to stay.\nBut applying for residency provides an extra guarantee for people from the EU that they won’t lose the right to live in the UK.\nNewcastle North MP Catherine McKinnell said: “EU citizens living and working in the North East have faced huge uncertainty about their future in this country since the referendum, despite many of them having been here for several years and this being their home. MP Catherine McKinnell (Image: Newcastle Chronicle)\n“I know just how unsettling and distressing this situation has been for so many families, and it’s frankly unacceptable that they should have been treated by our Government in this way.\n“‘Clearly, many people will want certainty about their ability to continue to live in this country, to work here, or do business and the fact that they are taking the initiative to try and do this, because Ministers have been unable to provide them with the clarity they need, is unsurprising.”\nOther parts of our region have also seen a surge in applications for permanent residence from EU citizens.\nNewcastle saw a threefold increase from 90 applications in 2015/16 to 420 in 2016/17 and 245 in 2017/18.\nIn Northumberland, numbers have risen from just 10 in 2015/16 to 75 in 2016/17 and 45 in 2017/18. An aerial view of the River Tyne and bridges (Image: PA)\nSunderland has seen numbers increase from 20 in 2015/16 to 120 in 2016/17 and 65 in 2017/18.\nThere were a further 80 applications for permanent residence from EU citizens in Middlesbrough in the financial year 2016/17, which ran from April 2016 to March 2017. Read More\nMeanwhile, in Stockton the number of application has increased threefold from 15 in 2015/16 to 50 in 2017/18 with a peak of 65 in 2016/17.\nFigures are unavailable for Redcar and Cleveland. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-30T10:00:00.000+03:00", "crawled": "2018-06-30T10:57:34.005+03:00", "highlightTitle": ""}