{"organizations": [], "uuid": "9a8c58dc92372a3fdda3327c14157ff146265e88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14830965.ece/ALTERNATES/s1200/Northern-Rock-Seeks-Emergency-Help-From-Government.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/bad-bank-aims-wind-down-14830924", "country": "GB", "domain_rank": 21960, "title": "'Bad bank' aims to wind down Northern Rock mortgage book in three years", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-26T16:35:00.000+03:00", "replies_count": 0, "uuid": "9a8c58dc92372a3fdda3327c14157ff146265e88"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/bad-bank-aims-wind-down-14830924", "ord_in_thread": 0, "title": "'Bad bank' aims to wind down Northern Rock mortgage book in three years", "locations": [], "entities": {"persons": [], "locations": [{"name": "northern rock", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "kingston", "sentiment": "none"}, {"name": "invalid email britain", "sentiment": "none"}], "organizations": [{"name": "ukar", "sentiment": "none"}, {"name": "bradford & bingley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Bad bank' aims to wind down Northern Rock mortgage book in three years UK Asset Resolution said 2021 should mark a milestone in the country's recovery from the financial crash Share Customers of Northern Rock queue outside the Kingston branch, September 15, 2007 (Image: Getty Images Europe) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBritain’s “bad bank” has said it is aiming to complete the wind down of mortgage books of failed lenders Northern Rock and Bradford & Bingley within three years.\nUK Asset Resolution (UKAR) - set up in 2010 to manage the failed bank assets after the financial crisis - said it was “probable” it could complete the sell-down by 2021 in what would mark another milestone in the sector’s recovery since the credit crunch meltdown.\nIt has been working with advisers on how to offload its remaining assets, which has so far been shrunk by 83% or £96bn.\nUKAR said it had cut the balance sheet by another £14.5bn to £17.2bn in the year to March 31. Read More Northgate sees turnover top £700m but UK vehicle rentals fall\nBut with another £5bn sell-off announced in April and the sale of another £900m of equity release mortgages, which is expected to complete later this year, its customer balances is expected to fall below £11bn.\nUKAR said: “As always, we will need to satisfy ourselves, UK Government Investments and HM Treasury that whatever option we choose represents value for money for the taxpayer but, subject to the continuation of supportive market conditions, we believe that it is probable that the process can be completed by 2021.”\nIt comes after the Government restarted the process of selling down its stake in Royal Bank of Scotland less than a month ago, while Lloyds Banking Group was fully returned to private hands last year.\nIan Hares, chief executive of UKAR, said: “I am pleased that we have continued to make good progress in achieving our objective, with high levels of service delivered for our customers and an 83% reduction in our balance sheet since formation in 2010.” Read More Thousands of North East car industry jobs being put at risk by Brexit\nUKAR reported a 17% fall in annual underlying pre-tax profits to £583.9m as a result of efforts to reduce its mortgage balance sheet.\nIt borrowed £48.7bn of taxpayer cash to take on the loans of Northern Rock and Bradford &Bingley, but has so far paid £38.4bn back to the Government, representing 79%. It said £14.7bn of this was paid back in the last financial year.\nOn arrears levels, UKAR said mortgage accounts three or more months in arrears, including possessions, had fallen by 22% over the year. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-26T16:35:00.000+03:00", "crawled": "2018-06-27T02:53:27.023+03:00", "highlightTitle": ""}