{"organizations": [], "uuid": "275707a15da83a22456b2dfa3863b68e7eba53dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14466954.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/report-details-impact-brexit-north-14742535", "country": "GB", "domain_rank": 21960, "title": "Report details impact of Brexit on North East - and warns of dangers ahead", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-04T18:16:00.000+03:00", "replies_count": 0, "uuid": "275707a15da83a22456b2dfa3863b68e7eba53dd"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/report-details-impact-brexit-north-14742535", "ord_in_thread": 0, "title": "Report details impact of Brexit on North East - and warns of dangers ahead", "locations": [], "entities": {"persons": [], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "north east brexit group", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The EU and Union flags (Image: PA)\nThe North East has lost its position as an exporting region and businesses have lost work to European competitors because of the Brexit vote, an unprecedented coalition of regional business leaders has said.\nThe North East Brexit Group - which comprises business groups, unions, universities and charities - has called on the Government to maintain access to the European Single Market after a report highlighted widespread concerns across the region’s business community about future trading arrangements.\nThe North East LEP, the North East England Chamber of Commerce , the region’s four universities and the North East Combined Authority are among the organisations that have signed up to Brexit group.\nAnd in a hard-hitting report, the group has added to previous warnings that the North East stands to lose the most from Brexit, with the region’s key automotive and pharmaceuticals sectors particularly at risk.\nThe report says: “Some North East exporters, for example medicines manufacturers, report uplift in trade volumes with businesses benefitting in the short term from the devaluation of sterling. However, the overall balance of trade values have changed to put the North East in a net importing position for the first time in many years.\n“There is evidence that business confidence in digital and transport sectors has already been affected with some decisions having been made to locate investment in Europe rather than in the North East and evidence that some new business contracts have not been won as buyers have chosen to work with EU-based partners.\n“Some future decisions will be taken by North East businesses on a risk management basis and in the absence of clarity, some businesses are planning for a worst case scenario, ie reverting to World Trade Organisation trade arrangements. Furthermore, many businesses say scenario planning is difficult because of the information available, with many stating the complexity of the information is challenging to make contingency plans.\n“Longer term investment decisions are dependent on the outcome of the negotiations and implementation phase with key factors identified as being the openness of export relationships, skills availability and access to supply chains as key factors affecting the confidence to invest.”\nThe North East Brexit Group was formed to provide a collective voice for the region in the Brexit negotiations. Its report is based on evidence from a wide range of Government, academic and business sources.\nThe report says the UK must ensure that it retains access to the Single Market, have an open trading regime and maintain a stable regulatory framework with the European Union to minimise the impact of Brexit on the North East economy.\nIt also wants new policies to replace EU funding streams to the North East, highlighting the importance of the EU-backed £120m North East Fund, which is aiming to create 3,500 new jobs in the region.\nThe report also says that there are potential opportunities for the North East in Brexit, however, including getting more of the Nissan supply chain located closer to its Sunderland factory. Read More North East car dealerships say Brexit woes have hit sales\nAndrew Hodgson, chair of the North East LEP, said: “What we feel is important is to provide a substantive body of evidence stripped of rhetoric so we can get into position to do something about it.\n“People have been calling for the North East to make a specific ask on Brexit. We have set out here what the impact of Brexit could be and what we can do to counteract some of those impacts.”\nA spokesperson for the Department for Exiting the EU said: “We do not seek membership of the Single Market after we leave the EU, but a bold and ambitious new economic partnership.\n“We understand the importance of finding a solution on customs that allows trade to be as frictionless as possible, which is why we are taking the time to get to the right solution and why work continues to refine the two options we have set out.\n“On skills, when we leave the EU, freedom of movement will end and we be will creating an immigration system that delivers control over who comes to the UK, but that welcomes the brightest and best who want to work hard and contribute.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-04T18:16:00.000+03:00", "crawled": "2018-06-04T20:04:24.010+03:00", "highlightTitle": ""}