{"organizations": [], "uuid": "ee41c5a1468903253163a0db2e808755a1ddf8f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1637012.ece/ALTERNATES/s1200/DSCF2210.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/business/donald-trump-threat-10m-business-1636992", "country": "US", "title": "Why Donald Trump is a threat to a £10m business in North Devon that you didn't know was there - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.052, "site_type": "news", "published": "2018-06-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee41c5a1468903253163a0db2e808755a1ddf8f8"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/donald-trump-threat-10m-business-1636992", "ord_in_thread": 0, "title": "Why Donald Trump is a threat to a £10m business in North Devon that you didn't know was there - Devon Live", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "andy lobato", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "munich", "sentiment": "none"}, {"name": "torrington", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "bologna", "sentiment": "none"}, {"name": "helitune", "sentiment": "none"}, {"name": "condition monitoring group", "sentiment": "none"}, {"name": "beran instruments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why Donald Trump is a threat to a £10m business in North Devon that you didn't know was there Part of the Condition Monitoring Group, the business sells to 30 countries and has sales and service offices in Germany (Munich), USA (Chicago) and Italy (Bologna) Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nOf all the threats to a business on the edge of Torrington, you probably would not expect it to be President Trump.\nBut Beran Instruments and its sister company Helitune is no ordinary business.\nWith a turnover of £10million and ambitions to double that within 10 years, plus 65% of its sales overseas, this could be one of the unlikeliest enterprises you’ll ever find at the end of a country lane in rural Devon. And yet here it is, and has been for 34 years. Read More Tears as former surf champion forced to give up surf shop after 23 years due to Parkinson's disease\nFounded by Andy Lobato, a man who was looking to emulate the same success he had helped create for his old bosses in the South-East rat race, the business designs and sells equipment to monitor the condition of machinery, from large rotating plant in power turbines to aircraft and helicopters. Andy Lobato, founder of Beran Instruments in Torrington\nIt develops ‘black box’ technology that can measure things like the level of vibrations which could indicate problems with the gearbox, for example.\nMr Lobato said: “I guess it does sound strange to think of a business like ours in a remote part of North Devon.\n“It’s fair to say we spend a lot of time on the road and in airports.” Read More #BackTheSouthWest campaigners say Devon and Cornwall risk 'laggard of the UK' tag\nPart of the Condition Monitoring Group, the business sells to 30 countries and has sales and service offices in Germany (Munich), USA (Chicago) and Italy (Bologna) and counts blue-chip companies like EDF in the UK, the German Government, Leonardo Helicopters in Milan and the US Coastguard among its clients.\nIn fact, 25% of its business comes from the United States and that’s where Trump comes in.\nMr Lobato said: “The biggest sensitivity is where you have a country that is discriminatory, and that is very real in the US with Trump’s ‘America First’ policy, and I guess a fear for us is if the EU becomes more aggressive post-Brexit.\n“We have mitigated that risk by creating indigenous companies, so our office in Germany deals with German clients, and so on. Read More Michelin award-winning chef buys popular North Devon inn\n“But in the US, where we do 25% of our business, we have competition from blue-chip companies.”\nHe explained that, in the States, ‘America First’ means that, if the government wants to award a contract for more than $150,000, it can only be awarded to a foreign company if there is no US option. Geoffrey Cox QC MP visits Beran Instruments, a major provider of graduate jobs in North Devon\n“It is much easier for our competitors to approach a US senator to convince them to award a contract to them rather than a firm in North Devon.”\nAnd yet, Beran is able to compete on the world stage from its Torrington HQ – but there are challenges, mainly in transport links.\nMr Lobato said: “If you had told me all those years ago how challenging it would be in North Devon as opposed to the South East, I might would have re-considered where I was going to start the company.”\nWhen he set up in Torrington – the only place where he could secure seedcorn capital to start up the business – it was before the North Devon Link Road was built. Beran Instruments is part of the Conditioning Monitoring Group based in Torrington\n“I thought, ‘how bad can it be?’ I didn’t realise it took close to two hours to get to the M5. I certainly showed my naivety back then.”\nAnd still today, the road network is a challenge. Read More Petroc's brightest students share their inspiring stories for National Apprenticeship Week 2018\nHe said: “We have a rule – don’t go anywhere on a Friday. But aside from that, you get used to travelling distances in the South-West, and it’s not about how far, but when you travel.\n“On a Bank Holiday weekend, it will take five hours to travel from the South East to North Devon, but I returned recently from the South of France to London at 8pm and it took about three hours.”\nAnd he believes that, because of its remoteness, efforts to attract new business to the area are a lost cause.\nHe explained: “If you can convince them to drive past Swindon and Bristol, and then convince them to drive past the business parks on J23, 24, 25 on the M5, tell them that Exeter, with its university, airport and trains stations, isn’t worth going to, and then sell them an idea of a 45-minute drive from J27, then you are a better person than I am. Read More\n“My sense is that we should be supporting those businesses who are already here, and the talent that is on our doorstep.”\nOf 120 staff, 90 are based at Torrington, and recruitment is the biggest barrier to growth.\nThe business has played a key part in pushing for a new Innovation Centre in Barnstaple, partnering with at Petroc College, to support talent development and retention, and also partners for research programmes with the universities of Exeter and Bristol.\nMr Lobato said: “We are at the cutting-edge of the technology available to us. However, the industry sectors we are in are very conservative, so the rate of adoption is slow. The airline industry does not take risks.”\nBeran has a strong track record of training its staff, taking on apprentices and funding degree and post-graduate courses so they can then take on senior positions within the business.\n“Am I philanthropic? As much as anybody, but the bottom line is that it is an absolute necessity for the business.” Like us on Facebook", "external_links": [], "published": "2018-06-04T03:00:00.000+03:00", "crawled": "2018-06-04T13:23:39.002+03:00", "highlightTitle": ""}