{"organizations": [], "uuid": "5096a0355166df2d508cc034bd4c0b61e1174240", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14817945.ece/ALTERNATES/s1200/JS124810664.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/top-labour-mps-nick-brown-14816539", "country": "GB", "domain_rank": 21960, "title": "Top Labour MPs Nick Brown and Ian Lavery will vote in favour of Heathrow third runway", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-22T18:03:00.000+03:00", "replies_count": 0, "uuid": "5096a0355166df2d508cc034bd4c0b61e1174240"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/top-labour-mps-nick-brown-14816539", "ord_in_thread": 0, "title": "Top Labour MPs Nick Brown and Ian Lavery will vote in favour of Heathrow third runway", "locations": [], "entities": {"persons": [{"name": "ian lavery", "sentiment": "negative"}, {"name": "nick brown", "sentiment": "negative"}, {"name": "lavery", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham tees valley airport", "sentiment": "none"}], "organizations": [{"name": "airline flybe", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "invalid email labour", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top Labour MPs Nick Brown and Ian Lavery will vote in favour of Heathrow third runway North East MPs to back Heathrow even though Labour officially opposes expansion Share Labour Mps Nick Brown and Ian Lavery are in favour of a third runway at Heathrow Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLabour Chief Whip Nick Brown and Chair Ian Lavery are both to vote in favour of a third runway at Heathrow, despite the party’s official position of opposing the expansion plan.\nThe decision from the two North East MPs will be welcomed by Newcastle International Airport, which supports 18,900 jobs in the region and says that a third runway at Heathrow is vital for its continued success.\nAirline Flybe has also set out plans to introduce domestic flights between Heathrow and Durham Tees Valley Airport, if the expansion goes ahead.\nLabour is giving its MPs a free vote when the Commons considers the Heathrow proposal on Monday. A Flybe plane (Image: Andrew Milligan/PA Wire)\nMr Lavery, the Labour Chair and MP for Wansbeck, told the Chronicle: “I fully support the calls for an expanded Heathrow that will deliver much needed jobs, apprenticeships and growth right across the UK.\n“This is a divisive issue and I fully understand the variety of opinions on all sides of the debate. However, in the North East, jobs and businesses are reliant on our domestic link to Heathrow and without the development of the additional runway, routes like this will become increasingly squeezed out.\n“With a number of challenges on the horizon as a region we cannot afford to lose access to our biggest hub.”\nMr Brown, MP for Newcastle upon Tyne East, said he would vote for a third runway, adding that this was “the same as I voted in the Labour government”. The Commons rejected Tory calls to scrap the third runway plan in a vote in 2009, when Labour was in power and supported the proposal.\nLabour’s official position is clear. Andy McDonald MP, Labour’s Shadow Transport Secretary, said on Thursday: “Labour opposes a third runway at Heathrow because it doesn’t meet our four tests and we are calling for a free vote for all parties on Monday.” Andy McDonald MP (Image: Daily Mirror)\nBut the decision by two senior Labour figures to back a third runway may reassure other Labour MPs who had been considering voting in favour.\nSome North East Labour MPs say they will decide over the weekend how to vote. They include Chi Onwurah, MP for Newcastle Central, and Grahame Morris, MP for Easington.\nIt is also likely to be welcomed by the Government, which backs Heathrow expansion, following reports that Monday’s vote could go either way.\nThe SNP, who had been expected to support the plan, have indicated they might oppose it unless they receive reassurances that Scotland will benefit.\nAnd there may be a sizeable Conservative rebellion. Trade Minister Greg Hands resigned on Thursday, saying he planned to vote against.\nTory former Transport Secretary Justine Greening has been writing to MPs in the North of England, warning that their local airports will lose international services if Heathrow is allowed to expand. Tory former Transport Secretary Justine Greening (Image: PA)\nShe warned of “regional airports across the Northern Powerhouse losing over 28,000 international flights annually by 2030 as a direct result of Heathrow expansion.”\nThe figures were produced by the Transport Select Committee, and based on data from the Department for Transport, she said. Read More Newcastle MP urges Labour colleagues to support Heathrow third runway plans\nMs Greening said in her letter: “Heathrow Airport Limited is somewhat of a monopoly so when it gets bigger, analysis shows competitor regional airports lose out. It actively prevents local regional airports from growing as strongly to provide international connections on your doorstep. This negative impact is mirrored in regional airports across the country.”\nShe said Newcastle International would lose 3,975 international flights by 2030, a cut of 14.4%.\nHowever, Graeme Mason, Newcastle International’s Planning & Corporate Affairs Director, insisted the airport would continue to provide direct international services. Graeme Mason, Planning & Corporate Affairs Director at Newcastle International Airport (Image: The Journal)\n“We are confident that the North East economy and the demand for passenger growth at Newcastle will mean that in the future, even with a third runway at Heathrow, we will continue to grow. And we will get more international services - both direct services and via hubs.”\nBut services to major “hub” airports such as Heathrow were a vital part of improving connections between the North East and the rest of the world, he said. Read More MPs want police inquiry into whether Russia funded Brexit campaign\nCurrently, there are up to six flights a day between Newcastle and Heathrow. But if Heathrow is not allowed to expand then some of those domestic flights could be replaced by services directly between Heathrow and overseas destinations.\n“There’s never going to be enough demand from the North East to justify a large number of long haul services.\n“So we are always as a region going to be reliant on our connection via hubs, and Heathrow is the biggest hub serving the North East.\n“We have that link, it’s now important we hold on to it.\n“We are concerned that if there is no third runway then eventually our services will be squeezed out. Because there will be increasing pressure at Heathrow for the two runways, which are a scarce resource, to be used more and more for long-haul routes.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-22T18:03:00.000+03:00", "crawled": "2018-06-22T19:19:53.009+03:00", "highlightTitle": ""}