{"organizations": [], "uuid": "59cda2d9bbf3e3d7047aaba760bf5c80f5190e41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.gazettelive.co.uk/incoming/article14825432.ece/ALTERNATES/s1200/Ward-Hadaway-3-2.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/special-features/ward-hadaway-northern-law-awards-14825426", "country": "GB", "domain_rank": 21960, "title": "A celebration of Ward Hadaway's vision, values and people", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-25T16:16:00.000+03:00", "replies_count": 0, "uuid": "59cda2d9bbf3e3d7047aaba760bf5c80f5190e41"}, "author": "Adam Gray", "url": "https://www.chroniclelive.co.uk/special-features/ward-hadaway-northern-law-awards-14825426", "ord_in_thread": 0, "title": "A celebration of Ward Hadaway's vision, values and people", "locations": [], "entities": {"persons": [{"name": "ward hadaway", "sentiment": "positive"}, {"name": "hadaway", "sentiment": "none"}, {"name": "jeffrey keeble", "sentiment": "none"}, {"name": "jamie martin", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "healthcare", "sentiment": "none"}, {"name": "bigger picture agency ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertorial A celebration of Ward Hadaway's vision, values and people 2018 is a winning year for Ward Hadaway, as the firm celebrates its Law Firm of the Year accolade at the Northern Law Awards in the midst of its 30th anniversary celebrations Share 14:16, 25 JUN 2018 Advertorial From left, Ward Hadaway’s Senior Partner, Jamie Martin and Head of Healthcare, Jeffrey Keeble, collect the Law Firm of the Year award on the night (Image: The Bigger Picture Agency Ltd) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe prestigious award win has singled Ward Hadaway out for ‘excellence across the board’ and demonstrates the success of its mission to put people and clients at the heart of everything it does.\nThe firm’s achievement, as it celebrates three decades in business, is the result of a robust vision that has earned Ward Hadaway its respected position at the heart of the North East business community.\nOver the last 20 years, under the stewardship of Jamie Martin, Ward Hadaway has charted its growth from a £6m firm with a team of less than 100, to a £36m+ operation employing more than 470 people, 350 of whom are based in the North East.\nAs an ambitious Northern law firm, Ward Hadaway refuses to dwell on past success, working constantly with clients and business partners to support and celebrate the people, businesses, organisations and communities of the region.\nThe firm is rolling out its new strategic growth plan with objectives to improve client service and become an even better place to work.\nFor their people that is about agreeing shared values, developing opportunities and encouraging broader business engagement which is central to the firm’s ethos and they are very proud of that.\nWard Hadaway’s annual Fastest 50 awards are an example of how the firm helps fast-growing companies celebrate success in business by recognising outstanding achievements across its Northern heartland.\nThe awards also reflect the firm’s commitment to businesses of all types from the smaller owner-managed companies to larger well-established companies.\nGrowing businesses are the lifeblood of the economy and with advanced manufacturing singled out by the North East LEP recently as a key area for growth, Ward Hadaway has shown its commitment to this key sector through its support of the Advanced Manufacturing Forum, especially on important people-related issues via its HR forums.\nThe North East is, as a region, a major exporter and this drive to export extends right through the local economy with many more companies actively looking to export their goods and services.\nTo support this, Ward Hadaway recently joined forces with NE1 and Invest Newcastle to host a delegation from India. The firm then used its experience to host South African leaders and North East businesses in June as part of a three-day trade mission to the UK, organised by Stephenson Mohl.\nThe trade visits not only gave delegates first-hand insight into how the region operates, it has also re-emphasised the importance of forging new links, building relationships and developing new ways of working.\nIt’s clear that the North East’s engineering supply chain brings with it significant skills challenges. As a member of NOF Energy, Ward Hadaway recently joined leading figures in subsea technology, marine engineering and offshore renewables at a conference at Hardwick Hall, County Durham, to talk about operating in this challenging and important sector.\nThe firm is also making connections with new and innovative companies through its work with Digital Union, and with the Innovation Super Network. For whom it has backed the VentureFest and Finance Camp initiatives, which provide inspiration to growing businesses in the region.\nIn terms of added value for the region’s economy, Ward Hadaway is hosting a series of Brexit briefings with the CBI and North East LEP, where the CBI’s European Director, Sean McGuire, will share his experiences of the Brexit negotiations and his view of what the future holds for UK businesses in Europe.\nMartin Hulls, Ward Hadaway’s managing partner said: “This award win is testament to the calibre of the team at Ward Hadaway and the work we do across the board. We are delighted to be named Law Firm of the Year.\n“The award inspires us to hone, innovate and reinforce the delivery of exceptional client service. We can’t afford to be complacent because our varied clients from across many sectors demand the best. That is why our continued investment in training, technology and service skills is set to grow even further. This people-focused, client-centric approach is at the heart of Ward Hadaway’s values. It is the company’s distinctive culture that makes this Northern firm a great place to work and means it is able to retain great people to give great service to their clients.”\nJudges of this year’s Northern Law Awards were impressed by the firm’s approach to put its clients at the heart of everything it does and the scale to which the business has grown as a result.\nMartin added: “We are proud of our pledge to be vigorous participants in our local economy and local business landscape, but outside of the business arena we have an active programme to support local charities, community projects and sports clubs.\n“This ranges from ongoing investment into, and participation in, our own fund at the Community Foundation, which supports local regional charities, to our ongoing sponsorship of the Newcastle Falcons Rugby team.\n“We would like to thank both our clients and people for making this 30th anniversary year one to be celebrated and remembered for years to come.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-25T16:16:00.000+03:00", "crawled": "2018-06-25T16:59:38.007+03:00", "highlightTitle": ""}