{"organizations": [], "uuid": "aec98767d3c11e466e80693dbc569a03e65ca85b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14642807.ece/ALTERNATES/s1200/TMP_NEC_160118TransportNorth02JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/calls-general-election-amid-fears-14843291", "country": "GB", "domain_rank": 21960, "title": "Calls for General Election amid fears Brexit will devastate the North East economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-29T10:00:00.000+03:00", "replies_count": 0, "uuid": "aec98767d3c11e466e80693dbc569a03e65ca85b"}, "author": "Daniel Holland", "url": "https://www.chroniclelive.co.uk/news/north-east-news/calls-general-election-amid-fears-14843291", "ord_in_thread": 0, "title": "Calls for General Election amid fears Brexit will devastate the North East economy", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "coun forbes", "sentiment": "none"}, {"name": "cllr nick forbes", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "news calls for general election", "sentiment": "negative"}, {"name": "newcastle ci", "sentiment": "negative"}, {"name": "general election share daniel holland local democracy", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "invalid email council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "council", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Calls for General Election amid fears Brexit will devastate the North East economy Newcastle City Council leader Nick Forbes branded the Brexit negotiations as 'cack-handed' and called for a General Election Share Daniel Holland Local Democracy Reporter 08:00, 29 JUN 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nCouncil chiefs have called for an immediate General Election amid warnings that the North East cannot afford the cost of Brexit.\nCalls have been made for a new Government to step in because of what Newcastle City Council leader Nick Forbes labelled a ‘cack-handed’ approach to Brexit negotiations.\nCoun Forbes told Wednesday night’s council meeting that a new Government is needed to deliver a better deal for Newcastle, as Nissan bosses cast fresh doubt over the future of its Sunderland factory after being left “in the dark” over Brexit. Cllr Nick Forbes (Image: Newcastle Chronicle)\nHe said: “We are the region worst hit in both a deal or a no deal scenario. Whatever the outcome of negotiations, the North East will be hit economically.\n“Yet the Government fails to engage and talk to us in a meaningful way about the impact of Brexit and how we can mitigate it in our region.”\nLib Dem councillor Wendy Taylor had first raised a motion on Wednesday night calling for the British public to be given the final say on any Brexit deal - via a referendum which would also include an option to remain in the EU.\nShe told the chamber: “The warnings from Hitachi and Nissan should have been taken seriously. The North East needs their jobs and the prosperity they bring. British Prime Minister Theresa May arrives at the Council of the European Union (Image: Getty Images Europe)\n“If it was democratic to reverse a referendum decision from 40 years ago, why is it to reverse one from two years ago?”\nLeaked Government assessments indicated that the North East economy was predicted to shrink by 11%, even with a comprehensive trade deal and by 16% without one.\nWhile Coun Taylor said she believed referendums are an ‘appalling’ way to take decisions, a second Brexit vote would be the only way to reverse the decision of 2016. Read More Nissan workers 'will never forgive us' if Brexit destroys their jobs\nThe council’s ruling Labour group voted through an amended version of her motion, in which Coun Forbes called for a meaningful vote in the House of Commons on the final Brexit deal and an immediate General Election.\nHe added: “I am really concerned that we will not end up with a deal. Some ministers in Government are actively preparing the ground for that and many right wing politicians would prefer us to leave the EU without a trade deal. That would be highly damaging to us here.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-29T10:00:00.000+03:00", "crawled": "2018-06-29T13:05:50.070+03:00", "highlightTitle": ""}