{"organizations": [], "uuid": "024930195422d2c3b0d1944ed5991fd4dbb727e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14830457.ece/ALTERNATES/s1200/The-Nissan-factory-in-Sunderland-has-manufactured-the-first-of-its-new-Leaf-model-electric-cars.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/stark-brexit-warning-car-industry-14830411", "country": "GB", "domain_rank": 21960, "title": "'Stark' Brexit warning from car industry should set alarm bells ringing, North East MP says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-26T15:31:00.000+03:00", "replies_count": 0, "uuid": "024930195422d2c3b0d1944ed5991fd4dbb727e1"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/stark-brexit-warning-car-industry-14830411", "ord_in_thread": 0, "title": "'Stark' Brexit warning from car industry should set alarm bells ringing, North East MP says", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "society of motor manufacturers and traders", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Stark' Brexit warning from car industry should set alarm bells ringing, North East MP says 'There is growing frustration in global boardrooms at the slow pace of negotiations' say carmakers Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nCar manufacturers have warned that time is “running out” for the UK to agree a Brexit deal with the EU , as they revealed investment has fallen by half.\nThe Society of Motor Manufacturers and Traders, which represents carmakers in the UK, said investment had “stalled” in the first six months of 2018, with just £347.3m earmarked for new models, equipment and facilities in the UK – almost half the sum announced in the same period last year.\nIt called for swifter progress on a deal “that will put an end to uncertainty and prioritise the needs of the automotive sector”.\nAnd the warning came after carmaker BMW said it could close plants in the UK if the Government failed to negotiate a Brexit deal which protected the industry. Brexit 0 Seconds\nSedgefield Labour MP Phil Wilson said: “The trickle of companies going public about the risks they face from Brexit is becoming a flood.\n“This stark warning from the car industry that they need frictionless trade with Europe to avoid haemorrhaging highly-skilled jobs is simply too important for squabbling government ministers to continue to ignore.\n“The car industry in this country either employs directly or supports the jobs of nearly a million people, in every corner of the UK, including 6,500 jobs at Nissan in the North East with around 30,000 more in the supply chain.\n“It is a huge and crucial sector of our economy that must not be sacrificed on the altar of a hard Brexit.” Sedgefield MP Phil Wilson at the Hitachi opening ceremony (Image: Unknown)\nNissan has previously warned that failure to agree a Brexit deal that allowed car parts to come into the UK without delays would be “a complete disaster”.\nThe automotive industry directly employs 186,000 people while the wider industry, including component manufacturers and others, employs a total of 856,000.\nCarmakers have repeatedly raised concerns about arrangements at borders after Brexit , which is due to take place on March 29, 2019.\nThey have complex supply chains involving a large number of firms which provide components, and many of these suppliers are in other parts of Europe. Read More Children urged to run a mile each day to help tackle Britain's obesity crisis\nMost carmakers also operate what is known as a “just in time” system of manufacturing, in which parts are ordered when they are needed and arrive swiftly at the factory.\nThe system works because parts can be sent to the UK without delays, thanks to EU membership. But it would fall apart if there were long delays at borders.\nMike Hawes, Society of Motor Manufacturers and Traders Chief Executive, said the UK’s current arrangements with the EU were the right ones for the car industry - and said there was concern that the Government still didn’t know what would replace them once Brexit takes place. Read More Heathrow third runway to go ahead at last, as MPs back expansion plans\nHe warned: “There is growing frustration in global boardrooms at the slow pace of negotiations”.\nMr Hawes said: “There is no Brexit dividend for our industry, particularly in what is an increasingly hostile and protectionist global trading environment.\n“Our message to government is that until it can demonstrate exactly how a new model for customs and trade with the EU can replicate the benefits we currently enjoy, don’t change it.”\nCarmaker BMW warned it could close plants in the UK if it cannot quickly and reliably import components from mainland Europe after Brexit.\nStephan Freismuth, BMW’s customs manager, told the Financial Times: “We always said we can do our best and prepare everything, but if at the end of the day the supply chain will have a stop at the border, then we cannot produce our products in the UK.”\nBMW employs more than 7,000 people at four facilities across the UK. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-26T15:31:00.000+03:00", "crawled": "2018-06-26T17:50:45.031+03:00", "highlightTitle": ""}