{"organizations": [], "uuid": "d9442ad84bc131034838909d29d903eef30649e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13187482.ece/ALTERNATES/s1200/IBP_NEC_140416metro_stock_07JPG.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nexus-accused-hypocrisy-after-blocking-14771282", "country": "GB", "domain_rank": 21960, "title": "Nexus accused of hypocrisy after blocking anti-Brexit posters on the Metro", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-11T18:31:00.000+03:00", "replies_count": 0, "uuid": "d9442ad84bc131034838909d29d903eef30649e0"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nexus-accused-hypocrisy-after-blocking-14771282", "ord_in_thread": 0, "title": "Nexus accused of hypocrisy after blocking anti-Brexit posters on the Metro", "locations": [], "entities": {"persons": [{"name": "david hardman", "sentiment": "none"}], "locations": [{"name": "metro click", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNexus have blocked anti-Brexit adverts from being displayed on the Metro, arguing it’s too political to be shown on public transport.\nThe ‘NE4EU’ campaign, which is calling for a second referendum on European Union membership, has accused Metro bosses of hypocrisy over the move.\nNexus has previously allowed adverts from a group advocating a vegan lifestyle, which NE4EU said showed there was a precedent for material of a political nature to be approved.\nWhen the pro-EU campaign had discussions with the advertising agency which sells the right to display posters on the trains, Nexus stepped in to block it. This anti-Brexit poster has been barred from the Metro by Nexus (Image: NE4EU)\nDavid Hardman of NE4EU: “After working with Nexus’ media company for months developing a information poster, we discovered Nexus has a policy that allows them to pick and choose which adverts they feel comfortable displaying.\n“They are happy to have posters that campaign to make the country vegan but not one to inform people what Brexit will mean for the people of the North East.\n“We are proud of the North East and we don’t want people to be misled into thinking that Brexit will make anything better in our great region.\n“Our poster is meant to start a discussion that shows people how much the EU has done for the North East.” Read More The race to find somebody to build new state-of-the-art Metros is on\nNexus hit back by pointing out they have a long-standing policy of barring political advertising on the system which actively call for changes to be made to Government policy or the law.\nA spokesperson said: “Like other urban transit networks, we don’t allow advertising in support of political campaigns to appear on Metro, and never have done.\n“The NE4EU campaign approached the agency which sells space on Metro about a campaign, but we could not permit it when it was referred to us. Read More North East businesses look to relocate to Europe as Brexit nears, report finds\n“The NE4EU campaign has raised the example of ‘go vegan’ lifestyle posters which appeared in 2016, and suggested we are being inconsistent.\n“The vegan campaign did not, however, ask for Government action or a change to the law or public policy - it’s the difference between a poster encouraging people to give up smoking, which we could allow, and a poster calling for cigarettes to be made illegal, which we could not.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-11T18:31:00.000+03:00", "crawled": "2018-06-11T21:39:31.004+03:00", "highlightTitle": ""}