{"organizations": [], "uuid": "d7b0bbe933c8c88d8c6b44a3f1035429d3752d41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article528755.ece/ALTERNATES/s1200/salcombeGIN.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/jam-gin-five-companies-making-1666793", "country": "US", "title": "From jam to gin: The five companies making millions by selling Devon products to the world", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-12T14:22:00.000+03:00", "replies_count": 0, "uuid": "d7b0bbe933c8c88d8c6b44a3f1035429d3752d41"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/jam-gin-five-companies-making-1666793", "ord_in_thread": 0, "title": "From jam to gin: The five companies making millions by selling Devon products to the world", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "angus lugsdin", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "united arab emirates devon", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "east", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "hmrc", "sentiment": "none"}, {"name": "salcombe distilling company", "sentiment": "none"}, {"name": "littlepod", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe South West charge across the globe is on the rise with exports now worth £20.8bn.\nGoods exports rose by 8.8% for the year ended March 2018, according to the latest HMRC figures, outstripping the national average of 6.5% growth in exports of goods across England.\nAnd among them are a host of Devon businesses, including Salcombe Distilling Company, which is heading East so Chinese drinkers can taste a drop of gin for the very first time.\nIt is expanding its global reach after starting exports to Belgium and Spain.\nAngus Lugsdin, co-founder, said: “If we can do it, so can many other local firms like us.” Five Devon businesses that have gone global\nLittlepod, Farringdon\nNext stop - United Arab Emirates\nDevon natural ingredients specialist LittlePod has increased its international sales by 15% in the past year and has now set its sights on the United Arab Emirates for its international growth plans.\nFounded in 2010, the company based at Farringdon, near Exeter, provides vanilla, coffee and chocolate extracts. One of its most popular products is natural vanilla paste in a tube.\nLittlePod began exporting in 2012 and its products, which include co-creations such as a vanilla beer ice cream, vanilla shortbread and a vanilla beer, are now sold in markets including Austria, Estonia, Germany, Hong Kong, Ireland, Portugal, Qatar, Australia and the US.\nExporting currently accounts for 30% of the company’s £300,000 turnover. LittlePod is targeting the UAE as its next export market. The firm has already found success in Qatar, with its products being sold in the country’s international airport.\nSalcombe Distilling Co, Salcombe\nNext stop - China\nSalcombe Distilling Company is set to sell gin to China after heading east for a trade mission.\nThe company has completed its first international orders to Belgium and Spain and has now set its sights to China as a key part of its strategic international expansion plans.\nAngus Lugsdin, co-founder of Salcombe Gin, said: “While the demand for British food, drink and luxury goods is booming in China, gin remains a relatively untapped market. Chinese consumers prefer dark imported spirits, with whisky and brandy being the most popular and many people we spoke to had never tried gin before.”\nThe business has taken part in a trade mission to China with support from advisers at the Department for Environment, Food & Rural Affairs (Defra) and Department for International Trade (DIT) to help establish the brand with potential Chinese buyers and customers.\nThe South West distiller established the award winning gin brand Salcombe Gin in 2016 and has gone from strength to strength picking up many of the top international accolades for its super smooth gin.\nLast year food and drink exports to China from the South West increased by 260%.\nReedy Tools, Newton Abbot\nNext stop - New Zealand\nA Devon tool-maker is set to send its first orders to Australia and New Zealand in major plans to boost its international sales.\nReedy Supplies, a family-owned agricultural and horticultural tool retailer, is planning to increase its exports to 40% of its sales after launching its first online store.\nThe Newton Abbot-based firm, founded in 1972 by Eileen and Don Winter, has been successfully exporting its handmade garden tools to Germany, France, Canada and the United States for two years.\nThe company is now in discussions for its first orders from a distributor in Australia and a large garden retailer in New Zealand.\nThe plan is to find an all-year round market for its seasonal gardening products.\nBlue Sea Food Company, Paignton\nNext stop - China\nTorbay-based The Blue Sea Food Company has increased its international sales of live Devon crab to China by 150% in the last six months as the demand for British seafood in Asia continues to rise.\nThe Blue Sea Food Company processes 2,000 tonnes of crab a year and exports its produce to Europe, Asia and the US, as well as supplying restaurants and caterers across the UK.\nThe business started selling live crab overseas 18 months ago in response to demand for fresh seafood from Chinese buyers. This side of the business has grown rapidly and the business is now investing in the size of its fishing fleet to keep up with orders.\nExporting now accounts for half of the company’s £12 million turnover, and the business plans to grow this by 20% in the next year as it expands its exports to Asia.\nHighfield Preserves, Cullompton\nNext stop - Ukraine\nThe award-winning food manufacturer specialising in jams, chutneys and marmalades, has exported its products for the first time after securing a new contract in Ukraine.\nThe Devon-based company was founded in 1984 and originally operated as a vineyard. The business began to focus on selling home-made jams to its customers and now produces more than 6,000 products a day.\nHighfield Preserves has experienced year-on-year growth for the past 30 years and in 2017 doubled its headcount to 15 members of staff.\nThe company is now looking to tap into new international markets to grow. The contract in Ukraine was secured through the Exporting is GREAT website.\nPaul Shand, Head of Exports for the South West at Department for International Trade, said: “There’s a clear demand for South West goods across the globe, which shows no sign of slowing down. Read More The face of the world's best known brands are created in a field in North Devon\n“It’s encouraging to see local firms harness the power of international trade and outperforming the national average. The South West is home to a growing number of unique and profitable businesses and we know that businesses that export are more profitable, resilient and successful.”\nThe national picture shows that exports of goods from England increased by 6.5% to £244.6bn.\nThe figures for the first quarter of 2018 (Jan – Mar) show that South West is home to more than 8,400 exporters, an increase of 4.3% when compared to the first quarter of 2017, with an average value of £638,000 per exporter, up 2.2%. Read More Pizzerias, tattooists and a tea lady - these are the saviours of Exeter High Street\nInternational Trade Secretary, Dr Liam Fox said: “As we continue our path to Brexit, HMRC’s latest figures clearly show every part of the UK making the most of global opportunities as goods exports rise across the country. More than 100,000 businesses are expanding their horizons and making the most of the demand for quality British goods. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-12T14:22:00.000+03:00", "crawled": "2018-06-12T14:54:31.002+03:00", "highlightTitle": ""}