{"organizations": [], "uuid": "1d5b3b9c75aebf0a36b000f6df8eb09b932d34b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/special-features/article1671987.ece/ALTERNATES/s1200/Jo-Fairley1new.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/special-features/rare-chance-hear-how-green-1663568", "country": "GB", "title": "Rare chance to hear how Green & Black's founder created a multi-million-pound chocolate empire", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-14T14:51:00.000+03:00", "replies_count": 0, "uuid": "1d5b3b9c75aebf0a36b000f6df8eb09b932d34b1"}, "author": "Andy Pyle", "url": "https://www.devonlive.com/special-features/rare-chance-hear-how-green-1663568", "ord_in_thread": 0, "title": "Rare chance to hear how Green & Black's founder created a multi-million-pound chocolate empire", "locations": [], "entities": {"persons": [{"name": "jo fairley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "cornwa", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "sandy park conference centre", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "green & black", "sentiment": "none"}, {"name": "green & blacks", "sentiment": "none"}, {"name": "trinity mirror south west", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertorial Rare chance to hear how Green & Black's founder created a multi-million-pound chocolate empire Jo Fairley joins a host of fascinating must-see speakers as Business West brings its Trade Horizons Roadshow to Exeter Share Andy Pyle Commercial Editor, Trinity Mirror South West 12:51, 14 JUN 2018 Jo Fairley is the co-founder of Green & Blacks Chocolate Share\nBusinesses in the South West are being given an opportunity to take advantage of free expert advice as they prepare for the challenges and opportunities that Brexit will inevitably bring.\nExport for Growth, in partnership with Business West, will be delivering its Trade Horizons Roadshow across the South West throughout June and July - and will be visiting Sandy Park Conference Centre in Exeter on Tuesday, July 3.\nThese events aim to support those looking to take full advantage of potential future international sales opportunities, and prepare for any risks associated with Brexit. Read More Schools and colleges which can offer a 'fantastic' education\nFrom June 21 to July 3, the Roadshow will visit four locations in Cornwall, Bristol, Swindon and Exeter, and each event will host four keynote speakers - two of which will be successful British export businesses, and the others Brexit experts, who will discuss potential future issues as well as opportunities and trends.\nThose who attend the Exeter event - which runs from 9.30am to 5pm - will be able to hear from Green & Blacks Chocolate co-founder Jo Fairley. Regarded as one of the UK's leading female entrepreneurs, Jo co-founded Green & Black's in 1991, and it is now approaching a £100m-a-year brand.\nHer success has seen her receive many prestigious awards, including WorldAware Award and many Soil Association Awards (both for Green & Black's and Judges Bakery). She has also received an Honorary Doctorate in Business Studies from Kingston University, and The Shackleton Medal for leadership and citizenship, from The Scottish Royal Geographical Society. Brexit expert, Sam Lowe, from The Centre for European Reform (Image: Anthony Upton)\nJo will be joined by Brexit expert, Sam Lowe, from The Centre for European Reform, who will focus on life outside the EU and explain customs implications that may affect your business.\nOn the day, you’ll also hear from Will Higham, a consumer futurist who will give an overview of global trends, emerging markets, and his predictions on important opportunities for growth in international trade, while strategists Katrina McWhinnie and Frances Fawcett will also be presenting their views on why Brexit is an opportunity that needs to be seized.\nFollowing the morning sessions, visitors will be able to explore the Export Advice Zones where they can access a wide range of free support tailored to the needs of their business, including a free ‘Brexit Health Check’ or advice on how to pitch their product in China.\nThe Trade Horizons Roadshow is part of a wider series of activity Business West is delivering in preparation for Brexit. Last month, Business West teamed up with Business Showcase South West to welcome Secretary of State for International Trade, the Rt Hon Dr Liam Fox, to Leigh Court. He addressed 150 local businesses on the positive position the South West currently finds itself in terms of export opportunity and growth. What's on the agenda\n10am: The morning will consist of four keynote speakers:\nJo Fairley co founder of Green & Blacks\nSam Lowe, Brexit expert, The Centre for European Reform\nWill Higham, consumer futurist\nKatrina McWhinnie, Brexit strategist\n1pm: Networking lunch and the opportunity to browse the Match-Making Expo area and meet local service providers who can help with all aspects of overseas trade.\n1.45 pm to 5pm: Choose the right Export Advice Zones for your business and access a wide range of free support tailored to you.\nExport Essentials Zone – a series of 30-minute drop-in seminars for companies who are considering exporting for the first time, providing guidance on how to get started and grow your exports.\nGlobal Growth Zone – a series of 30-minute drop-in seminars focusing on more technical/advanced subjects for those already exporting who want to increase their export activity into new markets, including accessing complex high-growth markets outside of the EU.\nMeet the Expert Zone – Private consultations with a leading expert, such as Brexit Health Check, IP advice, Business Pitch Coaching. (These consultations must be booked in advance, once you are registered to attend the main event, details about these sessions will be provided for booking.)\nJames Monk, commercial director for Business West, said: \"The roadshow is a fantastic way to help companies in the region understand more around the challenges and opportunities that Brexit brings; not just within Europe but across the rest of the world.\n\"At Business West we can do much more for companies than just provide support through Export for Growth and the Department for International Trade. Once we've encouraged and prepared businesses to export, we don't stop there - we support those companies even further. Katrina McWhinnie will be presenting her views on Brexit\n\"As one of the country's leading and largest Chambers of Commerce, we can provide export documentation and help companies with fulfilment of orders, getting their goods into the marketplace and working with banks and with Letters of Credit to ensure companies get paid. We don't just encourage people; it's all about helping them to physically make the contacts and then do the business.\n\"The Trade Horizons Roadshow is another example of Business West going the extra mile to ensure companies are prepared for what Brexit brings. In the last couple of years we've collectively taken the South West from being the worst performing region in the country in terms of export to the fastest growing. We're confident that we can guide the South West through Brexit with events like this and ensure this region continues to grow its export activity in the future.\"\nClick here for more information about how to book your place at the Trade Horizons Roadshow in Exeter. You'll find the Sandy Park Conference Centre at Sandy Park Way, Exeter, Devon, EX2 7NN. Like us on Facebook", "external_links": ["https://www.eventbrite.co.uk/e/the-trade-horizons-roadshow-exeter-tickets-45680097401?aff=devonlivenative", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-14T14:51:00.000+03:00", "crawled": "2018-06-14T15:01:13.020+03:00", "highlightTitle": ""}