{"organizations": [], "uuid": "8dba356c11fedbbc59ed08b0ac032c0edc0bed6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14101803.ece/ALTERNATES/s1200/SGP_NEC_241117ASYLUM10JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sunderland-mp-julie-elliott-slammed-14849788", "country": "GB", "domain_rank": 21960, "title": "Sunderland MP Julie Elliott slammed over calls to halt asylum seekers being house in the city", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-30T17:29:00.000+03:00", "replies_count": 0, "uuid": "8dba356c11fedbbc59ed08b0ac032c0edc0bed6b"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sunderland-mp-julie-elliott-slammed-14849788", "ord_in_thread": 0, "title": "Sunderland MP Julie Elliott slammed over calls to halt asylum seekers being house in the city", "locations": [], "entities": {"persons": [{"name": "julie elliott", "sentiment": "negative"}, {"name": "ms elliott", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "news sunderland", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Sunderland MP Julie Elliott slammed over calls to halt asylum seekers being house in the city The Labour MP said a temporary halt should be put on asylum seekers being moved to Sunderland in response to 'tensions' in community Share House in the West end of Newcastle showing cramped conditions for women asylum seekers and their children (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAn MP has come under fire for demanding a halt to asylum seekers being housed in her city.\nIn a letter to Home Secretary Sajid Javid, Sunderland Central MP Julie Elliott called for a temporary clampdown to alleviate “tensions” in the city.\nOne Wearside opposition politician accused the Labour MP of making comments “straight out of the far-right playbook”.\nIn the letter, Ms Elliott states: “I would ask that, in light of the current issues within the city of Sunderland ... that a temporary stop is put on any new asylum seekers being allocated to the city of Sunderland.\n“I feel the police and the council are doing everything within their powers and recourses to address the situation facing our city, but I do feel very strongly that in the current climate they need to be given the space and time to deal with the situation.”\nDeputy leader of Sunderland City Council , Michael Mordey, has previously lobbied the Government to take a similar course of action.\nHe previously stated: “As a council we have written direct to the Home Secretary to demand that he immediately halts the Government dispersal policy, that has created the issues in this particular local community.”\nBut Liberal Democrat opposition leader Niall Hodson slammed Ms Elliot’s hard-line stance. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nHe said: “Julie Elliott’s comments are straight out of the far-right playbook.\n“It is appalling to see a Labour MP sinking so low and making statements which only serve to make the tensions in Sunderland worse.\n“I am genuinely shocked at her letter. To turn away vulnerable people fleeing war, persecution and torture around the world - this isn’t what you’d expect from a great city.\n“We should not be in the business of shunning those in need, nor pandering to rogue elements in our society, no matter how vocal.\n“Julie needs to drag herself up out of the gutter, grow a backbone, and behave like an MP who represents everyone who calls Sunderland home.” Read More Dame Vera Baird calls on MPs to protect victims of revenge porn and upskirting\nNorthumbria Police and Vera Baird, the force’s police and crime commissioner, declined to comment on the letter.\nAsked to comment on the letter, Ms Elliott MP said: “The Home Office needs to act on my letter as soon as possible in order to allow local services to deal with serious issues which are currently affecting some of my constituents.\n“It is important that whilst Sunderland remains a welcoming and diverse city, we also have safe communities where everyone can feel at ease in their neighbourhood and homes.” Read More Nine North East politicians call for referendum on Brexit deal after stark Nissan warning\nA Home Office spokesperson: “We take the wellbeing of asylum seekers and the local communities in which they live extremely seriously.\n“We will be meeting Sunderland together with other North East Local Authorities in the very near future to discuss the concerns they have raised.\n“We are committed to working closely with local partners, including local authorities and the police, to identify, manage and prevent welfare and cohesion problems.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-30T17:29:00.000+03:00", "crawled": "2018-06-30T18:21:58.006+03:00", "highlightTitle": ""}