{"organizations": [], "uuid": "dc5423b2fc03540332287b3c4691780f0d310abc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14781976.ece/ALTERNATES/s1200/Prime-Ministers-Questions.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-suffers-rebellion-74-14781954", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn suffers rebellion as 74 Labour MPs vote to keep UK in single market", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-13T23:16:00.000+03:00", "replies_count": 0, "uuid": "dc5423b2fc03540332287b3c4691780f0d310abc"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-suffers-rebellion-74-14781954", "ord_in_thread": 0, "title": "Jeremy Corbyn suffers rebellion as 74 Labour MPs vote to keep UK in single market", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "phil wilson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "invalid email seventy-four labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Jeremy Corbyn suffers rebellion as 74 Labour MPs vote to keep UK in single market The Treasury says leaving the single market will devastate the North East economy but Labour MPs were told to abstain Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nSeventy-four Labour MPs have rebelled against party leader Jeremy Corbyn and voted to keep the UK in the single market.\nBut despite being joined by three Conservative rebels who also backed single market membership, the proposal was defeated in the House of Commons by 327 votes to 126.\nAnother 15 Labour MPs voted against continued membership of the single market.\nIt means a total of 89 Labour MPs ignored instructions from the party leadership to abstain on the key Brexit vote.\nNorth East MP Phil Wilson was among the Labour rebels.\nHe voted to stay in the single market, and told the House of Commons: “For me, staying in the single market and the customs union is critical to jobs and prosperity.”\nMPs were voting on the European Union (Withdrawal) Bill, which repeals the legislation that made the UK a member of the EU.\nThe House of Lords had previously added an amendment to the Bill designed to keep the UK in the European Economic Area.\nIn practice, this would mean we remained part of the single market, which allows for the free trade of goods and services.\nThe Conservative Government wants to leave the single market, and asked MPs to delete the amendment.\nLabour leader Jeremy Corbyn ordered his MPs to abstain. Labour opposes single market membership on the grounds that it means obeying rules which are drawn up by the EU and allowing freedom of movement, but claims that it would be able to negotiate a new deal allowing the UK to keep all the advantages of membership.\nWhen it came time to vote in the House of Commons, a number of Labour MPs refused to toe the line.\nThose voting to stay in the single market included Julie Elliott, Labour MP for Sunderland Central; Catherine McKinnell, Labour MP for Newcastle North; Bridget Phillipson, Labour MP for Houghton and Sunderland South; Anna Turley, Labour MP for Redcar; Paul Williams, Labour MP for Stockton South, and Phil Wilson, Labour MP for Sedgefield.\nThose voting to leave included Ronnie Campbell, Labour MP for Blyth Valley, and Keven Jones, Labour MP for North Durham.\nOne shadow minister, Crewe and Nantwich MP Laura Smith, resigned from her Shadow Cabinet Office role in order to vote against EEA membership.\nFour Labour MPs also resigned from junior roles assisting shadow ministers, known as PPS roles. Read More Operation Sanctuary victims 'need support for decades to come', North East MP says\nExplaining why he backed continued membership, Mr Wilson pointed out that 62% of the North East’s exports are with the EU.\nHe said: “My region has seen industrial extinction in the past. So we’ve got to make sure that it doesn’t happen in the future.\n“If 62% of your trade is with the EU, it would be a catastrophic mistake to put barriers to trade if you can avoid it.”\nLabour MPs who abstained included Chi Onwurah, MP for Newcastle upon Tyne Central.\nIn a blog post written for ChronicleLive, she said European Economic Area (EEA) membership would make the UK like Norway, a country which is currently in the EEA but not in the EU.\nShe said: “It is the Norway model and we are not Norway, we have ten-times more people, and an economy approximately seven times larger in which agriculture does not play as significant a part. Norway are not in the Customs Union.\n“We do not want to be rule takers but active participants in a single market that reflects both the value of immigration and the ways in which freedom of movement is current exploited by the unscrupulous.” Read More 83 North East MPs demand Northern is stripped of its rail franchise\nA separate amendment which was backed by the Labour leadership, calling for the UK to retain full access to the single market without being a member, was defeated by 240 to 322.\nA study by the Treasury published in February warned that leaving the EU with a comprehensive trade deal would shrink the North East’s economy by 11% but leaving and staying in the single market would shrink it by just 3%.\nThere are currently 31 members of the EEA. These are the 29 members of the EU, including the UK, and Iceland, Liechtenstein and Norway. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-13T23:16:00.000+03:00", "crawled": "2018-06-14T01:02:44.000+03:00", "highlightTitle": ""}