{"organizations": [], "uuid": "1dd74ce048b4f94693f490677989c399c817095e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14830191.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nissan-workers-will-never-forgive-14841412", "country": "GB", "domain_rank": 21960, "title": "Nissan workers 'will never forgive us' if Brexit destroys their jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-28T20:00:00.000+03:00", "replies_count": 0, "uuid": "1dd74ce048b4f94693f490677989c399c817095e"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nissan-workers-will-never-forgive-14841412", "ord_in_thread": 0, "title": "Nissan workers 'will never forgive us' if Brexit destroys their jobs", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "neutral"}, {"name": "carlos ghosn", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "neutral"}, {"name": "bbc", "sentiment": "none"}, {"name": "renault-nissan-mitsubishi alliance", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan workers 'will never forgive us' if Brexit destroys their jobs MP speaks out after Nissan boss says Brexit uncertainty stops the firm investing Share Workers at Nissan (Image: PA) Share Get daily Could\nNissan workers “will not forgive us” if Brexit destroys their jobs, an MP has said.\nIt follows a warning from carmaker Nissan that future investment in the firm’s Sunderland factory is impossible while there is so much uncertainty surrounding Brexit.\nCarlos Ghosn, chief executive of the Renault-Nissan-Mitsubishi alliance, told the BBC: “We don’t want to take any decisions in the dark. We don’t want to take any decisions we might regret in future.”\nBridget Phillipson, MP for Houghton and Sunderland South, said: “Brexit fantasy is crashing head-first into reality. Because of the ongoing Brexit uncertainty, growing numbers of major employers in this country, now including Nissan, are starting to make investment decisions that will have serious negative knock-on effects for jobs and livelihoods. Labour Party's Bridget Phillipson (Image: PA)\n“My constituents who work directly for Nissan, or who are employed in their supply chain, will not forgive us if Brexit results in the loss of their jobs. We must stop putting ideology before the livelihoods of the people we have been sent to Westminster to represent.”\nShe is one of the MPs supporting the “People’s Vote” campaign, which calls for a referendum on whether to accept whatever Brexit deal is agreed between the UK and EU.\nMs Phillipson said: “Whether you voted leave or remain, just one in 10 people now think the Brexit process is going well. Read More Report reveals the truth about the North-South transport funding gap - and it isn't pretty\n“It’s becoming clear that Sunderland, the North East and Britain as a whole is heading for a bad deal. That’s why more and more people are supporting the idea of a People’s Vote on the final Brexit deal.”\nA committee of MPs has suggested Brexit should be delayed if no deal can be agreed in time. The Nissan factory in Sunderland (Image: Unknown)\nThe UK is set to leave the EU on March 29 2019, and it is hoped that a deal will be agreed by October this year, allowing it to be ratified by the UK and European Parliaments.\nBut the House of Commons Committee for Exiting the European Union warned that there may not be enough time to complete all the work that is needed in time.\nIn a report, calls were repeated for an extension to the exit timetable if an agreement has not been finalised and called for the Government to secure a mechanism which would also allow for any transition period to be extended.\nThe Brexit Committee also said it did not accept that Britain would leave without a deal if the Commons rejected the agreement secured by Prime Minister Theresa May. Read More A huge row has erupted in the Labour Party over plans to 'sideline' councillors\nCommittee chairman Hilary Benn said: “It is now more than two years since the referendum and the Government has yet to agree on the customs arrangements it wants with our biggest, nearest and most important trading partner.\n“We are told that most of the work on the withdrawal agreement is done, but the remaining issues represent some of the toughest questions the Prime Minister must grasp, and negotiations on the future partnership have yet to start in earnest.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-28T20:00:00.000+03:00", "crawled": "2018-06-28T21:41:40.003+03:00", "highlightTitle": ""}