{"organizations": [], "uuid": "cc271f254b7b7fb7d3e39ba5ee19c6c01a8222ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14827105.ece/ALTERNATES/s1200/CFR_NJL_070214hyperdrive_01.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/sunderland-car-battery-firm-begin-14826910", "country": "GB", "domain_rank": 21960, "title": "Sunderland car battery firm to begin powering offices with its technology", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-25T18:36:00.000+03:00", "replies_count": 0, "uuid": "cc271f254b7b7fb7d3e39ba5ee19c6c01a8222ec"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/sunderland-car-battery-firm-begin-14826910", "ord_in_thread": 0, "title": "Sunderland car battery firm to begin powering offices with its technology", "locations": [], "entities": {"persons": [{"name": "peter atkinson", "sentiment": "none"}, {"name": "stephen irish", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "hyperdrive innovation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sunderland car battery firm to begin powering offices with its technology Hyperdrive Innovation is looking at using its battery packs to power homes using solar energy Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBattery technology created in the North East could soon be used to power homes and offices around the world.\nHyperdrive Innovation produces battery packs that are used within electric vehicles, but the company’s managing director Stephen Irish has said the company will also be using its batteries to help solve the UK’s energy crisis.\nThe system works by using solar panels to charge batteries which can then be used to power homes when electricity prices are at their highest. The team at Hyperdrive Innovation (Image: Peter Atkinson Photography)\nIn the past those with solar panels were only able to send the electricity they produced back to the grid, but the new tech means people are now able to use the electricity themselves.\nMr Irish said: “If you have a battery in your home, you can decouple the supply and demand mis-match and it means anyone can use their own energy.\n“If you link them together it also means you can buy and sell the energy or lend it to others.”\nThis linked network means that energy that you store during the day can be directed to your neighbour’s home, if they are low on their own supply. One of Hyperdrive Innovation's new products - a 12V battery module (Image: Publicity Pic)\nUsing batteries to power homes is already being trialled in Cologne, Germany, as part of the SmartCity project, which aims to find new ways of tackling climate change.\nSmartCity Cologne has also provided its residents with smart energy devices, which show the price of electricity at different times allowing them to choose to use their devices at the cheapest times.\nDr Barbara Möhlendick, from Smart City Cologne, said: “We gave away smart energy devices, which recognise what the price of energy is. They can see then when to turn their dish washers on and can have competitions with their neighbours about how much energy they save. There are also smart offices as well. Read More Digital car parks, art work and yoga: is this the future of Newcastle city centre?\n“It’s also safer for people as if a thief opens a window, it sends a message to the owner of the shop to tell them the window is open.”\nThe trial has only been adopted by around 35 people but it is hoped that far more residents of Cologne will begin using the batteries to combat climate change.\nHowever, the technology is becoming more mainstream and large businesses are now looking to get in on the action to reduce their energy bills. Read More North East businesses are 'exasperated' by Brexit talks, PM is told\nMr Irish explained that businesses are able to fill entire shipping containers with batteries and use them as energy storage centre’s for their offices.\nHyperdrive Innovation predominately uses its batteries in cars and autonomous vehicles but Mr Irish added that he sees energy storage systems for homes and businesses as a major “growth area” for the firm. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-25T18:36:00.000+03:00", "crawled": "2018-06-25T20:53:39.032+03:00", "highlightTitle": ""}