{"organizations": [], "uuid": "8105acb14e2dfb0f7eb61d2d322b6ec2f2d543ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14746088.ece/ALTERNATES/s1200/JS153085279.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-accused-contempt-democracy-after-14745993", "country": "GB", "domain_rank": 21960, "title": "Theresa May accused of 'contempt for democracy' after packing EU votes into one day", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-05T15:08:00.000+03:00", "replies_count": 0, "uuid": "8105acb14e2dfb0f7eb61d2d322b6ec2f2d543ac"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-accused-contempt-democracy-after-14745993", "ord_in_thread": 0, "title": "Theresa May accused of 'contempt for democracy' after packing EU votes into one day", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "julian smith", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May accused of 'contempt for democracy' after packing EU votes into one day MPs face a mammoth day of Brexit debates and votes over the EU (Withdrawal) Bill on Tuesday, June 12 Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTheresa May was accused of showing “contempt for democracy” after it emerged she will attempt to overturn all 15 Lords defeats on her flagship Brexit legislation in a single dramatic day.\nMPs have been told to prepare for a packed day of votes on the EU (Withdrawal) Bill continuing late into the night, on Tuesday June 12.\nBut the decision to cram debate into a single day was condemned by Newcastle Central MP Chi Onwurah, a Labour MP, who said: “The most important decision of the post-war era merits only 12 hours of Parliamentary time.\n“The Government is showing its contempt for democracy, our future economy and parliamentary sovereignty.” Chi Onwurah (Image: Newcastle Chronicle)\nJulian Smith, the Conservative Chief Whip, has written to Tory MPs warning that votes will continue “well beyond” the time when MPs usually stop holding debates, which on a Tuesday is 10pm.\nHe said they must stay on the Parliamentary estate “at all times”, so that they can be summoned to take part in votes as needed.\nIt promises to be a day and night filled with drama, because Theresa May’s authority will be on the line.\nIn theory, Labour MPs and rebel Conservatives could join forces to back the Lords changes and inflict a devastating defeat on Theresa May. Tory whips will be working hard to try to stop that happening. Prime Minister Theresa May (Image: PA)\nThe Lords amendments - which the Government wants to overturn - include:\n• Removing the exit day of March 29 2019 from the Bill, and not allowing the Government to name an exit day until it has been approved by resolutions of both Houses of Parliament\n• Requiring the Government to attempt to negotiate continued membership of the European Economic Area (in other words, keeping the UK in the Single Market)\n• Requiring the Government attempt to negotiate UK membership of a customs union with the EU.\n• Making it harder to axe EU law in the UK regarding employment rights, equality, health and safety, consumer standards and environmental standards\n• Keeping most of the EU’s Charter of Fundamental Rights on the UK statute book\n• Making it harder for the Government to modify those EU laws that remain in force after Brexit\n• Creating ways for Parliament to force the Government to renegotiate the Brexit agreement with the EU (in practice this could allow the House of Commons or House of Lords to delay Brexit)\n• Requiring the Government to continue to obey some EU rules about the treatment of asylum seekers\n• Including support for the Good Friday Agreement in the Bill. In practice this could make it harder to carry out Brexit if the question of the border between Northern Ireland and Ireland hasn’t been resolved The EU and Union flags (Image: PA)\nMrs May could face a rebellion from Conservative MPs who back calls for the UK to negotiate membership of a customs union with the EU.\nLabour leader Jeremy Corbyn could also face a rebellion from Labour MPs who back the Lords call for the UK to remain in the single market, which he opposes.\nThe EU (Withdrawal) Bill repeals the European Communities Act 1972 - the law that took us into what is now known as the EU - and paves the way for Brexit, which is due to take place at 11pm on March 29 2019. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-05T15:08:00.000+03:00", "crawled": "2018-06-05T16:03:06.000+03:00", "highlightTitle": ""}