{"organizations": [], "uuid": "1e90f008a5e5d5a454fb3b5737ae9474a73a0424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14608018.ece/ALTERNATES/s1200/TMP_NEC_050216Trevelyan_04JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/give-deal-you-wont-your-14741985", "country": "GB", "domain_rank": 21960, "title": "Give us a deal or you won't get your £40bn, pro-Brexit MP tells European Union", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-05T07:00:00.000+03:00", "replies_count": 0, "uuid": "1e90f008a5e5d5a454fb3b5737ae9474a73a0424"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/give-deal-you-wont-your-14741985", "ord_in_thread": 0, "title": "Give us a deal or you won't get your £40bn, pro-Brexit MP tells European Union", "locations": [], "entities": {"persons": [{"name": "anne-marie trevelyan", "sentiment": "negative"}, {"name": "mrs trevelyan", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "european union conservative", "sentiment": "negative"}, {"name": "berwick", "sentiment": "negative"}, {"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "european union and union", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "sunday times", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Conservative MP for Berwick Anne-Marie Trevelyan (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe UK will refuse to pay the £40bn Brexit “divorce bill” if the EU fails to sign a trade treaty with us, pro-Brexit MP Anne-Marie Trevelyan has claimed.\nShe issued the threat after it emerged Whitehall officials have drawn up papers warning of dire consequences for the country if there is no deal by the time we leave the EU.\nThe Sunday Times newspaper reported that officials believe supermarkets in Cornwall and Scotland will run out of food within a couple of days, and hospitals will run out of medicines within two weeks.\nMrs Trevelyan, MP for Berwick-upon-Tweed, told the BBC: “\nWe don’t want a no deal position. We want to get a deal were there is great trading frameworks in a new arrangement.\n“And if that doesn’t happen, the Europeans wont see their £40bn.” European Union and Union flags outside the Houses of Parliament in Westminster (Image: PA)\nThe Treasury has estimated that the UK will need to pay between £35bn and £39bn after Brexit, which is due to take place on March 29.\nThis is money that the UK has already committed to paying, such as pension liabilities.\nThe threat sparked a response from Conservative MP Anna Soubry, who opposed Brexit in the 2016 referendum.\nShe pointed out that Mrs Trevelyan has a role as a Parliamentary Private Secretary in the Ministry of Defence.\nThis is not a Ministerial role, and Mrs Trevelyan is not considered to be a member of the government.\nHowever, Mrs Soubry said: “Having different members of the Government saying contradictory things about the divorce bill only serves to damage the UK’s credibility in the negotiations and to confuse the public.\n“It is crucial therefore that we know whether Anne-Marie Trevelyan was speaking as a member of the Government.” Read More New petrol and diesel cars will be banned from 2040 - but is that too long to wait?\nThe UK will be “fully prepared” for leaving the European Union without a deal, Downing Street has insisted,\nPrime Minister Theresa May still believes that “no deal is better than a bad deal”, and a “significant amount of work” had been done to make sure the UK could cope without a Brexit agreement, Downing Street said.\nThe Prime Minister’s official spokesman said: “A significant amount of work and decision-making has gone into our no deal plans, especially as it relates to ports, and we know that none of this would happen.”\nAsked if that was a “cast iron guarantee”, the spokesman said: “We are planning for all scenarios and we will make sure that we are fully prepared in the event of any eventuality.”\nBut the Government had “equally been clear that we will secure a good deal” and it was “in the interests of both the UK and the EU to do so”. Read More North East leaders throw weight behind Heathrow's third runway as Government decision imminent\nA promised white paper on Brexit may not be published before the June summit of EU leaders as Downing Street said it was “not putting a time frame on it”.\nAn indication of Europe’s concerns about the lack of progress came from Germany’s top Brexit diplomat Peter Ptassek, who played down expectations about the June 28-29 European Council.\n“Not many are expecting very much now,” he said. “If this is so, October would then have to solve all problems [withdrawal, NI, governance, future...] in one go. Odds still unclear.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-05T07:00:00.000+03:00", "crawled": "2018-06-05T08:07:03.008+03:00", "highlightTitle": ""}