{"organizations": [], "uuid": "7d66fa5d4c747bfc95f9bcaec7da54f94e554b5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14501844.ece/ALTERNATES/s1200/JHP_WLTV_2708tyr2getty_09JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/health/children-urged-run-mile-each-14825633", "country": "GB", "domain_rank": 21960, "title": "Children urged to run a mile each day to help tackle Britain's obesity crisis", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-25T16:13:00.000+03:00", "replies_count": 0, "uuid": "7d66fa5d4c747bfc95f9bcaec7da54f94e554b5a"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/health/children-urged-run-mile-each-14825633", "ord_in_thread": 0, "title": "Children urged to run a mile each day to help tackle Britain's obesity crisis", "locations": [], "entities": {"persons": [{"name": "sharon hodgs", "sentiment": "negative"}, {"name": "hunt", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "invalid email school", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Children urged to run a mile each day to help tackle Britain's obesity crisis Labour MP Sharon Hodgson says the Government is being too cautious in bid to cut child obesity Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nSchool pupils will be encouraged to run or walk a mile every day, under the Government’s latest plans to cut obesity.\nOther measures include requiring cafes and restaurants to reveal how many calories are in the food they serve.\nThey’re part of a range of policies announced by Health Secretary Jeremy Hunt, designed to halve childhood obesity by 2030.\nNHS figures show that 10.7% of North East children in reception, a little more than one in ten, are obese.\nAnd 22.5% of North East children in year six, more than one in five, are overweight.\nAcross England as a whole, 20% of year six children are obese.\nMr Hunt said: “Parents want what is best for their children, but keeping them healthy and active can be difficult.”\nBut Labour claim the plans are too timid because the Government has launched consultations on many of its proposals rather than taking immediate action.\nSharon Hodgson , Labour MP for Washington and Sunderland West and the Shadow Minister for Public Health, said the Government was “failing to take a bold stance on tackling obesity”. Obese child measuring herself\nShe called for a ban on advertising for unhealthy food before 9pm and online, and immediate restrictions on the sale of “energy drinks” to children.\nMs Hodgson said: “The Government must take urgent, and truly bold, action against the obesity epidemic.\n“That means introducing a pre-watershed and online ban on advertising for products that are high in fat, salt and sugar (HFSS) and restricting the sale of energy drinks to children, without further delay, because the evidence is already clear.”\nMeasures announced by the Government include:\n• Calling on every primary school to introduce an “active mile” initiative, which means children and staff walk, jog or run a mile each day\n• Banning stores from displaying unhealthy food at checkouts or including it in buy-one-get-one-free deals\n• A consultation on calorie labelling on menus in restaurants, cafés and takeaways, in a similar way to labelling that already exists on food sold in shops\n• A consultation banning the sale of harmful, caffeine laden energy drinks to children. A quarter of six to nine-year-olds consume these energy drinks, which have as much caffeine as a cup of coffee\n• Possible restrictions on unhealthy food adverts shown during TV programmes up to 9pm. Read More MPs want police inquiry into whether Russia funded Brexit campaign\nThis is part two of the Government’s anti-obesity strategy.\nThe first part included sugar tax on high-sugar soft drinks, and setting a target of cutting sugar content of all food and drinks by 20%.\nMr Hunt said: “It is near impossible to shield children from exposure to unhealthy foods.\n“Parents are asking for help – we know that over three quarters of parents find offers for sugary sweets and snacks at checkouts annoying.\n“It’s our job to give power to parents to make healthier choices, and to make their life easier in doing so.” Read More Top Labour MPs Nick Brown and Ian Lavery will vote in favour of Heathrow third runway\nLabour says it has plans to halve childhood obesity within a decade as part of a commitment to having “the healthiest children in the world”.\nPolicies include a ban on adverts for junk food, sweets and sugary drinks on primetime television shows such as X Factor, Hollyoaks and Britain’s Got Talent.\nThe party is also pledging to increase restrictions to online junk food advertising, saying these are increasingly urgent because children are spending more time online than watching TV. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-25T16:13:00.000+03:00", "crawled": "2018-06-25T16:59:42.001+03:00", "highlightTitle": ""}