{"organizations": [], "uuid": "8e5200764adf49e66b87215604c1d593ef8bfbf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12546006.ece/ALTERNATES/s1200/heathrow.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/transport-secretary-promises-heathrow-third-14747051", "country": "GB", "domain_rank": 21960, "title": "Transport Secretary promises Heathrow third runway will benefit regional airports", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-05T18:00:00.000+03:00", "replies_count": 0, "uuid": "8e5200764adf49e66b87215604c1d593ef8bfbf0"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/transport-secretary-promises-heathrow-third-14747051", "ord_in_thread": 0, "title": "Transport Secretary promises Heathrow third runway will benefit regional airports", "locations": [], "entities": {"persons": [{"name": "grayling", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "north durham", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham tees valley", "sentiment": "none"}], "organizations": [{"name": "news transport", "sentiment": "negative"}, {"name": "transport sec", "sentiment": "negative"}, {"name": "transport", "sentiment": "negative"}, {"name": "invalid email transport", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Transport Secretary promises Heathrow third runway will benefit regional airports Transport Secretary Chris Grayling says slots will be reserved for regional flights as he confirms backing for third runway Share Heathrow expansion will create 5,000 jobs in the North East according to airport bosses Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTransport Secretary Chris Grayling promised to ensure regional airports such as Newcastle and Durham Tees Valley benefit from Heathrow expansion.\nHe issued the pledge as he confirmed a third runway at Heathrow Airport had been given the go-ahead by the Cabinet.\nThe announcement was welcomed by North East MPs, but they warned that their support depended on the Government sticking to its word and ensuring the region has a chance to benefit.\nNewcastle Central MP Chi Onwurah told Mr Grayling that expanding Heathrow “is the right option providing it delivers for regional economic growth”. Newcastle MP Chi Onwurah (Image: Newcastle Chronicle)\nNorth Durham MP Kevan Jones urged the Transport Secretary to publish details of how “slots” at Heathrow - the times reserved for flights to land or take off - would be used for regional flights, allowing more flights to Newcastle International Airport or for services to be introduced to Durham Tees Valley Airport.\nAnd Sedgefield MP Phil Wilson also asked for assurances that slots would be ring-fenced for domestic flights. Heathrow Airport Terminal 2, Heathrow, London (Image: Get Surrey)\nMr Grayling pledged: “I’m very clear that there will legally binding mechanisms in place to reserve those slots for regional airports.”\nHe said: “Durham Tees Valley is one of the airports that’s been identified by Heathrow as a potential beneficiary of the expansion.”\nThe project was approved at a meeting of ministers on the Cabinet’s economic sub-committee. Transport Secretary Chris Grayling (Image: PA)\nMPs will be given a vote on the scheme by early July.\nConservative MPs will be told to back a third runway. But Foreign Secretary Boris Johnson, who once vowed to “lie down in front of the bulldozers” at the airport, is expected to miss the vote - and in a relaxation of Cabinet collective responsibility rules, he will be allowed to speak out against the plan. Read More\nHe won’t be the only Tory rebel. However, the Government is likely to win the vote easily, because it will have the support of SNP MPs who back Heathrow expansion. Andy McDonald MP (Image: Daily Mirror)\nLabour’s position is unclear. Shadow transport secretary Andy McDonald told MPs: “Expansion should only happen if it can effectively deliver on the capacity demands, if noise and air quality issues are fully addressed, if the UK’s climate change obligations are met in their entirety, and that growth across the country is supported.\n“We owe it to future generations to get all of these factors absolutely right, but if the correct balance isn’t found then the law courts will quite rightly intervene.” Read More Give us a deal or you won't get your £40bn, pro-Brexit MP tells European Union\nHowever, Labour Shadow Chancellor John McDonnell said on Twitter: “I remain implacably opposed to expansion at Heathrow and after listening to the transport minister, Chris Grayling, today I am even more convinced that this would be a costly, environmental and social disaster that will never be built.”\nA number of North East Labour MPs are firmly in favour. North East England Chamber of Commerce and Newcastle International Airport also back Heathrow expansion. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-05T18:00:00.000+03:00", "crawled": "2018-06-05T18:24:25.025+03:00", "highlightTitle": ""}