{"organizations": [], "uuid": "878ca08873762c1d0e8ab0ed3d60d357400cdf8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14790940.ece/ALTERNATES/s1200/JS73863323.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/creating-free-ports-north-east-14790407", "country": "GB", "domain_rank": 21960, "title": "Creating free ports in North East could create 26,000 jobs, new report claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-18T02:01:00.000+03:00", "replies_count": 0, "uuid": "878ca08873762c1d0e8ab0ed3d60d357400cdf8e"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/creating-free-ports-north-east-14790407", "ord_in_thread": 0, "title": "Creating free ports in North East could create 26,000 jobs, new report claims", "locations": [], "entities": {"persons": [{"name": "steve ellwood", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "chris walker", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "mace", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "customs union share port of tyne", "sentiment": "none"}, {"name": "eu customs union", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Creating free ports in North East could create 26,000 jobs, new report claims Ports where goods are imported without tariffs could provide opportunity for region, but plan depends on leaving the Customs Union Share Port of Tyne aerial view, from River Tyne (Image: Steve Ellwood) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nCreating free ports that link with enterprise zones in the North East could create as many as 26,000 high-value jobs in the region and add £1.5bn a year to the local economy, a new report claims.\nThe moves - which would depend on leaving the EU Customs Union, something many business leaders in the North East oppose - have been outlined in a report for construction firm Mace compiled by former Treasury economist Chris Walker.\nThe ports of Tyne and Tees are among seven “supercharged free ports” that the report says could be created after the UK leaves the European Union\nMr Walker argues that free ports, geographical areas that allow goods to be imported into a country without paying import tariffs, should be brought together with enterprise zones, locally designated areas subject to tax relief to encourage private investment.\nDoing so would boost international trade by £12bn and add £9bn a year to the UK’s GDP. It could create more than 17,500 jobs across Tees and Hartlepool, and more than 8,500 on the Tyne.\nSteve Gillingham, director for the North at Mace, said: “Our ports in the North, including the Tyne, make up some of our country’s greatest assets. Ship to Shore Crane at PD Ports, Teesport (Image: Evening Gazette)\n“Transforming the North’s ports into Supercharged Free Ports, as this report suggests, would ensure the region is well placed to drive post-Brexit growth and help rebalance the UK economy. This would not only drive industrial and economic development, but also create thousands of jobs which would help in turn to reduce inequality across the region.”\nHartlepool MP Mike Hill said: “I very much welcome the proposed introduction of a ‘supercharged’ free port covering Tees and Hartlepool. As we leave the EU it is vital that we maximise our global trading potential. There is plenty of talk about rebalancing the UK economy towards the North, but not enough action.\n“Ports like Hartlepool have bags of potential and the proposal could lead to new opportunities for local people, as well as new jobs, apprenticeships and investment.”\nAs well as the Tyne and the Tees, the Mace report proposes free ports at Immingham and Grimsby, Hull and the Humber, Liverpool and Manchester Airport.\nSupport for the idea of free ports is growing in the North East, with the Policy North pressure group, Tees Valley mayor Ben Houchen and a number of MPs speaking out on the issue.\nPolling linked to the Mace report also suggests public backing for the scheme, with almost 90% of those questioned in favour of the creation of free ports in the region. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-18T02:01:00.000+03:00", "crawled": "2018-06-18T07:51:26.015+03:00", "highlightTitle": ""}