{"organizations": [], "uuid": "5dc250c823ea75800411da4580ce75aa2f93ce53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14788856.ece/ALTERNATES/s1200/Sajid-Javid-denies-the-Conservative-Party-has-an-islamophobia-problem.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/conservatives-must-not-ignore-islamophobia-14788855", "country": "GB", "domain_rank": 21960, "title": "Why the Conservatives must not ignore Islamophobia concerns in their party", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-16T07:00:00.000+03:00", "replies_count": 0, "uuid": "5dc250c823ea75800411da4580ce75aa2f93ce53"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/conservatives-must-not-ignore-islamophobia-14788855", "ord_in_thread": 0, "title": "Why the Conservatives must not ignore Islamophobia concerns in their party", "locations": [], "entities": {"persons": [{"name": "sajid javid", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "muslim council of bri", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "muslim council of britain", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "mcb", "sentiment": "none"}, {"name": "muslim council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why the Conservatives must not ignore Islamophobia concerns in their party The Muslim Council of Britain says it is concerned about anti-Muslim prejudice among Tories Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nSajid Javid, the newish Home Secretary, got off to a good start.\nHe signalled an end to the “hostile environment” immigration policy backed by Theresa May.\nAnd he said increasing police funding was “a priority of mine”.\nIt was a welcome dose of common sense.\nBut Mr Javid got one thing wrong.\nAsked about claims that the Conservative Party had a problem with Islamophobia, he shot the messenger.\nThe Muslim Council of Britain (MCB) has called for an inquiry into anti-Muslim prejudice in the Conservative Party. Tory Home Secretary Sajid Javid (Image: BBC)\nSpeaking on BBC One’s Andrew Marr Show, Mr Javid rejected their request.\nHe said: “The Muslim Council of Britain does not represent Muslims in this country. You find me a group of Muslims that thinks that they’re represented by the MCB.”\nAnd he said the Government, like the Labour administration before it, didn’t deal with the MCB because some of its members had the wrong attitude towards extremism.\nBut it doesn’t really matter, in this case, whether the MCB is representative, or even what it believes (as it has 500 affiliated organisations, there are probably members with all sorts of different views).\nIt has produced a dossier setting out what it says are examples of anti-Muslim bias in the Conservative Party.\nRegardless of who wrote the dossier, the question is whether the examples stand up to scrutiny.\nAnd unfortunately, they do.\nThere’s the case of Bob Blackman, the Conservative MP who retweeted an anti-Islam tweet from far-right activist Tommy Robinson.\nThe tweet concerned a despicable attack on a Hindu temple in Bangladesh, apparently by Islamist extremists.\nBut Robinson did what the far-right always do, and suggested the actions of extremists revealed the true nature of Islam in general.\nMr Blackman has said the re-tweet was an accident.\nThe MCB also said Mr Blackman had hosted an anti-Muslim speaker called Tapan Ghosh in the Commons. Mr Ghosh has been jailed in India for stoking religious tensions.\nMr Blackman has said that the choice of speakers was entirely down to the National Council of Hindu Temples, which organised the event.\nThe MCB highlighted other examples.\nThere’s Mike Payne, the Calderdale councillor who was suspended from his party for sharing an article to Twitter and Facebook with the headline: “France Slashed Benefits to Muslim Parasites by 83%.” Read More Brexit: Theresa May wins key vote after making concessions to remain MPs\nAlexander van Terheyden, a Tory council candidate in Hackney, was suspended by the Conservative Party for calling Islam a “violent political ideology” comparable to fascism and communism.\nAnd the MCB highlighted the case of Nick Sundin, a Conservative Party candidate in the Ouseburn ward in Newcastle, who was suspended when it emerged he had called the prophet Mohammed a “f*", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-16T07:00:00.000+03:00", "crawled": "2018-06-16T09:15:43.040+03:00", "highlightTitle": ""}