{"organizations": [], "uuid": "c1f7316e392a2274de5613b1db800e8072901a1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14746703.ece/ALTERNATES/s1200/SGP_NEC_100816PIPES02JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ivory-ban-could-threaten-future-14746570", "country": "GB", "domain_rank": 21960, "title": "Ivory ban could threaten future of traditional Northumbrian music, says MP", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-05T16:25:00.000+03:00", "replies_count": 0, "uuid": "c1f7316e392a2274de5613b1db800e8072901a1b"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ivory-ban-could-threaten-future-14746570", "ord_in_thread": 0, "title": "Ivory ban could threaten future of traditional Northumbrian music, says MP", "locations": [], "entities": {"persons": [], "locations": [{"name": "great highland", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "northumbrian", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Ivory ban could threaten future of traditional Northumbrian music, says MP Northumbrian smallpipes, which have been part of the region’s culture for centuries, could be included in sales ban Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA planned ban on ivory sales could have the unintended consequence of threatening traditional Northumbrian pipe music, ministers have been warned.\nNorthumbrian pipes have been part of the region’s culture for centuries. The instruments, also known as smallpipes, are a form of bagpipe but smaller and quieter than the Great Highland bagpipes associated with Scotland.\nHowever, people with the skills to make the instruments are few and far between. Instead, performers tend to buy their instruments second hand, or hire them. (Image: Newcastle Chronicle)\nAnd as the instruments often contain ivory, it means they will be hit by the Government’s Ivory Bill, which bans the sale of almost any item containing the material.\nNorthumberland MP Anne-Marie Trevelyan, who represents Berwick-upon-Tweed , urged the Government to make an exemption for Northumbrian pipes.\nSpeaking in the House of Commons, she said: “I would ask the Minister to consider one further narrow exemption that I as a Northumbrian MP believe is important for our musical heritage and which should be included in the scope of the exemptions for older musical instruments.\n“In the north of our great country, the pipes - bagpipes and Northumbrian - have been a military and cultural part of our heritage for centuries, and pipers have a particularly long history in Northumberland .\n“The Northumbrian pipes are a physically smaller and perhaps less terrifying musical instrument than their bigger cousin north of the Tweed.”\nThe Northumbrian Pipers’ Society was “extremely concerned” that the legislation would damage the region’s piping tradition and musical heritage, she said. Read More MI5 to share intelligence in bid to stop terror plots earlier as it's revealed 3,000 may be threats\n“The retrospective nature of the proposals on musical instruments containing ivory, which will make it unlawful to sell or hire instruments made with any ivory in them after 1975, even though they were made perfectly legally ... will, according to some estimates by key pipe makers and figures in the tradition, result in at least 500 to 600 sets ceasing to be marketable.”\nShe also revealed that her own daughter was a piper.\n“My daughter is a Northumbrian piper and owns a set of pipes that contain ivory. I do not know when it was made, and we do not intend to sell it, since we hope to perpetuate this musical Northumbrian tradition by passing them down the generations, but this is no less of an issue for all that.\n“We bought them from a family whose grandfather had died and none of whose children had learned to play. We have been the happy recipients of a musical instrument and a county tradition.”\nWith Northumbrian pipe makers retiring, musicians were increasingly reliant on second-hand ​instruments to continue the musical tradition, she said. Read More Give us a deal or you won't get your £40bn, pro-Brexit MP tells European Union\n“It would be a huge error to inadvertently suffocate one of our country’s finest musical traditions - it is the only instrument indigenous to England that has an unbroken history of performance - by missing a small exemption to this Bill, which I do not believe would have a negative effect on the poaching of elephants since we are talking about pipes made by recycling old or ancient ivory.”\nEnvironment Minister David Rutley said the legislation would not prevent people owning or passing on instruments. However, this did not appear to address concerns about the sale or hire of instruments.\nHe said: “It should be noted that the ban will not prohibit owning, inheriting, donating or bequeathing ivory that is currently permitted. That will extend to Northumbrian pipes, which my honourable Friend the Member for Berwick-upon-Tweed will be pleased to hear.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-05T16:25:00.000+03:00", "crawled": "2018-06-05T18:24:58.013+03:00", "highlightTitle": ""}