{"organizations": [], "uuid": "327362647aef7f258fb00444c5f2b6e32166edd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1663713.ece/ALTERNATES/s1200/2017_Land_Rover_Discovery_HSE_TD6_Automatic_01.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/land-rover-moves-production-discovery-1663721", "country": "US", "title": "Land Rover moves production of Discovery out of UK", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-11T17:07:00.000+03:00", "replies_count": 0, "uuid": "327362647aef7f258fb00444c5f2b6e32166edd4"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/land-rover-moves-production-discovery-1663721", "ord_in_thread": 0, "title": "Land Rover moves production of Discovery out of UK", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "slovakia", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "jaguar land rover", "sentiment": "none"}, {"name": "jaguar challenge", "sentiment": "none"}, {"name": "tata motors", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Land Rover moves production of Discovery out of UK The move will affect hundreds of workers as the iconic brand moves abroad Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 15:07, 11 JUN 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nJaguar Land Rover is to shift all production of its Discovery model to Slovakia from Birmingham in a move likely to affect hundreds of workers.\nThe company said the switch will take place early next year and that agency workers are most at risk from the decision.\nTwo years ago the firm, owned by India's Tata Motors, insisted that its Slovakia plant would \"complement\" its UK operations, with the Discovery built in both locations. Read More Bolham whizzkids master Jaguar Challenge to win place at grand final\nBut on Monday Jaguar Land Rover said that all production of the Discovery would be done in the Eastern European nation.\n\"The decision to move the Land Rover Discovery to Slovakia and the potential losses of some agency employed staff in the UK is a tough one but forms part of our long-term manufacturing strategy as we transform our business globally,\" the group added.\nThe announcement comes weeks after profits at Jaguar Land Rover were almost cut in half in the fourth quarter as the car-maker was stung by a combination of falling diesel sales, Brexit uncertainty and vehicle taxation.\nThe group saw pre-tax profit slump to £364 million in the three months to March 31, down from £676 million in the same period last year.\nIn the UK, the company said it was \"impacted by consumer uncertainty surrounding diesel models, Brexit and vehicle taxation\". Read More\nAlongside the Slovakia announcement, Jaguar said it will invest millions in a revamp of Solihull, where the new Range Rover and Range Rover Sport models will be built.\nIn addition the next Range Rover Evoque will be built at a site in Halewood.\n\"This significant investment and technology upgrade in Solihull in order to accommodate our next-generation of flagship Land Rover models, and the refit of our Halewood plant for the next Evoque, is proof that we remain committed both to the UK and to transformation and growth,\" the group said. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-11T17:07:00.000+03:00", "crawled": "2018-06-11T17:17:45.001+03:00", "highlightTitle": ""}