{"organizations": [], "uuid": "8a151665efe0e86243c47d3f7109265303e2f752", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14808792.ece/ALTERNATES/s1200/Prime-Ministers-Questions.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-wins-brexit-vote-after-14808746", "country": "GB", "domain_rank": 21960, "title": "Theresa May wins Brexit vote after Conservative rebels back down", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-20T19:04:00.000+03:00", "replies_count": 0, "uuid": "8a151665efe0e86243c47d3f7109265303e2f752"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-wins-brexit-vote-after-14808746", "ord_in_thread": 0, "title": "Theresa May wins Brexit vote after Conservative rebels back down", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "parli", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "dominic grieve", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "grieve", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "conservative", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May wins Brexit vote after Conservative rebels back down Commons rejects call for Parliament to take charge of Brexit negotiations if Government fails to secure acceptable deal Share Prime Minister Theresa May speaks during Prime Minister's Questions in the House of Commons, London (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Government saw off Commons rebellion over its flagship Brexit legislation after the leader of the Conservative rebels backed down.\nBackbencher Dominic Grieve, a former Attorney General, said he had been reassured by a last-minute Government concession to pro-EU backbenchers.\nMr Grieve said that he’d decided as a result not to vote for his own amendment to the Government’s European Union (Withdrawal) Bill, which would have given Parliament the power to seize control of Brexit negotiations.\nDespite this, a vote went ahead - and the Government was victorious when the amendment was rejected by 319 votes to 303, a majority of 16.\nThe focus of the battle had been whether MPs will have a “meaningful vote” on the Brexit deal.\nPrime Minister Theresa May has said MPs will have a chance to accept or reject any deal agreed with the EU.\nBut Labour and some Conservatives said Parliament should have the power to tell the Government how to proceed with negotiations, if the deal is rejected or if no deal can be agreed.\nThis is what the Government wants to avoid, and it seems to have succeeded. Brexit Secretary David Davis (Image: Getty Images Europe)\nBrexit Secretary David Davis wrote to MPs to inform them that an official ministerial statement will be issued on Thursday making clear that Speaker John Bercow can decide whether they get a “meaningful vote” on a no-deal withdrawal from the EU.\nAnd that appears to have been enough to convince Mr Grieve to back down.\nProminent pro-EU Tory Nicky Morgan also declared that she was ready to back the Government on this basis.\nDespite forecasts of a Tory rebellion, only six Conservative MPs voted against the Government. Meanwhile, four Labour MPs broke ranks and voted with the Government.\nWith Brexit due to take place on March 29 2019, a vote on the EU deal is likely to take place in October 2018 - assuming one can be agreed in that time. Read More\nIf it is rejected by Parliament, it seems unlikely that there would be time to negotiate a replacement deal before Brexit day, even if the EU was willing to offer one.\nSpeaking in the Commons, Mr Grieve appealed for Brexit “hysteria” to calm down. (Image: Getty Images)\nHe said: “It’s rightly said that those the gods want to destroy, they first render mad.\n“I have to say there’s enough madness around at the moment to make one start to question whether collective sanity in this country has disappeared.\n“Every time sensible, reasoned argument tries to be presented in this House, vilification and abuse follows, death threats for right honourable and honourable friends, there is a hysteria which completely loses sight of the issues we have to really consider. Read More Theresa May set for showdown over demands for a 'meaningful vote' on Brexit\n“And I have to say there’s an atmosphere of bullying which has the directly opposite consequence that it puts people into a position where they feel are enable to compromise because by doing so they will immediately described as having lost, as if these were arguments to be lost or won.\n“The issue must be that we get it right.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-20T19:04:00.000+03:00", "crawled": "2018-06-20T22:09:51.004+03:00", "highlightTitle": ""}