{"organizations": [], "uuid": "7a136f303e25b75b4b876134766c6edca101b278", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1132283.ece/ALTERNATES/s1200/HH5A1187JPG.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/major-changes-happening-exeter-bus-1681927", "country": "GB", "title": "These are the major changes happening at Exeter Bus Station from today", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-17T08:00:00.000+03:00", "replies_count": 0, "uuid": "7a136f303e25b75b4b876134766c6edca101b278"}, "author": "Rom Preston-Ellis", "url": "https://www.devonlive.com/news/devon-news/major-changes-happening-exeter-bus-1681927", "ord_in_thread": 0, "title": "These are the major changes happening at Exeter Bus Station from today", "locations": [], "entities": {"persons": [{"name": "karime hassan", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "paris street", "sentiment": "none"}, {"name": "sidwell street", "sentiment": "none"}, {"name": "cheeke street", "sentiment": "none"}], "organizations": [{"name": "national express", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "megabus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "These are the major changes happening at Exeter Bus Station from today Check if your journey is affected Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nSome services at Exeter's bus station will be relocated from Sunday as work begins to build a replacement.\nPart of the bus station will close while seven bays remain in use at the station - these arrangements will stay in place until a new bus station is opened at the end of 2020. Read More 20 things you should never say to a modern dad\nThe new bus station is being funded by Exeter City Council along with a controversial new leisure centre at the site, which is also expected to open in the winter of 2020.\nThe 56, 5, 5A, 5B, 5C, 55, and 555 services will relocate to Paris Street while the 57, 58, 1, 1A, 1C, Megabus and National Express routes will move to Sidwell Street. Exeter bus service changes\nThe 56 and 56A will move to Cheeke Street next to where the city buses currently stop.\nAll other routes remain unaffacted.\nAnnouncing the news in April, Karime Hassan, chief executive and growth director at Exeter City Council, said: “We are announcing today, in conjunction with the operators, that the planned changes to services at Exeter Bus Station will come into force from June 17. Read More 'Fantastic' results hailed by Labour...\n\"This will allow the start of enabling works which are necessary for us to deliver this key city centre redevelopment.”\nBob Dennison, managing director of Stagecoach South West, said: “My priority has always been to minimise disruption to our customers whilst the new bus station is constructed. A full list of the latest changes\n“I am therefore pleased that we will be able to continue to use a number of bays at the current location, helping to maintain easy access to the city centre. Our existing Travelshop will also remain open to help with customer enquiries and ticket sales.\n“I look forward to continuing to work in partnership with Exeter City Council as the project progresses and the new bus station takes shape.”\nThe Stagecoach Travel Shop at the Bus Station will also provide information on the changes to passengers. Time Line The redevelopment of Exeter bus and coach station One Upon A Time In The City Centre\nLong described by many as \"ghastly\" and an \"eye-sore\", the 11.5 acre Paris Street bus station was opened on July 16 1964 by Lord Mayor Patrick Spoerer.\nIt replaced the Paul Street bus station, a post-war development deemed far too small for a city expanding massively every year.\nIt also didn't fit in with the new inner bypass which greatly changed the nature of traffic moving through the city centre.\nParis Street bus station was designed and built by H B Rowe and Staverton Contractors and would go on to be a thorn in the city's side until, well, the end of this year. Born in the Eighties\nThe first time we see the bus station seriously discussed as a key site for redevelopment is in the 1980s.\nIt was 1984, when Frankie Goes to Hollywood dominated the pop charts and Ghostbusters had residents queuing up at the Odeon, when the site was first officially earmarked.\nExeter City Council Chief Executive, Karime Hassan, said the city missed the chance to develop the bus and coach station in March 1990 because of an economic downturn.\nBetween the council and the private sector, the cost of the overall development has already approached a six figure cost over the last 26 years.\nThat's before a single chunk of 1960's concrete has been torn down. Five Year Wait\nIn 2002 Exeter City Council shelved a redevelopment of the bus station for \"at least five years.\"\nIt was purely on the grounds that Exeter’s economy might not be able to cope with disruption caused by it being built and the Princesshay shopping centre project at the same time.\nHow time's have changed, with Crown Estate's Princesshay extension - along with several Paris Street - set to run tandem with the bus station project in 2018. On The Campaign Trail\nUnlike British buses, two campaign groups never failed to run on time during the course of the planning process.\nA large development can never please everyone, and the Theatre for Exeter group, and the 50m Pool for Exeter group have both been clever and persistent with their campaigns.\nThe first mention of a theatre for the bus station site was recorded in 2012, with arts lover Steve Bloomfield leading the call.\nThe Theatre for Exeter group, with it's Ronseal 'it does exactly what it says on the tin' name, disagree with the idea of a sports complex on the site - and argue that a theatre is 'better suited.'\nThe 50m pool campaign, led by Exeter Swimming Club, attracted celebrity endorsements from Olympian's Duncan Goodhew and Rebecca Adlington.\nThey argue that a 25m pool is a missed opportunity, as Exeter could have held galas and compeitions with a larger pool and spectator seating.\nIt wasn't just campaign groups expressing unease with the project.\nFigures released by the council revealed a public consultation at the Guildhall in January 2016 received 407 feedback forms. A total of 63 per cent did not back the plans.\nThe council has argued that both groups and other objectors were focusing their energy in the wrong direction, as planning policy had dictated for years that a pool of this size was appropriate for the site.\nAnd the council revealed that no theatre organisations had approached them to put forward ideas for the site. First Glimpse\nIn July 2015 we had our first glimpse of the long-awaited plans for the bus station site.\nIt gave a picture of the entire project spanning the Crown Estate side of the project and the council's pool and replacement bus station - all priced at £70m.\nIt was the first time we heard the redevelopment would include new restaurants, cafes, shops, a new multi-screen cinema and a large new public space with an amphitheatre.\nThe pool at the time was priced at £20m\nPete Edwards, leader of the city council, welcomed the arrival of the planning application. He said: “The bus station looks a mess and lets the rest of the city down – you look at how attractive the High Street and Princesshay is and then you see the bus station.\n\"This development will also improve Paris Street as the top part of it will be closed to traffic which will create a large open space for pedestrians and you will be able to walk through from Princesshay to the new development.” Outline Granted\nOn Wednesday January 20 2016, one of the biggest milestones was reached in the timeline of the project.\nAt a packed Guildhall a full meeting of the council approved the outline planning application for the entire site.\nA lively event, the historic building was packed to the rafters with residents, councillors, business owners and club members.\nMore than 20 supporters and objectors to the plans were forced to remain outside, waiting for the decision on the High Street.\nA total of 25 councillors voted in favour of the scheme and 13 voted against.\nCllr Phil Bialyk, chairman of the ECC planning committee, said he was \"completely on board\" and \"proud to support the plans\", adding: \"750 new jobs for Exeter is nothing to be sniffed at.\"\nCouncil leader Cllr Peter Edwards was also all for granting planning permission. He stated that it has been council policy since 1984 to redevelop Exeter bus and coach station. German Engineering\nAn initial 'big sell' for the sports complex, and replacement for The Pyramids, was the idea of a 'passivhaus' building.\nIt was a word and concept most residents in Exeter didn't know about before 2016, but many of us are now mini-experts in the cost-saving European design ethic.\nIn 2015, Exeter city council went on a fact finding visit to Lunen, Germany, to take a look at the design and operation of the Lippe Bad - the world's first Passivhaus swimming pool.\nIn the words of Emma Osmundsen, the council's Shadow Director for Development: \"Passivhaus is a really rigorous energy standard that ensures a building is low energy.\n\"It also provides for a very comfortable internal environment. People look to Exeter as one of the pioneers of the standard in the UK.\"\nIt has been tipped to be the greenest development of its kind in the UK, saving at least 70 per cent on energy costs a year. Full Backing\nIn October 2016 the detailed plans were given the go-ahead by a special meeting of Exeter's planning committee over at the Civic Centre.\nIt gave us the low-down on what exactly was inside:\nThe leisure complex will feature an eight lane main pool and four lane pool for learners, both with moveable floors.\nThere is also a confidence pool, 150 station gym, soft play area, café and crèche as well as health and spa facilities.\nSt Sidwell’s Point will be built next to the new Exeter bus station. The station will have 12 bays - the same as the current number. ECC V. DCC\nExeter City Council, in the red corner, has never shied away from pointing an accusing finger at Devon County Council, in the blue corner, over not coughing up any money for the project.\nThe county council is not contributing a penny despite the city council’s claim that it should be “actively involved” as the transport authority.\nDeputy chief exec Mark Parkinson said Devon would normally be expected to take an active role in delivering the scheme. He said there had been “numerous discussions” with the county council, but the city now had no choice but to progress the plan without it.\nCommittee chairman, the late cllr Paul Bull - who passed away earlier this year - said: “We’ve had ongoing negotiations with Devon County Council about funding the bus station and it appears there is no desire from their end to deliver one.”\nPhil Bialyk slammed them. Adding: “I believe it’s the county council’s obligation to provide a bus station, not the city council.\n“The city council is not responsible for transportation or the funding of it, but it seems to me from their inactivity, and because we want to see this city continue to prosper, we’re having to come forward and put in a financial regime in order to deliver a bus station. Temporary Temporary Solution\nSidwell Street is set to become a temporary bus station when the current bus station is flattened, but at the start of 2017 the plans were put into place a little too early.\nOriginally the bus station was meant to shut on Sunday, March 26 but a delay announced later soon scuppered those plans.\nBus shelters from across the city were dug up and moved.\nAccording to Cllr Bialyk, 'not a single penny' was lost in establishing the temporary bus arrangements on Sidwell Street because that work had to be done anyway. This will likely be the end of the year. Brexit Bombshell\nThursday, February 23 - a day Exeter City Council didn't want to come.\nThe authority revealed the project was 'indefinitely delayed' because they needed more time to conclude the procurement process for a contractor to build the project.\nCllr Bialyk said there was \"no doubt that Brexit and the current state of the economy has had its impact\"\nPassivhaus also provided its hurdles, because few operators could meet the requirements.\nOpposition quickly damned the council for not having 'joined-up thinking' in not having a tender in place before beginning works on Sidwell Street. Farewell Arcadis\nIn March it was revealed that Arcadis, the consultants who had been part of the project for the last few years, had been booted off the project.\nAccording to a spending report, the council spent £78,858 with Arcadis for the bus station and leisure centre consultancy between July and September 2016. Emergency Meeting #1\nA week after the Arcadis bombshell was a milestone in the project's history. It's rare for an emergency meeting of the council to be called up, and this one was the first in memory for even the longest-serving councillors.\nThe Tory's, Greens and Lib Dems called a meeting to challenge the Labour Council on the costly delays to the project - but Labour came prepared and managed to bat off most criticisms.\nDuring a heated debate questions were raised about delays to the major city centre scheme, its management and environmental aspects - a whopping 170 questions were fired across the Guildhall.\nExeter Tory leader Cllr Leadbtter fumed after the meeting: “It is clear that the pool is going to cost even more than the £32million projected cost – they admitted the quotes were higher – what is outrageous is that Cllr Edwards said that they would take Community Infrastructure Levy money meant to pay for school provision and divert it to the pool. \"How could a swimming pool be more important than education? It is clear that this project is out of control.” Emergency Meeting #2\nAfter a quiet spell, the project was back front and centre in July.\nAt a major meeting councillor's were asked to back the increased budget for an amended bus station and Passivhaus leisure scheme, which could take the total cost from £32.25million to nearly £40million.\nThe overall cost of the development now stands at £115m and the cash for the council's leisure centre and bus station would have to be primarily borrowed from central government.\nIt was backed and members supported an increase of £7.67m. It means they now have an extra £7.05m for St Sidwell’s Point, and an extra £0.62m for the bus station, takes the total budget to £39.92m.\nCouncillor Phil Bialyk, lead councillor with responsibility for bus station redevelopment, said he was delighted work on the project is now set to proceed.\nHe said: “It has been a long road, but we were determined to get this right. The project will bring much needed new facilities for the people of Exeter. And the investment will help to maintain the long term viability of the city centre, where 20,000 work.\n“A lot of work has gone into getting this far, and I can’t wait for work to start so that we can get on with rejuvenating this site and provide a development Exeter can be proud of.” The Crown Estate pulls out and Exeter City Council announces re-tender of pool and bus station plans\nIn a shock move developers pull the plug on the £100m Princesshay Leisure project. In a statement released on Monday, September 25, 2017, the Crown Estate blames 'market conditions' for the decision.\nWhile the Princesshay Leisure scheme is now cancelled, the city council insists it is pressing ahead with the redevelopment of the bus and coach station site.\nHowever, on the same day as the Crown Estate announcement it emerges that a deal with the builder has collapsed and officials will now re-tender for a new developer to take on the scheme.\nTraders who have been forced out of Paris Street shops to make way for the development are furious. One has spent £20,000 relocating for a development which will now never happen.\nExeter City Council says it has spent £4m of public money on the project so far. It will go back to the drawing board and develop new plans for the Crown Estates part of the development. Council leader Pete Edwards insists the pool will be built. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-17T08:00:00.000+03:00", "crawled": "2018-06-17T08:52:02.015+03:00", "highlightTitle": ""}