{"organizations": [], "uuid": "5e9ce48af650cdcd1ac2185f07a593c26229acb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1444203.ece/ALTERNATES/s1200/SEGRO5.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/businesses-less-confident-recruiting-due-1661508", "country": "GB", "domain_rank": 48128, "title": "Businesses \"less confident about recruiting\" due to Brexit and slow down in high street spending", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-12T02:01:00.000+03:00", "replies_count": 0, "uuid": "5e9ce48af650cdcd1ac2185f07a593c26229acb2"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/businesses-less-confident-recruiting-due-1661508", "ord_in_thread": 0, "title": "Businesses \"less confident about recruiting\" due to Brexit and slow down in high street spending", "locations": [], "entities": {"persons": [], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "manpower", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Businesses \"less confident about recruiting\" due to Brexit and slow down in high street spending Reluctance by some sectors to take on staff balanced out by strong activity in manufacturing and call centres Share Artist's impression of East Midlands Gateway which is creating thousands of jobs Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nEast Midlands businesses are less confident about talking on staff in the light of Brexit uncertainty, lower-than-expected economic growth and falling consumer confidence.\nThe latest Employment Outlook Survey by recruitment firm Manpower said despite the concerns reluctance by some sectors to take on staff was being balanced out by strong activity in the manufacturing and call centre industries.\nThe survey is based on responses from 2,107 UK employers, who were asked if they intend to hire additional workers or reduce the size of their workforce in the next three months.\nManpower said it was the most comprehensive, forward-looking employment survey of its kind and is used as a key economic statistic by both the Bank of England and the UK government.\nNationally, Manpower suggested this was the first quarter since 2009 – when Britain was in the depths of the financial crisis – that the country has seen business and financial services employers take a negative outlook. There are lots of new jobs to chose from at Fish4Jobs\nManpower UK director Chris Gray said hiring confidence in the East Midlands had dropped from the previous six months but was still in positive rather than negative territory.\nHe said: \"Hiring intentions here remain above the national average, and this is driving demand for workers in the manufacturing sector and to fill call centre roles.\n“Our belief in the region’s future prospects is reinforced by the positive response from businesses to the £700 million East Midlands Gateway logistics park being built at Castle Donington.\n\"Global logistics business Kuehne and Nagel has recently signed a 15 year lease on a 195,000 square feet unit at Segro Logistics Park East Midlands Gateway and the region is looking forward to the completion of Amazon’s new 500,000 square feet warehouse, which will create up to 3,300 jobs.” Read More\nThe local output was even better than the national one, he said. Read More Hundreds of jobs could be created with latest addition to massive Leicestershire distribution park\nDespite the large contribution of business and financial services, London is holding up, Yorkshire and the Humber employer hiring confidence has swung from being the least upbeat to being one of the most optimistic, while the biggest faller this quarter has been the West Midlands.\nDespite the results suggesting call centres are taking on staff, last week the Mercury revealed that NatWest was laying off almost 180 people at its Leicester call centre.\nThe bank has decided not to renew the lease on offices in Western Boulevard , with the loss of 179 jobs.\nThere are 350 staff at the office, called Bede House, and the bank hopes some will be relocated.\nThe Unite union said it would help during the consultation period.\nThe office deals with NatWest customers in England and Wales and Royal Bank of Scotland clients calling from north of the border.\nOne former worker said he was told staff were in tears when the announcement was made. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://www.fish4.co.uk/"], "published": "2018-06-12T02:01:00.000+03:00", "crawled": "2018-06-12T03:56:25.010+03:00", "highlightTitle": ""}