{"organizations": [], "uuid": "2925fbcced8ea918b166ec6d31a200bab14aab22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/property/article1017019.ece/ALTERNATES/s1200/Sale-boardsPNG.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/devon-house-prices-drop-01-1674372", "country": "US", "title": "Devon house prices drop 0.1 per cent, but are up year on year", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-14T09:39:00.000+03:00", "replies_count": 0, "uuid": "2925fbcced8ea918b166ec6d31a200bab14aab22"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/devon-house-prices-drop-01-1674372", "ord_in_thread": 0, "title": "Devon house prices drop 0.1 per cent, but are up year on year", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "shopli", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "office of national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon house prices drop 0.1 per cent, but are up year on year The region outperformed the UK as whole Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 07:39, 14 JUN 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nHouse prices in Devon declined slightly, by 0.1%, in April, despite witnessing a 6.2% rise over the last 12 months.\nThe latest data from the Office of National Statistics shows that the average property in the area sold for £253,392 - above the UK average of £226,906.\nAcross the South West, property prices have risen by 6.1% in the last year, to £255,207. The region outperformed the UK as whole, which saw the average property value increase by 3.9%.\nThe data comes from the House Price Index, which the ONS compiles using house sale information from the Land Registry, and the equivalent bodies in Scotland and Northern Ireland.\nThe average homeowner in Devon will have seen their property jump in value by around £48,000 in the last five years.\nThe figures also showed that buyers who made their first step onto the property ladder in Devon in April spent an average of £203,541 - around £38,000 more than it would have cost them five years ago. Read More Shoplifters caught on CCTV and shamed\nAddressing the national picture, Lawrence Bowles, the associate director of the research team at the estate agents Savills said: \"The key thing to note is that we are still seeing growth in house prices across the UK.\n\"In particular, house prices have gone up 3.9% in the year to April - though it is slowing down. People are starting to get a bit more wary about Brexit; people are starting to sit on their hands as they wait to see how things turn out.\n\"The strongest growth regionally is finally shifting away from London, and moving to the South West and the West Midlands. We expect to the north to start catching up slowly.\" Read More Here's a rare chance to buy this unique North Devon house - and it's amazing\nBetween January and December last year, the most recent 12 months for which sales volume data is available, 15,661 homes were sold in Devon, 3% fewer than in the previous year.\nThe highest house prices in the country in April were found in Kensington and Chelsea, where properties sold for an average of£1,350,179 - 17 times the cost of a home in Burnley, where the average property cost just £78,204. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-14T09:39:00.000+03:00", "crawled": "2018-06-14T10:06:42.008+03:00", "highlightTitle": ""}