{"organizations": [], "uuid": "f9f07e38d8c66badf8c86bb15067389686ff1c9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14446850.ece/ALTERNATES/s1200/DPP_SAH_WL180142_109JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/heathrow-third-runway-plan-safe-14809307", "country": "GB", "domain_rank": 21960, "title": "Heathrow third runway plan safe as Labour says it will give MPs a 'free vote'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-20T20:00:00.000+03:00", "replies_count": 0, "uuid": "f9f07e38d8c66badf8c86bb15067389686ff1c9c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/heathrow-third-runway-plan-safe-14809307", "ord_in_thread": 0, "title": "Heathrow third runway plan safe as Labour says it will give MPs a 'free vote'", "locations": [], "entities": {"persons": [{"name": "chris grayling", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "durham tees valley airport", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "unite", "sentiment": "none"}, {"name": "newcastle international", "sentiment": "none"}, {"name": "invalid email labour", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "surrey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Heathrow third runway plan safe as Labour says it will give MPs a 'free vote' Labour says it will oppose a Heathrow third runway - but won't actually order MPs to vote against it Share Long-awaited plans for a third runway at Heathrow could face further delays (Image: Get Surrey) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLabour has announced it will oppose a third runway at Heathrow Airport - but it will give its MPs a free vote.\nThe announcement, in the run-up to a crucial Commons vote on Monday, illustrates the divisions within the party over Heathrow expansion.\nNorth East Labour MPs have said that expanding Heathrow is vital for the future success of the region’s economy, as it will safeguard domestic routes at Newcastle International and may allow the creation of new services between Heathrow and Durham tees Valley Airport. Read More Labour calls on Transport Secretary Chris Grayling to resign over rail chaos\nThe Unite union, Labour’s largest financial backer, also supports expansion.\nBut Labour Shadow Chancellor John McDonnell, whose London constituency will be affected by the expansion, has been campaigning against it for many years.\nConservatives are also divided. Foreign Secretary Boris Johnson also has a long history of opposing a third runway, and will be out of the country at a EU foreign affairs ministers’ meeting when the vote takes place.\nLabour previously supported Heathrow expansion, but the party said its support was dependent on four tests, none of which it says have been met.\nThese are that increased capacity will be delivered, that the UK can meet CO2 reduction commitments, that noise and local environmental impact are minimised and that the benefits of expansion felt across the regions of the UK, not just the South East and London.\nAndy McDonald MP, Shadow Secretary of State for Transport, said: “Labour has always argued that airport expansion must meet our four tests. After careful and rigorous consideration, we are clear that they have not been met.\n“Heathrow expansion is incompatible with our environmental and climate change obligations and cannot be achieved without unacceptable impacts on local residents. The improved connectivity to the regions of the UK cannot be guaranteed and there are unanswered questions on the costs to the public purse and the deliverability of the project.\n“We support vital investment in our country’s transport infrastructure, but every investment must be tested on whether it provides real value for money and sustainability. A third runway at Heathrow fails this test.” Read More Theresa May set for showdown over demands for a 'meaningful vote' on Brexit\nMr McDonald, MP for Middlesbrough, was one of a number of North East Labour MPs who supported Heathrow expansion in a letter in 2015. Others included Newcastle East MP Nick Brown, now Labour’s Chief Whip, and Ian Lavery, now Labour’s Chair.\nThey said at the time: “Alongside the North East Chamber of Commerce and Newcastle International Airport, we have supported growth at Heathrow as the best way for the whole of the UK to capitalise on having a successful hub airport, and to ensure that capacity remains at Heathrow to connect the North East to the rest of the world.\n“Heathrow is the North East’s biggest hub connection and compliments our other hub services from Emirates, United, KLM, Air France and others. Prime Minister Theresa May (Image: Getty Images Europe)\n“Expanding Heathrow would give security to our regular flights from Newcastle Airport to Heathrow, and expand the number and variety of connections available to passengers from the North East looking to travel from the UK to the Far East and South America.”\nLabour’s decision to give its MPs a free vote means the project is now almost certain to pass in the Commons with a generous majority. Theresa May is whipping Conservative MPs to back a third runway, and the SNP are also expected to vote for it. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-20T20:00:00.000+03:00", "crawled": "2018-06-20T22:08:56.024+03:00", "highlightTitle": ""}