{"organizations": [], "uuid": "b7513ca2f6d09445f5426792af40ab3bb8972467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1715950.ece/ALTERNATES/s1200/APEX_Weather_Devon_09JPG.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/heatwave-sunseekers-help-shake-slow-1731540", "country": "US", "title": "Heatwave sunseekers help to shake off slow start to the tourist season", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-29T18:34:00.000+03:00", "replies_count": 0, "uuid": "b7513ca2f6d09445f5426792af40ab3bb8972467"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/heatwave-sunseekers-help-shake-slow-1731540", "ord_in_thread": 0, "title": "Heatwave sunseekers help to shake off slow start to the tourist season", "locations": [], "entities": {"persons": [{"name": "martin freeman", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "alistair handyside", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "south west tourism alliance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Heatwave sunseekers help to shake off slow start to the tourist season Natural beauty and human ingenuity continue to keep Devon and the South West out in front as the UK’s leading holiday destination, writes Martin Freeman Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Get daily updates pushed directly to you Subscribe to notifications\nNeither natural beauty and human ingenuity is likely to change and each helps mitigate for when one of the great variables, the weather, works against tourism.\n“The year did not end well with the weather,” said Alistair Handyside of the South West Tourism Alliance. “That put paid to a lot of short breaks in the last three, four or five months of the year which are the icing on the cake when we get them.”\nThe cold and rain didn’t stop when 2017 ended which made for a “slow” start to this year, not helped by miserable conditions during the early Easter.\nThat all started to change with warm and sunny weather blessing both May bank holiday weekends, and continuing through one of the most important periods of the tourist season, Whit week, and into June. Devon County Show\n“That has really started to pull it back,” added Mr Handyside, who chairs the group of more than 125 private businesses and public bodies from across the sector. “Devon County Show and the Royal Cornwall Show were both great. There has been a good number of people about in June. We are going on an upward curve.”\nChris Murray, of the Devon Association of Tourism Attractions, gives a similar assessment of 2017, with the west August and poor autumn hitting trade which had been 69% up earlier in the year.\n“The start of this year was ghastly, with the exception of February, But the May bank holidays were excellent. We had our best Whit week ever,” said Mr Murray owner of Pennywell Farm and chair of the association which has 49 members. Richard Brindley with staff at Pennywell Farm and some of their billy goats\nInnovation and investment were again reflected in the South West being the most successful region in the VisitEngland Awards for the sixth year in succession.\nBusinesses picked up 16 awards, with half of those prizes going to concerns in Devon and Cornwall. Read More\nLandal Gwel an Mor, a five-star resort at Portreath on the North Cornish coast, took gold in the holiday park/village category. Top three dog friendly digs in Devon and Dorset\nThe Old Winery, Southleigh, East Devon\nFormerly an apple winery, this lavishly appointed barn has underfloor heating and a large sitting room with lots of squashy sofas.It has a private garden with far reaching rural views.\nBeulah, Strete, South Hams, Devon\nBeulah is ideal for those who enjoy walking the South West Coastal Path or those wishing to visit Dartmouth, Torcross or Kingbridge. This lovely semi detached Victorian property still retains many of its original features including its ornate fireplace, upstairs wooden floor boards and its sash windows with stunning sea views from the rear aspect.\nWellhouse, near Lyme Regis, Dorset\nBeautifully restored and extended Wellhouse is set in 15 acres of shared grounds with a lake, stream and woodland, located near Lyme Regis in West Dorset. The Wellhouse features an architect designed, 70m square extension with contemporary open plan kitchen and living space, designed and built by award winning furniture designer James Verner.\nIn Devon, silvers went to The 25 Boutique B&B, Torquay, in the B&B section; The Milkshed, near Honiton in the self catering category; and Bulleigh Barton Manor, Ipplepen, near Newton Abbot in the dog friendly category. In Cornwall, Mylor Sailing and Powerboat School, near Falmouth, took home a silver in the inclusive tourism section. The Cary Arms, Babbacombe, Torquay\nBronze awards were won by the Cary Arms & Spa, Torquay, in the boutique guest accommodation category; Screech Owl and Wildlife Park, St Columb in Mid Cornwall in the small visitor attraction section; and Polmanter Touring Park, near St Ives, in the holiday park and village section.\nIn Somerset, Salad Days Beach Hut, Dunster Beach, won a bronze in the dog friendly category.\nMany businesses also enjoyed success in other awards. The 25 Boutique was named Unique UK Bed and Breakfast B&B of the Year in the AA awards having been placed in the top ten in the world by TripAdvisor earlier in 2018.\nFor Mr Handyside, there was a personal award – he was made an MBE in the Queen’s Birthday Honours, for services to tourism in the region. Read More How to avoid heatstroke\nOn the environment side, the wider South West was again the region with the highest number of pristine beaches, 26, when the Blue Flag awards were announced. Dawlish Warren - Sarah Holgate, Teignbridge District Council’s Resorts Manager, Councillor Philip Bullivant, Teignbridge District Council’s Executive for Recreation and Leisure, Helen Scott, Chair of Dawlish Warren Tourism, Andrew Bulpin, Treasurer/Secretary of Dawlish Warren Tourism, Frank Hayden, Teignbridge District Council’s Resorts Attendant\nSixteen of them are in Devon and Cornwall, evenly split between the two counties. In Devon, Blackpool Sands, Sandy Bay near Exmouth, Challaborough, Dawlish Warren, Westward Ho! and a trio in Torbay – Breakwater Beach, Meadfoot and Oddicombe – made the top grade. Cornwall’s winners were Carbis Bay, Gyllyngvase in Falmouth, Porthmeor in St Ives, Great Western in Newquay, Polzeath, Porthtowan, Trevone and Widemouth all picked up Blue Flags.\nOn top of those came 34 Seaside Awards, which judge other criteria such as how beaches are managed, safety and services, as well as water quality. Devon collected 20, Cornwall 14.\nOne growing challenge the sector faces is that from the OTA – online travel agents – such as Airbnb, HomeAway and TripAdvisor.\nThere are deep concerns giving way to outright anger at the lack of a level playing field between the regulated, inspected, tax-paying conventional accommodation sector and that in the purely sharing economy which is free from all such burdens.\n“Three or four years ago there were five properties on Airbnb in my parish, now there are 300,” said Mr Handyside, who has a holiday cottage business in East Devon.\n“Some small businesses such as hotels and self-catering accommodation owners are paying extraordinary per centages of their turnover, 7,8, 10%.\n“There is 20% VAT to pay for those above the threshold. All these are subsidising the second homes market which is not paying business rates and VAT. We are lobbying our MPs on this.”\nHMRC is also beginning to focus on the sharing economy, too.\nThe lack of inspection of accommodation offered by OTAs is a further worry. Guests were potentially being put at risk staying in premises that did not have checks covering gas, electricity and fire safety, said Malcolm Bell, chief executive of Visit Cornwall.\nOwners are also putting themselves at risk, financially and legally, if they do not tell their mortgage providers and insurers that they are renting out, he points out.\nConcerns extend to the growing experience provision sector through OTAs. “I have a motorboat and, purely out of curiosity, asked my insurance company what it would cost me if I took paying people on a few trips. They said my insurance premium would treble,” said Mr Bell.\n“I had a good meeting with Airbnb the other day and I sense some movement on the experience provision side.” Read More 13 National Trust properties worth visiting in Devon and Cornwall\nHe is part of a working group on issues to do with OTAs and believes progress may come on regulation of the accommodation sector, too. Most European countries were extending their schemes to include those provided through the sharing economy, he added. There should be compulsory, free registration, he said.\nMoving away from such concerns there was “cautious optimism” among tourism businesses for 2018, as the good weather in May and June makes up for the poor start to the year.\nThere were some concerns that the foreign visitor market – currently helped by a weak pound – might be affected by a negative image of Britain developing during the Brexit negotiations, he said.\n“Our internal tantrums might start to have an effect,” said Mr Bell. “we are not exactly covering ourselves with glory.”\nThe “Gove effect” is another issue that refuses to go away. The clampdown on parents taking children out of school during term time, begun when Michael Gove was education secretary, continues to concentrate business in a few busy weeks.\nThat artificially high demand prices out some visitors, and is hard on those who work in the industry. “People who work in the industry, specially small businesses, can only take a holiday when it is quiet – but then they aren’t allowed to take their children out of school,” said Mr Murray.\n“That needs to be looked at again, especially for children in primary school. Some of them are missing out on a family experience when they would have learned more than when they were in school.”\nStill, though, the positive outlook that runs through tourism businesses continues to drive and sustain them.\n“Imagination, energy, enthusiasm and passion. That is what keeps tourism businesses going and makes them successful,” said Mr Murray. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-06-29T18:34:00.000+03:00", "crawled": "2018-06-29T18:42:04.021+03:00", "highlightTitle": ""}