{"organizations": [], "uuid": "24bf3001c0766c3a6fe79e591ee99f93edf0aa8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14786313.ece/ALTERNATES/s1200/GWR_-NJL_140618shop_01.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/planet-conscious-shop-launches-gateshead-14786286", "country": "GB", "domain_rank": 21960, "title": "'Planet conscious' shop launches in Gateshead to cater for green shoppers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-06-14T19:14:00.000+03:00", "replies_count": 0, "uuid": "24bf3001c0766c3a6fe79e591ee99f93edf0aa8c"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/planet-conscious-shop-launches-gateshead-14786286", "ord_in_thread": 0, "title": "'Planet conscious' shop launches in Gateshead to cater for green shoppers", "locations": [], "entities": {"persons": [{"name": "richard murr", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "durham road", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "low fell", "sentiment": "none"}], "organizations": [{"name": "open house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Planet conscious' shop launches in Gateshead to cater for green shoppers Open House specialises in recycled, renewable and sustainable products Share Richard Murr of Open House (Image: Copyright unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA shop that bills itself as the region’s most “planet conscious” is set to open in the North East.\nOpen House, which is on Durham Road in Low Fell, Gateshead , will offer products which are recycled, renewable or from a sustainable source, helping shoppers make the transition to a more environmentally-friendly lifestyle.\nIt is being opened by Richard Murr, who has sourced ranges from across the UK, including clothes which will be available outside London for the first time.\nThe shop will sell vintage clothes along with items made from unbleached cotton, as well as offering cleaning products such as environmentally friendly soap powder alternatives.\nAnd there will also be cosmetic ranges that include shampoo bars – which save on excessive packaging and wrapping – and candles made of soya, which don’t release harmful chemicals into the atmosphere.\nMr Murr said: “Everyone today is very aware of the fact we need to protect the environment and move away from products made of plastic.\n“But that doesn’t mean people necessarily know how to find alternatives, which is why we are hoping to be able to offer them everything they need.” Read More Kitchen maker Magnet sees turnover fall but praises strong results before Brexit\nAs well as the store, which was formally a bridal shop, Mr Murr is opening up the basement as The Spare Room, which will be available for groups to hire and will also see a number of events being staged.\nTo complete the business’ green credentials, he has switched to a 100% green energy company and is offering local people the opportunity to pop in and charge up their phones knowing they are using renewable energy. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-06-14T19:14:00.000+03:00", "crawled": "2018-06-15T02:45:36.015+03:00", "highlightTitle": ""}