{"organizations": [], "uuid": "99075a5dc6991c0a9bb63787cc76961f8cdb0f2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2279005.ece/ALTERNATES/s1200/1_European-Best-Pictures-of-the-Day-November-25th-European-Leaders-Meet-To-Sign-Off-Brexit-Agreemen.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/expert-comment-how-brexit-might-2278404", "country": "GB", "domain_rank": 48128, "title": "EXPERT COMMENT: How Brexit might not make us all 'worse off' - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-11-30T02:00:00.000+02:00", "replies_count": 0, "uuid": "99075a5dc6991c0a9bb63787cc76961f8cdb0f2f"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/expert-comment-how-brexit-might-2278404", "ord_in_thread": 0, "title": "EXPERT COMMENT: How Brexit might not make us all 'worse off' - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "getty", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "phillip hammond", "sentiment": "none"}, {"name": "jon seaton", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "christine lagarde", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european council", "sentiment": "negative"}, {"name": "bank of england", "sentiment": "none"}, {"name": "loughborough university's school of business and economics", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May at the special session of the European Council over Brexit on November 25 (Image: Getty Images Europe) Get Business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThere have been some stark warnings about Brexit from some of Europe’s most important figures, writes Dr Jon Seaton, of Loughborough University's School of Business and Economics.\nChancellor Phillip Hammond has conceded that there is no future involving Brexit in which the UK will not be worse off economically.\nBut he’s not the first person to vocalise this concern.\nThe Governor of the Bank of England Mark Carney, the managing director of International Monetary Fund Christine Lagarde and a whole host of economic groups, who all use surprisingly complex economic forecast models and simulations, all give the same clear message…\nThat any form of Brexit is bad, in some cases very bad. Brexit shouldn't just be about the economy, writes Dr Jon Seaton\nWhat do they mean by 'bad'?\nI sometimes buy an expensive item at the local village store rather than getting it cheaper at the supermarket in town which is bad, but overall it saves me time – so I’m financially worse off but time rich.\nIn the case of Brexit, economists focus on one simple concept ‘GDP’ or Gross Domestic Product – basically, it will be smaller under Brexit and will grow slower under Brexit.\nWe will be worse off monetarily, per capita – that is on average.\nMoney does not always make you happy\nBut GDP has been and will always be a one trick pony – it only measures total UK income. Democratic Unionist Party leader Arlene Foster with Phillip Hammond in Belfast on November 23 (Image: Getty Images)\nIt does not measure how happy you are, it does not measure your wellbeing, it does not measure welfare. But it is a start in that direction.\nWhen GDP declines or does not grow fast, this is usually accompanied by higher unemployment, less spending on health services etc – so clearly it helps our society to have some growth at least.\nBake off or brake off: Cutting the cake\nTo those like me, who study and teach the subject in some detail, GDP – as a measure of economic welfare – has very many criticisms.\nFirst, GDP per person does not represent your income or your expenditure, some people have higher incomes than others – how the UK GDP cake is split between citizens matters a lot but is hardly mentioned in these statistics.\nLow growth can be good\nSimilarly, Brexit is not really the big bad thing at our door, threatening our families and generations to come, it's the mess humans have made of the environment – pollution.\nGDP does not factor this massive failure of our markets to provide sustainable growth in a healthy world.\nIndeed, rapid GDP increases have recently been associated with even higher levels of CO2 emissions. Read More Michael John Flooring, Maison Interiors and Sherwin Hall Kitchens launch joint Oadby House showroom\nThe world is not on track with CO2 reduction – we may need to actually lower growth to stay in line with global agreements.\nSo lower GDP growth may be good for all concerned, as long as we structurally change over to renewables.\nNot our fault?\nLastly, GDP growth was not the main argument for Brexit, rather it was a cry for independence and control – normal reactions for people living in a period of fear and adversity brought on by the financial crunch of 2007.\nBut the fear of people we can work with together to resolve world problems seems overdramatic. Read More Married couple behind failed Birstall printing business disqualified as company directors\nBut again, these fears and behaviours are not related to GDP, they are related to human behaviour and ultimately may be resolved by the short-term power play within the commons in a couple of weeks’ time or the saga will continue until the cliff edge in March next year.\nBrexit above all is not an economic struggle, economics informs the debate, but does not resolve it. Like us on Facebook ", "external_links": [], "published": "2018-11-30T02:00:00.000+02:00", "crawled": "2018-11-30T19:15:21.012+02:00", "highlightTitle": ""}