{"organizations": [], "uuid": "e772afd37c2ffa14c59312531ade2e52037ebf24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2113392.ece/ALTERNATES/s1200/2_19407761-1.jpg", "site_section": "http://www.middevongazette.co.uk/localeducation.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/uae-ambassador-says-devon-spy-2250907", "country": "GB", "title": "UAE ambassador says Devon 'spy' is guilty - but they may cut his sentence", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-23T12:28:00.000+02:00", "replies_count": 0, "uuid": "e772afd37c2ffa14c59312531ade2e52037ebf24"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/uae-ambassador-says-devon-spy-2250907", "ord_in_thread": 0, "title": "UAE ambassador says Devon 'spy' is guilty - but they may cut his sentence", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "hedges", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "matthew hedges", "sentiment": "none"}, {"name": "sulaiman almazroui", "sentiment": "none"}, {"name": "beca", "sentiment": "none"}], "locations": [{"name": "uae", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe UAE's London ambassador has defended the trial of Exeter academic Matthew Hedges but said his government is studying a request for clemency made by his family.\nSulaiman Almazroui, said: \"Matthew Hedges was not convicted after a five-minute show trial, as some have reported.\n\"Over the course of one month, three judges evaluated compelling evidence in three hearings.\n\"They reached their conclusions after a full and proper process. This was an extremely serious case.\n\"We live in a dangerous neighbourhood and national security must be a top priority.\n\"Mr Hedges' family have made a request for clemency and the government is studying that request. Read More UAE has 'compelling evidence' Matthew Hedges is a British spy\n\"British Foreign Secretary Jeremy Hunt had a good conversation yesterday with our foreign minister.\"\nHe stressed the two nations' close ties, adding: \"Because of the strength of that relationship we are hopeful that an amicable solution can be reached.\" Matthew Hedge's wife says Government is now standing up for him\nThe wife of an academic jailed for life in the United Arab Emirates on a spying allegation said she has won assurances that the Government is \"now standing up for one of its citizens\" after meeting Jeremy Hunt.\nDaniela Tejada condemned the Foreign Office over the handling of the case of 31-year-old PhD student Matthew Hedges, ahead of her meeting with the Foreign Secretary on Thursday.\nMr Hunt had threatened the UAE with \"serious diplomatic consequences\" if Mr Hedges, who attended Exeter University, is not freed, saying he has seen \"absolutely no evidence\" to support the charge.\nHowever, Ms Tejada was critical of ministers, accusing them of putting relations with the Gulf state before her husband's freedom.\nBut she left the Foreign Office seeming more confident the Government was working in their favour.\n\"I really appreciate the Foreign Secretary taking the time to meet me at this crucial point in Matt's life,\" she said, reading from a prepared statement after an hour inside the building.\n\"He has assured me that he and his team are doing everything in their power to get Matt free and return him home to me. Read More Government put relations with Dubai before Exeter man's freedom\n\"This is not a fight I can win alone and I thank the Foreign Office and the British public for now standing up for one of their citizens.\"\nMr Hunt is understood to have exchanged \"very frank\" words with the UAE ambassador in London during a meeting earlier in the day.\nMs Tejada, having landed back at Heathrow Airport in the morning, said the UK had \"failed\" to take a firm stance over the Durham University student from the start of his ordeal.\n\"I was under the impression they were putting their interests with the UAE above a British citizen's rightful freedom and his welfare,\" she told BBC Radio 4's Today programme.\n\"They were stepping on eggshells instead of taking a firm stance.\"\nHealth Secretary Matt Hancock defended the Foreign Office on the show for working \"behind the scenes\"to support Mr Hedges, with Mr Hunt appealing personally to the Crown Prince on November 12.\nMs Tejeda, who was at the Abu Dhabi court when Mr Hedges was sentenced during a five-minute hearing on Wednesday, believes the UK should stop at nothing to free the \"innocent\" Briton, who was jailed after the UAE presented \"completely fabricated\" evidence. Read More Professor reveals what Matthew Hedges was doing in UAE\nHer calls for immediate action were echoed by Tory MP Johnny Mercer, who condemned the academic's jailing and called for the Government to be resilient.\nHe tweeted: \"This is ridiculous. Our Defence assistance, mentoring and intelligence relationships alone with this country should preclude absurd things like this happening. From a friend and partner, simply unacceptable.\"\nMr Hunt earlier said the UK \"will do everything we can to get him home\" over the charges he has seen \"absolutely no evidence for\".\nHe told Sky News: \"The UAE is supposed to be a friend and ally of Britain's. We've given them repeated assurances about Matthew.\n\"If we can't resolve this there are going to be serious diplomatic consequences, because this is totally unacceptable.\nMr Hedges, a Middle Eastern studies specialist, was arrested at Dubai Airport on May 5.\nA family representative said he had since been held in solitary confinement for more than five-and-a- half months, during which his \"mental and physical health seriously deteriorated\". Read More Foreign Secretary warns UAE of 'serious consequences' of jailing Devon man for life\nTheresa May said she was \"deeply disappointed and concerned\" by Mr Hedges's jailing and told MPs the UK \"will continue to press this matter at the highest level with the Emiratis\".\nProfessor Stuart Corbridge, vice-chancellor of Durham University, said there is \"no reason to believe that Matt was conducting anything other than legitimate academic research\".\nA Foreign Office spokesman did not say what form any possible diplomatic consequences could take, but said a number of options are available.\nMr Hedges has 30 days to challenge the court ruling, and Ms Tejada on Thursday started a petition on Change.org which quickly reached more than 100,000 signatures.\nShe wrote: \"Matthew may be able appeal his sentence in one month's time. Before then I am begging as many people as possible to back my petition calling on the British Government to do everything in their power to ensure the UAE let my husband come home. Read More\n\"The more members of the British public that support us, the more we can hold the Government to account - making it more likely that Matthew will come back to us.\" What do we know about Matthew Hedges?\nMatthew Hedges has begun a life jail sentence in the United Arab Emirates after being accused of spying.\nThe Government has said it has seen no evidence to back up this claim, while his family and colleagues have defended him as an academic researching in the Gulf state.\nBut what do we know about Mr Hedges?\nOriginally from Exeter, he is a 31-year-old PhD student at Durham University and is married to Daniela Tejada.\nShe has fought his corner since he was arrested at Dubai airport on May 5, initially on undisclosed charges.\nThe \"brilliant researcher\" and \"man of integrity\" was visiting solely to perform academic research, she said.\nHe was reported to have been interviewing sources about the country's foreign policy and security strategy. Read More Exeter student was jailed for life after 'five minute hearing with no lawyer'\nHis Durham University profile states that his interests include Middle Eastern politics, the changing nature of war, civil-military relations and tribalism.\nA statement from academics said he completed a Masters degree in Middle East Studies at Exeter before beginning his PhD at Durham in 2013.\nHis thesis was near completion and had been carried out \"in full accordance with Durham University's research and ethics procedures\", the joint statement from both institutions said.\n\"His academic colleagues speak highly of his work, noting both his diligence and level of scholarship, as well as his undoubted passion and care for the Arab Gulf and its people,\" it added.\nIt emerged that Mr Hedges was being held on allegations of spying, which were vehemently denied.\nHis family said he was held in solitary confinement with little access to legal advice for almost six months.\nMs Tejeda, from Bogota in Colombia, continued to lobby the Government to act and Foreign Secretary Jeremy Hunt raised her husband's plight with Crown Prince Mohammed bin Zayed and foreign minister Abdullah bin Zayed on November 12. Read More Exeter man jailed for life in UAE as UK spy\nBut a little over a week later, on November 21, he was sentenced during a five-minute hearing to life in prison, pending an appeal.\nOn hearing the sentence, he \"started shaking\" and had to \"double-check\" with the Arabic translator that he had understood correctly, said his wife, who was present in the Abu Dhabi court.\nMr Hunt said the UK has been presented with \"absolutely no evidence\" to support the charge and vowed \"serious diplomatic consequences\" if the academic is not freed. UK's ties to UAE\nWith British academic Matthew Hedges jailed in the United Arab Emirates on an allegation of spying, UK relations with the Gulf state are entering a fraught period.\nForeign Secretary Jeremy Hunt has threatened the UAE with \"serious diplomatic consequences\" if the 31-year-old is not freed, while expressing his surprise that his representations had not resolved the case.\nHe is facing fresh pressure from Mr Hedges' wife, Daniela Tejada, who accused the Foreign Office of putting relations with the UAE before her husband's freedom.\nThe UK has a close relationship with the Gulf state in many areas including military, intelligence, arms sales - and football.\nBritish service personnel train with UAE troops and Defence Secretary Gavin Williamson in April celebrated the nation's help fighting the Islamic State terror group.\nEstimates vary, but the UK has licensed hundreds of millions of pounds in arms sales to the UAE, while the Government says the nation is the Royal Navy's \"most visited port globally\". Read More Wife confirms that man held for 'spying' in UAE has been temporarily released\nIn 2016 Britain exported nearly £10 billion of goods and services to the UAE, a record figure which made it the 13th most significant market for the UK.\nIn anticipation of Brexit, Britain has worked to forge closer trade links with the UAE, which is home to about 100,000 Britons.\nThere is also historic co-operation on intelligence among other defence areas, which prompted Tory MP and former Army officer Johnny Mercer to call the jailing \"simply unacceptable\".\nSports provide another tie, with the final Formula One Grand Prix of the season to take place in Abu Dhabi on Sunday.\nSince 2008, Manchester City have been owned by Sheikh Mansour, whose finances have been the driving force for the Premiership club's resurgence.\nThe sheikh's brother, Crown Prince Mohammed bin Zayed, was among those the Foreign Secretary personally raised Mr Hedges' case with less than a fortnight before the sentencing.\nMr Hunt was \"shocked and disappointed\" by Mr Hedges' jailing on Wednesday over a charge the minister said he has seen \"absolutely no evidence\" to support. Read More Exeter man arrested in UAE on spying charges is released on bail\nThe two nations close ties will give the UK some leverage over the UAE, but Mr Hunt's threats of repercussions will be balanced with concerns of jeopardising relations.\nFor Ms Tejada, who accused Britain of \"stepping on eggshells instead of taking a firm stance\", there is no reaction too strong to get her husband home.\n\"For me, 'enough' is to get my husband back, no matter what it takes. He deserves it,\" she told BBC Radio 4's Today programme. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-23T12:28:00.000+02:00", "crawled": "2018-11-23T13:11:22.031+02:00", "highlightTitle": ""}