{"organizations": [], "uuid": "f9b6d459106a643e008526a1ad055e19d7af0ad0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14915533.ece/ALTERNATES/s1200/CFR_NJL_160718nissan_03.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/automotive-sector-warns-catastrophic-no-15477001", "country": "GB", "domain_rank": 21960, "title": "Automotive sector warns of 'catastrophic' no-deal Brexit for North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-28T14:16:00.000+02:00", "replies_count": 0, "uuid": "f9b6d459106a643e008526a1ad055e19d7af0ad0"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/automotive-sector-warns-catastrophic-no-15477001", "ord_in_thread": 0, "title": "Automotive sector warns of 'catastrophic' no-deal Brexit for North East", "locations": [], "entities": {"persons": [], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "nissan sunderland plant", "sentiment": "negative"}, {"name": "smmt", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Millionth Juke is built at Nissan Sunderland Plant, July 2018 Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThree-quarters of UK automotive firms fear a ‘no-deal’ Brexit will cause catastrophe for their businesses and threaten future viability.\nResearch by the Society of Motor Manufacturers and Traders (SMMT), which will be of huge interest to the North East given the number of jobs in the automotive sector in the region, highlights the need for a Brexit withdrawal deal and transition to prevent the industry falling off a cliff when the UK leave the EU next March.\nA total of 74.1% of companies with UK operations who took part in the member survey said that a ‘no-deal’ scenario would damage their business, with fewer than 9.0% foreseeing any positive impact.\nMore than half said their operations had already suffered as a result of uncertainty about future trading arrangements, while almost a third said they had postponed or cancelled UK investment decisions because of Brexit. One in five said they have also lost business as a direct consequence. A dashboard being fitted on a manufacturing line (Image: Anna Gowthorpe/PA Wire)\nThe survey results come a month after car giant Nissan warned of “serious implications” for its Sunderland plant and the wider manufacturing industry in the event of a so-called hard Brexit.\nThe firm has grown to employ more than 6,000 people at its Wearside plant, while thousands more work in its supply chain – some of which is looking to move to the new IAMP manufacturing park, starting with its supplier SNOP, which has started construction of its new base on phase one of the multimillion-pound plant.\nThe firm stressed how frictionless trade is essential to its business, using its UK base to export to the EU while benefitting from being able to trade freely,while importing some 85% of its parts which currently arrive without customs checks or extra tariffs. Read More De La Rue's loss of UK passport printing contract at Gateshead triggers new strategy\nThe SMMT – which represents an industry employing 856,000 people and delivering £20.2bn to the economy – said more than half of firms said contingency plans are now being executed, with over one in 10 (12.4%) relocating UK operations overseas and the same proportion already reducing employee headcount.\nMany have also made alterations to logistics and shipping routes, investment in warehousing and stock and adjustments to production schedules. SMMT members also outlined the further and long-term damage that a ‘no-deal’ Brexit would do to their businesses.\nSome 68.5% said their profitability would be negatively affected, with 53.9% concerned about their ability to secure new overseas business and a similar number worried about maintaining investment in their UK operations. A further half said a ‘no-deal’ scenario would undermine their ability to maintain their existing workforce. The EU and Union flags (Image: PA)\nMike Hawes, SMMT chief executive, said: “Frictionless trade as part of the EU single market and customs union has driven the success of the UK automotive industry so the fact we are leaving is already painful, and already causing damage.\n“Leaving without a deal would be catastrophic – plants will close; jobs will be lost. Leaving is not what we wanted, but we recognise that the withdrawal agreement has been hard-fought and, crucially, delivers a transition period which steps us back from the cliff-edge.\n“We need a deal now, and we need an ambitious deal for the future that guarantees frictionless trade with our most important market – nothing else will do, and we urge all parties to remember what’s at stake.”\nTony Walker, SMMT president and MD of Toyota Motor Europe’s London office, said: “No deal is not an option. In the short term, crashing out of the EU would have immediate and devastating impacts, with border chaos disrupting the Just in Time basis on which our business depends. Read More Government needs to help businesses in North East after Brexit, report says\n“Disruption could last for weeks – even months. It is unimaginable that we could implement full WTO import and export procedures overnight. For the longer term, a ‘no-deal’ “Brexit would harm our competitiveness, undermine sales and cost jobs… We need the certainty of a deal, not more uncertainty, and we need the smooth transition period based on current trading conditions.\n“It is vital we have free and frictionless trade with common technical standards. Without these, we risk losing all we have achieved in building a world-class automotive sector.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-28T14:16:00.000+02:00", "crawled": "2018-11-30T02:30:13.017+02:00", "highlightTitle": ""}