{"organizations": [], "uuid": "1689cd320898273ddd2f42635e13486aa908751a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.derbytelegraph.co.uk/incoming/article1974666.ece/ALTERNATES/s1200/1_RLR_TEM_050918_parliament_03.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/what-you-think-brexit-leicestershire-2277824", "country": "GB", "domain_rank": 48128, "title": "What do you think about Brexit? Leicestershire Live will put YOUR questions to Stephen Barclay - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-30T02:00:00.000+02:00", "replies_count": 0, "uuid": "1689cd320898273ddd2f42635e13486aa908751a"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/leicester-news/what-you-think-brexit-leicestershire-2277824", "ord_in_thread": 0, "title": "What do you think about Brexit? Leicestershire Live will put YOUR questions to Stephen Barclay - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "neutral"}, {"name": "stephen barclay", "sentiment": "neutral"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicestershire live", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What do you think about Brexit? Leicestershire Live will put YOUR questions to Stephen Barclay You can ask him what ever you want about these uncertain times Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nNo one will have failed to notice the Government hitting high gear in recent days trying to sell Theresa May’s Brexit Deal to the county.\nThe Prime Minister has agreed a Withdrawal Agreement with the EU but will still have colossal task persuading MPs here to sanction it when it goes to the House of Commons for a vote on December 11.\nIf MPs back the PM’s Brexit vision then we will know the terms on which the UK will disentangle itself from the EU on March 29.\nIf not, then the possibility of a ‘no deal’ Brexit looks ever more likely.\nMPs who back both Leave and Remain have deep reservations about Mrs May’s deal so she is trying to persuade the British public directly in the hope it will win politicians over to her cause. poll loading How would you vote in a second referendum? 0+ VOTES SO FAR No deal Brexit Remain in the EU\nSpeeches, radio interviews and a television debate between Mrs May and Labour leader Jeremy Corbyn are being scheduled to try to bring some order into what has been a chaotic few weeks in politics\nAll the while there is lobbying for a People’s Vote – a second referendum – by those who would like to see Brexit binned because of fears over the economy.\nA new Brexit Secretary Stephen Barclay has been thrown in at the deep end following the resignation of his predecessor Dominic Raab who said the deal on the table had ‘major and fatal flaws’ and would damage the economy and devastate public trust in democracy. Theresa May and Jeremy Corbyn But what do you think?\nMr Barclay has agreed to answer Brexit questions from Leicestershire Live readers.\nHe said: \"Brexit is a huge issue for this country. We're approaching a key moment in this process, where MPs will soon get to vote on the Prime Minister's deal - a deal that delivers on the results of the referendum. I'm keen to answer questions from Leicestershire Live's readers about what this means for them and for Leicestershire.\"\nYou can ask him what ever you want about these uncertain times.\nWe know passions are running high but please keep the questions sensible and civilised.\nLet us know via what you would like to ask the Brexit Secretary and we’ll send ten of them for him and his staff chew over.\nYou don’t have to tell us your name, age, where you’re from but it might help.\nEarly next week we’ll publish his responses. Like us on Facebook ", "external_links": [], "published": "2018-11-30T02:00:00.000+02:00", "crawled": "2018-11-30T17:04:53.002+02:00", "highlightTitle": ""}