{"organizations": [], "uuid": "ff98dc07cebde7ac8f49e4933c97d58858d21db9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15417767.ece/ALTERNATES/s1200/3_Brexit1.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-full-statement-cabinet-15417873", "country": "GB", "domain_rank": 21960, "title": "Theresa May's full statement as cabinet AGREES daft Brexit plan after marathon five-hour meeting", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T22:25:00.000+02:00", "replies_count": 0, "uuid": "ff98dc07cebde7ac8f49e4933c97d58858d21db9"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-full-statement-cabinet-15417873", "ord_in_thread": 0, "title": "Theresa May's full statement as cabinet AGREES daft Brexit plan after marathon five-hour meeting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nTheresa May has insisted her draft Brexit scheme is \"firmly in the national interest\".\nThe Prime Minister spoke outside 10 Downing on Wednesday night, after her cabinet finally signed off on the proposed deal after a marathon meeting.\nShe acknowledged there would be \"difficult days ahead\" and said she will outline the deal to MPs in the House of Commons on Thursday.\nThe draft divorce deal, which runs to 585 pages, has now been published. It includes a temporary Irish backstop to prevent a hard border, access for the UK and the EU to each others markets, and talk of an \"ambitious customs arrangement\" in the future relationship. Prime Minister Theresa May makes a statement outside 10 Downing Street (Image: PA)\nThere has been criticism of the proposal from both political sides. Jeremy Corbyn labelled it a \"botched deal\" in Prime Minister's Questions earlier on Wednesday.\nMeanwhile Conservative backbencher and chair of the European Research Group Jacob Rees-Mogg wrote to fellow Tory MPs urging them not to support the deal. Read More Brexit deal LIVE: Theresa May announces Cabinet has BACKED the draft withdrawal agreement\nCalling the deal \"profoundly undemocratic\" he said: \"The proposed agreement will see the UK hand over £39 billion to the EU for little or nothing in return.\"\nMeanwhile, Arlene Foster, whose DUP party props up Mrs May's minority administration in the Commons, warned the PM there would be \"consequences\" if her deal treats Northern Ireland differently from the rest of the UK.\nThe draft plan will now have to be approved by the House of Commons, and a summit will take place with the European Union, potentially later this month.\nJean-Claude Juncker, the President of the European Commission, has written to European Council President Donald Tusk to say that the withdrawal negotiations had concluded and the next step in the process can begin.\nThe European Parliament's Brexit co-ordinator, Guy Verhofstadt, welcomed the \"positive progress\" in negotiations, describing the draft agreement as \"a milestone towards a credible and sustainable future relationship between the EU and the UK\". Chancellor of the Exchequer, Philip Hammond, leaves Downing Street as cabinet ministers read the draft Brexit documents (Image: Getty Images) Mrs May's full statement outside Number 10 on Wednesday night\n\"The Cabinet has just had a long, detailed and impassioned debate on the draft withdrawal agreement and the outline political declaration on our future relationship with the European Union. \"These documents were the result of thousands of hours of hard negotiation by UK officials and many, many meetings which I and other ministers held with our EU counterparts. \"I firmly believe that the draft withdrawal agreement was the best that could be negotiated and it was for the Cabinet to decide whether to move on in the talks. \"The choices before us were difficult, particularly in relation to the Northern Ireland backstop, but the collective decision of Cabinet was that the Government should agree the draft withdrawal agreement and the outline political declaration. \"This is a decisive step which enables us to move on and finalise the deal in the days ahead. \"These decisions were not taken lightly but I believe it is a decision that is firmly in the national interest. Read More Nick Forbes, leader of Newcastle City Council announces he is standing for North of Tyne mayor \"When you strip away the detail, the choice before us is clear: this deal, which delivers on the vote of the referendum, which brings back control of our money, laws and borders, ends free movement, protects jobs, security and our Union; or leave with no deal, or no Brexit at all.\n\"I know that there will be difficult days ahead. This is a decision which will come under intense scrutiny, and that is entirely as it should be and entirely understandable.\n\"But the choice was this deal, which enables us to take back control and to build a brighter future for our country, or going back to square one with more division, more uncertainty and a failure to deliver on the referendum.\n\"It is my job as Prime Minister to explain the decisions that the Government has taken and I stand ready to do that, beginning tomorrow with a statement in Parliament. \"If I might end by just saying this: I believe that what I owe to this country is to take decisions that are in the national interest.\n\"And I firmly believe, with my head and my heart, that this is a decision which is in the best interests of our entire united Kingdom.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-14T22:25:00.000+02:00", "crawled": "2018-11-15T00:08:58.002+02:00", "highlightTitle": ""}