{"organizations": [], "uuid": "b1c7f71efa4c1114f7b148080eba844139f641e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15431304.ece/ALTERNATES/s1200/0_Opening-Ceremony-Of-The-Great-Exhibition-Of-The-North.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15437124", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-20T07:00:00.000+02:00", "replies_count": 0, "uuid": "b1c7f71efa4c1114f7b148080eba844139f641e3"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15437124", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "emily atack", "sentiment": "none"}, {"name": "cheryl", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}], "locations": [{"name": "gosforth park", "sentiment": "none"}], "organizations": [{"name": "ofcom", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A Cambridge Audio Amp and CD player Mulberry holdall Cigar cutter and lighter A white motorbike helmet with a picture of Krusty the Clown on the back with ‘DOM’ signed on the back, Clothing.\nA spokesperson for Durham police said: “Anyone who is offered any of these items or who has any information is asked to call Durham Constabulary on 101, quoting incident reference 130 of November 9.” 09:34 A1 traffic back to normal\nA few of the traffic alerts I reported on earlier now seem to have cleared.\nThe abandoned vehicle at Kenton Bar has been cleared, and a Southbound lane on the A1 at Gosforth Park has reopened after an earlier breakdown. 09:28 Still very slow at Silverlink\nTravel time is about 14 minutes around the Silverlink roundabout in the roadworks area. 09:25 \"Abandoned vehicle\" near Kenton Bar\nA1 Northbound is partially blocked, with queuing traffic on the exit slip road due to an “abandoned vehicle” at J77 Ponteland Road (Kenton Bar Roundabout).\nThe abandoned vehicle is located on the exit slip road from the A1 on to the A696. Traffic is queuing on this exit slip and is slow on the A1 Northbound around this junction. 09:22 Save beautiful Durham Miners' Hall\nA bid to raise £6m to transform one of Durham’s historic hidden gems has been launched.\nCampaigners want to breathe new life into the Redhills Durham Miners’ Hall which once saw representatives from every pit in the area meet and fight for better working conditions.\nThe beautiful 103-year-old building, which is full of historic memorabilia, is underused and showing signs of wear and tear.\nBut, on the 150th birthday of the Durham Miners’ Association, a push to turn it into a venue and conference centre is being unveiled. Inside Durham Miners’ Association HQ (Image: Newcastle Chronicle) 09:16 I'm a Celeb snake bite\nThey are the challenges are celebrities dread.\nAnd on Monday night’s I’m A Celebrity viewers saw actress Emily Atack take on more than 50 snakes in a Bushtucker Trial - and even get bitten.\nShe had to brave a Viper Pit filled with a variety of pythons and rummage for stars - which represented food for the hungry campers. Emily Atack doing the bushtucker trial on I'm A Celebrity 09:10 Ofcom complains over Cheryl performance\nCheryl’s controversial X Factor performance shocked some viewers so much that they sent complaints to Ofcom.\nThe TV regulator received a reported 15 complaints about the Geordie’s first stage performance in four years, according to OK! Online.\nThe 35-year-old former judge took to the stage to perform her new single ‘Love Made Me Do It’. 08:52 A1 break down\nOne lane is blocked and traffic is queuing due to a broken down car on A1 Southbound after J79 A1056 ( Gosforth Park).\nThe breakdown happened just after the Roundabout. Lane two (of two) is blocked. 08:42 Should council fund free magazine?\nOpposition councillors have attempted to block a funding grant used to promote local projects in Sunderland’s Vibe Magazine.\nThis month, Sunderland City Council’s (SCC) five area committees were asked to approve £5,000 each for area updates in the free magazine.\nThe funding - from strategic initiative budgets - will pay for double page spreads across four editions next year with an aim of promoting committee-backed projects.\nBut is it worth it? Some councillors didn’t think so. 08:31 Nissan chair will be sacked\nSome of yesterday’s big news: Nissan has announced it will dismiss its chairman Carlos Ghosn after the businessman under-reported his income.\nMr Ghosn, who is also chief executive and chairman of Renault, is reported to have been arrested in Japan following an internal investigation into his financial affairs at the car manufacturer. Carlos Ghosn, Nissan Motor Corporation Chairman and CEO (Image: Getty Images North America)\nThe Japanese carmaker said its investigation – based on a whistleblower report – found that Mr Ghosn had falsified reports on his compensation “over many years”.\nThe investigation also found other instances of misconduct, including the personal use of company assets. 08:22 Dangerous dog owner jailed - with death penalty for the animal\nThe owner of a dog which left a woman needing 40 stitches has been locked up - while the animal which “wouldn’t stop” biting her must be destroyed.\nStaffordshire Terrier crossbreed Cash struck outside a pub, repeatedly biting Laura Anderson in a terrifying attack.\nMiss Anderson described how there was “blood everywhere” as she suffered bite marks to areas including her arm, leg, buttock and torso.\nPaul Dees was found guilty of being the owner of a dog that caused injury while dangerously out of control in a public place, after a trial at Newcastle Crown Court . 08:04 Passengers charged after Ryanair website crash\nFurious passengers blasted budget airline Ryanair for slapping them with £55 fees for not being able to check-in online after its website crashed.\nJetsetters took to social media to vent their anger with the budget airline on Monday night when they could not access its website for hours.\nSome were left fuming when they could not book flights, but others barraged the airline with complaints that they had been handed late fees for not checking-in in advance. 07:47 Rush hour traffic round up\nRush hour is approaching, and here are a few of the areas across the region where it’s starting to look busy: Usual congestion on A19 at The Silverlink Roundabout ( A1058 Coast Road) in the roadworks area. Travel time is six minutes. Slow traffic and traffic heavier than normal on A690 Northbound from Scripton Gill Road (Brandon) to B6300 Browney Lane (Meadowfield). Slow traffic on A695 Eastbound from Stargate Lane (Stargate Roundabout) to B6317 / Garden Street (Blaydon Roundabout). In the roadworks area. Temporary traffic lights in operation just before Blaydon Roundabout. Queueing traffic on A1 Western Bypass Northbound around A167 Angel Of The North coming from Chester-le-Street. Travel time is 16 minutes. 07:35 MP dismisses damning UN universal credit report\nAmber Rudd has dismissed a special report which looked at poverty levels in Newcastle but admitted there are “problems” with Universal Credit.\nUN special rapporteur Philip Alston visited the West End food bank on November 7 as part of a 12-day tour of the country investigating deprivation.\nHe accused the Government of being “in a state of denial” over the extent of poverty nationally and was critical of the new benefits regime.\nSpeaking in the Commons yesterday, Ms Rudd, the new Work and Pensions Secretary, said the report was “extraordinarily political” but accepted Universal Credit “can be better”. 07:24 Man shot by police \"giggled\" a rubber bullets hit\nA man shot dead by armed police “giggled” when he was hit by a rubber bullet moments before the fatal shot, an inquest has heard.\nJames Carlo Wilson called police to Frenchman’s Way, South Shields in the early hours of March 29, 2016, telling them he had a 9mm handgun and would shoot officers who arrived.\nThe 24-year-old was outside his ex-partner Kayleigh Reay’s home when he entered into the stand-off with armed police.\nWe’ve been reporting from the inquest into his death - here’s the latest news . 07:02 Salon staff \"mocked\" customer's looks\nA teenager claims staff at her salon “beauty shamed” her on a WhatsApp group over her appearance.\nCustomer Mia Capeling was left close to tears by the cruel comments.\nThe 18-year-old’s image was mocked in a WhatsApp group called ‘The Best Salon Team’, which appeared to include staff members from the Washington salon.\nOne group member posted a picture of Mia in her makeup, with the caption: “One of our clients - not being rude or horrible but WTF.”\nIt was followed by laughing emojis from another group member.\n“I was close to tears when I read it,” said Mia, a mum-of-one who has likened it to the playground bullying she received as a child. 06:52 DUP's Brexit warning shot\nFor anyone catching up on the UK-wide political news this morning, the major news from Parliament yesterday comes from Theresa May’s one-time allies, the Democratic Unionist Party.\nAccusing the Prime Minister of breaking fundamental promises on Brexit, they joined with Labour opposition in a vote on the budget last night, cutting the Prime Minister’s majority to just five votes.\nThey also abstained on a series of other amendments to the Finance Bill on Monday night in a move intended to send a “political message” to Prime Minister.Their actions appeared to call into question the future of the “confidence and supply” arrangement by which the DUP props up Mrs May’s minority Conservative Government.Under the terms of the deal, agreed after Mrs May lost her Commons majority in last year’s general election, the Northern Ireland party is supposed to back the Government on Budget matters and on confidence votes.But DUP Brexit spokesman Sammy Wilson said Mrs May’s deal with Brussels breached a “fundamental” assurance that Northern Ireland would not be separated constitutionally or economically from the rest of the UK.“We had to do something to show our displeasure,” he told BBC2’s Newsnight last night.“All of them were designed to send a message to the Government: ‘Look, we have got an agreement with you but you have got to keep your side of the bargain otherwise we don’t feel obliged to keep ours’.“She has broken all of those promises - to the people of the United Kingdom, to her own party and to the people of Northern Ireland.” 06:38 Traffic update\nThe morning traffic seems to be starting already - the roads are slow at on A194(M) and A194 Leam Lane in both directions at A184 Newcastle Road (White Mare Pool Roundabout), while the Felling Bypass Westbound is looking busy but moving.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15437124;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-20T07:00:00.000+02:00", "crawled": "2018-11-20T11:24:45.015+02:00", "highlightTitle": ""}