{"organizations": [], "uuid": "04e0d7bbd15214fe75d330d97aebbe5e0887ecc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1754898.ece/ALTERNATES/s1200/Neil-Parish-in-Full-Flow.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/pm-must-renegotiate-no-chance-2243728", "country": "US", "title": "PM must renegotiate as no chance of getting current Brexit deal through Parliament", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-21T16:26:00.000+02:00", "replies_count": 0, "uuid": "04e0d7bbd15214fe75d330d97aebbe5e0887ecc3"}, "author": "Neil Parish", "url": "https://www.devonlive.com/news/news-opinion/pm-must-renegotiate-no-chance-2243728", "ord_in_thread": 0, "title": "PM must renegotiate as no chance of getting current Brexit deal through Parliament", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}], "organizations": [{"name": "parliament news", "sentiment": "none"}, {"name": "parliament neil", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion PM must renegotiate as no chance of getting current Brexit deal through Parliament Neil Parish MP says that he cannot support the current Withdrawal Agreement, but both the PM and the EU must amend the deal Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010\nAs our exit date from the European Union approaches, there is understandably a lot of noise and concern about Brexit.\nEngagement is vital for our democracy and I am very glad that so many of you have been in touch to express considered views on the direction of the country. Read More Brexit is an opportunity for our country to control our laws and borders\nOn Sunday Politics South West and at Prime Minister’s Questions this week, I set out mine: There is much that I agree with in the Withdrawal Agreement, but I cannot support the deal as it stands. The Prime Minister must renegotiate. Neil Parish MP\nFirst, the Northern Ireland ‘backstop’ threatens the integrity of the United Kingdom. It includes a commitment by the UK to apply, in Northern Ireland, EU legislation on industrial, environmental and agricultural goods. As a Conservative and Unionist MP, applying different rules and regulations to Northern Ireland is not an ‘insurance policy’, but an unthinkable reality of failing to agree our future trade relationship by 2020. It must not be allowed to happen. Read More The Chancellor should cut taxes in the budget to help ordinary working people\nSecond, by agreeing to the EU’s sequencing, we agree to pay over £39 billion now. I accept that we have obligations to meet, but a substantial part of the £39 billion sum is made up of contributions to the EU Budget during the upcoming transition period. Whilst we continue to pay into the EU Budget and accept the EU’s rules and regulations in a transition period, the EU clearly have no incentive to end the transition period and work quickly towards a looser trade deal. Read More Ben Bradshaw on Dawlish rail line and the sea-change in public opinion on Brexit\nAs a farmer all my life, I know you do not pay in advance for something which you may or may not get. We need legally binding agreements on a comprehensive future trade deal now, otherwise MPs are being asked to vote away the UK’s leverage. This week, the Prime Minister must listen to concerns and bring back a deal we can all support. Neil Parish MP\nI have been consistently supportive of the Prime Minister. She has an extremely challenging job trying to unite the country, satisfy Parliament and agree a deal with the EU. Some of the language directed at her has been unacceptable and does nothing to further constructive debate. I know she is working hard to deliver on a deal that she believes is in our national interest and I think we can get there, if she listens, over the next few weeks. Read More Theresa May has finally united the Remain and Leave camps - against her\nWhen the Withdrawal Agreement comes before the Commons, I want to vote for the deal to ensure a smooth and orderly exit from the European Union. But there is no chance of getting the current deal through Parliament. The European Commission must understand this reality, revisit and amend the Agreement, or they too will leave without a deal. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-21T16:26:00.000+02:00", "crawled": "2018-11-21T16:43:16.028+02:00", "highlightTitle": ""}