{"organizations": [], "uuid": "c5b3365ab2797555012b212d8c355630ec04f751", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14781870.ece/ALTERNATES/s1200/Prime-Ministers-Questions.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/revealed-north-east-mp-who-15429201", "country": "GB", "domain_rank": 21960, "title": "Revealed: The North East MP who claimed the most expenses this year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-17T16:07:00.000+02:00", "replies_count": 0, "uuid": "c5b3365ab2797555012b212d8c355630ec04f751"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/revealed-north-east-mp-who-15429201", "ord_in_thread": 0, "title": "Revealed: The North East MP who claimed the most expenses this year", "locations": [], "entities": {"persons": [{"name": "wil", "sentiment": "none"}, {"name": "paul williams", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe North East MPs with the highest expenses claims have been revealed.\nPaul Williams, Labour MP for Stockton South, has claimed £44,938 so far this year.\nIt makes him far and away the most expensive MP in the North East.\nHe said his costs were higher than those of other MPs partly because he was elected for the first time in the 2017 general election, taking a Conservative-held seat.\nHe said: “These are the costs of train travel to and from London, rent of a flat in London, setting up an office in my constituency and running that office. My costs for this period are higher than most other MPs because of the £6,000 start-up supplement and because of my family caring responsibilities.” Stockton South MP Paul Williams (Image: Paul Williams)\nMuch of the money, £10,833 of the amount claimed, was for accommodation.\nSome £3,857 was for business rates and £528 was spent on renting a constituency office.\nMr Williams spent £2,247 on new computer equipment, and £392 went on food and drink for staff.\nIn second place was Grahame Morris, Labour MP for Easington, who so far this year has claimed £26,271.\nThat included 8,559 for accommodation and £8,823 on renting a constituency office.\nThere was also £1,907 was for new computer equipment, and £178 went on business cards.\nMPs are allowed to claim expenses to help them pay the costs of doing their job.\nThat includes staying overnight in London when the House of Commons is sitting, and travelling to the capital from their constituencies on a regular basis.\nMany MPs also have offices in their constituencies, designed to make it easy for constituents to find them, and have to pay rent for that. Read More Anne-Marie Trevelyan accused of \"abandoning\" constituency as she quits Government post over Brexit\nBut different MPs approach their jobs in different ways. Some see their role as offering help and advice directly to their constituents, and might spend money on a high-profile office on a high street.\nOthers believe their focus should be firmly on representing constituents in the House of Commons, and may have lower costs in their constituency but spend more time in London.\nMPs have an annual salary of £77,379, and can earn more if they have a Government role or chair a committee.\nHowever, expenses are not a supplement to their salary and MPs get no direct benefit from them.\nThe system went through radical reforms following the expenses scandal in 2009, when it was discovered that one MP had claimed £1,645 for a duck shelter in his pond.\nMPs were able to buy second homes in London and claim for the cost of the mortgage, potentially giving them a valuable property at taxpayers’ expense. This system has been abolished.\nOur analysis found that Hexham MP Guy Opperman claimed £25,500 so far this year, Middlesbrough MP Andy McDonald claimed £25,394, and Simon Clarke, MP for Middlesbrough South and East Cleveland, claimed £23,777. Read More\nThe average cost of expenses claimed so far this year is £16,964 per MP.\nThat makes a total £11m claimed by all MPs since January.\nOnly eight of the claiming MPs in the North East were below average, but this could be because they have to travel further to London than others. Who spent what?\nPaul Williams, Stockton South, £44,938\nGrahame Morris, Easington, £26,271", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-17T16:07:00.000+02:00", "crawled": "2018-11-17T22:40:48.000+02:00", "highlightTitle": ""}