{"organizations": [], "uuid": "792d7ada658ac9db308a430a57880bdf625df68e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15429822.ece/ALTERNATES/s1200/0_Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-eu-leaders-back-theresa-15462209", "country": "GB", "domain_rank": 21960, "title": "Brexit: EU leaders BACK Theresa May's deal in Brussels", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-25T13:18:00.000+02:00", "replies_count": 0, "uuid": "792d7ada658ac9db308a430a57880bdf625df68e"}, "author": "Sophie Doughty", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-eu-leaders-back-theresa-15462209", "ord_in_thread": 0, "title": "Brexit: EU leaders BACK Theresa May's deal in Brussels", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "matt dunhaml/pa wire", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "negative"}, {"name": "european commission", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nEuropean Union leaders have backed Theresa May's Brexit plans.\nAt a summit in Brussels on Sunday morning the remaining 27 EU leaders endorsed the terms of the Withdrawal Agreement and the Political Declaration finally agreed with the commission last week. Prime Minister Theresa May holds a press conference at 10 Downing Street, London, to discuss her Brexit plans. (Image: Matt Dunhaml/PA Wire)\nThe announcement that the remaining 27 EU leaders had backed the plan came in a tweet from European Council president Donald Tusk barely 40 minutes after the meeting started.\nAnd shortly afterwards Mrs May arrived at the council building in the Belgian capital to join the other leaders.\nAnd now European Commission president Jean-Claude Juncker has warned Britain cannot expect to get a better Brexit deal if Parliament rejects the agreement hammered out by the Prime Minister. Prime Minister Theresa May greets European Commission President Jean-Claude Juncker ahead of a working dinner at 10 Downing Street, London (Image: John Stillwell/PA Wire)\nHe said: \"This is the deal. It's the best deal possible and the EU will not change its fundamental position when it comes to these issues.\nMr Juncker's comments were echoed Dutch prime minister Mark Rutte who urged MPs to give their approval in a vote expected to take place in the House of Commons, next month.\nHe said: \"This is the deal on the table. I don't think there is anything more now. I don't want to contemplate a no vote. I think there will be a yes vote.\n\"I think this is the best we can all do - both Theresa May and her Government as well as the European Union.\n\"I do think she has everything now to argue for a yes vote in the British Parliament.\"\nThe EU's chief negotiator Michel Barnier said the deal was a \"necessary step\" to prepare for the next phase of negotiations which the Government hopes will result in a wide-ranging free trade agreement. European Union chief Brexit negotiator Michel Barnier (Image: AP)\n\"Now it is time for everybody to take their responsibility. This deal is a necessary step to build the trust between the UK and the EU we need to build,\" Mr Barnier said.\n\"The next phase is an unprecedented and ambitious partnership. We will remain allies, partners and friends.\"\nAhead of the meeting Mrs May issued a direct plea to the public to support plan.\nIn a \"letter to the nation\", she said leaving the EU on March 29 2019 would mark \"a new chapter in our national life\" and there would be a moment of \"renewal and reconciliation\" after the bitter battles over Europe.\nThe almost 800-word message is an attempt to speak directly to the public to build support for her deal, which faces widespread opposition at Westminster including from both wings of her Conservative Party and the Democratic Unionist Party which props up her administration.\nShe said the deal \"will honour the result of the referendum\" by allowing the UK to \"take back control\" of its money, laws and borders.\n\"It is a deal for a brighter future, which enables us to seize the opportunities that lie ahead,\" she said. Read More Who is Matthew Hedges, why was he locked-up in the UAE and what has happened now?\nShe promised she would be \"campaigning with my heart and soul\" to win the vote in the Commons.\nAnd \"with Brexit settled\" the UK will be able to focus on the economy, NHS, building homes and tackling the \"burning injustices\" in society, the Prime Minister added.\nThe summit in Brussels is only taking place after Spain claimed the UK and EU had given into its demands for concessions over the future of Gibraltar.\nSpanish Prime Minister Pedro Sanchez claimed the UK and European Union had agreed to its demands for guarantees over the status of Gibraltar in future negotiations.\nMeanwhile Mrs May's political difficulties at home showed no sign of abating, with speculation that Remain-leaning Cabinet ministers have begun secret talks on a Brexit \"Plan B\" if the deal is rejected by MPs. Read More 'I can't forget what I saw' - Landlord who found murdered Ashley Cochrane tells of horror scene and escalating drug violence on Shields Road\nThe Sunday Times reported that Chancellor Philip Hammond - who warned on Saturday of \"economic chaos\" if there is no deal - is working with David Lidington, Amber Rudd, Greg Clark and David Gauke on trying to persuade Mrs May to adopt a softer Brexit which may be able to get through Parliament if her plan is rejected.\nThe Sunday Telegraph also reported that \"several senior ministers\" were working on plans for a Norway-style relationship with the EU. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-25T13:18:00.000+02:00", "crawled": "2018-11-25T16:40:37.000+02:00", "highlightTitle": ""}