{"organizations": [], "uuid": "8090b4ddfc040d121f372df8ff2872ae23ae23df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.cornwalllive.com/incoming/article1495343.ece/ALTERNATES/s1200/0_Embraer-Flybe-195-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/flybe-sold-merged-thanks-brexit-2217368", "country": "GB", "title": "Flybe to be sold or merged thanks to Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T08:29:00.000+02:00", "replies_count": 0, "uuid": "8090b4ddfc040d121f372df8ff2872ae23ae23df"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/flybe-sold-merged-thanks-brexit-2217368", "ord_in_thread": 0, "title": "Flybe to be sold or merged thanks to Brexit", "locations": [], "entities": {"persons": [{"name": "stobart", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "southampton airport", "sentiment": "none"}], "organizations": [{"name": "evercore", "sentiment": "none"}, {"name": "eil shaw head of digital", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Flybe to be sold or merged thanks to Brexit An announcement is expected on Wednesday morning Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 06:29, 14 NOV 2018 Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nExeter-based airline Flybe is to be sold or merged and bankers have been brought in to seek a potential deal, reports Sky News .\nThe move was announced to the London Stock Exchange on Wednesday morning and comes after a recent profit warning and amid uncertainity over Brexit.\nSky says bankers Evercore were brought in to negotiate a sale or takeover in the face of a weaker pound and higher fuel costs. Read More Flybe pilot fired because he developed a fear of flying wins tribunal\nIn a statement released at 7am Flybe said: \"The Board of Flybe Group plc (\"Flybe\" or the \"Company\") announces today that it is undertaking a comprehensive review of the various strategic options open to it to address the current challenges facing the airline industry and maximise value for shareholders.\n\"These options include further capacity and cost saving measures, initiatives to strengthen the balance sheet and preserve cash resources, as well as a potential sale of the Company through the commencement of a \"formal sale process\" (as referred to in Note 2 on Rule 2.6 of the Code).\n\"The Board has appointed Evercore as its financial adviser to assist it with this review.\"\nThe statement adds: \"The Company confirms that, at the time of this announcement, it is in discussions with a number of strategic operators about a potential sale of the Company.\n\"Parties with a potential interest in making a proposal should contact Evercore.\"\nFlybe's interim results were announced at 7am today. Sky says Stobart group, owner of Southampton Airport, may buy the Devon airline.\nAddressing Brexit in the 7am announcement, in which Flybe revealed a profit of £14million, Flybe said: \"Brexit remains a major uncertainty for the sector and the wider economy.\n\"The Government continues to negotiate the UK's exit from the European Union but has not yet reached an agreed deal. In relation to aviation, the various Government papers on Brexit set out the issues facing the industry and failure to reach an agreement may put at risk, or damage, parts of the business.\n\"The \"no-deal\" Brexit proposals give a 14 month stand off period, thus giving more time for consideration of alternative strategies and solutions if required.\n\"The Board believes that an appropriate agreement will be reached, although it is also developing contingency plans including potentially reassigning contracts that could be directly affected.\"\nChristine Ourmières-Widener, Flybe Chief Executive Officer, said: \"In line with our strategy, we reduced seat capacity in the first half by 9.0% delivering a 7.2% increase in revenue per seat.\n\"Continued improvements are being seen into quarter three which demonstrates the popularity of Flybe for our customers.\n\"However there has been a recent softening in growth in the short-haul market, as well as continued headwinds from higher fuel and currency costs.\n\"We are responding to this by reviewing every aspect of our business, especially further capacity reduction, cash management and cost savings.\n\"This is already starting to have a positive impact, as shown by the improved first half adjusted profit before tax; however, we must do more in the coming months. We remain confident in the vital role that Flybe plays in UK connectivity.\" Like us on Facebook ", "external_links": ["https://news.sky.com/story/brexit-and-fuel-costs-force-airline-flybe-to-put-itself-up-for-sale-11553619?fbclid=IwAR0Nv5equv88ak2iHLkn551pfwGrN_AW9PQFYdGFQxQ-sfXf_bC1unTx-No", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-14T08:29:00.000+02:00", "crawled": "2018-11-14T09:11:20.014+02:00", "highlightTitle": ""}