{"organizations": [], "uuid": "b1f700dd0bc852ad1c03074d9b60f184d8bbb5eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13123064.ece/ALTERNATES/s1200/Bond-Dickinson-managing-partner-Jonathan-Blair-with-Womble-Carlyle-CEO-Betty-Temple.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/big-rise-companies-seeking-brexit-15393683", "country": "GB", "domain_rank": 21960, "title": "Big rise in companies seeking Brexit advice, says Newcastle law firm Womble Bond Dickinson", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-09T15:50:00.000+02:00", "replies_count": 0, "uuid": "b1f700dd0bc852ad1c03074d9b60f184d8bbb5eb"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/big-rise-companies-seeking-brexit-15393683", "ord_in_thread": 0, "title": "Big rise in companies seeking Brexit advice, says Newcastle law firm Womble Bond Dickinson", "locations": [], "entities": {"persons": [{"name": "blair", "sentiment": "none"}, {"name": "womble bond dickinson", "sentiment": "none"}, {"name": "jonathan blair", "sentiment": "none"}, {"name": "redeker sellner dahs", "sentiment": "none"}, {"name": "mark savage photography", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "womble bond dickinson big", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "womble bond dickinson links", "sentiment": "negative"}, {"name": "eu share bond dickinson", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "womble bond dickinson", "sentiment": "none"}, {"name": "womble carlyle ceo betty temple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Big rise in companies seeking Brexit advice, says Newcastle law firm Womble Bond Dickinson Links with German law firm increase as UK nears exit from the EU Share Bond Dickinson managing partner Jonathan Blair with Womble Carlyle CEO Betty Temple (Image: Unknown)\nNewcastle law firm Womble Bond Dickinson has increased its collaboration with a firm in Germany as businesses in the region seek help over the uncertainties surrounding Brexit.\nThe North East firm formed an alliance with Germany’s Redeker Sellner Dahs in 2014, and UK managing partner Jonathan Blair has said his business is now working closer with its EU partner because of the uncertainty surrounding Brexit.\nThe extra work is referred to in the firm’s accounts, which slow a slight rise in turnover for the year ending April 30 but a small firm in operating profit.\nMr Blair said: “We are certainly seeing a sharp uptick in Brexit-related queries. It’s primarily companies who have import and export concerns, and commercially driven issues.” Jonathan Blair UK managing partner of Womble Bond Dickinson (Image: Mark Savage Photography)\nMr Blair also outlined a long-term trend in the increasing use of technology in the law, saying that its WBD Advance unit - which is made up of paralegals, legal executives and data analysts - was providing a cheaper and more efficient service through the use of new technology.\nBut he said the move to automation had to be handled carefully and “clients still value service and good quality legal advice”. Read More Newcastle law firm Mincoffs acquires boutique tech firm Particular Legal\nWomble Bond Dickinson’s UK financial figures remained largely flat for the year, with turnover increasing from a restated figure of £103.2m to £104.9m. Operating profit during the year dipped from £27.1m to £26.8m, while profit after tax fell from £26.55m to £26.48m.\nThe UK accounts are the first to be released since Womble Bond Dickinson was formed through the merger of Newcastle’s Bond Dickinson and US firm Womble Carlyle Sandridge & Rice. The deal created one of the world’s biggest law firms, with a combined revenue of £340m.\nIn the accounts, Mr Blair said: “FY2017/18 produced a stable performance for the LLP with total revenues increasing to £105.7m up from £104.2m in FY2016/17. This was against a backdrop of transformative change; notably our launch as Womble Bond Dickinson in November 2017 following our combination with US law firm Womble Carlyle Sandridge & Rice LLP. Read More Persimmon boss asked to leave after £75m pay deal causes 'distraction'\n“The benefits of this expanded transatlantic network will enable us to consolidate and build upon our position in the UK. We continue to focus on bolstering our capabilities in London and also Edinburgh, where we opened an office in February 2017.\n“Our broader national footprint in the UK continues to develop, aligned with the needs of our regional and national client base. This has enabled us to leverage existing and new legal panel appointments to generate growth across the LLP.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-09T15:50:00.000+02:00", "crawled": "2018-11-09T16:11:35.028+02:00", "highlightTitle": ""}