{"organizations": [], "uuid": "5fd7197775f7b8b343c1d32d70a0de63bfd6f4ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article345562.ece/ALTERNATES/s1200/0_SWNS_HOLIDAY_FLIGHT_004.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/easyjet-says-no-interest-buying-2239591", "country": "GB", "title": "EasyJet says it has no interest in buying Flybe", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-20T16:54:00.000+02:00", "replies_count": 0, "uuid": "5fd7197775f7b8b343c1d32d70a0de63bfd6f4ac"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/easyjet-says-no-interest-buying-2239591", "ord_in_thread": 0, "title": "EasyJet says it has no interest in buying Flybe", "locations": [], "entities": {"persons": [{"name": "johan lundgren", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}], "organizations": [{"name": "easyjet", "sentiment": "none"}, {"name": "flybe easyjet", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EasyJet says it has no interest in buying Flybe \"There is nothing to talk about at this moment in time.\" Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe chief executive EasyJet has said he has no interest in Devon firm Flybe at the moment.\nJohan Lundgren, CEO of the budget airline giant, made his comments on BBC radio.\nRumours had been doing the rounds that E asyJet could be on the verge of purchasing Exeter-based Flybe , which last week said it was in talks with potential buyers. Read More\nWhen questioned about their interest in Flybe yesterday, EasyJet said: \"We've always said that we will play a role in consolidation where it makes sense.\n\"We evaluate all opportunities as they arise and have no further comment to make.”\nWhile this may seem an open-ended and perhaps optimistic response, the CEO has rejected claims EasyJet are interested in the Devon firm.\nSpeaking on BBC radio he said: “We are always looking for strategic opportunities if they arise and we can also take advantage of that given our strength in our balance sheet and our financial strength. Read More\n“But there is nothing to talk about at this moment in time. We don’t have any interest in this particular topic on Flybe at the moment.”\nFlybe contacted Devon Live this morning but said they did not wish to comment on the situation.\nJust last week we reported how the Exeter airline has been riding out turbulent times.\nFlybe launches Black Friday sale with £25 tickets to Rome, Milan and Paris\nThe company, which employs 1,000 of its 2,300 staff at its HQ in Devon, said last month that it was expecting to take a £29million hit caused by rising fuel costs, weakened demand for short-haul flights in a competitive market and a fall in the value of sterling.\nIt has tried to modernise, putting in place a transformation plan under its chief executive Christine Ourmieres-Widener, who joined the airline in January 2017. It has introduced a new IT system to help with online sales, but that has endured ongoing costs. Read More Flybe hits out at 'unfriendly' claim\nThe airline has done better at filling its planes and earning more from every seat – passenger revenue per seat lifted 6.8% as it reduced its flight capacity by 10 per cent.\nBut the airline is dogged by continuing challenges. It is Europe’s largest regional airline but it is a relatively small operation compared to competitors and that means it has to carry the burden of all its backroom costs. Flybe has been reducing its fleet size to ensure it stays as profitable as possible\nFlybe has been reducing the number of planes it has from a peak of 85 in May last year to 78 to ensure that they are running at peak profitability, with plans to run at 70 planes. It has also cancelled unprofitable routes.\nIts latest half-year results showed underlying pre-tax profits of £9.9million, up from £9.2million a year earlier, while group revenues fell 2.4 per cent to £409.2million.\nThere have also been changes in leadership. Vincent Hodder, chief strategy officer, and Peter Hauptvogel, chief information officer have both left the company.\nThe company’s shares rocketed in February when Stobart Group said it was considering a bid for the company . Stobart and Flybe already work together and have a franchise arrangement between the two groups’ airlines.\nHowever, Stobart walked away from its bid in March after the two firms failed to agree terms .\nNow, there is speculation that Stobart Group could be a potential buyer for Flybe. Five reasons why Flybe is struggling to make money\n1. Passengers are feeling the pinch\nJust like the high street, Flybe is at the mercy of the consumer. It means things like the 'Beast from the East' or Storm Callum puts people off flying or means flights are cancelled. And if consumers are losing jobs or feeling the pinch because of rising household bills, the first thing to drop off the budget is a trip abroad.\n2. Brexit\nThe risks associated with Brexit and what regulation will look like for the aviation industry is a worry. Will there be additional tariffs and visas to think about. Air passenger duty continues to concern airlines - especially Flybe which has a lot of routes and partnerships with other airlines in mainland Europe.\n3. Cost of fuel and the impact of the dollar\nCar drivers will sympathise with this one. Flybe buys its fuel in dollars and the average market price in US Dollar was up 19.1% at $560.\nCurrency is a changeable beast and policy makers like President Trump can and does affect the price.\n4. Planes are expensive\nCapital investment from the outset is high and Flybe has been reducing the number of plane sit has from a peak of 85 in May last year to ensure that they are running at peak profitability. It needs to make sure that its planes are full to be most efficient. It is also cancelling its unprofitable routes.\nAviation is heavily regulated and the airline spends a lot on maintenance.\nIt has also overhauled its IT and digital systems to make sure that customers can book their flights on their mobile devices.\n5. Flybe is a small company\nFlybe may be one of the region's biggest players but it is small compared to the likes of its competitors Easyjet, Ryanair and BA. It means that the back room costs take up a higher proportion of its outlay. It costs about the same to pay for things like maintenance, HR and online bookings for 200 planes as it would for 80, for example.\nBut it also recorded disappointing results last month with a pre-tax loss of £17.5m in the six months to the end of August.\nIn September, Ryanair announced that it would start flying from Exeter , sparking a price war with Flybe.\nRyanair said the six weekly flights would bring 80,000 customers through the Devon airport and “put Exeter on the map” for foreign tourists.\nThe airline has strong links in Exeter and the region in skills and training. Around 250 students have come through a four-year Flybe engineering programme at Exeter College so far and is so sought after that 160 applicants applied for just 15 spaces on its aerospace apprentice scheme this year.\nBack in 2016, Flybe’s former chief executive Saad Hammad stepped down and was paid more than £430,000 during a year of gardening leave.\nMr Hammad joined Flybe in August 2013 and oversaw a wide-ranging overhaul of the company’s operations aimed at reviving its fortunes. Under his three-year tenure, Flybe went from a £35.6m loss in 2015 to a £2.7m profit in 2016. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-20T16:54:00.000+02:00", "crawled": "2018-11-20T18:08:15.013+02:00", "highlightTitle": ""}