{"organizations": [], "uuid": "a176badcdf5c4c46cfb2f95d87c89a1aff7e862c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15440229.ece/ALTERNATES/s1200/0_peterlee.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/heather-mills-turn-peterlee-factory-15440093", "country": "GB", "domain_rank": 21960, "title": "Heather Mills to turn Peterlee factory into 'Silicon Valley' of vegan food", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-20T15:29:00.000+02:00", "replies_count": 0, "uuid": "a176badcdf5c4c46cfb2f95d87c89a1aff7e862c"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/heather-mills-turn-peterlee-factory-15440093", "ord_in_thread": 0, "title": "Heather Mills to turn Peterlee factory into 'Silicon Valley' of vegan food", "locations": [], "entities": {"persons": [{"name": "heather mills", "sentiment": "negative"}], "locations": [{"name": "peterlee", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "pepsico", "sentiment": "none"}, {"name": "ms mills", "sentiment": "none"}, {"name": "former journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Heather Mills to turn Peterlee factory into 'Silicon Valley' of vegan food The TV personality is poised to being manufacturing back to the site by turning into VBites' third UK factory Share Heather Mills (Image: Heather Mills) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nFormer model turned businesswoman Heather Mills has revealed plans to create hundreds of new North East jobs by turning the region into the “Silicon Valley” of vegan food.\nMore than 350 jobs were lost when PepsiCo closed the Walkers Snacks factory in Peterlee last year, moving work from the site to other bases around the UK.\nNow the 180,000sqft factory is poised to be at the forefront of the growing vegan food movement, after Washington-born TV personality Ms Mills acquired the keys to the site and unveiled plans to bring manufacturing back.\nThe Former Journal columnist plans to create 300 jobs at the site, which will become the third VBites operation in the UK, joining sites in Corby, Northants and Benton, Newcastle , which employ around 140 people between them. Walkers Snack Foods in Peterlee (Image: Newcastle Chronicle)\nVBites currently sells 74 vegan products to more than 20 countries around the world, and Ms Mills believes the company could see further growth, benefitting from Brexit by outpricing European rivals.\nShe said: “I knew I had to try to buy it.\n“This was the most important factory in the area. And I want to do something positive in the Brexit situation.\n“I want this to become the vegan food equivalent of technology’s Silicon Valley in California. A plant-based valley, that will bring more business into the North East. Read More\n“Plant-based firms in EU countries have come to me and said supermarkets won’t buy from them any more, they’re too expensive.\n“They’ve asked us to manufacture for them.\n“So yes, Brexit is awful but if it means we’re inexpensive when it comes to manufacturing, then let’s get on and do it.”\nMs Mills aims to turn the County Durham facility into the UK’s largest vegan-only plant – and the site has room for expansion.\nAgents for the site, Cushman & Wakefield, outlined how the site’s long history of production dates back to the 1960s with the factory expanding over the years to the current size and layout. Internally the building is divided into various areas including preparation, production, packaging, warehouse, office and staff amenities.\nAdditional undeveloped land to the North also provides potential for future expansion. Read More Nissan chairman suspected of using luxury homes for free amid financial misconduct probe\nNews of VBites move into the site has been welcomed by Easington MP Grahame Morris.\nHe said: “I am delighted at the prospect of food manufacturing returning to Peterlee and the ambition of Heather Mills and the Vbites brand to make our region the Silicon Valley of vegan food production.\n“I look forward to production commencing, the new jobs and investment in Peterlee and hope this is just the start towards marketing our region as the home of plant-based vegan food production and healthy lifestyle choices.”\nRichard Scott, Partner in Cushman & Wakefield’s national Logistics & Industrial team, said : \" We are delighted to have completed the sale of the former Walkers Crisps factory for our client PepsiCo.\n\"Our remit was to sell to an owner-occupier who would hopefully recreate many of the jobs which were lost when the factory closed and we are pleased to have been able to conclude the sale to VBites.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-20T15:29:00.000+02:00", "crawled": "2018-11-20T16:59:34.020+02:00", "highlightTitle": ""}