{"organizations": [], "uuid": "718669edca05eb3b772afc91c82b20f5bea9c268", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2185025.ece/ALTERNATES/s1200/0_equality-picjpeg.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/leicester-business-festival-2018-second-2185089", "country": "GB", "domain_rank": 48128, "title": "Leicester Business Festival 2018 into its second week - here's how you can still get involved - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-11-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "718669edca05eb3b772afc91c82b20f5bea9c268"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/leicester-business-festival-2018-second-2185089", "ord_in_thread": 0, "title": "Leicester Business Festival 2018 into its second week - here's how you can still get involved - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "paul uppal", "sentiment": "none"}, {"name": "alberto costa", "sentiment": "none"}], "locations": [{"name": "humberstone gate", "sentiment": "none"}, {"name": "south leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicestershire live click", "sentiment": "negative"}, {"name": "blaby district council", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe second week of the annual Leicester Business Festival kicked off today, continuing a packed diary of workshops, seminars, conferences and networking events.\nLast week saw various stand-out events including a High Streets of Tomorrow session, looking at how to thrive in today’s retail climate in local market towns.\nThere have also been interactive sessions on how Lego can improve problem-solving, communication and performance, while BID Leicester had a sold out event where delegates heard about their plans and achievements so far.\nElsewhere, Blaby District Council hosted a business breakfast, which was addressed by South Leicestershire MP Alberto Costa and Small Business Commissioner Paul Uppal, while Seed Creative Academy, in Humberstone Gate, hosted a workshop looking at brand strategy and standing out from competition. Lets Be Brave About Equality Q&A at DMU\nA packed Question Time-style event heard how flexible working, gym memberships, and ensuring diverse interview panels were some of the ways Leicestershire companies were thinking differently about hiring new talent.\nLet’s Be Brave About Equality looked at the challenges and opportunities that businesses faced in recruitment, particularly around encouraging more women and ethnic minority staff.\nThe panel was chaired by Helen Donnellan , director of business engagement at De Montfort University , and panelists included Jo Tallack , general manager of Highcross; Everards managing director Stephen Gould; Caroline Lake of wealth management firm Brewin Dolphin and Byron Dixon, chief executive of anti-bacterial product maker Micro-Fresh.\nThey shared practical tips and advice on strategies they had used to encourage a more inclusive approach to staff recruitment and retention.\nQuestions ranged from how to change company culture to the role leaders’ values and ethos has in influencing staff.\nThe event was organised by law firm Freeths and Eileen Richards Recruitment and was aimed at senior business leaders either based in Leicestershire or who were thinking of relocating to the area.\nFreeths director Emma Anderson said: “One of the things we wanted to do was collaborate with other businesses and this is an issue that really speaks to people in the business community.\n“Equality and Diversity is absolutely fundamental to business success.” Read More\nByron Dixon said: “The staff at your company should look and sound like the area you’re in.\n“Leicester is such a diverse city and I think it’s important our businesses reflect that.” Byron Dixon of Micro-Fresh International (Image: Northcliffe Media Ltd.)\nThis week’s events include a seminar addressing the sort of planning, construction and insurance issues facing developers, taking place at the Shakespeare Martineau offices in Leicester’s Colton Square. Read More\nThe event, which takes place on Wednesday, November 7, will look at the impact things such as Brexit and Grenfell have had on property investment and development.\nThe festival is the region’s largest business event with around 10,000 attendees attending.\nMost events are free and tickets are available by clicking here . Like us on Facebook ", "external_links": [], "published": "2018-11-05T02:00:00.000+02:00", "crawled": "2018-11-05T20:42:45.014+02:00", "highlightTitle": ""}