{"organizations": [], "uuid": "df3162c0068498a8bbb2cc5747e8dfa8864790a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14291574.ece/ALTERNATES/s1200/3_JCR_MEN_010218TCA_01.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15469876", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Thomas Cook to take £30m profit hit after heatwave", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-27T10:00:00.000+02:00", "replies_count": 0, "uuid": "df3162c0068498a8bbb2cc5747e8dfa8864790a8"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15469876", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Thomas Cook to take £30m profit hit after heatwave", "locations": [], "entities": {"persons": [{"name": "thomas cook", "sentiment": "negative"}, {"name": "matthew williams", "sentiment": "none"}, {"name": "jonathon manning newcastle", "sentiment": "none"}], "locations": [{"name": "parkside", "sentiment": "none"}], "organizations": [{"name": "topps tiles", "sentiment": "negative"}, {"name": "topps tiles group", "sentiment": "none"}, {"name": "topps", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Cheap food imports 'very real threat' to UK farmers after Brexit\nBritish farms could be devastated if foreign foods imported to the UK do not meet British standards after Brexit, MPs have warned.\nThe Environment, Food and Rural Affairs Committee warned that the Agriculture Bill must be changed to ensure future trade deals only allow goods that meet or exceed current rules to be imported to the UK.\nThe committee said the Government must “puts its money where its mouth is” to ensure products such as US-produced chlorine-washed chicken are not brought to the UK.\nIt also criticised the Government for not allowing MPs enough time to scrutinise the Bill effectively.\nCommittee chairman Neil Parish, who was a farmer before entering politics, said:\nThe United Kingdom currently has exceptionally high environmental and food standards and an internationally recognised approach to animal welfare.\nThis legacy cannot be ripped apart by the introduction of cheap, low-quality goods following our exit from the European Union.\nImports produced to lower standards than ours pose a very real threat to UK agriculture.\nWithout sufficient safeguards we could see British farmers significantly undermined while turning a blind eye to environmental degradation and poor animal welfare standards abroad. Chicken (Image: PA) 9:05 Topps Tiles owner makes £1.1m\nParkside, the group which acquired Topps Tiles at the end of 2017, has made a £1.1m loss despite boosting its turnover.\nTurnover at the group grew 2.4% at £216.9m.\nChief executive Matthew Williams said:\nThis has been an important year of strategic progress for the Topps Tiles Group, in which our expansion into commercial has seen us double our addressable market while remaining firmly within our tile specialism, where our buying scale and expertise gives us a significant competitive advantage.\nAgainst a challenging market backdrop, the group delivered a robust trading performance for the year with flat like-for-like sales and market-leading gross margins in retail, and the foundations laid for significant sales growth in commercial in the year ahead.\nAt the start of the new financial year, trading conditions remain challenging and like-for-like sales in the first eight weeks have been negative against a strong prior year comparator. A Topps Tiles store (Image: Topps Tiles/PA Wire) 8:57 Jonathon Manning Newcastle teashop brothers picked to help launch start-up business scheme\nThree brothers from the North East who set up a tea house in Newcastle city centre have been chosen to champion successful UK start-ups in a Government scheme .\nSam, Tom and Patrick Quilliam, founders of Quilliam Brothers’ Teahouse at Newcastle’s Haymarket, are being honoured at a launch in Parliament today organised by the Start Up Loans Company.\nThe teahouse is one of six start-ups selected by the company, part of the British Business Bank, to launch an ambassador programme that celebrates business owners who have received loans.\nThe brothers set up their business in 2013 after being inspired by the teahouse culture in Budapest, the capital of Hungary.\nIt has 60 loose leaf teas on offer, while the late night, alcohol-free venue also provides a platform for the arts groups at a grass-roots level, hosting open mics for budding musicians and fringe theatre performances.\nEach brother secured a loan of £5,000 and they used the money to renovate the premises near Newcastle University. The business now employs 24 people and the brothers have since gone on to open a hostel in Montenegro.\nSam Quilliam said:\nThere was a period of time during the renovation of our premises where we would have run out of money and weren’t sure if we would be able to complete the restoration. That is when we applied to the Start Up Loans Company, and they provided us with the necessary funds to keep on going and make our dream a reality.\nWe’re proud to be an ambassador, and hope that our story inspires other young entrepreneurs across the country. The Quilliam brothers tea shop (Image: Newcastle Journal) 8:52 Jonathon Manning Greggs predicts full year profits of £86m\nGreggs has said it expects to make an underlying profit before tax of £86m after a strong perfirmance in October and November.\nThe bakery chain saw its total sales increase by 9% during the nine weeks leading up to NOvember 24 2018, while like-for-like sales were boosted by 4.5%.\nIn a statement to investors Greggs said:\nThis stronger trading in October and November is particularly encouraging as it builds on good comparative sales in the same period last year. Operational costs have been well controlled and, whilst there is still much to play for over the final few weeks of the year, the Board now anticipate that full year underlying profit before tax (excluding exceptional charges) will be at least £86m. You can order Greggs to your door through Deliveroo (Image: Malcolm Hart) 8:45 KEY EVENT Billionaire Mike Ashley threatens to close all his Eldon Square and Metrocentre stores\nBillionaire Mike Ashley is said to have threatened to close all his stores at Eldon Square and Metrocentre amid a dispute with landlord Intu Properties.\nThe retail tycoon and Newcastle United owner has reportedly warned he will bring down the shutters of the 15 stores he currently has open at Intu Properties sites around the UK.\nThat would include Sports Direct, House of Fraser, Flannels, USC and Evans Cycles outlets in the shopping centre firm’s centres – and would affect USC in Newcastle’s Eldon Square, plus Flannels in the Metrocentre, on top of the House of Fraser store which will close next year.\nAccording to reports, Mr Ashley has been involved in a rent row with Intu in a bid to secure better deals for four House of Fraser stores, in which he wanted to pay little or no rent for House of Fraser at Intu’s Lakeside, Nottingham, Norwich and Metrocentre.\nMr Ashley claims closing all of his stores at the centres – when leases reach a break clause or expire – will cost millions a year in lost rent and service charges.\nHe told the Sunday Times:\nIntu has demonstrated it is unwilling to help retailers save stores and jobs. It is unrealistic for Intu to continue to enjoy a long-term relationship with our retail businesses. Newcastle United owner Mike Ashley (Image: PA) 8:35 Jonathon Manning Millions of workers benefit from higher national living wage, study finds\nAround five million workers received a pay increase after the national living wage was raised this year, according to a new study.\nThe figure was lower than in 2017, but still represented a fifth of all workers aged 25 and over.\nThe statutory minimum pay is £7.83 an hour, and will increase to £8.21 from next April.\nAccording to the Low Pay Commission, the change to the national living wage had no effects on employment.\nBryan Sanderson, who chairs the commission, said:\nThat five million workers received higher pay rises in April than they would have done without the national living wage shows how significant an intervention it has been in the labour market.\nSo far, the evidence suggests the NLW has been successful in raising pay without causing unemployment, but employers have had to adjust in various ways. The national living wage boosted the pay of five million workers (Image: PA) 8:30 Jonathon Manning £8m Newcastle office refurbishment to help accountancy firm grow\nAccountancy giant EY has spent £8m on a refurbishment of its Newcastle office in a bid to attract more millenials and grow headcount.\nEY has 65,000 sq ft of office space across two buildings at CityGate on St James’ Boulevard to house its 600-plus North East team, and also give it space to grow by at least another 300 people in the future.\nArchitects Stride Treglown created the interior space, basing its design on images of well-known North East landmarks.\nThe refurbishment also encompasses new technologies, with an open-plan design meaning staff can choose which work space to use based on the task at hand – whether that is a team collaboration zone or a private, quiet place to focus – while some work stations also include standing desks.\nThe refurbishment has come after EY’s own research into work life across different generations found that flexibility is seen as one of the most important workplace ‘perks’ among non-cash benefits, with 18% of those surveyed ranking it first.\nTechnology has also been used with traditional desktop phone handsets replaced by Skype functionality, while meetings rooms have video and audio conferencing technologies.\nThe third floor has an area for collaboration space with a pool table in the breakout area, and a seminar room that will hold up to 60 people.\nSandra Thompson, Newcastle managing partner at EY, said:\nI’m so pleased about this investment in our office space - to me it means so much more. It’s a strong signal to the local market of just how important the North East is to EY as this is a region we see as having huge growth potential for us.\nWe’ve been based at CityGate for almost 17 years and, not only is the location superb, but it also now gives us the space we need to grow in a future-proofed environment. The office has been redesigned with growth in mind and we have made it as modern and inspiring as possible. It’s about enabling a different way of working. EY has spent £8m on a refurbishment of its Newcastle office (Image: Handout) 8:23 KEY EVENT Pets at Home could close 30 stores\nPets at Home has revealed plans to buy out 55 of its 471 joint venture pet practices, but warned that it will put 30 of those under review for closure.\nTwenty-five stores will become company managed practices, while the remaining stores will be placed under review. It is unknown which stores will be placed under review.\nChief executive Peter Pritchard said the review was needed after a period of strong growth at the firm.\nHe said:\nSince becoming the group CEO in May, I have had the opportunity to take stock of the wider group and shape my view of our future.\nReviewing our vet group has been a priority. I recognise we have grown at pace and, more recently, have seen the pressure that rising costs and our fees are placing on this young business.\nWe will need to recalibrate the business to deliver more measured growth whilst maintaining our plan to generate significant cash profits.\nThe news came as the company revealed its pre-tax profits had crashed by 80.5% to £8m in the six months ending October 11. The firm suffered an additional £29m in costs relating to its vet practice plans.\nPets at Home warned it is now expecting lower full-year underlying pre-tax profits, forecasting at least £80m to £85m. Pets at Home saw profits fall despite growing revenues (Image: PR) 8:17", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15469876;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-27T10:00:00.000+02:00", "crawled": "2018-11-27T11:07:26.015+02:00", "highlightTitle": ""}