{"organizations": [], "uuid": "400c44a3f27e6407e3d795d5bb2a2dfeb1fcf19b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2222351.ece/ALTERNATES/s1200/0_PA-39713444.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/business-say-facing-dark-days-2223518", "country": "US", "title": "Business say they are facing 'dark days' as Brexit chaos continues", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T16:41:00.000+02:00", "replies_count": 0, "uuid": "400c44a3f27e6407e3d795d5bb2a2dfeb1fcf19b"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/business-say-facing-dark-days-2223518", "ord_in_thread": 0, "title": "Business say they are facing 'dark days' as Brexit chaos continues", "locations": [], "entities": {"persons": [{"name": "jones", "sentiment": "none"}, {"name": "tim jones", "sentiment": "none"}], "locations": [], "organizations": [{"name": "whitehall", "sentiment": "none"}, {"name": "south west business council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business say they are facing 'dark days' as Brexit chaos continues All businesses want in clarity - is that too much to ask from brexit? Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nBusiness leaders say they are facing dark days as turmoil at the top brings yet more uncertainty over the draft Brexit deal.\nBosses throughout the region were hopeful that the 585page document would at least bring some certainty after two years of not knowing.\nBut cabinet resignations , speculation that no majority will be reached on any Brexit outcome and that’s if the Prime Minister survives at all, have plunged business back into further turmoil.\nTim Jones, chairman of the South West Business Council, said: “When the announcements were made of a breakthrough there was a considerable degree of relief and whether the fine details have been finalised was regarded as largely irrelevant.\n“But the early indications of Whitehall’s reaction to the Prime Minister’s plan have only served to re-ignite the feelings of frustration throughout the business community. “These are dark days and the cracks are beginning to appear.”\nMr Jones said that an increasing pace of retail outlet closures, Ambrosia and Flybe having a ‘For Sale’ sign on them and closure announcements for Barden Corporation and Appledore reinforce the business sentiment that there is more bad news to come. Read More Fact checking claims that Brexit is to blame for upheaval of three of Devon's biggest brands\nHe said: “This can only further suppress investment ambitions and reduce the already low levels of productivity which the South West experiences.”\nBusinesses have been desperate to avoid a No-Deal Brexit but this latest turmoil means they still cannot put that prospect behind them.\nNathan Peacey, partner at South West-based top 100 law firm Foot Anstey, said that many large businesses have been scenario planning for a 'no deal' for some time.\nHe said: \"Quite a lot of small or medium-sized businesses have not had the resource or appetite for that. That may prove to be a valid decision – who can predict where the twists and turns of the current brinkmanship will take us?\n\"But the immediate reaction to the withdrawal deal suggest the prospects of 'no deal' are increasing by the day. So find the time to consider how catastrophic a 'no deal' would be for your business or to firm up contingency plans that you have started to put in place.”\nIan Brokenshire, senior partner at KPMG in Plymouth, said there are key propositions in the deal that would benefit the South West, including the assurance that EU employees in the region could remain where they are and the idea that companies could export across the Channel without tariffs or customs inspections. He added: \"There are of course still a number of questions, particularly around the arrangements on financial services.\n“However , it has been a very busy day in politics. My overriding advice would be to hang on to your no deal contingency plans – we are far from out of the woods.\" Robert Camp, managing director of Stephens Scown solicitors (Image: Ian Jackson Pix)\nRobert Camp, Stephens Scown LLP’s managing partner said he is encouraged to see an extension to the transition period in the draft Brexit agreement (though the document doesn't say how long the transition could be extended to).\nHe said: “This may well be needed to allow businesses enough time to make changes in light of a new economic arrangement with Europe.” Read More Six huge Devon firms that have taken a hit this year\nBut the senior government resignations again throw uncertainty over the situation.\nHe said: “Like many in the South West business community we are looking for certainty. Any deal will require compromise and we hope that over the coming days the position will become clearer.” Stuart Elford, Chief Executive Officer, Devon and Plymouth Chamber of Commerce.\nStuart Elford, Chief Executive of Devon and Plymouth Chamber of Commerce, said it will be canvassing members on the draft agreement in the coming days and weeks.\nHe added: “The devil will be in the detail of the specifics that are agreed in the coming months. Our members want clarity on that. British businesses have always been very good at adapting to change but they need to know to what they are adapting.” Read More ", "external_links": ["https://www.plymouthherald.co.uk/news/business/barden-factory-closure-warning-more-2189263", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.cornwalllive.com/news/uk-world-news/dominic-raab-resigns-brexit-secretary-2221661"], "published": "2018-11-15T16:41:00.000+02:00", "crawled": "2018-11-15T17:37:43.008+02:00", "highlightTitle": ""}