{"organizations": [], "uuid": "07bdda3efac99ba6eb7e6d6fcb82937a8ecded65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/news/business/article2189306.ece/ALTERNATES/s1200/0_Barden-whitesJPG.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/workers-number-one-priority-closure-2189220", "country": "US", "title": "Workers 'number one priority' at closure-hit Barden factory", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-06T18:33:00.000+02:00", "replies_count": 0, "uuid": "07bdda3efac99ba6eb7e6d6fcb82937a8ecded65"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/workers-number-one-priority-closure-2189220", "ord_in_thread": 0, "title": "Workers 'number one priority' at closure-hit Barden factory", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "schaeffler", "sentiment": "none"}, {"name": "greig littlefair", "sentiment": "none"}, {"name": "littlefair", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "estover", "sentiment": "none"}], "organizations": [{"name": "barden", "sentiment": "none"}, {"name": "schaeffler uk limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now\nThe bosses at closure-hit The Barden Corporation have vowed that its workers are its number one priority.\nThe 365 workers at the plant in Estover were among the first to be told on Tuesday that the plant in Estover will be closed within two years despite being profitable and making products that are in high demand for the aeronautical and automobile industries.\nThe German parent company, global automotive and industrial supplier Schaeffler, said that Brexit was a consideration in the decision but was not the decisive factor.\nSpeaking on Tuesday afternoon, the UK managing director of Schaeffler UK Limited, Greig Littlefair, said: \"The decision was not taken lightly. The real reason is linked to challenging economic conditions across the world, our customers and with consideration given to the demand for our products today.”\nOnly around 15 percent of the goods Schaeffler produces in the UK remain in the country, while the vast majority is exported to continental Europe. Read More\nMr Littlefair said: “Uncertainty in any business, certainly one that operates globally, is appreciated as little as possible and it prefers open borders.”\nThe Plymouth operation produces precision bearings for cars, aircraft, the nuclear industry, missiles and satellites. The Barden Corporation in Plymouth mainly produces spindle bearings and machine parts for Schaeffler’s Industrial division and makes specialised bearings for the aerospace and defence industries\nBarden Corporation became part of the Schaeffler Group in 2001 after first forming an assembly line in Plympton in 1961.\nThe closure is part of a world wide restructuring which will see it close its bases in Plymouth and Llanelli, merge logistics centres in Hereford and Sutton Coldfield, but retain a factory in Sheffield - its largest site in the UK.\nMr Littlefair said: “We are keeping a presence in the UK, it is an important market for is and we are certainly not pulling out.\nHe said that the Llanelli plant is the main producer of mechanical tappets, the market for which has declined in recent years and is forecast to decrease further. Read More Six huge Devon firms that have taken a hit this year\nThe Plymouth site mainly produces spindle bearings and machine parts for Schaeffler’s Industrial division and makes specialised bearings for the aerospace and defence industries.\nMuch of the specialised work will now be transferred to a plant in the United States, which already produces similar components and has a much larger facility.\nJon Everett, managing director at Barden Corporation in Plymouth, said: “One thing I do want to point out is that Plymouth is profitable and produces valuable products.” Jon Everett, managing director of The Barden Corporation\nHe said that the finer details of the time frame had yet to be made available but the plant will be close by the end of 2020.\nHe said that while the merger of the Hereford and Sutton Coldfield would happen within a year, Plymouth would remain open for longer than the other UK sites.\nMr Everett said: “When the proposal was first suggested, the impact was taken into account.\nWe want to do everything we can to look after our people. “Our employees are our number one priority.” Read More", "external_links": ["https://www.plymouthherald.co.uk/news/business/barden-corporation-brexit-factory-closures-2187191", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.plymouthherald.co.uk/news/plymouth-news/second-brexit-referendum-plymouth-council-2184026", "https://www.plymouthherald.co.uk/news/business/space-age-engineering-firm-invests-536381"], "published": "2018-11-06T18:33:00.000+02:00", "crawled": "2018-11-06T20:16:25.018+02:00", "highlightTitle": ""}