{"organizations": [], "uuid": "e26cde1e0ae9495f14deca43f4ce6e9892641099", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1219541.ece/ALTERNATES/s1200/0_katie-hopkins-4JPG.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/police-hit-back-after-katie-2258230", "country": "US", "title": "Police hit back after Katie Hopkins likens force volunteers to 'Sharia patrols'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-25T20:45:00.000+02:00", "replies_count": 0, "uuid": "e26cde1e0ae9495f14deca43f4ce6e9892641099"}, "author": "Anita Merritt", "url": "https://www.devonlive.com/news/devon-news/police-hit-back-after-katie-2258230", "ord_in_thread": 0, "title": "Police hit back after Katie Hopkins likens force volunteers to 'Sharia patrols'", "locations": [], "entities": {"persons": [{"name": "katie hopkins", "sentiment": "none"}, {"name": "insp iftekhar ahmed", "sentiment": "none"}, {"name": "hopkins", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "handsworth community action group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Police hit back after Katie Hopkins likens force volunteers to 'Sharia patrols' She reacted to a picture taken of Handsworth Community Action Group members Share The provocative production looks into the wider issues of social media Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nSince leaving Exeter, outspoken columnist Katie Hopkins has continued to cause controversy with her comments and this time police have hit back after she likened force volunteers to 'Sharia patrols'.\nShe reacted to a picture taken of Handsworth Community Action Group members with Insp Iftekhar Ahmed outside the area's police station, and questioned whether ‘Sharia patrols’ were on the way to the West Midlands.\nThe volunteers give up their own time to help the area and, in their own words, \"make Handsworth great again\".\nBut the picture was used by Hopkins on Twitter to raise the prospect of ‘Sharia patrols’ on the streets of Birmingham.\nShe wrote: \"Dear Rest of World. Let me introduce the new civilian street patrol in the West Midlands, England. Read More\n\"Multi-cult...erm...women are equa..oh b***er it.\n\"Just how far are we from Sharia patrols in the West Midlands?\" Read More UK could run out of drinking water within days of no-deal Brexit\nIt was Hopkins' latest attack on the West Midlands. In June last year, police dismissed her claim that Birmingham Central Mosque was a ‘no-go’ area for officers. And the force again hit back at her latest volley.\nIn a direct reply to Hopkins's tweet, the West Midlands Force Response Twitter account asked her: \"These are active citizens helping their community.\n\"Ask yourself, how do you help?\" Read More This is why hundreds of women in red ponchos marched through Exeter\nAnd it highlighted the voluntary work done by groups such as Bearded Broz to help officers and community relations.\nThe account continued: \"Groups such as Bearded Broz help us as front line officers at the scene of an incident\nWatch below the worst things Katie Hopkins has ever said Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n\"They get groups to actually interact with us.\n\"Ignore negativity. Simply, to those that help, thank you!!\" Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-25T20:45:00.000+02:00", "crawled": "2018-11-25T21:38:38.005+02:00", "highlightTitle": ""}