{"organizations": [], "uuid": "66410665239cb9040581cb87a97300fbdbe0e243", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2239999.ece/ALTERNATES/s1200/0_crashjpeg.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/angry-pregnant-mums-car-crashes-2240549", "country": "US", "title": "Angry pregnant mum's car crashes 200ft after handbrake fail - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "66410665239cb9040581cb87a97300fbdbe0e243"}, "author": "Colleen Smith", "url": "https://www.devonlive.com/news/devon-news/angry-pregnant-mums-car-crashes-2240549", "ord_in_thread": 0, "title": "Angry pregnant mum's car crashes 200ft after handbrake fail - Devon Live", "locations": [], "entities": {"persons": [{"name": "chelsea endacott", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "colleen smith", "sentiment": "none"}], "locations": [{"name": "elsdale road", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}], "organizations": [{"name": "vauxhall corsa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Angry pregnant mum's car crashes 200ft after handbrake fail Heavily pregnant Chelsea Endacott left her car outside her house at 43 Elsdale Road. When she went back it was gone. She eventually found it in the garden of number 19 Elsdale Road - nearly 200ft away - balancing on top of a demolished garden wall. Share Colleen Smith Regional Head of Content 17:24, 21 NOV 2018 Chelsea Endacott's Vauxhall Corsa on top of the wall Get\nA heavily pregnant mum thought she was suffering from 'baby brain' when her car disappeared from outside her house - until she discovered that the handbrake on her Vauxhall Corsa had failed and her car had rolled nearly 200ft, ending up hanging over a garden wall.\nNow shocked Chelsea Endacott from Paignton is fuming because her £12,500 car is wrecked and she believes she may be the latest victim of an issue with the Vauxhall Corsa D Model car manufactured between the years 2007 and 2013.\nChelsea, 26, is 31 weeks pregnant and had left her car for a minute outside her house at 48 Elsdale Road and it rolled backwards down the hill, veered off to the left, hit a parked car, demolished a wall and ended up in the garden of number 19 Elsdale Road - nearly 200ft away - balancing on top of the low wall.\nFuming Chelsea said: \"What if it happened after my baby's born? I was so totally shaken up afterwards that I felt completely out of touch with reality.\" The car had travelled nearly 200ft\nChelsea said she had briefly left her car outside her house and run indoors with her car keys in her hand. When she came back and the car was gone her first thought was that she was hallucinating. Read More Devon man spells HUGE 'Stop Brexit' GPS message in 22,000-mile European road trip\n\"I'm 31 weeks pregnant and I wondered if it was some kind of symptom of pregnancy. I thought 'Am I going crazy?' and wondered if it was baby brain.\n\"I went and woke my partner up and we were looking out of the window and we noticed there were lots of people gathering down at the bottom of the hill.\n\"The car had gone backwards down the hill, veered off to the left, hit a parked car and gone over someone's garden wall and was left balancing on the wall.\n\"The people in number 19 were unloading their shopping - they could have been hit by my car.\n\"I was completely shaken up. I felt as if I had kind of lost touch with reality. I just couldn't get my head around what was going on.\" The car had rolled all the way from the top of the hill at number 48 Elsdale Road to demolish the garden wall outside number 19's garden\nNow Chelsea is asking why she wasn't included when Vauxhall sent out letters to customers earlier this year asking them to have their handbrake's checked.\nThe letters stated that if the handbrake has not been applied correctly, it's possible it could partially release. The issue affects the Corsa D Model (Year 2007 to 2013).\nIn January 2018 we reported on Claire Dyer, 32, from Plymouth whose car crashed off her dad's steep drive - two days before she was sent the official Corsa letter.\nExeter student was jailed for life after 'five minute hearing with no lawyer'\nChelsea said: \"I bought my Corsa D brand new in 2014 - but it was manufactured in 2013. I have asked Vauxhall why I didn't receive the letter.\n\"My car handbrake was on - the recovery guy confirmed that it was on, but even when he put it on the recovery vehicle it wasn't working properly.\" This is how Chelsea Endacott's Vauxhall Corsa ended up\nA letter sent to customers earlier this year: “ Vauxhall have reviewed a number of Corsa Model D Year 2007-2013 handbrake mechanisms and found that if the handbrake is incorrectly applied by depressing the release button during the application it is possible the handbrake may partially release.\n“ Vauxhall advises that when parking your vehicle on a slope, customers should apply the handbrake and engage a gear in line with the recommendations referenced in the owner’s manual.\n“ Vauxhall is introducing, as a customer satisfaction programme, a modification to the handbrake mechanism to reduce the possibility of incorrectly setting the handbrake.\"\nA customer services advisor at Vauxhall said this is not a product recall.\nThe letter to customers (below) states: “This recall is supported by Driver and Vehicle Standards Agency (DVSA).” Read More Ikea axing 350 UK jobs The letter sent to Vauxhall Corsa D owners\nChelsea said: \"My car might be written off - it doesn't look that bad but there is a lot of damage underneath. It's a nightmare.\n\"My car is the same model and year as the one the letters were sent out about. I didn't receive that letter and I only found out when I googled handbrake failure and found that a similar thing had happened to a girl in Plymouth. I have contacted Vauxhall and am waiting to hear back from them.\"\nVauxhall UK has been contacted for a comment. Read More", "external_links": [], "published": "2018-11-21T02:00:00.000+02:00", "crawled": "2018-11-21T20:09:57.007+02:00", "highlightTitle": ""}