{"organizations": [], "uuid": "10927a854bd016141a331dd754eb666ac27640f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14936494.ece/ALTERNATES/s1200/2_Virgin-Media-growth.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15423544", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Virgin Media and EE fined £13.3m for overcharging thousands of customers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-16T10:30:00.000+02:00", "replies_count": 0, "uuid": "10927a854bd016141a331dd754eb666ac27640f4"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15423544", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Virgin Media and EE fined £13.3m for overcharging thousands of customers", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "negative"}, {"name": "gavurin", "sentiment": "none"}, {"name": "jonathan graham", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "gavurin", "sentiment": "none"}, {"name": "gavurin limited", "sentiment": "none"}, {"name": "college street", "sentiment": "none"}], "organizations": [{"name": "lloyds bank", "sentiment": "none"}, {"name": "lloyds bank commercial banking", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Former racquets court in Newcastle becomes HQ for IT firm Gavurin\nA North East data analysis firm has completed the redevelopment of a former racquets court building in Newcastle , turning the site into its first headquarters.\nGavurin Limited has turned the former racquets venue into a state-of-the-art workspace, after its management team decided it was time to move into the growing tech scene in Newcastle city centre.\nBased on College Street, the building had stood empty for more than a decade before Gavurin acquired the site. The redevelopment has kept many of the original features of the premises including a Victorian staircase and a glass feature ceiling.\nThe new office spans 5,000sq ft of space across two floors, and was financed with the support of a six-figure loan from Lloyds Bank Commercial Banking.\nJonathan Graham, managing director of Gavurin, said:\nThanks to the support of Lloyds Bank, we now have an innovative, creative and technologically advanced working environment. This will help us realise our growth ambitions for the business.\nGavurin develops and builds its own software to analyse data that allows its clients to make strategic management decisions. Its clients include Hospice UK and commercial data firm Dun & Bradstreet.\nThe company plans to turn half of its new office into a collaborative working space and networking hub that can be used by others in the North East’s tech community. Members will be able to access desk space, meeting rooms as well as use the site as a virtual office. A CGI image of The Raquets Court building after its redevelopment (Image: Unknown) 9:21 Tobacco giant claims more evidence is needed for ban on Menthol cigarettes A man smoking a cigarette (Image: PA) 9:11 Jonathon Manning Gateshead MP calls for meeting with Mike Ashley over House of Fraser closure\nA North East MP has requested a meeting with billionaire business tycoon Mike Ashley to discuss the closure of House of Fraser.\nBlaydon MP Liz Twist has called for the Newcastle United owner to sit down with her, trade union representatives and landlords to discuss his plans to close the Metrocentre department store.\nAround 200 jobs are thought to have been put at risk after Mr Ashley revealed yesterday that he will close four House of Fraser stores located in Intu shopping centres.\nMs Twist said:\nMy thoughts are with the staff at the House of Fraser store in the Metrocentre. This is a huge blow to staff and their families at this popular, busy store in the run up to Christmas.\nI have written to Mike Ashley today asking for an urgent meeting and for him to reconsider his decision. Mr Ashley should now get back around the table so we can find a way forward that keeps this flagship store open. With up to 200 jobs on the line, this is the least he can do for his staff and customers.\nIn her letter Ms Twist revealed her “shock” and disappointment at plans to close the department store, which has been an anchor tenant at the shopping centre for decades.\nShe added that the announcement was a “huge blow to staff and their families” in the run up to Christmas, and that she could not understand the businessman’s decision to close the site. Blaydon MP Liz Twist and businessman Mike Ashley 9:05 KEY EVENT Quorn makes preparations for hard Brexit as new factory opens\nQuorn Foods has confirmed that it is making Brexit contingency plans to ensure it can access the materials it needs to keep producing its products.\nSpeaking to the Press Association, chief executive Kevin Brennan said the company is making sure it can still access the raw materials it needs in case there is a disruption to the supply chain once the UK leave the EU.\nHe said:\nWe’re having to make sure we’ve got a healthy stock of key essential materials in the UK.\nHowever, he added that it was not a “major operation” as the firm is not heavily reliant on EU-made products.\nHis comments were made at the same time as Quorn opened a new sit in Billingham this week.\nThe factory will allow the company to double its capacity and will lead to the creation of 32 permanent jobs. The £150m investment will help the company produce 1.33 million packs of Quorn products per week.\nThe company plans to become a one billion US dollar business by 2027, as the market for meat-free food alternatives expands.\nMr Brennan said:\nThere’s a generational shift around meat consumption.\nWe’re seeing the attitudes of younger consumers - and that’s not just 18-year-olds, that’s 40 downwards - starting to realise they need to eat less meat and clearly that is a long term trend.\nOpening the facility, Tees Valley Mayor Ben Houchen said:\nHuge household-name businesses are thriving in this region. Quorn Foods’ products are sold around the world, making it an important part of our export economy.\nIt is just one example of how our skills base will help businesses and with them, our region, succeed in an outward-looking post-Brexit world. Kevin Brennan, Chief Executive of Quorn Foods (Image: Mike Cowling for Simon Dewhurst Photography) 8:59 KEY EVENT Nearly two thirds of UK's bank branches network 'has vanished'\nNearly two thirds of the UK’s bank branch network has been lost over the past 30 years, analysis from Which? suggests.Banks and building societies had 20,583 branches in 1988 according to parliamentary records, but the consumer group’s analysis of current account providers suggests the figure has dwindled to 7,586 branches now.The consumer group said that while this may not be a complete like-for-like comparison, it gives a good indication of the size of the network 30 years ago against current levels.Which? said a fifth (19%) of people now live more than three kilometres from their nearest branch as the crow flies and nearly one in 10 people (8%) have to travel more than five kilometres. Six per cent of people are now more than six kilometres from a bank, it said.People can access their high street bank accounts at the Post Office’s branches.But a survey of more than 2,000 people found many people are unaware they can use the Post Office for everyday banking services.Nearly half (45%) of people were unaware that they could use a post office for banking purposes.Among those who had used a post office, Which? found there were high satisfaction ratings, with more than three quarters (77%) of people saying they would be likely to use the service again.But Which? said not all the services offered by banks are currently offered by the Post Office and banks also usually demand that customers call into a local branch for anti-fraud checks, or make an appointment to discuss important legal documents, such as lasting power of attorney or grant of probate.The consumer group said that with many communities potentially struggling through the double blow of bank and ATM closures, action is needed to ensure people are not financially excluded and denied access to cash.Ceri Stanaway, Which? money editor, said:\nThe true scale of bank branch closures in recent decades is staggering - and has left millions of people struggling to access the vital financial services and cash that they need.\nFor many there is simply no substitute for a dedicated branch and the wide range of services it offers and many customers now face having to travel long distances if they are to avoid financial exclusion.\nWe want to see banks properly justifying the reasons for closure and taking into account their customers’ needs before shutting their doors - and their customers out.\nA spokesman for trade association UK Finance said:\nBank branches play an important role in the life of local communities and decisions to close them are never taken lightly.\nConsumers are increasingly choosing newer ways to help them with their banking, using technology to check balances and make payments - or even speak to your bank 24/7.\nBut technology is not for everyone, so the major banks have made arrangements for customers and businesses to do their day-to-day banking at over 11,500 Post Office branches nationwide.\nBanks are also investing in new ATMs and mobile bank branches to reach more rural communities, and the industry’s access to banking standard supports business and communities, helping them to access alternative ways to bank when a local branch closes.\nMobile banking is extremely safe with nearly 22 million people in the UK regularly using banking apps during 2017. Bank closures in the North East 2007-2017 8:53 Jonathon Manning Grainger CEO 'embarrassed' housing firm has no developments in the North East\nThe CEO of the UK’s biggest residential landlord has said it is an “embarrassment” that the company is not developing any sites in the North East .\nGrainger Plc is was founded in Newcastle in 1912 and its head office is still based in the city, but despite investing huge sums of money in new housing developments, the firm has no ongoing projects in the region.\nSpeaking to The Journal, CEO Helen Gordon said Grainger was on the lookout for a development opportunity in the North East.\nMs Gordon said:\nAt the moment it is a real embarrassment that we have not secured anything in Newcastle. I am desperate to do something there.\nThe city has great fundamentals, we have a huge team based there, and we have a director of asset management and director of investment who sits on one of the local housing boards.\nWe are anxious to get something done up there.\nGrainger - the UK’s largest residential landlord - is in the process of boosting its private rented sector (PRS) portfolio. The firm announced this morning it has agreed to acquire the entire share capital of the GRIP Real Estate Investment Trust, which is valued at £696m.\nGRIP includes 35 assets - around 1,700 units - across London and the South East. Grainger currently owns 24.9% of the portfolio but will buy the remaining 75.1% from its joint venture partner APG. The deal is valued at £396m and will immediately start generate £32.5m of rental income each year.\nMs Gordon said:\nI am pleased to announce today the acceleration of our growth strategy in the UK private rented sector with the proposed acquisition of GRIP REIT, our £696m PRS co-investment vehicle with APG, the expansion of our PRS investment pipeline to £1.37bn, and a strong set of financial results for the year.\nThe GRIP portfolio, which we have managed since 2013 and therefore know very well, is an exceptional acquisition. It will provide a step change in our investment in the PRS market and generate increased net rental income growth, which in turn will deliver enhanced shareholder returns.\nWe have a well-established strategy for growth supported by an excellent operational platform to successfully manage the enlarged PRS portfolio, ensuring that we can deliver strong returns and great homes for our customers. Helen Gordon, CEO of Grainger Plc (Image: Newcastle Journal) 8:47", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15423544;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-16T10:30:00.000+02:00", "crawled": "2018-11-16T13:18:32.029+02:00", "highlightTitle": ""}