{"organizations": [], "uuid": "6148b672100ab747f0697706df98cefd03ef62f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/whats-on/music-nightlife-news/paul-smith-maximo-park-revels-15465756", "country": "GB", "domain_rank": 21960, "title": "Paul Smith of Maximo Park revels in home crowd and on stage patter on solo tour", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-26T18:00:00.000+02:00", "replies_count": 0, "uuid": "6148b672100ab747f0697706df98cefd03ef62f4"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/whats-on/music-nightlife-news/paul-smith-maximo-park-revels-15465756", "ord_in_thread": 0, "title": "Paul Smith of Maximo Park revels in home crowd and on stage patter on solo tour", "locations": [], "entities": {"persons": [{"name": "paul smith", "sentiment": "negative"}, {"name": "maximo", "sentiment": "none"}, {"name": "maximo park", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}], "locations": [{"name": "maximo park", "sentiment": "none"}, {"name": "cluny", "sentiment": "none"}], "organizations": [{"name": "glasgow evening times", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On opinion Paul Smith of Maximo Park revels in home crowd and on stage patter on solo tour Maximo Park's frontman has three solo albums to his name, his solo project allows him to play guitar on stage and engage in more audience interaction Share Get what's on updates\nMaximo Park's Paul Smith is famed for his energy, a frontman who treats the stage like a personal dancefloor.\nThat's no bad thing, but in Maximo, Paul doesn't get to play guitar, so has no instrument weighing him down.\nHowever, in his solo work, Paul plays guitar on stage. This allows him extra creative input, and - with less room for manoeuvre in the mid-air splits department - there is more energy to spend on patter between songs. This freedom, Paul told the Glasgow Evening Times , is something he enjoys, with audience interaction occasionally meaning his shows run longer than intended.\nOn home turf at Newcastle's Cluny , Paul spoke to the crowd like an old friend. They responded likewise. Hardly surprising, given how embedded he is in the North East music scene, one which he proudly represents.\nThe Teesside native and Tyneside resident was on form on Saturday night.\nOpener Public Eye, taken from new album Diagrams, feels very apt, given its lyrics about the current 'hostile climate' against marginalised groups, which led to events like the Windrush scandal. It was a worthy kick-start.\nThe political and cultural climate was a theme throughout, sprinkled with tales and scenes from living in the North East and travelling further afield, something the observant Smith has long been adept at. Read More Jess Glynne brings the party to a packed out Metro Radio Arena with chart topping anthems\nA Billingham letterbox is referenced in Crush and the Shatter, while Around and Around focuses on the never ending news cycle as Brexit approaches Britain.\nThe set took us through Paul's three albums: Margins, Contradictions and Diagrams, with changes in tempo and style anyone familiar with Maximo Park would recognise.\nThat tempo dropped for the melodic Lake Burley Griffin, while Paul picked it up again for Syrian Plains.\nThe main set closed on the more punky Silver Rabbit, again showing Paul can take a crowd through a range of styles, before an encore featuring two Maximo Park songs.\nIf you're keen to catch Paul play live, he is due to perform at Gosforth Civic Theatre on Monday, December 3. However, the daytime show is for adults with babies who are aged 18 months and younger. So if you missed Saturday's gig as you couldn't get a babysitter, here's your chance!\nFind out more here https://www.wearechalk.co.uk/current-events/paul-smith-gig Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://www.eveningtimes.co.uk/entertainment/17240606.maximo-park-frontman-paul-smith-talks-new-solo-album-and-finally-being-able-to-play-guitar-on-stage/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://www.wearechalk.co.uk/current-events/paul-smith-gig"], "published": "2018-11-26T18:00:00.000+02:00", "crawled": "2018-11-26T18:48:37.032+02:00", "highlightTitle": ""}