{"organizations": [], "uuid": "2f9ee9661831e238bc19e7ec37cf7bcb1f72139b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2264023.ece/ALTERNATES/s1200/0_PaH-LeicsJPG.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/pets-home-stocking-pet-food-2263861", "country": "GB", "domain_rank": 48128, "title": "Pets at Home is stocking pet food for Brexit- and could close 30 vet practices", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-27T14:53:00.000+02:00", "replies_count": 0, "uuid": "2f9ee9661831e238bc19e7ec37cf7bcb1f72139b"}, "author": "Adam Care", "url": "https://www.leicestermercury.co.uk/news/business/pets-home-stocking-pet-food-2263861", "ord_in_thread": 0, "title": "Pets at Home is stocking pet food for Brexit- and could close 30 vet practices", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "pritchard", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "topps tiles", "sentiment": "none"}, {"name": "premier foods", "sentiment": "none"}, {"name": "breedon group", "sentiment": "none"}, {"name": "vet group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why India still loves doing business\nPets at Home reported pre-tax profits crashing 80.5 per cent to £8 million in the six months to October 11 after taking costs of £29 million relating to the Vet Group plans and warned over its full-year results.\nThe group's Brexit plans see it join a growing list of major firms launching contingency efforts amid mounting fears that Theresa May will not get the parliamentary support for her EU withdrawal deal. Theresa May is hoping her Brexit deal will be passed (Image: Frank Augstein/PA Wire)\nTopps Tiles also revealed on Tuesday aims to begin stockpiling key products ahead of Brexit, following recent confirmation of similar plans from the likes of Mr Kipling cakes firm Premier Foods, Majestic Wine and catering giant Compass.\nOn the Prime Minister's Brexit deal, Mr Pritchard said: \"The most important thing is that business needs clarity.\n\"We can cope as long as we know what (the deal) is.\n\"We just want clarity and certainty.\" Read More Breedon Group \"solid\" despite “flat” construction sector, Brexit uncertainty, cost pressures\nPets at Home is also worried over the impact of Brexit on its workforce, with a \"significant\" number of employees from the EU - in particular its vets and distribution centre staff.\n\"Brexit may result in changes to UK immigration policy which increases the risk around the availability, recruitment and retention of these individuals,\" the group said.\nThe group's overhaul of the vet arm may also see up to 300 staff impacted should the 30 practices close, but Mr Pritchard said the group aims to redeploy nearby where possible.\nHe said the overhaul was not down to a poor performance of the division, which grew revenues by 15.4 per cent over the half-year, but the need to \"rebalance\" after rapid expansion. Read More Ibstock Plc shares up 10% after £85m sale of US business\nHe said: \"I recognise we have grown at pace and, more recently, have seen the pressure that rising costs and our fees are placing on this young business.\"\nHe added: \"Yes, we have opened an awful lot of practices and, yes, we have got a small number of those wrong.\"\nOf the practices under review, Pets at Home said it will look to pay off outstanding debts, settling any liabilities for third-party bank loans and leases on behalf of the practice.\nThe group's half-year results showed that on an underlying basis and with costs of the vet plans stripped out, half-year pre-tax profits fell 9.3 pe cent to £37.9 million.\nPets warned it is now expecting lower full-year underlying pre-tax profits, forecasting at least £80 million to £85 million. Like us on Facebook ", "external_links": [], "published": "2018-11-27T14:53:00.000+02:00", "crawled": "2018-11-27T15:16:30.003+02:00", "highlightTitle": ""}