{"organizations": [], "uuid": "acf88fb1ab3e4293e12cb4ce7e62415784921d53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15118947.ece/ALTERNATES/s1200/0_TMP_NEC_280114busdepot_01JPG.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/bus-company-behind-go-north-15406110", "country": "GB", "domain_rank": 21960, "title": "Congestion charges for cars could happen if the bus company behind Go North East gets its way", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-12T18:00:00.000+02:00", "replies_count": 0, "uuid": "acf88fb1ab3e4293e12cb4ce7e62415784921d53"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/bus-company-behind-go-north-15406110", "ord_in_thread": 0, "title": "Congestion charges for cars could happen if the bus company behind Go North East gets its way", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "dunston", "sentiment": "none"}], "organizations": [{"name": "invalid email", "sentiment": "none"}, {"name": "go-ahead group", "sentiment": "none"}, {"name": "o-ahead group", "sentiment": "none"}, {"name": "house of commons transport committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Congestion charges for cars could happen if the bus company behind Go North East gets its way Go-Ahead Group, which provides 175,000 bus journeys every day under the Go North East brand name, said local councils should be more willing to introduce road charges Share Go North East bus depot in Dunston (Image: newcastle chronicle) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe bus company that owns Go North East has called for more road-charging schemes to cut congestion on the roads.\nGo-Ahead Group, which provides 175,000 bus journeys every day under the Go North East brand name, said local councils should be more willing to introduce road charges, or to impose charges on workplace car parks used by employees.\nIn a written submission to House of Commons Transport Committee, Go-Ahead Group said councils should use the powers they already have in order to get cars off the roads and cut congestion.\nIt said: “Powers are available for local authorities to tackle congestion through the Traffic Management Act 2004 but are not effectively used and enforced. Through the Transport Act 2000, measures such as workplace charging/road user charging should be more readily deployed, as a means of achieving target journey times.” Read More Rising exports show why the North East NEEDS a Brexit deal to let trade continue\nA congestion charge was introduced in London in 2003 and other parts of the country are now beginning to follow suit. Birmingham is introducing a “clean air zone”, which involves imposing charges on many private vehicles coming into the city centre, while Manchester City Council is considering a similar scheme.\nBus companies said there was a clear connection between congestion in towns and cities which led to slower traffic and longer journey times, and a fall in demand for bus services.\nGo-Ahead Group said: “Congestion in the UK’s largest cities is 14% worse than five years ago, and traffic speeds are forecast to fall by almost 5mph from 17mph to an average of 12mph by 2030, and significantly slower in peak hours.\n“Evidence has shown that a 10% decrease in bus speeds can reduce patronage by 10% or more, especially when increased congestion leads to increased variability in journey times.\nBy ignoring the congestion problem, we are missing the opportunity to create a virtuous circle where improved bus speeds attract passengers, leading to fewer cars, faster journey times for everyone and a multiplier on positive economic impact.” Read More\nThe firm also criticised free parking schemes. It said some councils had introduced more free parking in an attempt to bring shoppers into struggling high streets, but warned: “Policy discussions have been wrongly dedicated to increased, free or cheaper parking.\n“This would exacerbate the problem by driving increased usage of private vehicles, including by commuters.\n“With the correct targets and incentives, we recommend local authorities invest more in bus priority measures and in traffic management to tackle congestion more effectively.”\nArriva, which operates buses as Arriva North East in Northumberland, Tyne and Wear, County Durham, Darlington and Teesside, also called for measures to cut congestion, but did not call for road charges.\nIt said in a written submission: “Central government has a leading role to play in setting traffic reduction targets to drive and track progress in support of bus travel.\n“Local government should commit to targets for average bus speeds and at the very least introduce a minimum requirement to stop bus speeds declining any further.” Read More Families locked in battle with Newcastle charity over their homes face bills of more than £30,000\nThe business called on councils to introduce more bus lanes and other schemes to give buses priority on the road.\nIt said; “Department for Transport should encourage local authorities to take a proactive and open-minded approach to bus priority schemes, encourage them to work with bus operators who have expert knowledge of local traffic pinch points and provide support through targeted investment in bus infrastructure and traffic improvement schemes.\n“Bus priority measures can include dedicated bus lanes but other measures such as bus gates, priority turns and intelligent traffic lights can be just as effective and can be delivered at considerably less cost.”\nStagecoach UK Bus, the country’s biggest bus operator, told the Committee: “It is vital to support proposals for tackling congestion as a priority for Government and, delivering effective bus mass transit in our urban areas is the best and most cost efficient way of achieving this whilst maintaining accessibility to jobs and services.”\nThe business operates buses in Liverpool, Newcastle, Hull, Manchester, Oxford, Sheffield and Cambridge.\nThe House of Commons Transport Committee, which includes Easington Labour MP Grahame Morris, is holding an inquiry into the health of the bus market.\nMPs will consider written submissions, question senior managers in face-to-face meetings and hear evidence from passenger groups and government ministers before publishing a report with their findings. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-12T18:00:00.000+02:00", "crawled": "2018-11-12T22:59:11.013+02:00", "highlightTitle": ""}