{"organizations": [], "uuid": "818cafb7357f4f2ee0752eba92897e5f8580abfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2192556.ece/ALTERNATES/s1200/0_Untitled-design.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/ben-bradshaw-dawlish-rail-line-2192481", "country": "US", "title": "Ben Bradshaw on Dawlish rail line and the sea-change in public opinion on Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-07T15:14:00.000+02:00", "replies_count": 0, "uuid": "818cafb7357f4f2ee0752eba92897e5f8580abfa"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/devon-news/ben-bradshaw-dawlish-rail-line-2192481", "ord_in_thread": 0, "title": "Ben Bradshaw on Dawlish rail line and the sea-change in public opinion on Brexit", "locations": [], "entities": {"persons": [{"name": "dawlish", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "brexit ben bradshaw", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}], "locations": [{"name": "dawlish", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "south west peninsular rail taskforce", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ben Bradshaw discusses the Dawlish seawall in his latest column Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nIt is early November and I’ve already lost count of how many times the main railway line into our region has been severed at Dawlish.\nIt happened again yesterday (Wednesday) after a high tide combined with strong winds forced the line’s closure.\nIt is nearly five years since the line was closed for two months after damage caused by a winter storm. Conservative Cabinet Ministers, led by David Cameron, fell over themselves on visits to the region promising “money will be no object” in ensuring the Westcountry gets a railway resilient to the impacts of climate change.\nWestcountry councils, business leaders and MPs came together in an unprecedented show of unity to form the South West Peninsular Rail Taskforce. Read More Shock as dead snake is found in box weighed down with stones in Devon river Dawlish station on Wednesday (Image: Network Rail)\nIts central demand was an additional inland rail route west of Exeter avoiding the vulnerable stretch along the sea at Dawlish. Five years’ on nothing has happened.\nWhile the Government continues to pour money into HS2 (£56 billion) and Crossrail (£15 billion) it has allocated a mere £15 million to “strengthen the cliffs and protect the sea wall at Dawlish”, work that has yet to start.\nThe Government and its apologists at Network Rail must be the only people who believe this “patch and mend” approach will keep our trains running, given the rising sea levels and worse storms caused by climate change.\nBut the Government gets away with this because our region’s Conservative MPs are so feeble. Ten DUP MPs from Northern Ireland have managed to squeeze billions out of Theresa May as the price for propping up her Government. Dawlish station has been battered by high tides and heavy rain\nYet time after time our far greater number of Westcountry Tory MPs have traipsed through the voting lobbies in support of every policy and every budget which has delivered nothing to the South West. Read More Morrisons now serves a HUGE breakfast bap that weighs 3/4 of a kilo\nThe latest polls showing a sea-change in public opinion in the South West on Brexit should not come as a surprise.\nWestcountry people are sensible. We can see the mess the Government has made of the negotiations and that the Brexit now on offer will be a far cry from what was promised.\nReports of job losses, like the 400 good engineering jobs at Barden in Plymouth this week because of Brexit, are sadly becoming a daily occurrence. The Barden Corporation (Image: Penny Cross)\nWith clear majorities, not just in the South West, but across the UK, now favouring staying in the EU and backing a public vote on any deal, it would be a democratic outrage for Mrs May to try to ram her botched or blindfold Brexit through Parliament without giving the people a final say.\nIf and when she comes back with an “agreement’ it will be as worthless as the piece of paper waved by Neville Chamberlain after Munich. Read More Dawlish train line reopens but there is more bad weather to come\nBut MPs won’t have the “luxury” of 18 months, as they did after Munich, to replace Chamberlain with Churchill. They will have just a few days to examine their consciences and ask if they can honestly vote for this, in the full knowledge that they will be held fully accountable by their voters for the ensuing damage. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-07T15:14:00.000+02:00", "crawled": "2018-11-07T16:12:05.000+02:00", "highlightTitle": ""}