{"organizations": [], "uuid": "e3cae70bfe29dd396fece29ca770f6a6927e5cca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15417154.ece/ALTERNATES/s1200/0_Nick-Forbes.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nick-forbes-north-tyne-mayor-15417077", "country": "GB", "domain_rank": 21960, "title": "Nick Forbes, leader of Newcastle City Council announces he is standing for North of Tyne mayor", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T02:01:00.000+02:00", "replies_count": 0, "uuid": "e3cae70bfe29dd396fece29ca770f6a6927e5cca"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nick-forbes-north-tyne-mayor-15417077", "ord_in_thread": 0, "title": "Nick Forbes, leader of Newcastle City Council announces he is standing for North of Tyne mayor", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "negative"}, {"name": "tyne", "sentiment": "negative"}, {"name": "coun forbes", "sentiment": "none"}, {"name": "nic", "sentiment": "none"}, {"name": "byker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "negative"}, {"name": "ncj media", "sentiment": "none"}, {"name": "coun forbes", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Nick Forbes, leader of Newcastle City Council announces he is standing for North of Tyne mayor The Labour council leader is the second major candidate to throw his hat in the ring and confirm he intends to stand for election as the first ever North of Tyne mayor Share Newcastle City Council leader Nick Forbes. (Image: NCJ Media) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nNick Forbes, the leader of Newcastle City Council , has announced he is running for North of Tyne mayor.\nThe Labour councillor, who was instrumental in securing a devolution deal for the North East, has long been tipped as a major candidate likely to enter the race.\nExclusively announcing his decision to seek election as the North East's first ever regional mayor, Coun Forbes said he has the \"credibility, experience and passion to be able to deliver a better future for the many not the few\".\nHe said he would \"make job creation my number one priority, putting people from Berwick to Byker central to our future\".\nAfter taking over the Labour group in 2007, Coun Forbes led Labour to victory in 2011 and has been leader of the council ever since. Nick Forbes leader of Newcastle City Council (Image: Newcastle Chronicle)\nHe has been a prominent backer of efforts to bring a devolution deal to the region, teaming up with leaders in Northumberland and North Tyneside to secure an agreement with Government.\nThe deal, which is worth an extra £600m, will see a host of new powers transferred to a new combined authority after being formally established earlier this month.\nIn his campaign announcement, he said he would be \"a Mayor who isn’t afraid to stand up and be counted\" and oppose \"further privatisation\" of NHS services and \"campaign against any further cuts to public health or council budgets\".\nHe said he would extend Newcastle's \"groundbreaking\" methods for tackling homelessness, call for a \"fair share\" of regional funds after Brexit and \"fight for investment\" on public transport and schools. Read More Newcastle City Council leader Nick Forbes explains why he's running to be North of Tyne mayor\nCoun Forbes added he would back efforts to bring back the 'Passionate People, Passionate Places' marketing campaign, a major effort to boost the region's tourist sector which was scrapped by the Coalition Government.\nShould he win the Labour nomination and then triumph in the May 2 election, questions about leadership of the city council and other key bodies would be raised.\nIf he was elected mayor and Labour retained control of the council, a new leader would need to be selected at its annual general meeting shortly after the election.\nChronicleLive understands Coun Forbes will continue as leader of the council in the event he wins the Labour mayoral nomination but loses out in the main election. Read More The race begins: Labour's Paul Brannen becomes first candidate to announce North of Tyne mayoral bid\nCoun Forbes also sits on Labour's National Executive Committee by virtue of his role as head of the Labour group on the Local Government Association, a role he would likely vacate in the event he was elected mayor.\nMembership of the key body is hotly contested by factions within the party so a vacancy would trigger a good deal of internal interest.\nHe becomes the second major candidate to announce his candidacy following the news North East MEP Paul Brannen is also seeking the Labour nomination. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-15T02:01:00.000+02:00", "crawled": "2018-11-15T02:40:03.057+02:00", "highlightTitle": ""}