{"organizations": [], "uuid": "c6d480066c57521f954fcd2f7482e926c4459793", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13830391.ece/ALTERNATES/s1200/SGP_NEC_260617STATION05JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/labour-plans-re-nationalise-key-15412553", "country": "GB", "domain_rank": 21960, "title": "Labour plans to re-nationalise key services are 'comfort blanket', North East business leader says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T20:01:00.000+02:00", "replies_count": 0, "uuid": "c6d480066c57521f954fcd2f7482e926c4459793"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/labour-plans-re-nationalise-key-15412553", "ord_in_thread": 0, "title": "Labour plans to re-nationalise key services are 'comfort blanket', North East business leader says", "locations": [], "entities": {"persons": [{"name": "andrew moffat", "sentiment": "none"}, {"name": "moffat", "sentiment": "none"}, {"name": "tyne c", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "newcastle central station", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "cbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle Central Station (Image: Newcastle Chronicle) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA North East business leader taken a swipe at Labour’s plans to nationalise key utilities, saying it amounts to a “comfort blanket” policy that would do nothing to improve services.\nAndrew Moffat, who is regional chair of the CBI, said that while he understood frustration at rail, energy and water services in some parts of the country, services that had been privatised had benefited from private sector investment.\nMr Moffat’s comments come as Labour is considering a massive re-nationalisation programme which would bring rail, water, postal and energy supply companies back under Government control.\nHe said that re-nationalisation of such a large section of the economy would be hugely costly and would create a “cycle of wasted investment, time and talent, all the while failing to tackle the real concerns of customers”. Andrew Moffat, Port of Tyne CEO (Image: Port of Tyne)\nMr Moffat, who is shortly to step down as chief executive of the Port of Tyne , said: “We would be foolish to take for granted the enormous improvements private companies have driven across the UK’s infrastructure.\n“In the rail sector, there are a quarter more carriages on the railways, services have increased by nearly a third, and the frequency of services on many key long-distance routes has doubled since the franchise system began.\n“In energy, the £100bn invested since privatisation is making a real difference. The number of power cuts has fallen by half, and the length of power cuts has decreased by well over half since the start of the millennium. This improved resilience comes against a backdrop of more than halving emissions since 1990.\n“Investment in the water sector is double that of pre-privatisation levels. Leakages have been reduced by a third since the 1990s. Customers are five times less likely to suffer supply interruptions than they were pre-privatisation, while low water pressure is fast becoming a thing of the past. Read More North East MPs call on government to reveal how Brexit will affect the economy\n“While in just five years, Royal Mail has transformed its inefficient loss-making operations to financial sustainability, higher productivity and better pay for its staff.\n“These companies have improved because they are well-regulated – and this needs to continue. And it also makes obvious business common sense to keep striving for a better service for their customers.\n“Where there are genuine concerns, there are improvements on the way. Rail companies have committed to running 7,000 new carriages by 2021. Energy companies are continuing to reduce emissions as they transition to renewable sources. And domestic water bills are expected to fall by 4% in real terms from 2020 to 2025.\n“One political intervention that may appear as an easy-to-grasp comfort blanket – but would prove hugely damaging for consumers and the economy – would be to bring those industries back under Government ownership.\n“The 1970s was a decade notorious for chronic under-investment in the railways, poor labour relations and government interference. The water network had to compete with other key industries for investment, and regularly lost out, leading to crumbling infrastructure. And the energy industry was in dire straits, with strikes prompting the Government to implement the infamous three-day week. Read More Badger cull called into question as farmers urged to do more to tackle TB in cattle\n“If we look at the question of who pays for the nationalisation process itself, the truth is we cannot afford to don rose-tinted spectacles and return to the failing state-run services that brought such strife to the UK.”\nMr Moffat, who is shortly to step down as chief executive of the Port of Tyne, said Britain needed to be attractive to investors as it approached Brexit and couldn’t afford to leave key infrastructure projects on the drawing board.\nPolls have shown some support for Labour’s re-nationalisation plans, with nearly six out of 10 people believing privatisation of Britain’s railways has been a failure.\nRising energy bills have also sparked calls for more Government intervention and some water companies have come under criticism for poor standards. Labour candidate Chi Onwurah (Image: Newcastle Chronicle)\nResponding for Labour, Newcastle Central MP Chi Onwurah , Shadow Minister for Industrial Strategy, said, “Labour’s industrial strategy will build a high-wage, high-productivity, high-skill economy. We want to see a strong business sector supporting that vision which is why we would invest record amounts in business innovation and keep corporation tax at the lowest level in the G8.\n“The private sector can and does deliver many services important to all of us in our daily lives. But some services need to be delivered by the public sector, either because the market system won’t deliver them to everyone - like health for example. Or because they are natural monopolies where competition just isn’t possible.\n“I worked for 20 years as a network engineer and six years as a network regulator and I know that many networks just don’t allow real competition to deliver great services.\n“We have also set out a plan to deliver such public services in the public interest. We’ll bring natural monopolies such as water and rail back into public hands, as is normal in world-leading economies from Germany to South Korea.\n“This will keep prices low and allow profits to be reinvested in crucial infrastructure improvements – benefitting businesses as well as consumers.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-13T20:01:00.000+02:00", "crawled": "2018-11-14T04:04:34.010+02:00", "highlightTitle": ""}