{"organizations": [], "uuid": "8e9c75f592e435a0afa482ae116d8f176f0dd703", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15148789.ece/ALTERNATES/s1200/0_Dominic-Raab-Speaks-On-Government-Plans-In-The-Event-Of-A-No-Deal-Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/uk-news/dominic-raab-quits-brexit-secretary-15418423", "country": "GB", "domain_rank": 21960, "title": "Dominic Raab quits as Brexit Secretary over Theresa May's Brexit deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T11:02:00.000+02:00", "replies_count": 0, "uuid": "8e9c75f592e435a0afa482ae116d8f176f0dd703"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/news/uk-news/dominic-raab-quits-brexit-secretary-15418423", "ord_in_thread": 0, "title": "Dominic Raab quits as Brexit Secretary over Theresa May's Brexit deal", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "dominic raab", "sentiment": "negative"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dominic Raab quits as Brexit Secretary over Theresa May's Brexit deal Dominic Raab became the second person to resign over Theresa May's Brexit agreement with the EU Share Brexit Secretary, Dominic Raab (Image: Getty Images Europe) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nDominic Raab has sensationally quit as Brexit Secretary, in a massive blow to Theresa May's Brexit plans.\nMr Raab, who only took over in the summer after David Davis resigned in protest over the Prime Minister's withdrawal strategy, said he \"cannot in good conscience support the terms proposed for our deal with the EU\".\nHis surprise departure on Thursday came amid a furious backlash from Brexit-backing Tories to the deal agreed by UK and EU negotiators four months ahead of the UK's scheduled withdrawal on March 29.\nHours earlier Shailesh Vara had quit as minister of state for Northern Ireland, saying Mrs May's agreement, \"leaves the UK in a halfway house with no time limit on when we will finally be a sovereign nation\".\nIn his letter to the Prime Minister, Mr Raab said the deal represented a \"very real threat to the integrity of the United Kingdom\" because of provisions for Northern Ireland. Read More Brexit resignations - live fallout and reaction\nHe also said he could not accept \"an indefinite backstop arrangement\" for the Irish border.\nHe said: \"No democratic nation has ever signed up to be bound by such an extensive regime, imposed externally without any democratic control over the laws to be applied, nor the ability to decide to exit the arrangement.\"\nMr Raab added: \"Above all, I cannot reconcile the terms of the proposed deal with the promises we made to the country in our manifesto at the last election.\n\"This is, at its heart, a matter of public trust.\" Read More Unions warn against 'no-deal' Brexit\nThe resignations came as European Council president Donald Tusk announced an extraordinary meeting of EU leaders in Brussels on November 25, at which the withdrawal agreement and a political declaration on future relations will be finalised and formalised.\nWestminster is braced for further resignations, amid widespread expectations that the Prime Minister may face a challenge to her position from Conservative MPs submitting letters of no confidence in her leadership.\nMr Raab had been a surprise choice as Brexit Secretary when Mr Davis, along with foreign secretary Boris Johnson and Brexit minister Steve Baker, resigned in protest at Mrs May's Chequers plan in July. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nAs the UK's ministerial point man in negotiations he made repeated trips to Brussels for talks with EU negotiator Michel Barnier as he and civil servants tried to hammer out a workable withdrawal agreement.\nThe pound fell heavily against most major currencies after his resignation. Sterling dropped 1.1% to 1.28 US dollars and was 1.2% lower at 1.13 euros.\nShadow Cabinet Office minister Jon Trickett said the Government was \"falling apart before our eyes as, for a second time, the Brexit Secretary has refused to back the Prime Minister's Brexit plan\".\n\"This is the 20th minister to resign from Theresa May's Government in her two-year premiership,\" he said.\n\"Theresa May has no authority left and is clearly incapable of delivering a Brexit deal that commands even the support of her Cabinet, let alone Parliament and the people of our country.\"\nRemain-supporting Tory MP Anna Soubry added on Twitter that Mr Raab's resignation \"marks the end of PMs Withdrawal Agreement\" and possibly her premiership.\nMs Soubry added: \"No PM deserves to be so badly treated.\n\"Raab signed up to her Withdrawal Agreement allowing her to make her statement after Cabinet knowing he'd resign in time for the 9am News bulletins the next morning. Shameful.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-15T11:02:00.000+02:00", "crawled": "2018-11-15T11:17:01.094+02:00", "highlightTitle": ""}