{"organizations": [], "uuid": "59043b93923bf7c00d7f062da33dfa26c9c2deaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13159326.ece/ALTERNATES/s1200/IBP_NEC_080617election_18JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-mps-call-government-15412021", "country": "GB", "domain_rank": 21960, "title": "North East MPs call on government to reveal how Brexit will affect the economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T18:47:00.000+02:00", "replies_count": 0, "uuid": "59043b93923bf7c00d7f062da33dfa26c9c2deaa"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-mps-call-government-15412021", "ord_in_thread": 0, "title": "North East MPs call on government to reveal how Brexit will affect the economy", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "dominic grieve", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "justine greening", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "newcastle north", "sentiment": "none"}, {"name": "finance", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "house of commons share click", "sentiment": "none"}, {"name": "invalid email two north east labour", "sentiment": "none"}, {"name": "tory education", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East MPs call on government to reveal how Brexit will affect the economy Labour MPs have joined forces with Conservative rebels to try to defeat Theresa May in the House of Commons Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTwo North East Labour MPs have joined forces with Tory rebels in a bid to force the Government to reveal the economic cost of Brexit .\nCatherine McKinnell, MP for Newcastle North, and Phil Wilson, MP for Sedgefield, are attempting to insert the measure into the Finance Bill, the legislation that allows proposals announced in the Chancellor’s recent Budget to go ahead.\nAlso involved are Conservative MPs who are highly sceptical about Brexit, including Anna Soubry, Sarah Wollaston, Dominic Grieve and former Tory Education Secretary Justine Greening.\nThe cross-party coalition could inflict a major defeat on Theresa May’s government if they gain the support of more Labour MPs.\nA Treasury study published earlier this year, which the Government initially tried to keep confidential, predicted that the North East’s economy will be 11% smaller 15 years after Brexit if there is a trade deal compared to remaining in the EU. Read More Labour and Tory MPs join forces to demand answers about the impact of Brexit on the economy\nAnd it found that the North East economy would be 16% smaller if we leave the EU without a trade deal, compared to what would happen if there was no Brexit.\nNow, MPs are attempting to force the Government to publish assessments showing the likely impact of Brexit under whatever trade deal Mrs May manages to agree with the EU, and what would happen if we leave without a deal, as well as the impact on the economy of simply staying in.\nMs McKinnell said: “I have signed this important amendment to ensure the Government publish not just the comparison between their deal and no-deal, but also their deal and the current deal, ie membership of the EU.\n“Parliament and public need to see the full economic analysis to make an informed decision.”\nMr Wilson said: “We all need the full facts available to Parliament and the people on the real cost of Brexit.”\nThe amendment to the Finance Bill has been sponsored by Labour backbencher Chuka Umunna, a supporter of the campaign for a second referendum or “People’s Vote” on Brexit.\nMany of the other MPs who have put their name to the amendment also back the People’s Vote campaign. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://www.birminghammail.co.uk/news/midlands-news/labour-tory-mps-join-forces-15410448", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-13T18:47:00.000+02:00", "crawled": "2018-11-14T01:24:22.019+02:00", "highlightTitle": ""}