{"organizations": [], "uuid": "0815ecd7672e6d0233aa042090b04a4422245002", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12919697.ece/ALTERNATES/s1200/Local-Labour-MP-Helen-Goodman-picture-outside-the-former-HSBC-branch-now-boarded-up-in-the-centre.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/recently-bought-new-home-mp-15414221", "country": "GB", "domain_rank": 21960, "title": "Recently bought a new home? MP wants laws to protect you from paying hundreds of pounds in unexpected bills", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T07:00:00.000+02:00", "replies_count": 0, "uuid": "0815ecd7672e6d0233aa042090b04a4422245002"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/recently-bought-new-home-mp-15414221", "ord_in_thread": 0, "title": "Recently bought a new home? MP wants laws to protect you from paying hundreds of pounds in unexpected bills", "locations": [], "entities": {"persons": [{"name": "helen goodman", "sentiment": "none"}], "locations": [{"name": "mirrorpix", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "share labour", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Recently bought a new home? MP wants laws to protect you from paying hundreds of pounds in unexpected bills Buyers of new homes find they are expected to pay regular charges to maintain the housing estate, which they knew nothing about Share Labour MP Helen Goodman (Image: Mirrorpix) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA North East MP is demanding legislation to protect homeowners who find themselves liable for hundreds of pounds in unexpected bills.\nHelen Goodman, MP for Bishop Auckland , wants to put an end to unfair schemes which can affect people who buy newly-built properties.\nShe said: \"Property companies are making a huge amount of money from this, and often do nothing in return.\"\nHomeowners find that they are liable to pay fees to maintain private housing estates. For example, they may be charged fees for cutting the grass on a communal green space.\nAnd while all the charges should be explained before they buy the house, in practice many homeowners are unaware until the bills start to arrive. Homes for sale (Image: PA)\nThe problem arises because communal spaces on an estate, such as grass verges, playgrounds, and areas planted with trees and shrubberies, are retained by developers instead of being handed over to the local authority.\nProperty companies then either charge residents directly for maintenance, or sell on the contract to a property management company who collect these fees.\nThis practice is currently unregulated, and Ms Goodman says it is the latest cash cow for property companies.\nThere is no cap on fees and management companies are under no obligation to account to homeowners for work carried out or costs incurred.\nShe says residents find themselves trapped on poorly maintained estates, paying hundreds of pounds a year, with no way to hold the company to account. Read More North East MPs call on government to reveal how Brexit will affect the economy\n“It’s an incredibly one-sided contract,” said Ms Goodman, “homeowners don’t have the power to ask for a justification of costs, but the management company can legally send bailiffs or threaten repossession of the home if a resident doesn’t pay on time.”\nAt a public meeting in her County Durham constituency, homeowners shared their stories of unfair estate fees.\nOne resident reported receiving threatening letters from a property holdings company.\nHe had refused to pay the yearly £100 levy for the maintenance of landscaped gardens, parks and picnic areas that have never been built on the site.\nAnother bought her home on the site after the sales team confirmed residents would have a say in the management of the communal areas, but this turned out to be untrue.\nThe contract was sold on to a private company who reserve the right to increase their fee above the rate of inflation. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-15T07:00:00.000+02:00", "crawled": "2018-11-15T08:35:06.032+02:00", "highlightTitle": ""}