{"organizations": [], "uuid": "0561a9ace98d2de339131fdcfa081ed25756f17f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15378466.ece/ALTERNATES/s1200/0_New-Look-profits.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/new-look-reveals-up-100-15378350", "country": "GB", "domain_rank": 21960, "title": "New Look reveals up to 100 stores could close - including some in North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-06T15:49:00.000+02:00", "replies_count": 0, "uuid": "0561a9ace98d2de339131fdcfa081ed25756f17f"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/new-look-reveals-up-100-15378350", "ord_in_thread": 0, "title": "New Look reveals up to 100 stores could close - including some in North East", "locations": [], "entities": {"persons": [{"name": "alistair mcgeorge", "sentiment": "none"}, {"name": "mcgeorge", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "new look", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}], "organizations": [{"name": "cva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A branch of New Look (Image: PA) Get business updates\nStruggling fashion retailer New Look has said it will close up to 100 stores as part of turnaround plans that aim to cut costs.\nNew Look had already revealed it would close 60 stores around the country as part of a company voluntary arrangement (CVA) approved in March.\nBut company chairman Alistair McGeorge said today that he has increased the number of stores marked for closure to 85.\nDiscussions are also ongoing surrounding the future of a further 13 stores, of which Mr McGeorge said around half were likely to be shut.\nNew Look has confirmed that it will close its stores in Team Valley , Gateshead; The Metrocentre (menswear store), Gateshead; North Shields; Wallsend ; Thornaby and Stockton-on-Tees. However, it has yet to reveal if any more stores in the region will be added to the list.\nFigures released on Tuesday show that the company posted an underlying operating profit of £22.2m for the first half, compared to a loss of £10.4m in the same period last year. Read More Tiger Tiger in Newcastle sold to Deltic Group as part of three bar deal\nBut revenue declined by 4.2% to £656.m. Like-for-like sales under the New Look brand dropped by 3.7%, a slower rate than last year’s 8.6% drop.\nThe high-street mainstay said the slide in sales was in line with its plan to improve profitability with more full-price sales.\nMr McGeorge said the first part of the recovery was going well, but that he would like to “move faster”.\n“We’re not looking to defend our position, we’re looking to attack,” he said.\nIn addition to the restructuring of its UK base, New Look last month announced its decision to exit its retail business in China, where it has 148 stores.\nAnnualised cost savings of £70m have now been achieved, with another £8m to be added.\nAs part of the turnaround, New Look has also improved its UK market share and ramped up online operations, increasing click and collect sales by 41% in the first half.\nMr McGeorge warned that conditions on the high street remain challenging. Read More One in four North East workers not paid enough to meet living costs\nHe said: “We continue to work hard to accelerate our progress, but we are facing into significant headwinds and uncertainties, including Brexit.\n“Clearly the wider retail environment remains challenging and we are not expecting that to change anytime soon. However, we are on the right track and continue to drive further efficiencies across the business.\n“As we look to the second half, our focus will be to continue to improve our financial and operational stability and further capitalise on our brand strength to position us well for the future.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-06T15:49:00.000+02:00", "crawled": "2018-11-06T16:15:02.036+02:00", "highlightTitle": ""}