{"organizations": [], "uuid": "2b2924a6b338e90bf7ca8ead190d3ce3c42d7a70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15337483.ece/ALTERNATES/s1200/0_Southampton-FC-v-Newcastle-United-Premier-League.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-takeover-mike-ashley-15415705", "country": "GB", "domain_rank": 21960, "title": "Newcastle United takeover gossip: New claims Mike Ashley 'close to selling' club to US investors", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T16:18:00.000+02:00", "replies_count": 0, "uuid": "2b2924a6b338e90bf7ca8ead190d3ce3c42d7a70"}, "author": "Mark Douglas", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-takeover-mike-ashley-15415705", "ord_in_thread": 0, "title": "Newcastle United takeover gossip: New claims Mike Ashley 'close to selling' club to US investors", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "greg fleming", "sentiment": "none"}, {"name": "peter kenyon", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}, {"name": "kenyon", "sentiment": "none"}, {"name": "richard scudamore", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "chelsea", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "rockefeller capital management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What is Mike Ashley's net worth?\n“But now Betaville hears from usually reliable sources the maverick entrepreneur has been over in the US putting the finishing touches to a deal to sell the business to a mystery consortium of investors.\n“It’s not clear who the buyers for are but the fact that Ashley was over in America to finalise the details implies that perhaps the purchasers for the Premier League club are from that part of the world.”\nThese reports have emerged a few weeks after news that Peter Kenyon - the former Manchester United and Chelsea chief executive - was trying to piece together a consortium to buy United. Read More Will Newcastle United pay £250,000 towards Richard Scudamore's £5m Premier League leaving bonus?\nSky reported that Rockefeller Capital Management, led by Wall Street financier Greg Fleming, were among the investors who were potentially interested in backing Kenyon.\nIt is understood that Kenyon and Ashley share a personal relationship, and so the Sports Direct magnate is receptive to the approach - but the ex-Chelsea chief exec is not yet believed to be in a position to make an offer. Ashley is believed to want in excess of £300million for the Magpies, having supposedly cut his price down from £400m.\nThese latest reports are intriguing, however, and come almost exactly a year after Staveley and PCP Capital Partners Ltd's interest was at its highest. Staveley claims to have had three bids for the club - with cash values ranging between £250m and £350m, though they contained various clauses - last November. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nBetaville's claims have been put to club sources, who insist that it is very much \"business as usual\" at NUFC. Nobody internally at St James' Park has been briefed that a potential takeover is imminent, while Ashley attended his seventh Magpies match in a row at the weekend when he watched Newcastle defeat AFC Bournemouth 2-1 on Saturday - despite these reports claiming he has been in the US.\nAshley himself also told players at an Italian meal last month that he did not expect to sell the club this season, while senior Magpies sources stress they are still planning for the billionaire to remain in place for the \"medium term\". Read More VAR, Brexit and a new chief exec: Key Premier League issues which Newcastle will debate this week\nHowever, such is the advanced level at which takeovers are negotiated, those within St James' Park may not even know the delicate nature of discussions which Ashley may be undertaking. The Sports Direct businessman has only a small inner circle of trusted confidantes, meaning club employees will probably only find out the club is being sold once it a deal all-but agreed. Like us on Facebook", "external_links": [], "published": "2018-11-14T16:18:00.000+02:00", "crawled": "2018-11-14T16:26:50.000+02:00", "highlightTitle": ""}