{"organizations": [], "uuid": "0cb310d2e08e420f79c947b51955591c96079124", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article2239935.ece/ALTERNATES/s1200/0_GrowthBrexit.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/tech-future-post-brexit-economy-2239893", "country": "US", "title": "Is tech the future of the post-Brexit economy in the South West?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-20T18:06:00.000+02:00", "replies_count": 0, "uuid": "0cb310d2e08e420f79c947b51955591c96079124"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/tech-future-post-brexit-economy-2239893", "ord_in_thread": 0, "title": "Is tech the future of the post-Brexit economy in the South West?", "locations": [], "entities": {"persons": [{"name": "barden", "sentiment": "none"}, {"name": "bill martin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sarah heald", "sentiment": "none"}, {"name": "stephens scown", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "simon fox", "sentiment": "none"}, {"name": "foot anstey", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "south west", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "reach plc", "sentiment": "none"}, {"name": "pennon group", "sentiment": "none"}, {"name": "corporate affairs & investor relations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Barden factory closure: Warning more...\nWestern Morning News editor, Bill Martin, chaired the event.\nAmong the attendees were Simon Fox, chief executive of Reach Plc, Fast Track to Growth partners and some of the region’s biggest employers including Stephens Scown, Pennon Group and Foot Anstey.\nMr Fox said that unlike the ‘Trump bump’ in the United States that has helped the newspaper and media industry, people in the UK are fed up with Brexit.\nHe said: “People are just really bored of it. Has Brexit helped us a news item, no it has not.”\nAnd what everyone is striving for is clarity, particularly in business.\nSarah Heald, Director of Corporate Affairs & Investor Relations at Pennon Group, said: “The draft Brexit deal is a compromise but it does provide what businesses have been calling for and that is certainty. We need to be able to plan, invest and think about the future.” Read More Leaders call for a Great South West 'ministerial champion'\nAnd she urged the region to be clear on its priorities.\nShe said: “The opportunities for the South West are the same now as they will be after Brexit.”\nShe urged for real political leadership and for the regional Industrial Strategy , a plan for the UK post Brexit, to reflect the needs of business.\nShe said: “At the moment it feels like it’s being written on a side of the desk in Whitehall and I would say come and talk to us in the business community.”\nInfrastructure, skills and solving the productivity issues are key to that, said Stuart Elford, chief executive of the Devon and Plymouth Chamber of Commerce .\nHe said: “We need to have the people to do the jobs. If we can’t find the right people then we won’t see that growth boom.”\nThe region’s farming, care and hospitality sector rely heavily on low skilled EU labour.\nGiles Dunning, partner at Stephens Scown LLP and FT2G Partner, said: “We need to move away from low paid jobs in the South West and a reliance on grant funding. In moving out of the EU, we will need more private investment to bring better paid jobs and that will keep talented people in the region.”\nAnd the region should not expect there to be an endless supply of low cost labour from Europe, said Garry Thompson, chief executive of Computech IT .\nHe said: “There’s no reason that we can’t have our borders open for people to work. There’s a vast amount of labour out there, from the commonwealth, for example.\n“We can’t use the EU as a permanent source of low skilled labour,” he said.\nColin Jolliffe, SW Business Support Solutions and FT2G Partner, said that low unemployment in the region added extra pressure.\nHe said: “Unless we attract people into the south west we are going to have a real shortage not just of skilled people but of unskilled people and this is one of the biggest concerns.” Read More Work to start to protect storm battered Dawlish rail line\nDuncan Sykes, partner at Foot Anstey, said that during the 2008 recession, the firm recruited ‘like-Billy-o’ to find talented lawyers who found themselves on uncertain ground.\n“We saw a real opportunity to pull in talent. It was the right decision and heaven forbid, if we are in a rocky position then we would look to do the same again.\n“The positives are that change will happen and change is good. Business that want to make the most of it will really thrive in the change environment,” he said.\nAfter the meeting, Mr Pritchard said that Brexit is a challenge but not an excuse.\n“Business leaders at the Growth Beyond Brexit event, and indeed our many FT2G members, are ambitious, pragmatic and trying to avoid the ‘Brexit noise’ and concentrate on their priorities. They are all saying we must focus on harnessing technology, attracting, retaining and nurturing the very best talent, continuing to collaborate and support each other as a business community and getting better at promoting the brand that is the South West, which in my view is the very best place to live, work, be successful and thrive before, during and after Brexit.” Like us on Facebook ", "external_links": ["https://www.plymouthherald.co.uk/news/business/barden-factory-closure-warning-more-2189263"], "published": "2018-11-20T18:06:00.000+02:00", "crawled": "2018-11-20T19:01:09.034+02:00", "highlightTitle": ""}