{"organizations": [], "uuid": "f0f89e8d691fbb8156871e0edd40c7bbd8f748a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2240435.ece/ALTERNATES/s1200/1_fatal.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/family-friends-pay-tribute-couple-2240432", "country": "US", "title": "Family and friends pay tribute to couple killed in tragic crash", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-20T18:38:00.000+02:00", "replies_count": 0, "uuid": "f0f89e8d691fbb8156871e0edd40c7bbd8f748a3"}, "author": "Richard Booth", "url": "https://www.devonlive.com/news/devon-news/family-friends-pay-tribute-couple-2240432", "ord_in_thread": 0, "title": "Family and friends pay tribute to couple killed in tragic crash", "locations": [], "entities": {"persons": [{"name": "gerald", "sentiment": "none"}, {"name": "lynda greening", "sentiment": "none"}, {"name": "hatch beauchamp", "sentiment": "none"}, {"name": "suzanne gould", "sentiment": "none"}, {"name": "ilminster", "sentiment": "none"}, {"name": "linda greening", "sentiment": "none"}, {"name": "lynda", "sentiment": "none"}], "locations": [{"name": "taunton", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "somerset live", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Family and friends pay tribute to couple killed in tragic crash Gerald and Lynda Greening and a man in his 20s died on the A358 in Somerset on Sunday November 11 Share Gerald and Linda Greening died at the scene of the crash Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe family of a couple who died in a crash have spoken of the moment the tragic news was broken.\nGerald and Lynda Greening and a man in his 20s died on the A358 in Somerset on Sunday November 11.\nThe road was closed near Hatch Beauchamp between Taunton and Ilminster as officers examined the scene.\nSpeaking to Somerset Live , Suzanne Gould spoke about the moment her 95-year-old dad was told his brother, Gerald, and his wife, Lynda, had died. Read More Is tech the future of the post-Brexit economy in the South West?\nShe said: \"My cousin had to go to my mum and dad on Sunday morning (November 11) and tell them that his only surviving brother and his wife had been killed.\n\"My 85-year-old mum has never seen my dad cry in the 60 years that they have been married, but last Sunday he sobbed and said to David (Gerald and Lynda's son) 'I've lost my best mate'.\n\"Uncle Og, as we called him, would visit mum and dad every Monday, Wednesday and Friday.\" Tributes at the scene\nShe remembered the pair would often met each other to watch speedway or cricket together.\nSuzanne added: \"My niece does a bit of cleaning for mum and dad on Mondays and her little two-year-old called Uncle Og \"Gog\" and would say 'where's Gog?'.\n\"Our extended family will now have to attend a double funeral to say our final farewells to their/our dad, mum, brother, sister and in-laws, nan and grandad, great grandad, great nan, uncle, auntie, dear friends.\"\nCullompton RFC previously shared their own tribute to their vice-president and his wife on their Facebook page and website. Read More\nA statement reads: \"It is with great sadness the club have to inform members that Gerald Greening, a vice-president at the club, and his wife Lynda, tragically lost their lives on Sunday, November 11, in a car accident.\n\"Once we have details of the funeral arrangements we will let members know.\n\"Everyone at Cullompton Rugby Club send their sincere condolences to the family at this very sad time.\"\nOther clubs shared their messages of support, with Bridgwater and Albion Rugby Football Club posting: \"So sad. Had some great times with them.\n\"Our thoughts are with you all at this difficult time. Our condolences from Bridgwater & Albion RFC.\"\nPaignton Rugby Club commented: \"Our condolences from all at Paignton Rugby. Terrible news.\"\nSince news of their deaths were made public, dozens of friends, family and acquaintances shared their memories and tributes to Gerald and Lynda. Read More", "external_links": ["https://www.somersetlive.co.uk/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.somersetlive.co.uk/all-about/bridgwater"], "published": "2018-11-20T18:38:00.000+02:00", "crawled": "2018-11-20T19:00:55.003+02:00", "highlightTitle": ""}