{"organizations": [], "uuid": "930bb5946b20c13da58914e36aa0387e164101dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15472159.ece/ALTERNATES/s1200/0_De-La-Rue-Passports.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/de-la-rues-loss-uk-15471834", "country": "GB", "domain_rank": 21960, "title": "De La Rue's loss of UK passport printing contract at Gateshead triggers new strategy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-27T15:44:00.000+02:00", "replies_count": 0, "uuid": "930bb5946b20c13da58914e36aa0387e164101dd"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/de-la-rues-loss-uk-15471834", "ord_in_thread": 0, "title": "De La Rue's loss of UK passport printing contract at Gateshead triggers new strategy", "locations": [], "entities": {"persons": [{"name": "gatesh", "sentiment": "negative"}, {"name": "de la rue", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "invalid email gateshead", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "de la rue", "sentiment": "none"}, {"name": "gemalto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business De La Rue's loss of UK passport printing contract at Gateshead triggers new strategy Gateshead’s passport and bank note printer De La Rue absorbed write-off costs of £3.7m following its failed bid to renew the passport contract Share De La Rue in Gateshead (Image: MDM) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nGateshead banknote printer De La Rue has revealed a strategy rethink for one its divisions after losing a key UK passport contract.\nEarlier this year the Government came under heavy fire for choosing a European firm for the contract, claiming it will save £120m during the lifetime of the 11-and-a-half-year contract.\nDe La Rue’s Gateshead facility has been manufacturing British passports from its Team Valley factory in Gateshead for the last 10 years, but from the middle of next year Gemalto will take on the contract, a move which could affect 200 North East jobs.\nThe company abandoned its appeal against the Government’s decision in April, when it emerged it has absorbed write-off costs of £3.7m following the failed bid.\nNow, as it announced half-year figures for the six months ended September 29, chief executive Martin Sutherland has announced the firm will refocus the business on specific parts of the manufacturing process for identity documents. Read More Government needs to help businesses in North East after Brexit, report says\nDe La Rue , he said, will concentrate on separate parts of the manufacturing process such as on polymer plastics and security technology.\nHe said the company is currently in the midst of a five-year plan to transform De La Rue into a “less capital intensive, more technology led security product and services provider” in order to improve earnings. Inside De La Rue's Gateshead factory (Image: belben wells/ De La Rue)\nDe La Rue – which has produced banknotes since 1860 and is the firm behind the new polymer £5 and £10 notes – posted a fall in half year profit due to lower margins in the currency division and continued investment in the business.\nFor the half year period the banknote maker made a pre-tax profit of £7.1m compared with £18.9m in the same period a year earlier.\nHowever, group revenue increased 5% to £257.6m and the company maintained the interim dividend at 8.3p a share.\nMr Sutherland said: “We continue to make progress in delivering against our strategic plan to transform the Group into a less capital intensive, more technology led business. We have seen good growth in Group revenue in the first half.\n“We are pleased with the growing momentum in Product Authentication & Traceability, having recently secured two important tax stamp solutions contracts, which are both endorsements of our capabilities and excellent references for De La Rue in this fast growing market. These build on the orders secured in the last 12 months which include the five year contract with the Federal Tax Authority in the UAE. We expect our PA&T business to double in size within the next three years. Read More Numbers of North East businesses going bust rising at faster rate than any other part of the country\n“Over the last six months we have conducted a thorough review of our strategy and market positions. In the light of the UK passport decision, we have concluded that we will refocus our identity business on the supply of higher margin security features and components. We believe we can continue to drive cost efficiencies across the Group and achieve growth in Security Features, Polymer and PA&T.\n“We maintain a strong order book and pipeline which provides good visibility for the second half of this year and into next year. With good revenue coverage from the Group’s 12 month order book of £365m and based on the orders planned for production and shipment in the second half, we are confident that we will meet our expectations for the full year.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-27T15:44:00.000+02:00", "crawled": "2018-11-27T17:43:07.004+02:00", "highlightTitle": ""}