{"organizations": [], "uuid": "96b0f0c277587b5fafe9f243cb8868b03fecd847", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15222054.ece/ALTERNATES/s1200/0_BELGIUM_Brexit_140220.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-deal-agreed-live-updates-15412152", "country": "GB", "domain_rank": 21960, "title": "Brexit deal agreed LIVE: Theresa May set for crunch Cabinet meeting with departure deal in sight", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T19:00:00.000+02:00", "replies_count": 0, "uuid": "96b0f0c277587b5fafe9f243cb8868b03fecd847"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-deal-agreed-live-updates-15412152", "ord_in_thread": 0, "title": "Brexit deal agreed LIVE: Theresa May set for crunch Cabinet meeting with departure deal in sight", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jon walker", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "salzburg", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT A pivotal day?\nThat’s it for tonight. It’s been a dramatic night - but there’ll be more to come.\nGovernment sources have briefed a withdrawal agreement between the UK and EU has been agreed in principal.\nThat means Theresa May will now have to face down her cabinet and get them to back her.\nShe’ll do this at a crunch meeting of the cabinet at 2pm on Wednesday.\nFrom then, it’s all about getting the deal through Parliament, probably in early December - but with DUP and Tory backbenchers lining up to slam the deal, the path to victory for the Prime Minister looks narrower by the day.\nWe’ll be bringing you all the updates right here tomorrow in what could be a pivotal day in this protracted drama. Prime Minister Theresa May speaking in Downing Street in the aftermath of the Salzburg summit (Image: PA) 21:32\nIn wholly unsurprising news, the former-UKIP leader does not approve. 20:54\nThe ex-Brexit secretary has Tweeted. The next few weeks are going to be rough. 20:45 A round-up of tonight's action\nOur man in Westminster Jon Walker has filed a round-up of tonight’s dramatic events.\nThe United Kingdom and European Union have at last agreed on a draft Brexit deal.\nPrime Minister Theresa May was tonight, Tuesday November 13, meeting members of her Cabinet one at a time to explain the proposals.\nAnd at 2pm tomorrow, Wednesday, she will chair a meeting of her Cabinet where she will ask them formally to support the proposed agreement. Prime Minister Theresa May has defended her Brexit plans (Image: Birmingham Mail) 19:59 More Downing Street visitors\nMore ministers going in and out of Downing Street, either to meet with the Prime Minister or read the full text of the agreement. Leader of the House of Commons and Lord President of the Council Andrea Leadsom leaves Downing Street (Image: Getty Images) Chancellor of the Exchequer, Philip Hammond, leaves Downing Street as cabinet ministers read the draft Brexit documents (Image: Getty Images) 19:49 Opposition party leaders rally\nIn a rather unusual move, the Westminster leaders of four parties have wrote a joint letter to the Prime Minister calling for a “truly meaningful vote” on the Brexit deal.\nJeremy Corbyn, Sir Vince Cable, and the Westminster leaders of the SNP and Plaid Cymru, Ian Blackford and Liz Saville-Roberts, all signed the letter which you can read in full below.\nWe are writing to you with regard to an issue of the utmost importance: that is to ensure that Parliament has a truly meaningful vote on any Brexit withdrawal agreement.\nRecent interventions from Government ministers have suggested that you and your government may seek to limit or constrain the process on the final vote, in an attempt to muzzle Parliament.\nWe want to be clear that this would be wholly unacceptable. In particular, paragraph 6 of the Government’s memorandum on the issue stated that: ‘amendments could have the effect - whether deliberately or accidentally - of inhibiting the Government’s legal ability to ratify the Withdrawal Agreement’.\nWe believe that Parliament should be able to consider, debate and vote on amendments before a decisive vote on the substantive motion.\nThat would give this sovereign parliament an opportunity to express its view over the terms of departure from the EU. It is unthinkable that Parliament could be silenced at such a crucial period for the country.\nWe recognise that it will be necessary for a business motion to be agreed by the House to govern arrangements for consideration of this motion. But the existing procedures, which include limiting debate to 90 minutes, are not appropriate. So a much more extensive business motion will be needed for this crucial issue.\nAs a minimum, any motion to this House must include: the possibility for multiple amendments to be tabled, with the Speaker able to select multiple amendments to be taken before the main motion.\nWhile we recognise Parliament will have to approve or disapprove any agreement, it would be reckless to present this vote as take-it-or-leave-it without Parliament being able to suggest an alternative.\nWe as party leaders have championed parliamentary scrutiny and engagement throughout this process, and throughout the debate we have had repeated assurances from across the dispatch box that MPs would be able to express their support for alternative options.\nNow it seems the Government has abandoned its willingness to let Parliament take back control and seems determined to limit the role of this sovereign parliament.\nWe believe Parliament must be allowed to express its view and hold the executive to account.\nThis would not be possible if Parliament was unable to table, debate and consider amendments before any decision on the substantive motion. 19:48 DUP deputy leader slams deal\nThis isn’t how it was supposed to be.\nThe DUP, who Theresa May has relied on since losing her majority in the 2017 election, are on the verge of rejecting the deal.\nIf they don’t vote for it, getting through the Commons will be extremely difficult. 19:15\nThe leader of the opposition has responded. 19:03 The charm offensive is on\nCabinet ministers have been visiting the Prime Minister in Downing Street throughout the evening.\nHere are some pictures of them leaving. Elizabeth Truss leaves 11 Downing Street following the announcement that Britain and the EU are \"almost within touching distance\" of a Brexit deal. (Image: PA) Liam Fox leaves Downing Street following the announcement that Britain and the EU are \"almost within touching distance\" of a Brexit deal. (Image: PA) Matt Hancock leaves Downing Street following the announcement that Britain and the EU are \"almost within touching distance\" of a Brexit deal. (Image: PA) Secretary of State for Transport Chris Grayling leaves Downing Street. (Image: Getty Images) 18:49\nLabour’s shadow Brexit secretary has Tweeted his reaction to today’s developments. 18:30\nChristopher Hope, The Daily Telegraph’s chief political correspondent, has these updates. 18:02\nInteresting updates from ITV’s political editor. 17:47 KEY EVENT Boris Johnson's scathing reaction\nBoris Johnson has just been speaking to the BBC too and, predictably, he’s not happy.\nHe says the deal is “vassal state stuff” and says it will create a situation where, for the “first time in 1000 years, Parliament will not have a say on the laws which govern this country”.\nHe says the deal will have failed to “protect our precious union” and give Dublin more say over the Northern Irish Government than London on some issues.\nJohnson believes there’s still time to “have another go” and accuses negotiators of escalating the Northern Irish border issue “in order to produce this perverse result”.\nThe deal (which he adds he hasn’t seen in full yet) will “make a nonsense of Brexit” and he calls on cabinet to “chuck it out”.\nHe wants the backstop arrangements scrapped\nHe rather needlessly confirms he won’t vote for it when it gets to the Commons. Boris Johnson makes his speech on Brexit at the Tory Conference 17:37 Calls for cabinet to 'block' deal\nArch Eurosceptic Jacob Rees Mogg is in Westminister Hall talking to journalists.\nHe just told the BBC he hopes “cabinet will block [the deal] and if they don’t then Parliament will”.\nHe said there is “growing opposition to these proposals” among Tory MPs. Jacob Rees-Mogg arriving at the Royal United Services Institute (RUSI) in Whitehall, London (Image: PA) 17:26 Confirmation of crunch meeting\nCabinet will met at 2pm tomorrow. The BBC’s political editor has confirmed that on Twitter. 17:21 Ministers invited to Downing Street\nThe BBC are reporting that ministers are being called in to Downing Street “one by one” tonight.\nSome will be harder to convince than others.\nRemember, there were reports in the national press last week that other ministers were preparing to resign in the wake of Jo Johnson’s dramatic exit from Government. (Image: Getty Images Europe) 17:16 What's on the Brexit sec's mind?\nThe Press Association captured this excellent picture of a less-than-chuffed Dominic Raab leaving Downing Street earlier today. Brexit Secretary Dominic Raab leaves Downing Street, London, after a meeting (Image: PA) 17:09 KEY EVENT Brexit withdrawal agreement edging closer\nThe UK’s negotiating team has agreed a Brexit deal with Brussels, according to Government sources.\nTomorrow,the Prime Minister will meet with her Cabinet and attempt to win their support for the withdrawal agreement.\nAccording to the Press Association, the agreement has been reached at a “technical level”.\nThere has been no official confirmation from either Downing Street or Brussels.\nMinisters have been seen going in to Downing Street this evening as Mrs May looks to secure support for the deal.\nNegotiations have been at a stalemate for months over a handful of thorny issues, in particular the Northern Irish border.\nThe next 24 hours in Westminster could be turbulent as the the Prime Minister seeks to unite all sides of a Cabinet which are widely reported to still be divided on some issues.\nWe’ll be bringing you updates throughout the evening on the deal itself and the political fallout. Theresa May arrives at the Conservative Party conference (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15412152;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-13T19:00:00.000+02:00", "crawled": "2018-11-14T01:24:13.028+02:00", "highlightTitle": ""}