{"organizations": [], "uuid": "8998faeaf65457dd444faf7aef480e02db6eb739", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1361450.ece/ALTERNATES/s1200/0_Kevin-Harris-Leicester-OMP.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/rsm-tenon-partner-kevin-harris-2193396", "country": "GB", "domain_rank": 48128, "title": "RSM Tenon partner Kevin Harris elected president of East Midlands Chamber - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-07T02:00:00.000+02:00", "replies_count": 0, "uuid": "8998faeaf65457dd444faf7aef480e02db6eb739"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/rsm-tenon-partner-kevin-harris-2193396", "ord_in_thread": 0, "title": "RSM Tenon partner Kevin Harris elected president of East Midlands Chamber - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "kevin harris", "sentiment": "negative"}, {"name": "rob mayo", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}], "locations": [{"name": "east midlands", "sentiment": "none"}, {"name": "derbyshire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "east midlands chamber", "sentiment": "none"}], "organizations": [{"name": "leicestershire live news rsm tenon", "sentiment": "negative"}, {"name": "leicestershire enterprise partnership", "sentiment": "none"}, {"name": "nottinghamshire chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News RSM Tenon partner Kevin Harris elected president of East Midlands Chamber With Brexit day falling during his presidency, he wants to ensure chamber helps and guides as many businesses as possible Share Kevin Harris is managing partner of the Grove Park office of audit, tax and consulting firm RSM Get Business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA prominent Leicestershire business figure has been elected president of the East Midlands Chamber for the next year.\nKevin Harris accepted the chains of office from outgoing president Rob Mayo at the chamber’s annual general meeting this morning.\nMr Harris is managing partner of the Grove Park office of accountancy firm RSM and was this year installed as chairman of the Leicester and Leicestershire Enterprise Partnership.\nHe has been involved with the chamber for many years, and chaired the Leicestershire chamber before overseeing its merger with the Derbyshire and Nottinghamshire Chamber of Commerce to form East Midlands Chamber.\nAfter thanking Rob for his “hard work, enthusiasm and leadership in the past year”, he said that with Brexit day falling during his presidency, he wanted to ensure the chamber continued to offer help and guidance “through the changes that lie ahead”. Read More Top Leicester accountant Kevin Harris promoted to managing partner of RSM in Grove Park\nHe said: “I want to make sure Government keeps the needs of business paramount in its deliberations before Brexit and focuses on the needs of businesses in the wake of our divorce from the EU, whether that is with or without a deal, with or without a transition period.” Read More Kevin Harris is new chairman of Leicester and Leicestershire Enterprise Partnership\nHe said his goals during the year were to help the business communities of Leicester, Derby and Nottingham work together; help make the Government’s Industrial Strategy and LEP local industrial strategies work for local businesses as Brexit draws closer; and build links between business and education and try and address the skills agenda as a whole. Like us on Facebook ", "external_links": [], "published": "2018-11-07T02:00:00.000+02:00", "crawled": "2018-11-07T19:19:57.043+02:00", "highlightTitle": ""}