{"organizations": [], "uuid": "76727679a5435a050ecb25548acab050e59c4d69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13242433.ece/ALTERNATES/s1200/The-Prime-Minister-Meets-DUP-Leader-At-Downing-Street.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-brext-backstop-northern-ireland-15417938", "country": "GB", "domain_rank": 21960, "title": "What is the Brexit 'backstop' how will it affect Northern Ireland and what has been decided?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T23:00:00.000+02:00", "replies_count": 0, "uuid": "76727679a5435a050ecb25548acab050e59c4d69"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-brext-backstop-northern-ireland-15417938", "ord_in_thread": 0, "title": "What is the Brexit 'backstop' how will it affect Northern Ireland and what has been decided?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News What is the Brexit 'backstop' how will it affect Northern Ireland and what has been decided? One of the key issues up for debate as Theresa May's cabinet signed off on the draft Brexit agreement was the issue of a backstop for Northern Ireland Share\nIf you've been keeping up with Wednesday's heated debates around Brexit, you've probably heard the word \"backstop\" more times than you can count.\nBut what does it actually mean - and why are people so worried?\nIt's about the relationship between the UK and the Republic of Ireland - specifically the relationship between Northern Ireland and the republic. Read More Theresa May's full statement as cabinet AGREES daft Brexit plan after marathon five-hour meeting What does it mean?\nThe backstop is a backup plan to prevent a \"hard border\" between Northern Ireland and the Republic of Ireland.\nIt would come into force if no proper agreement could be made on trade and security arrangements by 2021.\nThe aim, therefore, is for it never to come into force.\nA \"hard border\" would mean proper crossing checks on the 310-mile line: that would run contrary to the Good Friday Agreement and be likely to cause problems on the island of Ireland.\nIf the backstop came into force, EU customs rules will be extended across the whole of the UK for a \"temporary\" period. There would be a \"single customs territory\" between the UK and the EU in that time. Read More Why is it controversial?\nCritics say it risks tying the UK into EU rules.\nThe UK couldn't sign its own trade deals with other countries if it was in a \"customs union\" with the EU.\nThere's also a worry about whether Northern Ireland could risk being treated differently to the rest of the UK - which would be very unpopular with Theresa May's backers the DUP What does the draft Brexit agreement say?\nThe draft deal says the backstop is based on maintaining full alignment with the rules of the EU's internal market and its customs union.\nIt says the UK and EU will use their \"best endeavours\" to agree a news deal which trumps the backstop - in whole or in part - by 31 December 2020 - the final day of the transition period. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-14T23:00:00.000+02:00", "crawled": "2018-11-15T00:08:55.000+02:00", "highlightTitle": ""}