{"organizations": [], "uuid": "b6438e1a1707dcb0a87f39e3f9c0c8321fce6803", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2113392.ece/ALTERNATES/s1200/1_19407761-1.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/exeter-student-jailed-life-after-2243046", "country": "GB", "title": "Exeter student was jailed for life after 'five minute hearing with no lawyer'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-21T14:49:00.000+02:00", "replies_count": 0, "uuid": "b6438e1a1707dcb0a87f39e3f9c0c8321fce6803"}, "author": "Colleen Smith", "url": "https://www.devonlive.com/news/devon-news/exeter-student-jailed-life-after-2243046", "ord_in_thread": 0, "title": "Exeter student was jailed for life after 'five minute hearing with no lawyer'", "locations": [], "entities": {"persons": [{"name": "ben bra", "sentiment": "none"}, {"name": "matt", "sentiment": "none"}, {"name": "matt hedges", "sentiment": "none"}, {"name": "daniela tejada get daily", "sentiment": "none"}, {"name": "matthew hedges", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "colleen smith", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "middle eas", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "invalid email exeter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Exeter Exeter MP Ben Bradshaw is appalled at Matthew Hedges life sentence for spying: \"Matt is an innocent student.\" 12:49, 21 NOV 2018 Matthew Hedges with his wife Daniela Tejada Get\nExeter MP Ben Bradshaw says 'innocent student' Matt Hedges has been jailed for life after a five minute hearing without his lawyer in the United Arab Emirates after being convicted of spying for the UK Government.\nThe MP is now taking up the fight on behalf of 30-year-old Matt, whose wife and her family live in Exeter, said: \"I am shocked and appalled by this news. I am also extremely concerned by reports that Matt was sentenced at a hearing lasting just five minutes without his lawyer present.\"\nMatt was arrested at Dubai airport on May 5 this year after flying to the UAE to interview people about foreign policy and security in the Middle East.\nMatt and his wife Daniela Tejada, 27, were both undergraduates at Exeter University. The couple settled in the city, where Daniela's father lives, after graduating. At the time of his arrest Matt was studying for a PhD at Durham University. Read More Devon man spells HUGE 'Stop Brexit' GPS message in 22,000-mile European road trip\nMr Bradshaw said: \"Matt is an innocent student who was in the UAE conducting research for his PHD. I am seeking urgent clarification from the Foreign Office about what it intends to do now and am hoping to speak to the Minister Alistair Burt this afternoon.\n\"I also want to discuss what has happened with Matt's wife, Daniela, who I understand is on her way back from Dubai, where she has been looking after Matt for the last few days.\" Matthew Hedges with his wife Daniela Tejada (Image: Facebook)\nDaniela said she was concerned about her husband's mental health as he has been held in solitary confinement since his arrest.\nShe said: \"What I can confirm is that my husband Matt has not received appropriate medical care and attention, especially in regard to his mental health.\n\"Matt has been kept in solitary confinement for over five months. (Image: Daniela Tejada/PA)\n\"Matt does not speak Arabic and is therefore unable to communicate fully with the court-appointed lawyer, who he has only met once, at his court hearing last week.\n\"Matt was in the UAE to carry out academic research for his PhD. Video Loading Click\n\"Since he was detained on May 5, 2018 he has only ever been granted two consular visits which is in direct violation of his rights.\n\"Matt is a man of integrity and principle. He has a brilliant academic mind and an impeccable track record.\n\"He is kind and caring and greatly loved and respected. Please send him home.\" Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-21T14:49:00.000+02:00", "crawled": "2018-11-21T15:08:51.004+02:00", "highlightTitle": ""}