{"organizations": [], "uuid": "8e1d3a7778ed66c1d4bb88c7cff55f85363b0c59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2242977.ece/ALTERNATES/s1200/0_CapturePNG.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/devon-man-spells-huge-stop-2242695", "country": "US", "title": "Devon man spells HUGE 'Stop Brexit' GPS message in 22,000-mile European road trip", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-21T14:34:00.000+02:00", "replies_count": 0, "uuid": "8e1d3a7778ed66c1d4bb88c7cff55f85363b0c59"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/devon-man-spells-huge-stop-2242695", "ord_in_thread": 0, "title": "Devon man spells HUGE 'Stop Brexit' GPS message in 22,000-mile European road trip", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "andy", "sentiment": "none"}], "locations": [{"name": "barden", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Barden factory closure: Warning more...\nBut Andy insists it was worth it to make the statement.\nHe told the Daily Mail : \"The right to explore as well as live and work abroad, without tiresome red tape, is an immense privilege.\n\"As it stands, the ability to freely access and roam our fellow EU member states makes us incredibly fortunate. For me, this adventure has highlighted what is at stake.\n\"EU authorities have already said that British citizens will be placed on a 'visa-free' list, even in the event of a no-deal Brexit.\nEU authorities have already said that British citizens will be placed on a 'visa-free' list, even in the event of a no-deal Brexit.\nIt means that Britons will still be able to travel to the EU's 27 other member states, although how long they are allowed to stay could be limited. A Brexit deal further could increase Britons' rights to travel to the continent.\nAn EU statement says: '[Britons] can come as a tourist, to visit friends or family, to attend cultural or sports events or exchanges, business meetings, for journalistic or media purposes, medical treatment, for short-term studies or training and any similar activities. How Andy spelled out each letter of his message\nS : Starting in Loch Lomond, Scotland, Mr Pardy crossed the Irish Sea to Ireland, before crossing back to Wales then down to Cornwall.\nT : Starting in Gothenburg, Sweden, he drove north Alesund in Norway, then back to Snasa.\nO : He circled around into Sweden after starting in the Namsskogan area of Norway.\nP : Starting in Narvik, Norway, he drove north, then down into Finland before returning, through Sweden, to his starting point.\nB : This was the last leg of his tour, starting in Bilbao in northern Spain, he drove along the north coast, then down through Portugal, along the south coast of Spain and back to Bilbao through Madrid.\nR : This was completed in France, starting in the foothills of the Alps, west to Bordeaux, then a large loop up through Paris and back down to Andorra on the Spanish border.\nE : Starting in Austria, he drove west to southern France then north to Luxembourg and east to Nuremburg. The top of the letter was made by a trip from Hamburg, Germany to Amsterdam in the Netherlands.\nX : This was made by two trips. One from Poland to the Croatian coast, the second from Albania, through the Balkans and the Czech Republic to Berlin.\nI : This was made by driving in the circle around Poland, before coming south to Romania, through Slovakia and Hungary.\nT : The T was drawn in the Baltic states and Belarus, starting in Estonia, going south through Latvia and Lithuania, before doubling back and south towards Minsk.\n'However, the visa waiver does not apply to persons travelling for the purpose of carrying out a paid activity in the Member States, i.e. for those who come to work in the EU.'\nAndy is documenting his journey on Instagram. You can follow along with him here. Want more news?\nFor Devon news, find Devon Live's Facebook page here , or their Twitter page here , or visit their homepage at www.devonlive.com\nTo keep up to date with Plymouth Live's latest news, follow us on Facebook here and Twitter here , or visit our homepage at www.plymouthlive.com\nFor Cornwall news, find Cornwall Live's Facebook page here , or their Twitter page here , or visit their homepage at www.cornwalllive.com Like us on Facebook ", "external_links": ["https://www.facebook.com/cornwalllivenews/", "http://www.cornwalllive.com/", "https://twitter.com/DevonLiveNews", "https://www.facebook.com/plymouthlive/", "https://www.facebook.com/devonlivenews/", "https://www.plymouthherald.co.uk/news/business/barden-factory-closure-warning-more-2189263", "https://www.plymouthherald.co.uk/", "https://twitter.com/CornwallLive", "https://www.instagram.com/therogueconsultant/?hl=en", "https://twitter.com/Plymouth_Live", "https://www.dailymail.co.uk/news/article-6413535/Remain-supporter-gives-job-spell-Stop-Brexit-GPS.html"], "published": "2018-11-21T14:34:00.000+02:00", "crawled": "2018-11-21T15:00:15.035+02:00", "highlightTitle": ""}