{"organizations": [], "uuid": "c7eae6fdaccd37978ae2ac9a22bf0391f92a3db3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15426772.ece/ALTERNATES/s1200/0_TMP_NEC_161118Starmer09JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-creating-lost-years-nothing-15426621", "country": "GB", "domain_rank": 21960, "title": "Brexit is creating 'lost years' where nothing else gets done, Sir Keir Starmer says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-16T18:07:00.000+02:00", "replies_count": 0, "uuid": "c7eae6fdaccd37978ae2ac9a22bf0391f92a3db3"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-creating-lost-years-nothing-15426621", "ord_in_thread": 0, "title": "Brexit is creating 'lost years' where nothing else gets done, Sir Keir Starmer says", "locations": [], "entities": {"persons": [{"name": "keir starmer", "sentiment": "negative"}, {"name": "speakin", "sentiment": "negative"}, {"name": "keir", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "business brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "invalid email brexit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Brexit is creating 'lost years' where nothing else gets done, Sir Keir Starmer says Speaking at an event on Tyneside, Shadow Brexit Secretary said Government faces a \"very choppy time\" over Brexit deal Share Click to play Tap to play The video will start in 8 Cancel Play now Get business\nBrexit is creating “lost years” for regions like the North East when none of the challenges facing society receive any attention, Shadow Brexit Secretary Sir Keir Starmer has told a conference on Tyneside.\nSpeaking as the chaos of Wednesday’s announcement on a possible Brexit deal continued to swirl around Westminster, Sir Keir travelled to Gateshead and said that politicians were doing “nothing else” but row over the UK’s exit from the EU.\nHe said the referendum vote in areas like the North East - where a majority of people voted for Brexit, but which studies have shown stands to lose the most economically - showed that many inequalities in society had been ignored for too long. Sir Keir Starmer, Labour Shadow Brexit Secretary, addresses the North East Economic Forum at the Sage (Image: newcastle chronicle)\nHe forecast “very choppy times” next week as he predicted the Prime Minister will persist with her deal to leave the EU in the face of widespread Tory opposition.\nAnd he said he believed MPs of all parties would come together to prevent a “disastrous” no-deal Brexit if Theresa May’s deal failed, with a General Election or a second referendum the most likely next outcomes.\nSir Keir said Mrs May had stopped trying to sell her Brexit deal as “good”, and was now merely arguing it was just better than leaving without one. Sir Keir Starmer, Labour Shadow Brexit Secretary (Image: newcastle chronicle)\nHe was speaking at the Sage Gateshead ahead of an address to the North East Economic Forum.\nHe said: “It’s very difficult to know what is going to happen next - yesterday in Parliament was an extraordinary day because for months we have been waiting for the Prime Minister to come back with her deal.\n“She did so and what we saw were Cabinet resignations and Tory MP after Tory MP standing up and saying they would not support her. Obviously next week is all about whether the Prime Minister herself survives. Read More North East firm cancels £100m investment due to Brexit uncertainty\n“If she does survive, I think she will persist with her deal and I don’t think it’s going to get through Parliament - so we’re in for some very, very choppy times next week.”\nSpeaking to politicians and business leaders from the North East, he said a no-deal Brexit would be disastrous for manufacturing firms in areas like the North East that relied on complex supply chains where parts frequently crossed national borders, and where components arrived ‘just in time’ to be made into finished products and then quickly exported.\nHe also lamented the way Brexit had completely overtaken the public sphere in the UK. Sir Keir Starmer, Labour Shadow Brexit Secretary at the North East Economic Forum at the Sage (Image: newcastle chronicle)\nHe said: “All of our time and energy in Parliament is vested in Brexit. We’re doing nothing else. It’s dominating headlines, it’s dominating our work, it’s dominating the civil service.\n“And so much else needs to be done. All we’re doing is doing is trying to construct a deal that gives us some of what we’ve got now. I don’t subscribe to the theory that there’s going to be a fantastic new beginning - what we’re really doing is trying not to damage the economy as we go through this process.\n“That’s a really important thing to be doing but what we really ought to be doing is addressing some of the issues that exist. Read More Newcastle firm owned by Brexit campaigner Arron Banks facing massive fine\n“I voted and campaigned for Remain but millions of people thought the other way, for various reasons. I think one of the reasons was that people wanted to tell us that the political and economic system wasn’t working very well for them, and I think they’ve got a point.\n“It’s very interesting to do this out of London because people in some regions think that too much power, wealth and influence is in London and the South East. The way we’ve invested in our economy over recent decades has been short term - ‘Where can I make the quickest amount of money quickest?’ People have been driven to London and we’ve not done long term investment in different regions across the UK. That has all sorts of knock-on effects. The North East Economic Forum at the Sage (Image: newcastle chronicle)\n“I think there’s all sorts of other inequalities across the United Kingdom that have become hardwired in. My own party became far too casual about inequality. I don’t think people think everybody should be equal but when you’ve got gross disparities between what people are earning, and between their lifestyles, people think that’s just not right any more.\n“You could say the same about education and public services, etc. So millions of people told us something in the referendum. It was probably nothing to do with the EU but it was to say that politicians need to listen up, that this country needs to have a pretty important, radical transformation to make it a better place where we invest properly and build properly so that infrastructure, resources, power and wealth are shared more equally across the United Kingdom.\n“We need to act on that but the truth is we’re doing nothing because Brexit is taking all of the time and energy. Read More Big rise in companies seeking Brexit advice, says Newcastle law firm Womble Bond Dickinson\n“And I think this period will be looked back on as not only as one of great excitement as we go through this chaos. We will look back and say that they were lost years when things that should have been done weren’t done.”\nSir Keir criticised Boris Johnson for saying during the referendum that £350m could be switched from the EU to the NHS as this ignored money coming from the EU in regional aid to boost businesses in places like the North East.\nAt the economic form, Sir Keir’s warnings about the dangers of a hard Brexit were echoed by Tim Rutter, head of technical services at Newton Aycliffe train manufacturing plant Hitachi, who said access to local, national and international supply chains were crucial to the future of the plant as it looked to export from the North East.\nHe said: “We want access to the most seamless trading environment that is possible to enable us to have access to that global supply chain.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-16T18:07:00.000+02:00", "crawled": "2018-11-16T19:38:49.001+02:00", "highlightTitle": ""}