{"organizations": [], "uuid": "f6eeb7c1a3ee7582b02e93a2b33eada284b99e97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14174868.ece/ALTERNATES/s1200/1_The-site-of-former-steelworks-and-SSI-site-that-is-to-be-redeveloped-as-part-of-South-Tees-Developme.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15475509", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: World's first clean gas energy plant to be built in Teesside", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-28T10:00:00.000+02:00", "replies_count": 0, "uuid": "f6eeb7c1a3ee7582b02e93a2b33eada284b99e97"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15475509", "ord_in_thread": 0, "title": "Business Breakfast LIVE: World's first clean gas energy plant to be built in Teesside", "locations": [], "entities": {"persons": [{"name": "ben ward", "sentiment": "none"}, {"name": "theros", "sentiment": "none"}, {"name": "jonathon manning newcastle", "sentiment": "none"}, {"name": "waylan", "sentiment": "none"}], "locations": [{"name": "teesside", "sentiment": "none"}, {"name": "wayland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "theros pharma", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "wayland group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Ramsden's celebrates 'good first half' as turnover grows\nThe boss of Ramsdens Holdings Plc has said the pawnbroking business has had a “good first half” after posting a 10% increase in turnover.\nThe Stockton-headquartered firm saw its turnover increase 10% from £21.8m to £23.9m.\nHowever, operating profit fell marginally to £5.07m for the six months ending September 2018, compared with £5.24m in 2017.\nPeter Kenyon, Chief Executive, said:\nThe Group has had a good first half, reflecting the strengths of our diversified business model and outstanding value-for-money customer offering. Whilst there have been headwinds for the foreign currency exchange market in the UK driven by ‘staycation’ trends over the summer, our investments in pawnbroking, jewellery retail and the store estate have delivered positive results and helped to underpin an overall first half performance in line with the Board’s expectations.\nReflecting the Group’s continued growth, as well as the Board’s confidence in the outlook, we are pleased to announce a 0.2p increase in the interim dividend to 2.4p.\nThe collective performance of the new stores opened from late 2017 onwards has been ahead of expectations and we have made a solid start to the second half of the year across our business segments. We have momentum to take us into the seasonally important Christmas period for jewellery retail and, underpinned by the strength of our business model and brand, the Board remains confident of delivering further progress on its strategic objectives and achieving its expectations for the year. Ramsdens chief executive Peter Kenyon (Image: Publicity Pic) 9:20 Jonathon Manning Durham City could miss out on jobs and investment amid need for new office space\nDurham City’s economy could miss out on significant investment and job numbers unless it creates new offices in the next 12 to 18 months, a leading property firm claims.\nNewcastle-based real estate firm Cushman & Wakefield says in the first half of the year it firms were on the hunt for 730,000 sq ft of office space across the North East, which could have considered Durham, with an average enquiry size of 40,000 sq ft.\nThat equates to around 6,700 jobs, a large chunk of which could be attracted to Durham.\nThe office space enquiries – which came from both the public and private sector – also doubled within six months, and in the second half of 2017 enquiries tallied up to 330,000 sq ft with occupiers seeking an average of 20,000 sq ft.\nThe organisations seeking space needed needed between 20,000sqft and 120,000 sqft – but Durham City had to be discounted as it has no office space available to meet those requirements.\nNewcastle, Middlesbrough and Darlington, meanwhile, have all increased commercial property development in recent years.\nGreg Davison, partner at Cushman & Wakefield, said:\nDurham’s global reputation as a City of significant heritage and home to one of the UK’s most highly-regarded universities, is undoubted and yet, commercially at least, it has not had the infrastructure to build on that reputation.\nThere have been a number of examples recently where occupiers have set out to seek office premises across the UK, but they will only focus on those cities that can demonstrate an available pipeline of suitable stock.\nIn most cases, they are looking on a 12-month time horizon. We have one live example at present, where the decision to locate in the region will, to a degree, be dependent on the availability of office space.\nPut simply, Durham cannot compete to attract businesses such as this to the city on the timescale they require. Given that office development tends to take 18 to 24 months to deliver, without speculative development of appropriate scale, any city without an established pipeline is going to be at a disadvantage from the word go. The Fram Well office, which will become Durham's first speculative office development in more than a decade (Image: -Newcastle Journal) 9:15 Jonathon Manning De La Rue's loss of UK passport printing contract at Gateshead triggers new strategy\nGateshead banknote printer De La Rue has revealed a strategy rethink for one its divisions after losing a key UK passport contract.\nEarlier this year the Government came under heavy fire for choosing a European firm for the contract, claiming it will save £120m during the lifetime of the 11-and-a-half-year contract.\nDe La Rue’s Gateshead facility has been manufacturing British passports from its Team Valley factory in Gateshead for the last 10 years, but from the middle of next year Gemalto will take on the contract, a move which could affect 200 North East jobs.\nThe company abandoned its appeal against the Government’s decision in April, when it emerged it has absorbed write-off costs of £3.7m following the failed bid.\nNow, as it announced half-year figures for the six months ended September 29, chief executive Martin Sutherland has announced the firm will refocus the business on specific parts of the manufacturing process for identity documents.\nDe La Rue , he said, will concentrate on separate parts of the manufacturing process such as on polymer plastics and security technology.\nHe said the company is currently in the midst of a five-year plan to transform De La Rue into a “less capital intensive, more technology led security product and services provider” in order to improve earnings. De La Rue in Gateshead (Image: MDM) 9:07 Jonathon Manning Only 5% of oil and gas firms think Brexit will have a positive effect on business\nOnly 5% of oil and gas companies think Brexit will have a positive impact on the UK Continental Shelf, according to a new survey.The industry report found half of firms anticipate that Britain leaving the EU will have no effect, while the remainder (45%) predict it will have a detrimental effect on the sector.The 29th Aberdeen & Grampian Chamber of Commerce Oil and Gas Survey found that firms have concerns about the impact and additional costs that Brexit will have on their trade and export activities, and that it could make it more difficult and expensive to do business in Europe.A number of firms stressed concerns over EU employees leaving the UK, or firms not being able to attract new staff from Europe.Almost half think that Brexit will have a negative effect on their ability to attract talent to their organisation, while almost half anticipate no impact.However, away from the Brexit issue, the study found that workforce recruitment is on the rise among oil and gas contractors in the UK Continental Shelf (UKCS) as business confidence reaches its highest level since 2013.The report, carried out by the Chamber of Commerce in partnership with the Fraser of Allander Institute and KPMG, found that 21% of firms have increased their total UK-based workforce by more than 10% in the last 12 months, with 33% anticipating this trend will continue in 2019.Looking further ahead, 34% of firms expect their headcount for contract staff to rise over the next three years.Almost two-thirds (65%) expect the level of core staff to increase and only 5% expect a fall over the same period.Moray Barber, partner at KPMG, said:\nOverall, this survey tells us that change is afoot and the direction of travel is positive, but there continue to be potential traps along the way, not least the impact of Brexit, a potential impending skills gap and environmental and climate change risk.\nWe believe the industry is alive to these challenges as we are seeing our clients develop growth strategies and scenario-planning to deal with the risks these present, as well as driving forward their technology and innovation agenda to become disruptors in their own right. An oil rig in the North Sea (Image: PA) 9:00 Jonathon Manning Holiday maker On The Beach sees profits jump 18%\nOn The Beach has said that demand for its holidays had been hit by this summer’s hot weather, but said that pre-tax profits were up by almost 18%.\nGroup revenue was up 24.5% in the year ending September 30 to £104.1m.\nChief executive Simon Cooper said:\nWhilst the consumer environment continues to be challenging, we remain confident in the resilience and flexibility of our business model.\nThe board will also continue to evaluate acquisition opportunities that will both increase scale and deliver value for shareholders.\nShares in On The Beach jumped 4.7% in early trading. (Image: PA) KEY EVENT Government accused of using NDAs to hide Brexit no-deal planning\nThe Government has been accused by the Liberal Democrats of hiding its planning for a no-deal Brexit using non-disclosure agreements (NDAs).\nThe Lib Dems claim that the use of secretive NDAs with transport companies is hampering businesses’ efforts to prepare for a no deal.\nIt comes after a report by a powerful House of Commons committee said major disruption at British ports is a “real prospect” if the UK exits the EU without an agreement.The Public Accounts Committee accused the Department for Transport of having a “complacent” approach to preparations, adding that time was running out to fix it.The report said:\nToo much consultation with business organisations has taken place under the cloak of non-disclosure agreements, and this secrecy hampers the ability of the business community at large to prepare.\nThe department’s engagement with the transport industry in developing technical notices has been covered by non-disclosure agreements and the department is unable to inform us of their scope.\nWe see these agreements as undermining transparency and hampering the spread of information to the business community at large.\nLib Dem MP Layla Moran criticised the Tories for “refusing to provide information people need” after discovering 28 NDAs have been signed between the department and its stakeholders after writing to Transport Secretary Chris Grayling.\nMs Moran, a member of the Public Accounts Committee, said:\nIt is utterly irresponsible that Conservative ministers are leaving businesses and the public in the dark about the risks of delays and chaos at British ports if we leave the EU.\nTo add insult to injury, the Department for Transport is being exceptionally secretive and has even signed 28 non-disclosure agreements with transport companies, meaning they can’t discuss the Government’s contingencies for Brexit.\nIf we see massive delays, tailbacks and lorry parks on motorways like the M20 leading to Dover, then within days we risk shortages of food and other essentials. This isn’t acceptable.\nIn his reply to Ms Moran, Mr Grayling defended the practice, saying:\nNDAs are also a common component of contractual arrangements that are used to protect commercial considerations of the parties involved or to protect sensitives around the development of Government policy.\nIt is entirely normal practice to use such agreements and they are therefore sometimes necessary for Government departments that are responsible for managing their preparations for leaving the EU. Secretary of State for Transport Chris Grayling leaves Downing Street. (Image: Getty Images) 8:45 Jonathon Manning Telford Homes reveals 'work to do' to hit profit targets amid Brexit worries\nHousebuilder Telford Homes has warned it still has “work to do” to meet its full-year profit targets and said Brexit has added further uncertainty to its ability to hit forecasts.The London-focused group said it has just under 60 house sales to achieve, of which 20 are priced above £600,000 - the price bracket that has been hardest hit by Brexit worries.While this is down from 90 homes left to sell in October, the group is concerned over buyer demand amid mounting uncertainty about Brexit.Telford said that, as sales currently stand, it is on track for profits of at least £40 million for the full year.Chief executive Jon Di-Stefano said:\nWe still have work to do in order to achieve our original target of exceeding £50m of total profit before tax for the year to 31 March 2019 and Brexit brings a certain amount of unpredictability to that.\nThe uncertainty arising from Brexit, and indeed the wider political situation, remains a concern across the sector, making it difficult to accurately predict sales rates over the coming months. Lime Quay development by Telford Homes in Poplar 8:38", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15475509;", "https://www.gazettelive.co.uk/news/teesside-news/worlds-first-clean-gas-energy-15474714", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-28T10:00:00.000+02:00", "crawled": "2018-11-28T10:53:23.030+02:00", "highlightTitle": ""}