{"organizations": [], "uuid": "343d69832d1a81a5ab54d9bb180a065f6a14124e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15466982.ece/ALTERNATES/s1200/0_may-brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-live-theresa-asks-mps-15466989", "country": "GB", "domain_rank": 21960, "title": "Brexit Live: Theresa May asks MPs to support her Brexit deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-26T16:02:00.000+02:00", "replies_count": 0, "uuid": "343d69832d1a81a5ab54d9bb180a065f6a14124e"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-live-theresa-asks-mps-15466989", "ord_in_thread": 0, "title": "Brexit Live: Theresa May asks MPs to support her Brexit deal", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "kingdom", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour chair Ian Lavery delivers his verdict 16:32 Jonathan Walker What happens if the deal is rejected?\nMPs’ rejection of Mrs May’s plan would open up several possibilities - Britain crashing out of the EU with no deal on March 29, Mrs May having to return to the EU to ask for further talks or a so-called People’s Vote that could see Brexit halted altogether.\nOn Saturday, Chancellor Philip Hammond warned that rejecting the deal would leave Britain in “uncharted territory”, while he said a no-deal Brexit would unleash “economic chaos”.\nCould another deal be struck?\nCommission President Jean-Claude Juncker led the warnings on Sunday that there could be no return to the negotiating table if the deal is rejected.\nNevertheless, a no-deal Brexit would have damaging consequences for both the UK and EU countries.\nIf talks were re-opened it would likely mean extending the Article 50 period well beyond March 29. According to reports, officials in Westminster and Brussels were continuing to work on plans for alternative arrangements. 16:31 Jonathan Walker What happens next\nThe Prime Minister confirmed on Sunday that MPs will vote on the deal - comprising the Withdrawal Agreement and the Political Declaration of future EU-UK relations - before the Christmas recess.\nAccording to reports it could take place on December 12. Mrs May said it will be one of the most significant votes that Parliament has held “for many years”.\nThe deal must get the majority support of MPs to be written into UK law. 16:22 Jonathan Walker\nDefence Secretary Gavin Williamson has dismissed suggestions the UK could join a European army.\nMr Williamson told MPs Nato remained the “cornerstone” of the UK’s defence strategy as he ruled out participating in any continental force.\nThe comments come weeks after French President Emmanuel Macron called for the creation of a “true, European army” in a bid to ensure Europe would not “become a plaything of great powers”.\nMr Williamson, speaking at Defence questions in the Commons, said: “Let’s make it absolutely clear: Britain is not going to be participating in a European army.” 16:11 Jonathan Walker\nBoris Johnson says “it is very hard to see how this deal can provide certainty to business or to anyone else” 16:07 What is plan B\nTory backbencher Anna Soubry asks “what is the Prime Minister’s plan B?”\nMay says: “We will have a number of deays of debate in this chamber, prior to the meaingful vote” on this deal.\nShe says MPs must consider the interests of their constituents and of the country.\n(She doesn’t really answer the question, perhaps unsurprisingly) 16:04 16:04 Jonathan Walker\nFormer Brexit Secretary David Davis suggests the Government should refuse to pay the second half of the £39bn the UK owes the EU until the EU gives us a trade deal.\nTheresa May says the UK is legally obliged to pay the money. 16:02 Jeremy Corbyn says Parliament must \"reject this terrible deal\"\nLabour leader Jeremy Corbyn said:\nMr Speaker, ploughing on is not stoic. It is an act of national self-harm.\nInstead of threatening this House with a no deal scenario, or no Brexit scenario, the Prime Minister now needs to prepare a Plan B - something her predecessor failed to do.\nThere is a sensible deal that could win the support of this House based on a comprehensive customs union and strong single market deal that protects rights at work and environmental safeguards.\nThe Prime Minister may have achieved agreement across 27 Heads of State, but she has lost support of the country.\nMany young people - and others - see opportunities being taken away from them.\nMany people who voted Remain voted for an outward-looking and inclusive society, and they fear this deal and the rhetoric of the Prime Minister.\nLikewise many people from areas that voted Leave feel this deal has betrayed the Brexit they voted for. It does not take back control. It will not make them better off. And it will not solve the economic deprivation that affects too many communities in Britain.\nThis deal it is not a plan for Britain’s future. So for the good of the nation this House has little choice but to reject this terrible deal. 16:01 Theresa may says \"No-one knows what would happen if this deal doesn’t pass\"\nTheresa May said:\nThere is a choice which this House will have to make.\nWe can back this deal, deliver on the vote of the referendum and move on to building a brighter future of opportunity and prosperity for all our people.\nOr this House can choose to reject this deal and go back to square one.\nBecause no-one knows what would happen if this deal doesn’t pass.\nIt would open the door to more division and more uncertainty, with all the risks that will entail.\nMr Speaker, I believe our national interest is clear. The British people want us to get on with a deal that honours the referendum and allows us to come together again as a country, whichever way we voted.\nThis is that deal. A deal that delivers for the British people. 15:59 Theresa May explains why her deal is good for the UK\nThe Prime Minister said:\nThis is the right deal for Britain because it delivers on the democratic decision of the British people.\nIt takes back control of our borders. It ends the free movement of people in full once and for all, allowing the government to introduce a new skills-based immigration system.\nIt takes back control of our laws. It ends the jurisdiction of the European Court of Justice in the UK and means instead our laws being made in our Parliaments, enforced by our courts.\nAnd it takes back control of our money. It ends the vast annual payments we send to Brussels.\nSo instead we can spend taxpayers’ money on our own priorities, including the £394 million a week of extra investment into our long-term plan for the NHS.\nBy creating a new Free Trade Area with no tariffs, fees, charges, quantitative restrictions or rules of origin checks, this deal protects jobs, including those that rely on integrated supply chains.\nIt protects our security with a close relationship on defence and on tackling crime and terrorism, which will help to keep all our people safe.\nAnd it protects the integrity of our United Kingdom, meeting our commitments in Northern Ireland and delivering for the whole UK family, including our Overseas Territories and the Crown Dependencies. 15:58 Jonathan Walker\nTory former leader Iain Duncan Smith asks about the “backstop” (Customs Union membership). This is the big issue for a lot of Conservative MPs.\nHe points out that the backstop is only meant to come into effect if the UK fails to come to an agreement with the EU about the border with Ireland.\nHe also points out that the UK doesn’t want to trigger the backstop.\nHis concern is that the EU knows we don’t want to trigger it, so they can (he fears) force us to sign up to whatever they want, in order to avoid it. 15:55 Jonathan Walker\nThe House of Commons is pretty quiet. MPs don’t seem to be in the mood for shouting. Possibly, most of them have already made their minds up - and also concluded that there aren’t any very attractive options on offer. 15:54 Jonathan Walker Theresa May replies to Jeremy Corbyn\nShe says that Labour used to say the UK should have its own trade policy - the ability to sign our own trade deals - which would be impossible under Labour’s plan to stay in a Customs Union. 15:53\nCorbyn says there is a sensible deal that could win the support of this house.\nIt would have a “strong single market deal” and a permanent Customs Union, he says. 15:50\nHe says the Prime Minister “now needs to prepare a plan B” 15:50 Jonathan Walker\n“This deal does not have the support of either side of this House or the country as a whole” says Jeremy Corbyn 15:48 Jonathan Walker\nJeremy Corbyn says the President of France has already made clear that the EU will concentrate efforts on obtaining access to British waters for fishermen.\nUnder the PM’s “botched deal”, the UK will have to agree to this if it wants a trade deal or to extend the transition deal, he says. 15:46\nJeremy Corbyn says this deal will leave Britain worse off. 15:46 Jonathan Walker\nJeremy Corbyn says even the Prime Minister’s Cabinet “can’t bring themselves” to endorse this deal. 15:44\n“This House can choose to reject this deal and go back to square one.”\n“Nobody knows what would happen if this deal doesn’t pass” 15:44 Jonathan Walker\nShe says her deal “offers a brighter future for the British people outside of the EU”.\nShe insists: “There is not a better deal available”.\nTheresa May says Parliament must debate the deal in the coming weeks. 15:42 Jonathan Walker\nTheresa May says the EU wanted to have a link between allowing the UK to trade with the EU, and the EU having access to UK fishing waters.\nShe sats they “failed” and it’s not going to happen. 15:40 Jonathan Walker\nTheresa May deals with the issue of the “backstop”. This is part of the agreement that could lead to the UK remaining part of a Customs Union with the EU.\nThe aim is to avoid a hard border between Ireland and Northern Ireland.\nShe said: “There is no alternative deal” .\n“There is no deal that comes without a backstop. And without a backstop there is no deal.” 15:35 Theresa May begins her statement\nTheresa May tells MPs her deal protects jobs and protects security.\nIt also protects the integrity of the United Kingdom.\nShe says that the UK has worked constructively with the Governments of Spain and Gibraltar to ensure Gibraltar is covered by the whole agreement. 15:24 Jonathan Walker Now everybody wants to be part of this debate\nThe leaders of multiple political parties are demanding they are also invited to any Brexit debates, after reports suggested Theresa May will challenge Jeremy Corbyn to a TV showdown on her deal.\nThe Labour leader said he would “relish a head to head” with the Prime Minister to discuss the Withdrawal Agreement she brought back from Brussels.\nBut now the SNP, the Lib Dems, the Green Party and Plaid Cymru say they should also be involved, PA reports.\nScottish First Minister Nicola Sturgeon tweeted: “I can’t speak for Jeremy Corbyn, but I’d be up for a full leaders’ debate on the ‘deal’. “So, how about it PM Theresa May?”\nAnd the SNP’s defence spokesman Stewart McDonald said his party must be included, claiming a debate between Mrs May and Mr Corbyn “would represent the worst type of Westminster carve-up”.\nHe tweeted: “Any TV debate that takes place on Brexit must include all parties represented in the UK parliament.”\nA spokesman for Downing Street refused to confirm whether Number 10 was considering such a debate.\nHe told reporters on Monday: “The Prime Minister debates the leaders of the opposition parties regularly on Brexit, and will be doing so in effect at 3.30pm today [when she makes her statement to the House of Commons].”\nIn response Liberal Democrat leader Sir Vince Cable demanded to be involved, because neither the Tories nor Labour had called for a second Brexit referendum.\nThe Greens have also said they must be be included, saying any debate “must be cross-party, featuring a diverse range of voices representing every nation, as well as every stance on this deal and our relationship with the EU”.\nAnd Plaid Cymru’s leader Adam Price tweeted: “People deserve the opportunity to hear from all the different voices on the biggest decision we will make for generations. “I’m ready to make sure Wales’s voice is heard in any TV debate.” 14:52 Jonathan Walker Jeremy Corbyn and Theresa May could go head-to-head in TV debate\nJeremy Corbyn has accepted Theresa May’s challenge to the Labour leader to debate Brexit live on national TV.\nThe Prime Minister is frantically trying to sell her deal and sees a primetime Sunday night debate as a way to persuade the public.\n“Jeremy would relish a head-to-head debate with Theresa May about her botched Brexit deal and the future of the country,” a Labour spokesman said.\nToday a spokesman for the Prime Minister refused to deny the plans.\nIf agreed the show could happen on Sunday 9 December - days before the crucial Commons vote.\nThe debate would form part of the PM’s national offensive with speeches planned on different aspects of the deal in all four nations of the country in the coming days. 14:34 Jonathan Walker Some North East Labour MPs want a second referendum\nBridget Phillipson, Labour MP for Houghton and Sunderland South, has written a piece for the New Statesman to make the case for a second referendum. And some local Labour MPs have said they agree.\nHere’s two extracts from her article:\nAgain and again, I meet people who wouldn’t dream of writing to me about their views, but who are now genuinely fearful about their jobs, and about the future for their children and our country, as the reality of Brexit draws nearer.\nSome of them voted Leave, and now regret it bitterly. Others didn’t vote in 2016, and now dearly wish they had.\nThere is one thing the Prime Minister could do to get my support, after a fashion, for her Brexit agreement.\nShe could bind acceptance of the deal to a referendum on the deal: a referendum with two options - to remain in the European Union after all; or to leave on her terms in line with the deal.\nAnd here’s how some local MPs responded: 14:28 Theresa May's statement expected this afternoon\nTheresa May is due to speak to the House of Commons around 3.30pm More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15466989;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-26T16:02:00.000+02:00", "crawled": "2018-11-26T16:28:58.001+02:00", "highlightTitle": ""}