{"organizations": [], "uuid": "1ae34236db04e8edd6d546d0d33a4e605fab16c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14902010.ece/ALTERNATES/s1200/Darlington-v-Sunderland-Pre-Season-Friendly.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/25m-bali-mumba-maybe-last-15370311", "country": "GB", "domain_rank": 21960, "title": "£2.5m for Bali Mumba? Maybe last week but Sunderland selling for that now undermines the plan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-04T15:00:00.000+02:00", "replies_count": 0, "uuid": "1ae34236db04e8edd6d546d0d33a4e605fab16c8"}, "author": "Stuart Rayner", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/25m-bali-mumba-maybe-last-15370311", "ord_in_thread": 0, "title": "£2.5m for Bali Mumba? Maybe last week but Sunderland selling for that now undermines the plan", "locations": [], "entities": {"persons": [{"name": "bali mumba", "sentiment": "negative"}, {"name": "stewart donald", "sentiment": "none"}, {"name": "mumba", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "invalid email bali mumba", "sentiment": "none"}], "locations": [{"name": "bali", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "sunderland afc", "sentiment": "none"}, {"name": "black cats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "£2.5m for Bali Mumba? Maybe last week but Sunderland selling for that now undermines the plan Bali Mumba is attracting interest from the big names but he remains part of Sunderland's long-term plan Share Bali Mumba (Image: Sunderland AFC) Get Sunderland AFC updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Bali Mumba is the latest Sunderland player to be linked with a move to predators higher up the footballing food chain. Manchester City and Chelsea are said to be scouting the 17-year-old midfielder with a view to a £2.5m bid. It is the way of footballing life, and probably always will be for the Black Cats. A key part of owner Stewart Donald's business plan for the club is to pump money into a category one academy to produce the players who can be sold off to pay for it and more. If can even get close to fulfilling the potential he has hinted at in his first few senior appearances, Mumba will eventually be one. All Sunderland should hope is that he waits until he is sufficiently formed to stop himself being swallowed up in the system of these big clubs, as the likes of Premier League champion Danny Drinkwater, World Cup semi-finalist Reuben Loftus-Cheek and too many more before them have been. But £2.5m? Give over. Plymouth 0-2 Sunderland report: Aiden McGeady's brace sends Black Cats into top two Mumba has only played 169 minutes of senior football. We are talking about potential, and nothing more. Sunderland were realistic in the summer with Joel Asoro, selling him to Swansea City for £2m. They recognised the Swedish Under-21 international had only scored three senior goals, had not yet played a full season of first-team football, would be moving to the Championship and more importantly, was about to enter the final year of his contract, at the end of which he would be free to move for only a tribunal-set nominal fee. While some supporters felt their player had been undersold, that last point made it a fair valuation. But after signing his first professional contract on Friday, Mumba is not in the same boat. He has not committed to Sunderland for three years by signing a three-year contract, he has just guaranteed that if he leaves before 2021, the Black Cats are able to negotiate a price for him. Mumba's wages no doubt reflect that he is a novice on the fringes of a third-tier side, but hopefully the club give him improved deals as he progresses, rather than simply waiting for this deal to run down. His first full day as a professional footballer was a significant milestone, thrown off the bench for his first appearance since August to try to shore up a 2-0 victory. They asked a boy to do a man's job, and he responded well. Read More Sunderland's quality at either end is allowing them to punch their weight in League One title race If Donald's model is to work, the next sale they are in full control of will be an important test case. That does not mean Josh Maja, Lynden Gooch or Denver Hume were they to move on in January, the last transfer window before their contracts expire, but the fee they charge for the next home-grown, securely-contracted talent will be taken as a benchmark. Players developed in this country are even more valuable to the elite clubs, some of whom are struggling to fill their squads with enough home-reared players to meet the regulations as they are now, never mind what they might be after Brexit. So while Sunderland will almost certainly not stand in Mumba's way if and when he sets his heart on a move to one of the big clubs, they cannot be taken for a ride on the price. And for a player of his potential in this market, £2.5m is not even close to what he is worth to the likes of Chelsea and Manchester City. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-04T15:00:00.000+02:00", "crawled": "2018-11-04T15:50:49.016+02:00", "highlightTitle": ""}