{"organizations": [], "uuid": "092a32c5b865c851574b6883ae39657a156a5df5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15035043.ece/ALTERNATES/s1200/0_FILE-Premier-League-club-Newcastle-United-have-been-put-up-for-sale-by-owner-Mike-Ashley.jpg", "site_section": "http://www.thejournal.co.uk/sport/?service=rss", "section_title": "ChronicleLive - Sport", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/premier-league-meeting-newcastle-united-15410791", "country": "GB", "domain_rank": 21960, "title": "VAR, Brexit and a new chief exec: Key Premier League issues which Newcastle will debate this week", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T20:00:00.000+02:00", "replies_count": 0, "uuid": "092a32c5b865c851574b6883ae39657a156a5df5"}, "author": "Chris Waugh", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/premier-league-meeting-newcastle-united-15410791", "ord_in_thread": 0, "title": "VAR, Brexit and a new chief exec: Key Premier League issues which Newcastle will debate this week", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "chris waugh", "sentiment": "none"}, {"name": "lee charnley", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "newcastle united fc", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "key premier league", "sentiment": "negative"}, {"name": "nufc", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "magpies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Newcastle United FC updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nWhile Newcastle United's non-internationals have been enjoying a welcome three-day break and the rest of the Magpies squad are off representing their countries around the world, the club's hierarchy are preparing themselves for an important meeting.\nOn Thursday, representatives from all 20 Premier League clubs will meet up for a shareholder meeting as they so often do during international breaks.\nYet this summit is particularly important, with a number of key issues up for debate - including potential rule changes and also the identity of who is going to govern the Premier League going forward.\nMagpies managing director Lee Charnley - or at the very least a senior NUFC representative - will be present in London for the meeting.\nHere, NUFC Writer Chris Waugh talks us through five crucial topics which will be on the agenda this week, and how they will affect Newcastle... Video Loading Click to play Tap to play The video will start in 8 Cancel Play now 1. VAR\nThe debate is certainly topical at the moment following Aleksandar Mitrovic and Charlie Austin's respective disallowed goals at the weekend - and the latter's astonishing post-game rant, too.\nThe Premier League opted against introducing the technology for Video Assistant Referees earlier in the year, but all 20 clubs promised to discuss it more extensively during future meetings.\nWhat's more, tests have taken place throughout the current season - with Newcastle's 2-1 defeat to Arsenal back in September used as part of a 'live trial' of 3pm kick-offs - as the Premier League looks to remove the mistakes in the use of VAR which have been seen in other European divisions. Read More St James' Park trialled VAR for first time during Newcastle's defeat to Arsenal - here's how it went\nOne key issue the Premier League is so keen to address is the lack of communication with fans in the stadium during a match, so it will be interesting to see if any proposals on how to deal with that are put forward.\nAlthough any rule change would not take effect until the 2019/20 campaign, a decision on whether or not to introduce VAR for next season will be debated on Thursday.\nAt least 14 of the 20 top-flight clubs must agree in order for the change to be implemented, and Newcastle's stance is unclear. Manager Rafa Benitez has suggested he is a proponent of the use of technology, but the club has never officially stated that it would vote in favour. VAR was trialled during Newcastle United's defeat to Arsenal earlier in the season (Image: Getty Images) 2. Brexit proposals\nAnother key topic up for debate will be the Football Association's proposals for the number of 'homegrown' players a 25-man Premier League squad must be composed of post-Brexit.\nEnglish football's governing body wants to restrict the number of overseas players in each 25-man Premier League squad by five, from 17 to 12.\nBenitez's Newcastle Premier League squad currently boasts 15 non-British players, meaning United would have to reduce that number by at least three in future seasons.\nNewcastle's stance on the proposals will be intriguing because, although the Magpies would need to cut three overseas players from their 25-man squad, United have been looking to recruit a greater proportion of young, British talent in recent seasons. Yet, attempting to implement such a strategy has proven problematic, given that the majority of Newcastle's recruits over the past few transfer windows - such as Martin Dubravka, Ki Sung-yueng, Yoshinori Muto, Salomon Rondon and Federico Fernandez - do not qualify as 'homegrown'. Read More How new FA proposals for the Premier League will affect who Newcastle United can sign\nInterestingly, the report also claims that the FA will look to garner support from Premier League clubs for its increase in homegrown players within squads by offering to help English top-flight teams sign foreign players more easily.\nCurrently, for non-EU players clubs must apply to the FA for a 'governing body endorsement' (GBE) in order to gain a work permit, a process which is largely dependent upon international appearances or the value of a transfer.\nHowever, the FA is seemingly willing not only to help Premier League clubs sign EU players just as seamlessly as they do now, but also make it far easier to recruit global talent.\nFull details of the FA's proposals for the make-up of Premier League squad's post-Brexit can be found here . Newcastle United could find it more difficult to sign players such as Ayoze Perez post-Brexit (Image: Getty Images) 3. A new chief executive\nThe most-pressing concern for Premier League clubs, including Newcastle, however, relates to the future governance of the organisation.\nThat is because chief executive Richard Scudamore is departing before the end of the year after two decades in the job, and his potential successor should become clearer this week.\nHis leaving do is scheduled for Wednesday evening, before his final shareholder meeting as chief executive, and Magpies MD Charnley is believed to be among those invited to the party in London.\nScudamore has seen an unprecedented rise in TV income over the past 20 years, and the Premier League has grown into the most-lucrative football division in the world during his tenure.\nWhoever takes over from Scudamore will play a key role in determining how the Premier League is governed in the future, at a time when the competitiveness of the division appears to have reached an historic low. Read More Dubravka's new coach and a key Premier League meeting: 6 things for Newcastle fans to look out for\nThe so-called 'Big Six' clubs are determined to eke out as much cash as possible, something which has split the division - with Newcastle understood to be among the clubs left angered by the change to the distribution of overseas TV rights which were agreed earlier this year.\nCharnley - or at the very least a senior representative from NUFC - will be present, and will no doubt be attempting to ensure a candidate who best serves Newcastle's interests is given a chance to succeed Scudamore.\nBBC Studios' Tim Davie and ITV's Tom Betts have been linked with the role, but it is unclear who the five-person panel tasked with finding a new chief executive - led by Chelsea chairman Bruce Beck - will recommend to shareholders as being the best successor to Scudamore.\nSeemingly a candidate with an egalitarian vision for the league, rather than someone who will side with the 'Big Six' clubs, would be the preferred choice of the Magpies. Lee Charnley (left) and Richard Scudamore (right) (Image: PA/Getty) 4. FFP\nThis week's meeting comes at a contentious time for the Premier League, with the organisation being pressured by some of its member clubs to investigate the Football Leaks allegations regarding Manchester City's expenditure and Financial Fair Play (FFP) rules.\nThere is understood to be anger among many of Man City's top-flight rivals that such an issue has been able to arise - and they are pushing for the claims to be investigated.\nClearly Man City - who deny any wrongdoing - will be keen for FFP to be discussed briefly but, with some of their fellow Premier League sides left angered by the change in the distribution of overseas TV money, it may be talked about at length. Read More Newcastle United question of the day: Do Lascelles and Shelvey deserve to get back into team if they're fit? 5. Sponsorship deals\nNike has already announced that they will continue to sponsor the Premier League through until 2025 after signing a six-year extension to the current agreement.\nHowever, Scudamore is believed to have been looking to tie up a few additional commercial agreements before he gives up his post, and there are murmurings that further sponsorship deals could be confirmed this week. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-13T20:00:00.000+02:00", "crawled": "2018-11-13T21:37:00.052+02:00", "highlightTitle": ""}