{"organizations": [], "uuid": "ef7a99e3d5bc7000d40c878633d7b6c3f5d44f82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14875844.ece/ALTERNATES/s1200/Sainsburys-staff-pay-row.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15386168", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Sainsbury's profits rise 20% ahead of crucial Christmas trading", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-08T10:05:00.000+02:00", "replies_count": 0, "uuid": "ef7a99e3d5bc7000d40c878633d7b6c3f5d44f82"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15386168", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Sainsbury's profits rise 20% ahead of crucial Christmas trading", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "civic centre", "sentiment": "none"}], "organizations": [{"name": "sainsbury", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Grand final of North East Business Executive of the Year is tonight...!\nThe annual event which shines a light on the North East’s brightest and most inspiring business leaders takes place tonight.\nMore than 400 business leaders from across the region will gather at the Civic Centre in Newcastle to see who will be crowned North East Business Executive of The Year.\nIt’s one of the biggest events in the North East business calendar, which has been run by The Journal in conjunction with our sister paper The Gazette for more than three decades, shining a light on the region’s brightest and most inspiring business leaders.\nAnd for those of you who can’t attend we’ll be running a live blog on the event this evening on the Chronicle Business page, so stay tuned!\nHere’s the shortlist in full ahead of the event. (Image: Newcastle Chronicle) Coreena Ford Concern over Brexit rises among consumers over 65, survey claims\nConcern about Brexit has risen sharply among over-65s to a level almost matching the youngest voting age group, a survey suggests.\nSome 61% of those aged over 65 say they are worried about the impact of Brexit, a 34 percentage point increase since September 2016, when Which? began recording the data. Among those aged 18 to 34, 64% say they are concerned about the consequences of Brexit, the consumer group said.\nBut Which? also found a rise among the 34 to 64 age group who say they are concerned since September 2016, an increase of 24 percentage points to the current 60%.\nMeanwhile, 68% of people in Wales now say they are worried about Brexit, up 38 percentage points since September 2016 and higher than the 62% currently recorded for London.\nLevels of worry in both the West Midlands and the East of England now stand at 63%, Which? said, up from 32% in each area in September 2016. The South East has also seen its figure almost double from 35% to 67%, the polling indicates.\nOverall, 62% of people in the UK say they are worried about the impact of Brexit, up from 39% in 2016. Concern is currently at 65% in Scotland, 63% in Northern Ireland and 61% in England, the watchdog found. The EU flag and a Union Jack (Image: PA) 8.40 Coreena Ford Developers unveil how Amazon's North East centre set to create 3,500 jobs will look\nA developer has unveiled how a massive North East logistics centre, believed to be for online retailer Amazon, will look when completed.\nThe global retailer is understood to be the business heading to Darlington, following a £120m deal agreed in summer for a 1.6msqft logistics fulfilment centre next to the A66 in Darlington which is pre-let to a “world-leading retailer”.\nNational logistics developer db symmetry secured the letting at Symmetry Park, Darlington, which is being funded by Tritax Big Box REIT, and the so-far unnamed online retail giant has taken the facility on a 20-year lease\nNow db symmetry, in partnership with landowners Durham Cathedral, has exclusively unveiled how the development will look when finished, bringing a major economic asset to the region.\nConstruction for Symmetry Park Darlington is gaining momentum with the steelwork already completed for the first phase of the £100m logistics and distribution hub. ISG Construction is main contractor for the building. How the fulfilment centre, understood to be for Amazon, will look when finished (Image: db symmetry) 8.35 KEY EVENT Blow to Cumbria power station plans as Toshiba winds up nuclear arm\nToshiba is to wind up its nuclear arm, which was leading a project to build a new power station in Cumbria.\nThe decision by the Japanese firm’s board is a huge blow to plans for a new nuclear plant at Moorside in Cumbria. Unions attacked the Government for not intervening to ensure the project went ahead.\nToshiba said its NuGen business would start being wound up in the new year.\nA statement from Tokyo said:\nAfter considering the additional costs entailed in continuing to operate NuGen, Toshiba recognises that the economically rational decision is to withdraw from the UK nuclear power plant construction project, and has resolved to take steps to wind up NuGen.\nNuGen said the announcement came after 18 months of negotiations with a range of potential new owners and said it had not been possible to successfully conclude those negotiations.\nThe site in Cumbria remains a site designated by Government for nuclear new build, and it is now for the Nuclear Decommissioning Authority as the owner of the site and the Government to determine its future.\nA Business Department spokesman said: “We understand that Toshiba have faced a difficult decision in ending their involvement in new nuclear projects outside of Japan in light of their well-known financial challenges.\n“All proposed new nuclear projects in the UK are led by private sector developers and while the Government has engaged regularly with the companies involved, this is entirely a commercial decision for Toshiba. “Nuclear has an important role to play as part of the UK’s diverse energy mix as we transition to a low-carbon economy, but in each case projects must provide value for money for consumers and taxpayers.\n“This Government remains committed to new nuclear through the Industrial Strategy Nuclear Sector Deal as well as consenting the first new nuclear power station in a generation at Hinkley Point C.” A CGI of the NuGen Moorside plan in Cumbria 8.27 Coreena Ford Trendy North East menswear firm Master Debonair to open shop in London\nA menswear retailer based in the North East is to open a London store this month ahead of plans to launch an own brand suit collection and more shops around the country.\nMaster Debonair, which was founded by husband-and-wife team Simon and Eve Whitaker two years ago, employs 25 people at its store and head office in Boldon, South Tyneside, where its private showroom, offices and distribution centre are based.\nNow it is opening a shop on London’s Commercial Street, close to Old Spitalfields Market, which will feature Master Debonair’s range of sartorial styles from three-piece suits to overcoats, footwear and accessories.\nThe opening comes as Master Debonair aims to increase turnover from its current £2m to more than £6m in 2019, with staff numbers to increase by another five in the first quarter of next year and more to follow as new stores open.\nThe company’s growth has been boosted the use of e-commerce and social media, with Master Debonair using reality TV star Pete Wicks for a recent marketing campaign, as well as having its own in-house styling and photography teams. Master Debonair menswear, Boldon (Image: publicity handout) 8.22 Coreena Ford Halford posts drop in profits\nRetailer Halfords has posted a 23% fall in pre-tax profits to £28.2m for the six months to September 28.\nOn an underlying basis, pre-tax profits dropped 17.1% to £30.5 million.\nHalfords said it continues to expect full-year profits to remain “broadly” flat, but stressed this was dependent on trading over Christmas and assuming average winter weather. “We expect the short-term conditions for discretionary spend to remain challenging,” it added.\nGraham Stapleton, chief executive of Halfords, said:\nDespite the challenging UK consumer environment, we delivered a robust sales and cash flow performance in the first half, with costs and profit broadly in line with our expectations.\nWe are making good early progress as we implement our new strategy, and we are encouraged by the initial signs.\nWe are moving to a more customer-centric approach, leveraging our expertise to provide a more differentiated shopping experience an integrated and more convenient services offer. 8.15 Coreena Ford Wooler whisky distillery takes big leap forward\nAmbitious plans to build a whisky distillery in Northumberland, creating a raft of jobs, have been submitted .\nPlans were unveiled in the summer to revitalise the former Redpath’s Yard in Wooler, transforming it into a top attraction, while also creating 50 jobs.\nThe multimillion-pound Ad Gefrin Distillery scheme is being spearheaded by the Ferguson family, owners of a number of firms, including national haulage firm Fergusons.\nThe proposals have been devised to reinvigorate the local economy, help to retain young people in its workforce and regenerate a site which has lain empty for more than two decades, while also encouraging more people to visit the North Northumberland town.\nTo mark World Town Planning Day, the plans for Ad Gefrin Distillery have been submitted to Northumberland County Council for full planning permission.\nThe family has also revealed new images showing how the site and its buildings will look when completed, having hired Brinkburn architect Richard Elphick to create designs which draw heavily on the heritage of Glendale, on the history behind the name Ad Gefrin and on whisky production.\nThe application includes details on how they will protect the seven bats currently roosting in the derelict building, making them potential stars of the completed distillery. A view of the proposed distillery, visitor centre and barrel store looking southwest from South Road (Image: Richard Elphick) 8.08", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15386168;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-08T10:05:00.000+02:00", "crawled": "2018-11-08T13:38:18.019+02:00", "highlightTitle": ""}