{"organizations": [], "uuid": "e68d08adca90ad918cdf2781538969510b7ff6cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14256135.ece/ALTERNATES/s1200/0_Sports-Direct-AGM.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15408361", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Mike Ashley takes £124m hit to his wealth as analyst slams his business plan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T10:30:00.000+02:00", "replies_count": 0, "uuid": "e68d08adca90ad918cdf2781538969510b7ff6cc"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15408361", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Mike Ashley takes £124m hit to his wealth as analyst slams his business plan", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "berenberg", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "berenberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning FirstGroup hires new boss amid widening losses and rail woes\nTransport giant FirstGroup has appointed a new chief executive as it revealed widening half-year losses and warned over earnings in its rail division.The group, behind strike-hit line South Western Railway, said interim chief operating officer Matthew Gregory had taken on the top job with immediate effect.His appointment comes after former boss Tim O’Toole resigned abruptly in May following results showing the group swung to a mammoth full-year loss.Executive chairman Wolfhart Hauser had taken over at the helm after Mr O’Toole’s departure, but will now revert back to his non-executive chairman role.Details of the change at the top came as FirstGroup reported interim pre-tax losses widening to £4.6m in the six months to September 30 from £1.9m a year earlier due to restructuring and reorganisation costs from the withdrawal of Greyhound services in Western Canada.But revenues rose 19.2% to £3.3bn and on an underlying and constant currency basis, FirstGroup saw pre-tax profits jump 63.4% to £42m, while earnings lifted 9.2% to £92.4m.FirstGroup shares rose 6% in morning trading.But FirstGroup cautioned its rail arm, which includes the South Western Railway (SWR) and Great Western Railway franchises, would see annual underlying operating profits fall year-on-year.Half-year underlying rail earnings dropped 5.8% to £29.3m.On the rail performance, FirstGroup said:\nIndustry conditions remain very challenging with macroeconomic uncertainty, infrastructure upgrade works across our networks and the industrial action in SWR all affecting our franchise performance levels.\nDue to a postponed winter timetable upgrade, the firm said it was in talks with the Department for Transport “to work through potential commercial and contractual amendments”.The group’s overall performance has been weighed down by woes at its Greyhound bus service in the US, which has been struggling amid the rising popularity of low-cost airline competition.Greyhound’s interim underlying operating profits more than halved to £10.2m from £23.5m a year ago.But the firm said its group-wide performance was “encouraging” in the first half and maintained its overall outlook for the full-year.New boss Mr Gregory said:\nOur First Rail operations continued to focus on improving services for our passengers while maintaining overall profitability in a more challenging industry environment during the period.\nWe completed our review of Greyhound and have launched a plan to optimise our smallest business for the challenges it is facing.\nHaving recently addressed our loss-making activities in Western Canada, these further actions will assist in improving Greyhound’s performance going forward.\nGerald Khoo, a transport analyst at Liberum, said there was “some evidence of progress in the figures”.But he added:\nGreyhound continued to deteriorate and the outcome of the strategic review may disappoint, with a continued focus on organic turnaround rather than anything more radical. FirstGroup CEO Tim O'Toole who has resigned 9:23 Jonathon Manning Ambrosia custard goes up for sale at Premier Foods\nPremier Foods has revealed plans to sell off its Ambrosia brand at the same time as telling investors that CEO Gavin Darby will leave in January.\nMr Darby will step down on January 31, after six years in the role. The move follows a public row with activist investor Oasis Management and comes months after he narrowly survived a shareholder rebellion against his re-election.\nThe company is also looking to sell Ambrosia and its factory in Lifton, Devon. It is looking to boost its performance ad slash its £500m debt pile.\nMr Darby said:\nThe board has determined that it should focus resources on areas of the business which have the best potential for growth through accelerated investment in consumer marketing and high return capital projects.\nAccordingly, we are pursuing options to fund these plans as well as delivering a meaningful reduction in net debt, through discussions with third parties regarding the potential disposal of our Ambrosia brand.\nHaving today announced a new strategic initiative for the business, I have decided to step down as chief executive on January 31 2019, which will mark the sixth anniversary of my joining Premier Foods. Premier Foods Jonathon Manning Gateshead's Baltic Quarter breaks ground on £13m Riga development\nGateshead Council has broken ground on a new 50,000sq ft development which is designed to provide a home for the town’s growing tech businesses.\nThe £13m Riga building will form part of the Baltic Quarter, located next to Gateshead Quays.\nThe new building forms part of the council’s plan to develop the area into an “innovation district”, where game studios and tech firms can access state-of-the-art equipment usually only available to larger companies.\nRiga will rise to a height of six stories and provide larger office spaces than its three sister buildings: the Northern Design Centre, Proto, and Baltimore House.\nIt is hoped that the building will allow companies that have grown within the Baltic Quarter to stay in the area during the scale-up phase of their lifecycle.\nGateshead council leader Coun Martin Gannon said:\nBaltic Quarter is integral to the continuing development of the wider Quayside area and the vibrant waterside regeneration programme, creating an urban destination for business, living, learning and tourism.\nThis new office block is urban in character and well-connected to Gateshead town centre, the Quays, the River Tyne and Newcastle city centre. It’s an attractive option for growing businesses and could bring around 600 new jobs to Gateshead.\nThe building has been designed by Ryder Architecture and is being offered for lease by BNP Paribas Real Estate. It is being built by Willmott Dixon and will be completed in February 2020. The £13m Riga building is being built in Gateshead's Baltic Quarter (Image: Gateshead Council) 9:10 Jonathon Manning Bigg Market micropub plans set to become 'urban retreat for beer lovers'\nA growing craft beer company has high hopes it can create a micropub in Newcastle city centre which will become a go-to “urban retreat for beer lovers”.\nBlack Storm Brewery has only been trading for around a year but it has worked hard to establish itself in the North East and beyond through several ales and trade arms.\nHeadquartered in Whitley Bay, North Tyneside, the company runs Storm Cellar, a bottle shop and tasting room in the seaside town, as well as the Beer Box shop in Newcastle’s shipping container community Stack.\nNow it hopes to expand its presence further and become part of Newcastle’s growing micropub community with a craft ale bar at 21 High Bridge, converting a former baby clothing boutique into a cosy tavern.\nThe move comes two months after Black Storm – co-founded by Paul Hughes and James Davie-Baguley – snapped up Autumn Brewing Co amid ambitious strategic plans for continued growth and expansion across the UK.\nIts signature porter was also recently voted The Best Porter in the UK by The World Beer Awards and its growing portfolio of brews is now stocked across the North in a number of venues as well as Majestic Wines. A listing with a supermarket chain is soon to be announced.\nThe micropub, which is yet to be officially named, aims to be a craft ale bar for up to 50 drinkers and the go-to craft beer hub for the Bigg Market area, specialising in showcasing new and innovative beers from the UK and around the world, alongside acting as a flagship fo its own craft beers and artisan spirits.\nDocuments sent to city planners say:\nUtilitising the cosy space to create an urban retreat for beer lovers, the bar will be relaxed and comfortable, yet edgy and distinctive. It will attract a range of ages, but it is likely that they will be slightly older than the clientele of some of the other venues on High Bridge, providing more choice for consumers in The Bigg Market.\nFrom a business perspective, the bar is a way for Black Storm to bring its portfolio to the consumer, creating growth from on and off trade. Spoilt Royalty on High Bridge Newcastle (Image: Newcastle Chronicle) 9:05 KEY EVENT New £80m investment for creative industries revealed - but North East misses out\nAn £80m investment designed to boost productivity and jobs in the UK’s creative sector has been announced - but the Newcastle and the North East has missed out on receiving the funding.\nBusinesses and academia will be combined to improve sectors such as fashion, broadcast and videos games.\nA total of nine cities will have access to the new cash, but the North East is not included. Instead funding will go to Bristol, Bath, Leeds, London, York, Cardiff, Belfast, Dundee and Edinburgh.\nBusinesses including Aardman, Sony, the British Fashion Company and Burberry will work will academics in these nationwide hubs to research ways to improve production.\nThe aim for these Creative Clusters is to make better use of digital technology and to drive down production time, while creating more jobs.\nCulture Secretary Jeremy Wright said:\nThese partnerships between business, academia and industry will encourage the use of future technology to develop new products and experiences, and boost employment opportunities across the breadth of the UK.\nBusiness Secretary Greg Clark outlined the worth of the creative industry, saying:\nThe sector currently contributes £92bn a year to our economy and through our modern Industrial Strategy we are investing further to enable the sector to keep on growing and bringing the benefits to all corners of the United Kingdom.\nThe BBC, Microsoft and Sky are among the businesses involved in the nationwide research initiative, led by the Arts and Humanities Research Council. Wallace and Gromit is made by Aardman (Image: @Aardman/W@G Ltd All rights reserved) 8:57 Jonathon Manning North East could fall further behind south after Brexit, new report warns\nThe North East will fall further behind the economy in the south after the UK leaves the European Union next year, according to a new report.\nThe UK Powerhouse report produced by law firm Irwin Mitchell and the Centre for Economics and Business Research (Cebr) said many parts of the South and East of England have increasing numbers of highly skilled jobs and are in areas benefiting from investment in transport.\nBut it highlighted concerns for the North East’s chemical industry - which supports almost 200,000 people - and said growth cities in the North did not tend to spread out into nearby towns and rural areas. The report says Newcastle is predicted to see its employment levels grow by 1.3% in the first three months after the UK’s official leave date from the EU, ranking it 14th out of 46 cities. It also believes Newcastle will outperform Middlesbrough and Sunderland, which are forecast to see employment grow by 1.1% and 0.6% respectively and highlights the potential of the £25m Biosphere development on the Helix site - formerly Science Central - to create hundreds of skills jobs.\nBut the report warns:\nWith uncertainty on how the (chemicals and plastic) sector will be governed after Brexit, businesses will be nervous in committing to additional developments. Although the Government aims to keep the current legislation in place, no exact details have been provided, causing concern that the UK will not always be in line with future EU decisions.\nIf a divergence in regulation between the UK and EU occurred post-Brexit, it would lead to future disadvantage to the domestic sector due to the lack of synchronisation. Cities such as Newcastle will be highly impacted – one of only six locations in the UK to be given Science City status, it could suffer competitively if regulation in the industry is deemed to be sub-par to the EU.\nRead more here . General view of Newcastle City Centre taken from the roof of Newcastle Civic Centre (Image: Newcastle Chronicle) 8:50", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15408361;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-13T10:30:00.000+02:00", "crawled": "2018-11-13T10:48:20.006+02:00", "highlightTitle": ""}