{"organizations": [], "uuid": "ff901bb5c06542b6e7f70367b72101f0fc07bdde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15469619.ece/ALTERNATES/s1200/0_GWR_-NJL_261118office_02.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/8m-newcastle-office-refurbishment-help-15467576", "country": "GB", "domain_rank": 21960, "title": "£8m Newcastle office refurbishment to help accountancy firm grow", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-27T02:01:00.000+02:00", "replies_count": 0, "uuid": "ff901bb5c06542b6e7f70367b72101f0fc07bdde"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/8m-newcastle-office-refurbishment-help-15467576", "ord_in_thread": 0, "title": "£8m Newcastle office refurbishment to help accountancy firm grow", "locations": [], "entities": {"persons": [{"name": "stride treglown", "sentiment": "none"}], "locations": [{"name": "ey", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "skype", "sentiment": "none"}, {"name": "st james", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business £8m Newcastle office refurbishment to help accountancy firm grow EY says new offices will help staff work more flexibly, with pool tables, stand-up desks and Skype facilities Share EY has spent £8m on a refurbishment of its Newcastle office (Image: Handout) Get business\nAccountancy giant EY has spent £8m on a refurbishment of its Newcastle office in a bid to attract more millenials and grow headcount.\nEY has 65,000 sq ft of office space across two buildings at CityGate on St James’ Boulevard to house its 600-plus North East team, and also give it space to grow by at least another 300 people in the future.\nArchitects Stride Treglown created the interior space, basing its design on images of well-known North East landmarks.\nThe refurbishment also encompasses new technologies, with an open-plan design meaning staff can choose which work space to use based on the task at hand – whether that is a team collaboration zone or a private, quiet place to focus – while some work stations also include standing desks. EY has spent £8m on a refurbishment of its Newcastle office (Image: Handout)\nThe refurbishment has come after EY’s own research into work life across different generations found that flexibility is seen as one of the most important workplace ‘perks’ among non-cash benefits, with 18% of those surveyed ranking it first.\nTechnology has also been used with traditional desktop phone handsets replaced by Skype functionality, while meetings rooms have video and audio conferencing technologies.\nThe third floor has an area for collaboration space with a pool table in the breakout area, and a seminar room that will hold up to 60 people. Read More Rural North East could face 'spiral of decline' from Brexit, report warns\nSandra Thompson, Newcastle managing partner at EY, said: “I’m so pleased about this investment in our office space - to me it means so much more. It’s a strong signal to the local market of just how important the North East is to EY as this is a region we see as having huge growth potential for us.\n“We’ve been based at CityGate for almost 17 years and, not only is the location superb, but it also now gives us the space we need to grow in a future-proofed environment. The office has been redesigned with growth in mind and we have made it as modern and inspiring as possible. It’s about enabling a different way of working. Sandra Thompson, EY's North East managing partner (Image: Handout)\n“I also see this as an investment in our people as it demonstrates the value we put in our workforce - EY is a people business so it is important that our staff feel fulfilled and appreciated at work.\n“Already I’m seeing the new office design having a positive impact, helping to bring together people from different teams and sharing their successes. Meanwhile, the pool table has just put an element of fun into working here and signals to people that it is okay to take time out. Read More Government needs to help businesses in North East after Brexit, report says\n“We have created a space that allows our people to work at their best, focusing not on where they work, but how they work.”\nThe office move is part of the EY@Work global programme, which is being rolled out across 100 locations across the globe. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-27T02:01:00.000+02:00", "crawled": "2018-11-27T02:09:54.001+02:00", "highlightTitle": ""}