{"organizations": [], "uuid": "e50bbb619c5170381039511c1822b852a22b333b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/news/business/article1287095.ece/ALTERNATES/s1200/computechJPG.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/business/being-navy-plymouth-been-best-2210369", "country": "US", "title": "Being in the navy in Plymouth has been the best start for global tech firm - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-11-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "e50bbb619c5170381039511c1822b852a22b333b"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/being-navy-plymouth-been-best-2210369", "ord_in_thread": 0, "title": "Being in the navy in Plymouth has been the best start for global tech firm - Devon Live", "locations": [], "entities": {"persons": [{"name": "garry thompson", "sentiment": "none"}, {"name": "thompson", "sentiment": "none"}], "locations": [{"name": "plymouth", "sentiment": "none"}, {"name": "states", "sentiment": "none"}, {"name": "saltash", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "computech", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon live news being", "sentiment": "none"}, {"name": "netsuite", "sentiment": "none"}, {"name": "sap", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Being in the navy in Plymouth has been the best start for global tech firm Computech is the headline sponsor of the Western Morning News Business Awards. It creates business management software that competes against large players, such as SAP, Microsoft, NetSuite, SalesForce and Sage. Share The Computech team after winning the Queen's Award Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nIt’s been a good year for Garry Thompson, boss of Saltash software development firm Computech .\nThe business has been named amongst the top export firms in this year’s Western Morning News Business Awards and that follows its recognition for its global sales with the Queen’s Award for International Trade in 2017.\nIt is a small firm with global ambitions - seven out of eight of Computech’s biggest clients are based 5,000 miles away in the United States.\nMr Thompson, said: “People ask me why have you got so much business in the States and my honest answer is that I don’t know.\n\"It’s probably down to the fact that I’m on the phone at all hours. I make myself available to those customers who are five to eight hours behind. They seem to like our product, which in itself, is quite unique, offering them capabilities which would be very difficult to find in other products in the business management software arena.” Read More The 2018 tech list - 30 amazing firms you need to know about in Devon and Cornwall\nMr Thompson, 62, says I don’t consider myself a salesman. He said: “When you know and believe in a product, your enthusiasm sells it. I know that because I originally built it to meet my needs and I just demonstrate its capabilities. I have some very clever guys who now work for me, turning my dreams into a reality and taking us forward to meet the challenges of the future.” Watch why Computech is headline sponsor of the Western Morning News Business Awards Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nAnd it is paying off for the business that has a number of clients, based on long-term relationships.\nAnd there can’t be many businesses with clients that invite their software suppliers to stay in a condo in Texas and go horse riding on the beautiful beaches of the Gulf of Mexico.\nBut it is testament to the client base that Computech has built up over the years.\nMr Thompson said: “My philosophy is to treat people as you would like to be treated yourself. I know it sounds corny, but it is absolutely true and it is a good principle to have, both in life and business.”\nOriginally born from a business building PCs, Garry hit upon software development when he started to write a package that could help manage his own business. So impressed were his clients by the software that could manage and record every stage of the business process, from prospective customer through to goods dispatch, that they started to ask for the same. Read More From gin to yachts and something ver...\nAt the time, the team were building bespoke software for all kinds of customers, from recruitment companies to large scale distributors.\nHe said: “It was around 2007, and I was just expanding, moving into new offices into Saltash and taking on more people. But then the recession hit. We finished two big projects in 2007 and then there were just little trickles of work, companies had little money and nobody was spending.”\nIf they say innovation is the brainchild of necessity then the 2008 recession was it. Rather than rely on making bespoke software for individual businesses, Garry decided to bring together all the individual elements he had developed to create one consolidated package. And then, BusinessMan was born.\nThe business management system- which, crucially, can be tweaked to suit any business - has been a massive driver of growth.\nIt competes successfully against the large players, such as SAP, Microsoft, NetSuite, SalesForce and Sage.\nFrom 2014/2015 to this year sales have grown from £400,000 to more than £900,000.\nAs part of the global expansion, Computech plans to open an office in the USA and will pursue similar ventures in the Far East and Australasia. Garry Thompson, MD at Computech\nHe said: “We are a global business and technology means that we can do business anywhere.”\nAs a headline sponsor for this year’s Western Morning News Business Awards, Mr Thompson said it is vital to celebrate the achievements of South West businesses and we should be shouting loudly about what the region has to offer. Western Morning News Business Awards 2018: The Shortlist\nBUSINESS OF THE YEAR sponsored by Computech\nThis will be awarded to a profitable, growing business that has a positive impact on the Westcountry’s economy as a whole.\nThe Cornish Bakery , Paulton\nSMALL BUSINESS OF THE YEAR sponsored by Thomas Westcott\nOpen to all organisations with no more than 50 employees, this award will recognise the small business that has maintained consistent growth and strong financial performance.\nSalcombe Distilling Co. , Salcombe\nYOUNG BUSINESS PERSON OF THE YEAR sponsored by Cornwall College Business\nThis award is open to young entrepreneurs aged 30 and under (as of November 2017) who have shown flair, resilience and wisdom beyond their years.\nKatherine George, Oh So Social , Penryn\nBecky Veater, Elixel , Plymouth\nTom Wadsworth, Bad Wolf Horizon , Helston\nCORPORATE SOCIAL RESPONSIBILITY AWARD sponsored by Foot Anstey\nBusinesses must demonstrate how they make a social, economic and environmental impact by working with communities and charitable groups, developing relationships with employees and customers and engaging in environmental protection and sustainability.\nCUSTOMER SERVICE AWARD sponsored by Optimus Performance Marketing\nThis award will be made to the company that demonstrates a commitment to continuously improving its standards of customer service.\nThe Old Vicarage , Otterton\nFAMILY BUSINESS OF THE YEAR sponsored by PKF Francis Clark\nThis will go to a business, established by a family and still run by members and operating for at least five years.\nBEST TECHNOLOGICAL OR CREATIVE BUSINESS sponsored by Vodafone\nThe judges are looking for an outstanding business from the creative and technological industry sectors.\nSponge UK , Plymouth\nBEST BUSINESS START UP sponsored by LiveWest\nJudges will be interested in the ethos and background to the business, its profitability as well as what difference it has made in its sector since it started trading and how it has overcome any challenges it has encountered.\nSwaz , Plymouth\nMANUFACTURER OF THE YEAR\nThe ‘Made in Britain’ stamp has always been a mark of quality and this award seeks to recognise the Westcountry businesses that are making great things.\nRittal , Plymouth\nCOMMUNICATION AWARD sponsored by Byron D Hobbs\nThis award will go to an organisation that has communicated effectively with its target audience (internal or external) over the past year.\nThomas Westcott Chartered Accountants , Exeter\nMICRO BUSINESS OF THE YEAR sponsored by Highwater Sails\nOur Micro Business of the Year will be a company of 2-9 people that has demonstrated strong revenue growth and a product or service of a quality that stands above competitors.\nEXPORTER OF THE YEAR\nThis award rewards an organisation that has generated substantial and sustained increases in export activity.\nThe judges will consider what makes the winning company different to their competitors, the level of export and the products or service exported.\nSt Austell Brewery , St Austell\nLIFETIME ACHIEVEMENT AWARD sponsored by Browne Jacobson\nThis award will go to the businessman or woman who, in the opinion of the judges has made a considerable, profitable and lasting contribution to a business – and the region – over a period of at least 20 years.\nThe winner of this category is nominated by the judges and will be announced on the night.\nHe said: “We should be selling that strength for the South West. There’s no longer any need for tech business or financial services to be in the capital or the South East where it is expensive to live, get to work or rent premises.”\nHe said that the region should set its sights high, to become pioneers in the green revolution of smart cities, renewables and electric cars.\nHe said: “We are never going to be an industrial heartland but the south west does have massive potential to be hosts for leaders in technology. “We have small manufacturers and the region is ideal for that but we need the infrastructure to make the best of that.\n“We lose out massively on spending per head on infrastructure compared to London and the only way to change that is devolution. We need to have the power to make the spending decisions for ourselves.”\nAnd Garry has never been one to shy away from a challenge.\nBrought up on a council estate on the Wirral, he left grammar school aged 15 to join the Royal Navy.\nAs a Chief Weapons Engineer specialising in electronics communications and radar, he was based in Plymouth and served for 17 years.\nHe said: “Being in the Royal Navy gives you a certain type of resilience because of the excellent training. Failure isn't an option. When you’re trying to fix a sonar system in the middle of the Indian ocean and the sea’s rough and you’re in compartment buried in the bowels of the ship with a sick bucket, there’s no one you can call. You have to fix this thing and that’s it. It teaches you that in life, you just have to get on with it and get the job done, that’s the only option.”\nComputech employs 26 people, mostly with skills in software development. He has employed staff from across Europe including Italy, Latvia, Spain, Portugal, France and Germany as well the United States. Read More High-tech innovation centre will be EPIC for Torbay's potential\nHis company has also taken on computer programming apprentices, who have excelled in their roles.\nMr Thompson said he voted for Brexit and believes that the UK should be able to have sovereignty.\nHe said: “People say it’s about immigration but for me it is absolutely not. I think that people who apply for jobs here and meet the skills requirements, should be able to fill a vacancy here, whether they are from the EU or anywhere else.\n\"If we have a skills shortage, we are held back in our ambitions to better ourselves and the country as a whole. I also think freedom of movement, free trade, open borders and collaboration in research and security is absolutely essential but we do have to have control of our own destiny.”\nAnd Computech has set its own business ambitions for the years ahead, with plans to grow its UK customer base and bring in more clients from the South West. Like us on Facebook", "external_links": [], "published": "2018-11-13T02:00:00.000+02:00", "crawled": "2018-11-13T15:59:39.009+02:00", "highlightTitle": ""}