{"organizations": [], "uuid": "2620834b4c7b0554454bd81e56ae22b8cc6ff760", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15045646.ece/ALTERNATES/s1200/0_Cardiff-City-v-Newcastle-United-Premier-League.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/isaac-hayden-newcastle-rafa-benitez-15411876", "country": "GB", "domain_rank": 21960, "title": "What's happening with Isaac Hayden? Rafa on midfielder - and if he wants to stay at Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T07:00:00.000+02:00", "replies_count": 0, "uuid": "2620834b4c7b0554454bd81e56ae22b8cc6ff760"}, "author": "Chris Waugh", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/isaac-hayden-newcastle-rafa-benitez-15411876", "ord_in_thread": 0, "title": "What's happening with Isaac Hayden? Rafa on midfielder - and if he wants to stay at Newcastle", "locations": [], "entities": {"persons": [{"name": "isaac hayden", "sentiment": "neutral"}, {"name": "hayden", "sentiment": "none"}, {"name": "st james", "sentiment": "none"}, {"name": "ki sung-yueng", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}, {"name": "benitez", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "united", "sentiment": "none"}, {"name": "magpies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Isaac Hayden of Newcastle United (Image: Getty Images Europe) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nIsaac Hayden has finally regained his focus and can now positively influence Newcastle United's season, believes Rafa Benitez.\nHowever, the Magpies manager admits that he is unsure whether the 23-year-old - who handed in a transfer request during the summer - now wants to remain on Tyneside long term.\nThe midfielder's personal situation - his young daughter is with her mother in Wales - led Hayden to ask Benitez if he could depart St James' Park before the start of the campaign. Read More Ki Sung-yueng's message to his Newcastle midfield rivals: 'I'm determined to keep my starting place'\nAnd, although Benitez has afforded Hayden a flexible training schedule and every opportunity to visit his young family, the United manager was unwilling to sell the former England Under-21 international during the summer.\nClearly Hayden's personal problems affected his game too and, after he was sent off for a dangerous tackle after coming on as a substitute against Cardiff City back in August, the midfielder has rarely appeared since.\nHayden made 59 league appearances for Newcastle during his first two seasons on Tyneside after joining from Arsenal during the summer of 2016, but has played just three times this term and has sometimes even been omitted from matchday squads all together.\nNewcastle have appeared short of options in defensive-midfield so far this campaign, with only Mo Diame able to operate as an out-and-out destructive force in the engine room in Hayden's absence. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nBut, although Hayden is behind Diame, Jonjo Shelvey and Ki Sung-yueng in the midfield pecking order at the moment, Benitez believes the 23-year-old is now in the right frame of mind to have a positive influence on Newcastle's season.\nOn Saturday, Hayden made only his third appearance of the season - and his first in almost two months - as he came on during the second half of Newcastle's 2-1 victory over AFC Bournemouth at St James' Park.\nAnd, given that the 14th-placed Magpies have a hectic festive fixture list coming up next month, Hayden's return to form has come at the perfect time.\n\"He is fine. At the start of the season it was all a bit confused. But he is OK,\" Benitez replied when asked about Hayden's lack of football so far this season and his current mental state. Isaac Hayden was sent off for Newcastle United at Cardiff City back in August (Image: Getty Images Europe)\n\"He played against Cardiff and got sent off, which obviously I was not expecting. After that, with Diame and Shelvey playing well, now Ki has the Premier League experience, too, so it has been difficult for him.\n\"Because of the balance of the bench, we have decisions to make all the time [about whether we have two midfielders among the substitutes], but he is fine.\n\"He was an important player for us [over the past two seasons] but, because at the beginning of the season everything was a little bit wrong, he needed to settle down.\n\"You could see against Cardiff - I'm not blaming him - but he was not focused, and I wasn't expecting it. He was sent off because, for me, he was very excited and wanted to impress. Read More VAR, Brexit and a new chief exec: Key Premier League issues which Newcastle will debate this week\n\"It was wrong for him but, if he continues to train like he has the last couple of weeks, then he will get chances to play.\"\nIt is understood that one of the reasons why Benitez was so reluctant to consider selling Hayden during the summer was that he was unconvinced United would be able to sign an adequate replacement who boasted Premier League experience.\nSuch concerns may prevent Hayden from departing in January, too - even given his lack of first-team football this season - should the Chelmsford-born midfielder push for an exit once again.\nBenitez was coy when asked whether Hayden had withdrawn his request to leave, but insisted that it was immaterial for the next two months anyway, given that the midfielder is unable to move until January at the very earliest due to the fact that we are currently outside one of the two permitted Premier League trading periods. Isaac Hayden was an integral member of Newcastle's first team during the previous two seasons (Image: Newcastle Utd via Getty Images)\n\"I was speaking to him and he is fine,\" Benitez said when he was pushed as to whether Hayden has changed his mind and now wants to stay on Tyneside.\n\"At the moment he wants to be here, I think so, but we will see in the future. It doesn't matter, anyway, because he is here [until January at the very least] - and he has to keep going.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-14T07:00:00.000+02:00", "crawled": "2018-11-14T09:55:34.018+02:00", "highlightTitle": ""}