{"organizations": [], "uuid": "65a2825fb3ad0dd09b5fe5e0de431f4b18c1e972", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15426803.ece/ALTERNATES/s1200/0_Newcastle-United-v-AFC-Bournemouth-Premier-League.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/newcastle-united-players-brexit-signed-11520350", "country": "GB", "domain_rank": 21960, "title": "The 10 EU players Newcastle United would've struggled to sign with proposed new Brexit rules", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-21T12:08:00.000+02:00", "replies_count": 0, "uuid": "65a2825fb3ad0dd09b5fe5e0de431f4b18c1e972"}, "author": "Chris Waugh", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/newcastle-united-players-brexit-signed-11520350", "ord_in_thread": 0, "title": "The 10 EU players Newcastle United would've struggled to sign with proposed new Brexit rules", "locations": [], "entities": {"persons": [{"name": "martin dubravka", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "newcastle united", "sentiment": "negative"}, {"name": "afc bournemouth", "sentiment": "none"}, {"name": "getty images) get newcastle united fc newcastle united", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle utd", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "football association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sport The 10 EU players Newcastle United would've struggled to sign with proposed new Brexit rules Newcastle United would have been unable to sign some key first-team players had the UK not been an EU member Share Newcastle United's Goalkeeper Martin Dubravka arrives for the Premier League Match between Newcastle United and AFC Bournemouth (Image: Newcastle Utd via Getty Images) Get Newcastle United FC\nNewcastle United's future recruitment plans will be affected by Brexit once new, and as-of-yet unagreed, rules on European Union imports into the Premier League are enforced.\nFive of Rafa Benitez's first-team squad would have failed to meet the eligibility criteria to work in Britain had they hailed from outside of the Bloc, meaning Newcastle would have likely been denied the chance to sign them had the United Kingdom not been an EU member at their time of arrival.\nCurrently, while EU players have the right to ply their trade anywhere across the Bloc, non-European footballers must apply to the Football Association for a 'governing body endorsement' (GBE) in order to gain a work permit, a process which is largely dependent upon international appearances, the value of a transfer, or how lucrative a contract is. Read More How new FA proposals for the Premier League will affect who Newcastle United can sign\nGoalkeeper Martin Dubravka is the most high-profile Magpie who United may been blocked from acquiring he was not an EU citizen. The 29-year-old Slovak has established himself as one of the Premier League's best goalkeepers, despite only joining United in January, but he only became an international regular during the six months before he signed for Newcastle - meaning he would have probably been denied a GBE.\nAyoze Perez, who was born in Spain and joined Newcastle from Tenerife in 2014, has never been capped at international level, meaning he does not meet the requirements. Nor has Frenchman Florian Lejeune, who was signed for £8.8million from Eibar in 2017.\nSpaniards Javier Manquillo and Joselu would also have failed to meet the requirements to work in the United Kingdom, as they would have been unable to play for Liverpool and Sunderland, or Stoke City, respectively before having joining Newcastle given that neither is an international.\nIn theory, all five players may have been given permission to join Newcastle regardless - but United would have needed to appeal to the FA for a GBE, which are granted almost arbitrarily if the automatic criteria is not met.\nThe Magpies had to follow such a process in order to acquire Japan international Yoshinori Muto from Mainz during the summer, given that he hails from outside of the EU and had not been capped frequently enough in order to automatically gain a GBE.\nAlthough Ciaran Clark and Rob Elliot play for the Republic of Ireland, both were born in England and would qualify as 'homegrown players', so their employment status would not have been affected. Newcastle United may have been unable to sign Martin Dubravka (Image: Newcastle Utd via Getty Images)\nFabian Schar, meanwhile, hails from Switzerland - and, although his nation are not an EU member, they do have a freedom-of-movement agreement with the Bloc. But, given that Schar has been an international regular for a highly-ranked team in Switzerland for the past few years, he would have been granted a work permit to ply his trade in the UK regardless of his rights as a Swiss citizen.\nWhat's more, five members of Newcastle's Under-23 squad would also have been blocked from joining the Magpies had EU freedom-of-movement rules not been in place.\nDanish striker Elias Sorensen, who has scored 15 goals already this season, is one of those players - as is Spanish winger Victor Fernandez, who has regularly trained with the first-team squad and has also featured in friendly matches. Read More Newcastle United takeover gossip: New claims Mike Ashley 'close to selling' club to US investors\nFinnish goalkeeper Otto Huuhtanen, Spanish striker Juanito and Swiss forward Yannick Toure - who was signed from Young Boys during the summer - would also have failed to meet the entry requirements.\nAlthough post-Brexit football employment regulations have yet to be agreed, the FA is pushing for an overhaul of English top-flight squads so that around half of players are 'homegrown' once the UK leaves the EU.\nEnglish football's governing body hopes to restrict the number of overseas players in each 25-man Premier League squad by either four or five, and they aim to do so by reducing the current figure of 17 to either 13 or 12. Elias Sorensen (left) would have been unable to join Newcastle (Image: Newcastle Utd via Getty Images)\nBenitez's Magpies Premier League squad currently boasts 15 non-British players - and United did not have a single England-qualified starter during the 2-1 victory over AFC Bournemouth earlier this month - meaning the Magpies would need to rebalance the make-up of their playing roster if FA proposals are adopted.\n'Homegrown' players currently include those signed from overseas who have spent three years in English or Welsh club academies by the age of 21 - but, after Brexit, Premier League sides will be unable to recruit under-18 talent from overseas. In theory, this should reduce the number of homegrown players born abroad, though overseas footballers signed aged 18 could still qualify. Read More Who Newcastle United need to buy in January transfer window - and who should leave\nInterestingly, the FA is believed to be willing to make it easier for English top-flight clubs to sign foreign players post-Brexit in exchange for support from Premier League sides for their homegrown proposal.\nSeemingly, the governing body is receptive to helping English clubs sign EU players almost as seamlessly as they do now, but also make it far easier to recruit global talent. The FA aims to do so by agreeing to grant a GBE to any player who signs a Premier League contract - regardless of nationality or experience. First-team players who Newcastle would not have been able to sign automatically:\nMartin Dubravka (Slovakia)", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-21T12:08:00.000+02:00", "crawled": "2018-11-21T15:20:10.009+02:00", "highlightTitle": ""}