{"organizations": [], "uuid": "07d3950024c44b83d33b0518e4fdb4d8266c2e15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2120377.ece/ALTERNATES/s1200/1_BBHedgesJPG.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/mp-responds-claims-wont-meet-2214110", "country": "US", "title": "MP responds to claims he won't meet with Devon County Council unless they support a People's Vote on Brexit - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "07d3950024c44b83d33b0518e4fdb4d8266c2e15"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/mp-responds-claims-wont-meet-2214110", "ord_in_thread": 0, "title": "MP responds to claims he won't meet with Devon County Council unless they support a People's Vote on Brexit - Devon Live", "locations": [], "entities": {"persons": [{"name": "cllr andrew leadbetter", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "cllr leadbetter", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "brexit cllr andrew leadbetter", "sentiment": "none"}, {"name": "daniel clark", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "people's vote", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "invalid email exeter", "sentiment": "none"}, {"name": "adult social care and health services for devon county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MP responds to claims he won't meet with Devon County Council unless they support a People's Vote on Brexit Cllr Andrew Leadbetter had asked to get to try and fix some meetings with Ben Bradshaw Share Daniel Clark Local Democracy Reporter 11:10, 13 NOV 2018 Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nExeter’s MP Ben Bradshaw has defended accusations that he refused to meet with Devon County Council unless 'they support a People's Vote on Brexit'.\nCllr Andrew Leadbetter, who is the cabinet member for Adult Social Care and Health Services for Devon County Council, had asked to get to try and fix some meetings with Mr Bradshaw in his Westminster diary to discuss adult social care and the challenges that the county council will face they set their budget in February.\nHowever, a response to Cllr Leadbetter from Ben’s parliamentary team said that: “I’m afraid that given the unfolding disaster of Brexit, including for local government finances and our public services generally, and the urgency of securing a People’s Vote, Ben is currently only scheduling meetings with organisations that are actively and publicly supporting a People’s Vote.\n“If this is Devon County Council’s policy, Ben would be happy to meet. Otherwise, he is happy to be briefed/kept up to date via email.” Cllr Andrew Leadbetter Devon's Ambrosia factory will not close after sale, bosses say\nNo debate has yet been held by Devon County Council as to whether they support a People’s Vote or not.\nCllr Leadbetter said that the response ‘flies in the face of democracy’. He added: “Our MP is refusing to see me – or discuss/help with the issues that affect his constituents. I believe that this is discriminatory. Devon County Council, and me, we help everybody, irrespective of their views or how they voted.”\nHowever Mr Bradshaw said that the email was ‘misunderstood’ by Cllr Leadbetter, he urged lobbyists to correspond in writing to him, and that if he is to come to London, he should speak to Devon Tory MPs to work out how to work together to prevent the ‘unfolding disaster’ of Brexit.\nMr Bradshaw added: \"Mr Leadbetter misunderstands my email. I regularly meet constituents to discuss and help them with their pressing personal problems. I also get several hundred requests a week from organisations, like Devon County Council, wanting to meet me to lobby me on a policy issue. I urge all of them to do so via correspondence, which saves them and me time.\n“Devon County Council lobbies me regularly, often to complain about some aspect of Government policy on which I usually agree with them. As a member of the Commons Heath and Social Care Committee I am acutely aware of the challenges our health and social care services are facing and I look forward to receiving Mr Leadbetter’s views on the matter.\n“Given the current Brexit mess is going to make the situation much, much worse, if he’s coming up to Westminster, Mr Leadbetter might like to speak to Devon’s Tory MPs, including the excellent chair of our Select Committee, Sarah Wollaston, about how we can all work together to prevent this unfolding disaster.” Read More Replacement Scillonian ferry could save Appledore shipyard and 200 jobs\nHe added that he regularly is lobbied by Devon County Council and takes note of the correspondence, including a recent letter he was copied into that was sent to Matt Hancock, the Secretary of State for Health and Social Care.\nThe letter, sent by Cllr John Hart, leader of Devon County Council, said: “I am writing following a recent discussion by my Cabinet about the lack of funding for public health in Devon.\n“It makes sense to ensure that part of the Government's new money for the NHS is invested in prevention and specifically public health within local authorities. Devon County Council has seen its Public Health Grant allocation reduce significantly since the Comprehensive Spending Review (CSR) in 2015, which was in addition to the 6.2 per cent contributing in 2014/15, resulting in the local authority having to reduce spend in key preventable areas such as childhood obesity, mental health and public health nursing.\n“As you know, Devon has one of the largest elderly populations of any county in England. The demographic pressures resulting from that on health and social care services, mean that a new, dynamic approach to healthy ageing is vital.\n“I am well aware of the good work being undertaken by local authority public health teams across the region, but it is work that is crying out for additional investment in prevention. With that additional support they could make a real impact on reducing the pressure on health and social care services.” Like us on Facebook", "external_links": [], "published": "2018-11-13T02:00:00.000+02:00", "crawled": "2018-11-13T15:59:50.012+02:00", "highlightTitle": ""}