{"organizations": [], "uuid": "cd4acda7b4c0361fb7883a36c24182252a809796", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15229277.ece/ALTERNATES/s1200/0_Euro.png", "site_section": "http://www.thejournal.co.uk/culture/?service=rss", "section_title": "ChronicleLive - What's On", "url": "https://www.chroniclelive.co.uk/whats-on/whats-on-news/brexit-what-happens-euromillions-jackpots-15470685", "country": "GB", "domain_rank": 21960, "title": "Brexit - what happens to the EuroMillions and why jackpots have got bigger", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-27T13:06:00.000+02:00", "replies_count": 0, "uuid": "cd4acda7b4c0361fb7883a36c24182252a809796"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/whats-on/whats-on-news/brexit-what-happens-euromillions-jackpots-15470685", "ord_in_thread": 0, "title": "Brexit - what happens to the EuroMillions and why jackpots have got bigger", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "matt dunhaml/pa wire", "sentiment": "none"}, {"name": "camelot", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "wales online", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now\nYou may have heard, Brexit is coming.\nThe United Kingdom's vote to leave the European Union will mean there are a lot of changes on their way.\nThere's the common market, imports, exports, immigration, emigration and fishing, to name a few.\nBut lottery players have been asking a question: will Brexit affect their right to play for huge jackpots in the EuroMillions ?\nCamelot has the answer, as reported by Wales Online . Will Brexit affect EuroMillions players? Prime Minister Theresa May holds a press conference at 10 Downing Street, London, to discuss her Brexit plans. (Image: Matt Dunhaml/PA Wire)\nBrexit should not affect Brits' right to enter the life-changing lottery.\nCamelot said: \"To put it simply, the UK’s participation in EuroMillions is based on geographical location and not affected by government decisions.\"\nYou can also still play EuroMillions if you a UK citizen living in another participating country.\nA UK citizen living in Belgium, France, Ireland, Luxembourg, Portugal, Spain or Switzerland, can still buy tickets as usual, either online or from shops.\nYou don’t have to be a citizen of a EuroMillions country to play there, but you must claim your prize in the country in which you bought your ticket. Read More Why jackpots appear to be getting bigger for UK Euromillions players Winning EuroMillions numbers\nYou may have noticed the £ jackpots getting bigger since the UK voted to Leave in 2016.\nThat's because the pound has slumped against the Euro, so the payout in pounds rises as the currency's value drops against the Euro.\nCamelot said: \"This is due to the Pound crashing against the euro as a consequence of the uncertainty over the country’s financial future after Brexit.\n\"As EuroMillions uses the Euro as its base rate of currency, jackpots must be converted into pounds and Swiss francs on the night of each draw using the current exchange rates.\n\"Should the pound be weak in comparison to the euro, the prize on offer to UK ticket holders is worth more than if the pound is strong.\" Read More\nFor example, ahead of the Brexit vote a €100m jackpot would be worth around £73.2m.\nBut in the days after the referendum result that same jackpot was worth around £80.8m.\nAs the value of both currencies can fluctuate, UK players win bigger non-jackpot prizes when the Pound is stronger.\nA Camelot spokesperson said: \"EuroMillions currently operates across nine European countries and EU membership is not a requirement – for example, EuroMillions operates in Switzerland (a non-EU country).\n\"The EuroMillions agreement is between the lottery operators in the nine countries – not the governments. Camelot is one of the founding members of EuroMillions, along with the French and Spanish lottery operators.\n\"In addition, EuroMillions currently operates successfully across three different currencies – euros, Swiss Francs and pounds here in the UK – with prizes in each country calculated using up-to-date exchange rates set on the night of that draw, once the results have been verified.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://www.walesonline.co.uk/news/wales-news/what-happens-euromillions-after-brexit-15457552"], "published": "2018-11-27T13:06:00.000+02:00", "crawled": "2018-11-27T17:09:59.000+02:00", "highlightTitle": ""}