{"organizations": [], "uuid": "ba1e03d0c5e011ee06b519e5eb96458dc5a4cd69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15483508.ece/ALTERNATES/s1200/0_JS151945561.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/northumberland-crowned-best-uk-holiday-15481892", "country": "GB", "domain_rank": 21960, "title": "Northumberland crowned best UK holiday destination after being runner-up for last four years", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-29T17:56:00.000+02:00", "replies_count": 0, "uuid": "ba1e03d0c5e011ee06b519e5eb96458dc5a4cd69"}, "author": "Jack Elsom", "url": "https://www.chroniclelive.co.uk/news/north-east-news/northumberland-crowned-best-uk-holiday-15481892", "ord_in_thread": 0, "title": "Northumberland crowned best UK holiday destination after being runner-up for last four years", "locations": [], "entities": {"persons": [{"name": "david hall", "sentiment": "none"}, {"name": "jude leitch", "sentiment": "none"}, {"name": "coun peter jackson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "northumberland county council", "sentiment": "none"}, {"name": "northumberland tourism", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nNorthumberland has finally shaken off second place to be crowned the best holiday destination in the UK.\nAfter four years of being runner-up, Northumberland edged out Cornwall and the Peak District to take the title of \"Best UK Holiday County/Destination of the Year\" at the British Travel Awards. The accolade was announced at an awards show in London last night after a three-month public vote to decide the winner.\nDuring this period Northumberland County Council and Northumberland Tourism ran a social media drive to encourage locals and visitors to vote for the county.\nFrom the beginning of September, the council led a \"VoteNLand\" Twitter campaign and created a frame from Facebook users to put on their profile pictures. Coun Cath Homer, David Hall, Coun Peter Jackson and Jude Leitch at the British Travel Awards (Image: Jude Leitch)\nCoun Peter Jackson, the leader of the council, hailed the victory as an \"amazing achievement\" and believes the award will attract more tourists to the area.\nHe said: \"Northumberland has been runner-up at these awards for the last four years, so to finally bring the Gold home is an amazing achievement for the county. Read More Rural North East could face 'spiral of decline' from Brexit, report warns\n\"We all know what a wonderful place Northumberland is to live, work, visit and do business and we are increasingly becoming the destination of choice with more than £10m visitors coming to the county in 2017, but this award will help put us firmly on the visitor map.\n\"Northumberland has so much to offer as a destination from our award-winning accommodation providers and attractions to our stunning landscape and heritage.\" View gallery\nCoun Cath Homer, cabinet member for Culture, Arts, Leisure and Tourism, added: \"This award is made all the more rewarding as it is the only travel industry accolade which is voted exclusively by the consumer.\n\"This is a really exciting time for Northumberland and this award will help us show potential visitors from across the UK and further afield just what we have to offer.\"\nThe tourism sector is 11.8% of the county's economy and brings £665m to the area. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-29T17:56:00.000+02:00", "crawled": "2018-11-29T22:06:36.002+02:00", "highlightTitle": ""}