{"organizations": [], "uuid": "be58a01acca2bcafb44501f7c9466c82869604bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2238018.ece/ALTERNATES/s1200/0_GettyImages-947691504.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/10-richest-people-leicestershire-2237904", "country": "GB", "domain_rank": 48128, "title": "These are the 10 richest people in Leicestershire", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-20T15:32:00.000+02:00", "replies_count": 0, "uuid": "be58a01acca2bcafb44501f7c9466c82869604bb"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/10-richest-people-leicestershire-2237904", "ord_in_thread": 0, "title": "These are the 10 richest people in Leicestershire", "locations": [], "entities": {"persons": [], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}], "organizations": [{"name": "leicestershire rich list", "sentiment": "negative"}, {"name": "leicestershire live", "sentiment": "none"}, {"name": "vale of belvoir", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "These are the 10 richest people in Leicestershire The 2018 Leicestershire Rich List has been published today Share This year's list is tinged with sadness Get Business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nIt’s that time of year again when Leicestershire Live draws up its list of the wealthiest people living and working within our great city and county – not to mention Rutland and the Vale of Belvoir.\nWe are always very sensitive about how we compile the figures.\nBut this is more than just a celebration of wealth for wealth’s sake – rather a celebration of the phenomenal success of our cultural and business leaders and their contributions to the world.\nIt is inevitable that money follows on from success, but you also have to bear in mind that success creates jobs and earnings, helps put roofs over people’s heads and very often supports charitable, health and educational causes along the way.\nHopefully our list reflects that broader contribution.\nIt goes without saying that the 2018 Leicestershire and Rutland Rich List – compiled, as ever by specialist business reporter Ian Strachan – is tinged with sadness.\nLeicester City’s popular and much-loved owner and chairman Vichai Srivaddhanaprabha has featured at top of the list since 2014. How we compiled the list\nA word about the rules of engagement for the 2018 Leicestershire and Rutland Rich List, writes compiler Ian Strachan.\nIn assessing who goes into the list and who stays out there is inevitably some subjectivity involved, and we can only work from publicly available information.\nWe do not have access to private bank accounts. We looked at the personal wealth, property interests, shareholdings, company valuations, asset valuations, liabilities, and other known wealth of people who either live and/or work in the county of Leicestershire, or were born or brought up here, or who have major business interests in the county.\nWe took longevity and commitment to the economic wealth of the county into account.\nBut for the tragic events of October 27 at the King Power Stadium, he would have done again.\nOf course, the football club remains in the ownership of Khun Vichai’s family and the King Power business.\nThe phenomenal success of his duty-free business has increased the family wealth again this year.\nAs for the rest of those at the top of Leicestershire’s wealth pile , there’s no need for Brexit dividends or Budget giveaways.\nThey are doing nicely, thank you.\nThe richest people have again increased their combined fortunes, which have risen by almost a billion pounds since the 2017 list. Read More High street struggles\nOnce again, construction and property led the way. And, once again, housebuilder John Bloor has been a big winner with a thumping £400 million increase in his fortune.\nRetail continues to struggle across the nation, as we have seen from the plummeting fortunes of House of Fraser and Toys R Us to name but two high street and out-of-town basket cases.\nBut Lord Wolfson’s Next chain, Tom Joule’s fashionable brand and the Smith family’s Shoe Zone have met the challenge head on, read the market well, understood changing shopping habits and successfully weathered the retail storm. Read More Leicestershire Rich List live: The 50 wealthiest people in the county for 2018\nWe have one new entry in the list, and no surprise that it’s another representative from the construction sector.\nHousebuilder Chris Beighton who, with his wife Judy, founded Westleigh in the 1980s, comes in at number 47 after selling the business to Countryside Properties earlier this year. Time Line The 10 richest people in Leicestershire 10 (10) Sir Peter Ogden £370m (2017 £370m)\nSir Peter Ogden, 70, is co-owner of Motor Sport Vision which has taken over the running of the Donington race circuit from\nKevin Wheatcroft. The new owners have announced a multi-million project to improve spectator facilities at the track.\nIn 2017, Sir Peter’s MSV – which he runs jointly with ex-Formula One driver Jonathan Palmer – struck a deal to take over the Donington circuit business and lease the Donington estate for 21 years.\nImprovements include new paddock and internal road resurfacing, modern toilet blocks, a new restaurant, bar and cafe and a new circuit office. A new grandstand for Hollywood Corner offers extended views of the circuit.\nMSV owns a portfolio of racing circuits around the country including Snetterton, Brands Hatch, Oulton Park, Bedford Autodrome and Cadwell Park. Because of their multiple circuit ownership MSV’s deal came under the scrutiny of the Competition and Markets Authority but was cleared.\nMSV turned over £54.3 million in 2017, an improvement on the previous year.\nPre-tax profits were £7.3 million.\nSir Peter co-founded Hatfield-based Computacenter in 1981 with Sir Philip Hulme. His 16.4 per cent stake in the £1.45 billion computer group is worth close to £250 million.\nAfter university, Sir Peter entered the financial services business, working for Merrill Lynch and Morgan Stanley.\nHe founded Computacenter after seeing a gap in the market, and the firm floated on the stock market in 1998.\nHe stepped down as chairman and became a non-executive director. It is one of the UK’s largest computer businesses providing services to both public and private sectors.\nThe company’s activities include an international computer service centre in Barcelona and a remote management facility and help desk in Cape Town.\nSir Peter also had a stake worth £100 million in Dealogic, a software company taken over in a £438 million deal in 2014.\nHe was born in Rochdale and attended the town’s grammar school. He won a scholarship to Durham University and achieved a doctorate in particle physics.\nHe continued his education at Harvard Business School where he studied for an MBA.\nHe is a generous philanthropist and supports educational charities. He established the Ogden Trust in 1999 to pursue his charitable interests.\nHe donated £25 million to help bright students from poor backgrounds to study at some of the country’s leading independent schools.\nAs well as supporting youngsters whose parents cannot afford private school fees, he provided sponsorship for a Government programme to raise standards in the secondary school sector.\nSir Peter is also a patron of SHINE (Support and Help in Education), a member of Westminster School Development Council and Durham University Development Council.\nHe is an honorary Fellow of the Institute of Physics.\nHe was knighted for his charitable work in the 2005 New Year Honours. 8= (8) Sir David Samworth and family £600m (£580m)\nSamworth Brothers has signed up to the UK Plastics Pact, committed to ensuring that plastics do not end up in the environment.\nThe company is one of the first chilled food businesses in the UK to sign up to the commitment and is now actively working on its plastic packaging reduction plan and increased recyclability.\nThat will be quite a task. More than half the pork pies eaten in the UK are made by Melton-based Samworth Brothers, not to mention pasties, pies and sandwiches.\nThe food supply business has opened a huge distribution hub at Oak Meadow on Leicester Distribution Park.\nThe 155,000 sq ft supply chain centre in Scudamore Lane is more than twice the size of the previous facility.\nIt includes new office facilities, warehouse, distribution centre, blast-freeze facilities and a restaurant.\nSamworth Brothers Supply Chain employs 270 drivers, has 120 articulated vehicles and more than 200 trailers, delivering pies and pasties around the country.\nMakers of the famous Ginsters pasty and Soreen fruit bread, Samworth Brothers continues to do well, with healthy sales at Leicestershire’s biggest private sector employer.\nHigh raw material prices meant that profits dipped to £25 million in 2017 but sales grew seven per cent and hit the £1 billion mark. Dividend payouts were reduced to £4.9 million.\nIn October, Samworth bought the 2 Sisters Manton Wood sandwich plant in Nottingham for an undisclosed sum. The plant employs 1,000 people.\nLast year, Samworth bought the West Cornwall Pasty Company from private equity fund Enact which bought the business out of administration.\nThe deal included West Cornwall’s 33 high street and rail station outlets and 19 franchised outlets in motorway service stations.\nThe family firm goes back to 1868 when a young George Samworth first entered the business world as a member of a consortium of Birmingham pig buyers.\nTwenty-eight years later, he set up his own business as a pig dealer in Birmingham.\nFour generations on and Samworth Brothers employs almost 9,000 people in the Midlands and Cornwall. Around 6,500 of those are in Leicestershire.\nSamworth Brothers owns the household Ginsters brand which turns out three million Cornish pasties a week from its factory in Callington, Cornwall, as well as the famous Dickinson & Morris pork pie maker – the only one left in the town of Melton Mowbray.\nIn 1986, Walker Charnwood, makers of pork pies since 1824, was also acquired.\nThe businesses and its employers are enthusiastic fund-raisers for community sports projects and charities supporting young people and the local community.\nIn 2017, the Samworth Brothers Charity Challenge raised £385,000 for good causes.\nMore than 400 Samworth employees, customers and suppliers took part in a gruelling 10-hour challenge in the Lake District.\nSince its launch in 2007, the two-yearly challenge has raised almost £2 million for charity.\nIn addition, many charities in Africa have benefited from the Samworth family charitable trust, which focuses primarily on educational projects.\nThe company is also a patron of the Prince’s Trust and supports the Prince’s Countryside Fund.\nSir David Samworth, who stepped down as chairman in 2005 but remains as life president, has been recognised for his generosity and work for charity and education.\nAlready a CBE, in 2009 he received a knighthood.\nSir David, 82, also supports three city academies: the Nottingham University Samworth Academy, the Samworth Church Academy in Mansfield and the Tudor Grange Samworth Enterprise Academy in Leicester.\nSamworth also has one of the UK’s leading food testing laboratories in Cornwall.\nSir David inherited the business from his father in 1955 and ran it with his brothers Frank and John until stepping down as chairman exactly 50 years later in 2005. 8= (9) David Wilson CBE and family £600m (£540m)\nAs the fortunes of Leicestershire housebuilder Barratt Developments grows, so does David Wilson’s fortune.\nHe sold his construction business, Wilson Bowden, to Barratt in 2007 for £720 million in cash and Barratt shares, and that shareholding is growing in value rapidly.\nMeanwhile, turnover has accelerated past the £100 million mark at David Wilson’s latest successful housebuilding operation, Davidsons Developments, which is growing its strategic land portfolio.\nRevenues to December 2017 at the house-building firm reached £129 million compared to £114.4 million in 2016. Pre-tax profits grew from £17.6 million to £18 million as house prices climbed.\nThe company sold 357 new homes in 2016, up from 280 the year before. The business has assets close to £108 million.\nThe award-winning company is involved in a house-building project at Wragley Fields in Derby as well as projects in Ibstock, Loughborough and Burton-on-Trent.\nThe company is also pumping cash into local communities to support transport and health facilities.\nThe Leicester community benefits from Mr Wilson’s wealth. The construction veteran was one of the leading donors to the University of Leicester’s £12.6 million heart research centre at Glenfield Hospital.\nHe handed over half a million pounds to help equip the Cardiovascular Research Centre.\nThe donation was made through the charitable David Wilson Foundation which was founded in 1995.\nMr Wilson received a Lifetime Achievement Award at this year’s Midlands Residential Property Awards.\nIbstock-based Davidsons has performed consistently well and is now taking advantage of the housing market uplift and higher prices.\nMr Wilson is chairman and his son James is group managing director.\nHousing developments from Davidsons include projects in Melton Mowbray, Long Eaton and Melbourne.\nDavidsons’ homes can be identified by the distinctive “rose” logo in wood or stone included in the structure.\nWilson Bowden, based in Ibstock, was formed in 1961 by David’s father Albert Wilson.\nMr Wilson, a former pupil of Ashby Boys Grammar School, joined the business after graduating from what was then Leicester Polytechnic. At that time the company had a turnover of just £1 million.\nBy 1987, Mr Wilson, 77, was running the company and floated it on the London Stock Exchange. It became one of the biggest housebuilding concerns in the country.\nHe is married with four children and lives in Leicestershire. He is Deputy Lieutenant of Leicestershire and president of the county’s cricket club.\nHe was awarded a CBE in 2011 for services to young people. 7 (6=) The Jatania Brothers £650m (£650m)\nThe four Jatania brothers co-owned toiletry brand specialist Lornamead until they disposed of it in 2012, netting £100 million for the Yardley cosmetics brand and £250 million for the rest.\nThe Jatania family arrived in Leicester from Gujurat in India, via Uganda in 1969, and have since become one of the biggest Asian business dynasties in the UK, with a London property portfolio worth well over £200 million.\nThey set up Lornamead in 1978, initially to represent cosmetic and toiletry brands in West Africa, but went on to launch their own range of toiletries and personal care products. The Lornamead portfolio grew to include such household names as Harmony hairspray, Lypsil lip balm and Vosene shampoo.\nLornamead specialised in buying “orphan” brands, which had been neglected by big multi-nationals and so could be bought at knock-down prices.\nIn just seven years, Lornamead bought up 15 companies along with their product lines.\nThe operation, based in Surrey but controlled by a Cayman Islands company, was co-owned by the Jatania brothers: Mike, 53, George, 67, Vin, 63, and Danny, 60.\nIn 2012, they sold the Yardley brand – one of the UK’s oldest and best known toiletry brands - for £100 million.\nThey had bought Yardley in 2005 for £60 million from US giant Procter & Gamble. The following year, they bought Unilever’s hair care brands Finesse and Aqua Net for £80 million.\nLornamead, which by then employed 500 people around the world, was sold in 2012 to Li & Fung, the Hong Kong-listed consumer products company in a deal worth £250 million.\nThe brothers have a London property portfolio, largely in Paddington and Regents Park. They live close to one another in the capital.\nGeorge Jatania took over the family trading company which began buying up brands in the 1990s. They also own a wine and spirit import and export business.\nThe family are Hindus and support several charities including Save the Children and the Prince’s Trust.\nMike Jatania played cricket for Leicestershire Under-13s as a wicket keeper/batsman.\nHe studied accountancy at South Bank University. 6 (5) David Ross £700m (£850m)\nA dip in the value of the company which David Ross founded, Carphone Warehouse (now Dixons Carphone), has put a dent in his net worth.\nHowever, for him 2018 will be all about the eagerly anticipated opening of the Nevill Holt Opera House at his Nevill Holt Estate near Market Harborough.\nThe 400-seat opera house – designed by Stirling Prize-winning architects Witherford Watson Mann – threw open its doors to opera festival goers in June, marked by a new production of Mozart’s most popular opera, The Marriage of Figaro.\nPlans are already underway for the 2019 Nevill Holt Opera festival, which will feature more Mozart – Cosi Fan Tutte – and Benjamin Britten’s A Midsummer Night’s Dream.\nMr Ross bought the medieval estate in 2000 and embarked on an ambitious restoration of Nevill Holt Hall which included converting part of the stable block into a temporary – now permanent – theatre.\nThe hall also includes an exhibition of contemporary British sculpture, and is home to a creative education project covering music and drama which reaches more than 300 children.\nThe Nevill Holt estate dates back to the 13th century and was home to the Nevill family until 1876 when it was bought by Edward Cunard of the shipping line. It includes historic gardens.\nOriginally from a wealthy fishing family in Grimsby, Mr Ross attended the University of Nottingham where he obtained a law degree before qualifying as a chartered accountant with Arthur Anderson and Co. He has not forgotten his alma mater and has become one of the largest donors to the university. He also sits on the University Council.\nHe was the major funder for the £40 million David Ross Sports Village on the University of Nottingham’s Park Campus, providing all of its sports teams and clubs with a wide range of new facilities.\nThe complex includes a sports hall, a 200-station fitness suite, dance studios, martial arts dojo, squash courts and sports science facilities. Passionate about education and the opportunities it offers, he set up the David Ross Foundation which supports several projects in the region and aims to help less-advantaged young people achieve their academic potential.\nThe David Ross Education Trust provides funding and expertise to more than 30 academies across the East Midlands, providing education opportunities to more than 9,000 young people.\nHe is chairman of the National Portrait Gallery and is leading its £35.5 million renovation, and concentrating on the gallery’s Inspiring People project.\nMr Ross, 53, built up the Carphone Warehouse mobile phone chain in the early 1990s with former school-friend Sir Charles Dunstone. He became the group’s chief operating officer and later deputy chairman.\nAfter it demerged its Talk Talk broadband and telecoms operation, it merged with Dixons in 2014 to form Dixons Carphone.\nMr Ross has shares in the business currently worth around £265 million. He also has a substantial property portfolio, including homes in London and Switzerland and a villa on the Caribbean island of Mustique, as well as two grouse moors in Yorkshire.\nHe has sat on the boards of several other companies including National Express, Big Yellow Group, Wembley Stadium and Trinity Mirror.\nHe has also been a member of Sport England, and the Home Office Audit Committee. His family is part of the Ross frozen food dynasty. 5 (6=) Freddie Linnett and the Murphy family £720m (£650m)\nFreddie Linnett and Hugh Murphy run Leicester development company Charles Street Buildings Group, the company behind one of the biggest regeneration projects undertaken in the city centre.\nCharles Street Buildings is one of the property companies which is changing the face of the city centre with a 650,000 sq ft £50 million regeneration of the Waterside area.\nIt is redeveloping Leicester’s former Great Central railway station, along with a nearby 19th century railway viaduct, transforming it with a 150-room boutique hotel, a 100-bed aparthotel, shops, restaurants and leisure facilities.\nCSB also owns a site earmarked for office development opposite the Highcross shopping centre and a slingshot away from the site where Richard III’s body was discovered.\nThurmaston-based Charles Street Buildings has assets approaching £660 million.\nIts asset value and profitability dropped slightly in its 2017 financial year, largely due to a “realistic and pragmatic” approach to property valuation.\nPrevious dividends have swelled the family coffers.\nFreddie Linnett, 68, is a director and one of the leading shareholders in the successful family-owned company which was started by her uncles.\nThe six-strong Murphy family, including Freddie Linnett’s uncles Hughie and Paddy Murphy, arrived in Leicester from South Armagh in 1945.\nThey established Murphy Bros, a car and commercial vehicle business where Freddie used to be secretary and tea girl.\nDuring the post-war property boom, the business moved into aggregates and transport. The transport company was sold off to the British Electric Traction Company in 1968 and the proceeds used to build up the commercial property business.\nCounty Armagh-born Freddie became a director and inherited her stake in the company on the death of her uncles in the 1990s.\nAt that time, she was the richest woman in the country behind the Queen. She married Leicester accountant Michael Linnett.\nThe chairman and chief executive of the Charles Street Buildings Group is Hugh Murphy, who is Paddy Murphy’s son and nephew of Hughie. 4 (4) Peter and Sir Roger De Haan £900m (£900m)\nPeter De Haan and his brother Sir Richard have invested nearly £75 million in the coastal town of Folkestone since they sold their Saga empire 14 years ago.\nThe brothers made their money by identifying the buying power of the grey pound.\nSaga Ltd started life as a hotel run by their father Sidney, but the wealth began to roll in when they started selling travel insurance to the elderly.\nPeter and Sir Roger (he was knighted for his charity work which he continues) inherited the company in the 1980s and built it up, exploiting the boom in travel and tourism.\nIn 2003, Peter, then Saga’s finance director, sold most of his stake to Sir\nRoger. In 2004, Sir Roger, the former chairman of Saga, sold the company in a £1.35 billion deal.\nThe brothers have gone their separate ways since Saga was sold.\nSir Roger, 69, bought Folkestone Harbour and its transformation has included a creative quarter with plans for a seafront development of up to 1,000 houses and apartments.\nSir Roger’s Creative Foundation has poured £60 million into the regeneration.\nHe also launched the Folkestone Triennial Public Arts Festival.\nMeanwhile Peter, formerly finance director at Saga, set up Opus Trust Marketing, a marketing, print and mailing business based on the Braunstone Frith Industrial Estate in Leicester.\nThe company mails out close to two million electronic documents a month on behalf of its clients who range from utilities to travel companies and retailers.\nThe company turned over more than £22 million in the year to March 2017, winning new business with E.ON, Utility Warehouse and Co-op Energy.\nPeter, 66, also has a London-based specialist wine business, importing wines and distributing them to restaurants, retailers and private customers throughout the UK. Bancroft Wines is an award-winning business based near The Shard.\nThe brothers continue to give millions to charity. The Peter De Haan Charitable Trust aims to improve the quality of life for people and communities across the UK through its work with arts, environmental and social welfare organisations, while the Roger De Haan Charitable Trust supports a wide range of community and charitable organisations. 3 (3) Will Adderley and family £1.2bn (£1.2bn)\nThe Adderley’s Syston-based homeware retail group Dunelm has seen a dip in profits which it puts down to a hit from its recent acquisition of Worldstores and other brands in the WS Group, and a slip in retail disciplines following management changes.\nDunelm posted underlying pre-tax profits of £102 million in the year to June 30, a fall of 6.7 per cent.\nHowever, like-for-like sales rose 4.2 per cent with online sales jumping by nearly 38 per cent. Revenue broke through the £1 billion level for the first time.\nDunelm bought Worldstores out of administration, and the balance sheet puts an £8.4 million hit on the acquisition.\nThe retailer leads the UK homeware market with more than 160 stores handling around 24,000 product lines.\nThe group is targeting a total of 200 stores, although its online activities are generating 20 per cent of total sales.\nWill Adderley stepped down from his role as chief executive in 2015.\nHe reverted to his previous position as deputy chairman but still takes an active role in the business.\nNick Wilkinson took over as chief executive in February.\nThe company which his parents Bill and Jean Adderley founded 39 years ago is continuing a steady stream of store openings. The firm has ambitious plans for the future, intending to increase its number of stores in the UK. The company has an impressive hi-tech energy efficient headquarters building on the Watermead Business Park. Will Adderley, 46, took over day to day control of the business from his father in 1996.\nThe decision by Mr Adderley and his parents to float Dunelm on the London Stock Exchange for £340 million seems a shrewd one.\nSince flotation in October 2006, the company has expanded rapidly.\nThe enterprise, which also includes the Dorma bedding and housewares name, began life as a curtain stall run by Bill and Jean Adderley on Leicester market.\nNow it employs more than 5,000 people and is growing by the month.\nBill and Jean opened their first Dunelm store in Churchgate, Leicester in 1984.\nTheir first superstore opened in Rotherham in 1991.\nBill Adderley, though no longer active in the management of the group, remains life president.\nHis son puts the family firm’s success down to high footfalls at its out-of-town locations and a strong management team.\nMr Adderley joined the business in 1993 after gaining a degree in industrial economics at the University of Nottingham.\nHe also has a three per cent stake in Marks & Spencer and a stake in retailer French Connection through investment firm WA Capital. 2 (2) John Bloor £1.85bn (1.45bn)\nJohn Bloor’s fortune comes from house building and motorcycles.\nAnd both are doing very well.\nBloor Investments – parent of Bloor Homes and Triumph Motorcycles – is reporting soaring profits and revenue.\nA buoyant housing market, rising values and low interest rates have resulted in growing profits to more than £185 million, and a turnover of £1.44 billion.\nHinckley-based Triumph Motorcycles is also making a contribution to the Bloor balance sheet Triumph Motorcycles made a profit despite challenging market conditions.\nThe company continues to invest heavily in new models and export performance remains strong, with production facilities and distribution networks in Brazil and India delivering an important contribution.\nThe company has a factory in Brazil as well as three factories in Thailand and one in India. Its latest modern classic is the 1,200cc Bonneville Speedmaster.\nMotorcycle sales are exceeding 60,000 units, with more than 85 per cent coming from exports including the US.\nMeasham-based Bloor Homes – established in 1969 and now one of the biggest privately-owned housebuilding groups in the UK – is building houses at a rate of nearly 3,000 a year, with its properties ranging from one-bedroom apartments to seven-bedroom luxury homes.\nThe average price is £300,000.\nThe business has been helped by the Government’s continuing help for first time buyers. New developments have gone up right across the UK.\nJohn Bloor’s son Adrian is chief executive of the housebuilder, having previously been chairman of the operation’s southern region.\nDerbyshire-born miner’s son John Bloor, a former plasterer, bought the collapsed Triumph for £150,000 in 1983 and the brand displayed the first products from its new Hinckley factory in 1990.\nHe has poured more than £80 million into rebuilding the 100 year-old brand.\nHe was awarded the OBE in 1995 for services to the motorcycle industry and holds an honorary law doctorate from Leicester University. 1 (1) The Srivaddhanaprabha family £3.5bn (2017 £2.8bn)\nVichai Srivaddhanaprabha was one of the most liked and respected owners in the Premier League, which makes his untimely and tragic death in the King Power Stadium helicopter crash last month even more difficult to come to terms with.\nHis dedication to the club and to the city of Leicester was beyond measure, and even when results on the pitch were disappointing the Foxes fans never lost faith with the popular, smiling owner who would mingle with them on match days, buying beer, pies and doughnuts.\nTributes have come from every level of football, not to mention the people of Leicester and beyond.\nThe county council HQ and City Hall were illuminated blue in remembrance and a sea of flowers was spread outside the ground. Fans flocked to sign a book of condolence in a marquee close by.\nBut his generosity was not limited to the football club.\nHe donated £2 million to the University Hospitals Leicester NHS Trust towards their proposed children’s hospital.\nTypically, he made the donation without fuss or publicity.\nHe just wanted the city to benefit from the team’s success.\nMeanwhile, the club remains in the ownership of the Srivaddhanaprabha family and the King Power business, and the prosperity and future development that comes from success will be a lasting tribute to Khun Vichai’s leadership.\nSupporters should soon be seeing the fruits of the Foxes’ Premier League title-winning season of 2015-16.\nThe club is due to start spending on improvements to the King Power Stadium, as well as a new training centre.\nThe club wants to increase capacity at the stadium by expanding one of the stands, with other developments planned.\nThe club has already been given planning permission for a £100 million training centre in Charnwood which will include 14 pitches, an indoor pitch, a show pitch and a football academy.\nThe late Leicester City owner’s Srivaddhanaprabha name was bestowed on his family in 2013 by the king of Thailand. It means “light of progressive glory”.\nVichai Srivaddhanaprabha’s son Aiyawatt, known as Top, is vice-chairman of the club.\nHis father’s Thai-based King Power International led the consortium which took sole ownership of the club in 2011, buying out Cronus Sports Management’s minority share.\nThe Srivaddhanaprabha family have taken no money out of Leicester City as part of their commitment to establishing the Foxes as a sustainable Premier League football club delivering long-term success and prosperity.\nKhun Vichai was also chairman of Belgian club OH Leuven.\nThe family’s wealth comes from tourism to Thailand from around the world.\nKing Power owns a chain of duty-free airport shops and retail stores.\nThe business began with a single duty-free shop in downtown Bangkok. It is named after Thailand’s revered late King Bhumibol Adulyadej.\nAs well as the duty-free business, the family owns a four per cent stake in Thai budget airline Nok Air.\nVichai Srivaddhanaprabha was a devout Buddhist with four children. He was a passionate polo player and was chairman of Bangkok polo club.\nHe founded the Thailand Polo Association in 1998. He was also president of the Ham Polo Club in London until 2012.\nWe want you to be able to get your news whenever and however you want it.\nAs well as our website , we have a Facebook page , a Twitter feed, @leicslive , and for a daily snapshot of the top stories, you can sign up to receive our newsletters .\nIf you prefer to use an app, we've got apps for both Android and Apple devices which can be tailored to deliver the news and sport that you're interested in.\nAnd if you download our app, you can sign up for push notifications, which means you'll get alerts about the biggest breaking news stories. ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://www.facebook.com/leicestershirelive/", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/", "https://play.google.com/store/apps/details?id=com.leicestermercury&hl=en_GB", "https://twitter.com/leicslive?lang=en"], "published": "2018-11-20T15:32:00.000+02:00", "crawled": "2018-11-20T16:17:52.013+02:00", "highlightTitle": ""}