{"organizations": [], "uuid": "725070fe0a2a111650525c05f010dc84158d42ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15389310.ece/ALTERNATES/s1200/0_GWR_-NJL_081118conf_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-entrepreneurs-urged-revitalise-15389146", "country": "GB", "domain_rank": 21960, "title": "North East entrepreneurs urged to 'revitalise' regional economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-08T17:26:00.000+02:00", "replies_count": 0, "uuid": "725070fe0a2a111650525c05f010dc84158d42ee"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-entrepreneurs-urged-revitalise-15389146", "ord_in_thread": 0, "title": "North East entrepreneurs urged to 'revitalise' regional economy", "locations": [], "entities": {"persons": [{"name": "chris hulatt", "sentiment": "none"}, {"name": "hulatt", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "wynyard hall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "entrepreneurs’ forum global entrepreneurship week", "sentiment": "none"}, {"name": "octopus group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East entrepreneurs urged to 'revitalise' regional economy Entrepreneurs' Forum conference saw speakers discuss ways to grow businesses Share Chris Hulatt, co-founder of Octopus Group, at the Entrepreneurs' Forum conference (Image: publicity handout from Recognition PR)\nEntrepreneurs in the North East have been urged to revitalise the region’s economy as the UK faces the uncertainties of Brexit.\nThe Entrepreneurs’ Forum Global Entrepreneurship Week conference at Wynyard Hall - entitled Fortune Favours the Brave - saw a range of speakers talk about how to grow businesses in the current economic and political climate.\nChris Hulatt, co-founder of investment firm Octopus Group, implored business leaders to ‘embrace, rather than fight change’ in order to grow and said they would “be the ones who are going to be the driving force of revitalising the economy.”\nMr Hulatt has overseen Octopus’ growth from an investment company which has helped put more than £8.3bn into the UK economy to a wider organisation that includes a consumer energy supply business boasting more than 400,000 customers.\nHe added: “In five years’ time, I don’t think the ‘Big Six’ energy companies will exist in their current form. These are industries that have let people down and we are determined to change the impact that people have with their investments.\n“No-one wants to sit down with their grandchildren and talk about how much money they’ve made, but what their money helped to achieve.”\nOther speakers included Bob Keiller, former chief executive of Wood Group, and Tamara Roberts, CEO of wine company Ridgeview. Read More North Shields training firm becomes biggest in UK after acquisition\nThe day’s introductory session focused on strategies to unlock businesses’ potential and growth, with a panel discussion from Nigel Mills, chairman of The Lakes Distillery, Kevin Brown, managing director of Pacifica Group, and Rob Mathieson, founder of technology firm ION Industries.\nDelegates were also given an insight from the world of sport by Mark Inglis, the first double amputee to stand on the summit of Mount Everest, who is also a Paralympic medallist.\nTees Valley Mayor Ben Houchen rounded-off the cohort of speakers, by drawing on his ongoing work to build a strong local economy across the Teesside area.\nEntrepreneurs’ Forum chairman James Robson said: “Our line-up of inspirational speakers and personalities has given our members plenty of advice and invaluable ideas that they can take inspiration from.\n“Our conferences are at the heart of stimulating effective peer-to-peer learning among our membership and 200-strong guests, who are the people creating the jobs, driving growth and strengthening our regional economy.”\nThe Entrepreneurs’ Forum was founded in the North East in 2002 to offer mentorship and other support to growing businesses. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-08T17:26:00.000+02:00", "crawled": "2018-11-09T16:11:50.042+02:00", "highlightTitle": ""}