{"organizations": [], "uuid": "c0e530d9e533478af24bb85e7a0cfc12157bb19a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15049857.ece/ALTERNATES/s1200/0_Cardiff-City-v-Newcastle-United-Premier-League.jpg", "site_section": "http://www.chroniclelive.co.uk/sport/?service=rss", "section_title": "ChronicleLive - Sport", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/isaac-hayden-newcastle-rafa-benitez-15413922", "country": "GB", "domain_rank": 21960, "title": "Isaac Hayden's curious season so far - and why want-away midfielder can still be important for Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T18:00:00.000+02:00", "replies_count": 0, "uuid": "c0e530d9e533478af24bb85e7a0cfc12157bb19a"}, "author": "Chris Waugh", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/isaac-hayden-newcastle-rafa-benitez-15413922", "ord_in_thread": 0, "title": "Isaac Hayden's curious season so far - and why want-away midfielder can still be important for Newcastle", "locations": [], "entities": {"persons": [{"name": "newcastle isaac hayden", "sentiment": "negative"}, {"name": "isaac hayden", "sentiment": "negative"}, {"name": "hayden", "sentiment": "none"}, {"name": "martin dubravka", "sentiment": "none"}, {"name": "jonjo shelvey", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}, {"name": "mo diame", "sentiment": "none"}, {"name": "benitez", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "st james", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle united fc", "sentiment": "none"}, {"name": "newcastle true", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Isaac Hayden of Newcastle United reacts after being shown a red card (Image: Getty Images Europe) Get Newcastle United FC updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nAs Rafa Benitez desperately attempted to navigate his way through what he had, at an early stage, already recognised was set to be another desperately frustrating transfer window, the Newcastle United manager was presented with an additional, entirely unexpected, problem.\nAt the height of the summer trading period - at a stage when Newcastle had only completed two signings, one of which was merely the confirmation that Martin Dubravka's loan move have been made permanent - one of Benitez's most-trusted lieutenants handed in a transfer request.\nIn two years at St James' Park, Benitez had helped transform Isaac Hayden from an unwanted midfielder at Arsenal into a Premier League regular. Read More What's happening with Isaac Hayden? Rafa on midfielder - and if he wants to stay at Newcastle\nTrue, Hayden found himself behind both Mo Diame and Jonjo Shelvey in the midfield pecking order come the end of last season, but he had also accrued 59 league appearances across two campaigns - and had developed exponentially from the raw, if talented, midfielder United signed ahead of their tilt at the Championship into a consistent top-flight performer.\nThe 23-year-old's personal situation facilitated his decision to push for a move away from Tyneside - he longed to be closer to his family, with his daughter and her mother down in Cardiff - with Hayden stressing at the time that he was grateful for the opportunity he had been given at Newcastle, and that his request was not football-related.\nBenitez - displaying the man-management skills and empathy for which he is sometimes, by former players with a grudge, not given credit for - did his utmost to help Hayden, short of allowing the midfielder to depart.\nThe midfielder was allowed leave to miss Newcastle's pre-season camp in the Republic of Ireland, he was permitted flexible training sessions and extra days off so he could travel down to Wales as often as possible, and Benitez made it clear to Hayden that the manager's door was always open if he needed any further help. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nBut, given the understandable pull of his family, Hayden still pushed for an exit. Benitez respected Hayden's decision but, with Mikel Merino having already been sold and the United manager concerned he was not going to be able to sign the other players he wanted before the end of the window, never mind another midfielder on top of that, he could not let the former England Under-21 international leave, too.\nHaving shown compassion to Hayden, privately Benitez is believed to have been angered at a later date when a potential move to Brighton and Hove Albion was touted by those close to the midfielder. Given that, geographically, Hayden would have been no better off playing on the south coast than in the North East when it came to visiting his family in Wales, it seems Benitez had suspicions that those around the midfielder - rather than the 23-year-old himself - were attempting to use his personal situation as a means to facilitate a lucrative move elsewhere.\nUnsurprisingly, though, Hayden's off-field issues affected his professional life, just as it would anyone else in any other vocation.\nSeemingly even Benitez did not comprehend quite how \"confused\", as the United manager terms it, the midfielder was when he sent Hayden on as a second-half substitute at Cardiff City. Isaac Hayden made his first Newcastle United appearance in two months on Saturday (Image: Newcastle Utd via Getty Images)\nThe decision to introduce Hayden as a makeshift right-back - a role he has covered before, but which is not his natural position - was curious, and one even Benitez now accepts he got horribly wrong.\nIn the three months which have followed, Hayden has been afforded just 106 minutes of football and only one start.\nAs a result, Newcastle had - for the first quarter of the campaign - appeared worryingly short of options in an area of the pitch where they were decidedly strong last term.\nShelvey and Diame excelled during the second half of 2017/18, but Hayden had proved to be a more-than-able deputy, while Merino had impressed early on before slipping down the pecking order. Read More VAR, Brexit and a new chief exec: Key Premier League issues which Newcastle will debate this week\nBut with Merino having departed during the summer, as well as Hayden's personal problems having prevented him from contributing as he did before, and Ki Sung-yueng having initially failed to convince Benitez he was mobile enough to start games, the Magpies seemed to have gone from feast to famine as far as midfield options were concerned.\nNeither Shelvey nor Diame had gone close to matching the magnificent levels they reached during the first half of 2018, but neither's position came under serious threat during the first three months of the campaign.\nYet suddenly, over the course of a fortnight, Newcastle appear to have depth once again in the engine room.\nKi's impressive displays during back-to-back wins over Watford and AFC Bournemouth have also coincided with an upturn in form for Diame, while Shelvey was starting to find his rhythm before his calf injury. Ki Sung-yueng has also impressed for Newcastle over the past fortnight (Image: Newcastle Utd via Getty Images)\nHayden, too, played a key cameo role in Saturday's victory over Bournemouth, even if he was merely on the pitch for 16 minutes. More pertinently, however, is the news that Benitez himself is now convinced Hayden has regained his focus and is mentally in the right frame of mind to positively contribute to United's season.\nThe 23-year-old may have been lesser-spotted so far this season, but he is someone who Benitez rates highly. In fact, the United manager still believes the midfielder can break into the England squad; and, given Gareth Southgate's apparent dislike of Shelvey, perhaps Hayden has an even better chance of doing so than his Magpies team-mate.\nBut thoughts of a Three Lions call-up are fanciful at present; if Hayden is ever to fulfil his potential, then he must get back to playing regularly for Newcastle and continuing to learn his craft under Benitez. Read More Newcastle United question of the day: Do Lascelles and Shelvey deserve to get back into team if they're fit?\nWhether Hayden still wants to depart in January or not is unclear, but Benitez now appears ready to give the midfielder greater opportunities during the hectic festive fixture list.\nSeemingly this past fortnight has not only done wonders to Newcastle's Premier League position, it has also unearthed depth in the engine room - something which will prove crucial to United's survival hopes. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-14T18:00:00.000+02:00", "crawled": "2018-11-14T19:50:06.033+02:00", "highlightTitle": ""}