{"organizations": [], "uuid": "160583e0d94887944ba1fef5ef1bbc5403725b96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14744885.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-news-transfers-live-15413199", "country": "GB", "domain_rank": 21960, "title": "Newcastle United news and transfers LIVE - Miguel Almiron latest; Will NUFC pay Scudamore bonus?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T07:00:00.000+02:00", "replies_count": 0, "uuid": "160583e0d94887944ba1fef5ef1bbc5403725b96"}, "author": "Sean McCormick", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-news-transfers-live-15413199", "ord_in_thread": 0, "title": "Newcastle United news and transfers LIVE - Miguel Almiron latest; Will NUFC pay Scudamore bonus?", "locations": [], "entities": {"persons": [{"name": "miguel almiron", "sentiment": "negative"}, {"name": "scudamore", "sentiment": "negative"}, {"name": "salomon rondon", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}], "locations": [{"name": "bournemouth", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "st james", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mark Douglas New NUFC takeover claims - how seriously should we take them?\nWe are checking out the story with NUFC sources at the moment . You can have a look at Betaville for yourself here and make your judgements about how seriously to take it. The website itself admits it hasn’t been fully checked out yet - and Ashley told players at the recent Italian meal that he did not expect the club to be sold this season (their Premier League status being under threat generally reduces the chances of a sale because of uncertainty over cash flows).\nBut we know there has been interest in United from the States recently (although that came from Peter Kenyon - who is a friend of Ashley’s) - and this website appears to have some journalistic credentials.\nWe have been here before, of course. So while we’re not getting carried away just yet, it’s worth looking at. 13:08 KEY EVENT New claims: Mike Ashley has been in the US finalising a deal for NUFC\nHere we go again. Website Betaville - run by financial journalist Ben Harrington who used to work for the Daily Telegraph covering mergers & acquisitions, private equity, hedge funds, stockmarkets and restructuring - claims Mike Ashley is close to finalising a deal to sell NUFC.\nUsual health warnings apply but here is the story :\nThis is a story that’s been going backwards and forwards for the last couple of years. And no, Betaville isn’t referring to the dreaded Brexit. It’s the potential sale of Newcastle United Football Club by its billionaire owner Mike Ashley.\nAshley, founder of London-listed retailer Sports Direct, rekinkled sale talks eighteen months or so ago and even since then buyers, such as dealmaker Amanda Staveley, have come and gone (often via the sports pages of British newspapers).\nBut now Betaville hears from usually reliable sources the maverick entrepreneur has been over in the US putting the finishing touches to a deal to sell the business to a mystery consortium of investors.\nIt’s not clear who the buyers for are but the fact that Ashley was over in America to finalize the details implies that perhaps the purchasers for the Premier League club are from that part of the world.\nIn fact, it was former Telegraph colleague and City Editor of Sky News , Mark Kleinman, who wrote a month and half ago that Peter Kenyon - former chief executive of Manchester United and Chelsea - and Rockefeller Capital Management, led by Wall Street financier Greg Fleming, were circling the club.\nThere’s more :\nHow much Ashley sells for remains to be seen but he was previously reported to want £400 million for Newcastle United.\nNow Betaville is a football fan but as an avid City and deals watcher I’m almost more intrigued by what Ashley plans to do with the cash injection from the Newcastle United sale. Remember, the statement Ashley put out on the RNS a couple months ago, accusing the City of “stabbing him and the company in the back”? Southampton v Newcastle United at St Mary's Stadium, Southampton Newcastle United Manager owner Mike Ashley (Image: Newcastle Chronicle) 13:02 Chris Waugh Our live Q&A is over...\nThat brings an end to our live Q&A - and there were some great questions, and we covered plenty of topics, so thanks for your contributions.\nWe’ll be putting all the questions and answers together into a separate article so you can read them later on today.\nOtherwise, continue following the blog for the latest Newcastle news - and we’ll have another Q&A next week. 12:59 Q: Why is Ashley back involved again?\nHerbert asks: Why is Ashley back involved again? Southampton v Newcastle United at St Mary's Stadium, Southampton Newcastle United owner Mike Ashley (Image: Newcastle Chronicle)\nAfter a 16-month hiatus from Newcastle games, Ashley has now been at seven matches in a row.\nNot only that, he has also taken Benitez and the playing squad out for a much-publicised Italian meal - while he has personally congratulated the United manager and playing squad following their back-to-back victories over the past two weekends.\nIt is curious that, after such a long spell in the wilderness, he suddenly appears to be a ‘fan’ again. And I understand fans’ scepticism regarding his return to the scene.\nMy understanding is that Charnley has been important in encouraging Ashley to return to matches and take an interest in the club again.\nIt must be stressed that Ashley has no day-to-day involvement in St James’ Park operations - he has been at games, but Charnley deals with matters the majority of the time - but the MD is trying to re-engage the owner.\nOne of the things which Charnley seems to want to achieve by bringing Ashley back on to the scene is to attempt to build more of a relationship between the owner and the manager, as well as the owner and the players.\nCordial conversations have taken place between Benitez and Ashley after the past two matches, while the owner’s presence in the dressing room after the game has certainly not been seen as a negative by players.\nWhether these burgeoning relationships lead Ashley to allow Newcastle to spend in January, and then lead him to present Benitez with terms which will convince the Spaniard to stay beyond the end of the season, are separate matters entirely.\nBut I think Ashley’s return is largely a positive. For a start he saw first hand how angered fans were a few games ago, and now the Magpies are winning again his presence has almost become accepted - as should be the norm, given that most owners attend matches at their clubs. 12:50 Chris Waugh Q: Will Rafa's contract be sorted by January?\nLuke asks: What is actually going on with Rafa and his contract? Surely it needs sorting before the January window? Rafael Benitez, Manager of Newcastle United looks at his watch during the Premier League match between Newcastle United and Brighton & Hove Albion (Image: Getty Images)\nTime is running out as far as Benitez’s contract is concerned, with the Spaniard now into the final six months of his Magpies deal.\nNewcastle managing director Lee Charnley has attempted to initiate discussions over a new contract since January - but, after more than six months of fruitless negotiations, Benitez has shelved talks over an extension under after the mid-season window.\nDespite that, Charnley is believed to have attempted to raise the issue on various occasions over the past couple of months. The MD and manager are in almost daily contact and, every now and again, Charnley has attempted to broach the subject again in recent weeks.\nThe reasons behind why Benitez is yet to sign a new deal have been well documented. It is not due to his personal demands; rather, he wants assurances over transfers - both in terms of funds and control - as well as for significant investment to be made in the Academy and training ground.\nAt the moment, the club are adamant they cannot afford to do all three things immediately. Instead, they are trying to reassure Benitez they will invest in the Academy and training ground in the medium-to-long term - once their finances, which were decimated by relegation in 2016, have been bolstered by a few years back in the Premier League - and that for now the focus should be on transfers.\nFans will probably smirk at that suggestion, given that Newcastle made a net profit during the summer, but the United hierarchy is adamant funds are available.\nBut therein lies another issue: Benitez wants to sign experienced players, while the club want to return to their over-arching model of recruiting youngsters under the age of 26.\nThese are divergent views which are no closer to being resolved - and, until Benitez is convinced the club share his ambition by investing in January, there won’t be a resolution to this before the new year. 12:42 Chris Waugh Q: How many points will NUFC get from the next two games?\nToon Polls asks: How many points do you think we’ll get from Burnley and West Ham games? NEWCASTLE UPON TYNE, ENGLAND - NOVEMBER 10: Jose Salomon Rondon of Newcastle United celebrate scoring his side's first goal during the Premier League match between Newcastle United and AFC Bournemouth at St. James Park on November 10, 2018 in Newcastle upon Tyne, United Kingdom. (Photo by Ian MacNicol/Getty Images) (Image: Getty Images)\nTwo wins in a row have lifted Newcastle from bottom of the table up to 14th, but the relegation battle remains extremely tight.\nOnly two points separate 14th from 19th, while bottom-of-the-table Fulham - who have just sacked Slavisa Jokanovic and brought in former Premier League-winning manager Claudio Ranieri - are just two further adrift.\nClearly Newcastle still need to collect points between now and the end of the year, and they have what appear to be two games they should be able to target coming up.\nI think Burnley is the sort of game which Benitez will relish; the Clarets are desperately in need of points at home, so will probably attack, meaning the Spaniard can set United up to pick them off. You only need look back to the wins over West Ham United and Stoke City away last season to see that is when Benitez is at his very best.\nAs for West Ham the week after, they are a team who blow hot and cold. But, if Newcastle can play as they did against the Hammers last season, I see no reason why United can’t win.\nIf you pushed me to predict how many points Newcastle will collect from those two games, I’ll go for four. I certainly think they must win at least one of them. 12:36 Chris Waugh Q: When will Sorensen play for the first team?\nWith the Under-21s winning again last night, there’s been plenty of questions about one player in particular: When will Elias Sorensen by given a first-team chance? Elias Fritjof Sorensen of Newcastle United (51) celebrates after he scores Newcastles second goal during for the Checkatrade Trophy Match between Grimsby Town FC and Newcastle United (Image: Newcastle Utd via Getty Images)\nWith 15 goals in 15 games for the reserve side, Sorensen is certainly in red-hot goal-scoring form - and Newcastle fans are understandably getting excited as a result.\nThe 19-year-old Dane is a forward who has a clinical eye for goal, and who offers a powerful presence, but can also run the lines.\nFor those asking me how good Sorensen is, I must admit that I have only seen him play about half-a-dozen times. Lee Ryder has seen far more of Sorensen, so he can perhaps give a better-informed verdict than myself.\nBenitez has been asked about Sorensen in recent weeks though, and he was invited to train with the first team last week.\nClearly the United manager has received positive reports on Sorensen from Under-23 coach Ben Dawson, and that’s why he wanted to take a closer look.\nBut, given Salomon Rondon’s brace at the weekend and the fact Joselu, Yoshinori Muto and Ayoze Perez can all play up front, I doubt we’ll see Sorensen play first-team games in the near future.\nHe may get a chance in the FA Cup in January if Newcastle draw lower-league opposition, but the next step for him is surely a loan move for a second half of the campaign.\nSorensen needs first-team experience before Benitez will consider giving him a chance - so fans might have to wait until pre-season perhaps for him to be given an opportunity. 12:30 Chris Waugh Q: What do you think of boycott plans?\nGemma has given me a difficult, but topical one to answer here: What do you think of boycott plans? Newcastle United fans protest Mike Ashley's ownership before the Premier League match against Arsenal. September 15, 2018 (Image: themagpiegroup.co.uk)\nOne of the most-talked-about topics relating to Newcastle at the moment is the planned boycott of the Wolverhampton Wanderers home game on Sunday, December 9.\nThe Magpie Group, having canvassed the opinion of its members, has encouraged those supporters who want to that they should follow them in failing to attend the Wolves game.\nLet me first state that the idea behind The Magpie Group - and by that I mean creating a single entity whereby fans who are fed up by Ashley’s regime and feel powerless to oppose it - is, in my view, welcome and much needed.\nAlso, as a journalist who does not pay to get into games but covers the matches as part of my job, I would never tell any fan how they should or should not support their football club.\nThe decision to boycott really is a nuclear option, and it suggests to me that some fans have had enough of Ashley and do not know how to engage with him. Any supporter who opts not to go to the game, that is their decision and I understand and respect it.\nWhat I will say is that Benitez has repeatedly called for unity and togetherness among the supporters, and I can’t see the Newcastle manager wanting fans to stay away from what will be another crucial match at St James’ Park.\nSome supporters may argue they have stayed behind him and the players for two years, but there is now little to be positive about the future.\nIt is a very thorny issue, and one which divides supporters who are torn when it comes to following the team.\nAs a media organisation, we will obviously cover the boycott - and air views of supporters on both sides of the argument. 12:20 Q: Could an upturn in form reignite takeover interest?\nNUFC 360 have, as ever, thrown a big question my way.\nHere it is: If we’re on, say 20+ points come mid December, being over half way to safety (may be a big ask, I know), do you think it will affect potential buyers in a positive manner? And by positive, I mean they might seriously considering putting in an offer? Peter Kenyon (Image: Daily Mirror)\nIt wouldn’t be a live Q&A without a takeover question now, would it?\nBefore I answer the question, I’ll just reiterate that, as things stand, Ashley remains Newcastle owner - and, although the club is still on the market, there is an expectation at St James’ Park that he will stay in situ for the “medium term” at the least.\nThere has been interest in the Magpies, however, and former Manchester United and Chelsea chief executive Peter Kenyon is attempting to put together a consortium to buy the club. Kenyon has a personal relationship with Ashley, and the Sports Direct businessman is believed to be receptive to potentially receiving an offer from him in the future.\nWhether rival interest comes along remains to be seen, but I do agree with the analysis that potential buyers are most likely to surface if, and when, Newcastle appear safe.\nI’d say 20 points by mid-December is ambitious - hopefully I’m wrong on that, but United would need to win another four matches to reach such a figure - and I would doubt any potential buyer would look to invest in the club before the January window.\nThe more perilous Newcastle’s position, the less likely I believe it is for potential investors to come forward. So the reverse is also true, in answer to your question. 12:12 Chris Waugh Q: Is Rafa still angry at the club?\nAn interesting question from Mark: Does Rafa strike you as still being angry at the club? Rafa Benitez (Image: Newcastle Utd via Getty Images)\nI won’t pretend to know Benitez’s view on everything, but his demeanour at Press conferences in recent weeks has made for interesting viewing.\nThe Spaniard has been, as ever, calm and collected for the most part. He delivers a consistent message, focuses the attention back to footballing matters no matter what the question asked is, and generally he does not raise the rhetoric outside of transfer windows.\nBut there has been almost been an anger, or the very least a frustration, masked within his responses to questions - particularly on issues where he feels he has been let down by the club.\nFor example, when a reporter put it to Benitez that Jacob Murphy was the most-expensive Newcastle had made since they were promoted, the Spaniard immediately shot back: “ But he is probably one of the cheapest in the Premier League [during that time], too.”\nThe constant reminders that he has had to sign players who were his second, third, fourth or even fifth choice also shows that Benitez remains agitated by Newcastle’s stance on matters.\nOn saying that, there is no doubt that he is enjoying his day-to-day work at Newcastle and, although contract talks have been postponed until January, there is a willingness on his part to eventually return to those discussions.\nUnderlying issues remain unresolved, but Mike Ashley’s re-emergence in recent weeks has facilitated a few cordial conversations between the pair - and hopefully that progresses further. 12:04 Q: Are Newcastle interested in Miguel Almiron?\nJosh, Luke, Paul and various others have all been asking about transfers.\nTheir question (paraphrased) is: Are Newcastle interested in signing Miguel Almiron? Gareth Bale of Real Madrid fires a shot while under pressure from Miguel Almiron of the MLS All-Stars (Image: Getty Images)\nYes would be the short answer to this question - but I wouldn’t get too excited just yet.\nThe Magpies have watched Almiron over the past two seasons or so, and have been impressed by the Paraguayan’s performances for Atlanta United - for who he has scored 18 goals in 55 appearances.\nHis agent’s revelations that he watched Newcastle’s 2-1 victory over AFC Bournemouth at the weekend has certainly intrigued supporters, but it is in his interests to try and drum up as much interest as possible.\nRafa Benitez does want to sign an attacking-midfielder in January - someone who can potentially play out wide, or in a No 10 role - but the Magpies are yet to finalise their transfer-window wishlist.\nAlmiron is one of the names floated in early discussions, but whether Newcastle pursue that interest is another matter entirely. If Arsenal’s reported interest is true, then the 24-year-old may only move for a significant fee for a start.\nFor now, I’d say Almiron is one to keep an eye on - but Newcastle could yet focus their attentions elsewhere. We’re still a little to far away from the January window for United to finalise their targets just yet. 11:59", "external_links": ["https://www.instagram.com/chroniclenufc/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15413199;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-14T07:00:00.000+02:00", "crawled": "2018-11-14T09:55:34.003+02:00", "highlightTitle": ""}