{"organizations": [], "uuid": "980f81f51b71fb74e9a8e11079c8a70f79f0bb47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article2226453.ece/ALTERNATES/s1200/0_GREgroup.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/engineering-girls-gre-devon-one-2226415", "country": "GB", "title": "Engineering is for girls and GRE in Devon has one of the best", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-16T12:38:00.000+02:00", "replies_count": 0, "uuid": "980f81f51b71fb74e9a8e11079c8a70f79f0bb47"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/engineering-girls-gre-devon-one-2226415", "ord_in_thread": 0, "title": "Engineering is for girls and GRE in Devon has one of the best", "locations": [], "entities": {"persons": [{"name": "natalie martin", "sentiment": "none"}, {"name": "natalie", "sentiment": "none"}, {"name": "hannah finch", "sentiment": "none"}, {"name": "richard booth", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "willand", "sentiment": "none"}], "organizations": [{"name": "gre", "sentiment": "none"}, {"name": "invalid email", "sentiment": "none"}, {"name": "share get daily", "sentiment": "none"}, {"name": "plymouth university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Engineering is for girls and GRE in Devon has one of the best Natalie Martin, 26, studied for her MSc while working full-time as lead engineer at the Willand firm Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nI’m asking myself, would I be driving all the way to mid Devon to meet Natalie Martin if she was a man?, writes Hannah Finch\nThe 26-year old Plymouth University graduate is a lead engineer at GRE in Willand, a company that makes super specialised systems that to cool down machines that do things like replicate space or the heat of the sun.\nAnd the fact that she’s a young woman shouldn’t be an issue, said her boss Richard Booth.\nHe said: “It doesn’t make any difference to me at all. To me, why are we even talking about it. It’s not relevant.”\nAnd yet, the lack of women in engineering is very much a talking point.\nThe UK has Europe’s lowest proportion of female engineering professionals (11%).\nAnd the figure is so alarming that Natalie has explored the topic for her MSc Engineering Management dissertation ‘Who Wants\nTo Be An Engineer?’. Natalie Martin, lead engineer at GRE in Willand\nHer research looks at the experiences of women in engineering, what got then there in the first place and how to support and retain more young women in fulfilling STEM careers.\nShe said: “I have never had anyone say ‘what are you doing here, in fact, the comments I have had is that it is nice to see a young woman in engineering. Read More These are the 25 best Plymouth firms to work for - ranked\n“Most of my experiences have been positive but having surveyed women for my research, they have shared some horror stories, whether that’s coming up against it with managers to inflexibility with working hours. The onus is still on women to care for children and family though that is changing a bit now and employers are becoming more mindful that not everyone can fall into the 9-5.”\nUnsure of what to study, it was a female physics teacher that encouraged her to pursue her talent for maths, physics and art with the aid of the Engineering Development Trust.\nShe went on to study mechanical engineering at the University of Plymouth with a work placement at Siemans in Poole. Natalie was one of two girls standing at the end of her degree.\nAnd part of the trouble is most people don’t have a clue what engineering is.\n“And that’s across the board, not just girls. There’s the stereotype that it’s dirty work that you have to have a hard hat for.\n“But you need engineers for so many things, like making food, fashion, the oil industry, cars...\n“If you ask children what they want to do, they will say a teacher or policeman because they are jobs they come across everyday or see on TV but you never really see what an engineer does.” Read More Fact checking claims that Brexit is to blame for upheaval of three of Devon's biggest brands\nAnd its fair to say that the workload for GRE Ltd is pretty niche. It solves challenging heating and cooling problems for prestigious customers around the world including blue chip companies and scientific institutes.\nProjects have included the design and manufacture of a cooling system for a machine that whizzes plasma around, reaching temperatures of 100million degrees C - ten times hotter than the sun - for a world-leading pioneer in atomic energy research.\nGRE’s cooling system for this piece of kit involves firing helium and hydrogen into the plasma at minus 268.15 degrees C.\nOn the other end of the scale, GRE has worked on a cryogenic project to create an atmosphere of minus 196degrees centigrade to simulate the conditions of outer space to test things like space suits, spacecraft parts and satellites.\nThey work for pioneering science projects based around high powered lasers, nuclear fusion, satellite development and advanced radiotherapy, all of which need to cool down super hot processes or the creation of extra cold conditions.\nNatalie develops the projects from initial quotation to drawing up the specification, design, manufacture and quality testing. Natalie &amp; Kelvin have just returned from a trip visiting #ESS in Sweden. We have already completed a unit which we saw in situe and discussed the new units we are currently designing here in the #UK . Check them out in the 537 metre long ESS Accelerator tunnel! pic.twitter.com/lzTn2x6hC0 &mdash; GRE (@GRELTD_UK) 30 October 2018\nOne of GRE’s biggest projects to date has been the export of a £1million customised cooling system to South Korea. The bespoke system will help to manage the efficient distribution of power to millions of households for one of South Korea’s largest smart energy producers.\nFounded in 2011 on a shoe string, Richard Booth and fellow director Gary Kingdon worked the business up from nothing now employing 23 staff with a global client list. Read More\nRichard recalled how in the early days, he worried about spending £120 on a power tool in the beginning but has seen the business grow in expertise and confidence.\nIt has worked with prestigious clients around the world including Siemens, National Grid, and GE.\nThe firm’s ability to solve complex challenges has put GRE in great demand and further expansion is anticipated in line with its growing order book.\nRichard said: “I don’t want to be a millionaire, I just like seeing people like Natalie coming through th business and you can see it in their eyes, they are loving what they do and they get to go to some cool places.\n“That’s the legacy, bringing on the next generation to eventually hand the keys to.” Read More ", "external_links": ["https://twitter.com/GRELTD_UK/status/1057217819052568576?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/UK?src=hash&%3Bref_src=twsrc%5Etfw", "https://twitter.com/hashtag/ESS?src=hash&%3Bref_src=twsrc%5Etfw", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://t.co/lzTn2x6hC0"], "published": "2018-11-16T12:38:00.000+02:00", "crawled": "2018-11-16T12:48:32.012+02:00", "highlightTitle": ""}