{"organizations": [], "uuid": "88050d84a13f336387f64c565dcc44c596aac9dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14473827.ece/ALTERNATES/s1200/1_JS146890067.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/anne-marie-trevelyan-accused-abandoning-15422134", "country": "GB", "domain_rank": 21960, "title": "Anne-Marie Trevelyan accused of \"abandoning\" constituency as she quits Government post over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T20:21:00.000+02:00", "replies_count": 0, "uuid": "88050d84a13f336387f64c565dcc44c596aac9dd"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/anne-marie-trevelyan-accused-abandoning-15422134", "ord_in_thread": 0, "title": "Anne-Marie Trevelyan accused of \"abandoning\" constituency as she quits Government post over Brexit", "locations": [], "entities": {"persons": [{"name": "anne-marie trevelyan", "sentiment": "negative"}, {"name": "mrs trevelyan", "sentiment": "none"}, {"name": "dominic raab", "sentiment": "none"}, {"name": "esther mcvey", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "department for education", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA Northumberland MP who left her post in the Government over Brexit has been accused of putting \"Westminster games\" above local interests.\nBerwick MP Anne-Marie Trevelyan has resigned her post as a parliamentary private secretary in the Department for Education, saying she \"cannot support\" Theresa May's withdrawal agreement with the EU.\nLeave campaigner Mrs Trevelyan joins a host of Tory MPs, including Brexit Secretary Dominic Raab and Work and Pensions Secretary Esther McVey, who have left their positions in Mrs May's cabinet over the draft deal, which was released on Wednesday night.\nIn a letter to Prime Minister Theresa May on Thursday, Mrs Trevelyan said the deal was evidence of an attempt to \"appease the EU\".\nShe added: \"I believe we must protect the Brexit mandate by trying to secure a deal which understands the spirit of the referendum, or we must have the leadership courage to deliver a [World Trade Organisation] deal and work on a trade agreement later.\" Prime Minister Theresa May (L) walks with Conservative party candidate for Berwick-upon-Tweed, Anne-Marie Trevelyan at an airfield in Northumberland (Image: Getty Images Europe)\nShe took aim in particular at details of how fishing access and quotas would work under the deal, saying the UK would not be independent in its fishing policy after Brexit.\nShe also said she \"cannot support the position the EU takes\" on Northern Ireland, which \"poses a real threat to the integrity and stability of the Union\".\nShe argued the controversial \"backstop\" built in to the deal (which is designed to protect the Good Friday agreement in the event of no deal, but which some argue risks \"trapping\" the UK in a customs union with the EU) would \"restrict forever our trade prospects\".\nBut Liberal Democrat activists in her Northumberland constituency hit out as Mrs Trevelyan for the move, saying she could have done more good for North Northumberland residents had she stayed in her Department for Education post. Read More What is the Brexit 'backstop' how will it affect Northern Ireland and what has been decided?\nA spokesperson for the Berwick party group said: \"The Liberal Democrats in Berwick-Upon-Tweed believe Anne-Marie Trevelyan’s decision to resign from Government will achieve absolutely nothing, other than providing yet more evidence that our MP is putting Westminster games ahead of her own constituency.\n\"At a time when schools across North Northumberland are facing funding shortfalls, and Berwick Academy is in special measures , our MP had a chance to speak up for our constituency’s education system.\n\"Instead she has walked out, abandoning Berwick's schools, teachers and children to join forces with the hard Brexiteers, pushing a disastrous no deal Brexit which could leave Northumberland’s schools even worse off.\n\"This decision to put her constituency second is totally unacceptable, Berwick deserves better. We need an MP who will make sure the issues which matter in our area are heard in Westminster, not an MP who leaves our constituency voiceless in favouring of rowing with her own Prime Minister.\" Read More Brexit resignations: Everyone who has quit over Brexit deal so far on Thursday\nBut Mrs Trevelyan denied the move would harm her constituents.\nShe said: \"I have been inundated with messages from constituents concerned that the Brexit negotiations are not honouring the vote of the nation, and Northumberland to leave the EU and forge an independent future.\n\"I will always stick up for my principles and honour the result of the referendum result.\n\"In terms of school funding, I am pleased to report that schools in Northumberland are set to receive large increases to their budgets next year as a result of lobbying by me and other colleagues to address the historic underfunding of rural schools compared with their urban counterparts.\n\"Per-pupil funding is also rising, adding to the additional budgets. For example, Duchess's High School in Alnwick will receive an increase to its baseline budget of 26.4% next year. I have not received concerns from headteachers about funding but my door is always open and I will continue to be a vocal champion for them and the whole of my constituency.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-15T20:21:00.000+02:00", "crawled": "2018-11-16T00:59:49.001+02:00", "highlightTitle": ""}