{"organizations": [], "uuid": "b44fe04f76665a944dabbc7b1ca8a0a9f90c7071", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15281417.ece/ALTERNATES/s1200/0_GWR_-NJL_151018virgin_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/cybg-hails-transformational-year-following-15440699", "country": "GB", "domain_rank": 21960, "title": "CYBG hails 'transformational year' following Virgin Money £1.7bn takeover", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-20T16:38:00.000+02:00", "replies_count": 0, "uuid": "b44fe04f76665a944dabbc7b1ca8a0a9f90c7071"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/cybg-hails-transformational-year-following-15440699", "ord_in_thread": 0, "title": "CYBG hails 'transformational year' following Virgin Money £1.7bn takeover", "locations": [], "entities": {"persons": [{"name": "david duffy", "sentiment": "negative"}, {"name": "duffy", "sentiment": "none"}], "locations": [{"name": "gosforth", "sentiment": "none"}, {"name": "virgin money hq", "sentiment": "none"}], "organizations": [{"name": "cybg", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "yorkshire banks", "sentiment": "none"}, {"name": "invalid email challenger bank cybg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CYBG hails 'transformational year' following Virgin Money £1.7bn takeover CEO David Duffy also used the group's annual results to issue a warning over Brexit uncertainty Share CYBG chief executive David Duffy outside former Virgin Money HQ in Gosforth (Image: publicity handout from CYBG) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nChallenger Bank CYBG has hailed a “transformational” year in which it carried out its £1.6bn takeover of Newcastle’s Virgin Money .\nCYBG, which owns the Clydesdale and Yorkshire Banks, completed one of the first major banking deals since the financial crisis when it merged with Virgin Money earlier this year.\nNow full year results for the group have been posted showing it absorbed acquisition costs of £37m to create what CEO David Duffy has described as a “true competitor” within the banking industry.\nMr Duffy hailed the group for consistently delivering against set targets, despite swinging to a full-year loss after it was forced to take an extra £150m charge linked to the mis-selling of payment protection insurance (PPI).\nCYBG posted a £164m pre-tax loss in the year to September 30, compared with a £268m profit in 2017 and it was stung by £396m of legacy conduct costs, the bulk of which were linked to PPI claims. David Duffy (Image: PA)\nIt reflects higher-than-predicted complaints volumes following a Financial Conduct Authority advertising campaign featuring Arnold Schwarzenegger aimed at encouraging people to come forward before an August 2019 deadline for final claims.\nCYBG said that, while weekly complaint volumes have been falling since the end of July, it considers it “prudent” to increase provisions by £150m as it estimates 83,000 future claims.\nOn an underlying basis, however, profit before tax was up 13% to £331m and net interest income rose 1% to £851m.\nMr Duffy also used the annual results to warn over Brexit uncertainty.\nHe said: “Clearly Brexit negotiations mean the external political and macroeconomic environment remains inherently uncertain.\n“We have planned for a period of uncertainty, but it is impossible to ignore the lower levels of business confidence, especially for SMEs, while the final specific outcome of negotiations remains unclear.” Read More Heather Mills to turn Peterlee factory into 'Silicon Valley' of vegan food\nFollowing the merger with Virgin Money the combined group is expected to result in annual cost savings of around £120m by the end of September 2021.\nWith more than six million customers, the bank will also hold £70bn in customer loans and around £58bn in mortgages.\nMr Duffy praised the former Virgin Money team at Gosforth for its work since the merger.\nHe has previously made a commitment that there would be no major change at the site for at least the next three years.\nMr Duffy added: “2018 has been another transformational year for CYBG, in which we have continued to execute on our strategy and consistently delivered against the targets we have set. Our strong progress since the IPO has put in place the foundations that enabled us to acquire Virgin Money and to deliver on our ambition to create the first true national competitor to the status quo.\n“The Virgin Money acquisition was clearly a landmark moment for the group and the combination will create the first true national competitor to the status quo in UK banking in over a decade, offering a genuine alternative for consumers and small businesses. Read More\n“We have already begun a comprehensive strategic planning process for the group and I would expect us to be in a position to update the market on our strategy and targets at a Capital Markets Day event in June 2019.\n“CYBG has a bright future with a unique combination of growth opportunities.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-20T16:38:00.000+02:00", "crawled": "2018-11-20T16:59:12.007+02:00", "highlightTitle": ""}