{"organizations": [], "uuid": "bb9606a286d6c79aa2b9515f2dc8b76377c4477b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9385458.ece/ALTERNATES/s1200/JS65208059.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/rural-north-east-could-face-15456412", "country": "GB", "domain_rank": 21960, "title": "Rural North East could face 'spiral of decline' from Brexit, report warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-23T16:17:00.000+02:00", "replies_count": 0, "uuid": "bb9606a286d6c79aa2b9515f2dc8b76377c4477b"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/rural-north-east-could-face-15456412", "ord_in_thread": 0, "title": "Rural North East could face 'spiral of decline' from Brexit, report warns", "locations": [], "entities": {"persons": [], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "rural north east", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north northumberland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "eglingham", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rural North East could face 'spiral of decline' from Brexit, report warns Report from Newcastle, Northumbria and Cumbria universities looked at best and worst-case scenarios for Northumberland Share Existing wind turbines near Eglingham in North Northumberland Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nRural areas could face a “spiral of decline” unless they find a way to respond to Brexit, a study in the North East has found.\nAcademics at Newcastle , Northumbria and Cumbria universities looked at the implications of Brexit on rural Northumberland and found the possibility for issues such as low wages, the lack of affordable housing and poor transport could be made worse by the UK leaving the EU.\nThe study said that while withdrawal from the Common Agriculture Policy could stimulate innovation and prompt farms to invest in technology to improve productivity, there was also the possibility that the rural economy would be hit by lack of public investment, tariff barriers, delays at borders and labour shortages.\nThe academics also said that the increasingly system of public services - made up of combined authorities, local enterprise partnerships, local authorities and growth deals - has led to duplication and the absence of a coherent voice.\nDr Paul Cowie, who led the review for Newcastle University’s Centre for Rural Economy, said: “Britain’s departure from the European Union could trigger a spiral of decline unless policymakers confront many of the long-term issues in rural areas.\n“However it could also provide policymakers with an opportunity to tackle these challenges as a whole so that opportunities aren’t missed, but only if rural areas work towards a shared vision for the North of England and speak with a single, confident voice driven from the bottom-up.” Read More Brexit is creating 'lost years' where nothing else gets done, Sir Keir Starmer says\nThe research was based on discussions with a range of rural businesses, farmers, local politicians and community organisations in Northumberland, plus a review of Brexit-related studies and policy papers.\nIt said that the diverse range of economic activities in the rural North gave communities some resilience, but also meant people in different areas weren’t working with their counterparts in other sectors.\nThe review focused on rural Northumberland, but due to its proximity to rural parts of Cumbria, the Borders and Durham , it also considered the wider rural North.\nDr Gail Mulvey, from the University of Cumbria, said: “There is a tendency for discussion to take place in silos and one of the aims of this research was to bring experts and policymakers together from different sectors so that the interdependencies of sectors could be examined. Northumberland County Council Leader Peter Jackson (Image: Newcastle Chronicle)\n“The effects of Brexit on a particular sector, for example, agriculture or forestry, are likely to have a knock-on effect for the environment and tourism sectors. This, in turn, will affect the employment opportunities and standards of living of those who live and work in the rural North.”\nThe research was commissioned by Northumberland County Council to inform its rural development strategy as part of both the North of Tyne Combined Authority and the Borderlands Growth Deal.\nIt said that retaining more graduates in rural areas could generate more start-ups, improve productivity and change the demographic balance of rural areas with younger people choosing to make the rural North their home. Read More CYBG hails 'transformational year' following Virgin Money £1.7bn takeover\nNorthumberland County Council leader Peter Jackson said: “As we move into unchartered territory in terms of Brexit it’s useful to have as much detail as possible of the potential opportunities and repercussions.\n“The key findings around greater devolved decision making are particularly pertinent, considering we have just launched the North of Tyne Combined Authority and continue to press for a Borderlands growth deal.\n“Both of these offer a significant opportunity for Northumberland to take control over the strategic direction of rural development, particularly in developing synergies between our sectors to exploit the opportunities presented by Brexit.”\n“We will be looking closely at the details of this research as we work towards a positive future for the county post Brexit.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-23T16:17:00.000+02:00", "crawled": "2018-11-23T18:15:13.011+02:00", "highlightTitle": ""}