{"organizations": [], "uuid": "f41c40acef0a60014791df578228bb2b79c67bff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2234930.ece/ALTERNATES/s1200/1_rich-list-web1.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/leicestershire-rich-list-live-50-2234896", "country": "GB", "domain_rank": 48128, "title": "Leicestershire Rich List live: The 50 wealthiest people in the county for 2018 - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.309, "site_type": "news", "published": "2018-11-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "f41c40acef0a60014791df578228bb2b79c67bff"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/leicester-news/leicestershire-rich-list-live-50-2234896", "ord_in_thread": 0, "title": "Leicestershire Rich List live: The 50 wealthiest people in the county for 2018 - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "kevin wheatcroft", "sentiment": "negative"}, {"name": "peter ogden", "sentiment": "none"}, {"name": "tom wheatcroft", "sentiment": "none"}, {"name": "jonathan palmer", "sentiment": "none"}], "locations": [{"name": "donington estate", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "donington park", "sentiment": "none"}], "organizations": [{"name": "leicestershire rich list", "sentiment": "negative"}, {"name": "leicestershire", "sentiment": "negative"}, {"name": "donington park estate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "09:28 20= (21=) Kevin Wheatcroft £120m (£120m)\nKevin Wheatcroft’s huge collection of historic military vehicles and militaria is one of the biggest in the world.\nIt includes more than 50 tanks and self-propelled guns, including German WW2 Tiger and Panther tanks.\nHe has been collecting military vehicles for more than 30 years and the historic fighting vehicles support events around the country.\nIt all began after he was given a German helmet for his fifth birthday.\nKevin Wheatcroft, 59, inherited his late father’s world famous Donington Park racing circuit on the Leicestershire/Derbyshire border, along with a motor museum and an extensive property portfolio, when motorsport legend Tom Wheatcroft died in 2009.\nThe racetrack and its associated business is now run by Sir Peter Ogden and Jonathan Palmer’s Kent-based operation MotorSport Vision, who took it over, along with the Donington Park Estate on a 21 year lease last year.\nTom Wheatcroft had rescued the Donington Park circuit from disrepair in the early 70s.\nHe bought the track and the 1,100-acre Donington Estate at Castle Donington for an estimated £100,000.\nThe track is also home to what was Tom Wheatcroft’s pride and joy – the world’s largest collection of Formula One racing cars which he has assembled over many years. Donington Park owner Kevin Wheatcroft.\nThe collection is worth close to £100 million and includes classics such as Jim Clark’s 1963 world championship-winning Lotus, a 1936 Alfa Romeo Bimotore and a flat-12 Ferrari 312B among Vanwalls, Williams, Jaguars, Maseratis, Coopers and a Michael Schumacher Ferrari in which he took three pole positions and won the Canadian Grand Prix.\nKevin Wheatcroft’s father was 15 when he watched the great racing drivers of the day compete in the Donington Grand Prix races of the 1930s – a period dominated by Mercedes Benz and Auto Union.\nDuring the war the circuit was an army base, and after that fell into disuse.\nHaving built up his very successful construction and property business after the war Tom Wheatcroft was determined to restore Donington Park to its former glory.\nIn 1973 he bought the circuit and rebuilt it, upgrading and re-routing it in the process.\nAfter spending around £2 million of his own money fighting legal battles to open Donington for racing again, he finally fulfilled his ambitions.\nHe re-opened the track in 1977.\nIn 1993 it was home to the European Grand Prix in a memorable race won by Ayrton Senna.\nDonington stages a wide range of car and motorcycle races including British Touring Car Championship races, Formula 3, British Truck Racing championships, the Superbike World Championship and BRSCC Club Car Championship events. Donington is also home to Formula E – a global series for hi-tech, high performance electric-powered cars.\nKevin Wheatcroft’s main company – Wheatcroft & Son – has assets of more than £30 million.\nHis property company has assets of more than £16 million. 20= (20) Brian de Zille and family £120m (£122m)\nBrian de Zille and his family made their fortune from sweaters and knitwear.\nHe built up the Sweater Shop, based in Syston, with factories in Leicester and Shepshed.\nHaving established the successful knitwear business in 1973, he sold it 22 years later, and he and his family made £120 million from their 80 per cent stake.\nIn 2012 his family decided to start all over again.\nHe and his grandson Ben launched a new brand – 019 Sweater Shop – at factory premises in Thurmaston.\nLater trading as Zero One Nine, the company went into voluntary liquidation earlier this year.\nThe family has other business interests including the Jersey-based fitness club business, Club Carrefour (UK) and soft furnishings business Itex Furniture.\nThe names “019” and “Zero One Nine” came from a family motor racing number.\nThe de Zilles are passionate motorsport fans.\nTwo generations of de Zille’s have successfully raced in Formula Ford competitions and Brian de Zille’s son Graham won the BP Superfind Junior Formula Ford championship.\nGrandsons Ben and Dan have also met with success on the track and de Zille businesses have been involved in motorsport sponsorship.\nAnother de Zille family passion is super-yachts, and Graham de Zille is the man behind the Amnesia series of super-yachts, built by Italian custom yacht builder Benetti.\nBrian de Zille is 85 and lives with his family near St Helier on Jersey.\nHe has written his autobiography, entitled “From the Sweatshop to the Sweater Shop.” 22 (24) Dr Dallas Burston £110m (£110m)\nDr Dallas Burston is passionate about polo, and his 600-acre Dallas Burston Polo Club in Warwickshire is one of the leading venues for the sport in the UK.\nLast year the club took delivery of the world’s most luxurious Range Rover – worth well over £200,000.\nThe bespoke vehicle is the pinnacle of four-wheeled luxury and includes a five-litre V8 supercharged engine, hand-engraved door handles, crested champagne flutes and bronze and red bespoke paintwork.\nDr Burston worked with Listers Land Rover and Jaguar Land Rover Special Vehicle Operations to craft the unique vehicle for his club.\nThe Southam-based club has been undergoing a £122 million investment programme.\nThe 12 year plan at the 600-acre site on the Stoneythorpe estate includes a 3,000 seat events centre, 100 luxury lodges, a hotel, a traditional pub – the Millstone Hare – four polo grounds, a chukka ground, a polo school and a players’ pavilion.\nPartners Sanjay Foods organise Asian events at the polo club, which is already a swish wedding venue.\nDr Dallas Burston – a former GP – made his fortune by building up and selling pharmaceutical operations. Dr Dallas Burston at the annual Ashbourne Royal Shrovetide Football games (Image: Ian Hodgkinson)\nHe sold two pharmaceutical companies in 1999 netting more than £50 million.\nHe sold Northampton-based Bartholomew-Rhodes for £19.8 million, and his 51 per cent stake in Ashbourne Pharmaceuticals for £32 million.\nDr Burston, 68, also founded Dallas Burston Ltd, a company which developed under-the-tongue pharmaceutical sprays and which was acquired by Cambridge-based SynGenix in 2003 in a share deal.\nHe established DB Ashbourne Ltd – a £90 million medicines business in Market Harborough, which was acquired in 2015 by French independent pharmaceutical company Ethypharm for an undisclosed sum.\nEthypharm completed a £240 million financing package to support the acquisition and development of DB Ashbourne, now renamed Orphea Ltd, and the development of the group as a whole.\nDr Buston also has interests in IXL Events which provides event support at the polo club, and Brookfield Farmers. 23 (26=) Hilary Devey CBE £105m (£100m)\nHilary Devey’s Pall-Ex logistics group has added nearly £10 million to its turnover despite a challenging marketplace.\nPre-tax losses at HLD Holdings – Pall-Ex’s holding company – dropped from £1.5 million to £1.2 million.\nThe Ellistown-based company aims to turn around some loss-making operations in the group, as well as expanding its European business.\nThe pallet management and haulage businesses have performed well, but other owned operations have performed below budget.\nIT development has also increased costs.\nThe company says that more than half of the pallets handled by the business are in mainland Europe rather than the UK, and it sees its European trade increasing despite Brexit.\nPall-Ex remains a well-financed, market leading business, and continues to expand its network in the UK and Europe.\nThe operation is now represented in Poland, Bulgaria, Italy, Spain, France, Portugal, France, Romania, Moldova and the Benelux countries.\nWhen Hilary Devey isn’t at her desk at Pall-Ex, she may well be on daytime television. Hilary Devey at the Pallex conference\nShe is an occasional panel member on ITV’s lunchtime show Loose Women in which celebrity ladies discuss issues of the day.\nHilary Devey, 60, is founder, CEO and chairman of Pall-Ex.\nBut her TV profile is growing and she’s probably best known for her two-year stint as one of the dragons on the BBC’s Dragons’ Den.\nHer other business interests include bed and mattress business Duvalay and Pronto same-day couriers.\nShe recently disposed of a 50 per cent stake in WOW Table Art, netting £500,000.\nShe left Dragons’ Den to present the five-part Channel 4 series The Intern and has also been seen on Secret Millionaire, The Business Inspector, Hilary Devey’s Women at the Top, Running the Shop and Hotel GB.\nShe launched the award winning Pall-Ex business in 1996, selling her house to fund it when banks refused to back her.\nIt was among the first palletised goods networks to be launched in the UK, based on the proven hub and spoke distribution model.\nPall-Ex has a nationwide membership network of more than 100 of the country’s leading hauliers and it continues to expand.\nIts latest strategic acquisition is Pall-Ex London.\nThe company has grown internationally and runs daily services to around 40 countries. The firm picks up regular awards.\nHilary Devey’s career has been in the distribution business, having worked for Littlewoods, United Carriers, Tibbet and Britten and TNT.\nIt was here that she identified the need to transport small consignments of freight quickly and cost-effectively, and the idea for Pall-Ex was born.\nShe was born in Bolton and lives at Boylestone in Derbyshire. She also has houses in London, Morocco and Spain.\nIn 2013 she was awarded a CBE for services to the transport business and charity. She is an active supporter of the Carers Trust of which she became vice-president in 2012, and also supports the British Citizen Awards and the Stroke Association.\nShe herself suffered a stroke in 2009 and became a patron of the association the following year. Her autobiography is entitled “Bold as Brass.” 24= (26=) Jimmy and Simon Thomas £100m (£100m)\nThe weakness of sterling since the Brexit vote has been good news for Jimmy and Simon Thomas’s Leicester Square-based Hippodrome Casino.\nDollars and euros are flowing freely over the gaming tables as foreign tourists take advantage of the weak pound.\nThe casino hosts more than 35,000 visitors every week.\nJimmy Thomas and his son Simon spent £45 million in 2012 converting London’s Hippodrome nightclub into a casino.\nWithin three months internet poker group Pokerstars took a stake valuing it at £100 million.\nThe casino, which turns over £78 million, made a £4.3 million pre-tax profit in 2017.\nSimon Thomas is chairman and chief executive while his father is president.\nJimmy and Simon Thomas pocketed £80 million when they sold the Leicester-based bingo chain Thomas Group to Riva Gaming in 2006.\nThe Thomas Group owned bingo halls and amusement arcades throughout the UK under the Beacon Bingo and Showboat brands.\nThe business was founded by Jimmy Thomas in the 1960s with a single bingo hall in Loughborough – the former Loughborough Odeon.\nIn the early 90’s the group opened the biggest bingo hall in the UK in Cricklewood.\nThey went on to acquire the London Hippodrome nightclub off Leicester Square – once run by Peter Stringfellow – and transformed the 115 year-old grade II listed building into a casino.\nIt is now one of Europe’s biggest casinos with capacity for more than 2,000 people.\nThe Hippodrome opened in 1900 as a circus variety theatre where Harry Houdini and Charlie Chaplin performed. In the 1950s it became the famous Talk of the Town, hosting shows by Frank Sinatra, Judy Garland, Shirley Bassey and Sammy Davis jnr.\nLeicester-born Jimmy Thomas, 84, has been generous with his fortune. He donated £2.3 million to help refurbish an NHS specialist cancer care unit in London.\nHe made the donation in memory of his wife Alma who lost her fight with ovarian cancer in 2008 despite treatment at the Royal Marsden cancer centre in Chelsea.\nHe is a Conservative party donor and owns a farm near Nanpanton, Loughborough.\nHis second wife Karina comes from Bolivia.\nSimon Thomas, 53, is chairman and chief executive of the London Hippodrome.\nHe is a former pupil of Uppingham School and the seventh generation of the family to work in the leisure industry.\nA Bristol University graduate, he spent two years as a merchant banker before joining the family firm. He was the youngest ever president of the British Amusement Catering Trade Association and remains an active member. 24= (28=) Lord Simon Wolfson £100m (£95m)\nThe world of retail continues to be challenging, with reductions in high street footfall, subdued demand, changes in the way people shop and the onward march of online offerings.\nIn addition, the weak pound is pushing up costs.\nDespite this, and with household names tumbling around them, Lord Wolfson’s NEXT has managed to keep its head above water.\nThe Enderby-based clothes and homeware chain has seen its turnover hold steady. While prospects remain challenging, NEXT would appear to have halted the declines of recent years.\nIndeed NEXT’s online offering is showing encouraging growth, offsetting in-store sales falls.\nThe Next Directory had become iconic before many retailers had got their online retail space off the ground. Next chief executive Lord Simon Wolfson\nHowever it has not slowed down investment in its bricks-and-mortar, and is opening more and bigger stores and new warehouse space.\nIn the first six months of 2018 sales rose 3.9 per cent to £1.98 billion.\nGroup pre-tax profits rose to £311.1million from £309.4 million.\nLord Simon Wolfson, 50 year-old Baron Wolfson of Aspley Guise, is chief executive of the Enderby-based fashion group.\nAfter graduating in law from Trinity College, Cambridge, Lord Wolfson took over from his father – former NEXT chairman David Wolfson, Baron Wolfson of Sunningdale.\nThat was in 2001 and at the time he was, at 33, the youngest chief executive of a FTSE 100 company.\nHe had joined NEXT as a sales consultant in 1991 and became retail sales director in 1993. He was appointed to the board in 1997.\nHe is a key figure in the Conservative Party and has helped to develop economic policy. He was introduced to the 24= (25) Michael and Gerald Coates and family £100m (£105m)\nLutterworth-based HW Coates Ltd saw a slight drop in turnover and profits in 2017.\nBut despite that the family-owned company continued to invest in its vehicle fleet and its staff.\nPre-tax profits for 2017 were £15.4 million, down from £17.9m in 2016. Turnover decreased from £37.8 million to £36.1 million.\nMichael Coates and his family are directors of their haulage, farming and property company.\nIt is consistently profitable and has net assets of more than £100 million including a valuable investment property portfolio.\nWith expertise accumulated over more than 50 years, HW Coates’ core market is the warehousing and transporting of packaged chemicals, and it continues to invest in its warehouse facilities and vehicle fleet.\nIts chemical transport operation handles more than 2,000 chemical pallets and parcels every night, with vehicles making 500 deliveries a day.\nChaired by Gerald Coates, 68, it is the market’s leading independent operator, servicing most of the major names in chemicals and pharmaceuticals from its Leicester Road headquarters, and distribution depots spread around the UK.\nThe business has around 270 employees and is debt-free.\nAs well as its distribution depots, HW Coates has seven purpose-built chemical warehouses including two new warehouses in Grangemouth, Scotland and Middlewich in Cheshire.\nThe company also operates a fleet of more than 100 lorries.\nMichael Coates, who is 73, is a vice-president of the Lutterworth Town Band which was formed 27 (28=) Michael, Anthony and Charles Smith £98m (£95m)\nHigh street shoe retailing is not easy in the current climate, so it’s to the management of Shoe Zone’s credit that the business is holding firm in its turnover and profits.\nThe success of its “Big Box” store concept, effective management of its property portfolio, and a growing online presence is keeping Shoe Zone’s performance healthy.\n2017 turnover – at £157.8 million – was only marginally down on the previous year.\n2018 has proved healthy, with the rise in sales expected to continue.\nProfits at Shoe Zone, the Smith family’s Leicester-headquartered AIM-listed value footwear chain, have remained steady in the region of £11 million.\n£4 million has been set aside for a dividend payable in 2019.\nThe operation has closed down its loss making stores, but still has just under 500 outlets.\nIts non-footwear range of handbags, school bags and accessories contributed £8 million to sales.\nShoe Zoe floated on the AIM market in May 2014 after a successful launch on Amazon in November 2013. Anthony Smith, chairman of Shoe Zone at the company's Leicester HQ\nMichael Smith, aged 76, with his brother Christopher, bought the company, which was then known as Bensonshoe, in 1980.\nThey quickly turned what had been a local retail business into a national chain.\nThey acquired the mid-market firms of Stead & Simpson and Shoe Fayre, as well as the largely Irish-based retailer Tyler Ltd, growing to a company employing more than 3,500 people in more than 500 stores across the UK and Ireland.\nIn 2000 the firm doubled its turnover with the acquisition of Oliver Timpson. The firm now sells more than 20 million pairs of shoes a year.\nShoe Zone launched its international operation in 2016 launching via Amazon in Germany France, Italy, Spain and the US.\nChristopher Smith left the company in 1992 and Michael’s two sons, Anthony, 50, and Charles, 52, are now on the board.\nAnthony joined the company in 1993 and is its largest shareholder, with 28 per cent, and executive chairman.\nHe is a director of the firm’s property holding company – Zone Property Ltd.\nHe also runs the Shoe Zone Trust, which was formed in 2005. The business has raised around £500,000 for BBC Children in Need and £700,000 for other charities.\nCharles, who joined the firm in 1998, began his Shoe Zone career as a store manager and area manager before becoming retail director and then deputy chief executive.\nHe is currently chief operating officer and has a 22 per cent stake.\nShoe Zone has its UK base in Humberstone Road, Leicester. 28 (33) Engelbert Humperdinck £95m (£80m)\nEngelbert Humperdinck hasn’t made a Christmas album for 40 years. Now he’s decided to do something about it. “Warmest Christmas Wishes”– with a comfortable collection of Christmas classics – is already in the shops.\nThe 82 year-old is keeping young and keeping the money rolling in with almost continuous touring. He is currently embarked on another gruelling tour of North America which comes to an end soon after a three-nighter at the Potawatomi Casino in Milwaukee.\nThen, come January, he’s off again for a couple of dates in Florida before heading off to do a string of concerts in Australia and New Zealand.\nExhausting for anyone, let alone an octogenarian.\nLast year marked the 50th anniversary of his first international chart success, and the anniversary was marked with two celebratory disc sets showcasing his amazing catalogue.\nEngelbert Humperdinck 50 went straight into the UK album charts.\nHis studio album The Man I Want to Be included covers of songs by Ed Sheeran and Bruno Mars.\nLeicester’s favourite singer – a self-confessed lover of vinyl – has sold more than 150 million records, including 64 gold and 23 platinum. Engelbert Humperdinck\nEngelbert Humperdinck was born Arnold George Dorsey in Madras, India, the son of a British Army NCO and an opera-singing violin teacher.\nThe family – with 10 children – moved to Leicester and by the early 50s he was playing saxophone in nightclubs.\nAged 17, he entered a pub singing contest and discovered his talent for singing, and for impersonations.\nHe did an impersonation of Jerry Lewis, and became known as Gerry Dorsey because of that.\nHis career was interrupted by national service in the Royal Signals and tuberculosis, but on his recovery he began singing again, adopting the name of 19th century opera composer Engelbert Humperdinck.\nAfter early success in Belgium it wasn’t until 1967 that he broke into the UK charts with Release Me.\nIt was a huge hit, spending more than a year in the top 50 and selling 85,000 copies a day at its height.\nOther big hits followed, including The Last Waltz.\nHis powerful singing style and good looks attracted a huge fan base – particularly women, and he has spent the last 50 years recording and touring, including lavish shows in Las Vegas. He has a star on Hollywood’s Walk of Fame.\nHis income is boosted by a property portfolio which includes prime sites in Hawaii, Mexico and the States.\nHe has been married to his wife Patricia for 54 years and has four children and nine grandchildren 29= (30=) Mike Stephenson and family £90m (£90m)\nMike Stephenson and his family owned the other half of the £200 million turnover Coalville-based Logson Group before a 60 per cent share of the business was sold to Northern Irish industrial group W&R Barnett.\nHe and Ian Loggie both worked at Mondi packaging and left in 2004.\nThey then bought Mondi’s cardboard manufacturing business which became the embryo for the Logson Group.\nHe remains a director and shareholder of Logson Holdings. From left, Josh Brooks, editor of Packaging News, Ian Loggie and Mike Stephenson, of Logson Group, and UK Packaging awards presenter, comedian Tony Hawks\nMike Stephenson is also a director of LS Property Holdings along with fellow Logson founder Ian Loggie.\nThe company has net assets of £3.3 million.\nAn accountant by profession, Mike Stephenson, 59, was previously finance director at Mondiboard Ltd and Mondi Paper & Intermediate Products.\nWith Ian Loggie he worked to increase Logson’s turnover year on year through expansion and acquisition.\nIn 2013 the firm was listed in the Sunday Times Top Track 250 list of fastest-growing companies. It has been listed in the Sunday Times Profit Track 100 list for three successive years.\nThe company’s print and display business, Inspirepac, was acquired in 2015 by Smurfitt Kappa as part of a £43.5 million deal. 31 (32) Peter Tom CBE £85m (£85m)\nRevenue is up at Peter Tom’s Breedon Group. First half results for 2018 show a 16 per cent jump to £378.4 million.\nProfits dipped slightly to £30.4 million following one of the firm’s busiest acquisition periods.\nFour acquisitions have been completed, including the Lagan Group, a Belfast-based construction materials business acquired early this year for £455 million.\nLagan has a modern cement plant, nine active quarries and 13 asphalt plants.\nBreedon has also completed a deal with Tarmac to acquire four quarries and an asphalt plant from Tarmac in exchange for 23 ready-mixed concrete plants.\nRocks and rugby have defined 78 year-old Peter Tom’s successful career.\nHe is chairman of Leicester Tigers Rugby Club and executive chairman of Breedon Group.\nPeter Tom, who was awarded a CBE in 2006 for services to business and sport, played lock forward for the Tigers between 1963 and 1968, turning out for 130 games. Tigers chairman Peter Tom CBE\nHe has remained a part of the club ever since and has been chairman for the last 21 years.\nBreedon, headquartered at Breedon-on-the-Hill near East Midlands Airport, is the biggest independent construction materials group in the UK.\nThe company operates the country’s largest cement plant, two cement import terminals, more than 70 quarries, 40 asphalt plants, 180 ready-mixed concrete and mortar plants, and three plants producing concrete blocks. The whole operation employs more than 2,000 people.\nIn 2016 Breedon completed its largest acquisition – the £336 million takeover of Derbyshire’s Hope Construction Materials.\nHope Cement, in Derbyshire’s Hope Valley, operates the UK’s largest cement plant producing 15 million tonnes of cement each year.\nPeter Tom has an honorary doctorate in technology from De Montfort University.\nHe lives on Guernsey and is chairman of the Channel Islands Property Fund. 29= (30=) Ian Loggie and family £90m (£90m)\nIan Loggie and Mike Stephenson sold a 60 per cent stake in their Coalville-based Logson, the packaging group they founded in 2004.\nBelfast-based commodity, storage and industrial group W&R Barnett acquired a controlling stake in the business for an undisclosed sum in 2015, providing valuable investment funds for Logson’s continued growth.\nIan Loggie, aged 56, and his family owned half of the business, which turns over £200 million a year and is the UK’s largest independent supplier of corrugated packaging.\nIt employs more than 1000 people.\nLogson Holdings declared a £10 million profit in 2017 and paid a £10 million dividend. A further £10 million dividend was paid in March this year.\nThe group is divided into several divisions operating six brands.\nBoard24 manufactures and supplies corrugated sheet board; Cases24 is a dedicated trade supplier of high volume glued cases. Boxes and Packaging converts corrugated board into a variety of packaging products and Jardin Corrugated Cases is an Ely-based integrated supplier of packaging, in particular to the horticultural industry acquired in 2015.\nIn addition Cardboard Box Company – acquired in June – is a leading supplier of packaging and in 2016 the group acquired The Boxshop Ltd, Scotland’s largest independent cardboard box manufacturer based in East Kilbride.\nThe company, under chief executive Alex Kelly, has 18 UK manufacturing facilities including Coalville, Belgrave, Larkhall, Manchester, Swindon and Preston, and also owns Scott Packaging in Glasgow. The company has invested £15 million in its production facilities. Logson supplies customers in a wide range of sectors including food and drink, pharmaceutical and engineering.\nIan Loggie remains a director and shareholder of Logson Holdings.\nIan Loggie enjoys saloon car racing and has taken part in the British Endurance Championship racing Porsches 32 (34) Andrew Hancock and family £70m (£68m)\nEveryone in the Loughborough-based Hancock family seems to have sweets in their blood.\nRay and Liz Hancock set up their wholesale confectionery business in 1962.\nIn 1986 it was taken over by their twin sons Andrew and Adrian before being sold in 2012.\nNow the third generation of the family are carrying on the tradition.\nAdrian’s sons David and Michael are running their own wholesale confectionery business.\nHS Wholesale Sweets on the Attleborough Fields Industrial Estate in Nuneaton is an online supplier of branded bulk and wholesale sweets.\nThe original Hancock’s confectionery business established by Andrew Hancock’s parents in 1962 was acquired from its private equity backers and management last year in a deal reported to be worth £100 million.\nLoughborough-headquartered Hancocks Cash and Carry was bought by American sweet specialist Innovative Bites five years after a management buyout backed by H2 Equity Partners. Loughborough-base Hancocks Cash and Carry, the confectionery specialist established by Andrew Hancock’s parents in 1962, was sold in April in a deal reportedly worth £100m\nAndrew Hancock’s parents – Ray and Liz – set up a wholesale confectionery business from their sweet shop in Shepshed in the early 60s.\nFrom those humble beginnings grew the largest wholesaler of sweets and chocolate in the UK.\nNow Hancock’s Sweets is a global operation through Hancock’s International.\nThe firm’s wholesale confectionery can now be bought in Belgium, the Netherlands, Germany, France and Spain.\nFrom the early days Ray and Liz Hancock realised the financial benefits of buying sweets in bulk. They filled up all the available space in the building so they could supply other local retailers.\nThe business soon grew, moving to progressively larger premises.\nIn 1986 Ray Hancock died and the business was taken over by his twin sons Andrew, 56, and Adrian.\nIn 2012 they realised the fruits of the family labours, selling the business to a management buyout backed by Dutch private equity firm H2 Equity Partners for £50 million.\nThe brothers retained a minority stake, but stepped back from management.\nIn April 2013 Adrian Hancock died, after an eight-month battle with cancer. He was aged 50 and left a wife and four children. 33 (35) David Abell and family £68m (£66m)\nDavid Abell is executive chairman of the company which used to make that staple of every hotel room – the Corby trouser press.\nNow Jourdan plc is a cash-rich holding company, having disposed of its operating subsidiaries.\nThe last one to go was Clinipak Ltd which produces medical sterilisation products.\nThat was sold for £7 million in 2016.\nThe business now concentrates on investments and property.\nIt is sitting on £7.6 million of cash, and relies on short term investments for profitability.\nIt’s a strategy which allowed a dividend of £150 a share last October.\nDavid Abell, 75, has a reputation as an astute share dealer who has made his fortune doing the right thing at the right time.\nHe is also a strong supporter of Leicester sport.\nHe has been a Leicester Tigers supporter for well over 30 years and is a non-executive director at the club, and was also a director of Leicester City Football Club in 2002. David Abell\nHis background is in the car industry.\nHe was a senior director at British Leyland in the 1960s and 70s, but his wealth has come from knowing when to buy into a company, and when to get out.\nHe is currently executive chairman of Jourdan, a role he took up in 1997, having ousted the previous chairman Keith Whitten by building shareholder alliances.\nHe withdrew Jourdan from the AIM stock exchange in 2009 – it was floated in 2002 – and gained overall control in 2011.\nIn his early career David Abell worked for Ford, but from 1968 to 1981 he held senior management posts with British Leyland including managing director of Leyland Australia and chairman and chief executive of Leyland Vehicles Ltd.\nIn 1978 he bought Suter Electrical and was chairman and chief executive from 1981 to 1996, when the company was sold to Ascot Holdings plc, now part of Dow.\nHe is a race horse owner and his horses have included Branston Abbey and Gemini Fire and was co-owner of Collier Hill when it became the biggest earning gelding in Britain with career prize money exceeding £2.3 million.\nHe is married to Juliana and has four sons and a daughter. 34 (36) Paul Gooding £65m (£65m)\nPaul Gooding’s horticultural chemicals company Vitax Ltd has teamed up with the Soldier’s Charity – the national charity of the British Army which offers financial and practical support to solders and veterans and their families.\nThe charity is an advocate of the benefits of gardening to help transform lives, so there’s a good fit with a garden fertiliser business.\nThe company also sponsored the WW1 feature garden “Battlefields to Butterflies” at the Hampton Court Palace flower show.\nPart of the garden has now relocated to London’s Brompton Hospital to form part of a permanent memorial garden.\nVitax, part of the Synchemicals Group, has its base in Coalville with another plant in Skelmersdale.\nIt is a fourth generation family business and sells horticultural chemicals and fertilizers by Royal Warrant.\nThe company retails a wide range of products from pesticides to lawn fertilizers, and has branched out into other garden products including cat-friendly organic slug pellets.\nIn 2015 Vitax acquired the share capital of Somerset-based poultry fertiliser manufacturer Organico with its 6X and Groworganic brands.\nPaul Gooding, 60, has been with the company since 1980. His family acquired Vitax in 1988.\nIn 2015 he stepped down as managing director, appointing Daniel Wilkinson as his replacement, but remains its chairman.\nDaniel Wilkinson has since moved to Synchemicals subsidiary Hortifeeds International, to be replaced by Carl Welsh.\nSynchemicals has a range of other businesses under its wing including Showpla Plastics – a company producing large injection-moulded plastic components, Lincolnshire-based Nutrel Products, a horticultural chemical company aimed mainly at farming, John Hall Fertilizers, and Hortifeeds.\nIn 2006 the Suffolk-based Supaturf Products was acquired under the Vitax umbrella. Supaturf also has an operation in South Africa.\nSynchemicals is a consistently profitable company. In the year to August 2017 the firm turned over £28.5 million – a £1 million increase on the previous year.\nPre-tax profits of £1.48 million was slightly down on 2016. The company employs 200 people and has £26.5 million in assets.\nSynchemicals can trace its origins back to 1880, producing insecticides and during WW2 Paul Gooding’s grandfather Frank, a tomato grower became involved with, and later took control of, Synchemicals – a company which produced products to help growers and nurseries increase their production.\nPaul Gooding’s father Brian and his uncle Douglas joined the company and as the gardening market burgeoned they developed a range of garden products.\nThese included the famous Nippon range of ant and insect killers.\nThe company expanded and moved its base from London to Coalville, and acquired Vitax which was based in Skelmersdale, where fertiliser production continued. 35 (37) Peter Van Herrewege and family £60m (£60m)\nProfits are healthy at Prime Life, Peter Van Herrewege’s nationwide chain of care homes.\nThe group turned in a pre-tax profit of just over £5 million in the year to March 2017.\nThat was slightly down on the previous year, but turnover increased to £51.4 million and bed occupancy averaged 90 per cent.\nThe Prime Life group prides itself on providing the best care and facilities the independent sector can offer.\nPeter Van Herrewege, 64, is founder, 70 per cent owner and chairman of Prime Life.\nThe business has more than 60 purpose-built facilities around the country, with about 20 of those in or around Leicester. Simon Van Herrewege and Peter Van Herrewege of PrimeLife in the main reception area at Peaker Park Care Village (Image: Andrew Carpenter)\nOther care homes are in Lincolnshire, Lancashire, Norfolk, Nottinghamshire, Warwickshire and the West Midlands. There’s even a 50-bed care home in the seaside resort of Skegness where residents can go for a holiday.\nThe homes – some of which have been nominated for Health Care Design awards – offer the full range of care from supported living to dementia care and palliative care as well as disability and respite care.\nPrime Life, which has its headquarters in Knighton Court Road, Leicester, employs more than 1,800 people and has around 1,800 clients with 90 per cent bed occupancy.\nPeter Van Herrewege, from Great Bowden, also has a specialist construction company – Prime Life Developments.\nHe is a director of Voluntary Action, South Leicestershire 36 (41) Frank Sytner and family £58m (£45m)\nLeicestershire-based luxury car dealer Sytner continues to generate record revenues and has posted its highest ever turnover figure which rose to £5.6 billion last year.\nThat compares to £4.8 billion the previous year.\n2017 pre-tax profits fell just short of £100 million.\nThe business – the UK’s largest vehicle retailer by revenue, and based in Grove Park, Enderby – sells more than 7,500 cars a year from its 140-plus dealer network.\nAt the beginning of 2018 Sytner snapped up a £190 million turnover counterpart with sites in Yorkshire and the North West.\nThe Car People was founded in 2000 and operates from four supermarkets in Wakefield, Sheffield, Manchester and Warrington, selling 18,000 cars a year.\nThe acquisition is helping Sytner accelerate its expansion of used car supermarkets – a rapidly growing sector.\nBritish Touring Car champion Frank Sytner, aged 74, founded the Sytner car dealership group in 1968 with his brother Alan, selling imported BMWs in Nottingham. Frank Sytner\nAlthough Sytner is probably best known for its association with BMW, it actually sells around 20 prestige brands, including Audi, Bentley, Ferrari, Rolls Royce, Mercedes, Jaguar, Land Rover, Lamborghini and McLaren.\nSytner has disposed of its three Lexus dealerships over recent months including Lexus Leicester which it disposed of in February.\nThe company’s major expansion began in 1993 with dealerships in Leicester and Sheffield.\nSytner floated on the London Stock Exchange in 1997 as Sytner Group PLC.\nIn 2002 the brothers sold the group to Penske Auto, the biggest automotive retail group in the United States, in a deal worth around £80million.\nRoger Penske resigned as chairman and chief executive in June.\nFrank Sytner, who lives in Oakham, stayed with the group and remains an advisor.\nHis racing career began in the early 70s, racing Formula Ford. He moved into Touring Cars in the 1980s, driving for the TWR team.\nHe began driving BMWs for Prodrive in 1987, meeting with immediate success. In the 1990s he moved into historic car racing.\nHe earned the nickname “Fearless” for his uncompromising racing style.\nIn 2006 Sytner moved to its current headquarters in Enderby, and employs more than 500 people in Leicestershire and 7,300 in dealerships in the UK and Europe.\nIt continues to grow internationally and has representation in Italy, Germany and Spain. 37= (40) Ian Mattioli MBE £55m (£47m)\nIt’s been a busy time for Leicester wealth management and employee benefit specialist Mattioli Woods, of which Ian Mattioli is co-founder and chief executive.\nThe business has moved more than 400 staff from its previous base in Enderby to new, purpose-built 60,000 sq ft offices in the heart of Leicester.\nThe building is on the site of former council offices in New Walk.\nMattioli Woods expects to recruit a further 200 over the next two or three years.\nBut they certainly haven’t let the move distract them. Revenue and profits continue to power forward.\nTurnover at Mattioli Woods has grown by 16.2 per cent to £58.7 million for the year to May.\nProfit before tax is up by more than a quarter to £9.8 million.\nIan Mattioli owns 12.8 per cent of the business’s equity.\nThe business continues to be acquisitive as part of its growth strategy. Ian Mattioli (Image: Will Johnston Photography)\nIn August it snapped up Broughtons Financial Planning and says deals for further “like-minded companies” remain a strong possibility.\nJointly with Bob Woods, Ian Mattioli launched Mattioli Woods as a pensions consultancy in 1991.\nThe firm has grown year-on-year, both organically and through acquisitions, and became a public company following its AIM listing in 2005.\nToday the firm advises well over 10,000 individual clients and 650 corporate clients, with assets under management in excess of £8.7 billion.\nAs well as its Leicester base Mattioli Woods has offices in London, Edinburgh, Aberdeen, Glasgow, Manchester, Preston, Buckingham, Solihull and Newmarket, differentiating itself from its big competitors with a tailored approach to financial advice.\nThe firm has a three-year sponsorship deal with Leicester Tigers which includes a dedicated Mattioli Woods stand at the Welford Road stadium, as well as shirt sponsorship and corporate hospitality.\nIan Mattioli, aged 56, has more than 30 years’ experience in the financial services industry. The new Mattioli Woods building (Image: Will Johnston Photography)\nHe began in the sector at the age of 18 and worked with Phoenix Assurance and Pointon York, both coincidentally in New Walk.\nHe takes responsibility for the operational management of the firm.\nHe is the founder of Custodian REIT plc which launched on the main London Stock Market in 2014.\nHe is also chairman of stock market listed K3 Capital Group plc, based in Bolton, which deals in corporate finance and company brokerage.\nIn 2007 he and Bob Woods jointly won the AIM Entrepreneur Award and both received an MBE in the Queens 2017 New Year honours for services to business and the community in Leicestershire.\nIan Mattioli and his family are active participants in raising money for local and national charities, with particular interests in Breast Cancer Now, LOROS, and supporting challenged students at Leicester University. 37= (38) Michael Bertioli and family £55m (£55m)\nThe invention of an ultra-sensitive pressure sensor in Loughborough in the 1970s has led to the rebirth of a picturesque village in the Cotswolds.\nThat might sound unlikely, but that’s exactly the story of Michael Bertioli and his family.\nMichael Bertioli founded a company which developed highly accurate pressure sensors. He made his fortune from it, and the fruits of that have been invested in the rebuilding of Southrop, a picturesque Cotswold village community.\nMichael Bertioli, 86, founded Druck in 1972 with his business partner John Salmon.\nThey invented a device to measure pressure which was five times more accurate than anything else on the market.\nThe product had a wide range of uses from measuring the pressure in aircraft cockpits to fizzy drinks.\nIn 1998 he was awarded the OBE for services to innovation.\nThe company went on to develop a wide range of pressure sensors and precision measurement equipment and established a strong presence in the market.\nDruck – based in Groby – was bought by America’s biggest company General Electric in 2002 in a deal worth £229 million.\nMichael Bertioli’s share was £58 million.\nHis interests are now in farming and estate management.\nHis farming company – Ropsley Farms based in Northleach near Chelthenham – specialises in cereal crops and showed net assets of £25.3 million in 2017.\nMeanwhile he and his family have dedicated an enormous amount of time and money to rejuvenating the beautiful Cotswold hamlet of Southrop, near Lechlade, with the aim of creating a sustainable green community that isn’t a dormitory village abandoned during the week by city commuters.\nHe acquired the 17th century pub – The Swan – and with the help of a London restaurateur, transformed it into a popular English pub with an award-winning restaurant and produce from its own gardens. It counts Kate Moss, Gary Barlow and Jason Donovan among its clients.\nMeanwhile his obstetrician daughter Caryn Hibbert and her film director husband Jerry moved into the nearby Manor House and have transformed it into the focus of the village, with luxury boutique accommodation, holiday cottages, a spa and a cookery school and event caterer named Thyme at Southrop.\nThe Southrop estate shows assets of just under £3 million. 39 (39) Tim and Andrew Storer and family £50m (£50m)\nThe Storer family’s Syston-based Pukka Pies donated 17,000 pies and pasties to the Fare Share network in 2017. Fare Share distributes food to charities and community groups. In addition the company donated more than £21,000 to local charities, supporting sports and outdoor activities.\nThe company and its 280 employees also raise money for Macmillan Cancer Support.\nTurnover has increased at the company from £44.8 million to £45.8 million as the business focuses on its most profitable divisions. Pre-tax profits were down to £3.62 million from £6.49 reflecting increased raw material costs.\nThe famous pie business is run by Andrew and Tim Storer and produces one of the best-known names in hot meat pies – the Pukka Pie.\nThe late Trevor Storer worked in the family baking company, but when that was sold in the early 60s he set up on his own.\nTrevor Storer’s Handmade Pie Company opened for business in Earl Shilton in 1963, making 1,200 meat pies in its first week. Harry Kane, made using Pukka Pies\nThe following year, Trevor’s wife Valerie came up with the recipe for the chicken and mushroom pie, as well as a new name, and Pukka Pies was born.\nThe company began by selling to pubs, and then fish and chip shops and butchers.\nNow Pukka Pies – from traditional steak and kidney to the popular balti pie – can be found on the shelves of most supermarkets across the UK.\nThey are a staple at football grounds and a microwaveable range has also proved popular.\nTrevor Storer died in 2013 aged 83. He had retired when he was 65, but carried on as chairman until his death.\nThe business is run by his two sons, Tim,55, and Andrew, 58.\nPukka Pies is an award-winning business and its Syston site has the capacity to bake more than a million pies a week.\nIn 2012 the company opened a major £7 million extension to the factory in The Halfcroft, adding a new refrigeration plant and larger cold rooms.\nChief executive Deborah Ewan took over last year. 40 (41=) Graham and Alison Bell £48m (£45m)\nCastle Donington-based Available Car is probably the UK’s best known car supermarket group.\nTurnover hit £303.8 million in 2017 compared to £281 million the previous year, and pre-tax profits grew from £6.04 million to £8.43 million.\nThe north Leicestershire business is the UK’s biggest multi-channel used car retailer and third largest UK dealer by turnover.\nIt has a healthy balance sheet, with assets in excess of £35 million.\nThe first Midlands used car supermarket was opened by husband and wife Graham, 59, and Alison Bell, 58, in Castle Donington in 2002 aimed at offering a wide choice of high quality used cars at competitive prices in a non-pushy environment.\nThe Castle Donington site, which remains the company headquarters, covers 12.5 acres with the capacity to store 1,450 cars.\nThe second site opened in Sutton in Ashfield covering nine acres and employing staff from hotel and retail backgrounds rather than traditional used car sales CVs.\nAvailable Car opened in Cannock in 2013 and Leeds in 2016.\nThe company’s sites retail 35 used car brands.\nIt is a family-run business, with Graham and Alison Bell’s two daughters and son becoming directors in 2017.\nEvery one of the company’s 700 employees is a shareholder, receiving bonuses equivalent to 16.25 per cent of salary.\nGraham and Alison Bell also have interests in Motorlogica in Winsford in Cheshire and Daventry, Northants. 41= (46=) John Deacon £45m (£40m)\nDespite not being part of the current Queen line-up, Oadby-born bassist John Deacon is still sharing in past and present success.\nThe band’s company, Queen Productions, is doing very well thanks to the proceeds of the band’s 2018 tour.\nTurnover rose by £6.2 million to £18.6 million in the year to September 2017 boosted by royalties from live shows as well as mainstream royalties.\nThe release of the film Bohemian Rhapsody starring Rami Malek as Freddie Mercury will further boost the Queen coffers which all members of the band share in.\nIn the film John Deacon is played by New York-born actor Joe Mazzello, who has appeared in the films Jurassic Park and Shadowlands among others.\nDividends – which paid out £5.8 million in 2017 – are piling up not just from their songs which formed the soundtrack to so many lives, but also from the success of the long-running musical We Will Rock You.\nThat musical ran for 12 years at the Dominion Theatre in London before closing in 2014.\nJohn Deacon remains, along with Brian May and Roger Taylor, a director of Queen Productions which recorded pre-tax profits of £7.68 million in the year to September 2017.\nThe business has net assets of £3.78 million. Queen bass guitarist John Deacon\nBut despite being less in the limelight than Freddie Mercury, Brian May or Roger Taylor, it was John Deacon who wrote Queen’s biggest US hit “Another One Bites the Dust.”\nHe also wrote “You’re My Best Friend” and “I Want to Break Free” and will be remembered for creating the distinctive base riff on the Queen/David Bowie collaboration “Under Pressure.”\nJohn Deacon, aged 67, has now retired from music and did not play in Queen for their post-Mercury incarnations, or the 2012 London Olympics closing ceremony.\nHe was born and brought up in Oadby and attended Linden Junior School in Leicester, as well as Gartree High Scholl and Beauchamp Grammar School in Oadby.\nHe had his first guitar when he was seven years-old and played in his first band in 1965 at the age of 14.\nHe left the band to study at Chelsea College in London where he obtained a first class honours degree in electronics.\nIn 1971 he met Brain May and Roger Taylor at a disco, after being told they were in a band looking for a bassist.\nHe successfully auditioned in London and become the fourth member of Queen.\nHis last public appearance with Queen was at an AIDS charity concert in 1997.\nHe lives in London with his wife Veronica who he married in 1975. They have six children. 41= (44=) Kamlesh Thakrar and family £45m (£42m)\nThe Thakrar family is seeing the results of 35 years of hard work.\nThey have just sold Leicester-based filling station and forecourt business HKS Holdings to international petrol and energy group Prax.\nThe financial terms of the deal are undisclosed, but it probably means that our estimation of the Thakrar family’s wealth is on the conservative side.\nPrax is based in London and was established in 1999.\nIt owns the forecourt brand Harvest Energy.\nHKS trades as HKS Motors and HKS Retail, and is seeing increased profits and sales as it continues to acquire new sites.\nThe business turned over £221.27 million in 2017 compared to £157.68 the previous year. Pre-tax profits grew from £3.14 million to £5.64 million.\nThere were net assets of £22 million. HKS has sites across the country (Image: PA)\nHKS, which was run by Kamlesh Thakrar, 61, and his family, opened further sites in London last year, giving it six outlets inside the M25 and almost 70 across the UK.\nThe new sites are getting the benefit of investment in their food and shop facilities as well as the forecourt.\nThe Belgrave Gate-headquartered company was formed in 1984 and is now a significant competitor in the retail fuel sector and one of the largest independent forecourt chains in the UK. The company began with a single filling station in Ashby Road, Coalville. Now it has a portfolio of filling stations across the Midlands and south-east, many of which include mini-supermarkets, hot food installations and coffee shops.\nThe group was included in the 2017 Sunday Times Top Track 250 league table of fastest growing private mid-market companies.\nHKS also includes the £120 million turnover Melton-based Brobat Group which operates 23 Jet and BP forecourt sites in the East Midlands and Yorkshire. 41= (41=) Tony Marmont £45m (£45m)\nEnvironmental enthusiast Tony Marmont can’t stop inventing.\nThe 88 year-old who devised a way to make petrol from air, also has a theory that hydrogen can be split from oxygen in water by using sound waves.\nThe petrol from air invention stalled because it was too expensive, but Tony Marmont, who holds professorships from De Montfort, Loughborough and Nottingham University, believes his latest idea could drastically reduce the costs of hydrogen production.\nThe company which made Tony Marmont’s fortune – Cotts Beverages – was sold to Dutch-based drinks manufacturer Refresco last year in a deal worth £920 million.\nTony Marmont disposed of the business in the early 1990s to turn his attention to championing the cause of renewable and sustainable energy.\nHe has become one of the most respected campaigners for the green movement and is a passionate and generous benefactor in the field of research into renewable energy.\nHe has ploughed millions into university courses in renewable urban energy, and was appointed a visiting professor in the subject at Loughborough University.\nA far cry from Tony Marmont’s life in 1946 when, aged 16, he left Worksop College to join his father’s soft drinks company as a lorry driver.\nHis father had bought the E. Carter and Co mineral water company in the 1920s.\nHe worked his way up through the company and, at the helm from the late 60s, transformed Carters Gold Medal Soft Drinks Company into a very successful company. Professor Tony Marmont (Image: Chris Gordon)\nHe persuaded the fast-expanding supermarkets to take his products, and pioneered the use of plastic bottles.\nHe set up a factory in Scunthorpe to make the bottles, then in 1980 invested £6 million into a new factory in Kegworth which at the time was one of the most advanced soft drinks plants in Europe.\nBy 1993 the company was making more than £6.5 million a year. He sold the company to Hero for a reported £45 million and began his quest to further research into renewable technologies.\nHe founded Beacon Energy Limited in 1992 as a not-for-profit organisation to increase public awareness about climate change and ways to address it.\nThe company, which hosts hundreds of visitors a year including schoolchildren, demonstrates and promotes sustainability, with the emphasis on renewables, energy storage and carbon-neutral fuel.\nThe company is based in converted farm buildings between Nanpanton and Woodhouse Eaves in Loughborough.\nHe has provided around £3 million to Loughborough, De Montfort and Nottingham Universities to support their research into sustainable development, and all three now have world-leading research centres on the subject.\nHe built one of the UK’s first ever wind farms in Cumbria.\nHe has a home in Arizona which has an annual fuel bill of just $25. He is also a qualified helicopter and fixed wing pilot. 44= (46=) Dinesh Patel and family £42m (£40m )\nThe Patel family’s Leicester-based food company Lakshmi and Sons is reaping the benefits of its continued investment in its production facilities, leading to increased turnover and profits.\nLakshmi, which manufactures the popular Cofresh range of snack foods at a factory off Abbey Lane, has seen turnover increase to £29.8 million from £23.6 million and pre-tax profits hit £2.57 million from £2.23.\nThe business has net assets of £12.6 million.\nThe Patel family is led by 78 year-old Dinesh Patel – known as “Mr Cofresh”.\nThe company manufactures Asian snack foods, including Bombay Mix, rice sticks and nuts, which can now be found in most supermarkets.\nThe business traces its roots back to Nairobi in the early 1960s where Dinesh Patel founded a business making potato crisps and popcorn for local cinemas, shops and colleges. (l-r) Cofresh founder Dinesh Patel , brother’s Dhiru Patel & Arun Patel. Dinesh can still be seen on the factory floor from 7am till 4pm Monday to Sat working on the lines at the age of 77\nIn 1974 he and his wife Savita fled Kenya and emigrated to Britain, where he revived his business.\nThey invested their savings in a fish and chip shop while Dinesh perfected his Asian snacks, beginning with spicy peanuts and green peas to supply to local shops and pubs.\nDemand for the products grew quickly and the business flourished, with the help of Dinesh’s brothers.\nIn 1997 Dinesh’s sons Priyesh and Minesh joined the business and more expansion followed.\nCofresh now has more than 200 products in its range with 1.5 million consumers every week.\nDinesh Patel stills takes an active role in the business.\nA new 140,000 sq ft manufacturing facility was opened in Menzies Road near the National Space Centre in 2015 to meet increased demand.\nIt can make two million snack packets a day.\nCofresh chief executive Priyesh Patel won the 2015 Leicester Mercury Business Executive of the Year title. 44 (44=) Sandy Anderson £42m (£37m)\nSandy (Alexander) Anderson, 63, is a Loughborough-based financier and entrepreneur whose fortune has come from train leasing, property, agriculture and events management.He owns the Thistledown Group, which has several divisions including Thistledown Developments – a residential development company, Thistledown Farms and Thistledown Properties, which provides access to funding for the acquisition or development of residential sites. Thistledown is most active in the Midlands and South and has several projects on the go, including developments in Oxford, Nottingham and Ascot. Thistledown Developments shows net assets of more than £6 million.In 2004, Thistledown acquired SpringHealth Leisure plc in a £3.4 million deal. The business operated leisure clubs around London but went into liquidation in February this year.He is a non-executive director of Business Control Solutions, a Peterborough-based software company which offers browser-based products to help financial and business management. In 2016 BCS turned over £31 million and made a pre-tax profit of £4.14 million.He became a multi-millionaire from the sale of his Porterbrook train leasing business to Stagecoach in 1996. The sale netted him £33 million.He is also a director of the Stoneleigh-based events management company Grandstand. The Grandstand Group was established in 1994 as Grandstand Media and entered the corporate market in 2001 under the brand of Zinc Management. It counts Stoneleigh showground an the Royal Agricultural Society among its clients, and has the management rights to the Horse of the Year Show until 2036 and the British Showjumping National Championships until 2020. It also runs an event venue search service.A horse and pony enthusiast – especially Welsh ponies – and owner of the Thistledown Stud in Costock, he went to Strathclyde University and lives in Loughborough.Sandy Anderson’s other companies include Derbyshire-based Formula Tanker Rental and Morley Leisure and Nottinghamshire-based wholesale clothing and footwear company TSS&P. 44 (44=) Surjit Rai £42m (£42m)\nSurjit Rai and his family came to the UK from the Punjab when he was aged just seven.\nNow he owns and runs one of the UK’s largest independent care home groups.\nSurjit Rai, 60, studied business in Derby and helped his father who ran a chain of grocery shops across Derbyshire.\nIn 1989, he acquired a single care home and so began the company that is now Rushcliffe Care.\nThe business, which is based in Epinal Way, Loughborough, began with just 56 beds.\nNow it has well over 1,000 and provides a wide range of care, including dementia, mental health, rehabilitation, nursing, specialist hospital care for people with acute health needs, and old persons residential care.\nHe now has 29 care homes around the country, concentrated in Leicestershire, Derbyshire, Nottinghamshire, Essex and Staffordshire.\nHe also has a training centre in Leicester which has developed a learning programme for overseas nurses in conjunction with the University of Northampton.\nRushcliffe also runs a specialist mental health unit at Aberavon in South Wales.\nThe business turned over more than £25 million in its last published accounts for 2016.\nTurnover is slightly down following the sale of a home in Harlow, Essex.\nPre-tax profits are up, though, at £3.75 million compared to £2.46 million the previous year. It showed net assets of £16.5 million.\nRushcliffe Care, which employs more than 900 people including 600 in Leicestershire, is a past winner of the Independent Care Operator of the Year award and won the 2015 Healthcare and Pharmaceutical Award for sustained excellence and quality and the Healthcare Business Award in the Asian\nBusiness Awards.\nIn March 2015 Rushcliffe’s child services division merged with Turnaround Care to form the Esland Group which helps youngsters with behavioural problems and learning difficulties.\nRushcliffe has been consistently profitable, and the demographic trend towards longer life and more care requirements has lifted the group’s performance. 47 ( - ) Chris Beighton and family £40m (new entry)\nChris Beighton and his wife Judy founded affordable housebuilder Westleigh in 1985.\nThe business was sold to developer Countryside Properties in April in a deal which, subject to future performance, could be worth up to £135 million.\nWestleigh was a successful construction company and in the year up to its sale delivered more than 1,100 homes in partnership with local authorities and housing associations.\nIt turned over more than £150 million and generated an operating profit close to £16 million.\nIt held a bank of 4,981 plots.\nSince its foundation Whetstone-based Westleigh’s reach expanded throughout the East and West Midlands and into South Yorkshire.\nThe business employed 450 people who were absorbed into Countryside on the sale. Westleigh chairman and founder Chris Beighton\nChris Beighton sold a £21 million stake in the company to Palatine Private Equity in July 2016.\nPalatine achieved a triple return within two years of their investment.\nCountryside is based in Brentwood, Essex and has housing developments in the London region and in the North West.\nChris Beighton now runs Grange Commercial Developments based on the Grange Business Park in Leicester.\nAway from building houses, Chris Beighton is a motorsport enthusiast.\nHis first competitive race was the Manx Challenge in a Sunbeam Tiger in 1998.\nHe has since raced in the British GT Championship, the Le Mans Classic and the Goodwood Revival.\nWith his son Ben in co-driver’s seat he won the Masters 70s Allcomers Race at Spa in 2016.\nHe is an accomplished swimmer and water skier, and enjoys skiing. 48 (48) Richard Everard OBE and family £35m (£36m)\nProfits and sales have held steady at Everards Brewery despite a small reduction in its pub estate.\nLatest turnover was £31.3 million while profits before tax reduced slightly to £2.26 million.\nThe historic brewer – the company behind Tiger Best Bitter – is preparing to move to new premises next year near police HQ.\nIn the meantime, following the sale of its Castle Acres site to the Crown Estate, Everards has been partnership brewing with Robinsons of Stockport and Joules of Market Drayton.\nThe business is temporarily based in Optimus Point, Glenfield – also home of its logistics operation.\nNext year Everards will be moving to a new brewery, alongside offices and a beer hall on the 85-acre Everards Meadows site, while the old brewery site next door becomes a £150 million extension to Fosse Park.\nThe Everards estate totals 173 pubs ranging from village inns to community locals.\nAll are within a 70 mile radius of the brewery and all are tenancies.\nWilliam Everard brewed his first pint in 1849. Fancy a pint? (Image: Everards Brewery)\nToday the brewery is run by the same family and current chairman Richard Everard OBE is the fifth generation of his family to run the business.\nEverards takes its community responsibilities seriously, with the Everards Foundation helping community projects throughout the county to the tune of more than £1 million to date.\nEverards also sponsors several local sports clubs covering cricket, squash and basketball\nIt is the official beer supplier to Leicester Tigers and sponsors snooker and darts leagues.\nThe company’s sponsorship of sport is no surprise.\nRichard Everard attended Eton and loved football, cricket, rugby and Eton Fives.\nBefore joining the family business he trained at the Royal Military Academy, Sandhurst, gaining a commission in the Blues and Royals in 1973.\nHe served in Northern Ireland, Germany and Cyprus and represented his regiment at rugby, cricket and skiing.\nHe joined the family brewery in 1977, becoming a district manager in 1979 and chairman in 1986.\nIn 2002 he was appointed High Sheriff of Leicestershire and appointed Vice Lord Lieutenant of the county in 2007.\nHe is Honorary Colonel of the Leicestershire, Northamptonshire and Rutland Army Cadet Force and has an Honorary Doctorate of Laws from the University of Leicester.\nHe was awarded the OBE in 2011 for services to the community.\nHe is married to Caroline and they have a son and a daughter. 49 (49=) Gary Lineker £32m (£30m)\nGary Lineker isn’t afraid to express his views outside of football.\nHe has regularly been vocal about his opposition to Brexit, and has thrown his support behind the People’s Vote campaign for a second referendum.\nAs he doesn’t front any news or politics shows on the BBC, the corporation is quite happy to let him express his views. He’s unlikely to want to upset them as they pay him around £1.8 million a year for hosting Match of the Day.\nHis earnings from the BBC, BT Sport and Walkers Crisps dwarf anything he ever earned from playing football.\nHe is an honorary vice-president of Leicester City, the club that he turned out for 194 times between 1978 and 1985, scoring 95 goals for them.\nHe moved from Leicester to Everton in 1985, and then to Barcelona.\nHe returned to the UK in 1989 to join Tottenham Hotspur, scoring 67 goals for them.\nHe ended his career with Japan’s Nagoya Grampus Eight, turning out 23 times for them before retiring in 1994. Gary Lineker - footballer, TV entertainer and crisp eater (Image: Haymarket Theatre)\nHe had a distinguished international career, playing for his country more than 80 times and scoring 48 goals – just one fewer than record holder Bobby Charlton.\nFamously he never received a yellow or red card.\nHe went to Caldecote Road School in Braunstone and on to Leicester Boys Grammar School (now City of Leicester College) in Evington where he excelled in cricket and football.\nHe captained the Leicester Schools Cricket Team, but chose to concentrate on football despite one of his teachers telling him he’d never make any money out of it.\nHe has his own production company, Goalhanger Films, which produced short videos on YouTube during the FIFA World Cup as well as an FA Cup documentary for the BBC.\nHe married wife Danielle in 2009 and has four sons by a previous marriage.\nThey divorced in 2015.\nHe has been an enthusiastic supporter of Leukaemia charities after his eldest son George survived the disease in 1990. More On ", "external_links": [], "published": "2018-11-20T02:00:00.000+02:00", "crawled": "2018-11-20T14:15:04.006+02:00", "highlightTitle": ""}