{"organizations": [], "uuid": "250c3482a7d60554429322a3d67cc32d1c89ee74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15223809.ece/ALTERNATES/s1200/0_Coventry-City-v-Sunderland-Sky-Bet-League-One.jpg", "site_section": "http://www.thejournal.co.uk/sport/?service=rss", "section_title": "ChronicleLive - Sport", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/sunderland-afc-news-transfers-live-15407825", "country": "GB", "domain_rank": 21960, "title": "Sunderland AFC news and transfers LIVE - Build-up to Checkatrade Trophy clash at Morecambe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T07:00:00.000+02:00", "replies_count": 0, "uuid": "250c3482a7d60554429322a3d67cc32d1c89ee74"}, "author": "Sean McCormick", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/sunderland-afc-news-transfers-live-15407825", "ord_in_thread": 0, "title": "Sunderland AFC news and transfers LIVE - Build-up to Checkatrade Trophy clash at Morecambe", "locations": [], "entities": {"persons": [{"name": "jim bentley", "sentiment": "negative"}, {"name": "ryan christie", "sentiment": "none"}, {"name": "christie", "sentiment": "none"}, {"name": "george honeyman", "sentiment": "none"}, {"name": "sean mccormick honeyman", "sentiment": "none"}], "locations": [{"name": "morecambe morecambe", "sentiment": "none"}, {"name": "forest green", "sentiment": "none"}, {"name": "parkhead", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "sunderland afc", "sentiment": "negative"}, {"name": "celtic sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When and where they are in action this week. 10:54 Sean McCormick Jonny Evans: I couldn't be the player I am without Roy Keane\nEvans enjoyed a successful loan spell at Sunderland early in his career while Roy Keane was boss and he has praise the Ireland assistant manager ahead of the clash between Northern Ireland and Ireland this week.\nHe told the Belfast Telegraph:\n“It was my first time playing competitive league football in England. When you are a young player and making your way up, you always wonder whether you can make that next step up.\n“And it was the next progression for me at that time. I was grateful that Roy gave me that opportunity to go to Sunderland as I had been on loan at Antwerp.\n“I thought that I was going to be there (in Belgium) for the season, but then word went around that Sunderland were interested and he was the manager.\n“It was a no-brainer and I could not wait to get up there. It was a great experience.” Jonny Evans when at Sunderland (Image: 2008 Getty Images) 10:22 Sean McCormick FA put forward drastic homegrown player Brexit plans for the Premier League\nBut they are thought to be happy with the EFL’s existing arrangements, so it shouldn’t affect Sunderland too much.\nThe FA is thought to be comfortable with the EFL’s existing arrangements, where seven of the 18-man match-day squad have to be homegrown, including at least one who has come up through the club’s academy. 09:56 Sean McCormick Jake Clarke-Salter reflects on Sunderland spell\nThe former Black Cats loanee is currently on international duty with England under-21s and he has been asked about his experience on Wearside.\nNow on loan at Dutch side Vitesse, he, alongside Arsenal youngster Dan Crowley - who is on loan at Willem II - have given an exclusive interview to the Telegraph.\nHe said:\n“We weren’t doing that well and the Championship has a lot of big clubs. Here it is a different type of atmosphere. You are expected to win and if you don’t then it’s pressure. I enjoy every minute of it. I don’t want to be playing Under-23s football now I have experienced this.” England U21's Jake Clarke-Salter (right) and Romania U21's Virgil Ghita (Image: PA) 09:32 Sean McCormick James Fowler on Sunderland's tight defence\nThe Black Cats have gone from leaking early goals to having the meanest defence in League One. Assistant manager James Fowler has explained to ChronicleLive how they have gone about making that change.\n“It [the lack of clean sheets] was one of the things we identified.\n“We were conceding goals at the start of games so it was something we looked at in terms of preparation and the warm-up, how we started games, how we played for the first 10-15 minutes.\n“It’s gradually got better and we are still winning, which is made much easier when you are not conceding.\n“Working with the players week-in, week-out, the confidence of the players, and then of course Jon McLaughlin has played his part when he has had to make saves and we know how good a goalkeeper he is.\n“We haven’t won games easily, there have always been spells in the games whether the other teams have had opportunities but I think as the season has progressed we have dealt with those spells better.\n“That’s on the back of coming off a run of games with clean sheets in the league.”\nFull story.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15407825;", "https://www.thevisitor.co.uk/sport/football/shrimps/morecambe-boss-jim-bentley-is-ready-to-rotate-squad-against-sunderland-1-9440236", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-13T07:00:00.000+02:00", "crawled": "2018-11-13T10:48:01.004+02:00", "highlightTitle": ""}