{"organizations": [], "uuid": "6c860349960fb4a8311ec2e9404516c7cc700597", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2241519.ece/ALTERNATES/s1200/0_Dse7jCxUcAA248C.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/noel-edmonds-revealed-im-celebrityget-2241521", "country": "GB", "title": "Noel Edmonds revealed as I'm A Celebrity...Get Me Out Of Here contestant", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-21T08:55:00.000+02:00", "replies_count": 0, "uuid": "6c860349960fb4a8311ec2e9404516c7cc700597"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/noel-edmonds-revealed-im-celebrityget-2241521", "ord_in_thread": 0, "title": "Noel Edmonds revealed as I'm A Celebrity...Get Me Out Of Here contestant", "locations": [], "entities": {"persons": [{"name": "noel edmonds", "sentiment": "none"}, {"name": "harry redknapp", "sentiment": "none"}, {"name": "emily atack", "sentiment": "none"}, {"name": "anne hegerty", "sentiment": "none"}, {"name": "edmonds", "sentiment": "none"}, {"name": "noel", "sentiment": "none"}], "locations": [], "organizations": [{"name": "digital", "sentiment": "none"}, {"name": "house party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Noel Edmonds revealed as I'm A Celebrity...Get Me Out Of Here contestant Deal or No Deal: Star says he will quit TV if he wins the series Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 06:55, 21 NOV 2018 Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nNoel Edmonds has officially been announced as an I'm A Celebrity contestant.\nThe 69-year-old former host of Deal Or No Deal and Noel's House Party will enter the Australian jungle to join stars including football manager Harry Redknapp, quiz expert Anne Hegerty and actress Emily Atack.\nEdmonds's arrival had been rumoured and was confirmed by the official I'm A Celebrity Twitter account on Tuesday.\nThe tweet said: \"Time to really get this party started! Noel Edmonds is coming to the Jungle!\" Read More\nThe post, which described Edmonds as a \"TV legend\", listed his phobias as heights and confined spaces.\nIt did not say when he would be entering the jungle.\nEdmonds has said he will quit TV if he wins I'm A Celebrity. He said: “That’s a deal I’m prepared to do with the British public.\n“If they do vote me king of the jungle I will never appear on television again. Read More I'm A Celeb 2018: Ant McPartlin's message to Holly Willoughby ahead of first show\n“Fifty years is long enough – give us a break, for Christ’s sake, we’ve got enough problems with Brexit.\n“Now I’d be very happy to do that deal but it’s on terms I win the bloody thing.\n“I’ve had a fantastic relationship with the British public. I may be Marmite but there’s a hell of a lot of people that seem to like Noel’s version of Marmite.”\nEdmonds will be one of the biggest names on the ITV show, fronted by Declan Donnelly and this year Holly Willoughby.\nIn 2016 he came under fire after claiming that an electromagnetic pulse machine, EMPpad, \"tackles cancer\". Read More I'm A Celebrity's Noel Edmonds is 'afraid of water' says ex ahead of show\nIn 2017 Edmonds said he came close to taking his own life after falling victim to financial fraud.\nOther celebrities taking part this year include DIY SOS host Nick Knowles, pop stars James McVey of The Vamps and Fleur East, former EastEnders star Rita Simons, Coronation Street actress Sair Khan and Hollyoaks actor Malique Thompson-Dwyer. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-21T08:55:00.000+02:00", "crawled": "2018-11-21T09:17:27.010+02:00", "highlightTitle": ""}