{"organizations": [], "uuid": "842618e28ad5c69d7c4815e1ce030a5ea8ae1c2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2267907.ece/ALTERNATES/s1200/1_TP_TEM_281118warehouse_01.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/two-big-warehouses-near-j21-2267903", "country": "GB", "domain_rank": 48128, "title": "Two big warehouses near J21 of M1 ready for tenants", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-28T14:12:00.000+02:00", "replies_count": 0, "uuid": "842618e28ad5c69d7c4815e1ce030a5ea8ae1c2a"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/two-big-warehouses-near-j21-2267903", "ord_in_thread": 0, "title": "Two big warehouses near J21 of M1 ready for tenants", "locations": [], "entities": {"persons": [{"name": "goodman", "sentiment": "none"}, {"name": "kenny leadbeater", "sentiment": "none"}, {"name": "stephen george", "sentiment": "none"}], "locations": [{"name": "leicester lane", "sentiment": "none"}, {"name": "leicester commercial park", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}], "organizations": [{"name": "get business work", "sentiment": "none"}, {"name": "sgp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Two big warehouses near J21 of M1 ready for tenants Work has been completed on £15.75m project to build the two warehouses at Leicester Commercial Park, near Enderby Share One of two Grade A warehouse units at Leicester Commercial Park Get Business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nWork has finished on two big warehouses on the outskirts of Leicester.\nBuilding design firm Stephen George + Partners (SGP) said work had been completed on the two units at Leicester Commercial Park, off Leicester Lane, near Enderby.\nThe £15.75 million project for global industrial property group Goodman, includes a 337,000 sq ft warehouse with three-storey offices totalling 13,000 sq ft.\nThere is also a 96,000 sq ft warehouse with almost 9,000 sq ft of office space across two floors.\nThe units, which are close to Grove Park and junction 21 of the M1, are still to be let.\nKenny Leadbeater is an associate at SGP, which recently moved into a new headquarters in Grove Park. Leicester Commercial Park\nHe said: “Goodman took this strategically located logistics site to market and developed the brief from the established need for larger units.\n“The two buildings are landmarks, providing a dynamic entrance to the park and setting the tone for this high quality development.”\nHe said SGP’s design balanced the client’s brief with local planning requirements.\nAlthough the site is bounded on the east by the M1, the west of the site – which was previously green fields – can be seen from a private, listed house. Read More Topps Tiles explains why it's stockpiling top selling products ahead of Brexit\nThe vast buildings were designed in a bid to try and lessen the impact on the view across historic parkland.\nSGP's design also placed the offices on the corners of the main building facing the road to add interest and aid wayfinding. One of the warehouses at Leicester Commercial Park\nMr Leadbeater: “The site was delivered to BIM Level 1 and it was extremely beneficial to be able to explore the design with the client through 3D visuals and virtual reality.\n“Goodman has a long heritage of providing high quality industrial and logistics property and this scheme continues that with a pair of landmark warehouses that are ready for occupation, built to a fundable standard and provide a quality beginning to the overall commercial park.” Read More Stephen George + Partners host big party to showcase self-designed Grove Park HQ\nNigel Doolan, development director at Goodman, said: “Leicester Commercial Park offers our customers high quality, Grade A space in an unrivalled location.\n“The design reflects the site’s prominent position, providing a gateway destination for customers wanting to operate from the heart of the UK.”\nBoth units have been developed to a BREEAM ’very good’ specification and an EPC ‘A’ rating. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-11-28T14:12:00.000+02:00", "crawled": "2018-11-28T15:42:18.000+02:00", "highlightTitle": ""}