{"organizations": [], "uuid": "5c5b08713106faf0e5460d3afddbc066bdb5c2dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15456880.ece/ALTERNATES/s1200/0_IMP_MGA_120418mgatoysrus_26JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/more-north-east-businesses-going-15456725", "country": "GB", "domain_rank": 21960, "title": "Numbers of North East businesses going bust rising at faster rate than any other part of the country", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-23T16:53:00.000+02:00", "replies_count": 0, "uuid": "5c5b08713106faf0e5460d3afddbc066bdb5c2dd"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/more-north-east-businesses-going-15456725", "ord_in_thread": 0, "title": "Numbers of North East businesses going bust rising at faster rate than any other part of the country", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "yorkshire & humber", "sentiment": "none"}, {"name": "insolvency service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Numbers of North East businesses going bust rising at faster rate than any other part of the country The insolvency rate in the region is on the up according to latest figures from the Insolvency Service Share Closing down signs in a shop (Image: Evening Gazette) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nMore businesses are going bust in the North East than any other part of the country, new figures have revealed.\nNew statistics uncovered by the Insolvency Service show that the region is the only part of England and Wales to have seen a rise in the rate of businesses becoming insolvent last year.\nThe insolvency rate in the region increased from 114 to 123 per 10,000 enterprises during 2017 – substantially ahead of the overall insolvency rate for England and Wales, which was 81 per 10,000 companies.\nOnly the Yorkshire & Humber region, with 129 insolvencies per 10,000 enterprises, has a higher rate of corporate insolvency than the North East, although that figure fell from 141 the previous year.\nAndrew Haslam, chair of North East insolvency and restructuring trade body R3, is now advising regional business owners to ensure they maintain a strong grip on their finances, especially with the economic uncertainty around the impact of Brexit coming ever more sharply into focus. Andrew Haslam, chair of R3 in the North East and head of FRP Advisory LLP’s Newcastle office (Image: Publicity Pic)\nAcross the whole of England and Wales, there were 14,210 enterprise insolvencies in England and Wales, a figure which is broadly similar in both 2015 and 2016.\nApproximately 187,000 people worked for an enterprise which collapsed into insolvency last year – while the combined turnover of these enterprises is estimated to be £23.4bn.\nEnterprises aged between four and nine years old, with turnover of £500,000 to £1m, or employing 20-49 people have the highest rate of insolvency.\nAndrew Haslam, who is also head of specialist business advisory firm FRP Advisory LLP’s Newcastle office, says: “The Government has made a point about boosting the Northern economy, but there is clearly still a long way to go, and it’s notable that the region has also persistently had the highest rate of personal insolvency in the country over the last decade.\n“Companies trying to expand often encounter unique difficulties. Founders may struggle to ‘let go’ and trust new management, new locations might not work, or new products may not perform as well as expected, despite significant investment. Read More Rural North East could face 'spiral of decline' from Brexit, report warns\n“For fast growing companies, the back office processes tend not to keep up with sales: a company may have a popular service or product, but the credit management or HR structures haven’t kept pace.\n“Access to finance can be an obvious issue for growing companies, and working capital might not be available to companies in this position. Moreover, inexperienced directors may also struggle to get to grips with working capital requirements, and it’s in companies this size where a lack of equity becomes obvious.\n“Problems can quickly arise for any business in any sector at any time, and owner/managers need to be ready to take swift action if they foresee problems coming their way.\n“Maintaining a clear overview of their cashflow situation, communicating clearly with their customers and suppliers and getting early qualified professional advice will give them the best possible chance of getting things back on an even keel.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-23T16:53:00.000+02:00", "crawled": "2018-11-23T18:15:00.027+02:00", "highlightTitle": ""}