{"organizations": [], "uuid": "636967c979e6d979e1c2ce205090ba7b010bb7fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15158620.ece/ALTERNATES/s1200/0_Great-Exhibition-of-the-North.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tells-government-back-well-15407303", "country": "GB", "domain_rank": 21960, "title": "North tells Government: Back us and we'll make a success out of Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-12T20:42:00.000+02:00", "replies_count": 0, "uuid": "636967c979e6d979e1c2ce205090ba7b010bb7fd"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tells-government-back-well-15407303", "ord_in_thread": 0, "title": "North tells Government: Back us and we'll make a success out of Brexit", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "yorkshire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The launch of the Great Exhibition of the North in Newcastle (Image: PA) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe North of England should lead the way in making Brexit a success, leaders from across the North have declared.\nIt’s one of a number of findings from the first “Convention of the North”, which are to be presented to the Government.\nCouncil leaders, mayors and other senior figures from the North East, North West and Yorkshire met in Gateshead in September for the first ever Convention of the North.\nThey’ve now published a report which says: “Against a backdrop of national pessimism, the North should be sounding a different note offering a vision of a hopeful and forward-looking North.”\nHundreds of convention delegates agreed that Government must work with the region to establish a northern Brexit taskforce, to respond to any challenges in the months ahead.\nThe report also backed calls for the North to take control of transport policy, through the new Transport for the North authority.\nAnd it said the planned Northern Powerhouse Rail project, including a new line between the North East and North West, should be given the same priority as the HS2 high speed rail network currently being built.\nThe findings will be raised with Northern Powerhouse Minister Jake Berry at a meeting with Nick Forbes, Leader Newcastle City Council; Mayor Dan Jarvis MP, Sheffield City Region; Christine Gaskell, chair of Cheshire and Warrington Local Enterprise Partnership and Deputy Chair of NP11; Geoff Driver, leader of Lancashire County Council. Newcastle City Council Leader Nick Forbes at the Convention of the North in Gateshead (Image: Newcastle Chronicle)\nThis week’s talks come as the Government prepares to publish a new “Northern Powerhouse” strategy.\nNewcastle City Council leader Nick Forbes said: “The North has sent a clear message to Government that devolution must continue. That’s a belief that crosses political boundaries and unites groups from businesses to faith leaders.\n“Last September saw an historic gathering of people across the north uniting behind one voice. We are clear that given the tools, we can make the powerhouse a reality.\n“When the North succeeds, the UK succeeds.” Read More Congestion charges for cars could happen if the bus company behind Go North East gets its way\nCarl Les, leader of North Yorkshire County Council, said: “We want to push forward economic growth and secure the best possible future for our communities right across the North and as Northern leaders we agree that devolution is the way forward.\n“This report makes it clear that devolution brings the funding and the freedom to make important decisions closer to where the impact will be felt - for our rural as well as our urban regions. We are different in many ways, including politics, but we have an enormous amount in common too. We need to speak with one voice to be heard.”\nMayor of Greater Manchester, Andy Burnham, said: “For the first time ever the North of England came together as one this summer at the inaugural Convention of the North. The north is uniting, it is demanding change and the power to do more for itself.\n“The North of England has huge potential but we need Ministers to help us unlock it. We need investment in projects like Northern Powerhouse Rail to make the promised Northern Powerhouse a reality. But we also need basic day-to-day powers over the running of roads, buses, trains and taxis. Our current outdated, fragmented and unaccountable transport system is holding back the North.\n“Our politics is far too divided but devolution gives us something to unite around. Together we can show communities here that they really can take back control and rise to the challenges of Brexit.” Read More\nThe Convention report sets out the next steps Government and the North must now take to continue the devolution journey and increase growth.\nRecommendations in the report include:\nDeveloping an investment prospectus for the North –This will build on the strengths of the North to identify investment opportunities.\nDevolution of transport powers – The North needs a modern integrated transport system, that enables all its citizens to fulfil their potential and its economy to fire on all cylinders. This means that Northern Powerhouse Rail must be fully funded, and that Transport for the North needs to be given the powers to do its job properly.\nEmpower a northern Brexit Taskforce – The North should build on the preparatory work that is being undertaken in many places to establish a Northern Taskforce with Business Leaders, Universities and Local Government Leaders to co-ordinate Brexit preparations.\nInclusive Growth Good Employment Charter – Many places across the North are developing their own inclusive growth strategies and engaging with employers to develop agreed approaches to good work. There is now an opportunity to widen and consolidate these in discussion with business organisations to create a Northern Good Employment Charter.\nSkills and Education Agreement – Closing the education and skills gap was agreed as a core priority for the Convention. There needs to be significantly more devolution of skills funding and new measures to drive improvement collaboration across the region. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-12T20:42:00.000+02:00", "crawled": "2018-11-12T22:04:20.013+02:00", "highlightTitle": ""}