{"organizations": [], "uuid": "1c661ea6ee57c8147cc1bc71f2b53afb3207dc60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15358707.ece/ALTERNATES/s1200/2_BHR_nec011118Craig_01jpeg.jpg", "site_section": "http://www.chroniclelive.co.uk/whats-on/?service=rss", "section_title": "ChronicleLive - What's On", "url": "https://www.chroniclelive.co.uk/whats-on/film-news/craig-conway-resigns-newcastle-film-15358588", "country": "GB", "domain_rank": 21960, "title": "Craig Conway resigns from Newcastle Film Festival but says North East remains his 'key focus'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-01T18:05:00.000+02:00", "replies_count": 0, "uuid": "1c661ea6ee57c8147cc1bc71f2b53afb3207dc60"}, "author": "Barbara Hodgson", "url": "https://www.chroniclelive.co.uk/whats-on/film-news/craig-conway-resigns-newcastle-film-15358588", "ord_in_thread": 0, "title": "Craig Conway resigns from Newcastle Film Festival but says North East remains his 'key focus'", "locations": [], "entities": {"persons": [{"name": "craig conway", "sentiment": "negative"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "newcastle film festival", "sentiment": "negative"}, {"name": "newcastle international film", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Craig Conway resigns from Newcastle Film Festival but says North East remains his 'key focus' Surprise move sees founder member of Newcastle International Film and TV Festival leave to nurture industry's grass roots instead Share Craig Conway has resigned from Newcastle International Film Festival (Image: Hightlights PR) Get what's on updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nActor and producer Craig Conway has resigned from Newcastle International Film Festival which made a glittering debut earlier this year.\nJust months after the premiere event attracted film-makers to the city from around the world, its co-founder has decided to move on.\nBut the North East talent - who co-stars in a film having its UK premiere in London this weekend - is keen to stress his commitment to his home region, saying it will it remain \"a key focus point\" in his work.\nWhen the festival - full name Newcastle International Film and TV Festival - took place in spring, its Easter weekend programme of screenings and events was attended by film-makers from abroad and a scattering of big names including Jools Holland, Mike Hodges and Caroline Goodall - and Conway was one of the driving forces behind it. International actress Caroline Goodall and North East actor Craig Conway (Image: Newcastle Chronicle)\nHis resignation leaves co-founder Jacqui Miller-Charlton at the helm of the festival - which is due to make a return next year - and of the local production company 54 Films Ltd which sprang up in its wake.\nConway, who is based in London, had brought technical know-how to the festival but now wants to focus more on the grass roots potential of the region's film-making industry rather than support it behind the scenes.\nFinding ways to educate independent film-makers, and to get new work seen and distributed throughout the market, means going back to the making of productions with creative talent, he said.\n\"I want time to be able to pursue the rest of that but the festival becomes a full-time job,\" he explained.\nOn Sunday, Conway will be on the red carpet with fellow cast and crew at the UK premiere of horror film Mara at the Empire Cinema in Leicester Square.\nThe film, which has already had its US debut, sees him play the supporting lead role of a sleep-deprived character called Dougie, opposite actress and model Olga Kurylenko, in a tale by North East writer Jonathan Frank.\nConway, who prior to that co-starred as Russian assassin Viktor in Pierce Brosnan film Final Score, wants to see more film industry connections between the north and south - and the wider world.\n\"We need bigger and stronger connections with the north, south and internationally and, with Brexit looming, I feel it's important we don't divide ourselves anymore,\" he said. Craig Conway (Image: Hightlights PR)\nOf Brexit uncertainty, he feels it's important to embrace and move with what's coming and to build international partnerships.\nBut, at heart, it's the North East that he wants to see reap benefits. \"That is always the aim,\" he said. \"Bringing back to the region is a key focal point. It''s a hotbed of talent.\n\"We are going to be bringing lots of production elements and the support mechanism back to the North East\"\nTo that end, he has a North East project in the pipeline for 2019: a social drama -95% of which will be filmed in the region - involving young people. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n\"It's going to be a quite wonderful film project,\" he said.\nAs for Newcastle International Film Festival, he said: \"I am still going to be supporting anything that supports film-making in the region.\n\"It has a good opportunity to do something great and needs to engage with the wider region.\n\"If the film festival wanted to ask me to support it, I am open to talking about that.\"\nIn Friday's announcement of Conway's resignation, president Jacqui Miller-Charlton and colleagues thanked Conway for \"his fantastic contribution in his role as one of the co-founders of the inaugural festival.\"\nThe businesswoman added: \"We wish Craig every success in all his future endeavours and look forward to continued collaborations with him for the benefit of all in the future.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-01T18:05:00.000+02:00", "crawled": "2018-11-02T02:20:36.001+02:00", "highlightTitle": ""}