{"organizations": [], "uuid": "bb1eb7281279862de784f95632030c29d24421e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12381030.ece/ALTERNATES/s1200/SGP_NEC_291216SUNRISE01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15437140", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-21T07:00:00.000+02:00", "replies_count": 0, "uuid": "bb1eb7281279862de784f95632030c29d24421e3"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15437140", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "none"}, {"name": "clean tyne partnership", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "chester-le-street", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "09:32 NUFC's striker struggles\nNewcastle have spent around £63million on transfer fees and many millions more on loans and fees.\nBut of the 22 front-line forwards signed in the Mike Ashley era, more than half have been failures as Newcastle have tried to plug their striker gap on the cheap.\nIslam Slimani was the latest example of a player recruited to help solve United’s goalscoring problems who has not worked out. But there are others – with United’s attempts to extract value from the striker market hardly working out. 09:22 Piers Morgan chases co-stars with TARANTULA\nThis is the moment Piers Morgan chased his Good Morning Britain co-stars around the studio with a huge TARANTULA on his hand.\nSusanna Reid , Kate Garraway and Laura Tobin scooted away from Morgan as he ran up to them with the large spider on his hand, as part of a segment about I’m A Celebrity... Get Me Out Of Here! on the ITV morning programme.\nYou can watch the 56-second clip here . (Image: ITV) 09:11 Drive safe this morning\nA handy warning from Tyne and Wear Fire and Rescue service on this damp November day. 08:53 Two car crash in North Shields\nPolice are at a crash on Tynemouth Road in Washington Terrace.\nTraffic is heavy, and we’ll keep you informed with any updates. 08:42 Metros 'frequent' but not to timetable\nMetros are running today, but they may not arrive quite when you expect.\nA Metro spokesperson said: “We are running a frequent service with trains running to all destinations but not to the usual timetable in some areas. This is due to low rail adhesion.” 08:29 A1 traffic extra slow before Kenton Bar\nTraffic is slow heavier than normal on A1 Northbound from A694 (Blaydon / Consett Turn Off, Swalwell ) to J77 Ponteland Road (Kenton Bar Roundabout, Kenton). There are no reports of an accident. 08:14 Bog on the Tyne?\nDebris and litter could be left floating down the Tyne, as a decades-old project to keep the river clean faces a cash crisis.\nGateshead Council has revealed it intends to withdraw from the Clean Tyne Partnership next year, as part of measures to close its own £29 million budget gap. (Image: Handout)\nThe announcement that Gateshead intends to pull its £17,000 funding follows the previous withdrawal of Newcastle City Council and South Tyneside Council in recent years.\nPort of Tyne bosses admit that the latest blow will have a direct impact on their ability to remove any debris that does not block boats from navigating the Tyne safely. 08:01 Rush hour round up\nWe’re kicking in to rush hour now, and here are a few of the roads which are looking especially busy: Queueing traffic on A19 at The Silverlink Roundabout. In the roadworks area. Travel time is six minutes Northbound, ten minutes Southbound Queueing traffic on A1 Western Bypass Northbound around A167 Angel Of The North coming from Chester-le-Street. Travel time is 20 minutes. Delays on A1 Western Bypass Northbound from the (Metro Centre, Gateshead ) to A69 / A186 (Hexham Turn Off / Denton Burn Roundabout, Newcastle). Travel time is seven minutes. Queueing traffic on A1 Western Bypass Southbound from B1318 / A1056 ( Gosforth Park / Seaton Burn) to Kingston Park Road (Kingston Park / Gosforth Turn Off). Travel time is 15 minutes. 07:54 Snow elsewhere in the UK - but are we getting any?\nThe first snow of this winter has arrived, with parts of the country seeing a smattering of snowflakes.\nThere have been reports of heavy snow in Derbyshire, as well as further South, in counties including Kent and Dorset, while parts of Wales also saw a few flurries.\nHappily, or sadly depending on your perspective, the North East isn’t predicted to see a significant snowfall any time soon.\nAccording to the Met Office, for the rest of this week, we’ll be seeing cloud, fog and showers - but there’s no suggestion of snow.\nMeanwhile, in Cumbria... 07:43 Today's Brexit crunch talks\nTheresa May is travelling to Brussels today to meet the European Union’s top official Jean-Claude Juncker, as factions on both sides continue to express concerns about the draft deal. Prime Minister Theresa May greets European Commission President Jean-Claude Juncker ahead of a working dinner at 10 Downing Street, London (Image: John Stillwell/PA Wire)\nThe EU missed its deadline on Tuesday to complete the text of its declaration on future relations with the UK, amid worries from several member states.\nAnd the PM is under pressure from hard-line pro-Brexit MPs in her own party not to give more ground.\nWe’ll keep you posted with any updates. 07:31 Today's weather\nLet’s take a look at the weather forecast for today, according to the Met Office.\nIt will be chilly out, with “feels like” temperatures of just 1 to 3C, thanks to “brisk winds”.\nIt shouldn’t be as wet as yesterday, though, with frequent showers likely through the morning but clearing later, with the possibility of some sunny spells. 07:19 Busy at White Mare Pool Roundabout\nIt’s still early, but traffic is already building at A194(M) and A194 Leam Lane in both directions at A184 Newcastle Road (White Mare Pool Roundabout).\nRoads are busy, but moving. 07:18 Police concern for missing man Tyne Tunnel toll top up\nDrivers are set to be hit with higher charges to use the Tyne Tunnel .\nThe charge for heavy goods vehicles is expected to go up by 20p, from £3.40 to £3.60. (Image: newcastle chronicle)\nTransport bosses say that the increases are being made in line with inflation and will avert a potential budget deficit of £1.5 million.\nHere’s what it will mean for your commute. Burst water main on A197\nThere are reports of a burst water main, leaving surface water on the A197 around Morpeth Golf Club. Traffic is said to be “coping well” Council to abandon pitches and pest control\nCouncil bosses in Gateshead have warned crucial services are now at breaking point - as they face a cash shortfall of almost £30 million.\nAnother devastating round of budget cuts could see Gateshead Council completely scrap its pest control services as well as all football pitch and bowling green maintenance, it has been revealed. Hunt for attacker who stabbed victim in the neck with screwdriver\nA man was stabbed in the neck with a screwdriver in the middle of Newcastle city centre. Sandman Signature Hotel, Newcastle (Image: Newcastle Chronicle)\nA manhunt has been launched for the attacker who stabbed a 29-year-old man near to the Sandman Hotel on Gallowgate on Monday.\nPolice were called to the scene at around 6.30pm after a man was stabbed in the neck with a weapon believed to be a screwdriver.\nThe injured victim was taken to hospital but is expected to make a recovery.\nPolice have released a description of the attacker. Durham uni academic accused of spying to appear in court\nA British academic accused of spying in the United Arab Emirates will appear in court in Abu Dhabi today.\nIt will be the third court appearance for Matthew Hedges, 31, since his arrest in Dubai Airport on May 5.\nForeign Secretary Jeremy Hunt and Middle East minister Alistair Burt have both travelled to the UAE since Mr Hedges was detained to make representations on his behalf. Matthew Hedges, who has been detained in the UAE, pictured with his wife Daniela Tejada (Image: PA / mdgomes)\nNikita Bernardi, a representative for Mr Hedge’s family, said they did not know what to expect from the court appearance.\n“We have no indication as to what way it will go,” she said. “We’re trying to stay hopeful but we don’t want to raise our hopes too much.”\nMr Hedges, a specialist in Middle Eastern studies at Durham University, went to the UAE to research his PhD thesis, where he was accused of spying for the British Government and arrested.\nAt Mr Hedge’s last hearing on October 24, his court-appointed lawyer maintained that he is innocent.\nOn October 29, Mr Hedges was released from detention and he has since been staying in Dubai with an ankle bracelet monitoring his movements. Showers should clear by the afternoon\nIt will be cloudy and windy with showers at first, but becoming brighter during the morning to leave a dry afternoon with some chilly sunny spells and lighter winds.\nTemperatures will only reach a maximum of 6C. How to get in touch\nHello and welcome to the breaking news blog for Wednesday November 21, 2018.\nWe will be bringing you regular updates throughout the day of all the breaking news and sport.\nWe have pictures, video, tweets and comments covering the latest Newcastle and North East traffic, weather forecasts, crime and council news too.\nIt’s Hannah Graham here and I’ll be keeping you updated on what’s going on across the North East.\nIf you would like to get in touch with us today about any breaking news, here are my details:\nPhone: 0191 201 6109", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15437140;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-21T07:00:00.000+02:00", "crawled": "2018-11-21T10:20:42.000+02:00", "highlightTitle": ""}