{"organizations": [], "uuid": "2b6531bb7e7a667b716ee46b0361953dece0c394", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/article1169925.ece/ALTERNATES/s1200/House-of-Fraser-1jpeg.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/house-fraser-shut-another-four-2219215", "country": "GB", "title": "House of Fraser to shut another FOUR stores", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T15:49:00.000+02:00", "replies_count": 0, "uuid": "2b6531bb7e7a667b716ee46b0361953dece0c394"}, "author": "Jamie Hawkins", "url": "https://www.devonlive.com/news/devon-news/house-fraser-shut-another-four-2219215", "ord_in_thread": 0, "title": "House of Fraser to shut another FOUR stores", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}], "locations": [{"name": "nottingham", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "norwich", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "exeter exeter", "sentiment": "none"}], "organizations": [{"name": "house of fraser", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "House of Fraser to shut another FOUR stores Mike Ashley has pulled the plug on another four branches Share Exeter's House of Fraser store\nHouse of Fraser is to close another four stores, despite the department store being saved.\nAfter last month's shock announcement that Exeter's High Street branch will shut in January, the troubled retailer has announced several more will close.\nAfter it was also announced that Manchester's iconic Deansgate store will close, House of Fraser has confirmed four more locations that will be affected, The Mirror reports.\n\"It is with regret that House of Fraser today announces that the following stores are facing closure: Lakeside, Metrocentre, Norwich, and Nottingham,\" the company said in a statement. Read More Businesses shine a light on growth beyond Brexit in Exeter Exeter's House of Fraser will close next year\n\"Despite our best efforts we have been unable to agree reasonable terms for these stores to continue trading. Sadly, we are now in consultation with staff about the fact these stores face closure.\n\"We hope other institutional landlords will continue to work with us in order to save stores and jobs.\"\nIt comes a month after House of Fraser revealed it was in talks with landlords to renegotiate rents across the board as part of efforts to revive the struggling chain after a £90 million takeover.\nSports Direct boss Mike Ashley saved the business from administration in August however at the time he warned closures could be on the cards if overheads were not significantly reduced. Signs have gone up confirming Exeter's House of Fraser will close\nIn September, its new owners said 20 stores had been saved including London's Oxford Street branch, however talks to save Manchester's iconic Kendals store have collapsed.\nAbout the latest closures Ashley said: “We had multiple meetings with [landlord, Intu Properties], but we were no further forward after 14 weeks.\n\"Unfortunately, these stores now face closing in the New Year. I urge other institutional landlords to be more proactive to help save the HoF stores in their schemes.” Read More Plymouth City Centre's House of Fraser store The 20 House of Fraser stores that have been saved Altrincham", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.mirror.co.uk/money/four-more-iconic-house-fraser-13589036"], "published": "2018-11-14T15:49:00.000+02:00", "crawled": "2018-11-14T17:41:23.000+02:00", "highlightTitle": ""}