{"organizations": [], "uuid": "7492ea9b9f969708e547fb371cb33174d6a91bad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15425828.ece/ALTERNATES/s1200/0_Pj-North-Tyne-Stakeholder-Event.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/northumberland-peter-jackson-council-lugano-15457003", "country": "GB", "domain_rank": 21960, "title": "Northumberland County Council leader Peter Jackson accused of hypocrisy by property company", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-23T20:00:00.000+02:00", "replies_count": 0, "uuid": "7492ea9b9f969708e547fb371cb33174d6a91bad"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/news/north-east-news/northumberland-peter-jackson-council-lugano-15457003", "ord_in_thread": 0, "title": "Northumberland County Council leader Peter Jackson accused of hypocrisy by property company", "locations": [], "entities": {"persons": [{"name": "peter jackson", "sentiment": "negative"}, {"name": "richard robson", "sentiment": "none"}, {"name": "richard robson share coun peter jackson", "sentiment": "none"}, {"name": "coun peter jackson", "sentiment": "none"}, {"name": "jake berry", "sentiment": "none"}], "locations": [{"name": "lugano", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "northumberland county council", "sentiment": "negative"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "north of tyne combined authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northumberland County Council leader Peter Jackson accused of hypocrisy by property company The war of words over a controversial development has continued with criticism from Lugano chairman Richard Robson Share Coun Peter Jackson, leader of Northumberland County Council, speaking at the North of Tyne stakeholder event (Image: Copyright Unknown)\nA property company involved in a legal dispute with the leader of Northumberland County Council has now criticised him for hypocrisy, saying his actions should match his words about 'inspiring places'.\nBut Coun Peter Jackson has hit back at the comments from Lugano chairman Richard Robson, saying they are motivated by his 'clear personal interest' in a bid to 'concrete over hundreds of acres of valued green-belt land'.\nA stakeholder event for the new North of Tyne Combined Authority took place in Newcastle last week where the vision, based on six key priorities or 'pillars of ambition', was set out in more detail.\nIt followed the £600million deal being officially signed off by Northern Powerhouse Minister Jake Berry and the cabinet of the new combined authority - made up of Northumberland , North Tyneside and Newcastle councils - meeting for the first time earlier this month. Northern Powerhouse Minister, Jake Berry MP (Image: Newcastle Chronicle)\nSpeaking at the stakeholder event, Coun Jackson, who is responsible for place and productivity on the new cabinet, said: \"We have a number of priorities around place - the first is to create communities of inspiring places, homes and spaces to support more sustainable, low-carbon futures where people want to live, work and visit.\" Read More Rural North East could face 'spiral of decline' from Brexit, report warns\nMr Robson, the chairman of Lugano Property Group, has described these comments as 'laudable', but questioned why Coun Jackson was not applying the same principles and scale of ambition to his company's plans for the Dissington Garden Village (DGV) - a development of up to 2,000 homes and other facilities near Ponteland.\nHe said: \"If Peter Jackson wants to create inspiring places, homes that support and promote low-carbon futures and he wants to build inspirational places as he says, then why has he been so reluctant to meet with us and various national experts to discuss Dissington Garden Village, which not only meets, but exceeds all of these ambitions? Richard Robson from Lugano (Image: Newcastle Chronicle)\n\"It is one thing to make such laudable comments in the company of peers and the media, but it's somewhat hypocritical if you have demonstrated in the very recent past that you have done the exact opposite, by attempting to oppose a project that fits his own inspiring-places blueprint perfectly and enjoys the backing of some of the UK's leading lights in architecture, planning and the development of new garden communities.\"\nLugano's relationship with Northumberland County Council has been thrown into the spotlight this year after the Newcastle-based company launched a £10million High Court claim against the authority, Coun Jackson, cabinet member for planning Coun John Riddle and chief executive Daljit Lally over how its DGV application has been handled.\nThe DGV had been backed by the council's previous Labour administration and received a minded-to-approve resolution when it went before the strategic planning committee, but it is now being reassessed in light of the withdrawal of the previous core strategy by the Conservative administration which won power at last May's elections. Artist's impression of Dissington Garden Village (Image: supplied by Chris Jennings of cian PR as publicity handout)\nThe council has repeatedly said that it has acted reasonably and lawfully, and that it continues to work with Lugano on its live planning application.\nAt the stakeholder event, Coun Jackson also said: \"We want to support the rural economy and to become a national, rural, scale-up exemplar and that's a challenge from government to us to show them the way to do rural development.\n\"We need to increase the rate of home-building and raise the quality of homes we have to offer in line with our three local plans and that's about creating housing that people actually need.\" Read More Opencast mining at Druridge Bay back on track after High Court ruling\nMr Robson added: \"It is totally insincere and disingenuous of the Northumberland County Council leader to stand in front of his peers and call for more projects of pretty much the exact description of the one he has actively tried to derail in his own backyard.\n\"Dissington Garden Village provides the perfect opportunity to create a sustainable, attractive community, while meeting the needs of the current population, offering young people the chance to buy their first home near the village they grew up in, older people the opportunity to sell empty-nest houses and move to somewhere nearby that is smaller and less costly to look after, while building spaces for businesses that will create jobs and developing schools to alleviate over-crowding.\n\"Not to mention a flood-defence system and a bypass that people have campaigned for, for well over two decades.\"\nReacting to this criticism, Coun Jackson said: \"Richard Robson has a clear personal interest at play here, acting as the front man for a shady foreign-owned company with a current application to concrete over hundreds of acres of valued green-belt land with all kinds of implications for local people.\n\"If he was genuine in wanting to address needs which have been identified by evidence in Northumberland, I would have been pleased to meet him.\n\"Our new local plan does demonstrate that there is no need to build on valued green-belt anywhere in our county.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-23T20:00:00.000+02:00", "crawled": "2018-11-23T22:26:49.004+02:00", "highlightTitle": ""}