{"organizations": [], "uuid": "187ec7893461a81acd4ca5596c4726c4a8da0677", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14968488.ece/ALTERNATES/s1200/0_CFR_NJL_300718hyper_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/hyperdrive-innovation-secures-67m-investment-15479208", "country": "GB", "domain_rank": 21960, "title": "Hyperdrive Innovation secures £6.7m investment to fuel international growth", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-28T19:19:00.000+02:00", "replies_count": 0, "uuid": "187ec7893461a81acd4ca5596c4726c4a8da0677"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/hyperdrive-innovation-secures-67m-investment-15479208", "ord_in_thread": 0, "title": "Hyperdrive Innovation secures £6.7m investment to fuel international growth", "locations": [], "entities": {"persons": [{"name": "dave sandells", "sentiment": "none"}, {"name": "stephen irish", "sentiment": "none"}, {"name": "cllr michael mordey", "sentiment": "none"}], "locations": [{"name": "hyperdrive", "sentiment": "none"}], "organizations": [{"name": "sunderland city council", "sentiment": "none"}, {"name": "hyperdrive innovation", "sentiment": "none"}, {"name": "santon capital plc", "sentiment": "none"}, {"name": "rivers capital partners", "sentiment": "none"}, {"name": "jcb", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "hamilton capital partners", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hyperdrive Innovation secures £6.7m investment to fuel international growth The battery pack manufacturer's tech has been used to power JCB excavators Share Left to right: Dr Dave Sandells, Hyperdrive Innovation; Cllr Michael Mordey, Sunderland City Council; Stephen Irish, hyperdrive Innovation (Image: Hyperdrive Innovation) Get business\nSunderland battery firm Hyperdrive Innovation has secured £6.7m of investment to support the business’ expansion overseas.\nThe company - which develops lithium-ion better packs using Nissan cells - has raised a total of £9.6m since it was founded in 2012.\nThe new investment has been received from Hyperdrive’s existing investors Santon Capital Plc, Hamilton Capital Partners, and Newcastle ’s Rivers Capital Partners.\nStephen Irish, Hyperdrive’s commercial director, said: “Via partnerships and our excellent relationships with our customers, Hyperdrive has been leveraging its technology and development capabilities to really take advantage of the growing trend in vehicle electrification and stationary energy storage. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n“This investment allows us to position the company for the next phase of growth, enabling our technology to benefit more and more people, through the reduction of energy consumption and the increase in renewable energy.”\nBim Sandhu, CEO and owner of Santon Capital plc, added: “Hyperdrive has demonstrated that it is a highly innovative company adept in turning bright ideas into serious business propositions. Capable of creating highly skilled jobs and delivering value for customers and investors alike, this is reflected in the fact that the latest equity offering was massively oversubscribed by existing shareholders. Read More Hyperdrive Innovation set to double size of its Sunderland manufacturing plant\n“We have been highly impressed by the management team and we look forward to continuing to work with them as the company grows.”\nHyperdrive added that it would use the funds to fuel its growth plans in the UK and overseas, as well as ensuring that the company is debt free. One of Hyperdrive Innovation's new products - a 12V battery module (Image: Publicity Pic)\nIn August the company announced it was planning to expand double the size of its Sunderland manufacturing plant after producing its 5,000th battery pack. The expansion would allow it to produce 10,000 packs in 2019 alone.\nThe company has also revealed it is supplying battery packs to JCB which will be used in the company’s first ever electric excavator. Read More Automotive sector warns of 'catastrophic' no-deal Brexit for North East\nAndrew Lapping, chairman of Hyperdrive, said: “The additional investment from our shareholders is a fantastic endorsement of Hyperdrive’s performance to date and strong trading position for the future.\n“The team has built an impressive list of customers which recognise the value of Hyperdrive’s world-class battery technology. We are very excited about the future as we continue to grow and enter new markets.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-28T19:19:00.000+02:00", "crawled": "2018-11-29T02:21:48.000+02:00", "highlightTitle": ""}