{"organizations": [], "uuid": "3dd88116a165d6299d71e38f1d49c4c379556ea8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14215609.ece/ALTERNATES/s1200/1_LSE-in-talks-with-Deutsche-Boerse.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15365774", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Profits at UK listed firms reach record high", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-05T10:05:00.000+02:00", "replies_count": 0, "uuid": "3dd88116a165d6299d71e38f1d49c4c379556ea8"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15365774", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Profits at UK listed firms reach record high", "locations": [], "entities": {"persons": [{"name": "coreena ford", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "marco corradino", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "newgate street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "berketex bride", "sentiment": "negative"}, {"name": "chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A Newcastle bridal shop has closed suddenly.\nBerketex Bride shut its Newgate Street branch on Wednesday. The Newcastle branch has been removed from Berketex Bride’s website, while its Facebook page has been shut down.\nIt is not currently known how many staff have been affected by the closure. The shop - which is currently surrounded by scaffolding - has been emptied of stock and staff were not present.\nThe Chronicle has contacted Berketex Bride, which is based in Lincolnshire, for comment. Berketex Bride has closed its Newcastle store (Image: Jonathon Manning) 8.35 Coreena Ford Lastminute.com boss raises fears ahead of Brexit\nThe boss of online holiday site Lastminute.com has spoken out over his fears for the travel industry after Brexit and said uncertainty is weighing on firms. Chief executive Marco Corradino said he believes the Government will secure a transition deal to avoid flights being grounded after March 29, but warned there would be implications.\n“There will be an effect, but the reality is that we don’t know exactly what will happen - and that is the worst thing for business. “I hope the effect will not hurt demand for holidays.”\nSo far, Lastminute.com has not seen any drop-off in demand for holidays for next summer season, but he raised concerns over a potential “psychological” impact on UK consumers after Brexit.\nIt comes after Transport Secretary Chris Grayling’s recent revelation that talks on UK-EU post-Brexit flight route access have still not begun.\nMr Grayling told a gathering of UK airport bosses there is “no way that flights will stop between the UK and EU after March”, but said the European Commission has not yet been willing to start formal talks.\nLastminute.com is also optimistic that there will be no airport Armageddon next March, with Mr Corradino putting faith in the UK and EU to come to an agreement. “I’m not worried about the transition phase, but more what’s next,” he said.\n“We don’t have any idea of what’s in mind - the politicians should be planning for the future.” The Italian entrepreneur is bullish over Lastminute.com’s prospects despite Brexit worries and a “very competitive” travel market that has claimed the scalps of a raft of players in recent years.\nThe demise of airline Monarch, budget long-haul carrier Primera Air and LowCostHolidays has highlighted how tough the industry has become, but the holiday boss also stressed the importance of protection for consumers.\nMr Corradino said the failures will bring about a “positive change” in pushing authorities to offer better protection for passengers, while showing the benefits of packages with Atol scheme protection. A plane takes off at sunset (Image: PA) 8.30 Coreena Ford North Shields training firm becomes biggest in UK after acquisition\nA North East company has become the country’s largest trainer in the energy sector after the acquisition of a company in Aberdeen .\n3T Energy Group, which was formed earlier this year when North Shields’ AIS Training came together with Dorset firm Drilling Systems, has grown again by acquiring offshore training company Survivex.\nThe acquisition strengthens 3T’s global offering and is part of a strategy to transform the training sector with technology “to enable people and companies to work safer, smarter and more efficiently”.\n3T, which has backing from equity house Blue Water Energy, already has training centres at North Shields, Aberdeen and Grimsby as well as global operations in oil and gas hubs including China, Vietnam and Europe.\nThe acquisition of Survivex, which was established in 2011, will allow 3T to widen its course portfolio, increase availability and deliver better value for its customers.\nAIS founder Paul Stonebanks, who is president of 3T Energy, said: “Survivex has an outstanding reputation and we are delighted to add its expertise to the 3T Energy Group. Paul Stonebanks, AIS and 3T Energy (Image: publicity handout) 8.20 KEY EVENT Newcastle business founders turn down Dragons' Den\nAlcoholic tea purveyors Noveltea have escaped from the Dragons’ Den after turning down a raft of offers – but a surprise twist has served up a bright future for the Newcastle company.\nThe firm’s co-founders and tea mixologists Vincent Efferoth and Lukas Passia appeared on the latest episode of the long-running BBC Two series in the hope of enticing investment for no more than 10% of the firm.\nThe duo, who originally come from Germany but based the business in the North East after studying at Newcastle University, have taken the beverage sector by storm as the first to cold-brew and infuse tea with a matching spirit. The company sells The Tale of Earl Grey, which is distilled with gin, the Tale of Tangier infused with rum and the Tale of Oolong, which is infused with Scotch whisky.\nThey served hot and cold tasters of Tale of Earl Grey and Tale of Tangier to Dragons Deborah Meaden, Peter Jones, Jenny Campbell, Tej Lalvani and Touker Suleyman, all of which went down well.\nDays after the episide was filmed in the summer their decision was vindicated when they completed a crowdfunding campaign which raised a whopping sum of money. Vincent Efferoth and Lukas Passia of Noveltea appear on Dragons' Den (Image: BBC) 8.15 Coreena Ford Banking sector 'still tough' for challengers, says Starling boss\nThe boss of digital challenger Starling Bank has said conditions are “still tough” for new market entrants despite renewed efforts to boost competition since the 2008 crash.\nStarling founder and chief executive Anne Boden said it was a wave of crisis-era consolidation that prompted UK regulators to launch a new authorisation process which ultimately helped usher in a string of new banks.\nRoyal Bank of Scotland’s takeover of ABN Amro and Lloyds Banking Group’s acquisition of HBOS, as well as the collapse of Northern Rock and Bradford & Bingley, all left a smaller banking sector in their wake.\nWhile a raft of new firms entered the lending market, Ms Boden said few have managed to push on to launch current accounts for everyday retail customers. “We were, I think, the second bank to go through that authorisation process. OakNorth was the first and they’re an SME bank,” she said.\n“But you know, there was a whole raft of digital startups going through: there was Atom Bank, Tandem Bank, Starling and Monzo.\n“And these four banks went through the authorisation process. But only ourselves and Monzo ended up doing current account banking - and that’s hard, that’s difficult.\n“So, although the legislation was intended to create new competition, it’s still tough and not many banks have actually managed to sort of launch and thrive.” Money (Image: Chris Radburn/PA Wire) 8.10 Coreena Ford ITV boss poaches former easyJet colleague\nITV has poached the finance boss of fellow FTSE 100 company Micro Focus, reuniting chief executive Carolyn McCall with a former easyJet colleague.\nChris Kennedy, who was previously chief financial officer at easyJet between 2010 and 2015, will join the broadcaster in February 2019.\nMs McCall said: “I am really pleased to be working with Chris again as CFO.\nHe will play a huge role in helping us deliver our new More Than TV strategy and I know he will work really well with the senior leadership team of ITV.”\nMr Kennedy succeeds incumbent CFO Ian Griffiths, who announced his decision to retire earlier this year.\nPrior to joining Micro Focus, Mr Kennedy was CFO at Arm Holdings before its £24bn sale to Softbank.\nBefore that he spent 17 years at EMI Music across various roles. He joins as ITV pursues a fresh cost-cutting drive that will see it save up to £40 million by 2021 amid weak ad revenue growth. The boss of broadcaster ITV has poached a former easyJet colleague 8.05 What's the FTSE latest?\nThe FTSE-100 index opened at 7094.12.\nThe pound at 8am was 1.3008 dollars compared to 1.2968 dollars at the previous close. The euro at 8am was 0.8752 pounds compared to 0.8780 pounds at the previous close. 8.00 KEY EVENT Profits at top UK firms reach new record level\nProfits at the UK’s listed companies have hit a new record for the first time in seven years thanks to a run of high oil prices, a new report showed. According to research by The Share Centre, profits from UK companies on the main stock market reached £217.9bn over the last 12 months.\nThis breaks the all-time high last set in 2011.\nAll listed companies have also delivered revenue of just over £2trn between them for the first time on record. Despite smashing the record, UK plc earnings growth this year is now expected to be lower than previously thought.\nThe market sees median or typical earnings growth of 5.4% this year, down from 6.7% three months ago.\nHelal Miah, investment analyst at The Share Centre, said: “Two notes of caution leaven the good news in the latest set of figures reported by UK companies. First, the majority of current profit growth is relatively low quality, since it largely reflects the impact of higher oil prices, which are outside the control of individual companies.\n“And secondly, profit growth was focused in fewer companies, indicating that many businesses are finding trading conditions challenging.”\nSome of the biggest winners in the past 12 months have been in the oil sector, which is the largest generator of revenues on the UK stock market. Oil prices have jumped from $50 a year ago to around $80 in current trading, giving a huge boost to the industry and firms such as BP and Royal Dutch Shell.\nConsumer goods and housebuilding also performed well, while utilities revenues were pushed higher by energy price increases.\nBut the picture was less rosy for the mining sector, which has suffered as a result of global trade tensions. The industry has recently been a core driver of UK plc growth, but revenue was flat in the most recent set of results.\nMeanwhile, the well-publicised pressures on the high street affected the retail sector, in which profits collectively fell 35%.\nMr Miah added that uncertainty over Brexit has been holding back the UK’s listed companies. “It’s also clear that the UK stock market looks cheap relative to global peers, and to its own medium-term average,” he said “A key factor is the uncertainty caused by Brexit which has resulted in slower economic growth and international investors reducing their weighting to UK stocks.” The London Stock Exchange", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15365774;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-05T10:05:00.000+02:00", "crawled": "2018-11-05T10:54:27.012+02:00", "highlightTitle": ""}