{"organizations": [], "uuid": "4030b773d653c078f598b22c71b95fc5314b4c5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article2159986.ece/ALTERNATES/s1200/0_FT2GPitchEventCompaniesjpeg.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/business/businesses-shine-light-growth-beyond-2219006", "country": "US", "title": "Businesses shine a light on growth beyond Brexit in Exeter - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.086, "site_type": "news", "published": "2018-11-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "4030b773d653c078f598b22c71b95fc5314b4c5b"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/businesses-shine-light-growth-beyond-2219006", "ord_in_thread": 0, "title": "Businesses shine a light on growth beyond Brexit in Exeter - Devon Live", "locations": [], "entities": {"persons": [{"name": "giles dunning", "sentiment": "none"}, {"name": "bill martin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "stephens scown", "sentiment": "none"}], "locations": [{"name": "exeter - devon live businesses", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "southernhay", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Businesses shine a light on growth beyond Brexit in Exeter Business bosses are holding a panel discussion in Exeter Share\nBusiness leaders from across the region will shine a light on Growth Beyond Brexit next week.\nThe invite-only event, being held in Exeter will be chaired by Western Morning News editor Bill Martin and will hear from key business figures on how we can get the best out of Brexit.\nIt is being held at on Tuesday, November 20 at Stephens Scown in Southernhay, Exeter on Tuesday, November 20.\nGiles Dunning, partner and head of the corporate team at FT2G partner Stephens Scown LLP said: “Uncertainty can be incredibly challenging for businesses, so it is more important than ever for business leaders in the South West to share ideas so that we are ready to make the most of any opportunities that Brexit will bring.” Read More Flybe must stay in Exeter, say business bosses\nThe aim of the event is to look beyond Brexit, discuss what the business community needs to do to ensure, that whatever happens with the Brexit process and deal, it continues to focus on the key issues and opportunities for us.\nThe morning event is being run by Fast Track to Growth , Devon’s free business support programme, in partnership with the Western Morning News.\nDan Pritchard, managing director of Astley Media, will lead the audience through the Brexit minefield that is Brexit - putting aside the politics and focusing on the business.\nThe Growth Beyond Brexit is one of a series of events being planned by FT2G, which will also include a Growth Day, Innovation Day, intensive support programme and pitch event with the chance to win £10,000 of business support.\nFrancis Clark PKF is Fast Track to Growth’s financial strategy partner. Western Morning News editor Bill Martin will chair the Growth Beyond Brexit panel (Image: Penny Cross)\nLewis Banfield, of Francis Clark PKF’s Exeter office, said: “No matter what deal we may or may not reach with the EU in the run up to March 2019, or even if we end up with another referendum, the next few months and beyond will be unprecedented in terms of uncertainty and change. All businesses need to plan to manage this uncertainty, particularly those trading with overseas suppliers or customers. Change often leads to opportunity for those who have prepared and thought through their approach.”\nRachael Howourth, Director of FT2G partner Momentum SW, said that businesses should see Brexit in the same way that they see all other unpredictable business situations. Read More Devon council boss warns over Brexit nursing care shortages\nShe said: “Plan A should also be joined by Plan B and a Plan C too. Use reliable business tools to support these plans and be brave and bold, not hesitant and certainly not complacent.\"\nOn Tuesday evening, a free ‘meet and greet’ drinks event is being held at Hotel de Vin in Exeter from 6-8pm, for members and people interested in finding out more about the Fast Track To Growth Programme. Read More", "external_links": [], "published": "2018-11-14T02:00:00.000+02:00", "crawled": "2018-11-14T15:59:44.000+02:00", "highlightTitle": ""}