{"organizations": [], "uuid": "68b82bfbb9770451dfc5f747a72eea1f60eb2cfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2237498.ece/ALTERNATES/s1200/0_Visualisation-2-1.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/business/new-300million-exeter-bus-station-2236936", "country": "US", "title": "New £300million Exeter bus station plans revealed - including ten storey luxury hotel and more restaurants - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-11-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "68b82bfbb9770451dfc5f747a72eea1f60eb2cfa"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/new-300million-exeter-bus-station-2236936", "ord_in_thread": 0, "title": "New £300million Exeter bus station plans revealed - including ten storey luxury hotel and more restaurants - Devon Live", "locations": [], "entities": {"persons": [{"name": "karime hassan", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "exeter bus station", "sentiment": "none"}, {"name": "bampfylde street", "sentiment": "none"}, {"name": "sidwell street", "sentiment": "none"}], "organizations": [{"name": "exeter city council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nAnd it will be kickstarted by the council-funded St Sidwell Point leisure centre and new bus station . Exeter Bus Station redevelopment: How the luxury 10-storey hotel could look, on the left and the Next building on the right.\nBut since the plans were last on the table - the price has risen from £39.92million to £51.8million. What's included: The Exeter Bus Station plan\nThe vision for the site includes: 250 houses on the current Civic Centre site 250 built to rent homes on Sidwell Street A ten-storey, four star hotel with 175 rooms opposite John Lewis A budget hotel at the far end of Sidwell Street Almost 40,000 sq ft of retail units fronting Sidwell Street The relocation of the Civic Centre A new Office Quarter, including blocks over eight storeys More than 15,000 sq ft of food and drink outlets Flexible working space alongside the leisure centre A new square and civic space in Paris Street The potential for a multi-purpose performance venue, with a capacity of around 1,200 seated or up to 2,500 standing Paris Street will be pedestrianised as part of the plan\nMr Hassan said it is partly due to inflation but also by the authority having to pick up costs for things like access and site levels that would have been picked up by Crown Estate in the original scheme.\nNow, Mr Hassan is asking councillors to approve an additional £11.88million borrowing on top of the £39.92million already approved to build the St Sidwell’s Point leisure centre and the new bus station. Exeter Bus Station redevelopment: How the bus station and road layout looks today\nThe Passivhaus design pool and is expected to bring in 500,000 visitors a year - twice that of the RAMM.\nHe said: “That £50million investment by the city council starts to open up big private investment.\n“The one thing that we can do as a local authority is to bring clarity when there is so much uncertainty. Plans for the pool Why Exeter's forgotten Fore Street has just become the place to be\n“Brexit is a big issue and that is why we need to get on with this. We know there is market interest in Exeter, we now need to land it. We can’t afford to wait for years.”\nMembers will also need to say yes to £300,000 to cover procurement costs to find a developer for the wider scheme and £90,000 to fund a feasibility study for a multi-purpose performance venue that will sit at the heart of the development.\nMr Hassan said that the interest in build-to-rent homes, more commonly seen in Bristol and London, is in response to the booming employment market in Exeter for young professionals. Exeter Bus Station redevelopment: layout plan of how area could be transformed\nOf all the jobs created in the city between 2014-17, 47% were in the digital and tech sector.\nAnd he said that he was challenging the city planners to consider multi-storey housing.\nHe said: “If we are going to build 12,000 homes in the city as we have to do then we have got to look at that kind of density.”\nEarlier in the year the council announced Kier has been appointed as the preferred contractor to build the new bus station and leisure complex after a competitive tender process.\nIf councillors back the recommendations, it is hoped that final contracts for the main build programme will be signed in December. Reaction: Exeter Bus Station plans\nCouncil leader Pete Edwards said: “ I am delighted that we are now in a position to move forward with a scheme that serves the needs of everyone who lives, works and visits the city. These plans are very exciting for Exeter, and the new facilities are long overdue.”\nDeputy Leader Rachel Sutton , Lead Councillor for Economy and Culture, said: “A clear need for this facility in the city centre has been established. There would be some major obstacles to overcome to deliver a new performance venue – not least of which is funding. But the fact that a potential viable site has been identified to create a purpose-built facility is hugely exciting.”\nCouncillor Phil Bialyk , Portfolio Holder for Health and Wellbeing, Communities & Sport, said: “We are determined to maintain our position as one of the most active cities in the country, and this fantastic leisure complex will help us to do that.\n“We are also funding a brand new bus station which is fit for purpose. It is much needed and will finally provide the facilities that the travelling public expect and deserve.”\nDerek Phillips , Vice President of Exeter Chamber of Commerce, said: “We support this investment in the city centre and back the council’s plans to regenerate this tired and outdated site. This investment will help increase the viability of the city centre in uncertain times, and we very much welcome it.”\nDetails of the vision, which also includes the potential to relocate the Civic Centre, will be discussed by the council’s Leisure Complex and Bus Station Programme Board on Tuesday, November 27. Like us on Facebook ", "external_links": [], "published": "2018-11-20T02:00:00.000+02:00", "crawled": "2018-11-20T02:33:32.025+02:00", "highlightTitle": ""}