{"organizations": [], "uuid": "24fb13b6d04fc8dc19738723a366ca35e06191f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15381925.ece/ALTERNATES/s1200/0_RLP_CHP_191018BBC_479JPG.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/persimmon-boss-asked-leave-after-15381752", "country": "GB", "domain_rank": 21960, "title": "Persimmon boss asked to leave after £75m pay deal causes 'distraction'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-07T13:00:00.000+02:00", "replies_count": 0, "uuid": "24fb13b6d04fc8dc19738723a366ca35e06191f0"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/persimmon-boss-asked-leave-after-15381752", "ord_in_thread": 0, "title": "Persimmon boss asked to leave after £75m pay deal causes 'distraction'", "locations": [], "entities": {"persons": [{"name": "jeff fairburn", "sentiment": "negative"}, {"name": "duncan davidson", "sentiment": "none"}, {"name": "persimmon", "sentiment": "none"}, {"name": "david jenkinson", "sentiment": "none"}], "locations": [{"name": "fairburn", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Persimmon boss asked to leave after £75m pay deal causes 'distraction' Jeff Fairburn has agreed to leave the North housebuilder after massive pay deal brought widespread criticism Share\nPersimmon boss Jeff Fairburn has been asked to leave the company at the end of 2018 after the housebuilding giant said the “distraction” over his controversial £75m payout was damaging its reputation.\nThe group, founded by Northumberland landowner Duncan Davidson, said Mr Fairburn had agreed to leave on December 31 by “mutual agreement” and at the company’s request.\nIt comes just weeks after he walked off camera during a BBC interview after being asked about his mammoth payout.\nMr Fairburn will be replaced on an interim basis by David Jenkinson, currently group managing director. Persimmon has begun a search for a permanent successor to Mr Fairburn.\nThe group said the distraction caused by the public and political outrage over the bonus was having a “negative impact on the reputation of the business and consequently on Jeff’s ability to continue in his role”.\nBut it said that, as he was leaving at the company’s request, it was not legally able to withhold any of the share payouts due under the controversial 2012 long-term bonus scheme.\nIt said it had agreed with Mr Fairburn to cut his 12-month notice period and that he will not receive any further salary or benefits after December 31.\nHe also has no bonus entitlement for 2018. Read More Newcastle firm owned by Brexit campaigner Arron Banks facing massive fine\nChairman Roger Devlin said: “Given the continuing distraction around the scale of his remuneration resulting from the 2012 LTIP (long-term incentive plan), the board believes that it is now necessary for there to be to be a change of leadership.”\nMr Fairburn said: “I had hoped that revealing my plans to create a charitable trust and to waive a proportion of the award would enable the company to put the issue of the 2012 LTIP behind it.\n“However, this has not been the case and so it is clearly now in the best interests of Persimmon that I should step down.”\nMr Fairburn’s pay packet sparked outcry among politicians and shareholders earlier this year.\nHis mammoth £75m payout would have been an even higher £100m, until Mr Fairburn voluntarily moved to calm the furore by handing back £25m in bonuses. Read More Plans approved for £175m North East garden village which will create 800 jobs\nHe also pledged to forgo his next annual bonus and hand over a “substantial amount” of his pay award to charity.\nOther executives also picked up bumper pay deals under the lucrative share scheme, collectively worth more than £100m.\nThe group saw 48.5% of investors vote against the pay plans in April as they vented anger over the payouts.\nRuss Mould, investment director at AJ Bell, said: “Persimmon chief executive Jeff Fairburn may have thought he had successfully navigated the furore over his £75m bonus, but a disastrous TV interview in which he uncomfortably failed to acknowledge the issue may well have been the final straw for the housebuilder.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-07T13:00:00.000+02:00", "crawled": "2018-11-07T14:26:29.017+02:00", "highlightTitle": ""}