{"organizations": [], "uuid": "0e7dd3d78be861989a75d36ee682419134ca5a4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15422317.ece/ALTERNATES/s1200/3_JS168562006.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15464594", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Back my Brexit deal or risk more division, says May", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-26T10:35:00.000+02:00", "replies_count": 0, "uuid": "0e7dd3d78be861989a75d36ee682419134ca5a4b"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15464594", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Back my Brexit deal or risk more division, says May", "locations": [], "entities": {"persons": [{"name": "bijan mossavar-rahmani", "sentiment": "none"}, {"name": "faroe", "sentiment": "none"}, {"name": "greggs festive bake picasso", "sentiment": "none"}, {"name": "monet", "sentiment": "none"}], "locations": [{"name": "aberdeen", "sentiment": "none"}, {"name": "faroe", "sentiment": "none"}, {"name": "giverny", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "dno", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "faroe petroleum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Shares soar at Aberdeen oil and gas firm amid takeover offer\nThe largest shareholder of Aberdeen oil and gas firm Faroe Petroleum has offered to buy the company in a deal valuing it at £608m.\nDNO, a Norwegian firm which already owns more than 28% of Faroe, said it was offering a “considerable premium” for investors wishing to exit amid the uncertainty of the oil market.\nThe bid confirms growing speculation that DNO would make an offer, after the company bought its sizeable stake in Faroe earlier this year.\nDNO’s executive chairman, Bijan Mossavar-Rahmani, said in the event of an acquisition, the firm would retain the “skills, knowledge and expertise” of Faroe’s employees. “We intend to retain Faroe’s Aberdeen head office and each of the other offices,” he said.\nShares in Faroe Petroleum soared 22% higher in early trading. An oil rig in the North Sea (Image: PA) 9.05 Art exhibition in Newcastle celebrates the Greggs Festive Bake\nPicasso had his blue period and Monet took endless inspiration from the gardens of Giverny.\nBut for one group of arty types in Newcastle, it is the Greggs festive bake that has got their creative juices - as well as their appetites - flowing.\nNewcastle creative agency Jump will this week reveal a whole raft of artworks focused solely on the bestselling chicken, bacon, stuffing, sage and cranberry sauce bake, having tapped into their network of talented artists, illustrators, writers and designers.\nA total of 23 works of art will go on display at Jump’s offices in Milburn House, showcasing talents of North East artists who have used different techniques including everything from embroidery and screenprint to watercolour and collage to pay homage to the feted baked.\nAnd while the exhibition is designed to be a lighthearted homage to the region’s most anticipated pasty – which, for the uninitiated, is only on sale in Greggs stores for a short time in the lead-up to Christmas – artworks, including Christmas card versions of the pieces, are available to buy with proceeds going to the Greggs Foundation, which provides grants to organisations that support those in need in the local community. Art exhibition in Newcastle celebrates the Greggs Festive Bake (Image: Jump) 9.00 Coreena Ford Top hotels see profits rise\nProfits at the UK’s top 100 hotels have increased by 13% to £689m in the past year, according to a new report.\nResearch by accountants Moore Stephens suggested that hotels are benefiting from increased tourism because of the fall in sterling.\nThe study also indicated that, despite the rise in visitor numbers, hotels are being hit by higher running costs such as business rates and wages.\nMoore Stephens said many hotel groups are increasingly having to rely on more expensive temporary agency staff to fill vacancies.\nSpokesman Vincent Wood said: “2018 has already seen many big events that have helped to attract record numbers of tourists to the UK, including the royal wedding.\n“Hotels are also being helped by a growing trend of more domestic breaks being taken in the UK and people choosing to go on ‘staycations’.\n“Rising numbers of tourists are helping to reduce headwinds, but that won’t last forever.\n“The lower value of sterling has already proved to be a mixed blessing for some. It saw input costs, such as food, beverages and other imported goods like linen, soar.” The famous Ritz Hotel in London. The UK's top 100 hotels have had a boost this year. 8.55 Coreena Ford Ultrafast broadband extended to another 1m homes\nScores more locations are to have ultrafast broadband under plans to reach a further one million homes.\nOpenreach announced the next phase of its programme, upgrading broadband in 81 areas including parts of London, Leicester, Worthing, Cardiff, Northampton and Dover.\nThe work will take place over the next nine months, adding to the more than 250 locations where the technology has already been deployed.\nOpenreach said the multimillion-pound investment will make faster, more reliable broadband services available to local residents and businesses.\nKim Mears of Openreach said:\nCurrently, the UK is a world leader in digital infrastructure and services, but as the digital revolution rushes forwards and the demand for data continues to grow, we need to make sure we stay ahead of the curve.\nThat’s why we’re investing in faster, more reliable network infrastructure to facilitate all the activities we want to do now, and also those we haven’t even dreamt of doing in 10 years’ time.\nOpenreach has already made ultrafast broadband available to more than 1.9 million premises. A BT Openreach engineer (Image: PA) 8.50 Coreena Ford Royal Mail launches 'singing postboxes'\nThe Royal Mail is launching “singing” postboxes which play Christmas jingles when cards and letters are posted.\nThe sound of sleigh bells or a jolly message from Father Christmas will greet anyone sending mail at the special postboxes in the coming weeks.\nFour of them are being launched, in London, Cardiff, Belfast and Edinburgh, installed with sensors which spark the messages.\nSimon Barker, operations director at Royal Mail, said: “Delivering Christmas is our absolute priority this December. “In the process, we enjoy any way we can add a little extra fun to posting Christmas cards this year.”\nThe postboxes are adorned with snowflakes and will be in place throughout the festive season. Jasmin Prichard posts a card into one of the Royal Mail's first ever 'singing postboxes' 8.48 Coreena Ford Rio Tinto sells African mine stake\nMining giant Rio Tinto has announced the sale of an African uranium business as part of its strategy to shed unwanted assets.\nThe Anglo-Australian firm will sell its majority stake in Namibian mine owner Rossing Uranium to China National Uranium Corp for up to $106.5m (£83.1m). Rio Tinto will pocket an initial cash payment of $6.5m, followed by a contingent payment of up to $100m depending on the profitability of the Rossing mine over the next seven years.\nThe sale is the latest in a string of disposals announced by Rio Tinto, as the FTSE 100 firm looks to focus on core assets. Chief executive J-S Jacques said the latest deal demonstrated the company’s “commitment to strengthening our portfolio”.\nThe company is also looking to dispose of its majority stake in the Iron Ore Company of Canada. 8.45 Coreena Ford Cake Box sales grow\nCake Box has reported rapid growth in the first half as the cream cake retailer unveiled its first financial update since going public.\nThe company, which debuted on London’s junior market in June, said revenue was up 44% in the six months to September 30, driven by a record number of new store openings.\nPre-tax profits were down 7% at £1.37m for the period, but this included the £599,000 cost of the IPO.\nExcluding listing costs, profits were 34% higher.\nChief executive Sukh Chamdal said: “The Cake Box brand has continued to go from strength to strength and we have made good progress since flotation with our strategic priorities of growing our store estate, investing further in our new products and developing our digital marketing.”\nThe group said it was on track to open about 15 more franchise stores in the remainder of the year, matching the number added during the first half. There are now more than 100 Cake Box locations in the UK. Growth was also boosted by higher revenue per store, with like-for-like sales up 4.4%.\nAnalysts at Shore Capital Markets said the results were “good enough to eat” and predicted a strong second half, with Christmas and New Year still to come. Shares in the company were 3.9% higher in early trading. Cake Box sales are on the up (Image: PA) 8.30 KEY EVENT Back my Brexit deal or risk 'more division and uncertainty' May to tell MPs\nTheresa May will challenge MPs to back her Brexit plan or risk crashing out of the European Union without an agreement.\nThe Prime Minister will face the Commons after EU leaders endorsed the deal and made it clear it was not up for renegotiation.\nMrs May will tell the Commons “with absolute certainty” that “there is not a better deal available”.\nThe Prime Minister, who will chair a meeting of her Cabinet this morning, will warn rejecting her deal will “open the door to more division and uncertainty, with all the risks that will entail”.\nAt a historic summit in Brussels yesterday, the leaders of the remaining 27 member states took less than 40 minutes to approve the deal.\nMrs May will now put it to a vote of MPs before Christmas but faces a battle to get it through the House of Commons in the face of intense opposition on both the Leave and Remain-supporting wings of her party.\nShe has already started a campaign of selling her deal directly to the public in the hope their support can win round MPs opposed to the plan before the Commons vote, widely expected in the week beginning December 10.\nPart of that plan could include a televised debate with Jeremy Corbyn, it has been reported.\nFormer foreign secretary Boris Johnson branded the Prime Minister’s deal a “disaster” and a “humiliation” for the UK.\nIn his regular Daily Telegraph column, he said:\nThe other EU countries have signed the deal immediately, because they know that they have us exactly where they want us.\nWe are a satellite state - a memento mori fixed on the walls of Brussels as a ghastly gaping warning to all who try to escape.\nMore than 80 Tories have rejected the deal, with opposition parties - and Mrs May’s allies in the DUP - also set to oppose it.\nMeanwhile, European Commission President Jean-Claude Juncker led the warnings there could be no return to the negotiating table if the deal - comprising the Withdrawal Agreement and the Political Declaration of future EU-UK relations - was rejected.\nHe said:\nThis is the deal. It’s the best deal possible and the EU will not change its fundamental position when it comes to these issues.\nThose who think by rejecting the deal that they would have a better deal will be disappointed in the first seconds after the rejection of this deal. Prime Minister Theresa May makes a statement outside 10 Downing Street (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15464594;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-26T10:35:00.000+02:00", "crawled": "2018-11-26T14:57:38.000+02:00", "highlightTitle": ""}