{"organizations": [], "uuid": "d752873044cdb2a34b7f2bf99e8104e489666250", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15453265.ece/ALTERNATES/s1200/0_JS169145460.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-hms-tyne-gavin-williamson-15452642", "country": "GB", "domain_rank": 21960, "title": "New navy warship is named after Newcastle - as HMS Tyne has its life extended", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-22T20:37:00.000+02:00", "replies_count": 0, "uuid": "d752873044cdb2a34b7f2bf99e8104e489666250"}, "author": "Jack Elsom", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-hms-tyne-gavin-williamson-15452642", "ord_in_thread": 0, "title": "New navy warship is named after Newcastle - as HMS Tyne has its life extended", "locations": [], "entities": {"persons": [{"name": "williamson", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "ministry of defence", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The decision to scrap HMS Tyne has been reversed (Image: ncjMedia) Get daily\nA new naval warship has been named HMS Newcastle while the existing patrol vessel HMS Tyne will be saved from decommission to protect Britain's waters post-Brexit .\nSpeaking on board HMS Tyne in North Shields , Defence Secretary Gavin Williamson announced on Thursday that the decision to axe the ship would be reversed to protect the country's fisheries after the UK leaves the European Union.\nHMS Tyne is one of three Batch 1 Offshore Patrol Vessels (OPVs) that will be kept to \"bolster the UK's ability to protect our fishing fleet as well as our shores\", according to the Ministry of Defence (MoD).\nMr Williamson said: \"Britain’s patrol vessels are essential to protecting our waters, our fisheries and our national security. Defence Secretary Gavin Williamson announcing that a new navy ship will be named after the city of Newcastle (Image: ncjMedia)\n\"Safeguarding the future of these three ships in the Royal Navy will ensure we can respond quickly to incidents at any time, further protecting our waters as we exit the EU.\n\"By forward-operating these ships from their affiliated locations across the country, including the Tyne, it will not only allow them to react quickly, but also strengthen the bonds between the Royal Navy and local communities.\" Read More\nThe MoD said that Royal Navy patrols are protecting fisheries for 200 days a year and the announcement meant the capacity would increase to 600 days a year if required.\nLast month HMS Tyne monitored a Russian frigate as it passed through the English Channel. Photo issued by the Ministry of Defence of River Class patrol vessels of the Fishery Protection Squadron, HMS Severn, HMS Tyne and HMS Mersey exercising off the coast of Cornwall. The Royal Navy will be able to provide three times the protection to Britain's fishing fleet post-Brexit after a decision to axe the three ships was reversed. (Image: LA(Phot) Al Macleod/MoD/Crown Copyright/PA Wire)\nThe Defence Secretary also revealed that one of the new Type 26 frigates will be named HMS Newcastle, although it will be built on the Clyde.\nHe said: \"I am also delighted to be able to continue to strengthen the bond to Tyneside today, by announcing one of Britain’s future world-beating Type 26 warships will be called HMS Newcastle.\" Read More Transport spending in North East a third of London's - and gap is getting wider\nResponding to a question of whether Royal Navy ships will ever again be built on the Tyne, the Defence Secretary told ChronicleLive: \"What we're focusing on is the great news that one of the world's most advanced ships will be named after this great city. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-22T20:37:00.000+02:00", "crawled": "2018-11-22T23:27:52.001+02:00", "highlightTitle": ""}