{"organizations": [], "uuid": "10eb84d7fb94e6ba0faf0492b06b98ef2c498b5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15397587.ece/ALTERNATES/s1200/1_Untitled-design-61.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/no-deal-brexit-news-exports-15395577", "country": "GB", "domain_rank": 21960, "title": "Rising exports show why the North East NEEDS a Brexit deal to let trade continue", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-10T13:00:00.000+02:00", "replies_count": 0, "uuid": "10eb84d7fb94e6ba0faf0492b06b98ef2c498b5d"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/no-deal-brexit-news-exports-15395577", "ord_in_thread": 0, "title": "Rising exports show why the North East NEEDS a Brexit deal to let trade continue", "locations": [], "entities": {"persons": [{"name": "jack simpson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "eu share click", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Rising exports show why the North East NEEDS a Brexit deal to let trade continue The Brexit referendum hasn't stopped the North East exporting but there's concern about the final deal with the EU Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nExports to the EU are worth billions of pounds to the North East economy, Government figures have revealed.\nAnd the region’s exporters are doing better than ever.\nBut the statistics also highlight the damage that would be done to the region’s economy if the UK leaves the EU without a Brexit deal that will allow exports to continue, according to business leaders.\nJack Simpson, policy analyst at North East England Chamber of Commerce, said: \"Getting a deal is vital to keeping supply chains open and keeping those lines open to trade after Brexit.\"\nIt comes as Prime Minister Theresa May prepares to present her Brexit deal to her Cabinet colleagues - leading to a battle to win the support of the House of Commons. Brexit is hampering British trade, it is claimed (Image: PA)\nLatest data shows that 4,540 businesses in our region exported goods to the EU in 2017, bringing in £7.5bn to the local economy.\nThat’s up slightly from the 4,492 businesses that did so in 2016, exporting £7.1bn worth of goods over the course of the year. Read More Transport Minister quits over 'terrible mistake' Brexit deal\nIt means the EU market was worth nearly £400m more to North East businesses in 2017 compared to the year before.\nThe rise reflects the national trend, as the value of exports from the UK as a whole also increased over the same period. Theresa May will face a Commons battle over Brexit (Image: Victoria Jones/PA Wire)\nAnd it shows that the vote to leave the EU in the 2016 referendum has not so far stopped exporters succeeding - although we’re not due to leave until March 2019.\nExports to non-EU countries are also vital to the North East economy, and 4,002 businesses exported goods to non-EU countries last year, bringing in £5.2bn. Read More National college for the UK's leaders of tomorrow 'should be built in Newcastle'\nThat was an increase of nearly £590m compared to the year before.\nBut it means that EU trade makes up more than half the value of the North East’s exports (59%), suggesting that if Brexit stops trade with the EU then there could be dire consequences for the economy. Read More Farming industry\nMrs May is believed to be close to presenting her final Brexit deal to the Cabinet. If it wins their approval then it will be formally published, leading eventually to a key Commons vote where MPs will have the chance to reject or endorse the plans.\nHowever, the outstanding issue continues to be the Irish border, which has held up negotiations since March.\nMr Simpson said: “More than half of our experts are reliant on EU trade.\n“And much of the rest is reliant on free trade agreements we have with the EU.\" Containers on a ship (Image: PA)\nHe said that many businesses were concerned about the lack of information from the Government about what to expect once Brexit takes place.\n“In our Brexit survey 50% of businesses that replied said that Government’s lack of engagement and lack of clarity over Brexit was affecting their preparations.\n“You could say that while we’re not seeing a Brexit deficit yet, it could be a cloud on the horizon.”\nIt’s unclear whether Mrs May will be able to convince a majority of MPs to back her Brexit deal.\nShe will face opposition from hardline pro-Brexit MPs who feel she has made too many concessions to the EU while some critics of Brexit may hope to force the Government to hold a “People’s Vote” or second referendum. Read More Why the Spice Girls won't be invited to perform at Labour's pop concerts\nLabour is likely to order its MPs to vote against a deal in the hope of forcing a general election, although Labour leader Jeremy Corbyn appeared to say in his party conference speech in September that he could support the Government over Brexit in some circumstances.\nMrs May will attempt to convince MPs that voting against her deal would simply lead to the UK leaving the EU without any deal at all, an outcome most MPs would oppose.\nNewcastle North MP Catherine McKinnell said: \"These figures highlight yet again just how important exports to the EU are for the North East's economy and thousands of firms who provide good, local jobs. MP Catherine McKinnell (Image: Newcastle Chronicle)\n\"It's absolutely critical we continue to have frictionless trade and easy access to European markets - but the Prime Minister's approach to Brexit has put all of this in jeopardy.\n\"This is hugely irresponsible - and I really do think it's time to step back from the brink and ask people if this is really what they want.\n\"Before the North East economy - and people's livelihoods - are put at risk, I firmly believe we need to go back to the country and ask the public if they are prepared to accept whatever deal the Prime Minister is able to come back with. We must have a People's Vote.\" The value of goods exported since the Brexit vote Area", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-10T13:00:00.000+02:00", "crawled": "2018-11-10T13:47:04.080+02:00", "highlightTitle": ""}