{"organizations": [], "uuid": "ddc1668cc53693f3df3fcc2dadc1005947ec44fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2263945.ece/ALTERNATES/s1200/2_Untitled-design-2.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/whats-on/shopping/ten-rude-stocking-filler-secret-2263734", "country": "US", "title": "Ten rude stocking filler or Secret Santa gifts you can give this Christmas - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-27T02:00:00.000+02:00", "replies_count": 0, "uuid": "ddc1668cc53693f3df3fcc2dadc1005947ec44fb"}, "author": "Max Channon", "url": "https://www.devonlive.com/whats-on/shopping/ten-rude-stocking-filler-secret-2263734", "ord_in_thread": 0, "title": "Ten rude stocking filler or Secret Santa gifts you can give this Christmas - Devon Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "santa", "sentiment": "none"}], "organizations": [{"name": "secret santa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Ten rude stocking filler or Secret Santa gifts you can give this Christmas Website reveals its cheekiest presents that are sure to make the recipient laugh, giggle - or blush a little (and they all are under £10, with most are costing less than £5) Share He knows if you've been naughty... (Image: Darkmoon19868/Pixabay) Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nWARNING: Some people may be offended by the following products and product descriptions\nChristmas is coming and the hunt for that perfect stocking filler or Secret Santa gift is underway. If you're into giving the naughtiest and most risqué gifts possible, just because they cause much laughter and hilarity - and maybe a bit of embarrassment - help is it hand.\nOnline retailer www.findmeagift.co.uk has revealed the ten rudest, cheekiest and most offensive novelty presents it currently has in stock. So, if it's a blush inducing or laughter creating gift - that costs under £5 or £10 - you’re looking for, then look no further...\nA spokesperson for www.findmeagift.co.uk said: \"A cheeky stocking filler is the perfect opportunity to be a bit rude, crude and a little bit lewd and these gifts completely move away from the typical and seemingly boring hand cream and toiletries that usually adorn stocking fillers. Read More\n\"Check out these weirdly, wonderful, rude and a tad crude gifts. Sure, to make you laugh and giggle and blush a little.\" 1) After Dinner Nipples - £4.99\nThe clock shows that it's well after eight, and the dinner party's nearly over. Now is the moment for your big surprise. It's time for you to whip out your After Dinner Nipples! Slowly strip away the wrapping, before popping open the box to reveal them in all their teasing glory. Next, invite all the diners to select a Nipple of their choice. Nipples are best when shared. Read More Police issue urgent warning and advice after 'fake' mobile phone charger starts huge fire\nObserve your guests as they each place an After Dinner Nipple in their mouth. First, they give it a gentle suck. Then they become bolder and start to prod and probe the dark chocolate exterior with their tongue, searching for the secret touch that'll bring forth a full release of the delicious mint fondant filling. The dreamy looks of satisfaction on their faces will tell you when that magic moment has arrived. And afterwards? It's time for relaxation and laughter. A simple pleasure has made your dinner party an occasion to remember. About the Product Dark chocolate shell encasing a delicious mint fondant filling Box contains 8 tasty minty chocs 80g (2.82oz) Food items are non-returnable. This does not affect your statutory rights What do you get 2) Poo Pourri - £5.99 Poofume For The Throne Room\nEver been nervous to number two at a friend's house? Felt a bit awkward about your output at the office? Been too embarrassed to download a brownload while at your boyfriend's place?\nHey, we get it; but sometimes you gotta do what you gotta poo, and that's why we're excited to bring to you our popular Poo Pourri Original toilet spray, now in smaller 2 oz bottles! These little bottles are the perfect size for popping into your handbag, keeping ready in a coat pocket, or storing discreetly in your office desk drawer. Read More Brexit is good news for Euromillions Lottery players but only if you win the jackpot\nMore than just a funny gag gift, this Poo Pourri original scent is the useful pressie that actually works! Think before you stink and simply spray directly onto the surface of the toilet water (about 3-5 sprays) before you bomb the porcelain sea, and in place of your usual residual reek, you can enjoy the pleasant citrus aroma. No one else will ever know!\nThis makes a hilarious stocking stuffer, perfumey pressie or a treat for yourself. Poop with wild abandon wherever you go! About The Product Bring about the Crapocalypse with confidence They'll go potty for this! 2 fl oz (approximately 100 flushes!) Fresh citrus scent Pump action plastic spray bottle Spray directly onto the surface water (until covered) before you poo Warning: Only use down the toilet. Do not spray onto the skin What Do You Get? 3) Grow Your Own Hairy Beaver - £6.49\nHave you always wanted to grow your own hairy beaver? Well, thankfully, now you can!\nSimply water the beaver and watch the long blades grow. Once it’s all grown it’ll be ready to be shown to the world! Get it out in public, on the bus, in supermarkets... if no one seems interested just shout “Do you want to see my hairy beaver?!” and it’ll quickly get the attention it deserves. Police especially love hearing this and if you’re lucky they’ll even take you and your beaver back to the station to show their colleagues. Read More\nIt’s a pet, a companion, a project, a hobby, and a friend all in one! Whether you’re a seasoned beaver-growing veteran or a complete novice you’ll love growing and pruning this cheeky beaver. About The Product Great for gardeners and fans of the beaver! Cheeky adult gift that'll be well received by anyone Comes with a water bowl to encourage growth Makes for a brilliant stocking filler or secret santa gift Pack measures aprox. 10.6 x 12 x 10.2 cm What Do I Get?\nBuy it here. 4) Willy Exerciser - £2.29\nThis Willy Exerciser helps you do a full willy workout in minutes. This set of mini dumbbells fits smartly onto peckers as you tense for that six pack sausage. Read More Glitter Gravy is now a thing this Christmas - and here's how you make it\nNext time your boss asks you if you want to join for a quick workout I'd think twice. Lightweight and a convenient size for bags, pockets and office desks! Penis exercises at lunchtime, not a problem, just remember your warm up and rub down after your willy workout to ensure you do not strain the muscle... About this Product The Willy Exerciser is a set of dumbbells for your willy! Made of metal and plastic It measures approx 12.5 cm x 3.5 cm x 4.5 cm Great novelty gifts for 18+\nPump it up with our personal Willy Exerciser! Can you take the strain? Get great pecks for your pecker with a willy workout. What will you find in the box? 1 x Willy Exerciser\nBuy it here 5) Cocktail Eye Test Mug - £2.99\nThis quirky coffee mug is inspired by the iconic eye test cards you get at opticians.\nThe random lettering longer appears in physical form on large boards in opticians, but even those of us with 20/20 vision are familiar with the random arrangment of letters in descending size. The unique aspect of these rude mugs is that the featured lettering actually reads something. The Cocktail Mug contains the phrase 'I Love a Cocktail after Work', but it is arranged so that the central line features the word COCK. Read More\nIt's a funny mug that makes a nice little gift for cheeky ladies who like a giggle! About the product Inspired by eye test cards Standard 300ml mug Features the phrase 'I Love a Cocktail after Work' Please note that colours may vary slightly from image shown What do you get?\nBuy it here . 6) Grumpy Old Git Mug & Mints - £5.99\nIf grumpy is his middle name then Find Me A Gift have the gift set that even your grumpy old man won't moan about! The set includes a black mug which is dishwasher and microwave friendly (so one less thing to moan about) and a tin of minty fresh sugarfree mints... ideal for keeping your grumpy old man quiet. Read More\nEach feature the words ' Grumpy Old Git' as an added reminder! This hilarious gift set is guaranteed to put a smile on his face. About this Product Contains a coffee mug and breath mints with 'GRUMPY OLD GIT' emblazoned on them! Mug is dishwasher safe and measures approx 12.5 x 9.3 x 7.8 cm Tin of sugar free mints measures approx 7 cm x 8 cm x 1.6 cm Contains sweeteners\nFood items are non-returnable. This does not affect your statutory rights What do you get? 7) Stressticles - £4.99 Ball squeezing stress relief\nIf someone’s being a bit of a ball ache and you’re looking for a great way to vent your anger, these squeezable testicles are the perfect way to de-stress! Whether it’s your boyfriend or your boss causing you hassle, these stress relieving balls are the perfect way to squeeze your stresses away. Simply place them in your hand and squeeze and squish them as much as you please. Read More\nThese novelty stress relief balls are surprisingly satisfying! So, the next time you get into an unruly argument, don’t get mad, just squeeze your balls and take all your rage out on your fabulous Stressticles! About This Product\nBuy it here 8) Ring For A Quickie Bell - £3.99\nWhen the afternoon is dragging and you feel the need for some amorous attention, just give this little bell a ring and wait for your partner to come running to your aid. Bright red with a black handle and clapper, our Ring For A Quickie Bell is perfect for popping on your desk or on the coffee table for when you need a small distraction from your work or there's nothing on tv on a Sunday afternoon.\nWith the words 'Ring For A Quickie' printed on the side of the bell, there's no mistaking what the point of it is. Great as a Valentine's Day gift or as a cheeky anniversary present, this bell is a hilarious bit of adult humour that is sure to go down well on your next dirty weekend. Ideal as an adult gift for your one and only, this red bell is as funny as it is naughty! Or why not give this to the quietest person in the office for their secret Santa and watch them turn as red as the bell? Read More How to avoid online credit and debit card fraud on Cyber Monday\nThis item can be made entirely personalised by having a name, date, or even a message laser engraved onto it for a small extra cost. There's 48 characters available to you that will be added along the bottom of the bell, so why not add a cheeky message or pop an in-joke on to make your partner laugh out loud? With a surprisingly loud ring, the personalised Ring For A Quickie Bell is a hilarious novelty gift that your lover is sure to love! ABOUT THE PRODUCT Complete with real clapper and metal housing. A laser engraved personalisation up to 48 characters long (including spaces and punctuation) can be added for an extra £4.99. 14cm high (including handle). Please check your spelling very carefully, your personalisation will be just what you have typed and we cannot be held responsible for your errors! Read More Here are the last posting dates for Christmas with Royal Mail ENGRAVED PERSONALISATION DETAILS: Please be sure to check your spelling as carefully as you are able to. We cannot be held responsible for your typos or bad spelling. Because these are personalised items and a great deal of care is taken in making them look as good as possible, it can take up to 3 working days to engrave your gift before it is dispatched. Delivery for Engraved Gifts - No matter which delivery option you choose, please keep in mind that it will still take up to 3 working days to complete your personalisation. This means that 'Saturday delivery' will occur on the next Saturday after the engraving work is complete. For Next Day Delivery, this means your purchase will arrive on the next working day after the 3 working days it takes to personalise your product. We cannot refund personalised or engraved items as they are made especially for you. Although we don't mind naughty words, we cannot engrave really offensive messages. In these cases, your order will be cancelled and your money refunded. WHAT'S IN THE BOX?\nBuy it here 9) Chocolate Body Paint - £4.49\nIf you're a fan of chocolate then this mouth-watering edible body paint is ideal for you. Great for creative couples who enjoy sweet treats and naughty nights in, this chocolate body sauce will bring a bit of experimentation into your bedroom. This tasty choc body paint is sure to be plenty of fun and can help revive the spark in a long term relationship. Open a tube and abandon all restraint for an evening!\nUse the edible chocolate paint to express yourself and paint all sorts of fun designs. You could even write messages or create a yummy map. Let your imagination run wild, your partner's body is a blank canvas that is ready to be covered in lots of yummy chocolate. Chocolate Body Paint is a great way to spice up a relationship and it is guaranteed to make a really sexy stocking filler or Valentine's gift. Read More Sexpert reveals if giving sex toys as Christmas presents will cause bad vibes\nWhy not surprise your partner by painting hearts or 'I Love You' on your body before they come home from work? Or maybe forget the dessert when you're cooking a romantic meal for two and instead have some sensual fun with a tube of edible body chocolate. A sexy gift for any occasion, our Chocolate Body Paint is a wonderful way to let loose with your lover. About the product Edible body paint in a yummy chocolate flavour. A great naughty gift for romantic occasions. Ideal for spicing up your love life. The 120g tube of Chocolate Paint measures approx. 5.2 cm x 18 cm x 3.75 cm. What's in the box? Buy it here 10) Swearing Parrot Keyring - £5.99\nLet's face it, we all know someone whose language could make even the saltiest of sailors blush. Give them a gift that's just as brash and crude as they are with our cursing parrot keychain! Push Polly's wing and she will exclaim one of a variety of rude and offensive remarks. Great fun can be had by getting the timing just right, though you can't always predict exactly what profanity she's going to come out with!\nPolly the Swearing Parrot is a brilliantly sweary key ring. A fantastic prank gift, give her to a friend and enjoy the expressions on their face as they realised that she's not just politely asking for a cracker. The more her potty mouth spouts rude words, the more amusing it will be for you. A great way to subtly comment on the language of someone who's always shooting their mouth off, this rude parrot keyring will give them a run for their money when it comes to causing offense. Read More Gambler's warning after Betfred refused to pay out £1.7million and tried to gag him\nAlthough she may be cute and brightly coloured, this swearing parrot toy is definitely not child friendly so you might want to be careful who's around when you give this gift and before you start pressing her wing with abandon. A wonderfully adult stocking filler, Polly the Swearing Parrot Keyring is a cracker of a gift. ABOUT THE PRODUCT Plush parrot who, ahem, parrots a range of offensive phrases. Pop one on your keys and never lose them again. An ideal gift for anyone who can't control their potty mouth! Adult product that isn't suitable for use by children. This product isn't intended for use as a toy. Sound chip uses coarse language that may be offensive. EXAMPLE OF PHRASES POLLY THE SWEARING PARROT KEYRING SAYS: \"Polly Wants a f**k*ng Cracker, Give Polly a f--king cracker!\" \"Who's the pretty polly? Not you, ya lard ass!\" \"Hey Baby, show us yer t*ts\" \"Hey you, go f*ck yourself!\" WHAT DO YOU GET?\nBut it here Read More Public asked to be police 'back up' during violent arrests - or see suspects allowed to escape Want more news?\nTo keep up to date with Plymouth Live's latest news, follow us on Facebook here and Twitter here , or visit our homepage at www.plymouthlive.com\nFor Devon news, find Devon Live's Facebook page here , or our Twitter page here , or visit our homepage at www.devonlive.com\nFor Cornwall news, find Cornwall Live's Facebook page here , or our Twitter page here , or visit our homepage at www.cornwalllive.com Like us on Facebook ", "external_links": [], "published": "2018-11-27T02:00:00.000+02:00", "crawled": "2018-11-27T16:59:44.006+02:00", "highlightTitle": ""}