{"organizations": [], "uuid": "149f4fcfbeecb14130e04059590644c2ac91b05a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15224509.ece/ALTERNATES/s1200/0_DQP_BEM_011018TORY_29JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/uk-eu-agree-brexit-deal-15412557", "country": "GB", "domain_rank": 21960, "title": "UK and EU agree Brexit deal at last, but now Theresa May must convince her Cabinet and Parliament", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T20:33:00.000+02:00", "replies_count": 0, "uuid": "149f4fcfbeecb14130e04059590644c2ac91b05a"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/uk-eu-agree-brexit-deal-15412557", "ord_in_thread": 0, "title": "UK and EU agree Brexit deal at last, but now Theresa May must convince her Cabinet and Parliament", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "parliament news uk", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News UK and EU agree Brexit deal at last, but now Theresa May must convince her Cabinet and Parliament Prime Minister Theresa May now faces a battle to convince her Cabinet and Parliament to support her Brexit plans Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe United Kingdom and European Union have at last agreed on a draft Brexit deal.\nPrime Minister Theresa May was tonight, Tuesday November 13, meeting members of her Cabinet one at a time to explain the proposals.\nAnd at 2pm tomorrow, Wednesday, she will chair a meeting of her Cabinet where she will ask them formally to support the proposed agreement.\nThe deal is designed to pave the way for Brexit to take place as planned on March 29 2019, although there are likely to be issues still to be resolved even after Brexit.\nBut it remains to be seen whether Mrs May will have the support of every Cabinet colleague once they see what’s proposed.\nA Downing Street official said: “Cabinet will meet at 2pm tomorrow to consider the draft agreement the negotiating teams have reached in Brussels, and to decide on next steps. Cabinet Ministers have been invited to read documentation ahead of that meeting.”\nMrs May also needs to win the support of Parliament before any deal becomes official. A People's Vote March and Rally takes place in Sunderland City Centre (Image: Newcastle Chronicle)\nAnd that may be extremely difficult as people likely to oppose the Brexit deal include some pro-Brexit Tory MPs, some pro-Remain Tory MPs, the DUP, Labour and the SNP.\nThe Conservatives do not have a majority in the House of Commons, and have formed an alliance with the DUP, a party representing unionists in Northern Ireland.\nBut Nigel Dodds, Deputy Leader of the DUP, said: “If the reports are as we are hearing, then we couldn’t possibly vote for that.”\nThe Labour leadership has said it will reject any deal that fails to meet six tests set out by Shadow Brexit Secretary Keir Starmer.\nThey include ensuring the UK retains the “exact same benefits” that it enjoys now as a member of the single market and customs union. Read More North East MPs call on government to reveal how Brexit will affect the economy\nAs the Government is committed to leaving the single market, this is almost certainly impossible to achieve.\nJeremy Corbyn, Leader of the Labour Party, said:\"We will look at the details of what has been agreed when they are available. But from what we know of the shambolic handling of these negotiations, this is unlikely to be a good deal for the country.\n\"Labour has been clear from the beginning that we need a deal to support jobs and the economy - and that guarantees standards and protections. If this deal doesn’t meet our six tests and work for the whole country, then we will vote against it.\"\nSome Conservative MPs could also reject Mrs May’s deal, if they believe it will require the UK to follow too many EU rules after Brexit.\nThey include members of the European Reform Group, a group of Tory MPs hostile to the European Union.\nTory Boris Johnson, a former foreign secretary and supporter of Brexit, told the BBC that the proposed deal (which he had not yet seen) was “vassal state stuff.”\nHe said: “For the first time in 1,000 years this parliament will not have a say over the laws of this country. It is utterly unacceptable to anybody who believes in democracy.” Read More Brexit deal agreed LIVE: Updates as EU and UK negotiators provisionally agree withdrawal text\nAnd Mrs May could also face a second rebellion, as Labour and Conservative backbenchers who oppose Brexit push for a second referendum, or what they call a People’s Vote.\nMr Corbyn will have an opportunity to quiz Mrs May at Prime Minister’s Questions in the House of Commons at noon tomorrow, before the Cabinet meeting begins.\nA major obstacle in talks has been the question of how to avoid a hard border between Ireland and Northern Ireland after Brexit.\nIf the UK leaves the EU’s Customs Union then border checks might be needed between Ireland and the UK, including Northern Ireland. It’s been suggested that this could put the peace process at risk.\nThe Irish Government said there were still issues to be resolved.\nA spokesman for the Irish Government has said “nothing has been confirmed”.\nThe spokesman said a “number of issues were outstanding”. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-13T20:33:00.000+02:00", "crawled": "2018-11-14T01:23:58.002+02:00", "highlightTitle": ""}