{"organizations": [], "uuid": "19571db6058b0891be3e36907d6fe5f01b75dadb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11860232.ece/ALTERNATES/s1200/JS60275045.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15381115", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: M&S profits rise but 'more changes to comes'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-07T10:10:00.000+02:00", "replies_count": 0, "uuid": "19571db6058b0891be3e36907d6fe5f01b75dadb"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15381115", "ord_in_thread": 0, "title": "Business Breakfast LIVE: M&S profits rise but 'more changes to comes'", "locations": [], "entities": {"persons": [{"name": "andy williams", "sentiment": "none"}], "locations": [{"name": "hardwick hall", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "coreena ford companies", "sentiment": "negative"}, {"name": "m&s", "sentiment": "negative"}, {"name": "esh group", "sentiment": "none"}, {"name": "british steel", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "newcastle college", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Companies backing apprenticeships to be honoured at North East Business Awards\nThe region’s business community has a proud reputation for supporting apprenticeships, a record that will be recognised at the North East Business Awards.\nThe awards, which are organised by The Journal with sponsors the North East England Chamber of Commerce, include an apprenticeship category , which is sponsored by CIPD North East of England, Esh Group and Newcastle College.\nJudges will be looking for businesses that have implemented an apprentice scheme as an integral part of developing their workforce, as well as an ongoing commitment to apprenticeships, examples of how the apprentice scheme is used to develop the workforce and evidence of the benefits apprentices bring to their companies.\nWinners will be selected in heats held in Tyneside and Northumberland; Durham, Sunderland and South Tyneside; and Teesside, before an overall winner is selected at the regional final at Hardwick Hall, near Sedgefield, on May 16. Andy Williams of British Steel at the North East Business Awards (Image: Newcastle Journal) 8.47 Coreena Ford Plans approved for £175m North East garden village which will create 800 jobs\nPlans for a £175m garden village in County Durham which will create around 800 jobs have been given the green light by planners.\nAround 4,500 homes, shops, bases for businesses and leisure facilities will feature in the South Seaham project, being driven forward in a partnership between Gateshead developer Tolent and Newcastle housing association Home Group.\nTolent is the land owner, developer and contractor, and has been supported in this proposal by Newcastle based IDP Architects and Peacock & Smith Planning Consultants together with Prof Roy Sandbach and the Centre of Ageing at Newcastle University, and Northumbria University.\nTolent welcomed news after securing planning consent, having worked closely with Durham County Council on the scheme for more than three-and-a-half years.\nCompany chairman John Wood said the Garden Village has been carefully designed to create what will be a national and international exemplar, that is truly inclusive and welcoming to all parts of the community.\nHe said the vision has been to create a sustainable community with a mix of distinctive high quality housing that improves the quality of life for all residents in relation to health and technology. CGI's show how the garden village will have different styles of housing (Image: Tolent) 8.40 Coreena Ford Smaller firms expect to cut investment over the next year, study suggests\nGrowth in domestic orders for smaller firms has “ground to a halt”, according to a new study.\nResearch among 331 small to medium sized companies (SMEs) suggested that growth is expected to stall in the coming months.\nThe CBI said its survey indicated that domestic orders are set to fall and exports will be “flat” for the rest of the year. Business optimism has deteriorated at the fastest pace since the EU Referendum, and over the next year, firms expect to cut back “significantly” on investment, said the CBI.\nAlpesh Paleja, the CBI’s principal economist, said:\nSME manufacturers are clearly feeling the pressure, both from softer global economic momentum - reflected in a tailing-off of exports orders - and Brexit uncertainty biting hard on investment plans.\nThe significant scaling back of planned capital spending is further proof that Brexit uncertainty is taking a real bite out of firms’ plans to grow and innovate. The Government’s number one priority has to be securing a withdrawal agreement with the European Union, so firms can enter the transition period and start to navigate the future with more certainty. 8.35 KEY EVENT Persimmon boss to leave over £75m pay deal furore\nPersimmon boss Jeff Fairburn is to step down at the end of the year as the housebuilding giant looks to distance itself from the controversy over his £75m payout.\nThe Charles Church group said Mr Fairburn will leave on December 31 and will then be replaced on an interim basis by David Jenkinson, currently group managing director.\nPersimmon has begun a search for a permanent successor to Mr Fairburn.\nThe group said the furore over his pay had become a “distraction” that was having a “negative impact on the reputation of the business and consequently on Jeff’s ability to continue in his role”.\nBut it said that, as he was leaving at the company’s request, it was not legally able to withhold any of the share payouts due under the controversial 2012 long-term bonus scheme.\nIt said it had agreed with Mr Fairburn to cut his 12-month notice period and that he will not receive any further salary or benefits after December 31. He also has no bonus entitlement for 2018.\nChairman Roger Devlin said: “Given the continuing distraction around the scale of his remuneration resulting from the 2012 LTIP (long-term incentive plan), the board believes that it is now necessary for there to be to be a change of leadership.”\nMr Fairburn said: “I had hoped that revealing my plans to create a charitable trust and to waive a proportion of the award would enable the company to put the issue of the 2012 LTIP behind it.\n“However, this has not been the case and so it is clearly now in the best interests of Persimmon that I should step down.” Persimmon chief executive Jeff Fairburn (Image: PA) 8.29 Coreena Ford JD Wetherspoon hints at weaker annual performance\nPub group JD Wetherspoon expects annual results to be weaker than the previous year, despite sales growing “strongly”.\nIn a trading update for the 13 weeks to 28 October, the chain said like-for-like sales increased by 5.5%, and total sales were up 6.2%.\nDespite strong growth, chairman Tim Martin said the company was dealing with tough comparatives, having delivered several years of record profits.\n“It is difficult to be too precise at this early stage of the current financial year, but we now expect a trading outcome slightly below that achieved in the previous financial year,” he said “We will provide further updates on our trading as we progress through the year.”\nMr Martin reiterated his belief that the UK should adopt free trade after Brexit.\nShares in Wetherspoon’s dropped by 5% in early trading. The company has opened two new pubs in the first quarter and has closed or sold three. It guided new openings of between five and 10 pubs in the current financial year. The group also said on Tuesday that it is increasing staff wages in response to record levels of unemployment. “Having had several recent years of record profits, we are not immediately seeking to recoup these increased costs through higher pricing or ‘mitigation’, but will review that during the year,” said Mr Martin. JD Wetherspoon chairman Tim Martin 8.22 KEY EVENT Greggs launches 500th breakfast club in Wallsend in fight against child hunger\nBakery giant Greggs has opened its 500th breakfast club at a school in the North East.\nThe company’s chief executive Roger Whiteside was joined by Dame Julia Cleverdon, vice president of Business in the Community, to open the club at Stephenson Memorial Primary School in Wallsend, North Tyneside – 19 years after the initiative first began.\nThe clubs started in 1999 after then Greggs CEO Mike Darrington learned of the benefits of breakfast initiatives at a school in Walker, Newcastle, where Norma Redfearn, now mayor of North Tyneside, was headteacher.\nAround 160 children at the Wallsend school were served breakfast, including toast, cereal and fruit, becoming the latest to benefit from the scheme which has been shown to have raised attainment at hundreds of schools around the country, including 121 in the North East.\nMr Whiteside said: “This is a very significant milestone and it’s such a simple idea. When we show our corporate partners it doesn’t take much to persuade them to get involved.\n“It just needs a bit of commitment – we provide the food and the school organises the breakfast club by getting volunteer parents involved. And the science is clear – children who eat breakfast in the morning do better than those who don’t, and various studies verify that. Layton Smiles with Roger Whiteside - The Greggs Foundation celebrates the launch of its Breakfast Club at Stephenson School in Wallsend (Image: Newcastle Chronicle) 8.15 Coreena Ford Love Island broadcaster reveals rising ad revenues\nLove Island broadcaster ITV has said total advertising revenues rose 2% in the first nine months of the year.\nBut it warned an “increasingly uncertain economic environment” was set to see total ad revenues fall around 3% in the fourth quarter and be broadly flat over the full-year.\nCarolyn McCall, ITV chief executive, said: “Online advertising continues to deliver strong double-digit revenue growth.\n“We are seeing some softening in ITV Family net advertising revenues in Q4 due to the increasingly uncertain economic environment and as a result we expect total advertising to be down around 3% in Q4 and broadly flat over the full year.”\nShe added: “We continue to have a strong pipeline of programmes which will be delivered in 2019 and beyond, with entertainment shows in new territories, including Love Island US and Sunday Night Takeaway in Australia, new dramas including World On Fire, Noughts And Crosses, Wild Bill, The Bay and Zero Zero Zero and returning dramas Gormorrah and Line Of Duty.”\nShares in ITV fell 4% in early trading. Jack and Dani win Love Island (Image: ITV) 8.12 FTSE and pound latest\nThe FTSE-100 index opened at 7040.68.\nThe pound at 8am was 1.3133 dollars compared to 1.3075 dollars at the previous close. The euro at 8am was 0.8721 pounds compared to 0.8725 pounds at the previous close.\nM&S share price is currently down 4% to 290.40p following its interim announcement. London Stock Exchange (Image: PA) 8.05 KEY EVENT M&S profits rise but CEO says more changes are to come\nThe CEO of Marks & Spencer says more changes are to come at the high street chain, despite defying expectations to reveal a 2% increase in profits to £223.5m for the first half of the year.\nThe retailer’s revenue was down 3.1% to £4.966bn, reflecting declining sales in both the food, and clothing and home divisions.\nM&S said it does not expect much improvement in sales in the near future, as it deals with “the growth of online competition and the march of the discounters”.\nIt said its closure programme of over 100 ‘full-line’ stores is generating encouraging transfer rates - but that significant further change is required.\nInitial steps have been made to drive digital catch up and change in culture now that 20.4% of UK clothing and home sales come through its website.\nAt least £350m of cost savings are targeted, it said.\nChief executive Steve Rowe said there were more changes to come, on top of previously announced store closures and a reorganisation of the company’s structure. He said:\nIn May I set out in our “Facing the Facts” presentation, the challenges we face and the steps we are taking in this the first phase of our transformation programme. Against the background of profound structural change in our industry, we are leaving no stone unturned and reshaping our business, its organisation and culture.\nThis phase is about rebuilding the foundations of the future M&S and we are judging progress as much by the pace of change as the trading outcomes. Already, we have reorganised into a family of strong businesses in the biggest change to our structure for decades. We now have a largely new, very determined and energetic management team in place. M&S is becoming a faster, more commercial and more digital business.\nWe are on track to restructure our store portfolio with over 100 full-line closures and expect to see newly remodelled stores open next year. We are fixing the basics of our online channel and there are very early signs of improvement. Every aspect of our ranges, how we trade, our supply chain and marketing is undergoing scrutiny and change. M&S CEO Steve Rowe (Image: Publicity Picture) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15381115;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-07T10:10:00.000+02:00", "crawled": "2018-11-07T11:37:57.023+02:00", "highlightTitle": ""}