{"organizations": [], "uuid": "f80fe2eed20c19dd866e4336fe57b1a07e495e18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15417767.ece/ALTERNATES/s1200/3_Brexit1.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-deal-crisis-frustrated-mps-15429850", "country": "GB", "domain_rank": 21960, "title": "Brexit deal crisis: 'Frustrated' MPs put Theresa May on the brink after chaotic week", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-18T07:00:00.000+02:00", "replies_count": 0, "uuid": "f80fe2eed20c19dd866e4336fe57b1a07e495e18"}, "author": "Sonia Sharma", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-deal-crisis-frustrated-mps-15429850", "ord_in_thread": 0, "title": "Brexit deal crisis: 'Frustrated' MPs put Theresa May on the brink after chaotic week", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jacob rees-mogg", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nIt's been a turbulent week in Parliament with Theresa May continuing her fight to secure a Brexit deal for the country.\nThe Prime Minister published her draft withdrawal agreement with the EU on Wednesday - a 585-page document setting out the terms of the UK's departure and including details such as how much money will be paid to the EU, details of the transition period and citizens rights.\nMrs May received a hostile reception as she delivered a statement to the House of Commons defending her proposals.\nLabour leader Jeremy Corbyn said she had produced “a botched deal” and his party would vote against it.\nThe Prime Minister was also repeatedly criticised by her own Conservative colleagues, with Tory MP Jacob Rees-Mogg suggesting to her face that she should be fired. Jacob Rees-Mogg MP speaks in the House of Commons, London, following Prime Minister Theresa May's statement on the draft Brexit withdrawal agreement (Image: PA)\nMr Rees-Mogg later announced that he had written to Sir Graham Brady, the chairman of the 1922 Committee of backbench MPs, to say he had no confidence in Mrs May.\nSome Conservative Brexiteers who are unhappy with the agreement have also been submitting letters of no-confidence in Mrs May.\nIf 48 letters are sent, then a vote will be triggered and she could face a challenge to her leadership.\nIn addition, the deal has been opposed by the DUP, which has been propping up Mrs May’s Government in the House of Commons.\nIn a press conference later in the day, Mrs May made it clear she planned to continue as Prime Minister, and to keep pushing her proposed Brexit deal. Read More\nAmid the chaos, two senior ministers and several other junior ministers and aides resigned.\nAmong those to go were Brexit secretary Dominic Raab and Work and Pensions Secretary Esther McVey.\nAnd Northumberland MP Anne-Marie Trevelyan quit from her role as a ministerial aide in the Department for Work and Pensions.\nAs the week drew to a close, former home secretary Amber Rudd was brought back to the Cabinet as the new Work and Pensions Secretary.\nMeanwhile, Mrs May warned her Tory opponents their alternate Brexit plans would not make their problems disappear. Prime Minister Theresa May holds a press conference at 10 Downing Street, London, to discuss her Brexit plans. (Image: Matt Dunhaml/PA Wire)\nShe said the so-called Norway and Canada models favoured by her most hardline critics would not solve the issue of the Irish border backstop.\nIn an interview with the Daily Mail, Mrs May said: \"People say 'If you could only just do something slightly different, have a Norway model or a Canada model, this backstop issue would go away'. It would not. That issue is still going to be there.\n\"Some politicians get so embroiled in the intricacies of their argument they forget it is not about this theory or that theory, or does it make me look good.\"\nMrs May appointed Stephen Barclay as her new Brexit Secretary, the third this year, but the role has been further downgraded as the Prime Minister will in future take sole control of negotiations on EU withdrawal. Read More Brexit is creating 'lost years' where nothing else gets done, Sir Keir Starmer says\nLeave-supporting Mr Barclay's job will be limited to the domestic delivery of EU withdrawal, preparations for Brexit either with or without a deal and shepherding legislation through Parliament.\nHe said: \"We now need to keep up the momentum to finalise the withdrawal agreement and outline political declaration and deliver a Brexit that works for the whole UK.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-18T07:00:00.000+02:00", "crawled": "2018-11-18T09:54:53.001+02:00", "highlightTitle": ""}