{"organizations": [], "uuid": "aa7bbcf549a1dfcd8d16a8b773ab2a1a579982a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15448199.ece/ALTERNATES/s1200/0_Sunderland-Civic-Centre.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/cash-strapped-council-launches-consultation-15448192", "country": "GB", "domain_rank": 21960, "title": "Cash-strapped council launches consultation on proposals to cut millions from service spending", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-22T10:45:00.000+02:00", "replies_count": 0, "uuid": "aa7bbcf549a1dfcd8d16a8b773ab2a1a579982a2"}, "author": "Amy Kennedy", "url": "https://www.chroniclelive.co.uk/news/north-east-news/cash-strapped-council-launches-consultation-15448192", "ord_in_thread": 0, "title": "Cash-strapped council launches consultation on proposals to cut millions from service spending", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "amy kennedy commercial multimedia", "sentiment": "negative"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "invalid email council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Amy Kennedy Commercial Multimedia Journalist 08:45, 22 NOV 2018 Sunderland Civic Centre (Image: Handout) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nCouncil bosses are urging the public to have their say on a raft of budget proposals as they prepare to cut more than £11million from service spending next year.\nRevenue budget proposals for 2019/20 were backed by Sunderland City Council's cabinet today (November 21) as part of financial planning for next year.\nThis falls against a backdrop of plans to tackle a council funding gap of around £50million over the next three years.\nProposals for 2019/20 include charging for public toilets - saving the council £155,000 - a review of charges for bulky waste collection and around 60 potential redundancies.\nA review of children's services, such as increasing the range of specialist care available within Sunderland for looked after children, could also see £5million cut.\nNow, city leaders are calling on the public to share their views on the proposals in a six-week consultation to help form firmer plans ahead of the final budget being signed off next year.\nCabinet secretary, Paul Stewart, speaking at Sunderland Civic Centre, said: \"It's clear that once again we have to make difficult budget cuts.\n\"There will be difficult decisions to be made if we're to set a balanced budget which we're legally required to do so in the new year.\n\"The proposals to invest a further £126 million across the city demonstrates this council's commitment to improve the outcomes of this city and our communities.\" Read More\nThe meeting heard future finances were subject to several external factors, such as government changes to business rate relief retention and the outcome of Brexit.\nHowever, a £126million boost in capital spending up to 2022/23 aims to boost investment across the city.\nNew capital proposals - in addition to more than £340million of existing investment plans - include £41million to replace the Civic Centre and a £21million update of Sunderland Museum, Winter Gardens and the Central Library.\nCouncil leader, Coun Graeme Miller, also praised the work of council staff in delivering the budget. Sunderland City Council Leader Graeme Miller (Image: Newcastle Chronicle)\n\"It's yet another example of how well the officer and staff team have been in pulling these plans together and delivering us a budget we can see our way through,\" he said.\n\"Aided as always by our finance team who always seem to find the magic money tree hidden somewhere in our civic centre to get the books balanced.\"\nOther proposed savings for 2019/20 include £1.7million for environment and transport with changes across several services.\nIdeas include creating a joint CCTV facility with South Tyneside Council , increased use of carpooling, a heating plan for council buildings and increased annual fees for allotments.\nHealth and social care changes could also see £1.7 million saved, with more than half a million pounds linked to delivery \"remodelling\" of the Sunderland Care and Support Service.\nSince 2010, the council has made £290million in cuts as a result of reductions in funding, rising costs and increasing demand.\nBy 2022, Coun Miller added, the council will have around £375 less to spend for each Sunderland household than it has at the moment. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-22T10:45:00.000+02:00", "crawled": "2018-11-22T11:30:28.013+02:00", "highlightTitle": ""}