{"organizations": [], "uuid": "5c8d5b2affb511c89234e9b814dcbddf93f061eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15360441.ece/ALTERNATES/s1200/0_Building-work-at-St-James-Park-in-Newcastle.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-opinion/real-divide-uk-between-towns-15360460", "country": "GB", "domain_rank": 21960, "title": "Why the real divide in the UK is between towns and cities", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-01T19:04:00.000+02:00", "replies_count": 0, "uuid": "5c8d5b2affb511c89234e9b814dcbddf93f061eb"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-opinion/real-divide-uk-between-towns-15360460", "ord_in_thread": 0, "title": "Why the real divide in the UK is between towns and cities", "locations": [], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "st james", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why the real divide in the UK is between towns and cities Journal business editor Graeme Whitfield on the need to reverse the neglect of our towns Share Business opinion Cranes tower over St James' Park as building work continues near the home of Newcastle United (Image: Newcastle Journal) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA few years ago a prominent economist and commentator visited the North East and asked me for my opinion on the state of the regional economy.\nAfter I’d stopped laughing, I told him that there were lots of cranes on the skyline and lots of swanky new bars opening, so maybe things were pretty good.\nThe prominent economist and commentator (an advisor to a recent PM, with a weekly column in a broadsheet national newspaper) nodded sagely and said: “Yes, that’s a pretty good assessment.”\nIt was? Was my flippant, slightly panicked answer actually intelligent? I had always dreamed that my throwaway comments actually contained nuggets of genius but never had anyone actually agreed. Perhaps the Whitfield crane/bar theory would soon be taught at universities up and down the land, scholars poring over the implications of overpriced European lagers on sale in our towns and cities.\nI thought of my crane/bar theory this week as I became involved in a discussion on whether Leeds was the right choice for Channel 4’s new HQ.\nI have nothing against the decision that was made, but after a while it occurred to me that if Channel 4 wanted to be really radical, it shouldn’t have gone to Leeds at all (or Manchester, or Birmingham). It should have moved its base to Accrington.\nI go to Accrington a few times a year as it is where my in-laws live and I’m sure they won’t mind me saying that it is a town that is down on its luck. The national retail chains have moved out, there are empty lots and where there are new jobs, it is in call centres or the like.\nAnd for Accrington, you can probably read Stanley or Ashington or many other towns in the North, the Midlands and the South West.\nBecause I am increasingly coming to think that the real divide in Britain today isn’t between North and South, left and right, or even Remain and Leave. It is between cities and towns.\nPlaces like Newcastle (and Leeds and Manchester) have cranes on their skylines and swanky new bars. When banks or shops announce closure programmes, they tend to be spared. They have universities and the vibrant, multi-cultural and young populations they bring, and the exciting new businesses they attract.\nSome of these things exist in our towns too (and there are towns that are doing OK) but to a much lesser degree. It impacts on life chances and it’s why many people in these towns are turning to things like Brexit, or Trump in the US, for a different answer.\nThe fact that many towns are fighting back, and not in the way we city types might want, should not come as a surprise.\nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-01T19:04:00.000+02:00", "crawled": "2018-11-02T03:32:55.008+02:00", "highlightTitle": ""}