{"organizations": [], "uuid": "125d7fdbea0db3383e7370587a027a9716671ed7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14381866.ece/ALTERNATES/s1200/2016-Labour-Party-Conference-in-Liverpool.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-city-council-leader-nick-15416602", "country": "GB", "domain_rank": 21960, "title": "Newcastle City Council leader Nick Forbes explains why he's running to be North of Tyne mayor", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T02:01:00.000+02:00", "replies_count": 0, "uuid": "125d7fdbea0db3383e7370587a027a9716671ed7"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-city-council-leader-nick-15416602", "ord_in_thread": 0, "title": "Newcastle City Council leader Nick Forbes explains why he's running to be North of Tyne mayor", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "negative"}, {"name": "tyne", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "news newcastle city council", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle City Council leader Nick Forbes explains why he's running to be North of Tyne mayor In a column for Chronicle Live, the leader of Newcastle City Council explains why he's putting himself forward to be the region's first ever elected mayor Share Labour Councillor Nick Forbes (Image: Daily Mirror) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe devolution deal signed by Northumberland , North Tyneside and Newcastle is our first step as a region towards taking control of our own destiny and making clear that, whatever the challenges we face in the years ahead it is people here, not in London, who should shape our future.\nI am putting myself forward as a potential Labour candidate for the new mayoral role with a vision to create more and better jobs, build decent homes, raise excellence in schools and show how an economy can work for all.\nThe Devolution deal doesn’t compensate for the money taken from our public sector by austerity, but it gives us a great chance to start to rebuild.\nWe were the cradle of the first industrial revolution, with our shipbuilding, coal mining and the birth of the railways; and we can once again be a driving force in the UK’s economy with our strengths in life sciences, new digital technologies, cultural and energy sectors. Newcastle City Council Leader Nick Forbes at the Convention of the North in Gateshead (Image: Newcastle Chronicle)\nWe know it is people that make this region a success, and everyone deserves a chance to contribute and succeed.\nAs mayor I would seek to ensure that when we invest we leave no one behind. I would commit to ensuring Labour values of equality, fairness and social justice are built in to every job we create.\nI demonstrated that commitment in Newcastle when we became the first council in the region to abolish zero-hours contracts, introduce a Living Wage, and back the TUC’s Great Jobs for Everyone Campaign.\nI would make job creation my number one priority, putting people from Berwick to Byker central to our future.\nBut we need to do more to promote our region, because no-one is going to do it for us.\nI would support efforts to bring back the successful Passionate People, Passionate Places marketing campaign. Nick Forbes speaks at a devolution event (Image: Newcastle Chronicle)\nOur whole region benefits from images of Bamburgh beach, the Tyne Bridge or Durham Cathedral; they would give our tourism industry an international boost, and it is about time the best we have to offer is once again seen on underground platforms (and now iPads) across the UK, Europe and beyond.\nThat campaign was a success not just because it promoted places; it showed we succeed when we shout loud and proud about our north, our pride and our warm welcome.\nBut we also need a Mayor who isn’t afraid to stand up and be counted when we’re not getting a fair deal from Government, or when policies – such as the disastrous Universal Credit – harm our communities.\nI would oppose further privatisation of our NHS services, and campaign against any further cuts to public health or council budgets. Read More North of Tyne devolution: here's everything you need to know about the announcement\nOur market towns badly need further help through a reformed business rate system to protect and promote local shops, and groundbreaking work in Newcastle on homelessness prevention could be developed at scale to help people across a wider area.\nThere are major battles still to be fought to ensure we get our fair share of regional aid funds after Brexit.\nWe need a mayor to fight for the investment we need to ensure our trains and public transport is modern and fit for purpose, and to argue the corner for our schools to get the funding and support they need in order to be outstanding.\nAbove all, however, having a mayor gives us the chance to tell a story about our north that reflects who we are, and what our priorities are, not what London’s decision makers think about us.\nThis devolution deal should be the first step on a journey, and I am putting myself forward as the candidate with the credibility, experience and passion to be able to deliver a better future for the many not the few. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-15T02:01:00.000+02:00", "crawled": "2018-11-15T02:40:07.018+02:00", "highlightTitle": ""}