{"organizations": [], "uuid": "f4b2d77ecac7ef201ac66ffdeed54614a472a75b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15093790.ece/ALTERNATES/s1200/1_PNP_NEC_260914sage_011JPG.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15361702", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Sage ends search for CEO after Stephen Kelly's shock exit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-02T10:00:00.000+02:00", "replies_count": 0, "uuid": "f4b2d77ecac7ef201ac66ffdeed54614a472a75b"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15361702", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Sage ends search for CEO after Stephen Kelly's shock exit", "locations": [], "entities": {"persons": [{"name": "stephen kelly", "sentiment": "negative"}, {"name": "vince cable", "sentiment": "negative"}, {"name": "christine jardine", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "johnnie walker", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "diageo liberal", "sentiment": "negative"}, {"name": "diageo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Vince Cable talks with drinks giant Diageo\nLiberal Democrat leader Vince Cable is set to discuss trade in a post-Brexit Britain during a visit to drinks giant Diageo.\nMr Cable will speak to Diageo’s executives at the firm’s Edinburgh office this afternoon, along with local MP Christine Jardine.\nThe firm is one of the biggest drinks companies in the world and makes brands such as SMirnoff vodka and Johnnie Walker whisky.\nMr Cable will address this week’s Budget and underline his party’s call for a vote on the Brexit deal. He is expected to say:\nThis Budget has neither ended austerity nor addressed the fundamental problems in the economy.\nInstead it is overshadowed by the damaging impact that Brexit will have on the UK’s public finances.\nScottish spirits make a huge contribution to the UK’s exports and in Diageo we have a true titan. But to businesses like these it makes absolutely no sense to put barriers in the way of frictionless trade across the EU.\nLiberal Democrats are demanding better for British business with fairer taxes, a skilled workforce and a final say on the Brexit deal. Liberal Democrat leader Sir Vince Cable (Image: PA) 9:12 Ikea boosts sales despite tough climate\nSwedish furniture giant Ikea has revealed a rise in its UK sales despite consumers facing a “tough economic climate”.\nThe company said UK sales for the year ending August 31 jumped 5.9% to £1.96bn.\nOnline sales boosted revenue, with Ikea’s website attracting 199.3 million visits. Website sales grew by 14.4% and represent 15.5% of total sales.\nIkea also increased its market share in the UK by 0.4% to 8.4%. However, boss Javier Quinones pointed to a “tough economic environment”.\nHe said:\nWhilst we’re pleased with our performance, we recognise that a challenging retail and economic environment means we need to continue to respond to our customers’ needs and invest in an Ikea that is here for people, whenever and wherever they need us.\nIn a tough economic environment, our homes provide a sanctuary and we know that consumers continue to update them with soft furnishings, textiles and decorations. Ikea in Gateshead (Image: Newcastle Chronicle) 9:03 KEY EVENT B&Q cancels Black Friday after saying customers don't trust it\nB&Q will abandon Black Friday for the first time this year as it released research suggesting almost half of consumers do not plan to shop in the sales event.\nThe DIY chain said it would instead focus on “year-round low prices”, claiming research found shoppers do not trust Black Friday deals and are turning away from the event.\nSome 46% of people say they are not planning to shop in this year’s event on November 23, according to a poll for the store, while 43% said they often or always returned items after regretting purchases made in short-term sales.\nB&Q announced in July it was investing £100m in bringing down overall shop prices as it aims to cut back on promotions and discounts.\nThe firm’s commercial director Paul White said:\nShoppers have told us they trust stable low prices far more than ‘here today, gone tomorrow’ deals, which is why we have invested £100m in our year-round low prices across the store.\nLast year, Walmart-owned Asda announced it was once again not taking part in Black Friday - for the third year running.\nThe supermarket has said its customers prefer year-round deals rather than a single day of discounting.\nAsda is widely acknowledged to have introduced Black Friday to the UK in 2013 but its stores were scenes of chaos a year later when shoppers fought over cut-price televisions during the event. B&Q will abandon Black Friday for the first time this year (Image: Handout) 8:56 Paddy Power Betfair upgrades full-year forecasts\nPaddy Power Betfair has upgraded its full-year profit forecasts as high-rollers from New York splurging $1.5m (£1.1m) a day boosted its performance in the US.The bookmaker now expects full-year earnings to come in between £465m and £480m - up from between £460m and £480m - following a surge in betting at the Meadowlands Racetrack in New Jersey.It generated more than $1.5m (£1.1m) of stakes per day in October, making it one of the biggest sports betting outlets in the world, the bookmaker said.Approximately 30% of all bets booked at the track are estimated to have come from New York residents.However, the firm saw group profit knocked in the third quarter after booking losses at its fantasy sports business in the US, FanDuel.The bookmaker saw underlying earnings slip 16% to £101m in the three months to September 30, or 15% down on a constant currency basis.Revenue grew 10% year on year, or 12% in constant currency, to £483m.Sales were driven by online, which saw a 15% jump in revenue. But its high street outlets in the UK suffered a 1% decline and fell by 6% in Ireland.Paddy Power Betfair chief executive Peter Jackson said:\nQuarter three was a good quarter for the group. In Europe, the encouraging momentum that we saw in quarter two accelerated further, with online revenue up 15%.\nThis momentum, which was evident in both Paddy Power and Betfair, is driven by enhancements in product and good execution in promotions and marketing.\nIn the US, the exciting potential of the sports betting opportunity and the strength of our strategic positioning has been evidenced by our experience to date in New Jersey. Paddy Power Betfair logo KEY EVENT North East firm cancels £100m investment due to Brexit uncertainty\nThe uncertainty over Brexit has led a North East company to cancel a £100m investment , a business leader has revealed.\nCBI director-general Carolyn Fairbairn outlined the cost to the region from the continuing uncertainty over the UK’s departure from the EU as she visited the North East to speak to some of the region’s leading firms.\nShe said “real jobs” in the North East were being affected by the lack of clarity, with her revelation coming the day after Brexit Secretary Dominic Raab appeared to suggest a withdrawal deal would be finalised by November 21, only for his department to insist shortly afterwards that there was no set date.\nBrussels and Downing Street have also played down speculation about a breakthrough in Brexit talks, with the possibility of a no-deal Brexit now hanging over both sides.\nMs Fairbairn said the possiblity of a no-deal Brexit had risen in the last few months and would be particularly damaging to the North East.\nShe said:\nThe uncertainty has been pretty well unprecedented for businesses, with political turbulence on top of that. The headlines and the froth has not been helpful.\nWhat I would say is that, in the last three months, the uncertainty has just gone up in order of magnitude.\nWe’ve just completed a survey of how our members are responding to Brexit and 80% have postponed or stopped investment as a result of the uncertainty. By the end of December, if there isn’t a shape of a deal, 63% of companies will have implemented contingency plans.\nThis is incredibly real, this is about real jobs. I’m talking to a member in the North East who has totally shelved a £100m investment plan so we are talking about real impact on jobs right now. Carolyn Fairbairn, CBI director-general (Image: Newcastle Chronicle) 8:42 Profits knocked at Millennium & Copthorne hotel group\nHotels group Millennium & Copthorne has blamed Brexit and global trade tensions for contributing to a hefty fall in third-quarter profit.The company saw pre-tax profit tumble 38.2% to £34m in the three months to September 30.Revenue also dipped 3.8% to £253m in the period. Revenue per available room - a key industry measure - fell 2.8% to £87.23.Chairman Kwek Leng Beng said:\nThe hospitality sector is facing challenging trading conditions, including significant supply growth, technological ‘disruption’, industry consolidation and rising minimum wage requirements and labour costs in key jurisdictions.\nThese challenges, which are impacting the availability of talent and reducing margins, are exacerbated by geopolitical headwinds, such as the uncertainty surrounding Brexit and global trade tensions. The Union Jack behind the EU flag hanging outside Europe House in Smith Square, London (Image: Yui Mok/PA Wire) 8:35 North East struggles in list of best UK cities to live and work in\nThe North East’s main towns and cities are at the wrong end of a table ranking the best places to live and work in the UK, despite improvements in a range of areas.\nThe Demos-PwC Good Growth for Cities Index 2018 measures the performance of 42 of the UK’s largest cities against 10 indicators including employment, health, income and skills, housing affordability and environmental factors.\nThe latest index has Newcastle, Middlesbrough/Stockton and Sunderland all in the bottom 10, with all three areas being ranked poorly on income levels, health and home ownership.\nBut there was also cause for some optimism, with Middlesbrough/Stockton being ranked the second most improved area in the UK over the last year, and Newcastle having the second best work-life balance nationally.\nNewcastle has also improved from 38th in the UK 10 years ago to 33rd now, though Sunderland is now ranked joint bottom with Swansea.\nJonathan Walker, assistant director of the North East England Chamber of Commerce,said:\nWe firmly believe the North East is a great place to live and work, but as this report highlights, we know there is room for improvement when it comes to creating more and better jobs.\nThe more we, as a region, can do to raise awareness about all of the North East’s assets and quality of life, the greater chance we stand of attracting the type of investment that will move our cities up the rankings.\nThe rankings are topped by Oxford, followed by Reading and Southampton. Preston was judged to be the most improved city. The view from the roof of Newcastle United's St James' Park Stadium (Image: Newcastle Chronicle) 8:30 UK has poorest work-life balance study suggests\nUK employees have the poorest work-life balance in Western Europe, according to a new study.\nResearch by footwear firm Mahabis shows that workers in Scandanavian countries have the healthiest balance between work and personal time, while those in the UK have one of the worst the worst.\nA study of 20 countries placed the UK in 16th position, ahead of Greece, the US, Japan, and South Korea.\nIt also claims that one in eight adults in the UK work more than 50 hours per week.\nMahabis founder Ankur Shah said:\nThe stresses and strains of modern life has seen people’s work-life balance suffer, and this is particularly true in the UK.\nMahabis operates a four-day working week and encourages its staff to work from “anywhere, at any time”. The UK has one of the worst work-life balances 8:17\nThe FTSE-100 index opened at 7114.66.\nThe pound at 8am was 1.3028 dollars compared to 1.2997 dollars at the previous close.\nThe euro at 8am was 0.8776 pounds compared to 0.8784 pounds at the previous close. 8:10 KEY EVENT Sage ends search for permanent CEO\nNewcastle tech giant Sage Group Plc has appointed a permanent CEO two months after the shock exit of the company’s former head Stephen Kelly.\nThe international software firm has appointed Steve Hare to the role with immediate effect.\nMr Hare joined the board on January 3 2014 as chief financial officer, and was appointed as interim chief operating officer on August 31 2018, when Mr Kelly left the firm.\nCommenting on his new role Mr Hare said:\nIt is an honour to be asked to lead Sage as CEO. I continue to believe that by putting our customers, our people and innovation at the heart of everything we do, we will succeed in our journey to becoming a great SaaS business.\nSage is now on the hunt for a new CFO. Until a replacement is found Mr Hare will combine his duties as Sage’s finance head with those as SEO.\nDonald Brydon, chairman, said:\nI am delighted Steve has agreed to lead Sage on the next stage of its journey to become a great SaaS business. He has impressed the Board with the momentum, focus and clarity he has brought to the organisation over the last few months as COO but also throughout his tenure as CFO.\nAs we looked externally for the experience, vision and deep knowledge required to accelerate operational execution it very quickly became clear through Steve’s early decisions and his clear prioritisation that he is the right person to lead Sage. Sage CEO Stephen Kelly steps down More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15361702;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-02T10:00:00.000+02:00", "crawled": "2018-11-02T14:19:40.037+02:00", "highlightTitle": ""}