{"organizations": [], "uuid": "b25973477c764660700bafcad3badbc27577fb79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/property/article802954.ece/ALTERNATES/s1200/New-homes-Rui-Vieira-PA-WirePNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/property/south-west-house-prices-demand-2196509", "country": "GB", "title": "South West house prices and demand decline as Brexit uncertainty persists", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T16:18:00.000+02:00", "replies_count": 0, "uuid": "b25973477c764660700bafcad3badbc27577fb79"}, "author": "Tina Penberthy-Hutchings", "url": "https://www.devonlive.com/news/property/south-west-house-prices-demand-2196509", "ord_in_thread": 0, "title": "South West house prices and demand decline as Brexit uncertainty persists", "locations": [], "entities": {"persons": [{"name": "rui vieira/pa wire", "sentiment": "none"}], "locations": [{"name": "south", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "royal institution of chartered surveyors", "sentiment": "none"}, {"name": "rics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South West house prices and demand decline as Brexit uncertainty persists 'House prices in the South West fell for the second consecutive month in a row' Share A fall in interest from new buyers in the South West has been reported (Image: Rui Vieira/PA Wire) Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA fall in interest from new buyers in the South West led to a downward trend in the region’s house prices last month, according to the latest RICS (Royal Institution of Chartered Surveyors) UK Residential Market Survey.\nThe monthly survey revealed house prices in the South West fell for the second consecutive month in a row. Comparatively, house prices were reported as falling or flat in other UK regions during the month of October including London, East of England and Wales, but prices remained strong in the East Midlands, Scotland and Northern Ireland.\nThe weaker trend in prices in some regions is being driven by the lack of demand from new buyers, which is in part a result of heightened political uncertainty, ongoing affordability pressures, a modest upward move in interest rates and a lack of fresh stock coming onto the market.\nLooking ahead, more agents in the South West do not expect house prices to rise over the coming 12-months, as new instructions (homes coming onto the sales market) fell for the second consecutive month. 'South West agents do not expect house prices to rise over the coming 12-months'\nVirtually all UK regions saw a further decline in new instructions during October as average stock remains very close to an all-time low. Furthermore, the report said, there appears little chance of any meaningful turnaround, as a net balance of 30 per cent of respondents reported the number of appraisals to be down on year-on-year basis. Read More What were the most and least expensive house sales in Devon in September?\nGiven these conditions, it is little surprise that sales remain subdued in the South West with agents reporting a downward trend in sales transactions for the last two consecutive months. In fact, sales were reported to be either flat or negative across eleven of the twelve UK regions/counties during October. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nJames Wilson MRICS of Jackson-Stops said: “Both sales and new instructions have declined as Brexit uncertainty looms large.”\nIn the lettings market, the quarterly (seasonally adjusted) data revealed tenant demand fell during the three months to October. Alongside this, landlord instructions also declined, and on the back of this, 23 per cent of respondents expect to see rents rise over the coming months, albeit modestly. Read More\nRICS Chief Economist Simon Rubinsohn said: “Uncertainty about the economic outlook on the back of the never-ending Brexit negotiations appears a key drag on sentiment according to respondents to the survey. Royal Institution of Chartered Surveyors chief economist Simon Rubinsohn\n\"Meanwhile, the announcement of the extension of Help to Buy, albeit in a narrower format, should continue to underpin the new build market in the near term.\n\"Whether it, alongside other measures recently announced including the lifting of the HRA cap, is sufficient to drive housing starts up to the government’s 300,000 target over the coming years remains to be seen.” Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-13T16:18:00.000+02:00", "crawled": "2018-11-13T16:39:52.000+02:00", "highlightTitle": ""}