{"organizations": [], "uuid": "eef197c14eb78a156103531dcd253e8243a1319f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15398528.ece/ALTERNATES/s1200/0_Newcastle-United-v-AFC-Bournemouth-Premier-League.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/salomon-rondon-ki-newcastle-united-15444310", "country": "GB", "domain_rank": 21960, "title": "Why Salomon Rondon is already the 'most important' player in the Newcastle United side", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-22T08:00:00.000+02:00", "replies_count": 0, "uuid": "eef197c14eb78a156103531dcd253e8243a1319f"}, "author": "Chris Waugh", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/salomon-rondon-ki-newcastle-united-15444310", "ord_in_thread": 0, "title": "Why Salomon Rondon is already the 'most important' player in the Newcastle United side", "locations": [], "entities": {"persons": [{"name": "salomon rondon", "sentiment": "negative"}, {"name": "ki sung-yueng", "sentiment": "none"}, {"name": "rondon", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "newcastle uni", "sentiment": "negative"}, {"name": "afc bournemouth", "sentiment": "none"}, {"name": "west bromwich albion", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}, {"name": "newcastle united fc", "sentiment": "none"}, {"name": "magpies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why Salomon Rondon is already the 'most important' player in the Newcastle United side Newcastle United's Ki Sung-yueng believes Salomon Rondon can provide a focal point for the Magpies Share Click to play Tap to play The video will start in 8 Cancel Play now Get Newcastle United FC updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nSalomon Rondon can establish himself as the the most important member of the Newcastle United squad if he keeps finding the back of the net, believes team-mate Ki Sung-yueng.\nThe 29-year-old Venezuelan put in a man-of-the-match display during Newcastle's 2-1 victory over AFC Bournemouth before the international break, and is expected to lead the Magpies' line at Turf Moor against Burnley on Monday night.\nThe Cherries win saw Rondon start just his fifth Premier League game for Newcastle, with the Venezuelan having struggled with a few niggling injuries since joining the Magpies on a season-long loan deal from West Bromwich Albion. Read More How do Newcastle United get the best out of Salomon Rondon? Matt Ritchie gives his verdict\nBut Rondon is now back to full fitness and, with the forward hopefully having returned from international duty unscathed, Ki expects to see the West Brom loanee thrive playing in United's 4-2-3-1 formation.\nIn Ki's view, such a system is ideal for Rondon given the striker's ability to hold up the ball, bring his team-mates into play and, crucially, score goals. Put simply, Rondon gives the Magpies a focal point from which his Newcastle team-mates can play.\n“Everybody knows how Rondon will be a big part of this team,\" the South Korea midfielder said of the Newcastle forward. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n\"He holds the ball up well, can fight for possession and he can score goals. If you have striker like him, as a midfielder it makes me so confident, and I know we can enjoy a good partnership.\n\"If he keeps scoring then it will really help the team.\"\nWith United having managed just seven goals in their opening 11 matches, supporters had understandably raised concerns about Newcastle's lack of firepower. Salomon Rondon celebrate scoring Newcastle's first goal against AFC Bournemouth (Image: Getty Images)\nYet, following Rondon's brace against Bournemouth, Ki is confident that the forward will start finding the back of the net more frequently.\nExcitingly, the former Swansea City midfielder insists he has seen Rondon score headers like his memorable second against the Cherries - which has been compared to the type of goals Alan Shearer and Les Ferdinand used to net in the famous black-and-white No 9 shirt - regularly in training.\nSeemingly, if Newcastle can provide Rondon with the appropriate service from wide areas, Ki expects the Venezuelan to score the goals that will propel 14th-placed United up the Premier League table. Read More The 10 EU players Newcastle United would've struggled to sign with proposed new Brexit rules\n\"It was a beautiful cross from Kenedy, and a difficult header from that distance - but I see him do that in training every day, so I knew he could do it,\" Ki added of Rondon's second goal against Bournemouth.\n\"It was a beautiful goal, and hopefully we can see more of those from him. The goalscorer is the most important thing for any team, so we are lucky to have him.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-22T08:00:00.000+02:00", "crawled": "2018-11-22T11:31:09.000+02:00", "highlightTitle": ""}