{"organizations": [], "uuid": "93bcc56fc2602ae543b8919872ef58a821e22243", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15405223.ece/ALTERNATES/s1200/0_Newcastle-GV.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-could-fall-further-15404806", "country": "GB", "domain_rank": 21960, "title": "North East could fall further behind south after Brexit, new report warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-12T15:18:00.000+02:00", "replies_count": 0, "uuid": "93bcc56fc2602ae543b8919872ef58a821e22243"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-could-fall-further-15404806", "ord_in_thread": 0, "title": "North East could fall further behind south after Brexit, new report warns", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "irwin mitchell", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "centre for economics and business research", "sentiment": "none"}, {"name": "newcastle civic centre", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}, {"name": "cebr", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East could fall further behind south after Brexit, new report warns Study on UK cities finds Newcastle is outperforming Sunderland and Middlesbrough Share General view of Newcastle City Centre taken from the roof of Newcastle Civic Centre (Image: Newcastle Chronicle) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe North East will fall further behind the economy in the south after the UK leaves the European Union next year, according to a new report.\nThe UK Powerhouse report produced by law firm Irwin Mitchell and the Centre for Economics and Business Research (Cebr) said many parts of the South and East of England have increasing numbers of highly skilled jobs and are in areas benefiting from investment in transport.\nBut it highlighted concerns for the North East’s chemical industry - which supports almost 200,000 people - and said growth cities in the North did not tend to spread out into nearby towns and rural areas.\nThe report says Newcastle is predicted to see its employment levels grow by 1.3% in the first three months after the UK’s official leave date from the EU, ranking it 14th out of 46 cities. It also believes Newcastle will outperform Middlesbrough and Sunderland, which are forecast to see employment grow by 1.1% and 0.6% respectively and highlights the potential of the £25m Biosphere development on the Helix site - formerly Science Central - to create hundreds of skills jobs. The EU flag and a Union Jack (Image: PA)\nBut the report warns: “With uncertainty on how the (chemicals and plastic) sector will be governed after Brexit, businesses will be nervous in committing to additional developments. Although the Government aims to keep the current legislation in place, no exact details have been provided, causing concern that the UK will not always be in line with future EU decisions. “If a divergence in regulation between the UK and EU occurred post-Brexit, it would lead to future disadvantage to the domestic sector due to the lack of synchronisation. Cities such as Newcastle will be highly impacted – one of only six locations in the UK to be given Science City status, it could suffer competitively if regulation in the industry is deemed to be sub-par to the EU.” Read More Thyssenkrupp boss warns UK jobs could be hit by Tories' poor handling of Brexit\nThe UK Powerhouse report ranks UK cities on a number of indicators, with a table on GDP growth putting Newcastle 30th out of 46 cities, Sunderland 34th and Middlesbrough in last place. The region fared better in employment growth, with Newcastle ranked 13th, Middlesbrough 26th and Sunderland 33rd.\nThe report says cities in the South have proved better at spreading growth from big cities into the surrounding areas, partly due to better transport links.\nIt says: “The UK post-Brexit will therefore want to focus on how investment can be used to encourage increased growth across the country.” Read More Big rise in companies seeking Brexit advice, says Newcastle law firm Womble Bond Dickinson\nVictoria Brackett, CEO of business legal services at Irwin Mitchell, which has offices in Newcastle and Middlesbrough, said: “The overall impacts of Brexit in the long term prove difficult to measure without clear guidelines and a deal in place.\n“The UK will ultimately be responsible for managing and securing its own trade deals and though there are clear opportunities, these will have to be balanced alongside the short term risks which will be realised shortly after the UK’s official departure.\n“One thing that the last decade has taught us is that despite the hugely disruptive force of the financial crisis, the UK economy has been incredibly resilient. It is vital that we tackle the challenges head on and take advantage of the new opportunities that emerge.\n“The UK is a global powerhouse and we need to stay positive and work together to ensure this remains to be the case.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-12T15:18:00.000+02:00", "crawled": "2018-11-12T16:03:19.042+02:00", "highlightTitle": ""}