{"organizations": [], "uuid": "f8f4b4f9ff9df9a0884a48f3f5638e4c70e1853c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article950230.ece/ALTERNATES/s1200/petrol_generic.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/uk-world-news/motorists-should-pay-petrol-diesel-2184399", "country": "US", "title": "Motorists should pay for petrol and diesel in advance, says top cop", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-05T15:35:00.000+02:00", "replies_count": 0, "uuid": "f8f4b4f9ff9df9a0884a48f3f5638e4c70e1853c"}, "author": "Max Channon", "url": "https://www.devonlive.com/news/uk-world-news/motorists-should-pay-petrol-diesel-2184399", "ord_in_thread": 0, "title": "Motorists should pay for petrol and diesel in advance, says top cop", "locations": [], "entities": {"persons": [{"name": "simon cole", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "national police chiefs' council", "sentiment": "none"}, {"name": "petrol retailers' association", "sentiment": "none"}, {"name": "npcc", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Motorists should pay for petrol and diesel in advance, says top cop 25,000 people a year leave without paying Share The decrease will come as good news to motorists who experienced significant price hikes in recent weeks Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nMotorists should be made to pay for petrol and diesel in advance in a bid to reduce thefts, one of the UK's top police officers has said.\nAbout 25,000 people every year leave petrol station forecourts without paying - a crime know as 'bilking' .\nNow, Simon Cole of the National Police Chiefs' Council (NPCC) claimed fuel companies had made it too easy to drive off without paying because they wanted to entice motorists into their shops. Mr Cole, who is chief constable for Leicestershire, said 12% of crimes faced by his force were retail-related.\nIn the US, most filling stations require customers to pay for fuel at the pump by inserting a credit or debit card. However, this system has been blamed for lower profits, becuuase fewer people visit the convenience stores usually found on the forecourts.\nAnd the Petrol Retailers' Association has said switching to payment-at-the-pump would be \"prohibitively expensive\".\n\"The petroleum industry could design out bilking in 30 seconds by making people pay up front, which is what they do in other countries,\"said Chief Constable Cole, in an interview with the Telegraph newspaper.\n\"They don't, because the walk in their shops is part of their business offer.\" Read More Remainers claim Brexit is a threat to our beloved Cornish pasty\nHowever, the Petrol Retailers' Association commercial manager, Gordon Balmer, said it would cost at least £20,000 to retrofit petrol pumps at an average filling station to take card payments - while some estimates put the cost much higher.\nHe s that 50% of the average forecourt's profits now came from non-fuel sales, especially in rural communities, which had lost amenities such as banks and post offices.\n\"Many of those services have migrated into the store of a petrol station,\" he said.\nMr Balmer said 70% of the UK's filling stations were actually independently owned, but many people falsely believe petrol stations are run by big oil companies. Read More Millions of dogs suffer unnecessary pain because of our homes, says vet Want more news?\nTo keep up to date with Plymouth Live's latest news, follow us on Facebook here and Twitter here , or visit our homepage at www.plymouthlive.com\nFor Devon news, find Devon Live's Facebook page here , or our Twitter page here , or visit our homepage at www.devonlive.com\nFor Cornwall news, find Cornwall Live's Facebook page here , or our Twitter page here , or visit our homepage at www.cornwalllive.com Like us on Facebook ", "external_links": ["https://www.facebook.com/cornwalllivenews/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "http://www.cornwalllive.com/", "https://www.telegraph.co.uk/news/2018/11/04/motorists-should-forced-pre-pay-petrol-police-can-focus-violent/", "https://twitter.com/DevonLiveNews", "https://www.facebook.com/plymouthlive/", "https://www.facebook.com/devonlivenews/", "https://www.plymouthherald.co.uk/", "https://twitter.com/CornwallLive", "https://twitter.com/Plymouth_Live"], "published": "2018-11-05T15:35:00.000+02:00", "crawled": "2018-11-05T16:03:27.000+02:00", "highlightTitle": ""}