{"organizations": [], "uuid": "a340fcbfc995c36ef80041cc637d1631cf3a5de4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15459109.ece/ALTERNATES/s1200/0_TMP_NEC_211118Aldandashi05JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/syrian-student-escapes-war-torn-15455565", "country": "GB", "domain_rank": 21960, "title": "Syrian student escapes war torn country to graduate in Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-24T15:00:00.000+02:00", "replies_count": 0, "uuid": "a340fcbfc995c36ef80041cc637d1631cf3a5de4"}, "author": "Jack Elsom", "url": "https://www.chroniclelive.co.uk/news/north-east-news/syrian-student-escapes-war-torn-15455565", "ord_in_thread": 0, "title": "Syrian student escapes war torn country to graduate in Newcastle", "locations": [], "entities": {"persons": [{"name": "farouq aldandashi", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle news syrian", "sentiment": "negative"}, {"name": "northumbria university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Syrian student escapes war torn country to graduate in Newcastle The Syrian student with a love of metal music has described the bloody differences between studying in the north east and the Middle East Share Farouq Aldandashi on Newcastle's Quayside (Image: newcastle chronicle) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA Syrian student who had friends blown up, a tank’s cannon pointed at him and a home pelted with bullets has graduated from Northumbria University after escaping from his war torn homeland.\nFarouq Aldandashi, 28, survived university at the height of the Syrian civil war before eventually managing to come to the UK on a scholarship.\nAfter completing his Masters degree in Newcastle, he spoke to ChronicleLive about the radical differences he experienced after trading the Middle East for the North East.\n\"Literally everything was different\", he said. \"I feel much more comfortable here. I can say whatever I want and nobody can judge me.\n\"I can listen to whatever I want too. Music is a big thing back in Syria but I’m a metal head and metal music is not allowed as it’s associated with satanism.\n\"One day some friends and I were on campus listening to Motorhead and we started headbanging.\n\"A few weeks later one of my friends came up to me and said 'dude, we’re f . A list has gone up of people who are performing satanic rituals and we’re all on it.'\" Farouq Aldandashi is hoping to find a job and stay in the UK (Image: newcastle chronicle)\nAlthough Farouq is Syrian, he spent the first 10 years of his life in Saudi Arabia living with his two younger sisters, his mother and his father who was an interior designer.\nAfter a decade in the country, they decided to move back to Syria and lived in the western city of Homs where Farouq attended high school and university.\nBy the time he was a first-year undergraduate at Wadi International University, the country was going through a period of civil unrest which soon descended into a bloody civil war.\n\"Everything changed, there was radical change\", he said. \"Security, safety, livelihood. Life itself changes.\n\"The drive from my home to university was very dangerous. There were six checkpoints on my 20-minute journey.\n\"One night I remember we were under a curfew because there were had been clashes in the neighbourhood.\n\"I wasn't supposed to leave the house but I went outside to get some groceries.\n\"As I was walking to the shop a tank spotted me and pointed its canon at me.\n\"No groceries tonight, I thought...\" Farouq Aldandashi opened up about his time in Syria (Image: newcastle chronicle)\nOne of Farouq's close friends was standing outside his shop when an mortar shell exploded next to him, blowing off his leg.\nThis was just one casualty of the daily fighting that has been inflicted on the Syrian people, he explained. Read More\n\"The first time you hear a gunshot, you are scared and want to hide. But after one year, people just walk on and act normally. People need to live. Gunshots don’t matter, you get used to them.\n\"My house has multiple bullet holes in the walls. It was normal.\"\nAlthough he became accustomed to the fighting, he has not experienced it for several years and now fireworks freak him out as they remind him of the violence. Destroyed buildings are all that is left of the former streets in war-torn Syria (Image: PA)\nAfter graduating from a degree in banking and e-finance, Farouq moved to Turkey for a few years where he worked for the International Medical Corps and Care International. Yet his dream was to study for a Masters degree at a British university and he eventually secured the government's Chevening scholarship to study disaster management at Northumbria . Read More Rural North East could face 'spiral of decline' from Brexit, report warns\nOne of the biggest shocks he experienced upon coming to the UK was discovering that students can question the lecturers at British universities without fear.\nRecalling his time studying in Syria, he said: \"I remember one day when a student asked the lecturer a question and said he disagreed with his opinion.\n\"The lecturer said 'no I’m telling you this, I’m the teacher not you.'\n\"This is why the great Arab thinkers are either exiled or arrested. It's because they’re not allowed to question religion and the government.\n\"The first time I was in a British class for my Masters, one student said he disagreed with the tutor and I thought that there would be some punishment but it was actually encouraged. Read More\n\"This is something that I love, that you are allowed to critically think. I’ve began to question things I wouldn’t have dared to question.\n\"It’s like finding out that one plus one doesn’t equal two.\"While at university in Newcastle Farouq joined the Gaelic football team and formed a strong friendship with its members. Earlier this year, he graduated with a merit and is now looking for a job so he can remain in the UK. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-24T15:00:00.000+02:00", "crawled": "2018-11-24T17:39:20.021+02:00", "highlightTitle": ""}