{"organizations": [], "uuid": "e41c9759001155c6b9a86a28436bfd36db17c754", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article361746.ece/ALTERNATES/s1200/Anne-Marie-Morris-MPppPNG.png", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/brexit-opportunity-country-control-laws-2213602", "country": "GB", "title": "Brexit is an opportunity for our country to control our laws and borders", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T11:46:00.000+02:00", "replies_count": 0, "uuid": "e41c9759001155c6b9a86a28436bfd36db17c754"}, "author": "Anne Marie Morris", "url": "https://www.devonlive.com/news/devon-news/brexit-opportunity-country-control-laws-2213602", "ord_in_thread": 0, "title": "Brexit is an opportunity for our country to control our laws and borders", "locations": [], "entities": {"persons": [{"name": "anne marie mor", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}], "organizations": [{"name": "news", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "customs", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "department for environment, food & rural affairs", "sentiment": "none"}, {"name": "public accounts committee", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "border force", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Brexit is an opportunity for our country to control our laws and borders Anne Marie Morris MP says that the UK must make sure we get the border situation with Ireland right Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nANNE MARIE MORRIS IS THE CONSERVATIVE MP FOR NEWTON ABBOT AND HAS BEEN SINCE 2010\nLast week, the Public Accounts Committee held an evidence session looking at how prepared government departments are for the changes required at the UK border after our exit from the European Union. The responsibility for the border is shared between the Border Force (Home Office), the Department for Environment, Food & Rural Affairs (Defra) and the HM Revenue and Customs (HMRC). Representatives from all three were witnesses at the Committee session.\nThe forthcoming negotiations on the UK’s future relationship with the EU will determine how the border is operated when the UK leaves the EU. In 2017-18, it is estimated that £40bn was collected in tax and duty on border transactions. Moreover, 205 million passengers crossed the border between the UK and the rest of the EU, not including an unknown number of passengers who crossed the border between Northern Ireland and Ireland. Anne Marie Morris MP\nThere remains concerns about how ready the UK is to cope with the challenges presented to the UK border on exit from the EU and this has not been helped by the ongoing uncertainty and delays surrounding the negotiations. Such uncertainty makes clear and defined planning difficult, as well as reducing the time available to departments to plan and implement any new border regimes and infrastructure that may be required. Read More Agriculture Bill is an historic moment for a better future for farming\nWe are a coastal community with a range of ports stretching the length of the peninsula playing a vital role in both the local and national economy. The witnesses confirmed that they have held conversations with all 135 ports and airports to discuss the potential impacts on them and their customers. They also confirmed that HMRC, the Home Office, Defra and the Department for Transport are all working together to ensure joined-up activity is taking place on the issue.\nI raised the specific issue of the ‘no-deal’ technical notices which the government has been releasing, outlining what would occur in various areas in the event of a ‘no-deal’ scenario. The feedback that I have received is that these technical papers are not particularly helpful and offer very little information about what will happen in this scenario.\nClare Moriarty, Permanent Secretary at Defra, explained to the committee that they are currently engaged in the process of moving from technical notices to setting out what specific positions will be and offering guidance on steps that people will need to take. Anne Marie Morris MP\nThe government has not yet taken a policy decision regarding whether or how to implement customs arrangements at the Irish land border in the event of a ‘no-deal’ scenario. Jon Thompson, Permanent Secretary of HMRC, made it clear that they do not require any infrastructure at the border. 98 per cent of all customs traffic will go through, having been managed via IT systems whilst the remaining 2 per cent will be dealt with at inland pre-clearance centres. Read More Our health system fails to meet the needs of rural communities like ours\nI also questioned the witnesses on what emergency legislation would be needed in the event of a ‘no-deal’ scenario and when they would begin to present it to the House of Commons. HMRC, whilst not requiring any primary legislation, would require 48 statutory instruments to implement UK exit from the European Union. They are currently evaluating how many additional would be required under ‘no-deal’. Defra are currently progressing 85 statutory instruments in the event of ‘no-deal’.\nEffective management of the border is critical for the UK after we leave the EU in March 2019. It is fundamentally important to our economy, national security and reputation in the international community. Brexit is an opportunity for our country to control our laws and borders independently in the best interests of the people. It is a chance to maximise the advantages of our open, outward-looking economy and do things differently. Therefore, we must make sure we get the border situation right. Read More\nMy next surgery is on Friday 30 November in Newton Abbot. Please call my office on 01626 368277 to arrange an appointment. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-13T11:46:00.000+02:00", "crawled": "2018-11-13T11:58:57.004+02:00", "highlightTitle": ""}