{"organizations": [], "uuid": "159cf8d72619ceaf830b1b2199e9c1e2a9169103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12083680.ece/ALTERNATES/s1200/0_JS76928019.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-firm-cancels-100m-15358700", "country": "GB", "domain_rank": 21960, "title": "North East firm cancels £100m investment due to Brexit uncertainty", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-01T15:53:00.000+02:00", "replies_count": 0, "uuid": "159cf8d72619ceaf830b1b2199e9c1e2a9169103"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-firm-cancels-100m-15358700", "ord_in_thread": 0, "title": "North East firm cancels £100m investment due to Brexit uncertainty", "locations": [], "entities": {"persons": [{"name": "fairbairn", "sentiment": "none"}, {"name": "carolyn fairbairn", "sentiment": "none"}, {"name": "dominic raab", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "cbi", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East firm cancels £100m investment due to Brexit uncertainty CBI director-general Carolyn Fairbairn used a visit to the North East to say the threat of a no-deal Brexit was rising Share Head of the CBI, Carolyn Fairbairn (Image: Newcastle Chronicle) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe uncertainty over Brexit has led a North East company to cancel a £100m investment, a business leader says.\nCBI director-general Carolyn Fairbairn revealed the cost to the region from the continuing uncertainty over the UK’s departure from the EU as she visited the North East to speak to some of the region’s leading firms.\nShe said “real jobs” in the North East were being affected by the lack of clarity, with her revelation coming the day after Brexit Secretary Dominic Raab appeared to suggest a withdrawal deal would be finalised by November 21, only for his department to insist shortly afterwards that there was no set date.\nBrussels and Downing Street have also played down speculation about a breakthrough in Brexit talks, with the possibility of a no-deal Brexit now hanging over both sides. Brexit Secretary, Dominic Raab (Image: Getty Images Europe)\nMs Fairbairn said the possiblity of a no-deal Brexit had risen in the last few months and would be particularly damaging to the North East.\nShe said: “The uncertainty has been pretty well unprecedented for businesses, with political turbulence on top of that. The headlines and the froth has not been helpful.\n“What I would say is that, in the last three months, the uncertainty has just gone up in order of magnitude.\n“We’ve just completed a survey of how our members are responding to Brexit and 80% have postponed or stopped investment as a result of the uncertainty. By the end of December, if there isn’t a shape of a deal, 63% of companies will have implemented contingency plans. Read More\n“This is incredibly real, this is about real jobs. I’m talking to a member in the North East who has totally shelved a £100m investment plan so we are talking about real impact on jobs right now.” The EU and Union flags (Image: PA)\nShe added: “No-deal is definitely a possibility and our view is that the possibility has risen compared to six months ago as the true complexity of the Irish border problem has become more evident. What I would also say is that the commitment to try to avoid no-deal, on both sides, is really high.\n“We know that our Government understands it, that the cost of no deal is truly catastrophic, and not just for the UK. Our estimate is that 1.2m jobs in Europe would be at risk as well.\n“All the focus now needs to be on the withdrawal agreement. Of course we need the right future deal but unless we get the withdrawal sorted there will be a cliff edge and we have to step back from that.\n“Because of the international interconnectedness of the North East and the fact that it’s a high exporting region, the impact of no-deal would be particular high up here. I think the estimate put it at an opportunity cost of 16% of GDP by 2030. There are a lot of just-in-time supply chains in the North East where delays at borders would be serious.\n“People are beginning to recognise is that our port capacity, though it could adapt over time to do five times the number of checks it does now, which is what we’re talking about, it won’t be able to do that immediately. Read More Budget 2018: Business rates reform tops North East firms' wish list\n“So how products get rationed through our ports would become a very serious question. You would imagine that food and pharmaceuticals would be prioritised most and what that means for manufacturing, which is a crucial part of this region, would be very serious. The impact of no-deal would be very serious in many parts of the country but certainly for the North East.”\nMs Fairbairn’s visit saw her meeting with schoolchildren from around the North East to encourage them to think ambitiously about their future career.\nShe said another downside of the Brexit negotiations was that it was taking attention from important issues such as skills and young people, as well as things like innovation and infrastructure.\nBut she praised the North East LEP and the people behind the North of Tyne devolution deal, saying local and politicial politicians were doing working well with the business community on issues critical to the future of the North East economy.\nThe Department for Exiting the EU has been contacted for comment. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-01T15:53:00.000+02:00", "crawled": "2018-11-01T16:35:04.000+02:00", "highlightTitle": ""}