{"organizations": [], "uuid": "2b69e4638a4a6f1eb621a079062f096795b87cc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15466982.ece/ALTERNATES/s1200/2_may-brexit.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-news-forecast-treasury-deal-15478580", "country": "GB", "domain_rank": 21960, "title": "Brexit forecast: North East will be poorer after Brexit, official Government forecasts warn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-28T17:27:00.000+02:00", "replies_count": 0, "uuid": "2b69e4638a4a6f1eb621a079062f096795b87cc4"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-news-forecast-treasury-deal-15478580", "ord_in_thread": 0, "title": "Brexit forecast: North East will be poorer after Brexit, official Government forecasts warn", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "speaki", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "unions", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Unions warn against 'no-deal' Brexit\nThe Prime Minister is trying to convince MPs to back the plan when an historic Commons vote takes place on December 11 on the Withdrawal Agreement.\nIf MPs back her plans, the UK will leave the UK as planned on March 29 next year and enter a transition phase - during which much of the status quo would continue - until the end of 2020.\nDuring that time, the UK and EU will attempt to negotiate a new partnership.\nBut it looks like Mrs May could struggle to win the vote, because a number of Conservative MPs appear set to oppose her plans along with Labour.\nGuy Opperman, Conservative MP for Hexham, said: \"The reality is that the economy of the North East will continue to grow whatever the circumstances, and the improvement in opportunities and prospects will carry on.\n\"However, there is no doubt that the deal the Prime Minister has secured with the EU27 is the best way to maximise the amount of growth going forward, given the result of the EU referendum in 2016.\" Read More Brexit - what happens to the EuroMillions and why jackpots have got bigger\nSpeaking in the House of Commons, Mrs May refused to be drawn on what would happen if her deal was rejected.\nShe said: “Failure to back that deal, I believe, would lead to chaos and uncertainty for people for the future, and the clear message I get around the country is that people do not want that chaos and uncertainty.”\nMrs May claimed Britain will be “better off” under her Brexit deal as she dismissed claims that the country would be “poorer in the future than we are today”.\nShe told MPs: “Our deal is the best deal available for jobs and our economy, that allows us to honour the referendum and realise the opportunities of Brexit.\n“This analysis does not show that we will be poorer in the future than we are today, no it doesn’t, it shows we will be better off with this deal.” Read More Chi Onwurah becomes the latest North East MP to back a second referendum\nLabour appeared to be moving closer to supporting a second referendum on Brexit, if it is unable to force the Government to hold a general election.\nShadow Chancellor John McDonnell told the BBC: “If we can’t get a general election then the other option which we’ve kept on the table is a people’s vote.”\nNewcastle North Labour MP Catherine McKinnell said: 'This must be the only Government in living memory to actively pursue a policy it knows and admits will leave the country poorer, with these figures confirming the North East will be worse off - and hardest hit - under any Brexit scenario.\n\"The gravity of this situation means the final decision on whether we continue to proceed down this path must be put back to the British public, via a People's Vote.\"\nA new opinion poll commissioned by the People’s Vote campaign found 51% of North East voters now say they would vote to “remain” in an EU referendum, compared to 41.8% who did so in the 2016 referendum. Like us on Facebook", "external_links": [], "published": "2018-11-28T17:27:00.000+02:00", "crawled": "2018-11-28T18:32:09.023+02:00", "highlightTitle": ""}