{"organizations": [], "uuid": "a0869691d2dece92ac7c21cb53e54a31be59514b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1413024.ece/ALTERNATES/s1200/0_phil.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-council-boss-warns-over-2215180", "country": "GB", "title": "Devon council boss warns over Brexit nursing care shortages", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T16:34:00.000+02:00", "replies_count": 0, "uuid": "a0869691d2dece92ac7c21cb53e54a31be59514b"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/devon-council-boss-warns-over-2215180", "ord_in_thread": 0, "title": "Devon council boss warns over Brexit nursing care shortages", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "phil norrey", "sentiment": "none"}, {"name": "norrey", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon council boss warns over Brexit nursing care shortages Phil Norrey said that health and social care relies on EU workers but they don't feel welcome Share Devon County Council chief executive Phil Norrey Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe most vulnerable people in Devon could lose out without proper planning for the future of the workforce in hospitals and care homes post Brexit.\nPhil Norrey, chief executive of Devon County Council said that the retaining the workforce, propped up by workers from EU national states was vital for the wellbeing of those most in need.\nAnd he called on the government to ensure that adequate plans are in place.\nMr Norrey said: “Workforce for us is absolutely critical, particularly in health and care. Four per cent of the NHS workforce are EU citizens and it is around six per cent in health and social care more broadly. Watch the People's March in London Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n“That’s not just the public sector impact because most of the work in care goes on through the private and voluntary sector.\n“What we see there is a high level of turnover, so just concentrating on the existing workforce already here is not necessarily good enough, we need to think about how we replenish people who have been coming in and going out.” The Royal Devon & Exeter Hospital. The NHS relies on EU workers for 4% of its staff. (Image: Lewis Clarke / Geograph)\nMr Norrey was speaking on a Brexit panel as part of the Heart of the South West LEP annual conference held in Exeter on Monday.\nShaffra Gray-Reid from the Home Office told the panel and the 320-strong audience that a pilot had been carried out for the Government’s EU Settlement Scheme . It allows EU citizens and families to apply to stay in the UK post Brexit and is based on checks on proof of identification, residence and criminal checks. Read More\nThose who have been in the country for more than five years can apply for settled status and those for less than five years will be classified with pre-settled status.\nTheir rights will remain the same, she said.\nThe scheme rolls out in March 2019.\nMs Gray-Reid said: “There has been a lot of ambiguity but the Prime Minister has been very clear that there is no question of asking EU citizens to leave.”\nMr Norrey said that he welcomed the work being done on settlement but EU nationals do not feel welcome.\nHe said: “The message we are getting back is that quite a lot of our EU national workforce are saying they don’t actually feel very welcome here and there’s a psychological impact of all of this. We have to got to get the message across that this isn’t actually the case post exit. EU nationals are very welcome to work here.”\nMr Norrey is part of the Brexit Resilience and Opportunities Group, a joint LEP and Local Authority group that has been meeting for the past 18 months in a bid to ‘shine a searchlight into the fog of Brexit.” October 2018: Anti-Brexit protestors gathered outside Guildhall in Exeter\nHe said that it has been examining the impact of Brexit in the region and has looked at the impact on construction, agriculture, fisheries and research and development in specific studies.\nAnd he warned that the impact on health and care was in the ‘dangerous’ category.\nHe said: “We do need to think about a more strategic approach to workforce and how we approach migration across the rest of the world.\n“ We can’t just drift into this or we are going to have a very significant impact. People will not be receiving care packages and they will suffer as a result. There will be a knock on effect in the NHS in terms of bed blocking in hospitals and so there will be some real social impact.”\nMr Norrey was speaking in response to a question about his top three priorities for planning amid Brexit uncertainty. Read More Barden factory closure: Warning more companies could leave Plymouth in Brexit fear\nHe said that financial certainty for Local Authority budgets and a joint-up approach to consider resources was vital.\nHe said: “We have taken a battering in Local Authorities for the last eight or nine years. Our budget has been reduced by 40 per cent, so what we need now is a degree of financial certainty to help us ride out the shock if we are heading for a no-deal situation. Read More Torbay Council 'slashed to the core' in £5.5million budget cut\n“The message that there will be another budget in March if there is to be a no-deal position, which might reverse the end of austerity message, is potentially quite worrying.\n“Local Authorities can’t do everything at once. If we are to fulfil our roles in supporting our local economy, doing all the things that business needs us to do at the same time as protecting our vulnerable people and keeping our infrastructure going, we won’t be able to do all of those things at once if we have got another reduction in expenditure. Read More ", "external_links": ["https://heartofswlep.co.uk/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.gov.uk/government/collections/eu-settlement-scheme-pilot-applicant-information"], "published": "2018-11-13T16:34:00.000+02:00", "crawled": "2018-11-13T17:01:51.003+02:00", "highlightTitle": ""}