{"organizations": [], "uuid": "02f43b1a71bfa268525399a24d7e06ec7a10dce7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15469612.ece/ALTERNATES/s1200/0_Newcastle-City-Centre.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/government-needs-help-businesses-north-15467773", "country": "GB", "domain_rank": 21960, "title": "Government needs to help businesses in North East after Brexit, report says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-27T02:01:00.000+02:00", "replies_count": 0, "uuid": "02f43b1a71bfa268525399a24d7e06ec7a10dce7"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/government-needs-help-businesses-north-15467773", "ord_in_thread": 0, "title": "Government needs to help businesses in North East after Brexit, report says", "locations": [], "entities": {"persons": [{"name": "busi", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "enterprise research centre", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Government needs to help businesses in North East after Brexit, report says Federation of Small Businesses calls for business support funding to be guaranteed when country leaves the EU Share The FSB’s report has called for current funding levels for business support to be maintained after Brexit (Image: Newcastle Chronicle) Get business\nGovernment funding for business support after Brexit should target areas like the North East, a business organisation says.\nSharing Prosperity, a new report from the Federation of Small Businesses (FSB) and the Enterprise Research Centre (ERC), calls for business support to be targeted at more deprived areas across the country, where firms have lower turnover.\nMinisters have said they will create a UK Shared Prosperity Fund after the UK leaves the EU with the aim of raising productivity in areas like the North East and the Tees Valley.\nThe FSB’s report has called for current funding levels for business support to be maintained after Brexit, and to focus on factors including productivity, social impact on communities, modernising business practice and decarbonisation targets, as well as job creation. Read More Newcastle teashop brothers picked to help launch start-up business scheme\nReplacing EU funding is a key concern for a number of business groups in the North East.\nThe region benefited from the £160m Finance for Business North East Fund, which created almost 4,000 jobs and safeguarded another 3,500 with funding from Europe. Its successor, the £120m North East Fund, launched earlier this year and has already given support to a number of companies.\nFSB chairman Mike Cherry said: “As the UK leaves the EU, a large amount of business support funding will be transferred to UK control. This gives us a great opportunity to reflect on the current support landscape and rebalance the system, looking at how funds are best spent to benefit small firms across the UK. Mike Cherry, chair of the Federation of Small Businesses (Image: supplied by FSB as publicity picture)\n“To do this properly, policymakers must realise the potential and ambition of business owners in these ‘less favoured areas’ across the UK. The ambition is there – our research shows that business owners in more deprived areas want to become business leaders in their communities.\n“Providing the right support will allow them to ramp up productivity, create jobs and see their business community grow.\n“We’ve set out a number of recommendations to help rebalance the economy. The amount of funding is critical to at least maintain, or increase, current support levels.” Read More\nThe FSB report calls on the Government to create a ‘Business England’ brand for business support in England and also to have a small business champion appointed to every LEP Board before the EU funds are repatriated. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-27T02:01:00.000+02:00", "crawled": "2018-11-27T02:09:50.024+02:00", "highlightTitle": ""}