{"organizations": [], "uuid": "83dae4ac0a5caf25e17efbf3943b5021ae8f7fa1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15450336.ece/ALTERNATES/s1200/0_Sunderland-Full-Council-November-21-2018.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sunderland-council-local-plan-government-15456938", "country": "GB", "domain_rank": 21960, "title": "Final draft of Sunderland's local plan off to government after councillor backing", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-23T17:37:00.000+02:00", "replies_count": 0, "uuid": "83dae4ac0a5caf25e17efbf3943b5021ae8f7fa1"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sunderland-council-local-plan-government-15456938", "ord_in_thread": 0, "title": "Final draft of Sunderland's local plan off to government after councillor backing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "invalid email sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Final draft of Sunderland's local plan off to government after councillor backing Councillors have given their backing to a local plan which includes new homes, planning rules against takeaways and new facilities Share Sunderland Full Council , November 21 2018 (Image: Copyright Unknown) Get daily\nSunderland's local plan is on its way to government after winning majority backing from city councillors.\nThe draft Core Strategy and Development Plan looks at jobs, business growth, transport links and housing needs in the city from now until 2033.\nThis includes building 13,410 more homes - with an average of 745 per year - alongside planning rules against takeaways and new facilities such as schools and doctors.\nA consultation on the plan also saw more than 6,000 responses and attracted controversy over setting aside greenbelt sites for future development.\nOn November 21, the plan was voted through by full council despite concerns by opposition parties who moved the plan should be referred back to cabinet.\nLeader of the council's Conservative group, Robert Oliver, criticised the lack of specific responses to green belt concerns in the plan and issues of a \"hollowed-out city centre\".\nSpeaking at Sunderland Civic Centre, he argued the Vaux site should be the \"anchor of the revitalisation of the city centre\" and private sector-led to help reduce \"vulnerabilities\" around relying on public sector funding. Read More Transport bosses to have a second attempt at voting over increased Metro fares\nHe added the city needed broader leisure facilities, easier parking, improved transport links to Washington and more executive homes to encourage people to live and work in the city.\nLeader of the council's Liberal Democrat group, Niall Hodson, praised elements of the plan which focus on protecting historic buildings in the city centre.\nOn areas of public concern - including several disputes around the green belt - he noted the responses in the plan and changes made were \"quite minimal.\"\nOther concerns included the lack of detail on Brexit preparation s in the plan and the future of private investment on the Vaux site, given the council's plans to relocate their civic centre to the site in future.\nCouncil leader, Graeme Miller, agreed Sunderland was \"hollowed out\" due to job losses in shipbuilding, steel and glass in the 1970s and 1980s with jobs migrating to the west of the city. Read More Calls for Sunderland councillors to be allowed maternity and paternity leave are backed\nHe stressed that Vaux site proposals would \"fill out the city centre\" with the site being large enough for a mixture of public and private sector investment.\nThe site, he explained, has one million sq ft of space, with proposals for the civic centre and the existing Beam development taking up less than half of the site.\nHe added that if the local plan wasn't timetabled, delays could cost Sunderland's economy millions of pounds over time.\n\"I don't think it's a price worth paying,\" he added.\nThe plan follows consultation in June and July this year which saw a further 8,272 comments from 2,151 individuals.\nFollowing feedback, the plan reduced the number of green belt sites from 15 to 11.\nThis saw West Park, Glebe House Farm, Offerton and Peareth Hall, in Springwell, removed from the plan. Read More 'Zero tolerance' approach to attacks on emergency service workers backed by Sunderland councillors\nDespite these changes, concerns still remain about affected green belt sites.\nCoun Denny Wilson said that Castle ward councillors would be voting against the plan over a site included in North Hylton.\nCoun Anne Lawson, referencing a proposed 400-home development on green belt land in Penshaw, also criticised the lack of response to community concerns in the plan.\nThese include the potential impact on the environment and pressures on existing infrastructure, such as school places and services.\nFollowing discussion, a vote to send the plans to the secretary of state were approved by 47 - 16.\nThe local plan will be examined in public by an independent planning inspector next year and is set to return to full council in future. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-23T17:37:00.000+02:00", "crawled": "2018-11-23T18:14:55.017+02:00", "highlightTitle": ""}