{"organizations": [], "uuid": "e0fc1b3f296cb23ebc81f0e311376ebbaf7a22c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15337480.ece/ALTERNATES/s1200/0_Southampton-v-Newcastle-United-Premier-League-St-Marys-Stadium.jpg", "site_section": "http://www.thejournal.co.uk/sport/?service=rss", "section_title": "ChronicleLive - Sport", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-news-transfers-live-15442740", "country": "GB", "domain_rank": 21960, "title": "Newcastle United news and transfers LIVE - Benitez ready for 'defining' run of fixtures", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-21T07:00:00.000+02:00", "replies_count": 0, "uuid": "e0fc1b3f296cb23ebc81f0e311376ebbaf7a22c7"}, "author": "Craig Johns", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-news-transfers-live-15442740", "ord_in_thread": 0, "title": "Newcastle United news and transfers LIVE - Benitez ready for 'defining' run of fixtures", "locations": [], "entities": {"persons": [{"name": "benitez", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "newcastle united", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "09:54 Wolves aiming high\nThe Daily Mail claim to have seen documents relating to player bonuses that show the ambition of the newly-promoted Midlands side.\nThe performance-related bonuses to be handed to players strongly suggest that club bosses are aiming high for a top half finish.\nPlayers will share just £3m if they finish 17th, thus just avoiding relegation. But a tenth place finish will earn players £10m to share while a top seven finish (and therefore European place) will see them share £12m. 09:31 Lazaar on his Newcastle United frustrations\nSpeaking to TuttoMercato, the Newcastle and Morocco full-back said:\nI’m training hard and I also do some training to be ready and fit. I’m honest: I signed for Newcastle and I expect to be taken into consideration. But football is like that, something wrong can happen. But you must continue to do your job by respecting the choices. Do not give up. Then in January if a call comes in I have to be ready.” (Image: Newcastle United) 09:28 FA want to cut foreign players in the PL\nAccording to a report in the Mirror, FA chiefs want to cut the number of foreign players in the PL, regardless of if Brexit happens.\nProposals to deal with Brexit would see the number of non-homegrown players cut from 17 to 13. But according to the report, the FA are keen to put through the plans regardless of if Brexit goes ahead or not. 09:22 Gayle permanent transfer rests on one thing\nWest Brom are desperate to land Dwight Gayle permanently, but according to the Northern Echo, the only way they could sign the striker is if they were promoted back to the PL.\nThe report claims Newcastle would want far too much for the 28-year-old for a Championship club to afford him.\nOf course, if Salamon Rondon continues to play like he did last time out then a swap deal could be in the works. 09:12 Loftus-Cheek likely to ask Chelsea to leave on loan in January\nThe midfielder is frustrated over a lack of first team opportunities at Chelsea.\nAccording to the Times, he will ask to leave in January with Crystal Palace and Schalke both interested.\nRafa Benitez is a big fan, but wouldn’t be able to sign him on loan in January unless Kennedy’s loan was either terminated or turned into a permanent transfer - neither of which are likely. 08:44 PODCAST: Gibbo on the Keegan managerial years\nThey were great times. Here’s John Gibson’s memories of an unforgettable era... 08:30 Paul Woolston training with Man Utd's first team\nThe ex-NUFC goalkeeper who was released by the club in the summer was picked up by Man Utd and has been training with the first team during the international break with David De Gea and Sergio Romero away on international duty. You can see him on the right of the pic in between Ashley Young and Marouane Felliani. 08:24 Solanke stars again for England U21s\nHe scored a brace last week against Italy and now he’s starred again, this time against Denmark he added another two goals during a 5-1 victory.\nRafa Benitez is a big fan of the young Liverpool striker but PL loan rules mean he won’t be at Newcastle any time soon. 08:10 Wilshere nears West Ham return\nHe should definitely be involved during next weekend’s trip to Newcastle 08:02 Transfer window for managers?\nThe idea was backed by ex-Premier League defender Liam Rosenior and Chelsea women’s boss Emma Hayes on Sky Sports’ the Debate.\nRosenior said:\nI think the time has come, not just in the Premier League but all four division going down to the National League too. You see a lot of managers losing their jobs early on.\n“When the manager changes at a football club, it changes everything; recruitment policy, principles of play, strategies and ways of working. If you give a manager a set period of time, it makes recruitment of managers more thorough, and I don’t think clubs do near enough homework on the managers they’re looking to appoint.\n“That takes that pressure off, and from the fans, because everyone understands that manager has the job until January, and we’ve got to support him. Players in the dressing room can’t cause that fuss and commotion you sometimes get, the whisperers going up to the chairman saying it’s not working with the manager.\n“I think sometimes the easiest person to look at in a football club is the manager, even when there has been financial mismanagement, poor recruitment out of the manager’s control.\n“If you create a managerial transfer window, clubs need to get all of the other processes in order; recruitment, the way they scout and their principles of play. I think it then creates a better environment for football and protects clubs. It makes sense for the game.”\nHayes added:\nI whole-heartedly agree, and it makes absolute sense, therefore I doubt football will do it! A change in manager does not necessarily mean a change in results, and if there is, it’s so marginal; is it worth the financial and sometimes emotional cost to the whole organisation?\n“The manager is just a representation of the whole team. I think if there is a transfer window it would be about getting behind that manager, and backing them through that period to try and help turn it around.\n“Stability and continuity are two of the most important facets behind success, and it would be a necessary change.\n“You’ve got two thinkers here who would like to see this. But the best businesses - let’s not talk about football for a moment - the best business will not turn over their CEOs at the level that football turns over their managers. Why? Because stability, vision, strategy are intrinsically linked.\n“We have such short-termism in our football behaviour. It’s a results business, but in order to get results, it’s not as simple as just changing all the time.” Sébastien Haller on his future\nSpeaking to German media outlet Frankfurter Allgemeine, the French striker was asked if he would move to the Premier League.\nMaybe never. Or maybe in two months. It depends on the possibilities that arise. I would never go to the Premier League just to play there. PART TWO: Gibbo's Corner on KK Good morning!\nHope you’re well. Let’s kick things off with a word from Rafa Benitez. and why he thinks the next few weeks will be defining.\nWhen you are so close to the other teams, any win is massive - and two wins is even more important.\nI think the international break is bad for us, but at the same time it gives us time to recover and spend time with our families.\nWe can come back with more energy and if we can get another couple of good results, I’ve always said November and December will be so important for us.\nRAFA BENITEZ", "external_links": [], "published": "2018-11-21T07:00:00.000+02:00", "crawled": "2018-11-21T08:07:52.030+02:00", "highlightTitle": ""}