{"organizations": [], "uuid": "155823a3dd6a7ed2e6e2f0924304b22aec5bdc54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15216818.ece/ALTERNATES/s1200/0_Jeremy-Corbyn-in-the-Midlands.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-brexit-theresa-may-15437731", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn promises a Brexit that invests in the regions and nations of the UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-19T22:02:00.000+02:00", "replies_count": 0, "uuid": "155823a3dd6a7ed2e6e2f0924304b22aec5bdc54"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-brexit-theresa-may-15437731", "ord_in_thread": 0, "title": "Jeremy Corbyn promises a Brexit that invests in the regions and nations of the UK", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "neutral"}, {"name": "jere", "sentiment": "neutral"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jeremy Corbyn promises a Brexit that invests in the regions and nations of the UK Labour leader Jeremy Corbyn and Prime Minister Theresa May set out rival visions for Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nLabour leader Jeremy Corbyn has presented an upbeat vision of Brexit, telling business leaders it was an opportunity for “a radical programme of investment and real change across our regions and nations”.\nHe was setting out his vision for Brexit to business leaders at the annual conference of the CBI, which also heard from Prime Minister Theresa May .\nMr Corbyn said: “A good Brexit plan for this country is not just about what can be negotiated with Brussels, it must also include a radical programme of investment and real change across our regions and nations.”\nAnd he said that a Labour government would want business to play its role, with “a stronger say for the workforce” - and bigger businesses to pay more tax - in return for the government providing the investment in “infrastructure, education, skills and the technologies of the future” that businesses need to succeed. Read More Northumberland MP Anne-Marie Trevelyan threatens to send letter of no-confidence in Theresa May\nHe said Labour offers “a new settlement for business and a stronger say for the workforce where government will drive a higher rate of investment in infrastructure, education, skills and the technologies of the future and the largest businesses that can afford it will pay a bit more towards the common good.”\nLabour is set to reject the deal Prime Minister Theresa May has brought back from Brussels, arguing there should be a general election.\nMrs May suggested that any extension to the Brexit transition period should end before the next general election in June 2022.\nIt means the UK might not fully leave the EU for more than three years.\nAnd she suggested she may remain in office to oversee the process. Read More Northumberland MP Anne-Marie Trevelyan threatens to send letter of no-confidence in Theresa May\nMrs May said: “We have in view a deal that will work for the UK. And let no one be in any doubt – I am determined to deliver it.”\nShe was setting out her vision for Brexit to business leaders at the annual conference of the CBI, which also heard from Labour leader Jeremy Corbyn.\nThe Prime Minister’s comments came after reports emerged that the EU was open to letting post-Brexit arrangements remain in place until December 2022.\nMrs May said: “From my point of view, I think it is important in delivering for the British people that we are out of the implementation period before the next general election.”\nDefending her proposed deal, Mrs May highlighted the fact that it would end freedom of movement.\nShe said: “I know that is an issue of great importance to the British people.\n“The United Kingdom is a country that values the contribution that immigration has made to our society and economy over many years. Read More Revealed: The North East MP who claimed the most expenses this year\n“And in the future, outside the EU, immigration will continue to make a positive contribution to our national life.\n“But the difference will be this: once we have left the EU, we will be fully in control of who comes here.\n“It will no longer be the case that EU nationals, regardless of the skills or experience they have to offer, can jump the queue ahead of engineers from Sydney or software developers from Delhi.” Ian Lavery (Image: Getty Images Europe)\nWansbeck MP Ian Lavery, the Labour chair, said Theresa May’s proposed deal “already looks dead in the water”.\nHe said: “Whilst Theresa May regurgitated the same old rhetoric at the CBI, attempting to shore up a deal that virtually no one wants and both wings of her fractured party refuse to accept, Jeremy Corbyn outlined clearly the need to invest in the nations and regions of the UK.\n“Jeremy highlighted what too many people are currently experiencing - that is to say an unfair, unjust economic system which is totally broken and causing great financial difficulties for many people and business.”\nEasington Labour MP Grahame Morris said: “The inequality, austerity and neglect that drove so many in the North East to vote for Brexit isn’t dealt with at all in Theresa May’s deal.\n“Any deal must allow the UK Government to ensure workers terms and conditions and environmental protections are not given away and we must have the ability to invest in the regions in jobs and vital infrastructure to address existing inequalities.” Read More Watch as Northumberland MP is moved to tears over Afghanistan veteran's plight\nBut CBI Director-General Carolyn Fairbairn said businesses wanted progress on a deal.\nShe said: “Firms wants a new relationship based on frictionless trade, services access and a say for the UK over future rules. This is the real prize – and firms are desperate to move forwards.\n“The deal currently on the table opens up this potential, and the last thing businesses want is to go backwards. The Government’s deal is not perfect, but with four months to go and the potential of no deal looming progress must be made.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-19T22:02:00.000+02:00", "crawled": "2018-11-20T02:32:41.016+02:00", "highlightTitle": ""}