{"organizations": [], "uuid": "8e45ed8f93cfbf6d0138a267f38cdd72ad3b3551", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14561659.ece/ALTERNATES/s1200/IBP_NEC_190418stadium_tour_26JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-struggles-list-best-15360707", "country": "GB", "domain_rank": 21960, "title": "North East struggles in list of best UK cities to live and work in", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-01T19:37:00.000+02:00", "replies_count": 0, "uuid": "8e45ed8f93cfbf6d0138a267f38cdd72ad3b3551"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-struggles-list-best-15360707", "ord_in_thread": 0, "title": "North East struggles in list of best UK cities to live and work in", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "middlesbrough/stockton", "sentiment": "none"}], "organizations": [{"name": "st james", "sentiment": "none"}, {"name": "st nicholas cathedral", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East struggles in list of best UK cities to live and work in Newcastle has one of the best work-life balances in the UK, according to the PwC study Share The Tyne Bridge and St Nicholas Cathedral viewed from the roof of St James' Park (Image: Newcastle Chronicle) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe North East’s main towns and cities are at the wrong end of a table ranking the best places to live and work in the UK, despite improvements in a range of areas.\nThe Demos-PwC Good Growth for Cities Index 2018 measures the performance of 42 of the UK’s largest cities against 10 indicators including employment, health, income and skills, housing affordability and environmental factors.\nThe latest index has Newcastle, Middlesbrough/Stockton and Sunderland all in the bottom 10, with all three areas being ranked poorly on income levels, health and home ownership.\nBut there was also cause for some optimism, with Middlesbrough/Stockton being ranked the second most improved area in the UK over the last year, and Newcastle having the second best work-life balance nationally.\nNewcastle has also improved from 38th in the UK 10 years ago to 33rd now, though Sunderland is now ranked joint bottom with Swansea. North East England Chamber of Commerce, Jonathan Walker (Image: Handout)\nJonathan Walker, assistant director of the North East England Chamber of Commerce, said: “We firmly believe the North East is a great place to live and work, but as this report highlights, we know there is room for improvement when it comes to creating more and better jobs.\n“The more we, as a region, can do to raise awareness about all of the North East’s assets and quality of life, the greater chance we stand of attracting the type of investment that will move our cities up the rankings.”\nThe rankings are topped by Oxford, followed by Reading and Southampton. Preston was judged to be the most improved city.\nThe Good Growth for Cities index has now been running for 10 years, with Newcastle seeing improvements in seven of the 10 areas measured across that time. The biggest jump was in work-life balance, which measures the percentage of people working more than 45 hours per week, while the city also scored strongly in job numbers and the affordability of housing. Centre Square in Middlesbrough (Image: Evening Gazette)\nDespite its poor ranking, Sunderland scores well for income distribution and the environment, though it has also fallen back in a number of areas.\nJohn Hawksworth, chief economist at PwC, said: “Almost all UK cities have seen improved good growth scores in recent years, driven primarily by cyclical falls in unemployment rates that have now rippled out from the South East of England to regions like the North East that were previously lagging behind.\n“But the more interesting perspective is provided when we look at the whole decade from 2005-7 to 2015-17, which covers a full economic cycle and therefore allows us to identify deeper structural trends.\n“The good news here is that successive cohorts of young workers have higher average skill levels, which is pushing up index scores together with rising rates of new business creation in most cities.\n“But the flip side of this success has been worsening housing affordability and consequent falls in home ownership rates precisely for those young people who have invested in acquiring new skills. As they are pushed further from city centres to afford a place to buy or even rent, average commuting times have also risen.\n“Having largely recovered from the financial crisis, addressing the housing and infrastructure supply constraints that drive these negative trends will be key challenges for the next decade for both central and local government, looking beyond the immediate issues around Brexit.”\nSunderland Council leader Graeme Miller said: “The city council has a different version of events and has its own questions about the nature of this survey with its curious mix of statistical and subjective measures.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-01T19:37:00.000+02:00", "crawled": "2018-11-02T03:09:04.024+02:00", "highlightTitle": ""}