{"organizations": [], "uuid": "23ed55a42304c24eaf92207e56c80d20865fe2a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.cornwalllive.com/news/article1475891.ece/ALTERNATES/s1200/Flybe.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/flybe-pilot-fired-because-developed-2209127", "country": "GB", "title": "Flybe pilot fired because he developed a fear of flying wins tribunal", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-12T09:00:00.000+02:00", "replies_count": 0, "uuid": "23ed55a42304c24eaf92207e56c80d20865fe2a5"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/flybe-pilot-fired-because-developed-2209127", "ord_in_thread": 0, "title": "Flybe pilot fired because he developed a fear of flying wins tribunal", "locations": [], "entities": {"persons": [{"name": "matthew guest", "sentiment": "none"}, {"name": "luke farajallah", "sentiment": "none"}, {"name": "neil shaw", "sentiment": "none"}], "locations": [{"name": "birmingham west midlands airport", "sentiment": "none"}], "organizations": [{"name": "digital", "sentiment": "none"}, {"name": "embraer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Flybe pilot fired because he developed a fear of flying wins tribunal Matthew Guest could now get his old job back Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 07:00, 12 NOV 2018 Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA Flybe pilot fired after developing a fear of flying has won his claim for unfair dismissal.\nFirst officer Matthew Guest became anxious and had \"panic attacks\" after being promoted by the Devon-based airline, an employment tribunal heard.\nThe father of two had given almost a decade's \"good service\" to the budget airline when he was given his marching orders owing to his phobia.\nAn employment judge ruled he should have been offered alternative roles or at least an opportunity to discuss his case with group chief operating officer Luke Farajallah. Read More Flybe reveals what action it has taken after plane plummeted towards ground\nMr Guest could now get his old job back. His problems began when he was moved onto the company's Embraer jets, or Ejets, based at Birmingham West Midlands Airport.\nLike the Q400 which he had worked on for seven years since joining in August 2007, it is crewed by a Captain and a First Officer.\nFlights are of longer duration. This was something he had wanted to do and he was delighted.\nBut on 13 December 2014 he had \"an unsettling experience\". Half way through a flight to Florence, he suddenly felt sick and dizzy. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nHe \"felt anxious to be on the plane, hot, dizzy, churning stomach,\" the Birmingham hearing was told. He later said it was like having \"air sickness, feeling woozy, hot.\"\nLater that month he had a feeling of impending doom or dread and a terrible feeling in the pit of his stomach as he drove to the airport.\nJudge Tom Coghlin QC said in a written ruling: \"He later described this as feeling like severe butterflies or stomach cramp. He called in sick and returned home.\" Read More Flybe plane plunged 500ft in 18 seconds when autopilot was set to crash\nOn 17 February he was due to fly to Keflavik in Iceland. He felt anxious. He told his Captain before take-off that he did not feel well enough to fly. Every pilot is assigned an Aeromedical Medical Advisor (AME) designated by the Civil Aviation Authority (CAA) whose role is to certify the pilot as fit to fly. A Class 1 medical certificate is required to fly commercial aircraft.\nHe informed his AME, Dr Ken Dawson, of his situation by email that day. He explained that his home life was not easy at that point since he had a toddler going through the 'terrible twos' and a three-month-old baby.\nHis GP wrote to Flybe saying her patient \"has developed an increasing phobia and anxiety about long-distance flights and being trapped on the aeroplane.\" Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nDr Dawson wrote to Mr Guest confirming that his medical certificate was temporarily suspended due to \"panic attacks\".\nOver the next two months he underwent six CBT (cognitive behavioural therapy) sessions. His medical certificate was reinstated by the CAA on 27 April 2015. Read More TUI unveils flights to Egypt from Exeter Airport for 2019 After this he sometimes felt a bit sick during flights: occasionally at first, but with increasing frequency. He also had a gradual increase in feelings of anxiety before flights.\nIn July he was due to fly to Salzburg. Shortly before takeoff he began to feel, as he put it in his witness statement, \"very sick and jumpy\".\nHe felt shaky with an increased heart rate and hyperventilation. He could not bear the idea of spending the next two hours flying.\nHe told his Captain that he did not want to go ahead with the flight, and he was de-planed. He later described this as an \"anxiety attack\" and a \"panic attack\".\nHe continued to struggle and was eventually signed off with anxiety and began a second period of absence during which he attended CBT sessions, hypnotherapy and acupuncture and was prescribed an antidepressant permissible for pilots. Read More Revealed: The 75 fastest growing firms in Devon and Cornwall\nHe was assessed on 25 September 2015 by Professor Anthony Cleare, the CAA’s Consultant Advisor in Psychiatry.\nMr Guest returned to work on 26 April 2016. It went well at first. After the first month he worked part-time, with a pattern of 5 days on, 5 days off. He undertook training.\nHe spent time sitting on the jump seat on flights, refamiliarising himself with flying; and he spent time flying with a supernumerary pilot on the jump seat who could take over if he became unwell.\nThe claimant returned to normal duties on 1 June 2016, still working 5 days on, 5 off. After flying on 2 June 2016 he completed a note saying “Fine. Elated when I got home ‘I’m cured!’” Read More Five reasons why Flybe is making a loss\nBut subsequent flights were more mixed: on 9 June he noted “relieved when flight under 2 hours, or reason to fly faster”; on 10 June “mindful but no problems”; on 11 June “more wary halfway there remained confident and distracted self.”\nThings came to a head on 17 June 2016. The claimant learned that he was due to fly to Kefalonia in Greece the next day. This was a long flight of four hours.\nHe was advised by head of pilot management Lee Goreham to pass the time during the cruise phase by reading a book or doing a crossword, as pilots frequently do.\nThe claimant agreed to carry out the flight, but that evening continued to have concerns and he called in sick the following day. Read More Flybe issues profit warning as it expects to make £12million loss\nHis roster was then cleared without reference to him. He remained off duty and was not to return to work before the end of his employment in 2017.\nHe was informed of the company decision taken by group chief operating officer Luke Farajallah in a letter dated march 24 2017.\nIt read: \"The Company remains concerned regarding your fitness to safely fly. Due to the uncertainty of your condition we cannot as an organisation accept the risk to safety. \"The medical advice containing the suggestion that your condition could return causes the Company serious concerns and Flybe are not prepared to take risks in the flight deck with people’s lives.\n\"We are not prepared to take the risk of returning you as a Pilot on the EJet or Dash 8, so we are providing you with formal notice that we intend to terminate your employment on capability grounds.\" Read More Holidaymakers need to renew passports NOW in case of no deal Brexit\nThe hearing was told the claimant was offered a ground based role as Flight Safety Support Officer based at their HQ in Exeter with hotel accommodation paid for.\nBut he was told by Colin Rydon, director of flight operations, there would be no possibility of returning to flying if he accepted it.\nThe judge said: \"Here, the relevant decision-maker on that key question was Mr Farajallah.\n\"At the time when the decision was made in October 2016, and when Mr Farajallah reaffirmed it in his email on 22 January 2017, Mr Farajallah had never met the claimant, and the claimant had had no opportunity to speak to him or to address his concerns or to influence his thinking. \"It is a basic principle of natural justice and of fairness that an employee should have the chance to address the relevant decision-maker. Here, the claimant had no such opportunity.\n\"He was not told of Mr Farajallah’s involvement at all. On the contrary he was led to believe that the decision was to be taken by Mr Firth.\" Read More Exeter airline has launched a new campaign to attract more women pilots and engineers\nThe judge said Mr Guest could have returned to flying the Q400, which he had flown safely and without difficulty for years, or been allowed to fly for a time with a supernumerary pilot.\nUpholding his claim, the Judge said that had Flybe followed the correct procedure there was a two thirds chance they would have sacked him fairly.\nMr Guest is seeking reinstatement as his remedy for unfair dismissal.\nUnless the parties are able to resolve this, the matter will be decided by a remedy hearing later this month. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-12T09:00:00.000+02:00", "crawled": "2018-11-12T09:29:09.024+02:00", "highlightTitle": ""}