{"organizations": [], "uuid": "1f57f717488f648caba42763bd114266c90f8b58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2279205.ece/ALTERNATES/s1200/1_TP_TEM_301118chamber_01.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/east-midlands-chamber-wins-top-2279186", "country": "GB", "domain_rank": 48128, "title": "East Midlands Chamber wins top prize at 2018 British Chambers of Commerce Business Awards - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-30T02:00:00.000+02:00", "replies_count": 0, "uuid": "1f57f717488f648caba42763bd114266c90f8b58"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/east-midlands-chamber-wins-top-2279186", "ord_in_thread": 0, "title": "East Midlands Chamber wins top prize at 2018 British Chambers of Commerce Business Awards - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "francis martin", "sentiment": "none"}], "locations": [{"name": "leicestershire live news east midlands chamber", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "chambers of commerce business awards", "sentiment": "positive"}, {"name": "british chambers of commerce", "sentiment": "none"}, {"name": "chambers of commerce business awards get business", "sentiment": "none"}, {"name": "invalid email east midlands chamber", "sentiment": "none"}, {"name": "chamber business awards", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News East Midlands Chamber wins top prize at 2018 British Chambers of Commerce Business Awards \"To win chamber of the year is fantastic... a great endorsement of the extensive activity we deliver across the region\" Share East Midlands Chamber won top award at 2018 British Chambers of Commerce Business Awards Get Business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nEast Midlands Chamber has secured one of the top accolades in British business.\nIn a night of celebration at the prestigious British Chambers of Commerce Business Awards, in London, it won the overall chamber of the year title.\nNow in its 15th year, the national Chamber Business Awards is one of the showpiece events in the business calendar, highlighting the role of business in delivering growth and prosperity in the UK.\nFrancis Martin, president of the British Chambers of Commerce, said: “East Midlands Chamber has shown impressive growth and retention in recent years. Read More\n“The strategic work and engagement of the chamber with local stakeholders embodies the mission of Chambers of Commerce everywhere.\n“Its efforts to engage with other chambers and improve member offerings is a testament to its dedication.\n“Congratulations to the entire East Midlands team, truly worthy recipients of this award.”\nScott Knowles, chief executive of East Midlands Chamber, added: “To win chamber of the year is a fantastic achievement and a great endorsement of the extensive activity we deliver to our members across the region. Read More EXPERT COMMENT: How Brexit might not make us all 'worse off'\n“This acknowledgment is testament to the dedication and hard work shown by all the staff at the chamber, who made this award possible by continuing to work tirelessly and passionately on behalf of our members to fulfil our overall objective – to enhance East Midlands businesses.” Like us on Facebook ", "external_links": [], "published": "2018-11-30T02:00:00.000+02:00", "crawled": "2018-11-30T19:14:58.009+02:00", "highlightTitle": ""}