{"organizations": [], "uuid": "aa49e985a911e32bcad6273a932439ea78f95991", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/news/north-east-news/article15422597.ece/ALTERNATES/s1200/0_may-presser.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-fights-saying-see-through-15422621", "country": "GB", "domain_rank": 21960, "title": "Theresa May fights on saying she will 'see this through' despite resignations over proposed Brexit deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T20:56:00.000+02:00", "replies_count": 0, "uuid": "aa49e985a911e32bcad6273a932439ea78f95991"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-fights-saying-see-through-15422621", "ord_in_thread": 0, "title": "Theresa May fights on saying she will 'see this through' despite resignations over proposed Brexit deal", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "geoff boycott", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May fights on saying she will 'see this through' despite resignations over proposed Brexit deal The Prime Minister compared herself to cricketer Geoff Boycott, saying 'he got the runs in the end' Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTheresa May has vowed to fight on despite a series of resignations by Conservative colleagues determined to block her proposed Brexit deal.\nShe said: “Am I going to see this through? Yes.”\nThe Prime Minister even compared herself to former England cricketer Geoff Boycott, saying he “stuck to it, and he got the runs in the end.”\nBut Mrs May could face a vote of no-confidence by Tory MPs after pro-Brexit backbenchers called on her to go.\nNorthumberland MP Anne-Marie Trevelyan was one of the MPs to resign, quitting from her role as a Ministerial aide in the Department for Work and Pensions. Theresa May Gives a press conference in Downing Street\nIn a letter to Theresa May, she said: “Sadly, the deal which you and your Cabinet have approved is not one which I can support.\n“It is now clear to me that the negotiations have been built on the UK trying to appease the EU and we have allowed ourselves to be led into a deal which is unacceptable to the 17.4 million voters who asked for us to step away from the EU project and become an independent nation once again.” Read More\nBrexit Secretary Dominic Raab resigned from the Cabinet, soon followed by Work and Pensions Secretary Esther McVey.\nThere were also resignations from junior ministers and government aides.\nMrs May received a hostile reception as she delivered a statement to the House of Commons defending her proposed deal.\nLabour leader Jeremy Corbyn said she had produced “a botched deal” and his party would vote against it.\nBut the Prime Minister was also repeatedly criticised by her own Conservative colleagues, with high-profile Tory MP Jacob Rees-Mogg suggesting to her face that she should be fired. Read More UK and EU agree Brexit deal at last, but now Theresa May must convince her Cabinet and Parliament\nMr Rees-Mogg later announced that he had written to Sir Graham Brady, the chairman of the 1922 Committee of backbench MPs, to say he had no confidence in Mrs May.\nUnder Conservative Party rules, if Sir Graham receives 48 letters then a ballot of Tory MPs will be held to decide whether to replace Mrs May as party leader.\nMr Rees-Mogg said: “I think there are many people in the Conservative Party, not just in Parliament but in the country at large, who feel that her service now should come to an end.\n“She is a very dutiful person, she has served the country to the best of her ability but she has let us down in this deal.” Jacob Rees-Mogg says the Conservatives need a new leader (Image: PA)\nIn a press conference later in the day, Mrs May made it clear she planned to continue as Prime Minister, and to keep pushing her proposed Brexit deal.\nShe said: “This deal delivers what people voted for and it is in the national interest”.\nIt would protect manufacturing, protect our security and protect the integrity of the United Kingdom, she said.\nBut Mrs May insisted that if the deal is rejected “it will be to take a path of deep and grave uncertainty when the British people just want us to get on with it.”\nThere are Conservative MPs who continue to support Mrs May. They include Northern Ireland Secretary Karen Bradley, who urged political colleagues to “get behind the Prime Minister”. She said: “This is a woman who has gone out and negotiated hard.” Read More North East MPs call on government to reveal how Brexit will affect the economy\nBut many Tory MPs were predicting last night that Mrs May would face a no-confidence vote. It’s possible that she could win any vote that takes place, allowing her to continue in office.\nA particular concern for critics of the Brexit deal is the “backstop” arrangement designed to prevent a hard border with Northern Ireland.\nMrs May’s deal involves a temporary single custom territory, effectively keeping the whole of the UK in the EU customs union - until both the EU and UK agree that it is no longer necessary. Conservative MP for Berwick Anne-Marie Trevelyan resigned as a ministerial aide (Image: Newcastle Chronicle)\nThis would only come into effect if another solution to the border issue cannot be found by December 2020.\nBut some Brexiteers fear it means the UK would continue to follow EU rules without having any say over them.\nThe deal is fiercely opposed by the DUP, which has been propping up Theresa May’s government in the House of Commons.\nDUP Westminster leader Nigel Dodds said: “I could today stand here and take the Prime Minister through the list of promises and pledges that she made to this House and to us privately about the future of Northern Ireland and the future relationship with the EU but I fear it would be a waste of time since she clearly doesn’t listen.” Read More North tells Government: Back us and we'll make a success out of Brexit\nMrs May has depended on support from the DUP to win key Commons votes following the 2017 general election, when the Conservatives lost their majority.\nThe scale of the opposition the deal suggests Mrs May will find it extremely difficult to win Parliamentary backing for the proposals.\nUnder the EU Withdrawal Act, which came into law in June this year, the government is barred from signing a Brexit deal with the EU unless it has been approved by a vote in the House of Commons. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-15T20:56:00.000+02:00", "crawled": "2018-11-16T00:59:49.008+02:00", "highlightTitle": ""}