{"organizations": [], "uuid": "1df2e7b03c0bbcdb2aad73f2eb8d890e41d1a979", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article2109409.ece/ALTERNATES/s1200/1_Princess-Yachts-team-at-the-Cannes-Yachting-Festival-10th-September-2018.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/business/revealed-winners-western-morning-news-2242551", "country": "US", "title": "Revealed: The winners of the Western Morning News Business awards 2018 - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.48, "site_type": "news", "published": "2018-11-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "1df2e7b03c0bbcdb2aad73f2eb8d890e41d1a979"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/revealed-winners-western-morning-news-2242551", "ord_in_thread": 0, "title": "Revealed: The winners of the Western Morning News Business awards 2018 - Devon Live", "locations": [], "entities": {"persons": [{"name": "cornish", "sentiment": "none"}, {"name": "bob lindo", "sentiment": "none"}, {"name": "computech", "sentiment": "none"}, {"name": "bill martin", "sentiment": "none"}, {"name": "kylie pentelow", "sentiment": "none"}], "locations": [{"name": "crowne plaza", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}], "organizations": [{"name": "cannes yachting festival", "sentiment": "none"}, {"name": "camel valley wine", "sentiment": "none"}, {"name": "invalid email devon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Princess Yachts team at the Cannes Yachting Festival in September\nDevon luxury yacht maker Princess Yachts has been named Business of the Year at the Western Morning News Business Awards for the second year running.\nMore than 300 business leaders from across the region came together last night to celebrate the very best of enterprise, innovation and endeavour at the ceremony, held at Crowne Plaza in Plymouth.\nAnd Camel Valley Wine founder, Bob Lindo, took the honour of the Lifetime Achievement Award for putting Cornish and UK wine on the global stage.\nBill Martin, editor of the Western Morning News hosted the event with ITV Westcountry news broadcaster Kylie Pentelow.\nHe said: “All of our winners and finalists are doing the business in spite of many things. A rubbish train line for one, or as we sometimes term it - poor connectivity. Western Morning News Business Awards, headline sponsored by Computech IT\n\"And then of course there’s the B-word. For the last two years I have spoken about uncertainty caused by it - so I thought for a refreshing change this year I will try and not say it all.\n“That is what makes the achievements of all of those nominated tonight so remarkable. You are all delivering growth, creating jobs, innovating and plain old working hard despite all of that uncertainty.\n“This celebration is more important than ever in making sure this region has confidence in itself, and has the confidence to let the rest of the world know this is a region that is punching above its weight.” Lifetime Achievement Award\nThe man lauded for pioneering the wine industry in the UK has been honoured with the Western Morning News Lifetime Achievement Award.\nBob Lindo with his wife Annie first planted 8,000 vines at their 82-acre Cornish farm back in 1989.\nAlmost 30 years on, Camel Valley Wines has become the first English wine producer to be granted Royal Warrant by the Prince of Wales. It has been served by the Queen at the State banquet for the King of Spain, to dignitaries at Downing Street and diners at Rick Stein and Gordon Ramsay restaurants.\nThe Cornish vineyard, planted on south facing slopes of the River Camel valley near Wadebridge where sheep once grazed, has supplied award-winning English fizz for royal occasions for several years. It makes a range of Pinot Noir, Chardonnay and sparkling wines.\nAnd the winery is a family affair, with Bob and Annie’s son Sam at the helm as Winemaker.\nSpeaking earlier this year, Bob, 68, said: \"When we started out in 1989 there wasn’t an English sparkling wine industry, so it’s been a long journey.\n\"I cannot really explain our success. We just try to put one foot in front of the other. But I think enjoying what we are doing and also not expanding into oblivion helps.\n\"A lot of wine businesses expand until they become uninteresting. That is very much not our way, even if not doing it ends up costing us money.\"\nThis latest accolade places Camel Valley on a list of wine suppliers that features some of the most famous champagne houses, including Bollinger and Krug.\nAnd it tops a string of awards picked up over the years including the 2009 Gold Medal in the International Wine Challenge for Camel Valley Bacchus, Gold Medal in the Decanter World Wine Awards for Camel valley Sparkling ‘Cornwall' Pinot Noir, the English wine Producers Trophy and the Waitrose Trophy.\nThe gong for Princess Yachts tops a prosperous year for the manufacturer that is proudly crafted in Plymouth.\nThe Stonehouse-based company is expecting to make up to £30million in profit in 2018, beating last year’s record performance and it wants to bring staffing levels up to nearly 3,000.\nIt has also vowed to stay in Plymouth – even if there is a so-called “hard” Brexit.\nThe annual WMN Business Awards recognise businesses large and small covering all aspects of enterprise from manufacturers, exporters to start-ups and tech firms. Hero Lifeboat coxswain Mark Criddle OBE spoke at the Western Morning News Business Awards\nTorbay RNLI coxwain Mark Criddle OBE was guest speaker on the night in support of the chosen charity, RNLI.\nThe awards were this year sponsored by Computech IT with support from category sponsors Foot Anstey, Thomas Westcott, Cornwall College Business, Optimus Performance Marketing, PKF Francis CLark, Vodafone, Livewest, Byron D Hobbs, Highwater Sails, Browne Jacobson, the International Trade team of Devon Chamber of Commerce in partnership with Womble Bond Dickinson, St Austell Brewery and Crowne Plaza. Revealed: Winners of Western Morning News Business Awards\nBUSINESS OF THE YEAR sponsored by Computech\nThis will be awarded to a profitable, growing business that has a positive impact on the Westcountry’s economy as a whole.", "external_links": [], "published": "2018-11-23T02:00:00.000+02:00", "crawled": "2018-11-23T03:00:11.001+02:00", "highlightTitle": ""}