{"organizations": [], "uuid": "d5495a48920465ea636478625c64e48385a9b796", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15361182.ece/ALTERNATES/s1200/0_IBP_NEC_260418biz_awards_131JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/manufacturing-companies-set-recognition-north-15360538", "country": "GB", "domain_rank": 21960, "title": "Manufacturing companies set for recognition at North East Business Awards", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-01T18:00:00.000+02:00", "replies_count": 0, "uuid": "d5495a48920465ea636478625c64e48385a9b796"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/manufacturing-companies-set-recognition-north-15360538", "ord_in_thread": 0, "title": "Manufacturing companies set for recognition at North East Business Awards", "locations": [], "entities": {"persons": [{"name": "jeff hope of akzonobel", "sentiment": "none"}], "locations": [{"name": "hardwick hall", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "north east business awards manufacturing", "sentiment": "negative"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Manufacturing companies set for recognition at North East Business Awards Companies from around the region will be vying to succeed last year's winner, AkzoNobel Ashington Share Jeff Hope of AkzoNobel - last year's winner (Image: Newcastle Journal) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe importance of the manufacturing sector to the regional economy will be recognised at the North East Business Awards .\nThe awards, which are organised by The Journal with sponsors the North East England Chamber of Commerce, include a prize to recognise the region’s top manufacturing companies.\nWinners will be selected in heats held in Tyneside and Northumberland; Durham, Sunderland and South Tyneside; and Teesside, before an overall winner is selected at the regional final being held at Hardwick Hall, near Sedgefield, on May 16. North East Chamber of Commerce (Image: Handout)\nThe category recognises companies that are demonstrating manufacturing excellence, with judges looking for quality, sustainability, investment in people and equipment, manufacturing innovation, sales performance and growth prospects, and markets served. Examples of overcoming manufacturing difficulties, driving technology and productivity development will also be considered. Read More North East firm cancels £100m investment due to Brexit uncertainty\nLast year the manufacturing award - which is being sponsored by Business Durham, Gateshead College and South Tyneside Council - was won by AkzoNobel Ashington, which was praised for creating one of the world’s most advanced paint production facilities in the North East. Business Durham logo (Image: Handout)\nA spokesman for Business Durham said: “Business Durham is committed to supporting our innovative manufacturers, in developing NETPark, County Durham’s science park, we are providing opportunities for manufacturers to explore the potential of new technologies and applications.\n“Supporting manufacturing companies is very important to Business Durham, so we are delighted to be sponsoring the manufacturing category at this year’s North East Business Awards. Read More North East struggles in list of best UK cities to live and work in\nIvan Jepson, director of business development at Gateshead College, said: “We are delighted to show our support for the region’s manufacturing industry by sponsoring this prestigious award. We work in partnership with many employers in this sector to deliver apprenticeships and other technical training programmes that equip their employees with the skills needed to grow and prosper.” Gateshead College logo (Image: publicity handout from Gateshead College)\nAnd Coun Iain Malcolm, leader of South Tyneside Council, said: “We are delighted to once again sponsor the Manufacturing Award to celebrate the successful organisations in this area.\n“The North East is a prime location for manufacturing and engineering, with sites such as the International Advanced Manufacturing Park (IAMP) creating a cluster of companies utilising the excellent transport links to serve national and global markets.”\nMore details on the awards can be found at www.nebusinessawards.co.uk .\nThe awards are open to companies and organisations of all sizes with a significant presence in the region. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-01T18:00:00.000+02:00", "crawled": "2018-11-02T03:09:27.022+02:00", "highlightTitle": ""}