{"organizations": [], "uuid": "fc3eafc46a6705dcbcd047476fd2d48b33c73d81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15435032.ece/ALTERNATES/s1200/0_JS168880815.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-cbi-speech-live-rival-15433806", "country": "GB", "domain_rank": 21960, "title": "Brexit turmoil LIVE: Theresa May sells Brexit plan as Conservative divisions continue", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-19T13:05:00.000+02:00", "replies_count": 0, "uuid": "fc3eafc46a6705dcbcd047476fd2d48b33c73d81"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-cbi-speech-live-rival-15433806", "ord_in_thread": 0, "title": "Brexit turmoil LIVE: Theresa May sells Brexit plan as Conservative divisions continue", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jonathan walker danny dyer", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "danny dyer", "sentiment": "negative"}, {"name": "david cameron", "sentiment": "none"}, {"name": "dyer", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}, {"name": "mick carter", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathan Walker Danny Dyer in four-letter rant about Brexiteers\nEastenders star Danny Dyer has attacked Brexiteers Boris Johnson and Nigel Farage in an expletive-ridden rant.\nSpeaking to The Big Issue, he turned his ire towards the former foreign secretary for his “stupid haircut” and the ex-UKIP leader for being “another prick in a suit”.\nHe also offered his sympathy to Prime Minister Theresa May. He said: “Theresa May, bless her, just got that job by default. Boris Johnson running around with his stupid haircut spouting bollocks.\n“Young people look and think: ‘If these are the people running the country, why shouldn’t I go and loot and riot?’“They just don’t give a f***. This us against them-type vibe has got worse.\nWe are living in an age of food banks. How the f*** did that happen? Seriously.”\nThe 41-year-old, who plays Mick Carter in the BBC One soap, previously shared his views on politics on talk show Good Evening Britain. During that appearance in June, Dyer labelled former prime minister David Cameron a “tw*t” for calling the EU referendum.\nHere’s a reminder: Jonathan Walker Boris Johnson backs \"no-deal\" Brexit\nFormer Foreign Secretary Boris Johnson says the UK should leave the EU and trade with it on World Trade Organisation terms.\nThis is another way of saying he wants a no-deal Brexit. If there is no trade deal than trade would automatically take place under rules overseen by the World Trade Organisation. Boris Johnson speaks at a Conservative home fringe meeting (Image: Getty Images Europe)\nWriting in the Daily Telegraph, he said Theresa May’s proposed agreement was a “585-page fig leaf (that) does nothing to cover the embarrassment of our total defeat”.\nCalling for the scrapping of the Northern Ireland backstop, he added: “We should massively accelerate our preparations to exit on World Trade Organisation terms, with a new Secretary of State responsible for all the cross-government work.\n“There would, of course, be some disruption in that outcome, but by no means as much as sometimes predicted. “And it is our failure to make proper preparations that has so gravely weakened our negotiations.” 12:48 Jonathan Walker Government Minister won't deny the army is on standby\n“I can’t confirm that the army is on standby” in case there is a no-deal Brexit, says Government minister Nadhim Zahawi. 12:41 Jonathan Walker The Conservative MPs trying to get rid of Theresa May\nHere are the MPs known to have submitted letters saying they have no confidence in Theresa May, according to PA.\n1. Steve Baker (Wycombe). Wrote on October 22 there seemed “little point allowing the captain to continue steering the ship towards the rocks”.\n2. Nadine Dorries (Mid-Bedfordshire). Said on November 15 she submitted her letter “some weeks ago”, adding: “The writing has been on the wall for some time.”\n3. Sheryll Murray (South-East Cornwall). Issued a statement on November 15 confirming she sent a letter to Sir Graham over concerns the UK may “leave the Common Fisheries Policy in name only”.\n4. Henry Smith (Crawley). Posted a picture of his letter on top of the Government’s draft Withdrawal Agreement on November 15.\n5. Lee Rowley (North-East Derbyshire). Told his regional TV news on November 15 he had submitted a letter.\n6. Simon Clarke (Middlesbrough South and East Cleveland). Initially sent in a letter of no confidence and then withdrew it earlier this year, before resubmitting it following the publication of the draft deal.\n7. Jacob Rees-Mogg (Somerset North-East). The chairman of the European Research Group staged a press conference outside the gates of Parliament to announce his loss of confidence in the Prime Minister.\n8. Martin Vickers (Cleethorpes). Handed in his letter after the Chequers deal was agreed in July.\n9. Laurence Robertson (Tewkesbury). Wrote to Sir Graham following the Chequers deal in the summer, and confirmed last week the letter remains “live”.\n10. Andrea Jenkyns (Morley & Outwood). Put in her letter as early as June and has been vocal in calling for other Tory MPs to do the same.\n11. Peter Bone (Wellingborough & Rushden). Told Newsnight on November 15 he had submitted his letter.\n12. James Duddridge (Rochford and Southend East). Told the Press Association at the time of the Conservative conference in September he had handed in his letter.\n13. Anne Marie Morris (Newton Abbott). Said the Prime Minister is “not going to deliver Brexit” and there was “no question” the 48 threshold would be reached. Jacob Rees-Mogg\n14. Philip Davies (Shipley). One of the first to submit a letter, in July.\n15. Andrew Bridgen (North-West Leicestershire). Wrote to Sir Graham on July 10, saying the Brexit negotiations “appear to have deteriorated into a state of complete capitulation”.\n16. Adam Holloway (Gravesham). Announced on November 15 he had handed in a letter, saying: “You can not have someone leading a mission who does not believe in the mission.”\n17. John Whittingdale (Maldon). Told PA on November 16 he had written to Sir Graham, adding: “The agreement that is being proposed does not deliver Brexit in the way that I and many others want to see.”\n18. Mark Francois (Rayleigh and Wickford). Submitted his letter on November 16, describing the draft agreement as “truly awful” and complaining the PM had been surrounded throughout the negotiations by “a Praetorian Guard of highly pro-EU senior civil servants who have never accepted the result of the referendum”.\n19. Maria Caulfield (Lewes). Told the BBC on November 15 she had submitted a letter.\n20. Ben Bradley (Mansfield and Warsop). Submitted a letter on November 15, saying the proposed deal was “simply not acceptable”.\n21. Chris Green (Bolton West & Atherton). Said on November 16 he was putting in a letter “with a heavy heart”.\n22. Zac Goldsmith (Richmond Park and North Kingston). Wrote in the Daily Telegraph on November 17 saying he declared no confidence in the PM “with huge reluctance” because her deal was “unacceptable to Leave and Remain voters alike”.\n23. Sir William Cash (Stone). Confirmed to PA on November 19 that he has put his letter in.\nTwo Conservative MPs who are widely reported to have submitted letters told the Press Association that they are not confirming publicly whether they have in fact done so.\nMarcus Fysh told PA the question of whether letters have been submitted is “a private thing between Graham Brady and an MP”. But he added: “I have been disillusioned for a long time and I think we do need a leader who can reset the policy and if she isn’t willing to, we need someone else.”\nDavid Jones said: “I have not made public whether or not I have submitted a no confidence letter.” 12:36 Jonathan Walker Watch: Theresa May at the CBI\nTheresa May tells business leaders she will ‘hammer out’ final details of Brexit deal this week 12:30 Jonathan Walker What are the odds on a second referendum?\nBookmakers William Hill have cut the odds on the UK having a second referendum on Brexit.\nIf you fancy a flutter, you can still get decent odds on Theresa May continuing as Prime Minister past 2019.\nHere’s what the bookies are offering:\nWhen will Theresa May leave office as PM: 7/4 2018; 5/4 2019; 10/1 2020; 16/1 2021; 7/2 2022 or later\nNext permanent Conservative leader after Theresa May: 13/2 Dominic Raab; 7/1 Boris Johnson; 7/1 Michael Gove; 7/1 Sajid Javid; 10/1 Jacob Rees-Mogg; 10/1 Jeremy Hunt; 12/1 David Davis; 16/1 BAR\nWill there be a second EU Referendum: 11/8 yes; 8/15 no 12:15 Jonathan Walker Poll suggests voters don't think a different leader would get a better deal\nA poll by YouGov finds voters don’t believe a different leader would have got a better Brexit deal.\nThis goes for a different Tory Prime Minister, or replacing Theresa May with a Labour Prime Minister. 12:07 KEY EVENT Theresa May's speech to the CBI: key extracts\nTheresa May told the CBI: “It was never going to be easy - but we have in view a deal that will work for the UK”\nAnd she that SHE would deliver the Brexit deal, making it clear she has no plans to stand down. Prime Minister Theresa May holds a press conference at 10 Downing Street, London, to discuss her Brexit plans. (Image: PA)\nHere are extracts from her speech:\nThe core elements of that deal are already in place. The Withdrawal Agreement has been agreed in full, subject of course to final agreement being reached on the future framework\nThat Agreement is a good one for the UK.\nIt fulfils the wishes of the British people as expressed in the 2016 referendum.\nI have always had a very clear sense of the outcomes I wanted to deliver for people in these negotiations.\nControl over our borders, by bringing an end to free movement, once and for all. Control of our money, so we can decide for ourselves how to spend it, and can do so on priorities like the NHS.\nControl of our laws, by ending the jurisdiction of the European Court of Justice in the United Kingdom and ensuring that our laws are made and enforced here in this country\nGetting us out of those EU programmes that do not work in our interests, like the Common Agricultural Policy and Common Fisheries Policy.\nAnd that is exactly what we are going to deliver.\nLet me say a little more about the first of those items – getting back full control of our borders – because I know that is an issue of great importance to the British people.\nThe United Kingdom is a country that values the contribution that immigration has made to our society and economy over many years.\nAnd in the future, outside the EU, immigration will continue to make a positive contribution to our national life. But the difference will be this: once we have left the EU, we will be fully in control of who comes here.\nIt will no longer be the case that EU nationals, regardless of the skills or experience they have to offer, can jump the queue ahead of engineers from Sydney or software developers from Delhi.\nInstead of a system based on where a person is from, we will have one that is built around the talents and skills a person has to offer.\nJobs depend on us getting this right. And what we have agreed unashamedly puts our future economic success, and the livelihoods of working families up and down this country, first.\nSo we have agreed a transition period, to avoid a cliff-edge for business and to provide the certainty you need to invest.\nOn goods, the outline future framework agrees to the creation of a comprehensive free trade area with the EU, our biggest and nearest goods market.\nZero tariffs, no fees, charges or restrictions across all goods sectors, with an ambitious customs arrangement that respects both sides’ legal orders.\nThat is what our businesses need, and that is what my deal will deliver\nMy job is to get the best deal. Parliament must then examine it and do what is in the national interest.\nAnd I know what that deal needs to do. Deliver on the referendum vote by giving us control of our borders, laws and money.\nGet the UK out of the Common Agricultural Policy and the Common Fisheries Policy.\nSet us on course for a prosperous future where livelihoods are protected, our security is maintained, and our Union secured.\nIt was never going to be easy or straightforward.\nAnd the final stage was always going to be the toughest. But we have in view a deal that will work for the UK. And let no one be in any doubt – I am determined to deliver it. 11:54 Labour chair Ian Lavery says Labour offers a \"fair\" Brexit\nIan Lavery, Wansbeck MP and Labour chair, says people want fairness and justice. 11:47 Newcastle MP Catherine McKinnell continues to campaign for second referendum 11:46 Jonathan Walker We'll be fully out by May 2022, suggests Theresa May\nTheresa May says she wants the implementation period to be over by the next election, which will be May 2022.\nSome commentators think she suggested that she will still be leading the Conservative Party in that election. (A lot of Tory MPs - even the ones who are supporting her right now - want a new leader by the time the next election comes) 11:43 Jonathan Walker\nTheresa May says the core of the UK’s new immigration system will not be quota based but will be skills based. 11:38", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15433806;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-19T13:05:00.000+02:00", "crawled": "2018-11-19T15:33:39.034+02:00", "highlightTitle": ""}