{"organizations": [], "uuid": "5de8f745f81827ce61a1a2c733ff35c280163477", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article843255.ece/ALTERNATES/s1200/Flybe.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/flybe-must-stay-exeter-say-2218419", "country": "US", "title": "Flybe must stay in Exeter, say business bosses - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "5de8f745f81827ce61a1a2c733ff35c280163477"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/flybe-must-stay-exeter-say-2218419", "ord_in_thread": 0, "title": "Flybe must stay in Exeter, say business bosses - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon live flybe", "sentiment": "none"}, {"name": "tim jones", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "exeter airport", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "flybe", "sentiment": "none"}], "organizations": [{"name": "invalid email exeter", "sentiment": "none"}, {"name": "south west business council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Flybe must stay in Exeter, say business bosses Airline Flybe employs 1,000 people in Exeter and is up for sale Share Click to play Tap to play The video will start in 8 Cancel Play now\nExeter airline Flybe has said it is business as usual after going up for sale.\nPassengers have been told that travel will continual as normal.\nMeanwhile, economic leaders have backed the regional airline , which employs 1,000 people at its HQ at Exeter Airport.\nTim Jones, chairman of South West Business Council, said the uncertainty around Flybe has been damaging to the ability of the group to grow and invest.\nHe said: \"In that context a new ownership might be a very positive injection of capital and strategic ambitions.\n\"Flybe have achieved a strong regional and international brand and proved that passengers do not need to drive past Exeter en route to Bristol or Heathrow. We believe that this has established Exeter as a profitable airport and this means that Exeter will be regarded as a key part of any new owners business plans.\n“The major concern is that Flybe are one few list companies in the South West and have their HQ and administration teams based in Exeter. This could change with a new corporate owner.\n“The other major concern is the potential loss of the engineering business which is key to local GDP, local skills levels and supporting a big local supply chain. The loss of this is potentially several hundred jobs.\n“It is essential that all our MPs lobby the aviation minister to ensure that any change of ownership does not disrupt the current range of facilities.” Read More Flybe must stay in Exeter, say busin...\nExeter MP Ben Bradshaw said that 'everything must be done' to secure the future of Flybe.\nHe said: “Flybe are an invaluable local employer, providing good highly skilled jobs and training. They are also extremely important for the future success of Exeter airport.\n\"Their role as the UK’s main domestic regional airline is vital for transport connectivity right around the British Isles. Everything must be done to secure Flybe’s future.\"\nHe said that the cost of airline fuel, bought in dollars, had been badly hit by the collapse in the pound since the EU referendum and the other damage being caused by Brexit. Tim Jones, chairman of South West Business Council (Image: Lucy Duval)\nHe also blamed Government’s Air Passenger Duty, which unfairly penalises domestic carriers by charging them twice for each journey, while international carriers only pay the tax once.\nHe said: \"This news also strengthens my view that we must have a People’s Vote on Mrs May’s disastrous Brexit deal, so we can end the uncertainty, put this whole damaging mess behind us and focus on the big challenges we face as a country.”\nThe sale comes as Flybe also announced disappointing financial results this morning on the Stock Exchange.\nHalf-year figures show that pre-tax profits for the six months to 30 September fell by 54% to £7.4m, on revenues down by 2.4% to £419.2m.\nThe airline's shares have fallen by almost 75% since September.\nIt comes after Flybe’s profit warning last month.\nThe Exeter-based regional airline's board has confirmed it was \"in discussions with a number of strategic operators about a potential sale of the company\".\nFlybe said it was also reviewing other \"strategic options\", including cutting more flights in the face of challenges.\nStobart Group, owner of Southend airport and majority owner of Stobart Ai r, has been identified as a potential buyer for Flybe.\nStobart Group, which has not commented on the sale, last month recorded a pre-tax loss of £17.5m in the six months to the end of August. Read More Five reasons why Flybe is making a loss\nStuart Elford, Chief Executive of Devon and Plymouth chamber of commerce, said he was concerned about the impact of jobs , the economy that relies on the airport and the wider issue of connectivity.\nHe said: \"Transport infrastructure is vital for our region, particularly in light of the lack of resilience in our rail line. I would want to ensure that any operator that buys Flybe is committed to maintaining the level of service or expanding it and is robust enough to weather the challenges that the aviation industry is facing.\"\nFlybe is the largest independent regional airline in Europe and carries eight million passengers a year between 81 airports.\nThe airline employs 1,000 people at Exeter Airport including high value aviation and engineering roles. Two-thirds of passengers at Exeter Airport fly with Flybe. Exeter Airport\nCouncil and business leaders including have written an open letter highlighting the £150million a year Flybe adds to the county's economy.\nIn recent years there has been significant investment in hangar facilities and the Training Academy, helping to create high value local jobs.\n“We want to develop the concept of an aviation skills escalator to ensure that local people have the necessary skills to support the airport’s growth,” states the letter.\nAndrew Bell, Chief Executive of Regional & City Airports, which owns and operates Exeter Airport, said it has a close and important partnership with Flybe, with long-term operations across its portfolio.\nHe said: \"We’re always working together with Flybe to find proactive ways to strengthen the partnership. We echo Flybe’s assertion that they are an important part of the UK’s national transport infrastructure, providing vital connectivity between the regions of the UK and beyond.”\nTrade unions have raised concerns over the impact of a potential Flybe sale.\nBrian Strutton, general secretary of the British Airline Pilots’ Association (BALPA), said: “Despite warnings this will still be a bolt out of the blue. BALPA believes that Flybe is fundamentally a sound airline and we will scrutinise any offers to buy Flybe very carefully to ensure continued employment is protected.” Read More", "external_links": [], "published": "2018-11-14T02:00:00.000+02:00", "crawled": "2018-11-14T13:45:37.016+02:00", "highlightTitle": ""}