{"organizations": [], "uuid": "19b4148b12c9c8bf10123526382cf8e5c93e64e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12982251.ece/ALTERNATES/s1200/CFR_JNL_290915metrocentre_01.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15446519", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Metrocentre owner Intu gives suitors more time amid £2.8bn takeover bid", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-22T10:10:00.000+02:00", "replies_count": 0, "uuid": "19b4148b12c9c8bf10123526382cf8e5c93e64e7"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15446519", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Metrocentre owner Intu gives suitors more time amid £2.8bn takeover bid", "locations": [], "entities": {"persons": [{"name": "intu", "sentiment": "negative"}, {"name": "ghosn", "sentiment": "none"}, {"name": "greg kelly", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "metrocentre", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Nissan set to meet to decide chairman's fate\nNissan’s board will meet today to decide whether to dismiss its chairman Carlos Ghosn following his arrest on suspicion of under-reporting his income.\nMr Ghosn will be detained for another 10 days following his arrest on suspicion of falsifying income reports by millions of dollars and misusing company assets for personal gain, Japanese media has reported.\nUnder Japanese law, suspects can be held for 20 days per possible charge without an official indictment. Additional charges can be tagged on, resulting in longer detentions.\nNeither Mr Ghosn nor the company’s representative director, Greg Kelly has been charged so far.\nMr Ghosn is suspected of under-reporting £34.8m in income from 2011 to 2015, according to Tokyo prosecutors.\nThe maximum penalty, upon conviction for violating finance and exchange laws is 10 years in prison, a 10 million yen (£69,000) fine, or both.\nDetainees undergoing interrogation in the Tokyo area are generally held in a centre that is separate from the prison for those who have been convicted and sentenced. It is supposed to be nicer than a prison but it is austere with limited access to outside visitors.\nProsecutors have not confirmed where he is being held. Despite the arrests, analysts said the impact on Nissan’s sales would likely be minimal.\n“I’d be surprised if it impacts car sales very much,” said Christopher Richter, auto analyst for CLSA Securities Japan.\n“Consumers are discerning enough to say: This car, the wheels might fall off so I’m not going to buy it. This car company, the executive might have done something kind of dodgy, but do I like the car or not.” Nissan Motor Chairman Carlos Ghosn (Image: Getty Images) 8.53 Coreena Ford Model train maker Hornby 'slams brakes' on discounting\nHornby has seen half-year losses narrow after “slamming the brakes” on an aggressive discounting strategy that was eroding sales.\nThe troubled toymaker posted a pre-tax loss of £3.2m in the six months to September 30, down from £5.7m in the same period last year.\nHornby boss Lyndon Davies said the encouraging performance came after the firm ditched selling products on the cheap and focused on the “long-term health of the brands”.\nHe said:\nHaving slammed on the brakes as hard as we could to prevent further damage to the brands from discounting, the trust in the supply chain is starting to move in the right direction.\nPerhaps most importantly, our loyal employees are beginning to believe in the business again. There are some incredible products in the pipeline that will finally get us back on the front foot and give us the ability to take back the market share that we have given away.\nGroup revenue in the period fell from £17m to £13.8m. Hornby trains Coreena Ford Mothercare sales falter amid tough trading\nRetailer Mothercare warned that its financial performance will remain “volatile” as it reported a crash in UK sales. The firm posted an 11% decline in UK like-for-like revenues in the six months to October 6, while total sales in the country fell 14.3% to £196.2m.\nMothercare said the poor showing reflects “wider market uncertainty and negative brand coverage” relating to the group’s restructuring programme.\nThe firm posted a pre-tax loss of £14.4min the period, a slight narrowing from the £16.8m recorded last year. Total group revenue, including international, was down 13.1% to £295m.\nIn the UK, retail store sales were down 13.8% and online sales dropped 7.8%.\nEarlier this year, Mothercare launched an overhaul which saw it embark on a £32.5m share issue and sweeping store closures.\nThe babywear chain is shutting 60 of its outlets, including two stores in the North East, and it said that it was ahead of schedule with the closures.\nBoss Mark Newton-Jones said:\nOur international business is showing signs of recovery after a difficult few years, and some core markets, including Russia, China and Indonesia, have moved into growth.\nThe UK retail environment, however, remains very challenging and, given the ongoing uncertainty with consumer confidence, alongside the short-term impacts of our operational changes and restructuring programme, we expect performance in the remainder of our financial year to remain volatile. Mothercare says its financial performance will remain “volatile” (Image: PA) 8.40 Coreena Ford Centrica reveals £70m price cap hit\nBritish Gas owner Centrica has warned over a hit of around £70m from the incoming energy price cap as it revealed another 370,000 customers have quit the supplier.\nBritain’s biggest energy provider said the earnings impact will be taken in the first quarter of next year, with the cap coming into force on January 1.\nIt said that while the ongoing impact of the cap is in line with previous forecasts, the regulator’s recent revisions to calculation changes meant it would take the one-off earnings hit in the initial period after the cap comes into effect.\nBritish Gas lost another 372,000 gas and electricity accounts in the four months to the end of October as households switched suppliers amid intense competition and after the provider announced its second price hike this year in August.\nThe customer account losses came as it moved customers off standard variable tariffs (SVTs) ahead of the price cap.\nBritish Gas has 3.1 million customers on its SVT, down from 4.3 million at the start of the year, and it expects this to reduce further to below three million by the end of the year. Centrica said that despite “competitive trading conditions”, it expects to deliver 2018 results in line with forecasts, with underlying earnings set to be higher than in 2017. A gas hob with a bill from British Gas (Image: PA) 8.35 KEY EVENT Majestic Wine to stockpile ahead of Brexit\nWine retailer Majestic Wine has revealed it is stockpiling ahead of Brexit amid worries over possible supply disruption next March.\nThe firm, which has stores across the UK including in Hexham, Newcastle, Berwick, Durham and Darlington, detailed its preparations in half year results, which showed it had swung to a pre-tax loss of £200,000 from profits of £3.1m a year earlier.\nThe group warned it expects underlying earnings across its retail and commercial divisions to be flat “at best” in 2018-19 amid a “tough” market.\nIts push to expand Naked Wines will also hit profits, with investment set to be more than expected at £20 million or higher over the full-year.\nMajestic said it is are planning to bring £5-8m of additional inventory into the UK above its normal levels, shortly prior to its financial year end, “in order to mitigate any potential supply chain Brexit disruption in March 2019.”\nIt added: “We are also planning to build additional inventory to support future Naked growth, in the US in particular, reflecting our confidence in this exciting opportunity.”\nRowan Gormley, group chief executive, said: “We’re doing well in a tough market. “We set out a plan at our capital markets day in April 2018 and we are delivering against it. “That plan was to accelerate growth by investing in new customers and, so far, the plan is on track.”\nMajestic said it was stockpiling. It said it is planning to bring £5 million to £8 million of extra inventory into the UK shortly before its financial year end in April. Majestic Wine's chief executive Rowan Gormley 8.25 Coreena Ford Nationwide profits fall following tech investments\nNationwide Building Society has seen half-year profits tumble as it counted the cost of writedowns and a technology investment.\nStatutory profit in the six months to September 30 fell over 17% to £516m, which it put down to £135m of “asset write-offs and incremental technology spend”.\nUnderlying profits were down by 22% to £460m. Earlier this year, Nationwide announced another £1.3bn technology investment as it looks to take the challenge to digital rivals.\nAt the time, the building society said the cash injection will help “simplify its technology estate and build new technology platforms to enable growth and diversification, and drive forward digital, data and analytic strategies”.\nChief executive Joe Garner said:\nOur first-half profits were lower than last year because we have chosen to increase our investment in the future of our society. As a mutual, we do not judge our success by profit growth alone, but by how we manage our profits to serve our members’ interests.\nNationwide has been battling fierce competition in the mortgage market, but said it helped a record 40,500 first-time buyers purchase a new home in the first half of the year. A Nationwide branch", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15446519;"], "published": "2018-11-22T10:10:00.000+02:00", "crawled": "2018-11-22T11:30:31.013+02:00", "highlightTitle": ""}