{"organizations": [], "uuid": "3f3d390157497c669456763661e00b23502d012b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15380673.ece/ALTERNATES/s1200/0_Labour-MEP-Newcastle.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/paul-brannen-north-of-tyne-15380582", "country": "GB", "domain_rank": 21960, "title": "The race begins: Labour's Paul Brannen becomes first candidate to announce North of Tyne mayoral bid", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-07T07:00:00.000+02:00", "replies_count": 0, "uuid": "3f3d390157497c669456763661e00b23502d012b"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/paul-brannen-north-of-tyne-15380582", "ord_in_thread": 0, "title": "The race begins: Labour's Paul Brannen becomes first candidate to announce North of Tyne mayoral bid", "locations": [], "entities": {"persons": [{"name": "paul brannen", "sentiment": "negative"}, {"name": "tyne", "sentiment": "negative"}, {"name": "brannen", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "european parliament", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north of tyne combined authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East Labour MEP Paul Brannen. (Image: Newcastle Chronicle) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nPaul Brannen MEP has become the first candidate to officially put himself forward to be North of Tyne mayor.\nHis intervention signals the starting pistol on a race which will culminate in a historic election in May 2019.\nMr Brannen's run for the Labour nomination comes days after the new devolved body covering Newcastle, Northumberland and North Tyneside was formally established.\nAfter a spell as a councillor in Newcastle, Mr Brannen, 56, successfully stood for election to the European Parliament in 2014.\nNow he's looking to continue representing the region sitting alongside council leaders on the North of Tyne Combined Authority. Paul Brannen\nSpeaking to ChronicleLive, he said: \"At last we are getting powers and money devolved to the North East from London and, while I'd like to see more, I think it's important that we've got our foot in the door.\n\"It's time to seize this opportunity and get on with it.\"\nSetting out his green jobs pitch to voters, Mr Brannen said: \"I think it's vitally important that a new mayor pulls in the same direction already set out for the region by leaders and that's about bringing more and better jobs to the North of Tyne region.\n\"The industrial revolution - and, by extension, climate change - started in the North East so this is precisely where the green jobs revolution should be based too. Read More How Brexit has turned the life of these two North East MEPs upside down\n\"Jeremy Corbyn talked about that in his conference speech and I think it's crucial the North East makes sure it's front and centre in this huge emerging industry.\"\nDespite having worked in Europe for four years and campaigned for Remain, Mr Brannen said there is a \"silver lining\" to Brexit - the UK's independence from the Common Agricultural Policy.\nThis, he said, would allow the North of Tyne region to pursue an ambitious plan to double the amount of forest cover in the region over 20 years in order to generate a job-creating bio-fuel industry.\nDevolution has split the North East down the middle in recent years, prompting the three North of Tyne councils to push ahead with a deal without Sunderland, South Tyneside, Durham and Gateshead. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nOn the prospect of a future reunification, Mr Brannen said: \"In the short term, the priority for the incoming mayor needs to be to make sure nothing is done to make the prospect of a region-wide devolved authority less likely.\n\"Ultimately, it's their call but I would keep the door permanently open to the councils south of the Tyne to rejoin in the future.\"\nHe added a top priority if he was elected would be to lobby Government in order to ensure the same amount of funds which came to the North East via the EU would be replaced post-Brexit.\nNo other candidates have declared themselves yet in the Labour party but rumours are swirling that other significant figures are eyeing up a run. Read More\nWinning over party members is likely to be a key hurdle for would-be Labour candidates but Mr Brennan said he was confident he could appeal to all sides of the party by putting his green jobs initiative front and centre.\nThe first ever election for the North of Tyne mayor will take place on May 2. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-07T07:00:00.000+02:00", "crawled": "2018-11-07T07:40:04.011+02:00", "highlightTitle": ""}