{"organizations": [], "uuid": "9b8e150510215413e0f893aeddab148aff24b997", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2175852.ece/ALTERNATES/s1200/0_GettyImages-934788728.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/mp-says-death-penalty-should-2175845", "country": "GB", "domain_rank": 48128, "title": "MP says DEATH penalty should be brought back to tackle violent crime", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-02T14:36:00.000+02:00", "replies_count": 0, "uuid": "9b8e150510215413e0f893aeddab148aff24b997"}, "author": "Anna Whittaker", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/mp-says-death-penalty-should-2175845", "ord_in_thread": 0, "title": "MP says DEATH penalty should be brought back to tackle violent crime", "locations": [], "entities": {"persons": [{"name": "getty", "sentiment": "none"}, {"name": "david gauke", "sentiment": "none"}, {"name": "john hayes", "sentiment": "none"}, {"name": "hayes", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "south holland", "sentiment": "none"}], "organizations": [{"name": "lincolnshire live", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MP says DEATH penalty should be brought back to tackle violent crime He says it should be available to the courts Share Should the death penalty be brought back? (Image: Getty) Get Daily\nOne MP has controversially suggested the death penalty could help Britain reduce violent crime.\nJohn Hayes, Conservative MP for South Holland and The Deepings put a written question to Secretary of State for Justice David Gauke 'to ask if he will make an assessment of the potential merits of bringing forward legislative proposals to reintroduce the death penalty to tackle violent crime.\"\nThe Brexit supporting MP's move wasn't well received by the government, who said they oppose the death penalty around the world.\nBut Mr Hayes told Lincolnshire Live that he believes the country should give the matter further consideration. What did he say?\nHe said: \"We have got an issue in Britain with very serious crime .\n\"We have had a number of serious crimes, the murder rates increases and barely a week goes by without hearing about some horrific child murder or old people being attacked and killed.\n\"Many of my constituents say that's partly because we don't respond appropriately.\n\"It seems to me there really needs to be a fitting punishment.\n\"I say capital punishment should be a sentence available to the courts but the death penalty should not be mandatory - that's always been my position. poll loading Should the death penalty be brought back? 0+ VOTES SO FAR Yes - we need tough action No - but sentences must be tougher No - leave things as they are\n\"If you look at the Westminster Bridge attacker, he was shot in cold-blood after someone had taken a proper decision to stop him.\n\"If he had survived I think most of the British public would have been OK if he had received a fair trial and been hanged - most people would deem that appropriate.\n\"Fred West and Harold Shipman killed themselves and it was almost as if they knew that was the right thing for them to do.\n\"I did not table a motion, I simply raised it as a question.\" What did the government say?\nEdward Argar, Under Secretary for Justice, explained that the Government opposes the death penalty and calls for a worldwide ban.\nHe wrote: \"The Government opposes the use of the death penalty in all circumstances and has no plans to reintroduce it.\n\"We are also actively advocating for the global abolition of the death penalty.\n\"This includes meeting with foreign delegations, who have the death penalty, to set out our alternative sentencing framework.\" The history of capital punishment\nCapital punishment ended in the UK in 1965\nPeter Allen and Gwynne Evans were the last people hanged in the UK. They were executed in 1964 for the murder of John West at his home in Seaton, Cumberland.\nCapital punishment for murder was abolished in the UK in 1965 following the executions of people who were later proved to have been innocent.\nTimothy Evans was famously wrongly convicted and hanged in 1950 for killing his wife and infant daughter at 10 Rillington Place in London. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://www.lincolnshirelive.co.uk/news/local-news/lincolnshire-mp-makes-controversial-call-2169097", "https://mab.data.tm-awx.com/rhs&quot;,&quot;modularCss&quot;:&quot;true&quot;,&quot;nativeAppBanner&quot;:&quot;true&quot;,&quot;newslettersURL&quot;:&quot;https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/&quot;}}}", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-11-02T14:36:00.000+02:00", "crawled": "2018-11-02T16:04:43.016+02:00", "highlightTitle": ""}