{"organizations": [], "uuid": "3cb8f56683666f0198d593e75d9e2a2a9134cc9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15324027.ece/ALTERNATES/s1200/0_TMP_NEC_270718FoodbankCrisis06JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/un-newcastle-visit-universal-credit-15425421", "country": "GB", "domain_rank": 21960, "title": "'A social calamity' - A UN poverty expert's verdict on Universal Credit after Newcastle visit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-16T16:31:00.000+02:00", "replies_count": 0, "uuid": "3cb8f56683666f0198d593e75d9e2a2a9134cc9f"}, "author": "Sonia Sharma", "url": "https://www.chroniclelive.co.uk/news/north-east-news/un-newcastle-visit-universal-credit-15425421", "ord_in_thread": 0, "title": "'A social calamity' - A UN poverty expert's verdict on Universal Credit after Newcastle visit", "locations": [], "entities": {"persons": [{"name": "philip alston", "sentiment": "negative"}, {"name": "denise", "sentiment": "none"}, {"name": "michael hunter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "west end", "sentiment": "none"}, {"name": "benwell", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "un", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "west end foodbank", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Philip Alston, the UN's special rapporteur on extreme poverty and human rights during a visit the the West End food bank in Benwell (Image: Newcastle Chronicle) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nGovernment policies and drastic cuts to social support are entrenching high levels of poverty and inflicting unnecessary misery, a UN human rights expert has said.\nPhilip Alston, UN special rapporteur on extreme poverty and human rights, travelled across the country to examine the impact of austerity and also came to Newcastle and the West End Foodbank earlier this month.\nAt the end of his 12-day visit, he said: \"The United Kingdom’s impending exit from the European Union poses particular risks for people in poverty, but the Government appears to be treating this as an afterthought.\"\nAlmost all studies have shown that the UK economy will be worse off after Brexit , he added. Philip Alston chats to centre users Michael Hunter and mum Denise during a visit to the West End Foodbank (Image: Newcastle Chronicle) Read More United Nations investigator sees first hand the devastation Universal Credit is having on poor families\nConsequences for inflation, real wages, and consumer prices will drive more people into poverty unless the Government takes action to shield those most vulnerable and replaces current EU funding for combating poverty, he said.\nAccording to his research, 14 million people - a fifth of the population - live in poverty. Four million of these are more than 50% below the poverty line, and 1.5 million are destitute, unable to afford basics essentials. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nAfter years of progress poverty is rising again, with child poverty predicted to rise 7% between 2015 and 2022, homelessness is up 60% since 2010, and food banks are rapidly multiplying.\nMr Alston said: \"In the fifth richest country in the world, this is not just a disgrace, but a social calamity and an economic disaster, all rolled into one. Read More Thousands of North East benefits claimants shift over to the new universal credit system\n\"During my visit I have spoken with people who depend on food banks and charities for their next meal, who are sleeping on friends’ couches because they are homeless and don’t have a safe place for their children to sleep, who have sold sex for money or shelter, children who are growing up in poverty unsure of their future.\n\"I've also met young people who feel gangs are the only way out of destitution, and people with disabilities who are being told they need to go back to work or lose benefits, against their doctor’s orders.\"\nSuccessive Governments have presided over the systematic dismantling of the social safety net in the UK, he added, and the introduction of Universal Credit and significant reductions in the amount of and eligibility for important forms of support have undermined the capacity of benefits to loosen the grip of poverty.\n\"British compassion for those who are suffering has been replaced by a punitive, mean-spirited, and often callous approach,\" Mr Alston said.\n\"As a 'digital by default' benefit, Universal Credit has created an online barrier between people with poor digital literacy and their legal entitlements. In 2017-18, West End Foodbank’s food parcels fed 21,000 residents (Image: newcastle chronicle)\n\"And the 'test and learn' approach to the roll out treats claimants like guinea pigs and can wreak havoc in real peoples' lives.\"\nHe also highlighted that local governments in England have seen a 49% real-terms reduction in funding since 2010, with hundreds of libraries closed, community and youth centres shrunk and underfunded, and public spaces and buildings including parks and recreation centres sold off.\n\"I was told time and again about important public services being pared down, the loss of institutions that would have previously protected vulnerable people, social care services that are at a breaking point, and local government and devolved administrations stretched far too thin,\" added Mr Alston. Read More Almost 23,000 food parcels handed out in the North East over six months\n\"The voluntary sector has done an admirable job of picking up the slack for those government functions, but that work does not relieve the Government of its obligations.\n\"The Government has remained in a state of denial, and ministers insisted to me that all is well and running according to plan.\n\"Despite making some reluctant tweaks to basic policy, there has been a determined resistance to change in response to the many problems which so many people at all levels have brought to my attention.\"\nOn the local authority budget cuts, Mr Alston told a press conference: \"The leader of Newcastle told me 'we have been reduced to emergency service provision, we don't have the money to do anything more. The West End Foodbank in Benwell (Image: Newcastle Chronicle)\n\"Yet when I meet the Treasury they say it's fine, these councils have a lot of money. It is totally an economic analysis that ignores the damage being done to society.\"\nNick Forbes, leader of Newcastle City Council, says he hopes the UN report will result in major changes.\nHe added: \"Earlier this month I shared our city’s painful experiences of being a pilot for Universal credit, amid the wider impact of Government-ordered austerity.\n\"The UN saw first hand the massive growth in food banks and the numbers of people being pushed further into poverty. We have done what we can as a council, but cuts year after year after year have limited our ability to act. All we can do now is help people in crisis.\n\"As the UN today confirmed, if the Government wanted to it could give us the funds to actually prevent people getting into difficulties.\n\"The Government should be deeply ashamed that it has taken a UN observer to highlight the scale of poverty and misery these Tory policies are causing. I’m angry that they’ve consistently ignored our warnings - it’s time for change and I hope Prof Alston’s report will be a catalyst for a more caring, humane approach.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-16T16:31:00.000+02:00", "crawled": "2018-11-16T16:48:27.009+02:00", "highlightTitle": ""}