{"organizations": [], "uuid": "5eb025fd173da1292f6c42ef9934d3c89ce6a445", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15408852.ece/ALTERNATES/s1200/0_Newcastle-United-v-Arsenal-FC-Premier-League.jpg", "site_section": "http://www.thejournal.co.uk/sport/?service=rss", "section_title": "ChronicleLive - Sport", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/brexit-newcastle-fa-premier-league-15408803", "country": "GB", "domain_rank": 21960, "title": "How new FA proposals for the Premier League will affect who Newcastle United can sign", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-13T15:00:00.000+02:00", "replies_count": 0, "uuid": "5eb025fd173da1292f6c42ef9934d3c89ce6a445"}, "author": "Chris Waugh", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/brexit-newcastle-fa-premier-league-15408803", "ord_in_thread": 0, "title": "How new FA proposals for the Premier League will affect who Newcastle United can sign", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "alex livesey/getty images", "sentiment": "none"}], "locations": [{"name": "st. james park", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "premier league", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "invalid email newcastle united", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "fa", "sentiment": "none"}, {"name": "newcastle united and arsenal fc", "sentiment": "none"}, {"name": "football association", "sentiment": "none"}, {"name": "newcastle united fc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How new FA proposals for the Premier League will affect who Newcastle United can sign Premier League clubs, including Newcastle United, will be presented with the FA's proposals on Thursday Share Sport NEWCASTLE UPON TYNE, ENGLAND - SEPTEMBER 15: A general view as players compete for a header during the Premier League match between Newcastle United and Arsenal FC at St. James Park on September 15, 2018 in Newcastle upon Tyne, United Kingdom. (Photo by Alex Livesey/Getty Images) (Image: Getty Images) Get Newcastle United FC updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nNewcastle United will have to ensure that more than half of the 25 players in their Premier League squad are 'homegrown' if the Football Association's post-Brexit proposals are adopted.\nThe Government is yet to finalise a Brexit withdrawal agreement with the European Union, but the FA is already making contingency plans for when the United Kingdom leaves the Bloc on March 31 next year.\nAccording to a report in The Times , English football's governing body wants to restrict the number of overseas players in each 25-man Premier League squad by five, from 17 to 12. Read More How Newcastle United made history with their team selection during the win over Bournemouth\n'Homegrown' players currently include those signed from overseas who have spent three years in English or Welsh club academies by the age of 21 - but, after Brexit, Premier League sides will be unable to recruit under-18 talent from overseas. In theory, this should reduce the number of homegrown players born abroad, though overseas footballers signed aged 18 could still qualify.\nRafa Benitez's Magpies Premier League squad currently boasts 15 non-British players - and United did not have a single England-qualified starter against AFC Bournemouth on Saturday.\nIn fact, Newcastle made history by fielding 14 players representing 14 separate nations during that 2-1 victory over the Cherries. Of the 14 players who played on Saturday, 11 hailed from outside of the British Isles - although Ciaran Clark qualifies as 'homegrown', even though he represents the Republic of Ireland, because he was born in London and came through an English academy.\nThe FA is expected to put its proposals to Premier League chief executives at a shareholder meeting for English's top flight in London on Thursday - currently 13 clubs, including Newcastle, have more than 12 overseas players in their squads - which Magpies managing director Lee Charnley is expected to attend. Although it is unclear when exactly such regulations would be implemented, they are unlikely to be introduced until after the end of the 2019/20 campaign. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nNewcastle's stance on the proposals will be intriguing because, although the Magpies would need to cut three overseas players from their 25-man squad, United have been looking to recruit a greater proportion of young, British talent in recent seasons. Yet, attempting to implement such a strategy has proven problematic, given that the majority of Newcastle's recruits over the past few transfer windows - such as Martin Dubravka, Ki Sung-yueng, Yoshinori Muto, Salomon Rondon and Federico Fernandez - do not qualify as 'homegrown'.\nJust as the Government is under increasing pressure to secure a deal with the EU over a Brexit withdrawal deal, time is also running out for the FA and the Premier League to come to an agreement about the ramifications of the UK's withdrawal from the Bloc for English football.\nThe Times outlines a so-called \"nightmare 'no-deal' scenario', whereby all EU players - who can currently ply their trade in England without a work permit - would have to fulfil the criteria of non-European players in order to practise their craft in Britain.\nInterestingly, the report also claims that the FA will look to garner support from Premier League clubs for its increase in homegrown players within squads by offering to help English top-flight teams sign foreign players more easily. Newcastle United's Ciaran Clark qualifies as 'homegrown', despite representing the Republic of Ireland (Image: Newcastle Utd via Getty Images)\nCurrently, for non-EU players clubs must apply to the FA for a 'governing body endorsement' (GBE) in order to gain a work permit, a process which is largely dependent upon international appearances or the value of a transfer.\nHowever, the FA is seemingly willing not only to help Premier League clubs sign EU players just as seamlessly as they do now, but also make it far easier to recruit global talent.\nEvidently the Premier League is keen for English top-flight clubs to continue to be able to sign EU players as easily as they can now. In a statement, the Premier League said: “Like many organisations dependent on a combination of domestic and international talent, we are waiting to better understand what the political and regulatory landscape will be after the UK leaves the European Union.\n“Access to talented footballers from Europe has played a key part in the growth of the Premier League, with attendance and global interest increasing as high-quality foreign players have taken their place in the competition with [alongside] the best British and Irish players.” Read More Nationality of Newcastle United's first-team players - and if they qualify as 'homegrown':\nAchraf Lazaar - Morocco", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://www.thetimes.co.uk/article/brexit-plan-to-limit-players-from-abroad-at-premier-league-clubs-2jv5mswfb", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-13T15:00:00.000+02:00", "crawled": "2018-11-13T19:38:00.041+02:00", "highlightTitle": ""}