{"organizations": [], "uuid": "12cf3309b85d6cdc0828ba78c6bb1f0c20224eee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10177997.ece/ALTERNATES/s1200/CS76949013.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/richard-scudamore-premier-league-newcastle-15414654", "country": "GB", "domain_rank": 21960, "title": "Will Newcastle United pay £250,000 towards Richard Scudamore's £5m Premier League leaving bonus?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-14T13:57:00.000+02:00", "replies_count": 0, "uuid": "12cf3309b85d6cdc0828ba78c6bb1f0c20224eee"}, "author": "Chris Waugh", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/richard-scudamore-premier-league-newcastle-15414654", "ord_in_thread": 0, "title": "Will Newcastle United pay £250,000 towards Richard Scudamore's £5m Premier League leaving bonus?", "locations": [], "entities": {"persons": [{"name": "richard scudamore", "sentiment": "neutral"}, {"name": "bruce buck", "sentiment": "none"}, {"name": "lee charnley", "sentiment": "none"}, {"name": "scudamore", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "neutral"}, {"name": "invalid email newcastle united", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "newcastle united fc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Will Newcastle United pay £250,000 towards Richard Scudamore's £5m Premier League leaving bonus? All 20 Premier League clubs, including Newcastle United, have been asked to pay towards a controversial bonus Share Chief Executive of Premier League Richard Scudamore Get Newcastle United FC updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nNewcastle United fans are not the only ones outraged by the proposal that departing Premier League executive chairman Richard Scudamore will be given a £5million bonus - with some of the clubs also expressing reservations at the idea, too.\nRepresentatives from all 20 top-flight clubs will meet in London on Thursday for a shareholders' meeting - with Newcastle managing director Lee Charnley expected to attend - during which they will be asked to pay £250,000 towards a seven-figure bonus for Scudamore, whose leaving do also takes place this week.\nChelsea chairman Bruce Buck proposed the farewell gift in recognition of Scudamore delivering huge TV windfalls and the league’s progression over two-decade tenure. The UK television rights were valued at around £670m when he joined, and the last deal was worth £5.14bn - while the growth in lucrative overseas broadcast revenue has also increased exponentially. Read More Newcastle United asked to pay £250,000 towards Richard Scudamore's leaving bonus - but will they agree?\nUndoubtedly Scudamore has been instrumental in ensuring the Premier League has become the wealthiest football division in the world, yet the notion that a man who is reportedly paid £2.5m a year after bonuses be given a golden handshake upon his departure has drawn ire from fans across England.\nBut supporters are not alone in questioning the proposal, with five clubs reportedly set to oppose the idea.\nAlthough it is unclear which way Newcastle will vote if the plan is tabled at the meeting, the Magpies hierarchy are understood to hold reservations. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nNot only would the club be reluctant to pass on £250,000 following a summer transfer window in which Newcastle made a profit but, more pertinently there is a feeling that such a move goes against some of the ideals which has led to support for the NUFC Food Bank, their own Foundation, and other charitable means.\nIn theory, the Premier League needs 14 of the 20 clubs to agree to the proposal - so, if only five voted against, then it could still pass - yet the organisation rarely announces such important measures without unanimity among its members. That is why the vote earlier in the year on the redistribution of overseas TV rights was so contentious, because two clubs rejected it and would not change their stance.\nThe negative publicity which has come on the back of the news that Scudamore could be given a £5m retirement bonus could yet see the proposal shelved, or at the very least altered. Read More VAR, Brexit and a new chief exec: Key Premier League issues which Newcastle will debate this week\nScudamore himself may even refuse to accept the money if it is offered to him, or the proposal could be altered so that it is donated to charity or towards grass-roots football projects.\nCertainly there will be strong views aired opposing the payment at the shareholders' meeting at the very least. poll loading Should Richard Scudamore get a £5million leaving bonus? 1000+ VOTES SO FAR", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://mab.data.tm-awx.com/rhs&quot;,&quot;modularCss&quot;:&quot;true&quot;,&quot;newslettersURL&quot;:&quot;https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/&quot;,&quot;nativeAppBanner&quot;:&quot;true&quot;}}}"], "published": "2018-11-14T13:57:00.000+02:00", "crawled": "2018-11-14T16:27:33.006+02:00", "highlightTitle": ""}