{"organizations": [], "uuid": "04f19ff4db5a1fc41e44770b3bbab77d91e0c844", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15403212.ece/ALTERNATES/s1200/0_JS167270642.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15403159", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Diageo to sell 19 drinks brands in deal worth $550m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-12T10:30:00.000+02:00", "replies_count": 0, "uuid": "04f19ff4db5a1fc41e44770b3bbab77d91e0c844"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15403159", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Diageo to sell 19 drinks brands in deal worth $550m", "locations": [], "entities": {"persons": [], "locations": [{"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "diageo", "sentiment": "negative"}, {"name": "jonathon manning rbs", "sentiment": "negative"}, {"name": "pa", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "revealed.the press association", "sentiment": "none"}, {"name": "ppi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning RBS paid contractors £400 a day to stuff envelopes\nRoyal Bank of Scotland paid contractors a staggering £400 a day to stuff envelopes, wasting thousands of pounds of taxpayers’ money in the process, it can be revealed.The Press Association has learned that the lender, still 62% owned by the Government, paid individuals £330 day plus VAT to carry out mundane tasks such as sending PPI letters to customers.The hefty sums were paid during certain periods in 2017 and this year at an office in Manchester.Those working on the project told PA that they were originally hired to work as specialists, but were then told to put letters in envelopes because of management disorganisation.“It is purely because they have no organisational skills on the project we were on and was a complete waste of taxpayers’ money,” said one contractor who worked on the project, speaking on condition of anonymity.Typical envelope-stuffing jobs are paid at the minimum wage, meaning taxpayers have lost out to the tune of thousands of pounds, although the exact figure is unknown as RBS has not disclosed the total number of people receiving the bumper pay rate.The damning revelations will come as a major embarrassment to RBS chief executive Ross McEwan, who has pledged to cut costs at the lender and stamp out scandals under his watch.In its defence of the bumper wage, RBS said in a statement:\nWe do not hire contractors at this rate to do this type of work. When we employ contractors, they are paid in line with industry rates according to their experience and skills.\nThere have been a limited number of occasions when we have used short-term support from other areas of our business to ensure we are delivering on time and in line with our commitments for our customers.\nSince the financial crisis, RBS has been dogged by furore surrounding the mis-selling of payment protection insurance (PPI), mortgage-backed securities and the mistreatment of small businesses. RBS (Image: Getty Images Europe) 9:20 Jonathon Manning Southern economies in stronger position to grow after Brexit, study claims\nCities in the South of England are expected to have the fastest growing economies after Brexit, according to a new report.\nCambridge, Reading and Milton Keynes are expected to grow by around 2% in the moths following the UK’s exit from the EU, compared to less than 1% in Newcastle and Liverpool.\nLaw firm Irwin Mitchell and the Centre for Economics and Business Research (Cebr) said that southern cities have more skilled workers and are benefiting from investment in transport.\nThe automotive industry, which is a huge part of the economy in the North East and The Midlands, could also be hit after Brexit.\nJosie Dent of the Cebr said:\nWhile the report shows that many cities will face challenges in the aftermath of Britain’s departure from the EU at the end of March, there are also opportunities, especially for cities which are willing to adapt. The EU flag and a Union Jack (Image: PA) 9:15 KEY EVENT Expansion on the cards for Zizzi owner as sales hit £280m\nThe owner of Italian restaurants Zizzi and ASK has revealed a year of strong sales growth as it eyes expansion plans but said its profits were flat after absorbing higher costs.\nAzzurri Group’s sales jumped 8.5% in the year to July, reaching £279.8m , with like-for-like growth across all brands.Underlying earnings were flat at £37m as margins fell from 14.5% to 13.2%.Speaking to the Press Association, chief executive Steve Holmes said it had been “a very challenging year from a cost perspective”.\nHe said:\nToday the consumer is looking for great value.\nSo we’ve been very cautious about putting prices up and worked hard to offset a lot of those costs.\nThe group - which also owns the Coco di Mama and Radio Alice brands - now has 290 branches with plans to open more in the coming year despite a difficult backdrop with several restaurant groups shutting sites this year.Zizzi could now expand abroad following a successful debut in Ireland, where a third site will open by the end of 2018.Meanwhile, coffee and pasta chain Coco di Mama is set to open more sites in London.The Salisbury branch of Zizzi finally reopened last week, eight months after it was caught up in the poisoning of former Russian intelligence agent Sergei Skripal and his daughter Yulia.Mr Holmes said the restaurant had been “very busy” since reopening.Restaurant chains have had a rough year facing food inflation, rising rents and rates, and tough competition.Other Italian chains such as Jamie’s Italian and Prezzo have closed underperforming stores in a bid to improve trading.Commenting on the current market, Mr Holmes said:\nMy view is that the market fundamentals are quite strong, millennials are eating out a bit more, especially at places that provide experiences.\nThere are winners and losers. The winners are the ones that are providing interesting, relevant and different propositions. Zizzi restaurant Saddler Street, Durham (Image: newcastle chronicle) 9:10 Jonathon Manning Big rise in companies seeking Brexit advice, says Newcastle law firm Womble Bond Dickinson\nNewcastle law firm Womble Bond Dickinson has increased its collaboration with a firm in Germany as businesses in the region seek help over the uncertainties surrounding Brexit.\nThe North East firm formed an alliance with Germany’s Redeker Sellner Dahs in 2014, and UK managing partner Jonathan Blair has said his business is now working closer with its EU partner because of the uncertainty surrounding Brexit.\nThe extra work is referred to in the firm’s accounts, which slow a slight rise in turnover for the year ending April 30 but a small firm in operating profit.\nMr Blair said:\nWe are certainly seeing a sharp uptick in Brexit-related queries. It’s primarily companies who have import and export concerns, and commercially driven issues.\nMr Blair also outlined a long-term trend in the increasing use of technology in the law, saying that its WBD Advance unit - which is made up of paralegals, legal executives and data analysts - was providing a cheaper and more efficient service through the use of new technology.\nBut he said the move to automation had to be handled carefully and “clients still value service and good quality legal advice”.\nWomble Bond Dickinson’s UK financial figures remained largely flat for the year, with turnover increasing from a restated figure of £103.2m to £104.9m. Operating profit during the year dipped from £27.1m to £26.8m, while profit after tax fell from £26.55m to £26.48m. Jonathan Blair UK managing partner of Womble Bond Dickinson (Image: Mark Savage Photography) 9:05 KEY EVENT Babcock hunts for publisher of \"anonymous\" analyst report\nDefence supplier Babcock International has hit back at report published by a mystery analyst, claiming the document makes “false and malicious” claims about the firm.\nBabcock, which is the Ministry of Defence’s second largest contractor, saw its shares tumble last month following the release of a report from a firm called Boatman Capital.\nThe report claims that Babcock has a terrible relationship with the MoD, and said the firm had “systematically misled investors by burying bad news about its performance”. It also claimed the engineering group’s chairman Mike Turner and chief executive Archie Bethel, were not up to the job.\nBabcock has said it “strongly refutes” the claims from the “anonymous and so far untraceable” Boatman.\nThe company said:\nThe group continues to seek to discover who is behind Boatman Capital.\nIn a vote of confidence in Babcock, a government spokesman said:\nWe monitor the health of all of our strategic suppliers, including Babcock, and remain committed to working with them on a wide range of programmes.\nBabcock plays a key part in equipping our world-leading armed forces and the MoD spent more than £1.7bn with the company last year, supporting thousands of jobs across the nation.\nBabcock said it was delivering 128 contracts for the Government, with “future opportunities continuing to form a key part of our bidding pipeline”.\nHowever, Babcock said earlier this month that it was closing Appledore shipyard in Devon, and offered to relocate 199 workers. Appledore Shipyard in north Devon which is to close, owners Babcock International announced (Image: Barry Batchelor/PA Wire) 9:00 Jonathon Manning Vacancies harder to fill as fewer migrants look to work in the UK - report\nThe UK’s skill shortage is getting worse due to a “sudden reversal” in the numbers of EU and non-EU migrants working in the country, according to a new report.\nResearch of 1,000 employers suggested that vacancies are becoming harder to fill.\nThe Chartered Institute of Personnel and Development (CIPD) and the Adecco Group said that the lack of skilled workers is causing employers to increase pay.\nThe report claims the shortage is being created as less migrants want to work in the UK.\nGerwyn Davies of the CIPD said:\nThe data implies that the pendulum has swung away from the UK as an attractive place to live and work for non-UK-born citizens, especially non-EU citizens, during a period of strong employment growth and low unemployment.\nThis has heightened recruitment difficulties for some employers. It also underlines the risk that more non-UK-born citizens and employers will be discouraged from using the post-Brexit system if more support is not provided and it is not made simpler, fairer and more affordable; especially for lower-skilled roles.\nAgainst the backdrop of a tight labour market, failure to do this will heighten recruitment difficulties and could lead to negative consequences for existing staff, such as higher workloads, and loss of business or orders for firms.”\nAlex Fleming of the Adecco Group added:\nThe labour market in the UK is tight and this research is reporting increasingly high levels of recruitment and retention difficulties.\nWhile the data is not showing wages rising across the board, we are regularly seeing this pressure being exerted in the recruitment space. Houses under construction (Image: PA) 8:53 Jonathon Manning Hotly-tipped North East firm Flame Heating Group invests in new office as it prepares for growth\nPlumbing and heating merchant Flame Heating Group has invested in a new head office , as the company prepares for further growth.\nThe company has secured a 2,821sq ft building at Boldon Business Park as its new headquarters, replacing the firm’s current base at Team Valley, Gateshead.\nHowever, the firm will continue to run its Team Valley site as its lead branch.\nJohn Savage, managing director of Flame Heating Group, said:\nThis latest investment highlights our commitment to the North East and will set us up perfectly for future growth and expansion, in line with our ambitious three-year strategy.\nThe Boldon location is ideal for our team, providing excellent transport links to our regional branch network and lead trade counter in Team Valley.\nThe entire sale process went very smoothly, largely because of the support and advice offered by Gavin Black & Partners and PG Legal. Both firms understood our aims from the outset and the collaborative efforts have delivered the perfect base for our operations.\nThere is scope for further job creation to support our back office functions and across our extended branch network, as we look to open new outlets throughout the UK. From left: Simon Williams, John Savage and Victoria Brown of Flame Heating (Image: Handout) 8:47", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15403159;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-12T10:30:00.000+02:00", "crawled": "2018-11-12T11:33:06.022+02:00", "highlightTitle": ""}