{"organizations": [], "uuid": "06f3a56d108ecd22a2abc302445b153a619f3482", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article478784.ece/ALTERNATES/s1200/Flags.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/theresa-mays-brexit-withdrawal-agreement-2223752", "country": "US", "title": "Theresa May's Brexit withdrawal agreement simplified - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "06f3a56d108ecd22a2abc302445b153a619f3482"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/theresa-mays-brexit-withdrawal-agreement-2223752", "ord_in_thread": 0, "title": "Theresa May's Brexit withdrawal agreement simplified - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon live theresa may", "sentiment": "none"}, {"name": "neil shaw he", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May's Brexit withdrawal agreement simplified What is the Brexit document? Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 14:15, 15 NOV 2018 Union Flag of the United Kingdom and a European Union flag Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe 585-page draft withdrawal agreement between the UK Government and the EU sets out the proposed terms of Britain's departure from the bloc while avoiding a sudden \"cliff edge\" break.\nThese are the main provisions:\nCitizens' rights\nThe agreement protects the rights of EU citizens living in the UK and the rights of UK nationals at the end of the transition period following the UK's withdrawal from the bloc.\nThey provide for individuals and their family members to continue to live, work or study as they currently do, while maintaining their rights to healthcare, pensions and other social security benefits.\nSeparation issues\nThe agreement seeks to ensure a smooth winding down of the current arrangements between the EU and the UK.\nThey range from police and judicial co-operation and data and information-sharing, to the protection of intellectual property rights and the UK's withdrawal from Euratom, which regulates the nuclear industry and safeguards the transport of nuclear materials.\nTransition period\nThe agreement provides for a period of transition intended to avoid a cliff-edge break and allow businesses to prepare for the new arrangements.\nDuring the transition - which will run initially until the end of 2020 - EU law will continue to apply in the UK and the UK will continue to participate in the customs union and the single market.\nThere is a one-off option for the UK to seek an extension of the transition if negotiations on the future relationship are still continuing.\nFinancial settlement\nThe agreement establishes the mechanism by which the UK's divorce settlement - estimated at £39 billion - is calculated.\nIt covers budget commitments made while the UK was a member state, and ensures no other member state will be required to pay more as a result of the UK's withdrawal.\nGovernance\nThe agreement establishes the institutional mechanisms needed to implement and enforce its provisions.\nThey include the creation of a joint committee to deal with disputes between the two sides, with an option for either side to refer an issue to binding arbitration, while recognising the supremacy of the European Court of Justice in cases involving EU law.\nNorthern Ireland backstop\nThe backstop is intended to prevent the return of a hard border with the Republic of Ireland if there is no agreement in place on the future relationship.\nIt would create a single EU-UK customs territory with the UK continuing to follow EU tariffs and customs rules, avoiding the need for checks between the EU and UK - including between Northern Ireland and the Republic.\nIn addition however, Northern Ireland would be required to remain aligned with some EU single market rules, including legislation on goods, agricultural production, veterinary controls and state aid rules.\nThe agreement makes clear the arrangement is meant to be temporary, but sets no final end date. Ending the arrangement would be by mutual agreement by both sides.\nUK sovereign base areas in Cyprus\nThe agreement protects the rights of Cypriots who live and work in the sovereign base areas following the UK's withdrawal.\nGibraltar\nThe agreement provides for close co-operation between the UK and Spain in relation to Gibraltar and the implementation of the provisions on citizens' rights. Like us on Facebook ", "external_links": [], "published": "2018-11-15T02:00:00.000+02:00", "crawled": "2018-11-15T16:31:17.004+02:00", "highlightTitle": ""}