{"organizations": [], "uuid": "31b70fb0bce432e407b9518814c602a9ec5303a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15418158.ece/ALTERNATES/s1200/0_Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-deal-parliament-latest-live-15418159", "country": "GB", "domain_rank": 21960, "title": "Brexit Secretary resigns LIVE: Dominic Raab quits over Theresa May's agreement as fallout continues", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T09:30:00.000+02:00", "replies_count": 0, "uuid": "31b70fb0bce432e407b9518814c602a9ec5303a7"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-deal-parliament-latest-live-15418159", "ord_in_thread": 0, "title": "Brexit Secretary resigns LIVE: Dominic Raab quits over Theresa May's agreement as fallout continues", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "dominic raab", "sentiment": "negative"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "tusk", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "kathryn riddell european council", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "10:36 Jonathan Walker\nShe says the full legal text of the withdrawal agreement has now been agreed in principle.\n“We have secured the rights of the more than 3m EU citizens living in the UK” and the around 1m UK nationals living in the EU.\nTalking about negotiations on the issue of the border between Ireland and Northern Ireland, she says: “I do not pretend that this has been a comfortable process”.\nBut she insists that any deal with the EU would have to include some sort of arrangement about the border.\n“The EU will not negotiate any future partnership without it.” 10:33 Jonathan Walker\nTheresa May says a special European Council will be called for November 25 and this puts the UK close to a Brexit deal.\nShe says however that what was published yesterday is not the final deal.\n“It takes back control of our borders laws and money.” 10:32 Theresa May speaks to the House of Commons\nPrime Minister Theresa May starts delivering her statement to MPs 10:24 Northumberland MP Anne-Marie Trevelyan resigns as Government aide\nBerwick-upon-Tweed MP Anne-Marie Trevelyan has resigned as a Ministerial aide.\nShe was a PPS, which means she wasn’t actually a Minister but had a role in the Department for Education.\nNow she’s quit.\nAnd like the Ministers who resigned, she did it because she can’t support Theresa May’s Brexit plans. 10:23 Kathryn Riddell Brexit Under Secretary also resigns hours after Raab\nBrexit minister Suella Braverman has resigned from DEXEU just hours after her boss, Dominic Raab, quit as Brexit secretary.\nHers is the fourth resignation this morning.\nShe was appointed as Parliamentary Under Secretary of State at the Department for Exiting the European Union on 10 January. 10:14 Supporters of a 'People's Vote' make their case\nIf Theresa May can’t get Parliament to approve her Brexit deal, what happens next?\nOne option is to hold a second referendum, or People’s Vote, on Brexit. Of course, that’s just one option among many.\nBut supporters of a People’s Vote are pushing for one, following today’s resignations.\nThey include Sedgefield MP Phil Wilson, as you can see from the Tweet below. 10:05 Resignations come every 90 minutes\nThree politicians have resigned so far. Just how closely are they working together?\nThe resignations have come 90 minutes apart, which might suggest they’ve been carefully planned. 10:03 KEY EVENT Another resignation from Cabinet\nWork and Pensions Secretary Esther McVey has resigned saying the Brexit agreement “does not honour the result of the referendum”. Work and Pensions Secretary Esther McVey (Image: PA) 09:57 Michael Gove cancels planned visit\nEnvironment Secretary Michael Gove has cancelled his planned visit to a farming conference in Yorkshire.\nThere has now been some speculation about what this could mean, but Mr Gove is citing personal reasons for the cancellation. 09:45 KEY EVENT Why some are so opposed to the Brexit deal\nSome Brexiteers and Remainers are furious at the deal because it includes clauses that could keep the UK locked in Brussels’ orbit - with no say on its rules.\nA ‘backstop’ plan will kick in - if there is no deal to stop a hard border in Northern Ireland - extending EU customs rules across the whole of the UK.\nThis will stop the UK signing trade deals with other countries around the world. British Prime Minister Theresa May, right, and European Commission President Jean-Claude Juncker (Image: AP)\nAnd not only does the backstop have no clear “end date”, the UK would be stuck in it unless the EU gave its permission for us to quit.\nThe deal also forces some checks on goods travelling between Northern Ireland and the rest of the UK - a red line for the DUP, who say it would break up the precious union.\nAnd in a move that will enrage Tory Brexiteers, European courts will still have a major hold on the UK. 09:33 Kathryn Riddell Further resignations on the way?\nWestminster is braced for further resignations, amid widespread expectations that the Prime Minister may face a challenge to her position from Conservative MPs submitting letters of no confidence in her leadership. 09:25 Kathryn Riddell North East MEP has serious concerns about agreement\nLocal MEP Jonathan Arnott has said that Theresa May should be ashamed of agreeing to the draft Brexit agreement.\nMr Arnott, independent Euro-MP for the North East said:\nI have now read all 585 pages of the draft Withdrawal Agreement. The concerns are serious, so serious as to call into question just what we’re supposed to be getting in return for the £39 billion divorce bill.\nI don’t take the view that this is ‘worse than’ remaining in the European Union, but it is a close-run thing,” said Mr Arnott, Independent Euro-MP for the North East..\nThe Transition Period is scheduled to end in December 2020, as stated in Article 126. However, Article 132 then raises the possibility of extension for many years to come.\nThe direction proposed would keep the UK tied into a customs territory - the Customs Union in all but name - indefinitely. This would make it impossible for us to negotiate realistic, effective trade deals with third countries.\nEU courts would, in all but name, overrule UK courts. This is a natural consequence of two things: firstly, whenever the text requires the UK to adopt measures having identical effect to EU measures, the ultimate arbiters are the EU courts. Secondly, the text requires the UK to ‘have regard to’ EU court decisions. 09:16 Kathryn Riddell Read reasons behind Raab's resignation\nHere is a key extract from Dominic Raab’s resignation letter addressed to the Prime Minister:\nI regret to say that, following the cabinet meeting yesterday on the Brexit deal. I must resign. I understand why you have chosen to pursue the deal with the EU on the terms proposed, and I respect the different views held in good faith by all of our colleagues.\nFor my part, I cannot support the proposed deal for two reasons. First I believe that the regulatory regime proposed for Northern Ireland presents a very real threat to the integrity of the United Kingdom.\nSecond, I cannot support an indefinite backstop arrangement, where the EU holds a veto over our ability to exit. The terms of the backstop amount to a hybrid of the EU customs union and single market obligations. No democratic nation has ever signed up to be bound by such an extensive regime, imposed externally without any democratic control over the laws to be applied, nor the ability to decide to exit the arrangement. That arrangement is now also taken as the starting point for negotiating the future economic partnership. If we accept that, it will severely prejudice the second phase of negotiations against the UK.\nAbove all, I cannot reconcile the terms of the proposed deal with the promises we made to the country in our manifesto at the last election. This is, at its heart, a matter of public trust. 08:59 BREAKING: Brexit Secretary Dominic Raab resigns\nBrexit Secretary Dominic Raab has announced he is resigning. Brexit Secretary, Dominic Raab (Image: Getty Images Europe)\nHe has tweeted his resignation letter and said: “Today, I have resigned as Brexit Secretary. I cannot in good conscience support the terms proposed for our deal with the EU. Here is my letter to the PM explaining my reasons, and my enduring respect for her.”\nThis is the second Brexit Secretary, after David Davis, who has quit the position. 08:55 Kathryn Riddell European Council president receives Brexit deal document\nEuropean Council president Donald Tusk has set out the process leading up to a Brussels summit of EU leaders on November 25 at which the UK’s withdrawal agreement will be finalised and formalised.\nAt a press conference in Brussels, Mr Tusk was presented by the EU’s chief negotiator Michel Barnier with a copy of the 585-page agreement approved on Wednesday by Theresa May’s Cabinet. European Council President Donald Tusk (Image: Getty Images Europe)\nMr Tusk said that the agreement was already being analysed by all the member states, and by the end of this week the EU27 ambassadors will meet in order to share their assessment.\n“I hope that there will not be too many comments,” he said. 08:47 Kathryn Riddell Nicola Sturgeon believes Theresa May will be gone by March\nNicola Sturgeon has said she “wouldn’t put money” on Theresa May being in Number 10 by the time the UK leaves the EU.\nIt comes as the Prime Minister is braced for a furious backlash from Tory Brexiteers over the withdrawal agreement’s content. First Minister Nicola Sturgeon (Image: Handout)\nMs Sturgeon had voiced her dissatisfaction with the deal, but has now gone on to say Ms May could lose her position by March 29.\nShe told ITV’s Peston programme: “The Prime Minister has proved to be resilient over the last months, so let’s not count her out in that respect.\n“I thought her language about the collective decision of the Cabinet - not a unanimous decision - said something.\n“I thought her body language looked very shaky, and I wouldn’t rule out Cabinet resignations tonight.\n“I cannot see how she gets this deal through the House of Commons.” 08:36 Kathryn Riddell What if the deal is rejected by Parliament?\nIf MPs do not vote for the PM’s deal then the UK defaults to a no-deal Brexit.\nSuch a scenario could trigger a crisis in the financial markets, plummeting sterling and adding to an unprecedented political crisis. 08:27 KEY EVENT What happens next?\nTheresa May due to give a statement to Parliament on the 500-page Brexit deal, allowing MPs to finally question her for the first time.\nThen on Sunday 25 November there is set to be an emergency EU summit with 27 other leaders to sign off the deal.\nThis will be ‘danger moment’ number two for the Prime Minister, when she has to face down pro-EU leaders like Emmanuel Macron and Angela Merkel.\nBut it’s likely she’ll face more trouble at home than in Brussels, where EU officials have already spent months working out the detail. 08:16 KEY EVENT Read Mrs May's statement outside Number 10\nYou can read Mrs May’s full statement that she made outside Number 10 on Wednesday night.\nThe Cabinet has just had a long, detailed and impassioned debate on the draft withdrawal agreement and the outline political declaration on our future relationship with the European Union.\nThese documents were the result of thousands of hours of hard negotiation by UK officials and many, many meetings which I and other ministers held with our EU counterparts.\nI firmly believe that the draft withdrawal agreement was the best that could be negotiated and it was for the Cabinet to decide whether to move on in the talks.\nThe choices before us were difficult, particularly in relation to the Northern Ireland backstop, but the collective decision of Cabinet was that the Government should agree the draft withdrawal agreement and the outline political declaration.\nThis is a decisive step which enables us to move on and finalise the deal in the days ahead.\nThese decisions were not taken lightly but I believe it is a decision that is firmly in the national interest.\nWhen you strip away the detail, the choice before us is clear: this deal, which delivers on the vote of the referendum, which brings back control of our money, laws and borders, ends free movement, protects jobs, security and our Union; or leave with no deal, or no Brexit at all.\nI know that there will be difficult days ahead. This is a decision which will come under intense scrutiny, and that is entirely as it should be and entirely understandable.\nBut the choice was this deal, which enables us to take back control and to build a brighter future for our country, or going back to square one with more division, more uncertainty and a failure to deliver on the referendum.\nIt is my job as Prime Minister to explain the decisions that the Government has taken and I stand ready to do that, beginning tomorrow with a statement in Parliament.\nIf I might end by just saying this: I believe that what I owe to this country is to take decisions that are in the national interest.\nAnd I firmly believe, with my head and my heart, that this is a decision which is in the best interests of our entire united Kingdom. 08:08 Kathryn Riddell May will have to convince EU leaders and Parliament\nWhen the numbers are crunched, it is clear that Mrs May will have her work cut out to convince enough MPs to support her EU exit strategy.\nNow that a draft deal has been agreed between the EU and UK, there are three hurdles to overcome. Prime Minister Theresa May speaking during Prime Minster's Questions in the House of Commons, London (Image: PA)\nThe first is Cabinet, the second is 27 EU leaders, and the third and hardest is the UK Parliament.\nEven though they disagree on the reasons why, they could band together and vote down the deal - defeating Theresa May.\nIf 318 MPs came together against the deal, that would be enough to defeat the PM. 07:57 Kathryn Riddell First resignation by minister\nMP Shailesh Vara has quit as Northern Ireland Minister, saying he cannot support Theresa May’s Brexit agreement, which he said “leaves the UK in a halfway house with no time limit on when we will finally be a sovereign nation”. 07:51 Kathryn Riddell Some of the major points from the Brexit deal\nIn case you haven’t had the time to read through the whole 585-page document, what is in the Brexit deal? We’ve taken a closer look. The transition period can be extended - and we don’t know how long for Goods face being checked between Northern Ireland and the rest of the UK We need the EU’s permission to quit the ‘backstop’ European courts will still have a big hold on the UK There is still a lot of negotiation to go 07:42 Kathryn Riddell Emergency summit to be held\nEuropean Council president Donald Tusk says an emergency summit will be held on 25 November in Brussels to discuss the draft Brexit agreement reached between the EU and the UK. 07:36 Kathryn Riddell More updates as Theresa May takes Brexit deal to Parliament\nGood morning and welcome to our blog bringing you more live updates from the Brexit deal proposal and reaction.\nThe Prime Minister cleared the first hurdle when Cabinet ministers finally approved the draft terms of her agreement with Brussels at a stormy five-hour meeting on Wednesday.But she now faces a battle to get it through Parliament as pro-Leave Conservative MPs - as well as some Remainers - lined up to condemn the plan, accusing her of breaking promises and leaving the UK at the mercy of Brussels. Prime Minister Theresa May makes a statement outside 10 Downing Street (Image: PA)\nThe outline political declaration - which will be subject to further negotiation over the coming weeks - expresses an ambition to achieve zero tariffs and no quotas in EU-UK trade, something the officials said no other major economy had achieved.\nUnder backstop arrangements designed to keep the Irish border open, if no trade deal is agreed by the end of the transition period in December 2020, a temporary “EU-UK single customs territory” would be established.\nChief Whip Julian Smith has said he is confident the Government will get the support of Parliament for the deal.But with the DUP - whose 10 MPs prop up Mrs May in the Commons - voicing their unhappiness at the agreement, and the prospect of a significant Tory backbench revolt it is hard to see how ministers can make the numbers add up. More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15418159;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-11-15T09:30:00.000+02:00", "crawled": "2018-11-15T11:17:04.005+02:00", "highlightTitle": ""}