{"organizations": [], "uuid": "aa344ccbb2bd5a49fe01c15e291e923a886a2491", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14982859.ece/ALTERNATES/s1200/0_Integrated-Communities-Strategy-proposal.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/bright-tribe-trust-sunderland-northumberland-15442073", "country": "GB", "domain_rank": 21960, "title": "Academy chain which ran North East schools failed to manage asbestos, new chief executive admits", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-20T23:00:00.000+02:00", "replies_count": 0, "uuid": "aa344ccbb2bd5a49fe01c15e291e923a886a2491"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/bright-tribe-trust-sunderland-northumberland-15442073", "ord_in_thread": 0, "title": "Academy chain which ran North East schools failed to manage asbestos, new chief executive admits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Academy chain which ran North East schools failed to manage asbestos, new chief executive admits Bright Tribe Trust ran academies in Northumberland and Sunderland Share Students in a classroom (Image: PA) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nAn academy chain that ran North East schools failed to manage asbestos in buildings, the new chief executive has admitted.\nAngela Barry, acting Chief Executive at Bright Tribe Trust, told a Commons inquiry: “The asbestos management in all of the Bright Tribe schools was not as it should have been.”\nThe trust, which is due to close, currently operates Grindon Hall Christian School in Sunderland . Ms Barry said “a couple” of school trusts were currently looking at whether they could take Grindon Hall over.\nIt also ran Haltwhistle Upper and Lower Schools in Haltwhistle, Northumberland , which were taken over by the WISE Academies chain on September 1.\nThe trust also ran schools in Cumbria and the south of England.\nIt was announced in July that Bright Tribe was to close. And an investigation by BBC Panorama broadcast in September revealed that the Trust’s new trustees were investigating allegations that the chain made false claims for building and maintenance grants. Read More Sir Keir Starmer: Labour could try to bring down the Government to block no-deal Brexit\nIt claimed that Bright Tribe received public money for building work, lighting upgrades and fire safety improvements that were not finished or never started.\nMs Barry, took over the trust in September, said maintenance of school buildings had not been adequate because responsibility was taken away from local managers.\nShe said: “Part of that was because ... the facilities management had been taken out of the hands of the local schools and was taken by Bright Tribe facilities management.\n“We’ve now put that back into the schools.”\nThe Trust had received £1 million in “northern hub” funding from the government in 2015, to “drive up standards” in schools in the north of England.\nAnd it was named as the preferred sponsor for underperforming schools in Northumberland, Sunderland and County Durham.\nBut an investigation by the Education Funding Agency reported in November 2016 that Bright Tribe had breached rules by making payments to too many of its trustees. Read More\nIn 2016, Bright Tribe pulled out of plans to take over Fyndoune community college, in Sacriston, County Durham, and Durham community business college.\nAnd in 2017 it withdrew from plans to sponsor Haydon Bridge High School in Northumberland.\nThere has been particular concern about the Trust’s management of Whitehaven Academy in Whitehaven, Cumbria.\nIn 2017 an MP, Trudy Harrison, said she was escorted off the premises after visiting the school and discovering flooded classrooms, broken windows, water damage and an “unbearable” smell of damp.\nMs Barry, who was bought in by the Government to deal with the Trust’s problems and oversee the transfer of schools, said she was “hugely embarrassed” by what had happened at the Trust. Read More Northumberland MP Anne-Marie Trevelyan threatens to send letter of no-confidence in Theresa May\nShe said: “I know that the interim team, when I say the interment I mean the board, interim COO [Chief operating officer] and myself, professionally are embarrassed for any mistakes that have been made in the past by those not in post now.\n“Professionally I would like to apologise on their behalf.\n“I am here now to do the best job I possibly can for all the stakeholders whether they be little people or big people in our schools.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-20T23:00:00.000+02:00", "crawled": "2018-11-21T00:03:54.001+02:00", "highlightTitle": ""}