{"organizations": [], "uuid": "c11f5bbc5eb557dfcfd14e81d3a482ee87398530", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13801513.ece/ALTERNATES/s1200/IBP_NEC_111017traffic_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/transport-spending-north-east-third-15449663", "country": "GB", "domain_rank": 21960, "title": "Transport spending in North East a third of London's - and gap is getting wider", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-22T15:00:00.000+02:00", "replies_count": 0, "uuid": "c11f5bbc5eb557dfcfd14e81d3a482ee87398530"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/transport-spending-north-east-third-15449663", "ord_in_thread": 0, "title": "Transport spending in North East a third of London's - and gap is getting wider", "locations": [], "entities": {"persons": [], "locations": [{"name": "birtley", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "london crossrail", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "treasury", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Heavy traffic on the A1 southbound near Birtley (Image: Newcastle Chronicle)\nThe Government spends three times as much per head on transport in London as it does in the North East, while other services to boost the economy are also lagging behind.\nFigures released by the Treasury have revealed the total amount of public spending in the regions and countries of the UK on a range of services, including transport , economic development and education.\nThe data shows a major gap between London and the rest of the country in a number of areas, with the North East getting £320 per head spent on transport compared to £1,019 in London.\nThat gap in transport spending has increased by more than £250 over the last five years, and will reignite the controversy that erupted in the summer when Transport Secretary approved big spending on the next London Crossrail project just days after downgrading rail improvements in the North.\nIn addition to the spending on transport, the North East receives just £91 per head on enterprise and economic development while London gets £161 and the South East receivees more than double the figure at £203.\nLuke Raikes, senior research fellow at the IPPR North think tank, which has campaigned for more transport investment in the region, said: “Today’s figures show us that Government still needs to follow through on their promises to make the Northern Powerhouse a reality. Read More North East's largest 200 companies unveiled at annual Top 200 event\n“An increase in spending in the North West in the past year is very welcome, but the North East and Yorkshire and the Humber are yet to see such a boost, and investment in the North still pales in comparison to spending in London.\n“People are continuing to suffer the very real effects of decades of underinvestment, and the ongoing chaos on Northern trains is a clear sign of how far there is to go.\n“The Northern Powerhouse has the potential to improve the whole country by transforming the North’s economy. In realising this, transport has an important role to play in helping to connect people, services and goods across the region.”\nMarianne O Sullivan, policy adviser at the North East Chamber of Commerce, said: “The Chamber will be campaigning for a reform in Treasury rules on infrastructure spending to ensure that funding is also given to areas such as the North East where there is high development potential rather than focusing on overheating developed economies in the UK.\n“The Government did announce in the Budget that it will publish a National Infrastructure Assessment in 2019, this is an opportunity for the Government to increase key transport and infrastructure in the North and truly back the creation of a Northern Powerhouse.”\nOverall, the North East is ranked fifth out of 12 regions and nations in terms of Government spending, behind London, Scotland, Wales and Northern Ireland, but ahead of all of the other English regions.\nThe spending received by the North East is skewed by having the highest welfare payments and one of the highest levels of health spending, however. Read More North East could fall further behind south after Brexit, new report warns\nA Department for Transport spokesperson said: “This Government is delivering a record £13bn to transform transport across the North by 2020.\n“We are investing heavily in strategic roads for the Northern Powerhouse, spending almost £3bn to make trips faster and more reliable for both people and freight. Projects include the M62 between Leeds and Manchester which is being upgraded to a 4-lane smart motorway.\n“Our priority is to boost economic growth by cutting journey times, increasing the number of seats on trains and improving the region’s road network.”\nShe added that the North East had been shortlisted for potential funding from the Transforming Cities Fund for proposals to drive up productivity and tackle congestion. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-22T15:00:00.000+02:00", "crawled": "2018-11-22T23:59:07.004+02:00", "highlightTitle": ""}