{"organizations": [], "uuid": "d5d4ed6d95fa6f9459c1ab0a344c9cde667dee1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15214985.ece/ALTERNATES/s1200/1_Popular-Smart-Phone-Apps-Of-2016.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15351353", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Facebook loses a million users across Europe as growth slows", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-31T09:46:00.000+02:00", "replies_count": 0, "uuid": "d5d4ed6d95fa6f9459c1ab0a344c9cde667dee1e"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15351353", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Facebook loses a million users across Europe as growth slows", "locations": [], "entities": {"persons": [{"name": "jonathon manning santander", "sentiment": "negative"}, {"name": "william hill", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}, {"name": "nathan bostock", "sentiment": "none"}, {"name": "green", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "santander bank jonathon manning william hill", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Santander takes a hit to its profits\nBanking giant Santander hasreported a 13% fall in its UK pre-tax profits to £1.4bn for the nine months ending September.\nThe group said the profits fall came as the firm saw a 6% drop in net interest income after making less money on its mortgage book.\nSantander said it expects UK economic growth to improve slightly and inflation to continue to ease.\nNathan Bostock, chief executive of Santander, said:\nIn an uncertain environment, we continue to control business growth, prioritising credit quality while delivering for our customers.\nWe remained focused on earning customer loyalty through compelling products and excellent customer service.\nIn a highly competitive market, we continued to support customers and have grown net mortgage lending while maintaining our rigorous underwriting approach.\nOur results reflect competitive income pressures and higher regulatory project costs, as well as the impact of ring-fence transfers. Santander Bank Jonathon Manning WIlliam Hill bets on Mr Green for online growth\nBookmaker WIlliam Hill is set to acquire Swedish online betting firm Mr Green & Co for £241m.\nWilliam Hill said yesterday that it will offer 69 Swedish Krona (£5.90) in cash per share for the Stockholm-listed company, a 48.5% premium on its closing price on October 30.\nMr Green operates in 13 markets under brands including Redbet, and holds gambling licences in Denmark, Italy, Latvia, Malta, the UK and Ireland. It also plans to operate in Sweden by the end of the year.\nWilliam Hill chief executive Philip Bowcock said:\nThis proposed acquisition accelerates the diversification of William Hill - immediately making us a more digital and more international business.\nMr Green will provide William Hill with an international hub in Malta, with market entry expertise and strong growth momentum in a number of European countries.\nWilliam Hill will move from a single brand to a suite of brands that can maximise growth opportunities moving forward in new and existing markets. William Hill shop branding Jonathon Manning Landlord evicts Sanderson Young from Alnwick office - but firm plans to reopen\nSanderson Young is opening a new agency branch in a Northumberland market town – six days after its landlords took back its old branch .\nThe estate agency came close to collapse last month after the firm entered administration and it was revealed it owed thousands to HMRC.\nFounded in 1999 by Duncan Young, it now operates five offices – four in the North East and one in Mayfair, London – after Mr Young’s wife Alison, bought the business out of administration.\nThe firm is now owed by DG Young Limited and is managed by Mr Young. Alison Young is the company’s sole director.\nIts Alnwick branch, however, is swiftly relocating to a new base in the town after landlords Warcup Law Firm re-entered the high street property on October 24, posting a sign that the estate agent had failed to meet its lease agreements.\nIt reads:\nTake notice that the landlord has today re-entered 31-33 Bondgate Within, Alnwick, Northumberland, in accordance with the landlord’s power under clause 13 of the lease. As a consequence of the re-entry, the lease is forfeited and the premises have been secured.\nAnd take notice that no one can lawfully enter the premises unless they have given authorisation by the landlord.\nMr Young says he is “fully aware of the need to have an office in Alnwick” and said he will be opening a new branch at Bondgate Within this week.\nHe said:\nWe are relocating to another office and we are opening tomorrow. The lease ran out at the end of October. We asked for an extension but the landlord said no, and they have already arranged for a new tenant to come in.\nWe would have liked to stay for another week to allow us to move smoothly from one office to another.\nCommenting on Sanderson Young’s breach of its lease, Mr Young said:\nThat is to do with the administrators. The administrators took over the old office. I understand the administrators didn’t know whether we wanted to keep the branch or leave it.\nWe are happy to leave it as it is not the right one for us in the long term. We have been looking at other branches for some time. Sanderson Young's branch in Alnwick (Image: Google Maps) 8:40 KEY EVENT Mike Ashley buys Evans Cycles and plans to close half its stores\nBillionaire Mike Ashley has snapped up Evans Cycles and revealed plans to close around 30 of the chain’s 62 stores.\nThe business, which had been seeking a new owner, went into administration on Tuesday and was then immediately sold as part of a pre-pack administration to three companies controlled by Sports Direct.\nEvans Cycles employs around 1,300 staff and has two stores in the North East: the Metrocentre in Gateshead, and the Abbey Road Business Park at Durham.\nBut Mr Ashley said half of the stores would be shut, putting hundreds of jobs at threat.\nMatt Callaghan, joint administrator and PwC partner, said:\nWe are delighted to have secured a future for the business and employees of Evans.\n2018 has been a very difficult trading year for the business, in part due to the impact of the extended winter weather, but also due to a lack of cash to invest in stores and develop the e-commerce platform.\nA combination of the associated losses, the capex requirements and tightening credit has led to a liquidity crunch.\nSports Direct said that it would only be able to keep half the stores open, meaning hundreds of jobs are now at risk.\nChief executive Mike Ashley said:\nWe are pleased to have rescued the Evans Cycles brand. However, in order to save the business we only believe we will be able to keep 50% of stores open in the future. Unfortunately some stores will have to close. An Evans Cycles store (Image: PA) 8:37 Jonathon Manning Next sticks to full-year forecasts despite Autumn sales growth slump\nRetailer Next has seen sales growth slow in its third quarter as both high street and online trading eased back.The fashion and homewares chain reported a 1.3% rise in full-price sales for the three months to October 27 - up 2% including interest income from nextpay customers.It said high street retail sales tumbled 8%, while online sales rose by 12.7%.The result marks a slowdown on the 4.5% rise in full-price sales seen in its first half.It comes after the latest figures from the Confederation of British Industry (CBI) showed retail sales growth slowed more than expected in October as consumers reined in their spending following a summer shopping spree driven by warm weather and the World Cup football tournament.However, Next kept its full-year guidance unchanged, with the group pencilling in annual sales growth of 3% and a 0.1% rise in group pre-tax profit to £727m.The group upped its full-year profit guidance in September after a better-than-expected first half, posting interim pre-tax profits up 0.5% at £311.1m.But last month’s earnings cheer came as it also warned over the threat of gridlock at ports and price hikes from increased tariffs if the UK crashes out of the European Union with no deal.In the document outlining the group’s Brexit no-deal contingency plans, Next also cautioned that another sharp fall in the value of the pound and increased tariffs also posed a threat.Next said in the “unlikely event” that free-trade agreements were not put in place, it could send the cost of imported goods soaring by up to around £20m, which could push up prices by around 0.4%. Next store on the retail park Team Valley, Gateshead (Image: Newcastle Chronicle) 8:31 KEY EVENT Eldon Square buyers granted more time to mull £2.8bn bid\nA consortium attempting to acquire Intu - the owner of the Metrocentre and Eldon Square shopping centre - has been granted more time to make an offer or pull out of the £2.8bn deal.\nThe Takeover Panel said yesterday that the consortium, led by John Whittaker’s Peel Group, now has until 5pm on November 15 to make a decision.\nAlong with the two North East properties Intu owns a further 16 shopping centres across the UK including the Trafford Centre in Manchester.\nIn a statement Intu said:\nIn response to a request from the consortium to extend the above deadline to enable continued discussions, the board of Intu requested that the panel extend the deadline referred to above with respect to the consortium.\nAccordingly, an extension has been granted.\nTwo of the consortium members, Peel Group and Olayan Group, already hold a 29.9% stake in Intu.\nIntu’s portfolio was vlaued at £9.58bn as of September 30. Intu Eldon Square (Image: Tony Hall Photography) 8:27 Jonathon Manning Warning as companies going out of business hits four-year high\nA four-year high in companies going out of business highlights a number of underlying problems in the economy, a North East expert has said.\nNew figures from the Insolvency Service has shown there were 4,308 company insolvencies in the third quarter of 2018, a 19% increase on the same period last year and the first time the figure has gone above the 4,000 mark since 2014.\nAndrew Haslam, North East chair of the insolvency trade body R3, said the outlook for many businesses in the region was difficult as Brexit, the crisis on the High Street and other factors have begun to bite.\nHe said:\nThe key causes of insolvencies seen by the insolvency profession are familiar. Rates problems, particularly for retailers, are frequently mentioned, and the Chancellor’s rates-relief announcements in the Budget have come too late for some.\nIt’s worth noting that high profile insolvencies can have a knock-on effect for others, too. For every struggling retailer unable to pay its debts, there will be numerous suppliers as well as shop-fitting or delivery firms who come under pressure, while there have been well-publicised troubles in sectors like construction, too.\nR3 members have picked up on a number of extra concerns recently. Uncertainty over the shape Brexit will take has led to decision-making delays at some large companies, which will have had an impact on their smaller suppliers expecting new contracts or investment. Andrew Haslam, chair of R3 in the North East and head of FRP Advisory LLP’s Newcastle office (Image: Publicity Pic) 8:21", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15351353;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-31T09:46:00.000+02:00", "crawled": "2018-11-01T01:37:02.009+02:00", "highlightTitle": ""}