{"organizations": [], "uuid": "ee743144bd57efdccff0847d131edb27b32fd037", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15437230.ece/ALTERNATES/s1200/0_Universal-Credit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/amber-rudd-un-universal-credit-15437235", "country": "GB", "domain_rank": 21960, "title": "DWP minister Amber Rudd slams UN poverty report - but admits Universal Credit has 'problems'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-19T20:11:00.000+02:00", "replies_count": 0, "uuid": "ee743144bd57efdccff0847d131edb27b32fd037"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/amber-rudd-un-universal-credit-15437235", "ord_in_thread": 0, "title": "DWP minister Amber Rudd slams UN poverty report - but admits Universal Credit has 'problems'", "locations": [], "entities": {"persons": [{"name": "amber rudd", "sentiment": "negative"}, {"name": "rudd", "sentiment": "none"}, {"name": "ms rudd", "sentiment": "none"}, {"name": "philip alston", "sentiment": "none"}, {"name": "margaret greenwood", "sentiment": "none"}], "locations": [{"name": "west end", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "un", "sentiment": "negative"}, {"name": "universal credit", "sentiment": "negative"}, {"name": "dwp", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nAmber Rudd has dismissed a special report which looked at poverty levels in Newcastle but admitted there are \"problems\" with Universal Credit.\nUN special rapporteur Philip Alston visited the West End food bank on November 7 as part of a 12-day tour of the country investigating deprivation.\nHe accused the Government of being \"in a state of denial\" over the extent of poverty nationally and was critical of the new benefits regime.\nSpeaking in the Commons, Ms Rudd, the new Work and Pensions Secretary, said the report was \"extraordinarily political\" but accepted Universal Credit \"can be better\".\nResponding to comments about the report by shadow work and pensions secretary Margaret Greenwood, Ms Rudd said she had read it and was \"disappointed\" by the \"nature of the language\". Read More United Nations investigator sees first hand the devastation Universal Credit is having on poor families\nShe added: \"We are not so proud that we don't think we can learn as we try to adjust Universal Credit for the benefit of everybody but that sort of language was wholly inappropriate and actually discredited a lot of what he was saying.\"\nMr Alston's report said poverty in the UK amounted to a \"social calamity\" which is being driven by the introduction of Universal Credit.\nThe controversial new payment will replace six types of benefit but its implementation has been beset by technical problems and its has come in for scathing criticism from campaigners. Philip Alston chats to centre users Michael Hunter and mum Denise during a visit to the West End Foodbank (Image: Newcastle Chronicle)\nMs Rudd, who returned to the cabinet when she replaced Brexit-rebel Esther McVey last week, defended the new system but acknowledged there are problems.\nShe said: \"Three days in and I know that the Department for Work and Pensions is a force for good, helps people in need, helps people into work, out of poverty, gives support at the end of their lives.\n\"This is what we want for our families, our friends, our neighbours - this is the country, this is who we are.\n\"It is good that employment has risen to record levels of 75% as stated just recently. Read More 'A social calamity' - A UN poverty expert's verdict on Universal Credit after Newcastle visit\n\"But I know there are problems with Universal Credit despite its good intentions. I've seen them for myself.\n\"I will be listening and learning from the expert groups in this area who do so much good work. I know it can be better.\n\"I will make it my role to ensure that we deliver that through our discussions within the DWP and through discussions with Treasury. We will have a fair, compassionate and efficient benefits system.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-19T20:11:00.000+02:00", "crawled": "2018-11-20T02:32:41.004+02:00", "highlightTitle": ""}