{"organizations": [], "uuid": "ee1f310e0fdb218315b4062aa503394cee06fc4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15377538.ece/ALTERNATES/s1200/0_ThyssenKrupp-Workers-Protest-Against-Planned-Fusion-With-Tata-Steel.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/thyssenkrupp-boss-warns-uk-jobs-15404479", "country": "GB", "domain_rank": 21960, "title": "Thyssenkrupp boss warns UK jobs could be hit by Tories' poor handling of Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-12T14:37:00.000+02:00", "replies_count": 0, "uuid": "ee1f310e0fdb218315b4062aa503394cee06fc4e"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/thyssenkrupp-boss-warns-uk-jobs-15404479", "ord_in_thread": 0, "title": "Thyssenkrupp boss warns UK jobs could be hit by Tories' poor handling of Brexit", "locations": [], "entities": {"persons": [{"name": "terry sargeant", "sentiment": "none"}, {"name": "mr sargeant", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "tories", "sentiment": "negative"}, {"name": "thyssenkrupp", "sentiment": "negative"}, {"name": "brexit thyssenkrupp", "sentiment": "negative"}, {"name": "getty images", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Thyssenkrupp boss warns UK jobs could be hit by Tories' poor handling of Brexit The German engineering group employs around 200 people across the North East Share The logo of ThyssenKrupp (Image: Getty Images) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe UK boss of an international engineering firm with two North East sites has hit out at the Government ’s handling of Brexit, and warned that jobs could be put at risk.\nTerry Sargeant, UK CEO of Thyssenkrupp, has warned that Britain could be hit with a wave of job cuts because the Government is putting its own party politics ahead of the needs of businesses.\nAccording to reports, Mr Sargeant said: “It is a complete shambles. They have failed business. The Tory party aren’t making decisions for business, they are making decisions to prevent an implosion in their own party.”\nHe added: “The impact of Brexit for multinationals is disruptive, and could lead to loss of business in Britain.\n“In Germany, people look at this and are aghast at what is happening. While in the UK we think about Brexit every minute of the day, in Germany, people think about it for 13 seconds before every quarter end or even trimester. We (as businesses) will make decisions based on ease of trade and attractiveness of the market environment. A steel worker watches the hot metal at the Thyssenkrupp steel factory in Duisburg, Germany (Image: AP) Read More Big rise in companies seeking Brexit advice, says Newcastle law firm Womble Bond Dickinson\n“If you make a market more difficult than it is at the moment, then what is the attraction to the investor?\n“I do not see how we can continue doing business where supply chains are so interlinked with being part of the customs union,”\nThyssenkrupp is one of Germany’s biggest civil engineering companies in the world and has two sites in the North East. Thyssenkrupp Access Ltd designs stairlifts and other accessibility products from its Stockton site, while Roballo Engineering manufactures slewing bearings from its Peterlee facility. Together the sites employ around 200 people.\nThe engineering group also supplies the Ministry of Defence and also makes a range of parts for the UK car industry.\nIts role in the automotive sector’s supply chain has meant the firm has already been affected by the decision of Jaguar Land Rover to close its production lines temporarily. Read More North East shops closing at alarming rate as retailers battle changing shopping habits\nMr Sargeant said: “Every time Jaguar Land Rover sneezes, we get a cold.\n“Once the UK leaves the customs union there will be barriers and possibly duties and tariffs to be paid. At the very least there will be paperwork. These are the very real concerns companies like us have.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-12T14:37:00.000+02:00", "crawled": "2018-11-12T16:03:22.010+02:00", "highlightTitle": ""}