{"organizations": [], "uuid": "08cc00001b5f8fe9d5bd5a4b8782bcff19763a48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14608018.ece/ALTERNATES/s1200/TMP_NEC_050216Trevelyan_04JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-brexit-northumberland-trevelyan-15437456", "country": "GB", "domain_rank": 21960, "title": "Northumberland MP Anne-Marie Trevelyan threatens to send letter of no-confidence in Theresa May", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-19T20:50:00.000+02:00", "replies_count": 0, "uuid": "08cc00001b5f8fe9d5bd5a4b8782bcff19763a48"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-brexit-northumberland-trevelyan-15437456", "ord_in_thread": 0, "title": "Northumberland MP Anne-Marie Trevelyan threatens to send letter of no-confidence in Theresa May", "locations": [], "entities": {"persons": [{"name": "anne-marie trevelyan", "sentiment": "negative"}, {"name": "mrs trevelyan", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "graham brady", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "department for education", "sentiment": "none"}, {"name": "under conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nBrexiteer Conservative MP Anne-Marie Trevelyan has warned she could submit a letter of “no confidence” in Prime Minister Theresa May .\nThe Northumberland MP said: “Let’s see how we go this week.”\nAnd she said her decision could depend on whether Mrs May listens to opponents of her proposed Brexit deal.\nMrs Trevelyan resigned last week from her role as a Parliamentary Private Secretary in the Department for Education, saying she could not support Mrs May’s Brexit plans.\nShe said she made the decision at 3am, having read Theresa May’s proposed Brexit deal.\nAnd she confirmed she had not yet submitted a letter calling for a new leader, but might do so soon.\nUnder Conservative Party rules, if 48 MPs send a letter to Graham Brady, chair of the 1922 Committee, then a vote of no-confidence will be held in which Conservative MPs have the opportunity to remove Mrs May from office. Read More\nHowever, if she was to win such a vote, the rules state it would not be possible to call another one for at least 12 months.\nMrs Trevelyan told Sky News that Conservative MPs had been reading Mrs May’s proposed deal. Prime Minister Theresa May (L) walks with Conservative party candidate for Berwick-upon-Tweed, Anne-Marie Trevelyan at an airfield in Northumberland (Image: Getty Images Europe)\nShe said: “It’s been a frustrating weekend, as more and more colleagues have sat down to read the extremely extensive tome and realised just how many problems there are with it in terms of delivering a real Brexit where we are once more sovereign to make decisions for ourselves.\n“It’s the opposite of that.\n“More and more colleagues have been on the phone to me over the weekend saying, goodness, this seems inconceivably bad.\n“Willing, though, the Prime Minister to listen ... and to go back and change it.” Read More Watch as Northumberland MP is moved to tears over Afghanistan veteran's plight\nAsked about sending a letter, she said: “It has to be a question of individual conscience. If more than that requisite number go in then so be it.\n“I sent in one letter last week, my resignation. I think one a week is enough for now.\n“We’ll see how it goes.\n“I think it’s something every MP should always consider. The question is whether the Prime Minister can no longer hear her party’s voice.”\nShe said she hoped in particular that Theresa May would scrap the plans in the deal for the Northern Ireland backstop.\nMrs Trevelyan said her decision to resign was “not a difficult decision at all”.\nShe said: “At three o clock in the morning, as I was ploughing my way through the 585-page document, i just felt I couldn’t stand up the next day and say I’m willing to back you. Read More\n“And if you can’t stand up clearly for government policy then you shouldn’t be a part of government.\n“One a week. Let’s see how we go this week.”\nFellow Northumberland Conservative Guy Opperman, MP for Hexham, has taken a different view and backs the Prime Minister’s plan. Guy Opperman (Image: Newcastle Chronicle)\nHe said on Twitter there was “nil possibility” of removing Theresa May and securing a newer, “better” EU deal by March 2019, when Brexit is due to take place.\nMr Opperman said: “The reality is that some wish to replace the PM and Cabinet’s deal with No Deal, or never leave / ignore referendum.”\nPro-Brexit Conservative MPs in the European Research Group have been encouraging colleagues to send in letters to Sir Graham Brady in order to prompt a no-confidence vote. Read More\nHigh-profile members of the group include Jacob Rees-Mogg and former Brexit Minister Steve Baker.\nIt was unclear whether Tory rebels are close to getting the 48 letters they need. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-19T20:50:00.000+02:00", "crawled": "2018-11-20T02:32:41.021+02:00", "highlightTitle": ""}