{"organizations": [], "uuid": "922a561a8770e2e810a6ad564b2f2a07819de53e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15247451.ece/ALTERNATES/s1200/0_Peoples-Vote-rally-in-Sunderland.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-voters-want-second-15374654", "country": "GB", "domain_rank": 21960, "title": "North East voters want a second Brexit referendum, according to major opinion poll", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-05T18:00:00.000+02:00", "replies_count": 0, "uuid": "922a561a8770e2e810a6ad564b2f2a07819de53e"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-voters-want-second-15374654", "ord_in_thread": 0, "title": "North East voters want a second Brexit referendum, according to major opinion poll", "locations": [], "entities": {"persons": [{"name": "yougov", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East voters want a second Brexit referendum, according to major opinion poll A majority of voters in every Labour-held seat would back a 'People's Vote' according to a YouGov survey Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nVoters across the North East now back a second referendum on Brexit, according to a major new survey.\nPolling company YouGov found that a majority of people in every Labour-held seat support a so-called “People’s Vote” on the Brexit deal agreed between the UK and the EU, which would include the option of staying in the EU.\nAccording to YouGov, 64% of voters in the constituency of Newcastle Central, 63% of voters in Newcastle East and 56% of voters in Newcastle North support a second vote, once those who answered “don’t know” are excluded from the figures.\nAnd 61% of Gateshead voters also back a second referendum. Voters backing a “People’s Vote” when those who say “don’t know” are excluded:\nBLYTH VALLEY 58%\nNEWCASTLE UPON TYNE CENTRAL 64%\nNEWCASTLE UPON TYNE EAST 63%\nNEWCASTLE UPON TYNE NORTH 56%\nNORTH DURHAM 59%\nWANSBECK 58%\nWASHINGTON & SUNDERLAND WEST 58%\nThe figures are based on a survey of 26,000 people nationwide. However, the constituency-level data is based partly on complex calculations designed to predict the views of voter at a local level based on responses at a regional and national level.\nPeter Kellner, a former President of YouGov and one of Britain’s most respected pollsters, said: “This research uses a technique known as Multilevel Regression and Post-stratification, or MRP for short. It enables us to estimate the views of people in particular areas – in this case parliamentary constituencies – by analysing data from a larger area, such as a region or nation.” Read More No heating and going without food: The harsh reality families face due to tough benefits cap\nHe added: “In the current MRP analysis, it is clear that the swing from Leave to Remain is higher than the national average in many constituencies that voted Leave in 2016 and Labour last year. However, a number of Labour MPs say this is not what they find ‘on the doorstep’.\n“YouGov’s data helps to resolve this apparent contradiction. It finds that very few voters with strong views on Brexit – whether for or against – have changed their mind since the referendum. The people who have changed their minds, and in large numbers, are those who do not necessarily speak to MPs on the doorstep.”\nDowning Street has said a Brexit deal with the EU is “95%” complete.\nIt was reported that the EU would agree to the creation of a whole-UK customs union that would avoid the need for a Northern Ireland border “backstop” that has been at the heart of the impasse in negotiations.\nAt the same time, it was reported that the Prime Minister was on course to agree a future economic partnership that would leave open the possibility of Canada-style free trade deal sought by Brexiteers. Read More 'A golden era for the North East': The new North of Tyne Combined Authority is launched\nA Downing Street spokeswoman added: “The Prime Minister is clear we are leaving the customs union.\n“We are making good progress on the future relationship, and 95% of the Withdrawal Agreement has been settled. Negotiations are ongoing.”\nHowever, Berwick-upon-Tweed Conservative MP Anne-Marie Trevelyan has warned that the UK would be better off leaving the EU without any deal at all than agreeing to be bound by EU rules. Conservative MP for Berwick Anne-Marie Trevelyan (Image: Newcastle Chronicle)\nIn an article for website Brexit Central, she said that around 90 per cent of global economic growth will come from outside the EU in the years ahead, and that the EU now accounts for less than half of our overall trade.\nShe said: “As we leave the EU, the one thing which remains fixed is our geography. We will remain, as we always have been, an island maritime nation, outward-facing and trading across the globe.\n“British goods and services are recognised as the best in the world and sought after by global customers. This will not change.\n“So we must look beyond the shores of our European continent and be prepared to walk away from negotiations if the deal offered by the EU does not deliver a real Brexit – and be unafraid of doing so.”\nThe UK could trade under World Trade Organisation rules, which would come into force if we left the EU without a deal, she said.\n“We will be leaving on 29th March next year and only a good deal for the UK should be agreed to. Otherwise we will be insulting the democratic request given to Parliament.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-05T18:00:00.000+02:00", "crawled": "2018-11-05T21:08:12.000+02:00", "highlightTitle": ""}