{"organizations": [], "uuid": "688f65961ca8e7b8b954f4e79126595c376a0784", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15303023.ece/ALTERNATES/s1200/0_SGP_NEC_300317FIRE02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/tyne-wear-mps-unite-condemn-15479218", "country": "GB", "domain_rank": 21960, "title": "Tyne and Wear MPs unite to condemn fire service cuts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-28T20:34:00.000+02:00", "replies_count": 0, "uuid": "688f65961ca8e7b8b954f4e79126595c376a0784"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/tyne-wear-mps-unite-condemn-15479218", "ord_in_thread": 0, "title": "Tyne and Wear MPs unite to condemn fire service cuts", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "ms glindon", "sentiment": "none"}, {"name": "mary glindon", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "home office ministers", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tyne and Wear MPs unite to condemn fire service cuts Home Office Ministers told they'll get the blame if cuts lead to injury or death Share Firefighters tackling a Barn fire at a farm at Crossgate moor county Durham (Image: Newcastle Chronicle) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nCuts to Tyne and Wear fire service could lead to contribute to a major incident \"or cause injury or death\", MPs have warned.\nMary Glindon , Labour MP for North Tyneside, claimed the Government would be held responsible if controversial cuts led to tragedy.\nAnd MPs from across Tyne and Wear joined forces to criticise the proposals, in a House of Commons debate.\nMs Glindon said she wasn't blaming fire service managers for the cuts, but said the service was responding to funding from central government falling by £10.8 million.\nThe service was expected to overspend by £2.2 million in the next financial year, rising to £3.6 million by 2021-22, unless it took action, she said.\nAs a result, the fire brigade had launched a consultation on plans to downgrade some fire stations, cutting the number of engines at some stations and cutting staff.\nShe said: \"There will also be a reduction in the number of staff, with 16 posts lost in 2019 and a further 54 posts lost over the next two years.\"\nThe FBU, the union which represents fire service staff, had warned the plans \"will make all communities in Tyne and Wear less safe,\" she said. MP Mary Glindon\nShe said: \"We must remember that our firefighters’ lives are at risk, as well as those of the general public.\n\"How will further reductions in the fire service affect our businesses and economic growth? How could we attract businesses to an area where their valuable assets might be lost because of the lack of adequate fire and rescue cover? \"\nAnd she told Home Office Minister Nick Hurd, who was taking part in the debate: \"I am sorry to say this, but Minsters will be held directly to account if the cuts worsen a major incident, or cause injury or death.\" Read More Brexit forecast: North East will be poorer after Brexit, official Government forecasts warn\nTynemouth Labour MP Alan Campbell also criticised the planned cuts, saying: \"Fire prevention is a crucial part of keeping people safe.\n\"The fire authority says that if the job losses continue in Tyne and Wear fire and rescue service as a result of these changes and what has gone before, 70 posts will be lost, and the FBU says 82 posts will be lost. Either number is considerable.\"\nAnd Washington and Sunderland West Labour Sharon Hodgson said: \"People will be particularly concerned about this issue in the light of troubling events in recent weeks in which firefighters have been verbally and physically attacked.\" MP Alan Campbell (Image: Newcastle Chronicle)\nOther MPs to speak out during the Commons debate and criticise the cuts included Jarrow MP Stephen Hepburn, Newcastle North MP Catherine McKinnell, Houghton and Sunderland South MP Bridget Phillipson, Blaydon MP Liz Twist and Sunderland Central MP Julie Elliott.\nMr Hurd, the Home Office Minister responsible for policing and the fire service, admitted that Tyne and Wear Fire Service had faced bigger cuts than other fire brigades during the current Government spending review period, which lasts from the 2016-17 financial year to 2019-20.\nHe said: \"Tyne and Wear has had a more challenging settlement than other fire authorities over this spending review period - I have been candid about that.\n\"Spending power has been reduced by 2% over the spending review period, compared with a 0.3% increase for stand-alone fire and rescue authorities as a whole.\n\"Having reviewed the figures, Tyne and Wear will see the fourth largest reduction in core spending power, after the Lancashire, Cleveland and West Midlands fire authorities. Read More Companies should give staff 'UNLIMITED holidays and free shares' to boost commitment\n\"I recognise, not just from the strength of feeling in the room, that the past few years have been challenging as a result of the spending review settlement that flows from the way in which the current funding formula works.\"\nHe said the Government had helped Tyne and Wear Fire Service by providing an extra grant to help it meet pension contributions.\nBut he said: \"We are talking about a fire authority whose core spending power this year has increased by 0.8%. A reduction of 2% over the spending period is not an enormous proportion.\".\nMr Hurd said the Government was reviewing the formula that determined who fire funding was distributed across the country. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-11-28T20:34:00.000+02:00", "crawled": "2018-11-29T02:21:33.016+02:00", "highlightTitle": ""}