{"organizations": [], "uuid": "1419344c40ceec5a70f75f76c9f5ee4e00c52e96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2087864.ece/ALTERNATES/s1200/0_brexit-3561095_1280.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/fact-checking-claims-brexit-blame-2221594", "country": "US", "title": "Fact checking claims that Brexit is to blame for upheaval of three of Devon's biggest brands", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-15T12:26:00.000+02:00", "replies_count": 0, "uuid": "1419344c40ceec5a70f75f76c9f5ee4e00c52e96"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/fact-checking-claims-brexit-blame-2221594", "ord_in_thread": 0, "title": "Fact checking claims that Brexit is to blame for upheaval of three of Devon's biggest brands", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "stuart elford", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "plymouth chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Fact checking claims that Brexit is to blame for upheaval of three of Devon's biggest brands It has been ten days of turmoil for some of Devon's biggest companies and the effects of Brexit are partly to blame Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThree of Devon’s biggest businesses have faced upheaval in the past 10 days and Brexit is partly to blame.\nFrom manufacturing, custard makers and the South West’s only airline, the effects of leaving the EU have been cited in the business decisions being made by the bosses at these brands either selling up or shipping out.\nUncertainty, falling value of the pound and fear of rising costs have all been contributing factors.\nBut it won’t be their biggest concern, said Stuart Elford, Chief Executive of Devon and Plymouth Chamber of Commerce.\nHe said: “Brexit is a factor but it is among many factors considered in business decision making and planning.\n“There’s no doubt that Brexit is a distraction, but decisions about location or selling a business are very complex. Read More\n“What businesses really need is clarity and certainty and I hope that we are a bit closer to that. Once businesses know what they are dealing with, they will find a way.”\nDevonLive Business takes a look at the part Brexit has had to play. Barden Corporation (UK) Ltd in Plymouth The Barden Corporation (Image: Penny Cross) Staff affected: 365\nThis massive ball bearing manufacturer has been lauded as on of the region’s biggest employers and has shown no sign of trouble with its components in huge demand in motor vehicle and aeronautical sectors across the globe.\nBut Plymouth and the region was dealt a huge blow on November 6 when parent company Schaeffler announced that it is to close The Barden Corporation (UK) Ltd plant in Estover within the next two years.\nThe company highlighted the uncertainty surrounding Brexit as a factor in its decision to shut the factory throwing jobs for 365 workers in doubt.\nJuergen Ziegler, regional chief executive Europe, said: “Brexit is clearly not the single decisive factor behind our decision-making for the UK market, but the need to plan for various complex scenarios has brought forward the timing.” Read More Devon council boss warns over Brexit nursing care shortages\nOnly around 15 percent of the goods Schaeffler produces in the UK remain in the country, while the vast majority is exported to continental Europe.\nGreg Littlefair, UK managing director of Schaeffler UK Limited, said that global business disliked uncertainty and wanted to see open borders to ensure frictionless trade.\nHe said: “Uncertainty in any business, certainly one that operates globally, is appreciated as little as possible.”\nThe Plymouth operation produces precision bearings for cars, aircraft, the nuclear industry, missiles and satellites.\nOperations in Plymouth will be undertaken by a similar plant in the United States. Ambrosia in Lifton The Ambrosia Factory in Lifton, Devon Staff affected: 300\nFood giant Premier Foods announced on Tuesday that it is intending to sale Ambrosia, Devon’s prime custard and pudding makers.\nAmbrosia has been made in Devon for than 100 years but there has been a downturn in pudding eating, partly because of the hot summer and because Premier reduced its promotional investment in the brand.\nPremier has insisted that the factory will not close but it hopes that a new owner can be found to invest in the company.\nThere is no suggestion that Brexit is behind the sale.\nBut Premier Foods, which also owns Bisto, Hovis, Mr Kipling and Branston has said that it intends to stockpile raw materials in the run-up to Brexit over concern about gridlock at UK ports.\nThe firm said it was taking steps \"in the absence of certainty over the arrangements for the UK's departure from the EU\".\nPremier Foods said it expected to spend up to £10m on the preparations. Watch the history of Flybe Video Loading Click to play Tap to play The video will start in 8 Cancel Play now (Image: Flybe) Staff affected: 2,300 including 1,000 in Exeter\nFlybe has been struggling for some time to find a profitable spot in the market place and announced it was intending to go up for sale on November 14 .\nThe airline, which employs 1,000 people at its HQ at Exeter, has faced a number of challenges including rising fuel costs, falling sales for short haul flights and a drop in the value of the pound .\nThe value of the pound fell dramatically in value following the vote for Brexit in June 2016 and continues to remain under pressure.\nIt means it is more expensive for travellers abroad and for conducting business.\nPrior to the referendum, the average exchange rate between the GBP and the euro stood at £1.28, but by October 2016 it dropped to £1.12 before picking up again.\nIt is expected that if a no-deal Brexit looks increasingly unlikely, the value will rise. Read More ", "external_links": ["https://www.bbc.co.uk/news/business-46191729", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-15T12:26:00.000+02:00", "crawled": "2018-11-15T12:55:21.003+02:00", "highlightTitle": ""}