{"organizations": [], "uuid": "50588700728327778560eda068d2d20477a60fd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2250712.ece/ALTERNATES/s1200/1_buckfast.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/fake-buckfast-christmas-truck-sending-2250932", "country": "GB", "title": "Fake Buckfast Christmas truck is sending people into a festive rage", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-23T13:06:00.000+02:00", "replies_count": 0, "uuid": "50588700728327778560eda068d2d20477a60fd5"}, "author": "Colleen Smith", "url": "https://www.devonlive.com/news/devon-news/fake-buckfast-christmas-truck-sending-2250932", "ord_in_thread": 0, "title": "Fake Buckfast Christmas truck is sending people into a festive rage", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "colleen smith", "sentiment": "none"}], "locations": [{"name": "santa claus", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "buckfast abbey", "sentiment": "none"}], "organizations": [{"name": "coca-cola", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Fake Buckfast Christmas truck is sending people into a festive rage Fans of Devon's famous Bucky tonic wine have created a Christmas truck tour that had people more excited than the Coca-Cola truck - but they were left disappointed when they were told: \"Sorry to disappoint but like Santa Claus the Bucky Truck Tour isn’t real.\" Share Colleen Smith Regional Head of Content 11:06, 23 NOV 2018 Click to play Tap to play The video will start in 8 Cancel Play now\nFacebook jokers have created a mock Buckfast Christmas Truck Tour for fans of Devon's famous tonic wine - but thousands of people signed up and have been left disappointed that it's not real.\nThe wine originally made by monks at Buckfast Abbey has a huge cult following especially in Scotland and thousands signed up for the event only to be told:\"Sorry to disappoint but like Santa Claus the Bucky Truck Tour isn’t real.\"\nSome fans got the joke, but others were fuming. Read More Council news\nOne said: “I’ve just booked the day off work for this. Totally raging!\"\nThe authentic-looking Facebook page was designed to look just like the famous Coca Cola truck - but with Santa swigging Bucky rather than Coca-Cola.\nIt said the festive themed truck would be arriving in Glasgow on 19 December, along with other dates in Aberdeen, Livingston, Edinburgh, Fife, Paisley and Ayr.\nThe tour was also said be stopping off in places in Northern Ireland. The event page posted: “The World Famous Bucky Truck is bringing a Buckfast swigging Santa Claus to all corners of the UK and Ireland this Christmas.” Read More\nThe page generated huge interest, with over 2,000 people saying they were going to attend the Glasgow event alone. A monk makes Buckfast Tonic Wine at Buckfast Abbey in west Devon\nBut hearts were broken when the jokers had to confirm that the tour was just pretend.\nThey said on Facebook: “Sorry to disappoint but like Santa Claus the Bucky Truck Tour isn’t real.\n“Although some may have got the joke, it appears quite a few did not.” Read More\nPeople didn’t take the news well with several people hurling abuse at the admins of the page.\nOne user wrote: “This is just cruel and sick!”\nAnother added, “I’ve just booked the day off work for this. Totally raging! Someones sick idea of a joke getting ma hopes up!!”\nSome people saw the funny side with one comparing it to the Brexit bus: “I guess you can’t believe everything you read on the side of a truck.” Read More Police update on M5 crash which closed the motorway at Exeter What is Buckfast and how was it created?\nThe drink was originally made by monks in Buckfast Abbey, and the drink is now made under a licence granted by the monastery and is now distributed by J Chandler & Company.\nBuckfast tonic caffeinated fortified wine - originally made by Benedictine monks with the use of a traditional French recipe - at Buckfast Abbey in the 1890s. Read More Asda cuts petrol prices for fourth time in four weeks\nIt was originally sold as a medicine, with the directions being: “ Three small glasses a day, for good health and lively blood.\"\nIn the 1970s it was targeted at tired housewives 'to help you cope with life's little ups and downs'. A Buckfast Tonic Wine advert from the 1970s targeting housewives (Image: @70s_party)\nBut more recently Bucky has developed a reputation which has seen the drink directly linked with alcohol abuse, violent crime and anti-social behaviour. It has high retail sales in Scotland, especially in Glasgow.\nToday, the drink contains 15% alcohol in its 750 ml green-bottled UK version. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-23T13:06:00.000+02:00", "crawled": "2018-11-23T13:47:51.000+02:00", "highlightTitle": ""}