{"organizations": [], "uuid": "56cef2e50ba0eb8a6f977aaf9ff8c13096d18291", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/news/business/article1809688.ece/ALTERNATES/s1200/2_drakes-2-1JPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/more-shopping-primark-2186992", "country": "GB", "title": "More of us are shopping at Primark and this is why", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-06T13:48:00.000+02:00", "replies_count": 0, "uuid": "56cef2e50ba0eb8a6f977aaf9ff8c13096d18291"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/more-shopping-primark-2186992", "ord_in_thread": 0, "title": "More of us are shopping at Primark and this is why", "locations": [], "entities": {"persons": [{"name": "hannah finch primark", "sentiment": "none"}, {"name": "alys key", "sentiment": "none"}, {"name": "joe hocking", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "primark", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News More of us are shopping at Primark and this is why The rise in popularity of the store is despite the decline in high street sales across the board Share Alys Key, Press Association City Reporter Hannah Finch Primark in Drake Circus Shopping Centre (Image: Joe Hocking)\nMore fashion seekers are heading to Primark despite a declining high street.\nNew figures released by the fast-fashion retialer show that in the UK, like-for-like sales were up 1.2% and Primark’s share of the total clothing market increased significantly.\nOverall sales were 5.3% ahead of last year.\nPrimark has created customers who are super loyal to the brand Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nPrimark does not sell online and uses its website and social media to instead entice shoppers to its high street stores.\nIt commands big multi-floor stores in Exeter, Plymouth and Torquay and is a massive footfall driver at a time when the high street is undergoing big changes. Read More What makes Primark so good at what they do?\nHowever, its a different story in Europe where like-for-like sales at Primark fell in the year to September as bad weather weighed on trading in Europe.\nThe budget fashion retailer, which is owned by Associated British Foods (ABF), reported a 2.1% decline in like-for-like sales, a measure which excludes new store openings.\nIn contrast, overall revenue growth at the brand was 6% for the 52 weeks to September 15, aided by expansion.\nThe slide in comparable sales was driven by a 4.7% drop in the eurozone, where unseasonable weather was blamed for the slump. Primark is thriving while its rivals struggle (Image: Liverpool Echo)\nNew store openings in the region are also thought to have cannibalised trade from existing branches.\nPrimark pledged to continue expanding into new stores, targeting the US and Central and Eastern Europe in particular.\nThe retailer will also open a new Belfast store following the destruction of its existing site in a fire in August.\nABF’s overall revenue was 1% higher, as Twinings Ovaltine drove growth in the grocery business, but the sugar division took a hit from lower EU prices. Read More I'm A Celebrity 2018: The stars confirmed to go in the jungle and rumoured contestants\nAdjusted profit before tax was 5% higher than last year at £1.37 billion.\nThe company noted that it is making emergency preparations for the “unlikely” event of a no-deal Brexit, which it said could cause disruption.\nBut ABF also said the UK’s withdrawal from the EU could have potential benefits for the company amid a shift in the British food industry. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-06T13:48:00.000+02:00", "crawled": "2018-11-06T14:29:53.022+02:00", "highlightTitle": ""}