{"organizations": [], "uuid": "6b3732512c3e17b7dcc77572aaec137ec9ae8c44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1472916.ece/ALTERNATES/s1200/mEL-STRIDEPNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/education-funding-christmas-cards-taxation-2260582", "country": "GB", "title": "Education funding, Christmas cards, taxation and leaving the EU without a deal", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-26T16:18:00.000+02:00", "replies_count": 0, "uuid": "6b3732512c3e17b7dcc77572aaec137ec9ae8c44"}, "author": "Mel Stride", "url": "https://www.devonlive.com/news/news-opinion/education-funding-christmas-cards-taxation-2260582", "ord_in_thread": 0, "title": "Education funding, Christmas cards, taxation and leaving the EU without a deal", "locations": [], "entities": {"persons": [{"name": "mel stride", "sentiment": "none"}, {"name": "glendinning", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "ashburton", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "news", "sentiment": "none"}, {"name": "exminster primary school", "sentiment": "none"}, {"name": "ofsted", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Education funding, Christmas cards, taxation and leaving the EU without a deal These are among the things that Mel Stride MP has been dealing with in the last week Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nMEL STRIDE IS THE CONSERVATIVE MP FOR CENTRAL DEVON AND HAS BEEN SINCE 2010\nLast week I was busy right across our vast constituency. In Exminster I met with some of the governors and the head teacher of Exminster Primary school. This is a successful school that was rated as Good at its last OFSTED inspection. We discussed funding challenges and I have undertaken to ensure that my fellow Treasury minister, the Chief Secretary is appraised of the important issues that the school has raised with me.\nIt is the Chief Secretary who will be responsible for overseeing the spending review next year when departmental budgets are set. There are 46 schools in our constituency and I do my best to visit as many as I can each year. Read More Cutting business rates in the budget is a huge shot in the arm for our High Streets\nIn Ashburton I spent time with Glendinning, the successful local quarrying business which very kindly sponsored my annual Christmas Card competition. This is open to all the primary schools in the constituency who are invited each year to submit paintings with the winning entry appearing on the front and the two runners up on the reverse of my Christmas card. Mel Stride MP looking through the entries to the competition to design his 2017 Christmas Card.\nThere were many entries this year and it was a difficult task selecting the winners. Full details to follow but I can say that the winning entries come from Cheriton Fitzpaine, Okehampton and Buckfastleigh – so, if you put in an entry from one of these schools it could be you! I will visit each school in the New Year to present a certificate and prize to each winner. Read More Mel welcomes broadband boost for business\nI was also really pleased to join members of the Woodland Trust and Dartmoor National Park to plant trees in Pullabrook Wood as a contribution to the Queen’s Commonwealth Canopy, a network of forest conservation initiatives to mark Her Majesty's lifetime of service to the Commonwealth. Mel Stride MP I am currently taking the Finance Bill through the Commons. The bill brings into law the measures announced in the Budget. Read More Jeremy Corbyn's plans do not survive the most cursory contact with reality\nOn Monday and Tuesday I took large sections through what is known as a Committee of the Whole House whereby the Commons chamber serves as a committee with all MPs able to participate in the debate on the clauses and amendments proposed. Mel Stride\nOn Wednesday I also replied to a debate calling for reductions in VAT on tourism. Thursday was spent in the Treasury looking at our preparations for Brexit. I have responsibility for HMRC which has a key role in the management of our borders and there is a lot of legislation to take through to ensure that we are ready on day one in the unlikely event that we leave the EU without a deal. Read More Popular stretch of road through Copplestone made safe thanks to village project\nOn Thursday night I appeared on Newsnight to discuss the progress we are making with the deal – you can view this at www.bbc.co.uk/programmes/b0bsqnlb .\nThe programme provides, directly after my interview, an interesting analysis of the possibilities around Parliament’s upcoming vote on the withdrawal agreement that we have just concluded. It is worth a watch if you want to better understand the ins and outs of this complicated situation. Like us on Facebook ", "external_links": ["http://www.bbc.co.uk/programmes/b0bsqnlb", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-11-26T16:18:00.000+02:00", "crawled": "2018-11-26T16:33:56.019+02:00", "highlightTitle": ""}