{"organizations": [], "uuid": "59b515af68bd8afdcd007f73e3e8f13ec4e228fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11708422.ece/ALTERNATES/s1200/Futuristic-Concept-Cars-Go-On-Show-In-Tokyo.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15438312", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Nissan shares tumble as chairman is held amid financial probe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-11-20T10:25:00.000+02:00", "replies_count": 0, "uuid": "59b515af68bd8afdcd007f73e3e8f13ec4e228fc"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15438312", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Nissan shares tumble as chairman is held amid financial probe", "locations": [], "entities": {"persons": [{"name": "bonmarche", "sentiment": "none"}, {"name": "helen connolly", "sentiment": "none"}], "locations": [{"name": "bonmarche", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "coreena ford bonmarche", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Bonmarche profits fall as fashion firm is hit by high street woes\nProfits at Bonmarche were nearly cut in half in the first six months of the year as weak consumer sentiment and lower footfall stung the struggling retailer. The womenswear chain saw pre-tax profit tumble 45% to £2.3m in the half-year to September 29, despite revenue nudging up to £97.9m from £97.8m.\nOnline sales were up 28.9% but store like-for-like sales fell 4% amid what chief executive Helen Connolly said was “general weaker consumer sentiment and footfall seen across the market”.\nShe added:\nDespite the challenging market, the health and fundamentals of the business remain strong and the board remains confident in the strategy and in Bonmarche’s long-term prospects.\nProviding that sales during the key Black Friday through to Christmas trading period meet expectations, the board maintains the guidance published in September, being that the underlying profit before tax for the group for full-year 2019 will be £5.5m.\nIn September, Bonmarche warned over profits, blaming weak consumer demand and hot summer weather for a decline in sales. Shares were down nearly 2% in morning trade at 80p. A Bonmarche store Coreena Ford Newcastle designer uses Kickstarter to fuel galactic space battle game\nA Newcastle gaming company is looking to develop its sixth board game after taking to Kickstarter to fund the idea.\nEurydice Games is hoping to raise £12,000 to get its galactic warship game FlickFleet off the ground.\nThe game has been designed by Jackson Pope and Paul Willcox, and sees two players battle it out to destroy each others fleet of acrylic space ships. Players do this by flicking dice at the ships from across the board, with the numbers shown on the dice determining which part of the enemy ship is damaged.\nMr Pope previously ran his own board game company, but was forced to wind-up the business in 2011 during the recession. His other games include Border Reivers, a war game about Scottish plans, and It’s Alive, where players attempt to win body parts that are used to create Frankenstein’s Monster.\nThe games were released in limited runs, ranging from 100 to 3,000 copies.\nMr Pope said: “I am really proud of it. It is the game, of the six, that I think has the best chance to be a success.” The contents of FlickFleet (Image: Eurydice Games) 8.50 KEY EVENT Poor health costing the North £13bn, new report finds\nMore than £13bn could be added to the economy of the North by tackling the health inequalities that exist with other parts of the country, a new report says.\nThe Health for Wealth: report, which will be launched in Newcastle today , says that increasing the NHS budget in the North East could health close the productivity gap which currently sees people in the region producing £4 an hour less than other parts of the country.\nAction to reduce poor health would narrow the employment gap with the rest of England and improve productivity to such an extend that the region would add an additional £13.2bn to the economy.\nThe report - which has been commissioned by Northern Health Science Alliance and compiled by six universities - points out that 60% of health research is carried in the ‘golden triangle’ of London, Cambridge and Oxford.\nLead author Professor Clare Bambra, from Newcastle University, said: “This report demonstrates the connection between poor productivity and higher rates of ill health in the North. If you improve health in the North you will improve its productivity – potentially benefiting the whole of the UK’s economy.” Prof Clare Bambra, Newcastle University (Image: publicity handout from Newcastle University) 8.40 Coreena Ford FTSE 100 and pound latest\nThe FTSE-100 index at 8:15am was down 23.08 at 6977.81.The pound at 8am was 1.2862 dollars compared to 1.2841 dollars at the previous close. The euro at 8am was 0.8908 pounds compared to 0.8907 pounds at the previous close. London Stock Exchange (Image: PA) 8.35 Coreena Ford AO World posts rising sales amid challenging times\nAO World has seen sales rise and losses narrow, but warned that a “challenging” market would see the online firm rely on its second half performance to meet annual expectations.\nThe online electricals retailer posted an £11.7m operating loss in the six months to September 30, down from £12m in the same period last year.\nRevenue for the period increased by 9.9% to £404.2 million, but the firm said the results come amid a “challenging backdrop” in its core UK and German markets.\nAO chief executive Steve Caunce said:\nThis has been a half of continued delivery against our long-term strategy, thanks to a strong offer for customers. While our core UK and Germany major domestic appliances markets have been challenging, with the UK major domestic appliances market becoming tougher than expected, we take encouragement that we are at least maintaining market share in this core category in the UK and growing significantly in Germany.\nOur peak trading period began on November 9 with the launch of our biggest ever Black Friday and I remain confident of achieving long-term sustainable growth across the group. AO World operates AO.com Coreena Ford Profits take off at easyJet despite strike hit\nLow-cost airline easyJet has shrugged off strike woes and surging costs to notch up a 41% jump in annual profits.\nThe budget carrier reported pre-tax profits of £578m for the year to September 30, up significantly on the £408m seen the previous year.\nBut easyJet warned that cost pressures will continue into its new financial year, with a hit of up to £100m expected from rising fuel prices.\nIt also said revenues per seat will fall in the first half, due to factors including the timing of Easter.\nEasyJet said it is continuing to prepare for Brexit, having set itself up across Europe to be able to operate via airlines in the UK, Switzerland and Austria to enable ongoing flying in the EU.\nIt said: “Both the EU and the UK have said that their objective is to maintain flights between the EU and the UK, whatever the Brexit outcome.\n“This gives easyJet confidence that flying rights will be maintained, and it continues to work with EU institutions, EU member states and the UK to ensure that this is achieved.” An easyjet plane at Newcastle Airport (Image: Newcastle Journal) 8.25 Coreena Ford CYBG swings to loss following further PPI provisions\nCYBG has swung to a full-year loss after it was forced to take an extra £150m charge linked to the mis-selling of payment protection insurance.\nThe group, which owns the Clydesdale and Yorkshire Banks and recently completed its £1.6bn merger with Virgin Money, booked a £164m pre-tax loss in the year to September 30, compared with a £268 million profit in 2017.\nThe group was stung by £396m of legacy conduct costs, the bulk of which were linked to PPI claims.\nIt reflects higher-than-predicted complaints volumes following a Financial Conduct Authority advertising campaign featuring Arnold Schwarzenegger aimed at encouraging people to come forward before an August 2019 deadline for final claims.\nCYBG said that, while weekly complaint volumes have been falling since the end of July, it considers it “prudent” to take a further £150m increase in provisions as it estimates 83,000 future claims.\nOn an underlying basis, profit before tax was up 13% to £331m and net interest income rose 1% to £851m. Boss David Duffy also used the annual update to warn over Brexit uncertainty. “Clearly Brexit negotiations mean the external political and macroeconomic environment remains inherently uncertain.\n“We have planned for a period of uncertainty, but it is impossible to ignore the lower levels of business confidence, especially for SMEs, while the final specific outcome of negotiations remains unclear.” Earlier this year, CYBG completed a £1.7 billion takeover of Virgin Money, marking one of the first major banking deals since the financial crisis. The combined group is expected to result in annual cost savings of around £120 million by the end of September 2021.\nMr Duffy added:\nIt has been a landmark year for CYBG, continuing to deliver ahead of market growth and meeting our underlying financial targets in a highly competitive market, while also completing the transformational Virgin Money acquisition in October 2018 following overwhelming shareholder support.\nIn a competitive market, we have delivered an increase in underlying profits, returns and capital generation - all of which means we are delighted to recommend an increase to last year’s inaugural CYBG dividend, payable to all shareholders. CYBG chief executive David Duffy outside former Virgin Money HQ in Gosforth (Image: publicity handout from CYBG) 8.20 KEY EVENT Nissan shares plummet as chairman Carlos Ghosn is held in financial probe\nThe arrest of Nissan Motor Co’s chairman Carlos Ghosn on charges he under-reported his income and misused company funds has caused the firm’s shares to tumble and left many in Japan shocked.\nProsecutors said they were holding Mr Ghosn for allegedly collaborating to falsify securities statements and under report Mr Ghosn’s income.\nA second Nissan executive, Greg Kelly, was also suspected of collaborating with him to under-report some five billion yen (£34.5m) in Mr Ghosn’s income from 2011-2015.\nChief Cabinet Secretary Yoshihide Suga said that the government was watching for economic fallout from the scandal at one of the world’s biggest car makers.\nMr Ghosn was arrested yesterday and Nissan’s chief executive Hiroto Saikawa said the company’s board will meet on Thursday to approve his dismissal. Prosecutors refused to say where he was being held in Tokyo.\nNissan’s shares fell 5% in Tokyo trading today and shares in Renault plunged 8.4% in Paris yesyerday.\nThere was no word from Mr Ghosn himself about the situation.\nHe reportedly was questioned and arrested shortly after arriving on Monday from overseas aboard a private jet.\nThe Brazilian-born executive became one of the car industry’s most powerful executives by engineering a turnaround at Nissan and leading the company for nearly two decades.\nThe scandal abruptly threw into question Mr Ghosn’s future as leader of the Renault-Nissan-Mitsubishi alliance, which sold 10.6 million cars last year, more than any other manufacturer.\nMr Saikawa, in a 90-minute news conference late on Monday, said the company was overdue for some change and that power had been too heavily concentrated in one person. The scandal was a “negative outcome of the long regime of Mr Ghosn,” he said.\nMr Ghosn officially still leads the Renault-Nissan-Mitsubishi alliance as chief executive and chairman. But experts said it is unlikely he will be able to stay on there or at Renault, where he is also chief executive.\nThe allegations are a serious blow at a time when Nissan is still getting over a scandal in which it admitted altering the results of emission and fuel economy tests on vehicles sold in Japan.\nA press release by the prosecutor’s office in Tokyo said Mr Ghosn and Mr Kelly collaborated to under-report Mr Ghosn’s income as 4.99 billion yen even though it actually was almost 10 billion yen, submitting falsified securities statements to the regional finance bureau.\nThe compensation from Nissan was only a part of Mr Ghosn’s overall income since he also was paid salaries by the car maker’s alliance partners Renault SA and Mitsubishi Motor Corp.\nPolice can hold suspects without charge for days, but prosecutors have only 48 hours to decide whether to press charges.\nNissan said it informed the authorities about suspicions of falsified financial reporting and misuse of company funds and assets by Mr Ghosn after a months’ long investigation prompted by a whistleblower.\nMr Saikawa provided only limited details about the case, saying he was constrained because of the criminal investigation under way. Apologising repeatedly, he vowed to improve the company’s governance.\nHe said: “Beyond being sorry, I feel great disappointment, frustration, despair, indignation and resentment.” Nissan chairman Carlos Ghosn (Image: David Parry/PA Wire) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15438312;"], "published": "2018-11-20T10:25:00.000+02:00", "crawled": "2018-11-20T11:22:17.001+02:00", "highlightTitle": ""}