{"organizations": [], "uuid": "bba2b913b568a2d5d3e9a480c13a6aad19f0a2a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13026335.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/avoiding-hard-brexit-keen-concern-13100035", "country": "GB", "domain_rank": 21960, "title": "Avoiding hard Brexit is keen concern for North East businesses, Journal survey shows", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-28T23:00:00.000+03:00", "replies_count": 0, "uuid": "bba2b913b568a2d5d3e9a480c13a6aad19f0a2a7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/avoiding-hard-brexit-keen-concern-13100035", "ord_in_thread": 0, "title": "Avoiding hard Brexit is keen concern for North East businesses, Journal survey shows", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "sarah glendinning", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "arlen pettit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "invalid email  north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "journal", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Avoiding hard Brexit is keen concern for North East businesses, Journal survey shows Poll of business leaders calls for access to European markets and skilled labour from abroad to be priorities for next Government Share Get business   Thank you for subscribing!   \nNorth East business leaders are opposed to the ‘hard Brexit’ outlined by Prime Minister Theresa May in her current stance on leaving the EU, a Journal survey suggests. \nA poll conducted in the run-up to next month’s General Election reveals that ensuring access to both European markets and skilled labour from abroad are the areas of highest concern for businesses in the region. \nFunding for skills, improvements to transport in the North East and better broadband and IT infrastructure also ranked highly in the survey. \nBut it is the importance business leaders have placed on the Brexit deal - with 72% saying ensuring access to European markets after Brexit was a high priority and 70% saying the same about ensuring access to skilled labour - that will put pressure on politicians to reach a deal with the EU that does not threaten jobs in the North East. \nIn other areas, 68% of those polled called for better funding for skills in the North East and 63% wanted improvements to transport in the North East to be a priority for the new Government. Labour leader Jeremy Corbyn (Photo: PA) \nThe findings of The Journal’s survey have been welcomed by business leaders in the North East, who will be pressing politicians of all parties to ensure Brexit negotiations do not harm the region’s business community. \nSarah Glendinning, regional director of the CBI, said: “Europe remains the UK’s biggest export market by some distance, so it’s little wonder that businesses here in the North East see maintaining access to the market of our nearest neighbours as a priority. The business community – in the UK and the EU – is united in wanting an agreement with as few barriers as possible, allowing our companies to trade easily. Read More North East companies still attractive to investors, but Brexit warning looms \n“Immigration is a force for good, creating jobs, plugging skills gaps and bringing investment – all vital for economic growth. Any new system must therefore reflect economic reality while alleviating public concerns. \n“If the next Government wants to better create prosperity in all corners of the UK, then investment in skills and transport will be paramount.” \nArlen Pettit, policy advisor for the North East England Chamber of Commerce, added: “This Journal poll echoes some of the concerns and issues we hear from our members, which formed our manifesto for 2017. \n“They tell us that uncertainty about the future is one their biggest concerns, no more so than when it comes to our future relationship with the EU, access to European markets and access to skilled talent from within the EU. Liberal Democrats leader Tim Farron (Photo: PA) \n“As the UK’s leading exporting region, and with EU trading making up 60% of our total exports last year, it’s no surprise these issues are among the top priorities for North East England’s businesses. \n“At the Chamber, we’re working to make sure the voice of North East England’s businesses is heard in negotiating that new relationship with our European neighbours, and that while negotiations are going on the region receives the investment it needs to be competitive on the global stage.” \nThe Journal business election survey gave people 10 issues to rank as high, medium or low priority. \nAreas of main concern included Brexit, skills and infrastructure improvements. By contrast, devolution for the North East was not seen as a major priority, with only 27% of those surveyed saying it was a major concern. Reforming business rates and promoting the Northern Powerhouse were also lower priorities in the survey. Like us on Facebook", "external_links": [], "published": "2017-05-28T23:00:00.000+03:00", "crawled": "2017-05-28T19:39:13.000+03:00", "highlightTitle": ""}