{"organizations": [], "uuid": "1ba71315705874c8434f6281ef7712fec58e56c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30298387/15976623.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/general-election-north-devon-s-candidates-so-far/story-30298387-detail/story.html", "country": "US", "title": "General Election: North Devon's candidates so far... | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "General Election: North Devon's candidates so far... | Devon Live", "spam_score": 0.203, "site_type": "news", "published": "2017-04-27T23:11:00.000+03:00", "replies_count": 0, "uuid": "1ba71315705874c8434f6281ef7712fec58e56c4"}, "author": "", "url": "http://www.devonlive.com/general-election-north-devon-s-candidates-so-far/story-30298387-detail/story.html", "ord_in_thread": 0, "title": "General Election: North Devon's candidates so far... | Devon Live", "locations": [], "entities": {"persons": [{"name": "north devon", "sentiment": "none"}, {"name": "val", "sentiment": "none"}, {"name": "steve crowther", "sentiment": "none"}, {"name": "ricky knight", "sentiment": "none"}, {"name": "mark cann", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gerrard sables", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}, {"name": "chivenor", "sentiment": "none"}, {"name": "nick harvey", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "braunton", "sentiment": "none"}, {"name": "north devon district hospital", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "australia  ukip", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "liberal democrats and labour", "sentiment": "none"}, {"name": "north devon green party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (1) \nDespite the county council elections taking place next week it is never too early to see how things are shaping up for the General Election in North Devon. Candidates from all the main parties have been declared, so here is an early guide to the June General Election in North Devon. \nConservative - Peter Heaton-Jones (sitting MP) \n\"I'm going to fight this election by putting forward a positive vision for Britain, championing North Devon and campaigning with enthusiasm and integrity. By contrast it's already obvious that the Lib Dems will fight another tired, negative and disappointingly personal campaign, talking down North Devon's public services and our local economy. \n\"They will also do anything to avoid discussing Brexit. That's hardly surprising since nearly 60% of North Devon voters supported leave, but it's Lib Dem policy to ignore them and try to overturn the referendum result. \n\"North Devon rejected the Lib Dems just two years ago, choosing instead to have an MP who has direct access to the decision-makers and can influence government for our area. Why would we go back to shouting from the sidelines? \n\"I will spend the next six weeks looking forward, and asking North Devon to support Theresa May's vision of strong leadership, secure government and the best possible Brexit.\" \nLiberal Democrat - Sir Nick Harvey (former MP for North Devon) \nIn a statement released earlier this week confirming he will stand former North Devon MP Nick Harvey said: \"It is obvious to me that North Devon needs something different to a Conservative MP, government, district and county councils. \n\"What have we got to show for it? Losing our services at North Devon District Hospital is a real threat, the school budgets are in turmoil, social care is in crisis, our residential care homes and community hospitals have closed down, Chivenor closing will leave a massive hole in our economy. \n\"The hospital has been there for 40 years serving a vast number of people. My own children were born there and now it is facing a threat like never before. \n\"We have got to stop this from happening. If they are looking at a hospital to be cut, do you think they will close the one from the anonymous backbench MP or the one who will stand up and fight?\" \nREAD NEXT: Devon toddler drowned on holiday in Australia \nUkip - Steve Crowther \n\"North Devon was one of the birthplaces of UKIP (as well as my own). Almost a quarter of a century ago, the seeds of the party took root here, because North Devonians distrusted the EU and wanted to get their country back. \n\"When I stood for the first time in 2010, we were one of only four places in the country where UKIP came third. We have worked to try and spare the countryside and the seascape from the proliferation of wind turbines, to resist the onward march of speculative housing developers and to save the 1000-year-old North Devon fishing fleet from obliteration by the EU Common Fisheries Policy – sadly, unsuccessfully. \n\"A year ago, we achieved the goal we had been founded for, with the win for 'Leave' in the Referendum. It was a massive achievement, in which North Devonians played a significant part. But the job is not done yet. \n\"As well as ensuring that Brexit is properly delivered, that the Liberal Democrats and Labour don't sabotage it, we have to finish the job of taking back control from our professionalised, elite political class. \n\"Ukip has always stood for popular democracy and against remote, expansive and expensive government. By winning Brexit, we have made a huge leap forward, but now we need to reform our democratic institutions, protect the United Kingdom and above all, re-energise our nation's pride in itself and its culture. \n\"As a North Devonian born and bred, I will fight for this unique place: to bring back our fishing fleet, build houses we need where we want them, get our fair share of funding for schools and infrastructure, save our vital hospital and health services, keep RMB Chivenor open and above all bring more jobs to the area.\" \nGreen Party - Ricky Knight \n\"I was selected to be the North Devon Green Party's \"interim candidate\" over a year ago, in the unlikely event of a snap election being called before 2020. \n\"The Prime Minister clearly stated this would not happen. It has; a coldly cynical opportunistic calculated U-turn from a leader clearly buoyed by the perception that Labour are in disarray, by the rise of populism internationally and the sense that the UK needs \"strong leadership\", preferably, it would appear, with no opposition. \n\"May says the country is united but Parliament is intent on derailing her 'Hard Brexit'. The opposite is true: the nation is divided as never before, while Parliament rolls over and acquiesces to her every diktat. \n\"She asks us to judge her on her party's record. In proudly standing for the Green Party for the fourth time, I will be fighting at every stage that abominable record, my energy and commitment fuelled by the sheer effrontery of her expectation that there will be a Tory landslide. \n\"I will fight against the drastic cuts to our treasured, internationally respected NHS, to school funding, to public services, to the prison and fire services, to youth and mental health services and to libraries; I will highlight that in this country, the fifth richest economy in the world, we have food banks, child poverty, homelessness, zero-hours contracts and a system whereby the least able and most vulnerable face sanctions if they fall through the threadbare social security safety-net.\" \nREAD NEXT: Pregnant horse hit by a car and left in ditch has given birth to healthy foal \nLabour - Mark Cann \n\"The real issues facing North Devon are not being addressed by the Tory government. Our schools are facing a funding disaster, our district hospital is under threat, social care is in crisis, we have some of the highest child poverty rates in the country, house prices and rents are too high, our wages too low and we see demand at food banks growing as benefits and support is cut. Meanwhile zero hours contracts mean job insecurity for many. There has to be a better way. \n\"That's why I'm delighted to be chosen by the party to fight this seat again so that I can challenge the Government's record. This election mustn't be focused solely on Brexit. This election will be one where the Prime Minister will be exposed as presiding over a country where the growing wealth divide creates discord and division. An election in which Labour's programme, based on fairness and social justice will resonate increasingly as the campaign goes on. \n\"I'm looking forward to taking Labour's message to the people of North Devon. We will allow councils to build the genuinely affordable houses we need, we will raise the minimum wage to a proper and fair level, we will end unfair work contracts – our schools and hospitals will be properly funded and the tax burden will be more fairly distributed. We will protect pensions and invest in our communities. Labour will return rail to public control and ensure energy supply is managed in the public interest. All policies that I'm confident will resonate well with the communities of North Devon.\" \nMark, who is 66 and married to Val, is a retired Political Studies teacher and lives in Braunton. \nGerrard Sables, who stood last year as the Communist Party candidate, has confirmed the party will not be fielding a candidate in this General Election. ", "external_links": [], "published": "2017-04-27T23:11:00.000+03:00", "crawled": "2017-05-03T11:53:09.000+03:00", "highlightTitle": ""}