{"organizations": [], "uuid": "d1e83545241a46bf1213bea5108e01a3801f34e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12561278.ece/ALTERNATES/s1200/Smoking-bill-report.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/menthol-cigarettes-banned-uk-may-12561272", "country": "GB", "domain_rank": 21960, "title": "Menthol cigarettes will soon be banned along with 10-packs and rolling tobacco", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-20T15:26:00.000+03:00", "replies_count": 0, "uuid": "d1e83545241a46bf1213bea5108e01a3801f34e1"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/menthol-cigarettes-banned-uk-may-12561272", "ord_in_thread": 0, "title": "Menthol cigarettes will soon be banned along with 10-packs and rolling tobacco", "locations": [], "entities": {"persons": [{"name": "ailsa rutter", "sentiment": "none"}, {"name": "coun nick forbes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john mcclurey", "sentiment": "none"}, {"name": "david hambleton", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "northern ccg forum", "sentiment": "none"}, {"name": "department of health", "sentiment": "none"}, {"name": "south tyneside clinical commissioning group", "sentiment": "none"}, {"name": "sun", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "department for health", "sentiment": "none"}, {"name": "the sun", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSmokers are no longer be able to buy a 10-pack of cigarettes or small pouches of rolling tobacco under new laws that came into force in May 2017. \nFrom May, menthol flavoured cigarettes will also be phased out with menthols in 10-packs no longer available by May 21. \nThe changes are part of new tobacco laws from the government, which will eventually culminate in a complete ban by May 2020. \nMenthol and flavoured cigarettes are also due to be completely banned within three years. When will shops no longer sell 10-packs and menthols? \nRules introduced in May 2016 gave shops 12 months to stop selling packets of 10 cigarettes, menthol 10-packs and rolling tobacco with a weight under 30g. \nThis means that from Sunday, May 21, these products will no longer be on sale. \nTobacco products must also follow strict new design guidelines and carry updated health warnings. \nSmokers may notice shops no longer stocking the 10-packs ahead of the ban as supply runs out or retailers stop buying them in. Read More See the huge haul of counterfeit cigarettes seized during a council operation What about bigger packs of menthol cigarettes and flavoured tobacco? \nThere is an additional phasing out period for menthols and flavoured tobacco. They will be gone by May 2020. Why is this happening? \nThe EU passed the Tobacco Products Directive, which calls for standardised tobacco packaging which carries large, uniform “dull green” health warnings. \nThe rules mean tobacco packaging must be at least 60% covered in health warnings, with images and text informing smokers and potential smokers of tobacco’s harm. \nThe same law banned the sale of cigarettes in packs of 10, or tobacco in packs of under 30g. \nNew rules have also been put in place which will mean e-cigarettes have to limit their nicotine levels to 20g. \nIt is hoped that getting rid of cheaper, smaller packets will deter young people from smoking. \nAfter the European court ruling, a Department of Health spokesman said: “Smoking is the biggest cause of premature mortality and kills over 100,000 people every year in the UK. \n“We warmly welcome the judgment that the Tobacco Products Directive is valid and will press ahead with the important public health measures set out in it which are aimed at discouraging children from smoking and helping smokers to quit.” Cigarettes (Photo: Publicity Picture) What will the packaging look like? \nThe new ‘dull green’ packaging will have large graphic images on the front and back of the packets to highlight the health effects of smoking, and health warnings must appear at the top of all packs. \nAt least 60% of the packaging is reserved for health warnings. Will there be an appeal? \nThe High Court threw out a challenge by tobacco companies last year. Read More Are you legally allowed a smoking break at work? Your rights explained But it’s an EU law, could it be scrapped after Brexit? \nMaybe. In August last year, the Sun asked the Department for Health if Brexit could see the menthol ban overturned. \nThe Department for Health told The Sun newspaper: “This is one of the many areas that the Government will want to consider carefully as part of the process of leaving the EU.” \nBut, it’s worth remembering Britain has long heavily-taxed cigarettes, at a rate higher than other EU countries, indicating the Government would be unlikely to soften regulations. Is it a good idea? \nWhen the move was announced last year, it was welcomed by Newcastle City Council. \nCoun Nick Forbes, chair of the North East’s Making Smoking History Partnership and leader of Newcastle City Council, called appealing tobacco branding aimed at children “one of the scandals of the 20th century”. \nHe added: “Changing tobacco packs will help us to reduce the appeal and image of smoking, ensuring future generations are much less likely to develop chronic smoking related illnesses.” Read More More pay, higher car tax, more free child care - how laws coming in in 2017 could affect you What have the experts said? \nDr David Hambleton, chief executive of South Tyneside Clinical Commissioning Group and chair of the Northern CCG Forum, also welcomed the new law and said: “As senior clinicians and commissioners of healthcare services in the North East we see at first-hand the damage that smoking does to the health of people in our region. \n“Smoking harms nearly every organ of the body and reduces both quality of life as well as life expectancy.” \nAilsa Rutter, director of regional smoking action group Fresh, said: “This is a momentous step which will make smoking history for more children in our region and across the country. \n“Hundreds of children start smoking every day and for far too long, tobacco companies have gift-wrapped their poisonous, killer products with bright colours that disguise the death and disease smoking causes.” \nJohn McClurey, an independent newsagent with a shop in Newcastle and a member of Gateshead Council, said: “Working more than 30 years behind the counter, I have seen how the marketing tactics of the big tobacco machine works. I have seen how new tobacco products in bright, attractive packaging come in and the way they appeal to young people. \n“I am certain that the introduction of standardised plain packaging of tobacco products will reduce the appeal and help lower the temptation for more children to start smoking.” Like us on Facebook", "external_links": [], "published": "2017-05-20T15:26:00.000+03:00", "crawled": "2017-05-20T15:44:27.000+03:00", "highlightTitle": ""}