{"organizations": [], "uuid": "4926213569293832f5e2d23f4d2b0e32655b29d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13084155.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-vote-green-everything-you-13083062", "country": "GB", "domain_rank": 21960, "title": "Why should I vote Green? Everything you need to know about the Green Party", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-24T18:54:00.000+03:00", "replies_count": 0, "uuid": "4926213569293832f5e2d23f4d2b0e32655b29d6"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-vote-green-everything-you-13083062", "ord_in_thread": 0, "title": "Why should I vote Green? Everything you need to know about the Green Party", "locations": [], "entities": {"persons": [{"name": "caroline lucas", "sentiment": "none"}], "locations": [{"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brighton pavilion", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "education maintenance allowance", "sentiment": "none"}, {"name": "jonathan bartley green party", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "getty images europe) health  roll", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why should I vote Green? Everything you need to know about the Green Party What you need to know about the Green Party and its policies ahead of the general election on June 8 Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Green Party is a smaller party but it got more than a million votes in the 2015 general election. \nIt has traditionally been particularly interested in the environment but it has policies on a wide range of issues. \nThis article is about the Green Party of England and Wales. The Scottish Green Party is a separate party. \nThe Chronicle has launched a Whatsapp group for general election news. To receive daily messages text GE to 07827 937 000. Add the number to your phone contacts book as ‘Chronicle’. Your number won’t be shared with other members of the group. Who is the Green Party leader? \nThe Green Party has two leaders - Caroline Lucas and Jonathan Bartley Green Party joint leader Caroline Lucas (Photo: PA) How many seats did the Greens win at the last election? \nThe Green Party won one seat in the last general election , which was in 2015. This was the seat of Brighton Pavilion. What are the Green Party’s policies? \nPolicies set out in the Green Party manifesto include: Employment \nA universal basic income will be piloted in a government-sponsored scheme, as a “means to increase security and avoid the poverty trap”. \nPhase in a four-day working week, abolish zero-hour contracts, increase the minimum wage to £10 an hour by 2020 and end the gender pay gap. \nRequire a minimum of 40% of all public sector company boards to be women. \nScrap age-related wage bands. \nIntroduce a “living rent” through rent controls, bring an end to letting fees. \nBuild zero-carbon homes, including 100,000 social rented homes, each year by 2022. \nReinstate housing benefit for under 21s. \nInside Politics newsletter sign up A 'Vote Green Party' sign (Photo: Getty Images Europe) Health \nRoll back privatisation of the NHS . \nIntroduce mental health training in the public sector, and bring mental health care in line with physical health care. Young people \nLower the voting age to 16. \nGreater access to free condoms and sexual health clinics. \nIntroduce non-biased political education to schools. Read More \nAbolish SATS and reduce class sizes. \nScrap university tuition fees, fund full student grants. \nRestore the Education Maintenance Allowance (EMA) , put a greater focus on apprenticeships for those aged 16-25. \nGeneral Election 2017 manifestos Brexit \nA referendum on the details of the Brexit deal, with the option to reject and remain in the EU. \nProtect freedom of movement, safeguard human and environmental rights. Environment \nIntroduce an Environmental Protection Act to restore the environment, enhance biodiversity and promote sustainable food and farming. \nInvest in flood defences and a programme of home insulation. \nReplace fracking, coal, fuel fossil subsidies and nuclear with renewable energy. \nAction to reduce plastic, including Deposit Return Schemes, with a zero waste target. Transport \nRenationalise the railways and increase bus services and rural areas. \nPhase in free local public transport for young people, students, people with disabilities and older people. \nInvest in regional rail links rather than HS2. \nEnd subsidies on airline fuel, and cancel all airport expansion. \nIncrease incentives to take diesel vehicles off the roads. Tax \nReinstate the higher level of corporation tax for big businesses and include a wealth tax on the top 1% of earners. \nIntroduce a “Robin Hood” tax on high value transactions in the finance sector. Tax inheritance based on the wealth of the recipient. \nRemove VAT from sanitary products. Defence \nScrap the Trident nuclear deterrent. \nImplement an immigration and asylum system that “recognises and takes responsibility for Britain’s ongoing role in causing the flow of migrants worldwide”. \nEnd arms sales to “oppressive regimes”. Extremism \nScrap the “xenophobic” Prevent strategy, instead pursuing community-led approaches to tackling extremism in all forms. Like us on Facebook", "external_links": [], "published": "2017-05-24T18:54:00.000+03:00", "crawled": "2017-05-24T14:15:30.000+03:00", "highlightTitle": ""}