{"organizations": [], "uuid": "af7f65d406e1344679913ac462add6b8f91a6b4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30307843/15983369.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/five-questions-we-would-ask-theresa-may-if-she-braved-exeter/story-30307843-detail/story.html", "country": "GB", "title": "WMN_PGoodwin published Five questions we would ask Theresa May if she showed up in...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "WMN_PGoodwin published Five questions we would ask Theresa May if she showed up in...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-03T00:54:00.000+03:00", "replies_count": 0, "uuid": "af7f65d406e1344679913ac462add6b8f91a6b4e"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/five-questions-we-would-ask-theresa-may-if-she-braved-exeter/story-30307843-detail/story.html", "ord_in_thread": 0, "title": "WMN_PGoodwin published Five questions we would ask Theresa May if she showed up in...", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "lyn barton", "sentiment": "none"}, {"name": "cornwall live", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "steve smith", "sentiment": "none"}, {"name": "jeff reines", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "exeter hospital", "sentiment": "none"}, {"name": "royal devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "helston", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "met office", "sentiment": "none"}, {"name": "cornwall live", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Five questions we would ask Theresa May if she showed up in Exeter By WMN_PGoodwin | Posted: May 02, 2017 1 COMMENTS SHARES The PM tucked into chips in Helston, Cornwall, on Tuesday Five questions we would ask Theresa May if she showed up in Exeter X \nCopy link to paste in your message / Comments (1) \nPrime Minister Theresa May faced sparked anger among journalists today during a whistle-stop tour of Devon and Cornwall. \nThe Tory leader stands accused of stage managing her election campaign and failing to engage with reporters and the public. \nDespite a visit which took the Tory leader from Downing Street to Helston, in the far west of Cornwall, she dodged a trip to the Labour stronghold of Exeter, which is also home to Devon Live HQ. \nNews reporters in Cornwall claimed they were treated badly, locked in a room by press officers as the PM toured a factory during the election campaign visit. \nOur sister site Cornwall Live complained that when they did get access, Mrs May avoided any of the complex issues which matter to voters and stuck to her mantra of \"strong and stable leadership\". \nRead: Anger as Theresa May locks reporters out of factory visit ahead of Devon trip \nHere are five questions Devon Live would have liked to put to the Prime Minister: \nWhy do Devon school children receive £268 a head less than the current national average and what does she plan to do about it over the next five years? \nWhen will she deliver on the 2015 election promise to lavish billions in transport infrastructure funding on the region and when will the additional rail link, via Dawlish be funded and built? \nHow will she solve the NHS funding crisis which leaves hospitals, like the Royal Devon and Exeter Hospital – one of the best run hospitals in the country – facing a £20 million deficit? \nCan she guarantee that EU funding for organisations such as the Met Office and Devon universities will be replaced after Brexit? And what barriers will there be to students without freedom of movement? (technically, that's two questions) \nHow will Devon's farmers be funded after EU subsidy payments end – can she guarantee they will not lose out on cash to support businesses and protect the environment? \nCornwall Live claimed its reporter was shut away while Ms May visited the Water-Ma-Trout industrial estate in Helston. \nIn a live blog, the site said: \"We've been told by the PM's press team that we were not allowed to stand outside to see Theresa May arrive. \n\"Theresa May is being introduced to company representatives on the shop floor, but journalists have been kept away. We'll be allowed to ask her questions later in a separate room. \nReporter Lyn Barton, who asked two questions of the PM, said: \"Having covered several high-profile politicians' and royal visits over the years, the level of media control here is far and above anything I've seen before. \n\"We're not even allowed to show you her visiting the building. \n\"Media were locked in a room. Conservative party press officers continue to refuse Cornwall Live access to film an interview with the PM.\" \nThe site's deputy head of content, Steve Smith, said on Twitter: \"Never known a visit like this. Our reporters banned from watching PM walk around a factory by @Conservatives PR team.\" \nHis colleague, Jeff Reines, added: \"We weren't allowed to film her and our reporters were even locked in a room. Democracy in action that is.\"", "external_links": [], "published": "2017-05-03T00:54:00.000+03:00", "crawled": "2017-05-02T20:01:34.000+03:00", "highlightTitle": ""}