{"organizations": [], "uuid": "633a9a02cf72a597980f3fdb5f55937fe8c0948e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30322435/15994065.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/totnes-residents-speak-out-after-buildings-in-the-town-are-covered-in-anti-government-graffiti/story-30322435-detail/story.html", "country": "GB", "title": "Zoe_Stevens published Totnes residents speak out after buildings in the town are...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Zoe_Stevens published Totnes residents speak out after buildings in the town are...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-09T23:40:00.000+03:00", "replies_count": 0, "uuid": "633a9a02cf72a597980f3fdb5f55937fe8c0948e"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/totnes-residents-speak-out-after-buildings-in-the-town-are-covered-in-anti-government-graffiti/story-30322435-detail/story.html", "ord_in_thread": 0, "title": "Zoe_Stevens published Totnes residents speak out after buildings in the town are...", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "chrissie jackson", "sentiment": "none"}, {"name": "dartington", "sentiment": "none"}, {"name": "chrissie", "sentiment": "none"}, {"name": "kate", "sentiment": "none"}, {"name": "veronica", "sentiment": "none"}, {"name": "kate tyler", "sentiment": "none"}, {"name": "robin smith", "sentiment": "none"}, {"name": "joe keeley", "sentiment": "none"}, {"name": "seaton", "sentiment": "none"}, {"name": "lund", "sentiment": "none"}, {"name": "david lund", "sentiment": "none"}], "locations": [{"name": "totnes", "sentiment": "none"}, {"name": "totnes museum", "sentiment": "none"}, {"name": "lower wadden farm", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "teignbridge", "sentiment": "none"}, {"name": "south hams", "sentiment": "none"}, {"name": "east gate arch", "sentiment": "none"}, {"name": "colyton", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "station road", "sentiment": "none"}, {"name": "southleigh", "sentiment": "none"}, {"name": "devon  just", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "exeter prison", "sentiment": "none"}], "organizations": [{"name": "totnes police facebook", "sentiment": "none"}, {"name": "royal british legion", "sentiment": "none"}, {"name": "totnes conservative club", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "conservative club", "sentiment": "none"}, {"name": "unhcr", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Totnes residents speak out after buildings in the town are covered in anti-government graffiti By Zoe_Stevens   0 COMMENTS SHARES Comments (0) \nAfter police released a CCTV image of a man believed to be responsible for a series of politically motivated graffiti messages sprayed onto buildings in Totnes , Devon Live went to speak to locals in the town to see what they thought. \nMost of the local people Devon Live spoke to were in favour of the messages left by the masked man, but disagreed with the execution of the messages. \nMany prominent buildings were targeted in the attack including Totnes Conservative Club upon which 'Choose the Tories on June 8th for 5 more years of Tor(y)ment' was written. Below the graffiti artist then wrote 'P.S. Redo your roof. It's s**t to work on!' \nRobin Smith, from Dartington, said that he is a lifelong labour supporter, but won't vote for Jeremy Corbyn. \nHe said: \"I just don't agree with the way they've done it. I mean, you could get yourself a big moard and write on that, but not on our buildings. No one is listening to this argument. Everyone seems to be stuck on Brexit and no one knows what's going to happen there. \n\"Protesting in this way alienates people, particularly older people who see this as vandalism. I think the sentiment is right, and if you take what the graffiti says rather than the fact it's criminal damage then it is right. \n\"I am a lifelong labour supporter, but I won't vote for Jeremy Corbyn. I won't vote Tory either. I do agree with this message, but not with the way it's been done.\" \nJoe Keeley, who works in Fusion clothes shop next to the East Gate Arch that has been vandalised, said: \"I would say that I definitely agree with the message, but I don't necessarily agree with graffiti like this in public. That's not the way to go about it at all. \n\"Also, seeing as it's the language school, where students come from Europe and all over the world to come and visit the town, it's not a very good first impression at all. \n\"With freedom of speech and everything that's fair enough; if someone was to stand on the street and talk about it and put their view across then that's fair enough. But if you vandalise something kind of sets you off to a bad footing. You haven't got a leg to stand on. No one is going to take you seriously because you've just vandalised something.\" \nChrissie Jackson and Kate Tyler, from Totnes Museum, were at odds about the vandalism. Chrissie said that the graffiti raises political awareness, but Kate said that it was wrong to vandalise the area. \nChrissie said: \"I saw it when I came off the bus. I'm very political, and very left wing, and I approve of this message completely. The more political awareness we have the better, otherwise this election will be a wash as predicted. As long as they haven't damaged any ancient or historic buildings, I say carry on!\" \nKate said: \"People have their comments, but there is no need to destroy the area.\" \nThe incident happened in the early hours of Tuesday morning with officers tracking down a man with a spray can on Station Road. Despite an hour long pursuit police were unable to catch the offender. \nA police spokesman said: \"During the early hours of Tuesday, May 9, the male pictured was responsible for a host of acts of graffiti, targeting prominent walls in the town centre in order to portray his anti-government ideals. \n\"In doing so, he defaced many ancient and historic buildings, many of which are privately owned. The Conservative Club was specifically targeted. \n\"This most recent series of graffiti has caused considerable upset amongst local residents, particularly as one resident had only just finished painting over the last act of vandalism to his property. \nWarning the picture below contains offensive language: \n\"At least one of these acts was witnessed, but that witness did not call the police. \n\"At around 4.10am last night, a male wearing a face scarf, latex gloves and carrying a spray can was seen by police on patrol on Station Road. \n\"The male made off through private gardens and despite an hour long track by a police dog unit, the male was not located.\" \nIf you have any information, contact the police via 101, Crimestoppers or on the Totnes Police Facebook page quoting log 72 of May 9. READ NEXT: \nEast Devon fire crews tackling major lorry blaze \nFire crews in East Devon are tackling a major blaze after three lorries were reported to be on fire. One Fire Engine from Colyton and one from Seaton were sent to a report of a lorry on fire near Lower Wadden Farm, Southleigh, at 3.05pm on Tuesday. \nPetty criminal got jailed so he could smuggle phones into prison up his bottom \nA petty criminal deliberately got himself sent to jail so he could hide two mobile phones up his bottom and smuggle them into prison. Heroin addict David Lund agreed to the scheme to pay off drug debts and made a conscious decision to miss a probation appointment, knowing it would mean he went straight inside. Lund was caught with the two miniature phones as he was being received into Exeter Prison on February 8 after being jailed for 25 weeks for stealing Royal British Legion charity boxes on Remembrance Sunday. \nGet relationship help now to enjoy the summer holiday warn Relate ahead of summer holidays \nA Devon relationship charity has warned parents to seek advice now before the summer holidays so that everyone can enjoy their time together. Development Officer Veronica said: \"The summer holidays are not far away - this can often be a tense time for families. Expectations are often unrealistic about how easy and happy the holidays will be. \"Couples who are both working find they have to juggle their holiday allowance to cope with child care. Family members such as Grandparents, who often help out, might themselves be going away during the summer.\" \nThis is how many Syrian refugees have arrived in Devon \nJust eleven refugee families from war-ravaged Syria have arrived in Devon, it has been revealed. The UK government's Syrian vulnerable persons resettlement programme focusses on Syrian refugees who have fled to the countries around Syria and are registered with the United Nations High Commissioner for Refugees (UNHCR). Across Devon, councils had pledged to take in 41 refugee families, but as of the start of May 2017, just 11 families had arrived, and three more families had houses found for them. Two families have so far arrived in Exeter , with three in Exeter, four in the South Hams and two in Teignbridge.", "external_links": [], "published": "2017-05-09T23:40:00.000+03:00", "crawled": "2017-05-09T20:56:19.000+03:00", "highlightTitle": ""}