{"organizations": [], "uuid": "09f336e2f714325e5d27bef224cd34d13fd72834", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30349230/16013829.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/totnes-conservative-club-makes-the-best-of-the-anti-government-graffiti-on-their-building/story-30349230-detail/story.html", "country": "GB", "title": "Totnes Conservative Club makes the most of anti-government...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-23T21:53:00.000+03:00", "replies_count": 0, "uuid": "09f336e2f714325e5d27bef224cd34d13fd72834"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/totnes-conservative-club-makes-the-best-of-the-anti-government-graffiti-on-their-building/story-30349230-detail/story.html", "ord_in_thread": 0, "title": "Totnes Conservative Club makes the most of anti-government...", "locations": [], "entities": {"persons": [{"name": "joshua reynolds", "sentiment": "none"}, {"name": "combe martin", "sentiment": "none"}, {"name": "plympton", "sentiment": "none"}], "locations": [{"name": "station road", "sentiment": "none"}, {"name": "south molton", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "knowstone", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "whitegates", "sentiment": "none"}], "organizations": [{"name": "totnes conservative club", "sentiment": "none"}, {"name": "totnes police facebook", "sentiment": "none"}, {"name": "ei publican partnerships", "sentiment": "none"}, {"name": "globe inn", "sentiment": "none"}, {"name": "scania", "sentiment": "none"}, {"name": "moortown cross", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "post office inn", "sentiment": "none"}, {"name": "conservative club", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "ford transit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Totnes Conservative Club makes the most of anti-government graffiti on their building By Zoe_Stevens   1 COMMENTS SHARES Totnes Conservative Club made the best of the anti-government graffiti on the side of their building Totnes Conservative Club makes the most of anti-government graffiti on their... X \nCopy link to paste in your message / Comments (1) \nWhen Totnes Conservative Club was one of the buildings targeted by a man who covered various buildings in the town with politically motivated graffiti, they decided to make the best of a bad situation. \nMany prominent buildings were targeted in the attack including Totnes Conservative Club upon which 'Choose the Tories on June 8th for 5 more years of Tor(y)ment' was written. Most of the graffiti has been covered now, but the Conservative Club decided not to cover all of the graffiti on the side of their building; but simply amend it to just 'Choose the Tories on June 8 th '. \nPolice released a CCTV image of the man believed to be responsible for the series of politically motivated graffiti messages. No arrests have yet been made, and the incidents are still under investigation. \nBelow the message on the Totnes Conservative Club, the graffiti artist then wrote 'P.S. Redo your roof. It's s**t to work on!' This has since been painted over. \nThe incident happened in the early hours of May 9 with officers tracking down a man with a spray can on Station Road. Despite an hour long pursuit police were unable to catch the offender. \nA police spokesman said: \"During the early hours of Tuesday, May 9, the male pictured was responsible for a host of acts of graffiti, targeting prominent walls in the town centre in order to portray his anti-government ideals. \n\"In doing so, he defaced many ancient and historic buildings, many of which are privately owned. The Conservative Club was specifically targeted. \n\"This most recent series of graffiti has caused considerable upset amongst local residents, particularly as one resident had only just finished painting over the last act of vandalism to his property. \n\"At least one of these acts was witnessed, but that witness did not call the police. \n\"At around 4.10am last night, a male wearing a face scarf, latex gloves and carrying a spray can was seen by police on patrol on Station Road. \n\"The male made off through private gardens and despite an hour long track by a police dog unit, the male was not located.\" \nIf you have any information, contact the police via 101, Crimestoppers or on the Totnes Police Facebook page quoting log 72 of May 9. READ NEXT: \nMan in car winched back from 20ft drop by fire crew \nFire crews have winched a driver and his car back from the edge of a 20ft drop in Combe Martin. When the three fire crews arrived at the scene in Whitegates the man was stuck in his car which was balanced precariously on the edge of the road with a 20ft drop on the other side. They told the driver to remain in the car while they attached lines and winched him back to safety. \nWhich is your constituency, who is standing and who is likely to win? \nIs immigration the big electoral issue where you live? Or the state of the local economy? Or the NHS? Brexit? Find out instantly with our unique constituency guide. Simply enter your postcode and you'll get a range of crucial information – like who is standing, and who is likely to win. You'll also get a run-down of the major issues in your area using the latest official statistics. \nBarnstaple man, 61, in intensive care with life-threatening injuries after link road crash \nPolice are appealing for witnesses after the head-on crash in South Molton on Monday, May 22, which left three people injured. A white Ford Transit van collided with a Scania pantechnicon furniture removal lorry. Police have now revealed that the driver of the van, who had to be cut free by fire crews, was a 61-year-old Barnstaple man. Both drivers had to be airlifted to hospital. The accident happened at 12.30pm on the A361 at Moortown Cross near Knowstone. The road remained closed in both directions for nine hours. \nEnterprise Inns respond to 'pub war' brewing in Devon \nEI Publican Partnerships, a brewery firm which owns a series of pubs across Devon, has responded to an open letter criticising their business model. It follows news The Globe Inn, Exeter, will be closed by the same company next month - with the tenants of four and a half years offering similar criticisms. The Post Office Inn in Plympton fired shots before the weekend after discovering its neighbour, the Sir Joshua Reynolds gets half-price beer and rent from EI Publican Partnerships.", "external_links": [], "published": "2017-05-23T21:53:00.000+03:00", "crawled": "2017-05-23T18:13:51.000+03:00", "highlightTitle": ""}