{"organizations": [], "uuid": "8179a97b8d2a1bb85f8a212bbfb7c38acee00b3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11923798.ece/ALTERNATES/s1200/JS91598223.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13070662", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Gateshead money printer De La Rue banks 280% rise in plastic note volumes", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-23T15:00:00.000+03:00", "replies_count": 0, "uuid": "8179a97b8d2a1bb85f8a212bbfb7c38acee00b3d"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13070662", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Gateshead money printer De La Rue banks 280% rise in plastic note volumes", "locations": [], "entities": {"persons": [{"name": "martin sutherland", "sentiment": "none"}, {"name": "paul briggs", "sentiment": "none"}, {"name": "zona", "sentiment": "none"}, {"name": "adam tomlinson", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "john hale", "sentiment": "none"}, {"name": "briggs", "sentiment": "none"}, {"name": "hale", "sentiment": "none"}, {"name": "matthew williams", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}, {"name": "sutherland", "sentiment": "none"}, {"name": "paden simmons", "sentiment": "none"}, {"name": "carl fogarty", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "zona", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "liberum", "sentiment": "none"}, {"name": "ross tower", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "de la rue", "sentiment": "negative"}, {"name": "coreena ford newcastle", "sentiment": "negative"}, {"name": "frank recruitment", "sentiment": "negative"}, {"name": "zona", "sentiment": "none"}, {"name": "identity solutions and product authentication", "sentiment": "none"}, {"name": "mcn london motorcycle show", "sentiment": "none"}, {"name": "microsoft dynamics", "sentiment": "none"}, {"name": "topps", "sentiment": "none"}, {"name": "dupont authentication", "sentiment": "none"}, {"name": "coreena ford technology", "sentiment": "none"}, {"name": "nfi", "sentiment": "none"}, {"name": "topps tiles", "sentiment": "none"}, {"name": "dlr analytics", "sentiment": "none"}, {"name": "technology", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "nigel frank international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Workers are shunning 9 to 5 jobs \nRecord numbers of people are turning away from a nine-to-five job in favour of more flexible and independent ways of working, a study has revealed. \nThe trend has led to more women working as well as increased self-employment because of the work-life benefits it brings, said a report by online marketplace notonthehighstreet and Oxford Economics. \nResearch showed there are now 134,000 small creative businesses in the UK, employing 192,000 people. \nStarting a business is now a way back into work for many women who took time off to care for children. \nSimon Belsham, chief executive of notonthehighstreet.com, said: \nIn the last 10 years, thousands of small creative businesses have emerged all over the UK, creating jobs, driving wealth creation and contributing significantly to the economy. \nPerhaps most importantly, however, these businesses are highlighting the huge change under way in the UK workforce, a transformation that is seeing more women in work and more people turning to self-employment and flexible working as they shun the traditional nine-to-five model. \nOur hyper-connected world and advances in technology are allowing more people to find greater autonomy over working lives and fulfilment through work. This is a real gift of our time and our nation of creative entrepreneurs is leading the way, demonstrating what it is possible to achieve both economically and socially, for these businesses and society as a whole. Record numbers of people are turning away from traditional 9 to 5 jobs (Photo: iStockphoto) 9.10 Coreena Ford New £3m Fun Shack and Jump 360 park in Newcastle set to create 100 jobs \nLeisure and fun is a serious business for the Freeman family, who are set to open the fourth in seven planned new Fun Shack Group facilities in Benfield. \nBased in Seaham, the group already run several activity centres in the North East and they run three brands - the Fun Shack, Jump 360 trampoline park and Clip n Climb....and now they’ve been granted permission to transform a former warehouse in Benfield, Newcastle, into their biggest complex yet, encompassing all three of their popular brands. \nAround 100 jobs will be created too - and more centres are set to follow. Jump 360, Fun Shack AND Clip n Climb is coming to Benfield next year (Photo: Jump 360) 8.55 Coreena Ford Tourism boom boosts property firm Shaftesbury \nWest End property giant Shaftesbury has rung up a 28% jump in half-year profits amid booming tourist trade in London from the Brexit-hit pound. \nThe group - which owns swathes of shops and restaurants spanning Covent Garden, Soho and Chinatown - said its retail and leisure tenants were seeing strong sales growth as surging tourist spend has helped the West End “flourish”. \nTourists have been flocking to London to take advantage of the pound’s plunge since the Brexit vote, with luxury brands such as Burberry reporting impressive sales hikes in recent months. \nShaftesbury reported profits of £102.4 million for the six months to March 31, up from £80.1 million a year earlier. \nThe net asset value of its portfolio - a key measure for property firms - rose 3.4% to £2.5 billion. Shaftesbury owns swathes of shops and restaurants in the West End of London 8.50 Coreena Ford A Meeting With: David Cox, partner at Malcolm Hollis Newcastle \nOur regular feature A Meeting With is getting increasingly popular since we launched it in February and today’s subject under the spotlight is David Cox, who launched the Newcastle office of chartered building and property surveyors Malcolm Hollis 10 years ago. \nHere he muses over tricky cases, changing technology for surveyors and how he set up the office. And if there are any business leaders out there who want the chance to appear in this slot drop us an email! David Cox, partner at Malcolm Hollis Newcastle 8.40 Coreena Ford 140 jobs created by apprenticeship drive at Newcastle housing company \nNearly 150 apprenticeships are being created by one of the UK’s largest housing companies, with many of the new roles at its Newcastle headquarters. \nHome Group will create around 140 apprenticeship roles during the next 12 months, more than doubling the 60 vacancies it currently offers. \nThe apprenticeships will be in a variety of roles, including customer services, health and social care, office administration, housing, building development and information technology. \nAnd having previously ring-fenced the roles for tenants as part of its commitment to provide career opportunities to its customers, some of this year’s new roles will be made available to the general public. \nHome Group chief executive Mark Henderson said: “I firmly believe that every business should employ apprentices. Apprentices bring with them enthusiasm and a desire to learn new skills as they progress in their chosen careers. \n“Bringing in people who haven’t previously worked in a specific role also brings with it new ideas. Home Group has benefitted from innovative ideas and new ways of working thanks to us listening to our apprentices, who often have a fresh perspective on things.” \nHome Group’s apprenticeship vacancies will be available throughout the UK but the majority will be on Tyneside where the company’s headquarters and customer service centre is based. Home Group chief executive Mark Henderson 8.35 Coreena Ford Fewer leaks and floods gives Severn Trent a boost \nUtility giant Severn Trent has reported a rise in full-year profits after the firm was boosted by fewer leaks and floodings. \nBritain’s biggest listed water company said underlying pre-tax profit rose 4.3% to £525m in the year to March as turnover increased 3.7% to £1.8bn. \nSevern Trent, which claims to have the lowest combined average bills in Britain at £341 per year, added it has seen a reduction in sewer floodings, supply interruptions and leakages following £680m of investment. \nThe group’s full-year net customer outcome delivery incentive reward, doled out for meeting targets such as improving customer service, was £47.6m. Severn Trent also said total efficiency savings will now total £770m by 2020, up £100m. \nChief executive Liv Garfield said: “We are delivering both strong customer-focused and financial outperformance this regulatory period, and we feel it is now appropriate to share this with our investors. \n“The board is therefore pleased to announce an upgrade to our ordinary dividend policy, to growth of at least RPI +4%.” \nThe company proposed a final dividend of 48.9p, taking the full-year dividend to 81.5p. \nShares rose 2% to 2.498p in morning trading. Some water yesterday Coreena Ford Nationwide's profits plunge 23% amid low interest rates \nNationwide Building Society has seen its annual profits tumble by nearly a quarter after it moved to protect savers from rock-bottom interest rates. \nThe mutual reported a 23% plunge in underlying pre-tax profits to £1.03bn for the year to April 4 after it was hit by the Bank of England’s decision to slash rates to 0.25% last summer following the Brexit vote. \nNationwide said it gave members a £505m boost by keeping its savings deposit rates higher than rivals while passing on the base rate cut to mortgage borrowers in full. Its move to protect savers helped see the group’s deposit balance surge by £5.8bn, while it notched up record membership of 15 million. On a bottom-line basis, profits fell 17.6% to £1.05bn, but the group insisted profits remained within its target range. \nChief executive Joe Garner said: “As a member-owned organisation, we don’t seek to maximise our profits, but to manage them in our members’ interests. “We make conscious choices about how we distribute our profitability between strategic investment, capital generation and member financial benefit.” Nationwide said it was seeing “tentative” signs of a slowdown in the wider economy, with Brexit-fuelled inflation affecting household spending. \nIt warned over a slowdown in house price growth, with property values set to rise by 2% this year and “scope for a further softening in 2018 to 2019”. A Nationwide branch Coreena Ford Newcastle's Frank Recruitment opens in Dallas as global expansion continues \nNewcastle’s Frank Recruitment has taken another step in its global expansion plans after launching an office in Dallas, Texas. \nThe firm, which specialises in niche technology recruitment, will initially hire 100 people at its new US office but aims to grow this to 300. \nFrank Recruitment’s Dallas office officially launches on June 5 and will take over the 24th floor of Ross Tower. The team will focus on work for the group’s signature brand, Nigel Frank International (NFI), which specialises in recruiting tech professionals for Microsoft. \nNFI executive vice-president Paul Briggs and vice-president Paden Simmons have been tasked with leading the office. \nMr Briggs said: “We’re thrilled to be building an exciting and dynamic team here in Dallas. \n“As the global leader in Microsoft recruitment, we are looking forward to training and working with the best local talent and supplying skilled Microsoft Dynamics and Stack professionals to employers both in America and abroad.” \nWith over 500,000 workers in the tech sector, Texas is the second biggest tech hub in North America. \nFrank Recruitment was founded in Newcastle in 2007. Over the last four years the group has undergone rapid expansion, growing from 254 staff in 2013 to over 1,400 today. Frank Recruitment has launched an office in Dallas 8.20 Coreena Ford Technology to give motorcyclists improved rear vision launched by a North East firm \nTechnology designed to give motorcyclists improved rear vision and increase safety has been launched by a North East firm. \nZona – a new motorcycle wearable tech – has been set in motion at the MCN London Motorcycle Show in bid to provide a solution to the problem of poor rear vision for motorcyclists. \nUsing patented technology and advanced optics, Zona is an in-helmet display wirelessly linked to an intelligent rear camera that can be fitted into any helmet and on to any bike, and it has been engineered to extend the rider’s view, thereby enhancing the riding experience. \nSince launching at the exhibition in London it has been purchased by customers in the UK, Europe and seven other countries. The tech was created in a collaboration between seven times world champion Carl Fogarty and North East biker John Hale, the founder and CEO of Zona. Zona, based in Bishop Auckland, County Durham, has been a real labour of love for Mr Hale, who initially came up with the idea back in 2003 when he was nearly knocked off his motorbike on his way to work after not being able to see a motorist behind him. \nInitial research and designs led him to putting the idea on hold until the correct technology was available. \nIn 2010, John secured £100,000 funding to develop the first prototype to prove the concept of Zona. \nMr Hale said: “We’ve been blown away by the fantastic response to ZONA. \n“We were hoping for a positive reaction, and this was even better than we had expected.” The Zona technology designed for motorcyclists (Photo: Copyright unknown) 8.15 Coreena Ford Profits dip at Topps Tiles \nProfits at Topps Tiles slumped in the first half of the year as the tiling retailer flagged a slowing housing market and challenging market conditions. \nThe group said pre-tax profits in the six months to April 1 fell 5.9% to £9.5m while revenues dipped 1.3% to £106.6m and like-for-like sales declined 1.9%. Topps said trading in the period reflected “a more challenging market” and the group pointed to tough comparatives last year, when housing transactions were on the up ahead of stamp duty changes which came into effect in April 2016. \nThe firm added trading in the second half to date has been “more challenging as a result of a weaker macro environment”. \nChief executive Matthew Williams said: \nOur results for the first half reflect the more challenging macro-economic environment we have traded through so far in 2017. \nThe key macro indicators for our market are weaker year-on-year and we are taking a prudent view of the second half prospects. \nOn a brighter note, Mr Williams said Topps is evaluating a number of small acquisition opportunities. \nAdam Tomlinson, analyst at Liberum, said: “We continue to believe Topps’ leading, specialist market position leaves it better placed than competitors to weather softer trading conditions and we expect the ongoing store roll-out, focused strategy and opportunity in the commercial sector to drive long-term growth. A Topps Tiles store (Photo: Topps Tiles/PA Wire) 8.08 What's the latest on the FTSE? \nThe FTSE-100 index opened at 7496.34. \nThe pound at 8am was 1.2965 dollars compared to 1.3007 dollars at the previous close. The euro at 8am was 0.8656 pounds compared to 0.8638 pounds at the previous close. 8.00 KEY EVENT Gateshead currency printer De La Rue sees 'plastic' banknote volumes soar \nDirectors at De La Rue, the biggest designer and printer of bank notes in the world, have hailed a strong performance with banknote print volumes reaching a seven year high and plastic note volumes quadrupling in a year. \nThe firm is currently two years into a five year strategy to diversify and the firm’s chief executive Martin Sutherland noted a solid performance in a year which also saw the firm make its first acquisition in 14 years. \nThe firm, which has a manufacturing facility in Gateshead, said sales were up 2% to £461.7m, while adjusted operating profit was also marginally up from £70.4m to £70.7m for the year ended March 25 2017. \nChief executive Martin Sutherland said the firm has seen a resilient performance in its currency business, improved mix in banknote print and increased paper volumes, which was partially offsetting the impact of a concluded security features contract. \nBanknote print volumes were imilar to last year at 7.1bn notes and polymer volumes nearly quadrupled to 380 tonnes. \nBanknote paper volumes increased by 18% to 11,800 tonnes, a seven year high. \nMr Sutherland said: \n“De La Rue has delivered a good performance this year. We are two years into our five year strategic plan and have made solid progress against our objectives to diversify the business and improve the quality of earnings. Identity Solutions and Product Authentication are both delivering good growth and are underpinned by the resilience of our Currency business. \n“Our investment in product management and R&D has seen us introduce six new products into our pipeline, including DLR Analytics, a software solution to help central banks manage their cash cycle requirements. We are already piloting with 26 countries at launch. \n“In January, we completed our first acquisition in 14 years. DuPont Authentication is a business with a strong intellectual property portfolio, global blue-chip customers and a committed and experienced workforce. This transaction further strengthens our position in the strategically important and growing product authentication market. \n“With continuing good momentum in delivering our 2020 strategic plan and a strong 12 month order book of £387m, I am confident that we will deliver on our expectations for the year.” \nDe La Rue’s share price is currently up 1.08% to 653.50. De La Rue products ", "external_links": [], "published": "2017-05-23T15:00:00.000+03:00", "crawled": "2017-05-23T10:31:19.000+03:00", "highlightTitle": ""}