{"organizations": [], "uuid": "7bf7ea420e590ab4683765bd7da87f685cc52978", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11784297.ece/ALTERNATES/s1200/CS44363713.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13034823", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Businesses fear more cyber attacks as working week gets underway", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-15T14:55:00.000+03:00", "replies_count": 0, "uuid": "7bf7ea420e590ab4683765bd7da87f685cc52978"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13034823", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Businesses fear more cyber attacks as working week gets underway", "locations": [], "entities": {"persons": [{"name": "damian brewer", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "doug monro", "sentiment": "none"}, {"name": "barnes", "sentiment": "none"}, {"name": "robin byde", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "mike bell", "sentiment": "none"}, {"name": "dilaila galbraith", "sentiment": "none"}, {"name": "helen stokes-lampard", "sentiment": "none"}, {"name": "malwaretech", "sentiment": "none"}, {"name": "jonathon manning aldi", "sentiment": "none"}, {"name": "matthew barnes", "sentiment": "none"}, {"name": "adzuna", "sentiment": "none"}, {"name": "leo bell", "sentiment": "none"}, {"name": "marcus hutchins", "sentiment": "none"}, {"name": "leo", "sentiment": "none"}, {"name": "ciaran martin", "sentiment": "none"}, {"name": "brad smith", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "air berlin", "sentiment": "none"}, {"name": "watford", "sentiment": "none"}, {"name": "byker bridge", "sentiment": "none"}, {"name": "adzuna", "sentiment": "none"}, {"name": "tynemouth", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "ouseburn", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "northumbria specialist emergency care hospital", "sentiment": "none"}, {"name": "national cyber security centre", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "rbc capital markets", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}, {"name": "asda", "sentiment": "none"}, {"name": "stepney bank", "sentiment": "none"}, {"name": "aldi uk", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "a&e", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "ncsc", "sentiment": "none"}, {"name": "brewpub & kitchen", "sentiment": "none"}, {"name": "arch", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "alitalia", "sentiment": "none"}, {"name": "new arch", "sentiment": "none"}, {"name": "cantor fitzgerald", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "royal college of general practitioners", "sentiment": "none"}, {"name": "newcastle brewing co ltd", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The FTSE-100 index opened at 7435.39. \nThe pound at 8am was 1.2921 dollars compared to 1.2879 dollars at the previous close. \nThe euro at 8am was 0.8464 pounds compared to 0.8485 pounds at the previous close. 8:39 Jonathon Manning New Arch 2 brewpub set for Ouseburn opening as father and son's microbrewery expands \nAn old tyre garage in Newcastle has been transformed into a brewpub and kitchen in a partnership between a father-and-son microbrewery business and Tynemouth coffee shop Dil and the Bear. \nMike Bell and his son Leo first laid down plans to expand their craft brewery Newcastle Brewing Co Ltd last June, just over a year after discovering they had a knack for developing bold beers following a night out at Newcastle’s BrewDog pub, where they bought a ‘brew your own beer’ kit. \nUntil now, the firm has been based in two units at the i4-Quayside business hub. \nBut from next weekend it can be found at Arch 2 Brewpub & Kitchen, set in an arch under Byker Bridge on Stepney Bank in the vibrant Ouseburn area of the city, after teaming up with well establish Tyneside business Dil and the Bear. \nLaunching to the public on May 19, Arch 2 includes an open plan bar, cafe, beer garden and microbrewery that will accommodate up to 80 people. The venue will offer 10 keg lines, including lagers, dark stouts and porters. Most beer will be brewed on site as well as hosting regular guest beers from local breweries. \nThe site has been restored by Leo and Mike Bell and Dil and the Bear owner Dilaila Galbraith, and will be open daily serving breakfasts from 9am and meals and drinks until closing at 11pm. \nLeo Bell, 38, said: \n“Ouseburn is a buzzing area with lots of interesting and popular pubs along with several places of interest. \n“As part of our new venture we wanted to add to the wealth of great pubs and restaurants in the area, whilst offering something a little different and where possible use local suppliers and businesses. Leo and Mike Bell at their micro brewery in Ouseburn 8:30 Jonathon Manning Robots taking jobs from translator to travel agent - and writers could be next \nRobots are taking over an increasing numbers of jobs, with automation replacing posts such as pharmacy assistants, travel agents and translators, a study reveals. \nTwo-thirds of the fastest-declining jobs are linked to increased automation and technological advances, said jobs site Adzuna. Illustrators and writers also feature in a list of declining occupations caused by automation. \nIn contrast, there are a number of other occupations that are growing, including nail technicians and retail security officers, said the report. \nDoug Monro, co-founder of Adzuna, said: \nThe robots are not just coming, they are here already - in our pockets, workplaces and homes. \nAutomation is already replacing jobs and could be set to replace some roles, like translators and travel agents, entirely. But, at least in the short term, artificial intelligence advances seem to be creating new jobs just as fast. \nTech is changing the shape of industries in more complex ways than previously predicted. For example in the creative and design fields, previously feted as ‘robot-proof’, we are seeing that software and technological tools can help even the most creative of professionals automate tasks, find efficiencies in workflows, and change the way they work. “Employers and jobseekers alike will need to anticipate and react to this high rate of change or they risk being left behind. Titan the Robot meets school children at Work Discovery Week at the Stadium of Light 8:25 Jonathon Manning Aldi could open dozens of new supermarkets in North East under expansion plan \nThe boss of Aldi has outlined aggressive expansion plans that could see the German supermarket open dozens of new stores in the North East . \nMatthew Barnes indicated in an interview with industry magazine The Grocer that Aldi could open up to eight stores in some British towns, piling further pressure on its more established rivals. \nHe said: \nIf you look at the population, we think not only could we have a store in every town and city, but for every 25,000 to 30,000 people. \nMr Barnes’ plans could see Aldi open up to 11 stores in Newcastle, where it currently has two, or 12 in Northumberland, where it has three at present. \nAldi currently has 700 British outlets and, according to Mr Barnes’s calculations and the UK population, this could increase to 2,600 stores as part of the firm’s expansion plan. \nSuch an expansion would see Aldi go toe to toe with Tesco, which has around 2,700 supermarkets and convenience stores in the country. \nMr Barnes added that he expects Aldi to grow quicker than its 2022 target of 1,000 stores, with the total closer to 1,300. \n“We have 700 stores now and 300 sites already approved on our books. \n“And there are 600 town locations where we don’t have a store; in many of which we could easily have two, three or four stores ... We don’t have a store in Watford, (but) that would be a six to eight Aldi town.” \nThe emergence of Aldi and its fellow German grocer Lidl has shook the grocery sector’s so-called Big Four - Tesco, Asda, Sainsbury’s and Morrisons - who remain locked in a bitter price war sparked by the duo. Aldi UK and Ireland of their chief executive Matthew Barnes (Photo: PA) 8:20 KEY EVENT Brexit currency woes set to deepen easyJet losses \nBudget airline easyJet looks set to deepen half-year losses next week, as it grapples with currency headwinds from the Brexit-hit pound and costs linked to launching a new European base. \nAnalysts expect losses at the low-cost carrier to expand to around £210m, in contrast to a £24m loss over the period last year - with the lion’s share of the blow coming from sterling’s weakness. \nThe half-year results are also expected to include a £10m hit for an air operation certificate. The group is in the midst of setting up a new operating company in mainland Europe and applying for a new licence to secure flying rights for 30% of its routes after Brexit. \nWhile Tuesday’s results could reveal a tough period for the firm, the airline will look to bounce back over the summer by capitalising on the trading woes of rival carriers, such as Alitalia and Air Berlin. \nHowever, Damian Brewer, analyst at RBC Capital Markets, said the widening losses for the first half of the year will make it harder for the firm to hit full-year targets. He said: \nWe see first half profit-before tax deteriorating to a £210m loss, potentially. \nHowever, the concern to us is that to make the company outlook implied £360-£370m full year profit before tax, a significant profit recovery will be required in the second half. \nEasyJet said in January that the weak pound was expected to cost it around £105m over its 2016/17 financial year, up from the £90m estimated in November, with fuel expenses also falling by less than expected. \nIt added on top of the extra £35m fuel and pound bill in the first quarter, it also saw a financial impact in the “low millions” from the deadly truck attack in Berlin on December 19, as bookings to the city dropped in the immediate aftermath. \nTravel companies have seen demand to key tourist locations and capital cities wane following a number of terror incidents across the globe, including an attack in London which killed five people and left dozens of others injured on March 22. \nRobin Byde, transport analyst at Cantor Fitzgerald, added: \nEasyJet offered a cautious outlook for the year in its .... first quarter statement. \nWe now think that the risks to earnings from capacity growth by rival carriers and weak sterling are fully priced-in. \nDemand for leisure travel is holding up well and disruption to operations from air traffic control strikes is muted. \nEasyJet revealed its first fall in annual profits for six years in November after being buffeted by the plunging pound, terrorism fears and air strikes. The group posted a 27.9% tumble in pre-tax profits to £495m for the year to September 30, after the sharply weaker pound cost it £88 million and it suffered a blow of around £150 million from “unprecedented” events. An easyJet plane (Photo: PA) 8:15 Jonathon Manning Cyber attack 'accidental hero' fears for his safety \nThe British IT expert who slowed the spread of the WannaCry global cyber attack now fears for his safety. \nThe security researcher, named in reports as Marcus Hutchins, 22, was hailed an “accidental hero” for his discovery of the virus’s kill switch. However he has said he is now concerned that “terrible things” may be done in retaliation for his efforts. \nSpeaking to MailOnline, the cyber specialist, who goes by MalwareTech, said: \nIn future someone might want to retaliate - they could find my identity within seconds. If they know where I live, they could really do anything. \nHe referred to the case of another security blogger who was subject to intimidation, including death threats, after his identity was leaked online. \nMalwareTech added: \nI’ve seen posts about the terrible things people have done to him and for me in future it could be the same things. \nThe keen surfer, who reportedly lives in Devon, was praised by the National Cyber Security Centre (NCSC) for his part in tackling the ransomware’s propagation around the world. \nHe became an international sensation after he prevented hundreds of thousands of computers from being infected by the virus that wreaked havoc across the NHS. The blogger said he was “jumping around a room with the excitement” after he discovered that activating a specific web domain could disable the worm. \nMalwareTech said he had also been providing the NCSC with data to help notify infected companies, warning that computers which had not had their security brought up to date will be vulnerable to further attack. Hooded computer hacker (Photo: iStockphoto) 8:10 KEY EVENT Warning of more cyber attack cases as people return to work after weekend \nThe full scale of the international cyber attack that continues to disrupt the NHS, and hit brought Nissan’s Sunderland factory to a halt, may only become apparent when people return to work today, experts have warned. \nMore than 200,000 victims in around 150 countries have been infected by the ransomware which originated in the UK and Spain on Friday before spreading globally. \nCiaran Martin, chief executive of the National Cyber Security Centre, said the outbreak could continue to infect more systems and other victims may emerge. He said: \nOn Monday morning at the start of the new working week it’s likely that successful attacks from Friday that haven’t yet become apparent will become apparent. \nAnd also existing known infections can spread, we can’t say what scale the new cases will occur at but it’s likely there will be some. \nIt is not known how the attack has affected GP surgeries, which are due to open as usual on Monday. An NHS England spokesman described it is a “very complex emerging picture”. \nPeople are advised to attend any hospital or doctor appointments as normal, unless they are contacted and told not to. \nProfessor Helen Stokes-Lampard of the Royal College of General Practitioners said many GPs went into their practices on Sunday to reboot their computers and install updates. She said: \nGPs, of course, can still diagnose and treat patients without using computers but we ask our patients to bear with us if routine services such as repeat prescriptions and appointment booking services are slightly disrupted this week. \nIn the meantime, we wish to reassure patients that your GP will be there for you as usual if you are taken ill and that you will receive the best possible care from the NHS, despite the current difficulties. \nAround a fifth of NHS trusts were hit in the attack, forcing them to postpone operations and procedures over the weekend. Seven hospitals remained on A&E divert on Sunday afternoon, with ambulances taking emergency patients elsewhere, NHS England said. \nIt comes amid concerns networks were left vulnerable because they were still using outdated Windows XP software. Brad Smith, Microsoft president and chief legal officer, described what happened as a “powerful reminder” of the importance of updating software. A patch to fix the issue which led to the fault was released two months ago. \nMedical staff reported seeing computers go down “one by one” as the Wanna Decryptor ransomware, also known as WannaCry, took hold, locking machines and demanding money to release the data. Northumbria Specialist Emergency Care Hospital, in Cramlington, was hit by last week's cyber attack (Photo: Daily Mirror) Share", "external_links": [], "published": "2017-05-15T14:55:00.000+03:00", "crawled": "2017-05-15T11:35:11.000+03:00", "highlightTitle": ""}