{"organizations": [], "uuid": "3202f313e68b418e8207baae326376135bc00ac5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13113748.ece/ALTERNATES/s1200/JS121312986.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-defends-jeremy-corbyns-failure-13113463", "country": "GB", "domain_rank": 21960, "title": "Labour defends Jeremy Corbyn's failure to visit the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-31T01:21:00.000+03:00", "replies_count": 0, "uuid": "3202f313e68b418e8207baae326376135bc00ac5"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-defends-jeremy-corbyns-failure-13113463", "ord_in_thread": 0, "title": "Labour defends Jeremy Corbyn's failure to visit the North East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour defends Jeremy Corbyn's failure to visit the North East Shadow Cabinet members have been to the North East during the election campaign but the Labour leader has yet to make an appearance Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nLabour have defended Jeremy Corbyn’s failure to visit the North East so far during the general election campaign. \nConservative leader Theresa May was in North Shields on May 12, where she delivered a speech urging working class voters who have backed Labour “for generations” to switch to the Tories. \nBut Mr Corbyn has not yet come to the region - even though it is often seen as Labour’s heartland. Labour leader Jeremy Corbyn (Photo: Dominic Lipinski/PA Wire) \nAnd unusually, there is a chance Labour could lose some North East seats to the Conservatives, in the general election on June 8. \nLabour pointed out that visits from Shadow Cabinet members have included Shadow Education Secretary Angela Rayner visiting the Blaydon constituency and Shadow Health Secretary Jon Ashworth visiting Tynemouth. \nA Labour North spokesperson said: “Members of the Shadow Cabinet have visited the region during the campaign to support our fantastic candidates and to highlight why only a Labour Government will stand up for the many not the few, here in the north east.” Shadow Secretary of State Angela Rayner MP speaks at the TUC 2016 in Brighton (Photo: Daily Mirror) \nThe Chronicle understands that Mr Corbyn is likely to visit the North East before polling day. \nHowever, neither of the two major parties announce visits more than a day in advance, partly for security reasons and partly to avoid criticism if plans have to be changed. \nWansbeck Labour candidate Ian Lavery is playing a crucial role in Labour’s general election campaign, as joint election co-ordinator. \nAnd Labour’s manifesto includes plans to transform the way the Government allocates funding, by introducing new rules to ensure English regions outside London and the south east get a fairer share of investment. Jon Ashworth, Shadow Secretary of State for Health (Photo: Getty Images Europe) \nIt also includes a planned new rail line between the North East and North West, which Labour calls “Crossrail for the North”. Labour leader Jeremy Corbyn said during his manifesto launch: “One of our key commitments is a Crossrail for the North, from Manchester across to Newcastle .” Read More Who should I vote for in the 2017 general election? The runner and riders are all here \nHowever, some Labour candidates in the region appear to believe their best hope of victory is to distance themselves from Mr Corbyn as much as possible. \nSedgefield Labour candidate Phil Wilson published an election leaflet saying: “I am no supporter of [Theresa] May and I am no supporter of Corbyn. The only people I support are YOU, the people of Sedgefield constituency.” Sedgefield MP Phil Wilson (Photo: Ian Nicholson/PA Wire) \nConservative leader Theresa May used a campaign speech to make a joke about Jeremy Corbyn being “alone and naked” in the Brexit negotiations. Read More Jeremy Corbyn versus Theresa May - who won the Battle For Number 10? \nShe said only she had “the plan to make Brexit a success ”, adding: “Jeremy Corbyn’s minders can put him in a smart blue suit for an interview with Jeremy Paxman, but with his position on Brexit, he will find himself alone and naked in the negotiating chamber of the European Union. \n“I know that’s an image that doesn’t bear thinking about. But actually, this is very serious.” \nBut Labour Deputy Leader Tom Watson said this week that Conservatives are “hell bent on viciously attacking Jeremy Corbyn” to cover up Mrs May’s faults. Like us on Facebook", "external_links": [], "published": "2017-05-31T01:21:00.000+03:00", "crawled": "2017-05-30T20:34:01.000+03:00", "highlightTitle": ""}