{"organizations": [], "uuid": "fb48293df8cbc7f234dcbd0183db5f70b1d3fc0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13047622.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/liberal-democrat-manifesto-tim-farron-13047624", "country": "GB", "domain_rank": 21960, "title": "Liberal Democrat manifesto: Tim Farron says he wants to be leader of the opposition", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-17T19:01:00.000+03:00", "replies_count": 0, "uuid": "fb48293df8cbc7f234dcbd0183db5f70b1d3fc0a"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/liberal-democrat-manifesto-tim-farron-13047624", "ord_in_thread": 0, "title": "Liberal Democrat manifesto: Tim Farron says he wants to be leader of the opposition", "locations": [], "entities": {"persons": [{"name": "tim farron", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "berwick julie pörksen", "sentiment": "none"}, {"name": "farron", "sentiment": "none"}, {"name": "mr farron", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands engine", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "coalition the lib dems", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pa)  liberal democrats", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nLiberal Democrat leader Tim Farron will ask voters to make him the official leader of the opposition, as he launches an election manifesto promising a fresh referendum on Brexit and a penny on income tax to fund the NHS. \nLib Dem plans also include £7bn to help struggling schools, and extra cash to help ensure pupils from less wealthy backgrounds get the best possible start in life. \nBut Mr Farron will rule out any repeat of the coalition government that ran Britain from 2010 to 2015, when the Lib Dems joined forces with the Tories - saying he will refuse to go into coalition either with Theresa May’s Conservatives or Jeremy Corbyn’s Labour Party. \nInstead, he will claim that Theresa May is “on course to win” the General Election on June 8, and ask voters to let the Lib Dems replace Labour as the second-largest party in the House of Commons. \nWriting in the manifesto’s introduction, Mr Farron will say: “There is a complete absence of real opposition from Jeremy Corbyn’s Labour Party.” \nAnd he will urge voters: “Governments without a strong opposition are bad governments. They become complacent and take poor decisions. \n“So I am asking you to give me your support to make the Liberal Democrats the official opposition to Theresa May’s Conservative government.” Tim Farron (Photo: PA) \nLiberal Democrats say their plans to extend the “pupil premium”, extra funding that goes to schools which teach pupils from disadvantaged backgrounds, would benefit 9,500 pupils across the North East, with extra cash going to nurseries, preschools and school receptions. \nGateshead schools get an additional £410,000; Newcastle schools get £803,252; Sunderland schools get £665,176, and Northumberland schools get £438,552. \nThis comes on top of the current pupil premium allocations, which Lib Dems say they were responsible for introducing while they were members of the Coalition government. \nLiberal Democrat candidate for Berwick Julie Pörksen said: “We will give children in Northumberland across the North East a brighter future, by investing in those from more deprived backgrounds to give them the best possible chance in life. \nHighlighting another manifesto commitment, she said: “I am particularly pleased that my campaigning on the issue of the cost of post-16 transport for school and college transport in Northumberland has been heeded with a commitment to introducing a discount bus pass for 16-21 year olds. This will be a significant help to young people facing long journeys to travel to study at FE colleges and sixth-forms.” \nFlagship manifesto policies include: \n* A referendum on the final Brexit deal agreed between the UK and the EU - and one of the options on the ballot paper would be to stay in the EU. \n* A 1p rise in the basic, higher, additional and dividend rates of income tax in the next financial year raising around £6bn per year, which will ringfenced to be spent on NHS, care services and public health. \n* Spending nearly £7 billion extra on education, increasing school budgets and the Pupil Premium while opposing the creation of any new grammar schools. \n* A £100bn package of infrastructure investment to help build 300,000 homes a year, improve road and rail links and install fibre-optic broadband across the UK. Liberal Democrats support pressing ahead with the HS2 high speed rail line, and say they will “continue to champion the Northern Powerhouse and Midlands Engine initiatives and invest significant capital resources in infrastructure projects across the north of England and the Midlands.” Read More Benefits blow: Bosses admit there is a target for rejecting claims \nThe manifesto says that in the long term, Lib Dems want a dedicated “health and care tax” to fund the NHS, possibly created through reforming National Insurance. \nThe party also supports reversing a number of benefit cuts introduced by the present government - and by the Coalition the Lib Dems were once part of - such as the “bedroom tax”, which cuts housing benefit for some tenants. \nAnd the manifesto pledges £300 million a year to local police forces, which Lib Dems say would reverse the increase in violent crime and increase confidence in the police. \nLib Dems always face questions about whether they will actually be in a position to carry out their plans, but in previous elections they have sometimes highlighted the possibility of a hung Parliament in which they would hold the balance of power and could become part of a coalition government. \nThis time, however, Mr Farron is ruling that option out. \nHe said: “On the biggest question facing all of us, Brexit, which has such huge implications for our young people and our future, Corbyn ordered his MPs to stand down against Theresa May’s government. Where the Liberal Democrats are fighting every step of the way, Labour is holding Theresa May’s hand as she jumps off the cliff edge of a hard Brexit. \n“That’s why the Liberal Democrats will not enter into coalition with either Theresa May’s Conservatives or Jeremy Corbyn’s Labour.” Read More", "external_links": [], "published": "2017-05-17T19:01:00.000+03:00", "crawled": "2017-05-17T14:29:28.000+03:00", "highlightTitle": ""}