{"organizations": [], "uuid": "b152934eb1569b38345fec61af2a41f187feaa43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13039919.ece/ALTERNATES/s1200/JHP_MDM_300916McLoughlin_11.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tories-play-down-talk-election-13039797", "country": "GB", "domain_rank": 21960, "title": "Tories play down talk of an election breakthrough in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-16T12:00:00.000+03:00", "replies_count": 0, "uuid": "b152934eb1569b38345fec61af2a41f187feaa43"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tories-play-down-talk-election-13039797", "ord_in_thread": 0, "title": "Tories play down talk of an election breakthrough in the North East", "locations": [], "entities": {"persons": [{"name": "patrick m", "sentiment": "negative"}, {"name": "greg clarke", "sentiment": "none"}, {"name": "patrick", "sentiment": "none"}, {"name": "alan milburn", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "peter mandelson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "mandelson", "sentiment": "none"}, {"name": "patrick mcloughlin", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "new labour", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "invalid email  conservative", "sentiment": "none"}, {"name": "the labour party", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tories play down talk of an election breakthrough in the North East Conservative chair Sir Patrick McLoughlin says Theresa May's party isn't making any predictions about the result Share Sir Patrick McLoughlin, the Chairman of the Conservative Party and Chancellor of the Duchy of Lancaster (Photo: Daily Mirror) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nConservative chairman Sir Patrick McLoughlin has accused Labour of taking North East voters for granted. \nBut he played down suggestions that Conservatives are on course to make an historic breakthrough in the region - saying: “We are not making any predictions about the results.” \nTories won a surprise victory in the Tees Valley mayoral election, while some opinion polls suggest a surge of support for Conservatives in the region. \nAnd Conservative leader Theresa May even came to the North East last week to deliver an audacious speech urging working class voters who backed Labour “for generations” to switch to the Tories. \nSpeaking in North Tyneside , she claimed Labour had deserted “proud and patriotic working class people”. \nAnd Sir Patrick, speaking to the Chronicle, said Labour was paying a price for assuming it could count on the support of the North. Prime Minister Theresa May (L) walks with Conservative party candidate for Berwick-upon-Tweed, Anne-Marie Trevelyan at an airfield in Northumberland (Photo: Getty Images Europe) \nHe said: “The Labour Party has taken voters in the North East for granted. \n“Labour thought they could get away with being elected without actually delivering. \n“The vote in Tees Valley is a very stark reminder to the Labour Party that they shouldn’t take them for granted. \n“But there’s also an opportunity for the Conservative Party to say yes, give us that chance to represent you. \n“We have some excellent MPs up there, and I’d like to see that and a stronger voice making the case to a Conservative government for further investment.” Read More Voting survey reveals the Conservatives could take safe Labour seat in the North East \nHe highlighted the key government role played by business secretary, Greg Clarke, who grew up in Middlesbrough. \nHe added: “There are people who know the North East very well sitting right at the centre of government.” \nTony Blair’s old seat of Sedgefield, County Durham, is one of a number of North East seats the Conservatives could consider they have a chance of taking. \nOthers include Hartlepool, once represented by Peter Mandelson, and Darlington, once represented by Blairite former Health Secretary Alan Milburn. \nIt raises the prospect of symbolic Conservative victories in what was once the heartland of New Labour, the rebranding of the Labour Party led by Mr Blair and Lord Mandelson along with former Prime Minister Gordon Brown. \nAsked about Tory prospects in Sedgefield, Sir Patrick said: “Let’s see what the result brings. Read More Brexit, the NHS and unemployment - key issues for North East voters in the General Election \n“I’m sure Mr Blair will be there campaigning.” \nHe insisted Theresa May had been right to call a general election to strengthen her hand in Brexit talks with the rest of the EU. \n“Calling this election for June 8 was really the only time you could do that over the next two years. \n“Because you’ve got the French [presidential] elections which have just taken place. \n“And the new French Parliament to be elected in four weeks time. \n“You’ve got the German elections in September. \n“And then I think the real negotiations start to get underway. \n“And that’s why I think this is the only opportunity we would have had to have a general election.” Like us on Facebook", "external_links": [], "published": "2017-05-16T12:00:00.000+03:00", "crawled": "2017-05-16T08:41:21.000+03:00", "highlightTitle": ""}