{"organizations": [], "uuid": "47b6d430a58f477073e83044c6f3d51b51fda016", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30337383/16004681.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/labour-launched-general-election-manifesto-here-s-what-leicestershire-candidates-think-of-it/story-30337383-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Labour General Election manifesto - here's what Leicestershire...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-17T15:32:00.000+03:00", "replies_count": 0, "uuid": "47b6d430a58f477073e83044c6f3d51b51fda016"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/labour-launched-general-election-manifesto-here-s-what-leicestershire-candidates-think-of-it/story-30337383-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Labour General Election manifesto - here's what Leicestershire...", "locations": [], "entities": {"persons": [{"name": "danjmartin", "sentiment": "negative"}, {"name": "eyres monsell", "sentiment": "none"}, {"name": "hazel primary", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "michael mullaney", "sentiment": "none"}, {"name": "alberto costa", "sentiment": "none"}, {"name": "saffron lane", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "corby", "sentiment": "none"}, {"name": "ashworth", "sentiment": "none"}, {"name": "roger helmer", "sentiment": "none"}, {"name": "jon ashworth", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "kettering", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicester south labour general election", "sentiment": "none"}, {"name": "south leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "labour general election", "sentiment": "negative"}, {"name": "labour south", "sentiment": "none"}, {"name": "midland mainline", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "bosworth", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "marriott primary school", "sentiment": "none"}, {"name": "ukip south leicestershire", "sentiment": "none"}, {"name": "royal mail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour General Election manifesto - here's what Leicestershire candidates think of it By danjmartin | Posted: May 17, 2017 4 COMMENTS SHARES Jon Ashworth is concerned about cuts to school budgets in Leicester South Labour General Election manifesto - here's what Leicestershire candidates think... X \nCopy link to paste in your message / Comments (4) \nLabour's pledge to reverse Tory cuts to school budgets has been hailed as a key plank of the party manifesto in the upcoming General Election . \nLabour South candidate Jon Ashworth said the Government's school funding formula would see schools in his constituency lose £700 per pupil. \nSpeaking after the official release of the manifesto yesterday on Tuesday, the shadow health secretary, said: \"This manifesto promises to reverse the cuts that will hit schools in Eyres Monsell, Marriott Primary School, off Saffron Lane, and Hazel Primary. \n\"This is so important for parents, but Tory candidates don't have much to say on the issue because they support the formula that will take money away from Leicester schools.\" \nGeneral Election 2017: Click HERE for everything you need to know \nAmong the manifesto pledges is a commitment to extending the electrification of the railways, including the Midland Mainline. \nThe Government has not committed to such a programme north of Kettering and Corby. \nMr Ashworth said: \"We were nearly there with this. We had cross-party agreement it should happen and then it went away. \n\"We just need to get on with it. It is good for business, it is good for Leicester. \nAfter a draft of the manifesto was leaked to the press a week ahead of its official launch, party leader Jeremy Corbyn said: \"We're providing hope and genuine opportunity for everybody. \n\"I say to our children, whatever the postcode you're born in, we will make sure you have the same chance as every other child.\" \nHe described the country as a \"Britain for the rich and the elite and the vested interests\" while millions had struggled. \nMr Corbyn said: \"Whatever your age or situation, people are under pressure, struggling to make ends meet. Our manifesto is for you.\" \nMr Corbyn pledged a \"radical and responsible\" offer to voters, also telling the launch event: \"We will change our country while managing within our means. \n\"We will lead us through Brexit while putting the preservation of jobs first.\" \nMr Corbyn reiterated key pledges, including ruling out rises in VAT and National Insurance while also noting income tax would not rise for 95 per cent of workers. \nLabour has set out plans for tax rises totalling almost £50 billion to pay for \"a fairer, more prosperous society for the many, not just the few\". \nIf it wins the June 8 General Election, the party will lower the threshold for the 45p rate of income tax from £150,000 to £80,000 and introduce a 50p rate on earnings over £123,000, raising a total of £6.4 billion a year from the top 5 per cent of earners. \nIts manifesto outlines pledges to nationalise water, energy, railways and the Royal Mail, pump £6 billion a year into schools and £7 billion into health and social care, while scrapping university tuition fees. \nThe manifesto also says Labour would raise £19.4 billion by increasing the main rate of corporation tax to 26 per cent by 2020/21. \nBosworth Liberal Democrat candidate Michael Mullaney said Labour's manifesto was \"a well-meaning document\" but said: \"It's totally pointless. Jeremy Corbyn hasn't a cat in hell's chance of winning this election, so none of it will be implemented. \n\"What is important is what the Tories do and to prevent them from getting a landslide victory.\" \nUKIP South Leicestershire candidate Roger Helmer described Labour's manifesto as a \"march back to the 1970s\". \nHe said: \"I think there's some-thing missed out – the free beer for all the workers. \n\"It's tax and spend, tax and spend, tax and spend, but Labour get this wrong time after time. If you radically change the tax regime, you change behaviour. \n\"If you increase tax on businesses people stop investing in the UK and those businesses move offshore. \n\"It doesn't actually increase the tax revenue.\" \nConservative South Leicestershire candidate Alberto Costa said: \"I can sum up this manifesto in six words: \"Tax more, spend more, borrow more. \n\"The only promises Labour are making to the people of South Leicestershire and the county is higher taxes and more borrowing.\" ", "external_links": [], "published": "2017-05-17T15:32:00.000+03:00", "crawled": "2017-05-17T11:32:53.000+03:00", "highlightTitle": ""}