{"organizations": [], "uuid": "04da6566e9492abfbb6aaa49b1c1bf410e2fc154", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12753770.ece/ALTERNATES/s1200/INDY-REF-2.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13109871", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: SNP vows to raise minimum wage", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-30T14:55:00.000+03:00", "replies_count": 0, "uuid": "04da6566e9492abfbb6aaa49b1c1bf410e2fc154"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13109871", "ord_in_thread": 0, "title": "Business Breakfast RECAP: SNP vows to raise minimum wage", "locations": [], "entities": {"persons": [{"name": "rui vieira/pa wire", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "neil harrold", "sentiment": "none"}, {"name": "alex cruz", "sentiment": "none"}, {"name": "karen wheatley", "sentiment": "none"}, {"name": "sarah glendinning", "sentiment": "none"}, {"name": "cruz", "sentiment": "none"}, {"name": "karbon homes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andie stokoe", "sentiment": "none"}, {"name": "barry metters", "sentiment": "none"}, {"name": "jonathon manning risk", "sentiment": "none"}, {"name": "richard clogg", "sentiment": "none"}, {"name": "mark forster", "sentiment": "none"}, {"name": "o’leary", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "dac beachcroft", "sentiment": "none"}, {"name": "zoey hawthorne", "sentiment": "none"}, {"name": "jonathon manning ward hadaway", "sentiment": "none"}, {"name": "jonathon manning newcastle", "sentiment": "none"}, {"name": "steven bell", "sentiment": "none"}, {"name": "sarat pediredla", "sentiment": "none"}, {"name": "david tate", "sentiment": "none"}, {"name": "stuart bell", "sentiment": "none"}, {"name": "michael o’leary", "sentiment": "none"}, {"name": "pelton", "sentiment": "none"}, {"name": "jeffrey keeble", "sentiment": "none"}], "locations": [{"name": "chester-le-street", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "karbon homes", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "manchester arena", "sentiment": "none"}, {"name": "nettlesworth", "sentiment": "none"}, {"name": "south pelaw", "sentiment": "none"}, {"name": "keepmoat", "sentiment": "none"}], "organizations": [{"name": "jonathon manning karbon homes", "sentiment": "negative"}, {"name": "snp", "sentiment": "negative"}, {"name": "michael dyson associates", "sentiment": "none"}, {"name": "isos housing and derwent homes", "sentiment": "none"}, {"name": "red herring", "sentiment": "none"}, {"name": "dac beachcroft", "sentiment": "none"}, {"name": "canford audio", "sentiment": "none"}, {"name": "canford audio plc", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "jonathon manning newcastle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "karbon homes", "sentiment": "none"}, {"name": "newcastle hq", "sentiment": "none"}, {"name": "cestria community housing", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "jonathon manning canford audio", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Karbon Homes launches £1.8m housing development near Chester-le-Street \nNewly formed housing developer Karbon Homes has announced a £1.8m project which will bring 17 family homes to County Durham . \nThe new homes will be built on three neighbouring sites within South Pelaw, to the west of Chester-le-Street town centre. The sites had previously been occupied by garages. \nThe homes will have been designed by Michael Dyson Associates and the main contractor for the group is Keepmoat Regeneration. \nZoey Hawthorne, assistant director of development and property at Karbon Homes, said: \nIt’s great to get started on this new project, as we know there is strong demand for this type of property in the Chester-le-Street area. \nThe delivery of these high quality affordable rented homes will help improve the quality of environment of the neighbourhood by enabling under utilised garages and land to be brought back into effective use to provide 17 new family homes that will offer a greater choice for customers wishing to live within South Pelaw. \nKarbon Homes was formed in April through the merger of Cestria Community Housing, Isos Housing and Derwent Homes. The business aims to build 2,500 new homes over the next four years. \nThe firm recently completed 37 new homes in Pelton and has a further 22 affordable rented homes under construction in the centre of Chester-le-Street. It is also building a further 19 rented homes in Nettlesworth. Digging in to make a start on the new site are: (L-R) Barry Metters (Construction Manager, Keepmoat), Zoey Hawthorne (Assistant Director, Development & Property, Karbon Homes), David Tate (Technical Officer, Karbon Homes) and Karen Wheatley (Commercial Manager, Keepmoat) (Photo: Unknown) 9:05 Jonathon Manning Risk of insolvency on the rise for North East businesses \nThe risk of North East firms getting into financial difficulty in the next year are rising across almost every business sector, according to the latest business stability rankings from insolvency and restructuring trade body R3. \nOf the 11 industry sectors monitored by R3, nine have seen the number of businesses at risk of insolvency increase over the last month. \nThe leisure sector has seen the biggest changes, with the insolvency risk in the hotel and pub sectors rising month-on-month by 11% and 5% respectively. Manufacturing and technology sectors both saw insolvency risk rise by 4% while retail, construction, restaurant and professional services sectors all recorded rises of between two and three per cent \nTransport and haulage was the only sector to record a reduction in risk, which fell by 4%, while the tourism sector remained flat. \nNeil Harrold, chair of R3 in the North East and a partner with Hay & Kilner Law Firm, says: \nIf you asked company owners what the one thing they most wanted to help them plan their businesses’ progression, the answer is very likely to be ‘certainty’, but that’s a commodity that is in very short supply at the moment for a number of reasons and it may be having an impact on confidence across the regional economy. \nWhile the rise in insolvency risk is relatively small across most industries and there are encouraging signs in some sectors, it’s crucial for company owners to remember that financial problems can hit any business in any industry at any time, and in uncertain times like these, retaining full oversight of their operations is essential if they’re to be able to see any warning signs flashing before it’s too late to do anything about them. \nManagement teams that feel they could be facing problems need to take action straight away and get qualified advice if they want to have the best possible chance of putting things right, rather than ignoring the situation in the hope that everything will somehow work itself out again . Neil Harrold, chair of R3 in the North East and a partner with Hay & Kilner Law Firm 9:54 KEY EVENT Avoiding hard Brexit is keen concern for North East businesses, Journal survey shows \nNorth East business leaders are opposed to the ‘hard Brexit’ outlined by Prime Minister Theresa May in her current stance on leaving the EU, a Journal survey suggests. \nA poll conducted in the run-up to next month’s General Election reveals that ensuring access to both European markets and skilled labour from abroad are the areas of highest concern for businesses in the region. \nFunding for skills, improvements to transport in the North East and better broadband and IT infrastructure also ranked highly in the survey. \nBut it is the importance business leaders have placed on the Brexit deal - with 72% saying ensuring access to European markets after Brexit was a high priority and 70% saying the same about ensuring access to skilled labour - that will put pressure on politicians to reach a deal with the EU that does not threaten jobs in the North East. \nIn other areas, 68% of those polled called for better funding for skills in the North East and 63% wanted improvements to transport in the North East to be a priority for the new Government. \nThe findings of The Journal’s survey have been welcomed by business leaders in the North East, who will be pressing politicians of all parties to ensure Brexit negotiations do not harm the region’s business community. \nSarah Glendinning, regional director of the CBI, said: \nEurope remains the UK’s biggest export market by some distance, so it’s little wonder that businesses here in the North East see maintaining access to the market of our nearest neighbours as a priority. The business community – in the UK and the EU – is united in wanting an agreement with as few barriers as possible, allowing our companies to trade easily. \nImmigration is a force for good, creating jobs, plugging skills gaps and bringing investment – all vital for economic growth. Any new system must therefore reflect economic reality while alleviating public concerns. \nIf the next Government wants to better create prosperity in all corners of the UK, then investment in skills and transport will be paramount. Conservative leader Theresa May (Photo: Daily Mirror) 8:48 Jonathon Manning Newcastle firm to 'revolutionise' claims market with new software \nA Newcastle fintech company is hoping to revolutionise the claims market after launching new software that automatically validates compensation claims for flight delays. \nAllay, the company behind the new technology, developed the software in-house for use with its flight delay compensation app airFair. \nThe programme is known as FlightDeck and is used by the firm to automatically validate claims as customers input the details. The software reduces the time it takes to claim, cuts costs and reduces admin work. \nAllay managing director Steven Bell said: \nSince entering the flight delay compensation space our development team has been building FlightDeck to revolutionise the marketplace. We believe that it is the most advanced software of its kind out there at the moment. \nWhile the new software will greatly benefit airFair in handling a larger scale of claims, saving time and improving the customer journey, we also believe it has massive potential to help airlines and other businesses in the travel industry. We have ambitious plans for the future of FlightDeck and its presence in the industry with a vision of sharing this one-of-a-kind technology which we have developed. \nThe new tech has already been built into airFair’s website but will soon be released onto the businesses mobile app through updates on iOS and Android. \nThe platform will be made available to third party organisation, such as airlines, tour operators, and claims management companies, to help them work more efficiently. This would allow them to offer flight delay compensation services to their customers using FlightDeck. (L-R), Allay director Andie Stokoe, managing director Steven Bell, and director Stuart Bell (Photo: OPR) 8:43 Jonathon Manning Ward Hadaway and DAC Beachcroft appointed to NHS legal panel \nTwo Newcastle law firms have been selected to sit on a major legal panel for the NHS. \nWard Hadaway and DAC Beachcroft’s Newcastle offices have won the right to carry out legal work for the NHS Resolution framework. \nThe panel is split into three lots covering clinical negligence, non-clinical work, and regulatory health and disciplinary law. DAC Beachcroft was selected for all three lots while Ward Hadaway will work on Lots one and three. \nJeffrey Keeble, partner and head of healthcare at Ward Hadaway, said: \nWe are delighted to have again been chosen by NHS Resolution to continue carrying out this important work for NHS organisations across the country. \nThe appointment brings with it great responsibility in terms of advising on cases and incidents affecting patients, clinicians and managers across the health service. \nHowever, our experienced and knowledgeable team has spent many years working in the sector and is ready to use all of its expertise to help deal with these often complex and challenging cases. \nIn total eight law firms were selected to sit on the national panel. 8:33 Jonathon Manning Canford Audio launches in-house 3D printing \nWashington-based engineering firm Canford Audio has begun using 3D printing in-house to create prototype designs for customers. \nThe new technology means the firm can create prototypes quicker and at a lower cost than using third parties to create its moulds. \nRichard Clogg, a design draughtsman at Canford Audio, said: \nWe acquired the 3D printing equipment for general mechanical prototyping - if we design a new moulding, such as the headphone limiter case, we would go to a rapid prototyping company and have samples 3D printed to verify our design, at high cost. Our own equipment allows us to do this in-house and experiment with more design iterations and improvements, at a much higher rate - days instead of weeks. \nWith the 3D printing facility up and running, the capability and techniques possible were further realised – we saw an opportunity to increase the throughput of the fibre polishing machine. Canford Audio Plc headquarters in Washington (Photo: Canford Audio Plc) 8:28 KEY EVENT Ryanair posts ride in profits but warns of 'Brexit developments' \nLow cost carrier Ryanair pledged to continue cutting fares as it posted a 6% rise in annual profits despite intense competition and the Brexit vote. \nRyanair chief executive Michael O’Leary said the Irish airline faced “difficult” trading as the group posted profits of €1.31bn (£1.14bn) for the year to March 31. \nIt slashed fares by 13% on average over the year amid competition in the industry and expects to reduce fares by a further 5% to 7% due to the weak pound and as it passes on lower fuel costs. \nThe group said the year was marred by terrorist attacks across Europe, confirming flight bookings fell in the aftermath of the explosion at the Manchester Arena last week. \nBookings have started to recover as Ryanair has launched seat sales in response to the fall in demand. The group said it also saw “strong bookings” over the weekend after an IT failure hit rival British Airways. \nRyanair is “cautiously” forecasting profits to rise by 8% to between €1.4bn (£1.2bn) to €1.45bn (£1.3bn) for the year to next March. \nMr O’Leary warned: \nInvestors should be wary of the risk of negative Brexit developments, or any repeat of last year’s security events at European cities, which could damage consumer confidence, close-in bookings, and this full year 2018 guidance. \nHe added the group would “continue to pivot our growth away from the UK” amid uncertainty caused by Brexit. (Photo: Rui Vieira/PA Wire) Jonathon Manning Newcastle tech firm hedgehog lab named one of best in Europe \nA Newcastle tech company has been named one of the best in Europe after a period of major growth . \nhedgehog lab, which develops apps, has been named on the Top 100 Europe list, which is compiled by technology website Red Herring to highlight the year’s most promising private technology ventures across Europe. \nThe list - which is based on a number of factors, including growth rate, innovation, international trade and other industry awards - comes after a number of years of strong performance by the company, which last year saw revenues grow by 160%. \nThe company, which was one of only 18 UK firms on the list, says it is on track to double its turnover in 2017, aided by growing interest in the virtual, augmented and mixed reality services it has been offering since the establishment of an immersive technologies division in January. \nCEO Sarat Pediredla said: \nIt is a true honour to win this award; we have been pleased with our recent growth, but it was a real surprise to be acknowledged at such a high level. \nWe are proud to fly the flag for UK tech - and were delighted to learn we were the only UK company specialising in mobile to make it on to this prestigious list. That, I believe, is a testament to the hard work of our team as well as the dedication of our senior management. \nWe have many exciting projects ahead of us this year and, having invested in expanding our Newcastle HQ, are well placed to bring the best we can offer to our clients. \nInnovation also remains critical to our vision; we are committed to providing cutting-edge solutions, making use of the latest, most impactful technologies. Hedgehog Lab founders, CEO Sarat Pediredla, left, and chief product officer Mark Forster (Photo: Hedgehog Lab) 8:18 KEY EVENT BA customers still without luggage after 'catastrophic' IT failure \nA “significant number of customers” are still without their luggage after a British Airways IT failure caused global flight disruption over the bank holiday weekend. \nThe airline said although it was moving to get bags back to passengers, there was still some work to do. \nOn Monday night it posted an update on its website saying: \nWe are continuing to make good progress in reuniting bags with customers around the world who were affected by the major IT systems failure on Saturday. \nAlthough we have already flown many bags to the correct airport, there is still some work to do and we know there are still significant numbers of customers who are yet to receive their luggage. \nWe are very sorry for the frustration this situation is causing at a very busy time of year for holidays. \nEarlier the airline’s chief executive said the outsourcing of jobs was not to blame for a “catastrophic” IT failure. BA was accused of greed after the GMB union suggested the disruption could have been prevented if the beleaguered airline had not cut “hundreds of dedicated and loyal” IT staff and contracted the work to India in 2016. \nBut the airline’s chief executive Alex Cruz said this was not the case, adding that a full investigation would be conducted into the failure which affected 75,000 passengers. \nHe told Sky News: \nI can confirm that all the parties involved around this particular event have not been involved in any type of outsourcing in any foreign country. \nThey have all been local issues around a local data centre who has been managed and fixed by local resources. \nHe added: \nOn Saturday morning at around 9.30 there was indeed a power surge that had a catastrophic effect over some communications hardware which eventually affected all the messaging across our systems. \nWe will have completed an exhaustive investigation on exactly the reasons of why this happened. We will, of course, share those conclusions once we have actually finished them. \nWe have no evidence whatsoever that there was any cyber attack of any sort. \nMr Cruz apologised “profusely” for the hardship caused to customers and insisted a similar incident would never happen again. He further offered assurances that no customer data or any list, including terror watch lists, had been compromised by the glitch. \nOn Saturday night, travellers spent the night sleeping on yoga mats spread on terminal floors after BA cancelled all flights leaving the London hubs, while disruption continued into Sunday with dozens more services from Heathrow axed. \nThe IT outage had a knock-on effect on BA services around the world, while passengers who did get moving on the limited number of flights to take off from the UK reported arriving at their destinations without their luggage. \nThe disruption also hit transport systems on the ground, with hundreds of travellers flooding London’s King’s Cross station in hope of boarding a train north instead. \nExperts predict the knock-on effect could continue for several days and BA is facing huge compensation costs, with reports suggesting the bill could top £100m. Mr Cruz said the airline was “committed” to following all compensation rules. British Airways fleet", "external_links": [], "published": "2017-05-30T14:55:00.000+03:00", "crawled": "2017-05-30T11:48:59.000+03:00", "highlightTitle": ""}