{"organizations": [], "uuid": "ae1a3fad25fcb68e0428bb5df6cdc2f0b59d1eed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30344339/16010354.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/booker-prize-winning-author-hilary-mantel-backs-independent-claire-wright-for-general-election/story-30344339-detail/story.html", "country": "GB", "title": "Booker Prize-winning author Hilary Mantel backs independent...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-20T22:37:00.000+03:00", "replies_count": 0, "uuid": "ae1a3fad25fcb68e0428bb5df6cdc2f0b59d1eed"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/booker-prize-winning-author-hilary-mantel-backs-independent-claire-wright-for-general-election/story-30344339-detail/story.html", "ord_in_thread": 0, "title": "Booker Prize-winning author Hilary Mantel backs independent...", "locations": [], "entities": {"persons": [{"name": "hilary mantel", "sentiment": "none"}, {"name": "claire wright", "sentiment": "none"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "wright", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "wolf hall", "sentiment": "none"}], "locations": [{"name": "devon east", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "sidmouth", "sentiment": "none"}, {"name": "budleigh salterton", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "budleigh salterton booker", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "ms mantel", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Booker Prize-winning author Hilary Mantel backs independent Claire Wright in general election By WMN_PGoodwin | Posted: May 20, 2017 0 COMMENTS SHARES The writer in Budleigh Salterton Booker Prize-winning author Hilary Mantel backs independent Claire Wright in... X \nCopy link to paste in your message / Comments (0) \nAward-winning novelist Hilary Mantel has backed an independent candidate standing for Parliament in the East Devon seat where she lives. The author, famous for books including Wolf Hall and the controversial The Assassination of Margaret Thatcher, has urged voters to back Claire Wright. \nThe non-aligned candidate failed in her bid to unseat Sir Hugo Swire in 2015, losing by 12,000 votes to the former Foreign Officer minister \nAfter running for a second time, she was this week backed by the tactical voting site Tactical 2017 as the only candidate who can defeat the Conservatives, the only independent in the country to receive such an endorsement. \nNow the acclaimed writer, who lives in Budleigh Salterton, has spoken out in favour of Ms Wright, whom she first supported in 2015. \nMs Mantel, who has just returned from a trip to the US, urged residents not to \"waste\" their votes. \n\"Claire Wright is the candidate who will speak up for Devon East,\" she said. \n\"She stands as an Independent, and that means she is free to speak with a strong and genuine voice on issues that affect all of us in our everyday lives. \n\"She is local, energetic, knowledgeable, and has a real chance of going to Westminster - if local people will come out and support her on election day. \n\"If you want a different kind of politics, do something different to get it. Don't waste your vote, give it to Claire Wright: trust a candidate with a clear vision for our unique part of England.\" \nIn East Devon, based on the result two years ago, Ms Wright would need to hoover up most of the 16,000 votes cast for the Lib Dems, Labour and UKIP to topple the incumbent. \nBut with UKIP's recent collapse and Tory wins in local elections, many experts expect Brexit supporters to return to the Conservatives, making it a tough battle. \nAdded to that, two other independent candidates are challenging for the seat this time around. \nThe backing comes after Ms Wright launched her manifesto in Sidmouth onThursday evening. \nThe mother of one outlined plans to fight community hospital closures, press for more funding for social care and fight for a fair level of funding for local education. \nThe support comes after bookmaker William Hill confirmed that they see Ms Wright as the official opposition in the constituency, offering odds of 9/2 against a surprise win. \nMs Wright decided to put her name forward after an appeal generated crowdfunding of £7,500 in just 10 days with 100 separate donations, half the amount raised in a whole year during the 2015 General Election campaign. \nShe said: \"It has been a completely amazing week for my campaign, but this news tops it all for me. \n\"Hilary Mantel is a hugely respected and really talented writer. I am so proud that she is backing me in such a public way. I am sure she knows what it means to me.\" \nMantel has made no secret of her dislike of the Conservatives, lamenting the party's \"social wrecking agenda\" in an article in the New Statesman this year. \nShe called on Labour to \"begin a swift and bold conversation about what its aims are\" if it wants to win back power. \n\"Day by day, voters have very little contact with their elected politicians,\" she wrote in March. \n\"They don't read manifestos and if they care about party programmes they show little recognition of links between cause and effect – bitching at private affluence, groaning at public squalor, then trundling out to vote Tory, so they get more of the same.\" ", "external_links": [], "published": "2017-05-20T22:37:00.000+03:00", "crawled": "2017-05-20T19:21:29.000+03:00", "highlightTitle": ""}