{"organizations": [], "uuid": "de8c93d9f89c1caccbecc29e1bbeb95976922c0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12995620.ece/ALTERNATES/s1200/Carol-Malia.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/showbiz-news/carol-malia-look-north-weightloss-12995512", "country": "GB", "domain_rank": 21960, "title": "TV favourite Carol Malia reveals how body-shaming trolls left her feeling hurt", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "TV favourite Carol Malia reveals how body-shaming trolls left her feeling hurt", "spam_score": 0.0, "site_type": "news", "published": "2017-05-07T01:00:00.000+03:00", "replies_count": 0, "uuid": "de8c93d9f89c1caccbecc29e1bbeb95976922c0d"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/showbiz-news/carol-malia-look-north-weightloss-12995512", "ord_in_thread": 0, "title": "TV favourite Carol Malia reveals how body-shaming trolls left her feeling hurt", "locations": [], "entities": {"persons": [{"name": "caro", "sentiment": "negative"}, {"name": "carol malia", "sentiment": "negative"}, {"name": "gary", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "nicholas", "sentiment": "none"}, {"name": "kevin gibson", "sentiment": "none"}, {"name": "malia", "sentiment": "none"}, {"name": "carol", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}], "locations": [{"name": "tyne valley", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}], "organizations": [{"name": "kevin gibson photography ltd", "sentiment": "negative"}, {"name": "luxe north east lifestyle", "sentiment": "none"}, {"name": "luxe magazine", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New look Carol Malia (Photo: Kevin Gibson Photography Ltd) Share Get daily   Thank you for subscribing!   \nTV news favourite Carol Malia has revealed how troll viewers sent ‘hurtful’ messages about her weight as she battled to slim down. \nAppearing before hundreds of thousands of TV viewers every night, the Look North presenter was left on the receiving end of an array of nasty personal comments about her appearance. \nEmbarrassed and self conscious, she decided a change was needed. \nNow, having gone on a health kick and shed three-and-a-half stone in just eight months, Carol has ‘gone public’ about the change, not least because she realised she’s inspiring others to get fit. \nThe 48-year-old said: “In many ways there was a point where professional was crossing over into personal. There I was reading the news about levels of obesity and heart problems in the North East and feeling embarrassed that I was overweight. \n“I got the odd email when I was bigger making personal comments and it was hurtful. They were the ones I thought about. \n“At the same time I was meeting up with a friend I played tennis with every week and she seemed to be shrinking every week. I was playing tennis and feeling that my knees and feet were sore.” Carol Malia pictured in 2014 \nHer friend told her that it wasn’t a magic pill – she was simply going to a regular slimming class. \nCarol signed up: “It was at 9.30am on a Monday morning, there was no reason why I couldn’t. I had that thought that there was no way I was going to sit around in a group to be lectured at – but the reality was that there were three friends there and a couple of other people I knew – and it was like a comedy club – but with great advice, tips and focus. “ \nCarol also joined a running group near her Tyne Valley home and has never felt fitter or more energised. However, she admits it took determination and a real change of habits to get results. \nShe added: “My job meant a lot of balls, dinners, after-work events and functions. \n“I had to take the decision to became half as sociable, to give myself time to do it properly, to not say yes to every dinner. \n“I became half as sociable, but what did happen was that friends have joined me and they understand it.” Read More Ladies only to men only: These Girls Can Run looks to expand community running group \nCarol started running with a group called Jog on the Tyne and every Sunday morning she’s out there at 8.30am getting the run out of the way so she can spend the rest of the day doing mummy stuff with Anna, seven and Nicholas, six, along with husband Gary. \nShe added: “I did the Great North Run , pre-kids when I was 36/37 but when I started again we began with a one minute walk, one minute run and built it up. Over 10 weeks, I built up to running four miles on hills. Now on Sundays we do about five miles.” \nHer gradual weight loss has obviously been apparent on screen to viewers and Carol has realised that she’s encouraged others to lose weight for their health. \n“Over eight months I have lost 3st 5lbs – I had a target of four stone which would be back to pre-baby – but I’m not sure of that – I just want to be sensible about it. \n“I have had emails from viewers saying they have been inspired by me to lose weight themselves, asking me how I have done it - and, yes calling me an inspiration.” New look Carol Malia (Photo: Kevin Gibson Photography Ltd) \nShe admits that as a professional journalist doing her job it shouldn’t be about how she looks, but people are encouraged and inspired by what she’s done. \nShe added: “The reaction feels a bit overwhelming to be honest – but brilliant that people are interested and encouraged.” \nOn a professional level of course, Carol has had an exacting year in front of the camera. \nBrexit coverage gave her one of her biggest challenges yet – chairing live debates about the effect of the Brexit changes on the region. \nShe said: “That required an awful lot of research – obviously we have an amazing team but I really had to know my stuff and be on my toes – we had some very lively debate.” \nHer work schedule is full-on, with evening and late night broadcasts and they create a healthy eating challenge of their own – not eating until after 9pm when she gets home or grazing all day. \n“I’ve always got boxes full of crunchy vegetables near me”, she confesses. New look Carol Malia (Photo: Kevin Gibson Photography Ltd) \nThe wine drinking days are mostly left behind – or have taken on a different tone. \nShe added: “Now we’ll get a very good bottle of wine on a Friday and I will really look forward to that good, big glass of red and really savour and enjoy it. \n“As for other meals, I’ll cook Sunday lunch and just not have the roasties or the Yorkshire puds. \n“For breakfast it’s Weetabix and yoghurt with tonnes or fruit or toast with ham or smoked salmon. \n“With salads I’ll have a dressing of red wine vinegar, no croutons or cheese – it sounds boring but you can get by. \n“I’ve got a bag I take to work with fruit or lots of protein like ham, chicken and eggs. \n“I’ve replaced crisps with seaweed thins and if I want something sweet I have plain yoghurt with honey and some ground nutmeg or cinnamon, raspberries and oranges. I do miss eating bread – a lovely rustic, artisan loaf.” Read More Mum and daughter team reveal their secret to stunning weight-loss success \nWhen Carol gets to her target weight she’ll be heading out for an ‘amazing’ night out meal somewhere lovely and getting a new swimsuit for summer. \nIn eight months she’s gone down two to three dress sizes and is full of an energy and sparkle that has encouraged others to follow her high profile lead. \n“I am surprised but pleased that people feel inspired.” Luxe North East Lifestyle magazine (Photo: Kevin Gibson) \n• A full appears in the May/June edition of Luxe Magazine, available at Fenwick, Newcastle www.luxe-magazine.co.uk Like us on Facebook", "external_links": [], "published": "2017-05-07T01:00:00.000+03:00", "crawled": "2017-05-06T20:27:08.000+03:00", "highlightTitle": ""}