{"organizations": [], "uuid": "ccd89153e9bd5011fb356ebd82d7ad0025a24c38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30326294/15997263.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/last-butcher-standing-the-slow-decline-of-butchers-row/story-30326294-detail/story.html", "country": "GB", "title": "Last Butcher standing - The slow decline of the Butcher's Row meat industry | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Last Butcher standing - The slow decline of the Butcher's Row meat industry | Devon Live", "spam_score": 0.121, "site_type": "news", "published": "2017-05-11T16:49:00.000+03:00", "replies_count": 0, "uuid": "ccd89153e9bd5011fb356ebd82d7ad0025a24c38"}, "author": "", "url": "http://www.devonlive.com/last-butcher-standing-the-slow-decline-of-butchers-row/story-30326294-detail/story.html", "ord_in_thread": 0, "title": "Last Butcher standing - The slow decline of the Butcher's Row meat industry | Devon Live", "locations": [], "entities": {"persons": [{"name": "darren gratton", "sentiment": "none"}, {"name": "eileen parssley", "sentiment": "none"}, {"name": "berry", "sentiment": "none"}, {"name": "marshall", "sentiment": "none"}, {"name": "val monk", "sentiment": "none"}, {"name": "mark berry", "sentiment": "none"}, {"name": "david gratton", "sentiment": "none"}, {"name": "keith hicks", "sentiment": "none"}, {"name": "darren", "sentiment": "none"}, {"name": "r. d. gould", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "richard stevens", "sentiment": "none"}, {"name": "neil hammond", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "joy street", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "pannier market", "sentiment": "none"}, {"name": "north devon council", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "local butchers association", "sentiment": "none"}, {"name": "national federation of food and meat traders", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "butchers association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Last Butcher standing - The slow decline of the Butcher's Row meat industry By RoseCarr | Posted: May 11, 2017 1 COMMENTS SHARES Grattons Butchers - a North Devon instituion - closed last year Last Butcher standing - The slow decline of the Butcher's Row meat industry X \nCopy link to paste in your message / Comments (1) \nWhen Barnstaple's iconic Butcher's Row was constructed in the mid-19th century, 33 butchers lined its attractive parade. But today only one remains. The virtual disappearance of butchers on the street is a sensitive topic in the town, but there are many who remember the street in its former glory days. \nDesigned by R. D. Gould alongside the Pannier Market in 1855, it was the epicentre of North Devon's thriving meat sector for well over a century. The units were built North-facing to keep the produce cool; a design feature which is still effective today. \n\"When I owned Marshall's Hotel in the 1960's and 1970's, all the butchers - and there were many - were out of stock by one o'clock,\" says Councillor Val Monk. \nBut now its faded Victorian facade tells a very different story. Those food retailers still active are wedged between vacant units. Local traders complain of declining footfall and describe an 'air of general decay'. They say the historic centre has become a 'ghost town'. \nEileen Parssley, a resident whose family have been in Barnstaple for generations, also remembers the street in it's heyday. \"It's so sad to see it like this now,\" she said. \"A lot of places don't have this sense of history. It's important to preserve that. What do people come and see now? The clothes shops?\" \nFollowing the closure last year of the Row's oldest shop, Grattons Butchers - which was established in 1954 and something of a local institution in its own right - Berry's Butchers is the sole remaining monument to the street historic association with the meat trade: a connection which long predates the Victorian shopsfronts. \nAs far back as 1672 the town clerk noted that: \"Time out of mind there hath been three Market days for Flesh, Tuesday, Thursday and Saturday, which have been constantly used and kept as only days for sale of flesh.\" \nBut it seems Barnstaple's taste for flesh has since diminished. Mark Berry, who has run Berry's Butcher for the last six years, says business is quiet. \"What with Brexit and depressed wages people aren't spending money at their local butchers the way they used to.\" \nBut the the butchers on the Row aren't the only ones to have fallen on hard times. Numbers of traditional butchers across the country have been in steady decline over the last 25 years. In 1990 there were around 15,000 butchers in the UK. Estimates now put the figure at just over 6,000. \nRichard Stevens, from the National Federation of Food and Meat Traders, says changing consumer habits and competition online and from supermarkets have all played their part. \nHe said: \"There has been a decline in common with many other types of food retailers, but the rate of decline has been less than comparable sectors such as greengrocers or bakeries.\" \nBut he added that with change comes opportunity too. He said: \"These figures disguise the fact that the sector is also undergoing something of a renaissance. What we have seen in recent years is a growth in farm shops, which primarily sell meat. \n\"Certainly family run butchers are having a hard time, they are having to find other ways to sell their produce, either online, or by trading to caterers, or by moving out of current premises into farm shops.\" \nKeith Hicks, Secretary of the Local Butchers Association in the South West echoes these sentiments. He started working in the family firm at the age of 15 and has spent 50 years in the business. \nHe said: \"When I was head of the Butchers Association in Exeter in the 1980s there were about 50 shops in the city. If you looked back to 1901 there were 100. Now there's about six. \n\"Most of the time these businesses are family run and people are now retiring and having difficulty getting their sons and daughter to take over. But those that do stick around are doing good business. \n\"Certainly you have to invest more in your equipment, where you spent tens of thousands before, you now have to spend hundreds of thousands, and I know very successful meat processing businesses who are spending more than that. \n\"I'm retired now but I wish I was starting out today…..it's not all doom and gloom. If you tailor your business to emphasise the craft and provenance, if you find niche like that, then it's still very profitable.\" \nOn Barnstaple's Joy Street, two young butchers whose links to Butchers Row also go back generations, think they've done just that. Brother's David and Darren Gratton, who have run the family's branch for 25 years, say business has never been better. \n\"This is one of the best years we've had, we've never been so busy,\" says Darren. David Gratton added: \"On Saturdays we are seeing between 500 and 700 customers. We almost can't keep up with demand.\" \nREAD MORE: Are you a chuggy pig or a thong, Devon town nicknames revealed \nDarren believes part of the reason Butchers Row has lost so many businesses is because \"(council managed) rents have out-priced themselves.\" \nDespite the closure of their cousin's shop round the corner on Butchers Row, they say reduced competition has helped their side of the business grow. Darren said: \"There are fewer people who are selling local produce now, but at the same time consumers have become more concerned with buying local produce in the last 10 years.\" \nBut whether or not other butchers in Devon, and across the country, adapt to the new landscape, it seems the fate of one of Barnstaple's historic streets still hangs in the balance. \nTraders worry proposed plans from North Devon Council to refurbish the site may not be enough to save it from the onslaught of new supermarkets. They are unlikely to bring the butchers back. \n\"The supermarkets that have done it,\" says Neil Hammond, a trader at the Pannier Market. \"I blame the consumers too though. The supermarkets have made it easy for them. It's happening all over the country. This town needs to get rid of the pound-shops and knock the supermarkets on the head.\" \nThe Journal contacted North Devon Council but no one was available for comment. ", "external_links": [], "published": "2017-05-11T16:49:00.000+03:00", "crawled": "2017-05-11T22:09:51.000+03:00", "highlightTitle": ""}