{"organizations": [], "uuid": "ab12dcba5b8a897d7fc81ccd2af8857a120cd709", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30340312/16007127.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/devon-plea-to-put-trade-first-in-election-wishlist/story-30340312-detail/story.html", "country": "US", "title": "Devon plea to 'put trade first' in election wishlist | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.573, "site_type": "news", "published": "2017-05-18T19:15:00.000+03:00", "replies_count": 0, "uuid": "ab12dcba5b8a897d7fc81ccd2af8857a120cd709"}, "author": "", "url": "http://www.devonlive.com/devon-plea-to-put-trade-first-in-election-wishlist/story-30340312-detail/story.html", "ord_in_thread": 0, "title": "Devon plea to 'put trade first' in election wishlist | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "george cowcher", "sentiment": "none"}, {"name": "hinkley", "sentiment": "none"}], "locations": [{"name": "devon live devon", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "devonport", "sentiment": "none"}, {"name": "exeter airport", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "ilfracombe", "sentiment": "none"}, {"name": "central devon", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "county", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "kingsbridge", "sentiment": "none"}, {"name": "north devon link road", "sentiment": "none"}], "organizations": [{"name": "british chambers of commerce", "sentiment": "none"}, {"name": "local enterprise partnership", "sentiment": "none"}, {"name": "digital connectivity", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon chamber of commerce", "sentiment": "none"}, {"name": "chamber network manifesto", "sentiment": "none"}, {"name": "peninsula rail taskforce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon plea to 'put trade first' in election wishlist By HannahFinch | Posted: May 18, 2017 0 COMMENTS SHARES Devon chamber wants prospective MPs to know what the county needs Devon plea to 'put trade first' in election wishlist X \nCopy link to paste in your message / Comments (0) \nThe Devon Chamber of Commerce has issued its election manifesto – calling on the new Government to put connectivity and EU trade first.The chamber, with 750 full members in Plymouth, Exeter and Torbay, speaks on behalf of around 2,000 companies of all sizes and sectors. \nThe ten-point manifesto outlines the priorities for the county and builds on the British Chambers of Commerce's own Chamber Network Manifesto entitled Brexit and Beyond. \nGeorge Cowcher, chief executive, said: \"This document is especially for candidates standing in the county to brief them on what is important for Devon businesses.\" \nThe 10 Key issues for Devon Businesses \nThe Devon economy is large in national terms and deserves national attention. Plymouth is the largest manufacturing centre South of Birmingham and Exeter is a growing centre for technology and science. The whole of the County, from Ilfracombe to Kingsbridge and Devonport to Axminster, contains many thriving companies including global brands, family enterprises and a host of start-ups in traditional and emerging sectors providing employment and generating wealth - all of which need consideration. Devon has not benefitted from the devolution agenda and it deserves to. There is massive potential here and companies need to be given the tools to compete nationally and internationally. A properly resourced Local Enterprise Partnership is crucial to meet business needs. The County needs a stable economic environment to thrive without fiscal and regulatory changes that are disadvantageous and disruptive. Key topics are: stable exchange rates, low interest rates, simplified taxation and reformed business rates. Employees are businesses most valuable asset. There are skills and labour shortages in the County. There is a need for training funding to be maintained (the apprenticeship reforms that will cut funding for SMEs is a real concern), for quality careers guidance to be provided, no cuts to school funding, housing to be provided for key workers, sensible immigration policy that allows employers to source labour needed and training establishments to recruit overseas students. The County suffers from poor connectivity. Current commitments must be implemented and other key County needs addressed. Priorities are: Digital Connectivity and Telecoms – comprehensive coverage to match that provided in Cornwall.  Road Network – early implementation of A30/A303 upgrade to provide second quality route into the County, local improvements such as the improvements to the North Devon Link Road to cater for growth and removal of pinch points and highway dangers. Rail – commitment to implement the Peninsula Rail Taskforce proposal, protecting direct rail services from the County to the Midlands and the North, which are currently under threat, and provision of quality services to serve North and Central Devon. Air – promotion of Exeter Airport and local connectivity from all parts of the County. Protection of science and technology budgets to stimulate innovation and research and development. Put continuing trade with Europe at the top of the list in Brexit negotiations. Provide greater support to exporters to help develop new worldwide markets. Building on the success of the Hinkley and Olympics supply chain initiatives reform public sector procurement to give local discretion and improved processes. Commit to implementing existing business promoting initiatives such as the Industrial Strategy and those designed to improve productivity. Also support key sectors such as tourism and continue to promote diversification in areas affected by defence cuts. Ensure continuity of energy supplies that are competitively priced against international competitors. Ensure that the natural advantages in generating energy in the county can be exploited. NEWS", "external_links": [], "published": "2017-05-18T19:15:00.000+03:00", "crawled": "2017-05-18T14:13:19.000+03:00", "highlightTitle": ""}