{"organizations": [], "uuid": "1efc7e4311fa07f7958eb3bb9638e3f9a51849d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12969582.ece/ALTERNATES/s1200/Construction-industry-employment-report.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-groups-warn-skills-recruitment-12969529", "country": "GB", "domain_rank": 21960, "title": "Business groups warn that skills and recruitment are key for UK future", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business groups warn that skills and recruitment are key for UK future", "spam_score": 0.0, "site_type": "news", "published": "2017-05-02T07:01:00.000+03:00", "replies_count": 0, "uuid": "1efc7e4311fa07f7958eb3bb9638e3f9a51849d7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/business-groups-warn-skills-recruitment-12969529", "ord_in_thread": 0, "title": "Business groups warn that skills and recruitment are key for UK future", "locations": [], "entities": {"persons": [{"name": "brian berry", "sentiment": "none"}, {"name": "adam marshall", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "british chambers of commerce", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "milburn house", "sentiment": "none"}, {"name": "bcc", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "federation of master builders", "sentiment": "none"}, {"name": "fmb", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "chambers of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business groups warn that skills and recruitment are key for UK future British Chambers of Commerce and Federation of Master Builders have spoken out as the election campaign continues Share Builders on a building site (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTwo leading business organisations have warned that skills and recruitment must be key to the country’s future as the political parties contemplate Brexit and the General Election . \nThe British Chambers of Commerce (BCC) said the General Election should not be just about the terms of the UK leaving the EU, while the Federation of Master Builders (FMB) has warned that any election pledges on housebuilding will be “redundant” if there are not enough skilled workers in the construction industry . \nThe BCC has said the next government must have a clear idea of how to support economic growth by improving competitiveness and upgrading physical and digital infrastructure. \nIt also called for the status of EU nationals to be protected and for an immigration system that was responsive to skills shortages. \nDr Adam Marshall, director general of the BCC said: “While businesses all across the UK want a good Brexit deal, they are very clear that decisions taken here at home matter as much, if not more, to our future growth prospects. \n“The best possible Brexit deal won’t be worth the paper it’s written on if firms cannot recruit and train the right people, get decent digital connectivity, or get their goods to their market. \n“At this election, business communities want a clear commitment from all parties to create the best possible conditions for growth, in every region and nation of the UK. \n“Westminster must stop and reverse the relentless increases in the up-front cost of doing business in Britain, and give firms the confidence to drive investment, job growth and exports through the Brexit transition and beyond.” Read More Orange Bus doubles size of Newcastle office at historic Milburn House \nMeanwhile, the FMB said migrant labour was crucial to the sector, pointing out that in some areas of the country, more than half the industry’s workforce was made up of non-UK nationals. \nThe group called on the next Government to make sure construction firms have enough skilled workers after Brexit. \nBrian Berry, chief executive of the FMB, said: “The UK construction sector’s demand for skilled migrant workers from the EU and beyond cannot be overstated. Read More Newcastle and other cities will lose investment after election decision, city chief warns \n“Pre-Brexit, 60% of small construction firms are already having trouble hiring bricklayers and that’s before the UK abandons the free movement of people. \n“If the next Government implements an inflexible immigration system that hinders the ability of talented foreign construction workers from making their way to the UK, any manifesto pledges relating to the delivery of housing and infrastructure will be rendered meaningless.” Like us on Facebook", "external_links": [], "published": "2017-05-02T07:01:00.000+03:00", "crawled": "2017-05-02T02:23:20.000+03:00", "highlightTitle": ""}