{"organizations": [], "uuid": "058bae171151137f75f034cbb078df4f2a08cf57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30339074/16006421.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/liz-kendall-rounds-on-tory-teacher-election-rival-over-leicester-west-school-cash-cuts/story-30339074-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Liz Kendall rounds on Tory teacher election rival over Leicester West school cash cuts | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.839, "site_type": "news", "published": "2017-05-18T01:24:00.000+03:00", "replies_count": 0, "uuid": "058bae171151137f75f034cbb078df4f2a08cf57"}, "author": "", "url": "http://www.leicestermercury.co.uk/liz-kendall-rounds-on-tory-teacher-election-rival-over-leicester-west-school-cash-cuts/story-30339074-detail/story.html", "ord_in_thread": 0, "title": "Liz Kendall rounds on Tory teacher election rival over Leicester West school cash cuts | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "liz kendall", "sentiment": "negative"}, {"name": "danjmartin", "sentiment": "negative"}, {"name": "jack hickey", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "ian bradwell", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "kendall", "sentiment": "none"}, {"name": "slater", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "fullhurst", "sentiment": "none"}, {"name": "parks", "sentiment": "none"}, {"name": "hickey", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "braunstone", "sentiment": "none"}, {"name": "leicester west", "sentiment": "none"}, {"name": "woodstock", "sentiment": "none"}], "organizations": [{"name": "tory", "sentiment": "negative"}, {"name": "leicester west school", "sentiment": "negative"}, {"name": "beaumont leys", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "barley croft", "sentiment": "none"}, {"name": "new college", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Liz Kendall rounds on Tory teacher election rival over Leicester West school cash cuts By danjmartin | Posted: May 17, 2017 1 COMMENTS SHARES Labour's Liz Kendall has called out Tory election rival Jack Hickey on education budgets Liz Kendall rounds on Tory teacher election rival over Leicester West school... X \nCopy link to paste in your message / Comments (1) \nLiz Kendall has hit out at her Tory election rival over funding cuts to schools in Leicester West. \nThe Labour candidate said nine schools in the constituency would lose £398,000 a year under changes planned by the Conservatives. \nMs Kendall is now calling on Tory candidate Jack Hickey – a primary school teacher – to oppose his party's plans. \nMs Kendall said the schools affected in Leicester West include Barley Croft, Parks, Braunstone, Slater, Woodstock and Queensmead primaries and three secondary schools, Beaumont Leys, Fullhurst and New College. \nGeneral Election 2017: Click HERE for everything you need to know \nShe warned the cuts could force schools to cut the number of teachers or support staff, increasing class sizes and reducing the amount of attention each child receives. \nExtracurricular activities such as school trips and afterschool clubs would also be at risk. \nMs Kendall said: \"Conservative plans to cut money from our schools are completely wrong. \n\"They will make it harder for children to get the skills and qualifications they need and harm the future prosperity of our city. \n\"As a teacher, the Conservative candidate should know how damaging these cuts are and make clear he opposes them. The people of Leicester West need a strong MP who will stand up for this area and always put their interests first. \n\"If I am re-elected on June 8 I will continue to oppose these damaging cuts, back our hard-working heads and teachers and fight for more primary school places and high-quality apprenticeships.\" \nMs Kendall has raised the issue of cuts with the Education Secretary in Parliament and met the schools minister to demand the Government changes its mind. \nRead more: Liberal Democrat manifesto promises Brexit deal referendum \nMr Hickey said: \"I'm a teacher by trade and will always fight to get the best possible resources for pupils and parents. \n\"We will take no lessons from Labour on education, Nearly two million more children are being taught in good or outstanding schools since the Conservatives came into Government, with education funding having never been higher. \n\"You can only afford to invest in education if you have a successful economy, which can be secured from the leadership offered by Theresa May. \n\"The risk to our finances comes from having Jeremy Corbyn in Downing Street, which could happen if you vote for Corbyn's Labour candidate in Leicester West on June 8.\" \nLib Dem Leicester West candidate Ian Bradwell said his party opposed cuts and would invest £7 billion in schools and colleges. \nHe said: \"It is true the Tories have starved schools of funding but the Labour city council here has not done very much with the money there is.\"", "external_links": [], "published": "2017-05-18T01:24:00.000+03:00", "crawled": "2017-05-17T23:41:53.000+03:00", "highlightTitle": ""}