{"organizations": [], "uuid": "ff03feb8ef25c1f917bb4f41cb76943057dda178", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12983516.ece/ALTERNATES/s1200/CS15661269.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12978242", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: JP Morgan to move 1,000 jobs from UK to secure EU business after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: JP Morgan to move 1,000 jobs from UK to secure EU business after Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-05-04T14:55:00.000+03:00", "replies_count": 0, "uuid": "ff03feb8ef25c1f917bb4f41cb76943057dda178"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12978242", "ord_in_thread": 0, "title": "Business Breakfast LIVE: JP Morgan to move 1,000 jobs from UK to secure EU business after Brexit", "locations": [], "entities": {"persons": [{"name": "james ramsbotham", "sentiment": "none"}, {"name": "paul faith/pa wire", "sentiment": "none"}, {"name": "rex orton", "sentiment": "none"}, {"name": "joe giddens/pa wire", "sentiment": "none"}, {"name": "nick brayshaw", "sentiment": "none"}, {"name": "dunelm", "sentiment": "none"}, {"name": "stuart gulliver", "sentiment": "none"}, {"name": "douglas flint", "sentiment": "none"}, {"name": "david rose", "sentiment": "none"}, {"name": "winston north", "sentiment": "none"}, {"name": "lord wolfson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "martin robinson", "sentiment": "none"}, {"name": "milton keynes", "sentiment": "none"}, {"name": "esh", "sentiment": "none"}, {"name": "andrew tonks", "sentiment": "none"}, {"name": "david fischel", "sentiment": "none"}, {"name": "joanne estell", "sentiment": "none"}, {"name": "charlie peppiatt", "sentiment": "none"}, {"name": "bob contreras", "sentiment": "none"}, {"name": "cameron ross", "sentiment": "none"}, {"name": "eddie aston", "sentiment": "none"}, {"name": "mikael", "sentiment": "none"}, {"name": "lumsden", "sentiment": "none"}, {"name": "manning", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "wolfson", "sentiment": "none"}, {"name": "jonathon manning metrocentre", "sentiment": "none"}, {"name": "brian manning", "sentiment": "none"}, {"name": "potts", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "carroll", "sentiment": "none"}, {"name": "gulliver", "sentiment": "none"}, {"name": "hobart rose", "sentiment": "none"}, {"name": "david potts", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "mark tucker", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "merry hill", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "northgate", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "eldon square", "sentiment": "none"}, {"name": "winston", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "intu metrocentre", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "jp morgan", "sentiment": "negative"}, {"name": "hsbc", "sentiment": "negative"}, {"name": "tait walker", "sentiment": "none"}, {"name": "esh group", "sentiment": "none"}, {"name": "fuda hobart rose ltd", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "fuda international trading company", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "intu properties", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "castle view enterprise academy", "sentiment": "none"}, {"name": "northgate vehicle hire", "sentiment": "none"}, {"name": "stadium group", "sentiment": "none"}, {"name": "business durham", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "aia", "sentiment": "none"}, {"name": "isuzu", "sentiment": "none"}, {"name": "northumberland arch", "sentiment": "none"}, {"name": "northgate plc 8:44 jonathon manning stadium group", "sentiment": "none"}, {"name": "esh group  business", "sentiment": "none"}, {"name": "imi", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "agm", "sentiment": "none"}, {"name": "newcastle eagles", "sentiment": "none"}, {"name": "hobart rose  more", "sentiment": "none"}, {"name": "business growth service", "sentiment": "none"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "hobart rose", "sentiment": "none"}, {"name": "manufacturing advisory service", "sentiment": "none"}, {"name": "durham committee north east chamber of commerce", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "community", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Newcastle law firm Bond Dickinson ranked 16th for brand recognition \nBond Dickinson has been named as having one of the top 20 UK law firm brands, after being ranked 16th in the Acritas UK Law Firm Brand Index 2017. \nThe position is two higher than last year when the firm tanked 18th. \nThe report is based on data collected between January and November 2016 and ranks a total of 163 law firms. \nLaunched on May 3, the report measures performance of law firms across key criteria such as: top of mind awareness, favourability, and consideration for top level litigation and M&A. \nJonathan Blair, managing partner at Bond Dickinson, said: \nWe’ve worked hard to keep developing a strong brand as a national firm and are delighted to feature amongst the Top 20 in the Acritas UK Law Firm Brand Index. It’s good to see that Bond Dickinson is a brand that clients associate with excellent service and heavyweight legal expertise. Jonathan Blair, managing partner of Bond Dickinson 9:12 Jonathon Manning KPMG facing watchdog probe after Rolls-Royce finances Audit \nBritain’s accountancy watchdog has opened an investigation into KPMG’s audit of Rolls- Royce after the engine-maker agreed to pay £671m to settle bribery and corruption claims. \nThe Financial Reporting Council (FRC) said it will probe the conduct of the accountancy giant in relation to the audit of the financial statements of Rolls-Royce for 2010, 2011 and 2013. \nThe decision to investigate follows a Deferred Prosecution Agreement between Rolls-Royce and the Serious Fraud Office in January, which saw the firm stump up £671m to settle corruption and bribery allegations. \nThe FRC said: \nThe FRC has commenced an investigation under the Audit Enforcement Procedure into the conduct of KPMG Audit Plc, in relation to the audit of the financial statements of Rolls-Royce Group plc for the year ended 31 December 2010 and of Rolls-Royce Holdings plc for the years ended 31 December 2011 to 31 December 2013. \nThe decision to investigate follows the SFO announcement on 17 January 2017 of a Deferred Prosecution Agreement between the SFO and Rolls-Royce which relates to offences including conspiracy to corrupt and a failure to prevent bribery. \nThe agreements relate to bribery and corruption scandals involving intermediaries in overseas markets such as Indonesia and China. Rolls-Royce first passed information to the SFO in 2012 after facing “allegations of malpractice” in the two countries, after which the fraud squad launched a formal investigation. \nOfficials for the firm, which has an office in Newcastle, said at the time its own investigations had found “matters of concern” in additional overseas markets. KPMG offices (Photo: Niall Carson/PA Wire) 9:04 KEY EVENT Accounting change sends HSBC profits 19% lower \nProfits at HSBC fell 19% in the first quarter after an accounting change hit the banking giant’s bottom line. \nThe British lender said the fall to $5bn (£3.8bn) reflected a change in the accounting of the fair value of its debt. However, the figure was still ahead of expectations, and adjusted pre-tax profits rose 12% to $5.9bn (£4.5bn) as the bank was boosted by improved trading and rising interest rates. \nAdjusted revenue edged 2% higher to 12.8bn (£9.9bn), helped by growth in current accounts, savings and deposits. The bank’s London-listed shares rose 3.3% in morning trading as investors welcomed the figures. \nChief executive Stuart Gulliver said: \nThis is a good set of results. The increase in adjusted profit was driven by strong performances in three of our four global businesses. \nGlobal banking and markets had a great quarter, commercial banking delivered higher revenue from our liquidity and cash management activities, and retail banking and wealth management was supported by rising interest rates and renewed customer investment appetite. \nMr Gulliver also flagged progress on HSBC’s cost-cutting programme, through which it aims to save around $6bn(£4.8bn) a year. \nThe results came after the bank revealed in February that it was facing a UK investigation over money-laundering controls and posted a worse-than-expected 62% full-year profits slump. \nThe lender said the Financial Conduct Authority (FCA) launched a probe at the end of last year into its financial crime compliance, with the group remaining under pressure on both sides of the Atlantic after its £1.2nn US money-laundering fine nearly five years ago. \nHSBC is one of a number of banks considering relocating jobs to the continent after the Brexit vote, having said that 1,000 jobs may have to move from London to Paris over the next two years depending on the outcome of negotiations. \nThe trading update was the first since HSBC revealed that AIA chief executive Mark Tucker will replace outgoing chairman Douglas Flint in October. A sign outside a HSBC branch (Photo: Joe Giddens/PA Wire) 8:55 KEY EVENT More than 120 jobs lost at North Shields furniture maker Hobart Rose \nMore than 120 jobs have been lost at a North East furniture maker after the firm lost a major client. \nFuda International Trading Company, which traded as Hobart Rose, produced furniture and soft furnishings for the likes of Dunelm, John Lewis and Next from its North Shields base. It also ran a popular factory outlet shop. \nHowever, the long-established family firm has ceased to trade with the loss of the entire 122-strong workforce after running into financial issues following the loss of a major contract. \nA statement issued on behalf of the firm told how the directors were unable to come to repayment agreements with creditors and unfortunately had no option other than to close the doors. \nThe company’s affairs are now being dealt with by accountancy firm Tait Walker. \nEstablished around 58 years ago, Hobart Rose used to run an operation in China with two other local partners, which employed 150 people, but recent years had seen the firm make efforts to reshore jobs. \nOnly two years ago it was announced that the furniture manufacturer had managed to reshore around 20% of its manufacturing back from China and that it expected to create 100 jobs in the process. \nThe North Shields-based firm used funding from the Manufacturing Advisory Service (MAS) to make the move and it also received around £285,000 investment from The Journal’s Let’s Grow fund to help to equip the firm, along with support from the Business Growth Service. \nThe firm’s last accounts, for the year ended April 30 2016, showed that moves to “home-shore” was going as planned, but that trading conditions remained tough throughout the last year, Brexit was challenging margins and there was a significant reduction in sales in the run-up to the crucial Christmas trading period. \nIn a review of the business, filed at companies house on January 27 2017, directors described how a reorganisation at its main customer led to a drop in sales, which slipped from £8.4m to £7.15m. The previous year’s operating profit of £63,432 also dropped to a loss of £127,061. From left: Martin Robinson, David Rose (both Fuda Hobart Rose Ltd) and Cameron Ross (MAS) back in 2015 when the firm was tapping into funding to bring work back to the North East (Photo: tark archive) 8:50 Jonathon Manning Northgate Vehicle hire places £2.5m order for new pick-up truck \nNorthgate Vehicle Hire has placed an order worth £2.5m for a fleet of Isuzu D-Max pick-up trucks on the day of its launch. \nThe previous version of the truck has proved popular within the hire company’s 50,000-strong fleet of vehicles. \nEddie Aston, managing director at Northgate Vehicle Hire, said: \nThe new D-Max vehicle is a better proposition than ever. Not only has it retained its 3.5 tonne towing capability, it also has no AdBlue, better fuel economy and lower CO2 emissions than the earlier version. \nAs a business, Northgate seeks to provide the best vehicle in each category. Isuzu certainly ticks the box in the pick-up sector \nNorthgate is the largest buyer of commercial vehicles in the UK. It supplies cars, vans, pick-up trucks and other specialised vehicles to the commercial market. Bob Contreras, chief executive of Northgate plc 8:44 Jonathon Manning Stadium Group boast increased order book and find new FD \nHartlepool-based Stadium Group has revealed its order book has increased by £2.2m since the year end. \nChairman Nick Brayshaw will tell investors, at the group’s AGM today, that the company’s order book now exceeds £28m. This is up from £25.8m at the year end. \nThe firm has also ended its search for a new finance director after Joanne Estell stepped down in October last year. She was due to be replaced by Rex Orton, but he was unable to take up the role due to ill health. \nA trading update the firm said: \nWe are pleased to have also announced today that Winston North will take up the position of group finance director and company secretary on 15 May. \nWinston has an excellent set of relevant skills and extensive experience gained during his time as divisional finance director within IMI plc and we look forward to his contribution to the business. \nThe board would also like to thank Andrew Tonks for his work as interim finance director over the last few months and for his support in ensuring an orderly handover to Winston. Chief executive of Stadium Group, Charlie Peppiatt 8:41 Jonathon Manning Price cuts help push Morrisons sales up 3.4% \nMorrisons has reported better than expected sales growth in the first quarter after reaping the rewards of price cuts and strong Easter trading. \nThe supermarket said like-for-like sales grew 3.4% in the three months to April 30, ahead of analyst expectations and an acceleration on the previous quarter’s 2.9%. \nChief executive David Potts said: \nWe are improving the shopping trip in many different ways, which is making Morrisons more popular and accessible for customers. \nThese new initiatives in-store, online, in wholesale and services are beginning to build a broader, stronger Morrisons. \nThe company said its Price Crunch initiative has seen more customers come through its doors, with sales over Valentine’s Day, Mother’s Day and Easter particularly strong. \nMr Potts said the group is “working hard” to remain competitive, despite an increase in the price of food imports linked to the collapse in the Brexit-hit pound. \nMorrisons said its deal to sell groceries through Amazon “continues to grow”, with the same-day and one-hour delivery service recently extended into more London postcodes. A Morrisons store (Photo: Mikael Buck/Morrisons/PA Wire) 8:33 Jonathon Manning Metrocentre and Eldon Square welcome top international names amid tough times in retail \nMetrocentre and Eldon Square owner Intu Properties is weathering tough times in retail, having already attracted a raft of top international names this year. \nUncertainty surrounding Brexit and the rise of online shopping is serving up a challenging market for the high street, with several national firms already warning of difficult times ahead. \nIntu Properties, however, which owns intu Eldon Square in Newcastle and Gateshead’s intu Metrocentre among 17 centres in the UK and Spain, has released a trading update in which it says demand from tenants remains high, despite the fact that many retailers are being selective about their expansion plans. \nDirectors said aspirational brands are continuing to recognise the attraction of destination shopping centres, with Hugo Boss and Guess joining the line up at intu Metrocentre, Tesla at intu Milton Keynes and Tag Heuer opening its first store in the West Midlands at intu Merry Hill. \nDavid Fischel, intu chief executive, said: \nAlthough retailers are being selective with their expansion plans, they are prioritising expansion to prime established locations with strong footfall. intu as the UK market leader with 17 prime centres is well positioned to take advantage of this demand. \nThe environment for business this year is likely to be challenging with considerable uncertainty regarding the UK’s EU exit. However, it is our intention to deliver continuing growth in like-for-like net rental income. Entrance to Eldon Square from Northumberland Street (Photo: newcastle chronicle) 8:28 Jonathon Manning Business community pays tribute to Brian Manning of Esh Group \nBusiness and charity leaders have paid warm tributes to Brian Manning , the chief executive of construction and engineering firm Esh Group, who passed away last week. \nMr Manning spent 44 years in the construction and engineering industry and earned a reputation as an astute businessmen who was also keen to put back something back into the local community, both personally and through his firm. \nA firm believer in inspiring young people, Mr Manning helped to create the Esh Academy two years ago, which trains up scores of apprentices every year. \nEsh’s commitment to the region was shown just a few days before Mr Manning’s death, when the company was shortlisted in the national Responsible Business Awards for its work promoting STEM subjects in schools. The company also sponsors the Newcastle Eagles basketball team. \nIn a personal capacity, Mr Manning was vice president, board and council member of the North East England Chamber of Commerce, chairman of Durham Committee North East Chamber of Commerce as well as a board member of Changing Lives, Northumberland Arch, Business Durham and Castle View Enterprise Academy. \nMr Manning, who lived in Sunderland, was also a member of the regional leadership team for Business in the Community and on the regional council of the CBI. \nJames Ramsbotham, chief executive of the North East England Chamber of Commerce, knew Mr Manning for more than two decades and said that he became a firm friend as well as a colleague. \nHe said: \nI have been privileged to have worked with Brian Manning in several guises over the last 25 years, first as his bank manager, then as a colleague within Esh Group, and latterly with him as vice president of the Chamber of Commerce. \nDuring all that time I have held him in the highest regard as a businessman and a friend, always dependable and usually right. \nHe never shirked a challenge and imparted strength and determination to all those around him. The transformation from Lumsden and Carroll to the success of the Esh Group is the most phenomenal North East business success story and he has been at the heart of it throughout. \nBut that alone does not begin to do justice to the colossus that was Brian Manning. His personal, commercial and charitable work with young people, with the homeless, with ex-offenders, with so many people from every part of the region has been both inspirational and life changing. \nIf the definition of a civilised society is the way it takes care of its weakest citizens, Brian is without doubt one of the most civilised people I have ever met. \nHe leaves an incredible legacy and so many people, many of whom never even knew him, owe him more than they will ever know. Brian Manning, chief executive of Esh Group (Photo: Esh Group) 8:23 KEY EVENT Disappointing first quarter for Next as sales plunge \nRetail giant Next revealed that high street sales plunged by 8.1% in its first quarter and cut its profit outlook once again as it warned that trading would remain under pressure. \nThe worse-than-expected performance over the 13 weeks to April 29 came despite a boost from the later, warmer Easter this year, although Next said its Directory arm performed better, with sales up 3.3%. This left total full-price sales 3% lower. \nNext cut the top end of its profit guidance after the disappointing first quarter, with full-year profits now expected to fall by between 13.9% and 6.4%. \nChief executive Lord Wolfson said the group was still battling to recover from mistakes made last year with its product ranges, while consumer confidence has also been hit as rising prices puts households under pressure. \nHe said: \nThere’s general pressure on the high street but the omissions in our own range are hitting our sales over and above any downturn. \nLord Wolfson said he was expecting “more of the same” in the group’s second quarter, as it also comes up against tougher comparatives from a year earlier. He added: \nThe clothing sector is not an easy sector and we recognised in our full-year results announcement in March that some of our ranges weren’t where we wanted them to be. \nThe group admitted in March that its lines were missing the wardrobe staples Next is renowned for, such as easy-to-wear work blouses in a number of colours. \nIt has since overhauled its ranges, but stressed the full impact of changes will not be seen for some months. \nWe said that we expected some improvements from May onwards, but that our ranges would not be where we wanted them to be until the autumn season in September. We still believe this to be the case. \nNext said on Thursday. Next posted its first fall in annual profits for eight years in March, reporting a 3.8% fall in underlying pre-tax profits to £790.2m for the year to January. \nIts annual report last month revealed that Lord Wolfson saw his total pay packet plummet by more than 55% to £1.8m after the dire year. A Next store (Photo: Paul Faith/PA Wire) 8:16", "external_links": [], "published": "2017-05-04T14:55:00.000+03:00", "crawled": "2017-05-04T11:23:52.000+03:00", "highlightTitle": ""}