{"organizations": [], "uuid": "c1c572214aba74fc7ea41e0f3fbca46e31fe2bac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12274685.ece/ALTERNATES/s1200/JS106630012.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13070147", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: RBS high court battle with shareholders set to start", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-22T15:15:00.000+03:00", "replies_count": 0, "uuid": "c1c572214aba74fc7ea41e0f3fbca46e31fe2bac"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13070147", "ord_in_thread": 0, "title": "Business Breakfast RECAP: RBS high court battle with shareholders set to start", "locations": [], "entities": {"persons": [{"name": "guy whittaker", "sentiment": "none"}, {"name": "simon smith", "sentiment": "none"}, {"name": "tom mckillop", "sentiment": "none"}, {"name": "caesar", "sentiment": "none"}, {"name": "nigel smith", "sentiment": "none"}, {"name": "jim farley", "sentiment": "none"}, {"name": "synoptica", "sentiment": "none"}, {"name": "greg schulze", "sentiment": "none"}, {"name": "goodwin", "sentiment": "none"}, {"name": "ann francke", "sentiment": "none"}, {"name": "paul jennings", "sentiment": "none"}, {"name": "pratap shirke", "sentiment": "none"}, {"name": "nicki clark", "sentiment": "none"}, {"name": "seaham", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "danny lawson/pa wire", "sentiment": "none"}, {"name": "simon goon", "sentiment": "none"}, {"name": "fred goodwin", "sentiment": "none"}, {"name": "hackett", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "peter hodgson", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}, {"name": "joe hinrichs", "sentiment": "none"}, {"name": "johnny cameron", "sentiment": "none"}, {"name": "colin smith", "sentiment": "none"}, {"name": "alan wilson", "sentiment": "none"}, {"name": "ringtons", "sentiment": "none"}, {"name": "marcy klevorn", "sentiment": "none"}, {"name": "ringtons- simon", "sentiment": "none"}, {"name": "jim hackett", "sentiment": "none"}, {"name": "schulze", "sentiment": "none"}], "locations": [{"name": "coreena ford us", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "guildford", "sentiment": "none"}, {"name": "soho", "sentiment": "none"}, {"name": "malmaison", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "synoptica", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "basel", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "shoreditch", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "seaham", "sentiment": "none"}, {"name": "dakota", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "rbs", "sentiment": "negative"}, {"name": "treasury select committee", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "ford  ford", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "chartered management institute", "sentiment": "none"}, {"name": "chez mal", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "dakota house", "sentiment": "none"}, {"name": "dakota house of design", "sentiment": "none"}, {"name": "business durham", "sentiment": "none"}, {"name": "north p&i group", "sentiment": "none"}, {"name": "be group", "sentiment": "none"}, {"name": "coreena ford managers", "sentiment": "none"}, {"name": "newcastle-based north p&i group", "sentiment": "none"}, {"name": "expedia", "sentiment": "none"}, {"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "steelcase", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}, {"name": "standard & poor", "sentiment": "none"}, {"name": "rbs shareholder action group", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "big data", "sentiment": "none"}, {"name": "coreena ford newcastle malmaison", "sentiment": "none"}, {"name": "ford smart mobility llc", "sentiment": "none"}, {"name": "north group", "sentiment": "none"}, {"name": "fenruary", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "north p&i club", "sentiment": "none"}, {"name": "abn amro", "sentiment": "none"}, {"name": "royal bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford US tourists flock to US to reap rewards of weak pound \nUS travellers are flocking to the UK because of the soft pound, according to one of the world’s largest online travel firms. Expedia reported an 80% jump in UK summer bookings from across the Atlantic between January and March, compared with the same period last year. \nAmerican visitors are taking advantage of the 13% fall in the value of sterling compared with the US dollar since the EU referendum in June last year. Expedia’s global head of transport, Greg Schulze, said: “The best deals on air fares are coming from the US into the UK. \n“We’re seeing discounts of 20% to 30% from a year prior.” \nDemand for US travel to Europe has been “resilient” despite a number of deadly terror attacks, Mr Schulze said. \nHe said: “When there is an incident, travel is impacted. But we’ve seen it to be quite resilient. \n“The reality is that people love to travel. Right now, there are good deals for Europe as a destination, especially the UK as a destination. \n“It’s largely related to the currency, but also with the capacity for the airlines on certain routes and the competition that brings. We’ve seen great deals for travellers coming into the UK.” \nUK hotel and flight packages for US tourists are more than 45% cheaper than last year, Expedia’s figures show. \nAfter three years of strong growth, inbound tourism to the US has steadied in recent months, leading to airlines also offering attractive prices for westbound travel across the Atlantic, according to Mr Schulze. US tourists are flocking to the UK thanks to the weak pound 8.54 Coreena Ford Chief executive Mark Field poised to leave Ford \nFord will part company with chief executive Mark Fields amid questions about the car giant’s performance and future strategy, it has been reported. \nMr Fields is retiring after 28 years at the company, according to several reports coming out of the US. \nThe 56-year-old is to be replaced by Jim Hackett, who joined Ford’s board in 2013 and has led the carmaker’s mobility unit since last year. \nUnder Mr Fields’ three-year tenure at the helm, Ford’s shares have tumbled almost 40% and he has come under fire for not focusing enough on the core business. \nMr Hackett is the former boss of office furniture maker Steelcase, one of the world’s largest office furniture companies. \nHe is credited with transforming that company, in part by predicting the shift away from cubicles to open office plans. \nHe also cut thousands of jobs and moved furniture production from the US to Mexico to stem massive losses at the company. \nAs part of the shake-up, several Ford executives are taking on new roles. \nJim Farley, who led the company’s European division back to profitability in recent years, will become vice president of global markets and will oversee Lincoln, sales and marketing. \nJoe Hinrichs, president of Ford’s Americas division, will oversee global product development, manufacturing and quality. \nMarcy Klevorn, Ford’s chief technical officer, will replace Hackett as the head of Ford Smart Mobility LLC, Ford’s future mobility unit. 8.49 Coreena Ford Newcastle Malmaison bar to reopen after makeover by Dakota House of Design \nThe hotel chain enlisted the expertise of Dakota House of Design to draw up a completely new look for the Chez Mal bar and give it a more feminine feel. \nThe owners want it to be seen as a luxury destination bar. \nThe new design, which will be unveiled to the public on May 25, reveals more relaxed, lower seating and tables as well as a new-look bar servery area. \nDakota House of Design has added features including planted ceiling rafts, crown-shaped featuring lighting, leather drapes, glass screens and other design details to turn the bar into an on-trend venue for hotel guests as well as Quayside visitors. \nThe contract to transform Chez Mal comes soon after Dakota House of Design was shortlisted for an international award. \nThe interior design, architecture and visualisation studio, which works in the hospitality, leisure and residential sectors, with major brands such as Premium Country Pubs, Best Western Hotels and European casinos belonging to Caesar’s Palace in Las Vegas, was one of six shortlisted in the iDogi 2016 International Architecture and Design Awards for its work on Soho, a popular bar in Basel, Switzerland. \nPeter Hodgson, director of Dakota, said: “In keeping with the most recent trends in bar and restaurant design, Dakota provided a ‘stripped-back’ look, revealing the fabric of the building, and adding other rustic items but with a more polished, luxurious feel.” Malmaison's Newcastle hotel has undergone a makeover which will be unveiled soon (Photo: Malmaison) 8.44 Coreena Ford Hi-tech jobs come north as Seaham's BE Group invests in artificial intelligence company \nHi-tech jobs will be created in the North East after a County Durham company invested in an up-and-coming technology business. \nBusiness services company BE Group, which is based in Seaham, has become a major investor in AI business Synoptica. \nThe firm is currently based in Guildford and Shoreditch, providing data and artificial intelligence services that allow customers to profile, rank, track and forecast business they have an interest in. \nAs a result of the investment, and to build on the North East’s strengths in Big Data and AI, Synoptica will be recruiting and basing a significant proportion of its team at BE’s office in the North East. \nThe deal has also seen Simon Goon, who is currently chief executive of Business Durham, the county’s economic development organisation, step down from that role to join Synoptica as chief operating officer. \nNicki Clark, chief executive of BE Group, said “This investment represents a step change in the group’s ability to provide our customers with uniquely targeted information that gives them a formidable competitive advantage. It’s also fantastic to be bringing some really special jobs to the North East of England.” BE Group offices, Seaham (Photo: ) 8.40 Coreena Ford Newcastle's North P&I Group toasts strong year \nDirectors at Newcastle-based North P&I Group – one of the world’s biggest shipping insurance mutuals – have toasted a strong year after seeing free reserves soar to £330m. \nThe firm, based on Newcastle Quayside, has strong links with the region’s rich maritime history but now has offices across Asia Pacific and Europe. \nThe free reserve figure is an indication of financial strength, with a large reserve meaning the group is in a better position to respond to a bad claims year and to avoid asking shipowners for additional premiums. \nEstablished more than 150 years ago, the firm focuses on insuring large ships such as freighters, and latest results for the year ended Fenruary 20 show it grew its insurance premium income to £320m. The amount of shopping tonnage insured under North also grew by 7%. \nIn January, leading ratings agency Standard & Poor’s affirmed North’s ‘A’ (stable) credit rating for the 13th consecutive year and strengthened its assessment of North Group’s capital adequacy from very strong (‘AA’) to extremely strong (‘AAA’). \nDue to shipowners continuing to face tough market conditions, North Group has not asked for any premium rate increases in the February 2017 renewals and also returned 5% of mutual premium to members for the 2016 policy year. Left to right: Paul Jennings, Pratap Shirke and Alan Wilson of North P&I Club (Photo: North P&I Club) 8.36 KEY EVENT How Ringtons is brewing up plans for the next generation to lead the family firm \nThe siblings currently at the top of Ringtons- Simon, Nigel and Colin Smith - have been at the famous family tea firm for many years now...and they’re now looking to the fifth and sixth generations who could take over the business. \nAnd the process is far more rigorous than you might think. The Ringtons brothers: Left to right, Colin Smith, tea packing divisional director, Simon Smith, CEO and Nigel smith, chairman 8.32 Coreena Ford   expansion makes way for fledgling firms \n  will soon complete a trio of mini units, especially designed with start-ups in mind. \nThe units   where fledgling firms will get the     8.22 Coreena Ford Managers look towards single market access from new government \nAlmost half of company managers want the new government to prioritise access to the single market and freedom of movement of people during the Brexit talks, a study finds. \nInvesting in infrastructure and promoting higher education also featured highly in a survey of 800 managers. \nOnly one in five said cutting corporation tax should be a top priority, said the Chartered Management Institute. \nChief executive Ann Francke said: \nPolitical leaders looking for a strong mandate from this election must consider the views of UK’s 3.2 million managers, who are key drivers of the UK’s productivity. \nManagers have serious concerns about continued access to skilled workers, and this is motivating the desire for free movement of people post-Brexit. \nAll parties should focus post-election on the need to build an internationally competitive economy based on a world-class skilled workforce. Managers want the new government to prioritise access to the single market 8.18 What's the FTSE latest? \nThe FTSE-100 index opened at 7470.71. \nThe pound at 8am was 1.3000 dollars compared to 1.3017 dollars at the previous close. The euro at 8am was 0.8605 pounds compared to 0.8597 pounds at the previous close. 8.10 KEY EVENT Royal Bank of Scotland prepares for shareholder High Court battle \nRoyal Bank of Scotland is bracing for a costly court battle with shareholders that is to see former boss Fred Goodwin defend his role in the lender’s near collapse during the financial crisis. \nMr Goodwin and a raft of former executives are in line for a public grilling as part of a £700m lawsuit brought against the lender by 9,000 retail investors and 18 institutions in The RBS Shareholder Action Group. \nWhile settling the lion’s share of the claims out of court, RBS is now heading for a 14-week trial which begins today. \nThe disgraced former chief executive - who was stripped of his knighthood following the bank’s near collapse - will answer questions over the events leading up to the Government’s £45.5bn bailout nine years ago. \nThe legal action centres on a rights issue overseen by Mr Goodwin in April 2008 when RBS asked existing shareholders to pump £12bn into the bank after leading a consortium that spent £49bn on Dutch bank ABN Amro. \nShareholders claim they were left nursing hefty losses following the cash call after RBS shares plunged 90% and the Government was forced to step in when the deal turned toxic. \nDespite the bank making significant headway in resolving the dispute, it has been unable to strike a deal with the last tranche of shareholders, with any chance of a last-ditch settlement proving a distant hope. \nThe bank has already settled with investors representing 87% of the claims by value - although it has not admitted liability - leaving 13% unresolved. \nWhile the court case will begin today, former RBS chairman Sir Tom McKillop will not appear until June 7, with ex-finance chief Guy Whittaker giving evidence on June 13 and former head of RBS investment bank Johnny Cameron on June 30. \nMr Goodwin will be cross examined on June 8, the day of the General Election. The bank is legally obliged to provide lawyers for the former directors, but the lender’s legal costs have drawn sharp criticism, as the bill escalates towards £125m - including £6.5m defending Mr Goodwin and the ex-RBS bosses. Three members of the influential Treasury Select Committee warned in April that RBS could face a parliamentary inquiry into the spiralling legal costs, which will make it one of the most costly civil defences in British history. Royal Bank of Scotland branch (Photo: Danny Lawson/PA Wire) Share", "external_links": [], "published": "2017-05-22T15:15:00.000+03:00", "crawled": "2017-05-22T12:27:07.000+03:00", "highlightTitle": ""}