{"organizations": [], "uuid": "73550e3845667227147fbe064c3d425a17e75205", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13111861.ece/ALTERNATES/s1200/Untitled-design-3.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-versus-theresa-who-13111789", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn versus Theresa May - who won the Battle For Number 10?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-30T20:03:00.000+03:00", "replies_count": 0, "uuid": "73550e3845667227147fbe064c3d425a17e75205"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-versus-theresa-who-13111789", "ord_in_thread": 0, "title": "Jeremy Corbyn versus Theresa May - who won the Battle For Number 10?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "neutral"}, {"name": "jeremy", "sentiment": "none"}, {"name": "paxman", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "jeremy paxman", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "jeremy corbyn labour", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "hamas", "sentiment": "none"}, {"name": "labour government", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ira", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "sky tv", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}, {"name": "faisal islam", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Thank you for subscribing!   \nThe Battle for Number 10 TV debate appears to have sealed the fate of one Jeremy at least - Jeremy Paxman. \nIt was the celebrated - and previously feared - grand inquisitor who got the biggest kicking due to his refusal to let Jeremy Corbyn or Theresa May answer any of his questions. \nIn this the second part of the format screened last night on Channel 4 and Sky TV - the first being questions from an invited studio audience - May performed slightly better than Corbyn as Paxman’s hectoring tactics allowed her to utter sound bites not answers in between his bluster. \nMeanwhile Corbyn’s political baggage - links to IRA, Hamas, and an embarrassing quote claiming that the Falklands War was some sort of Tory plot made back in the 1980s - was dumped in front of him by Paxman. \nIn the audience Q&A session the topic was also covered but Corbyn performed better there as he was allowed to give an explanation as to his motivation for them. \nWhen it was Paxman’s turn to quiz him on them, he gave the impression Corbyn has done it just to annoy him. \nBut who was the overall winner? Here are our scorecards on the main issues Brexit - winner Theresa May Prime Minister Theresa May is interviewed by Jeremy Paxman during a joint Channel 4 and Sky News general election programme (Photo: PA) \nIt saved her night to a certain extent. \nHaving been laughed at earlier in the evening by the studio audience, she parted with applause from those impressed by her tough stance on Brexit and her ‘no deal is better than a bad deal’ mantra. \nIt was a strong reposte to Paxman’s jibe that the EU view of her because of her recent policy U-turns was that she was “a blowhard that collapses at the first sign of gunfire”. \nCorbyn’s consensual or collegiate approach to politics is not suited to the prevailing public view that the Brexit negotiator needs to be tough. Read More We offer hope while the Tories offer fear, says Jeremy Corbyn as Labour launch manifesto Immigration - no clear winner \nCorbyn started well by saying immigration levels had to be managed and that a Labour Government would prevent large number of unskilled migrants being brought in by unscrupulous bosses to take jobs, winning a warm round of applause. \nPressed on Labour’s immigration target Corbyn said the party didn’t have a specific one but that immigration levels would probably – but I don’t want to be held to this – come down. The “probably” appearing a ‘cop out’ answer. \nMay had to accept that despite repeated promises to lower immigration as Home Secretary, it had gone up. As PM how would that change? She struggled here. Labour leader Jeremy Corbyn is interviewed by Jeremy Paxman during a joint Channel 4 and Sky News general election programme (Photo: PA) Leadership - no clear winner \nThis was Theresa May’s trump card at the beginning of the campaign but the ‘strong and stable’ line has turned into a bit of a joke. May struggled under questioning about her U-turns on first the National Insurance increase and then the ‘Dementia Tax’, making her seem a bit wobbly and evasive. \nCorbyn was helped by Paxman here who waved the Labour manifesto under his nose reminding him of the amount of things he had previously fought for not being present in it. \nCorbyn told him he was not a dictator and that it was produced by the Labour party, not just one person, and that it’s best sometimes for a leader to listen and not just speak. Read More Police cuts: Corbyn or May - who is telling the truth when it comes to cop cuts? Manifesto commitments - winner Jeremy Corbyn Labour leader Jeremy Corbyn with Sky News political editor Faisal Islam during a joint Channel 4 and Sky News general election (Photo: PA) \nThere are black holes in the Labour manifesto - £50bn worth according to the Tories to which you can add another £3bn, according to some commentators, after Corbyn hinted that benefits aren’t now going to be frozen by Labour. \nHowever he got off lightly because at least Labour put a figure to their spending plans and where the cash would come from. The Conservatives have not. \nSo when May tried to say Labour’s figures don’t add up she was jeered because the Tory manifesto hadn’t included figures to be added up. \nAnd then there was the cuts which to growing incredulity May seemed to think was not the point. \nQuizzed by an audience member on cuts to school funding, May said that wasn’t the issue: “People are focusing on funding but we need to ensure that we see more good or outstanding schools.” \nAnd it seems people were getting it wrong again on police cuts, the PM insisted: “It’s not about the numbers of police; people often focus on the numbers of police.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Defence - winner Theresa May Prime Minister Theresa May appears on a joint Channel 4 and Sky News general election programme (Photo: PA) \nCorbyn at last, sort of, said, if pushed, probably, he would use Trident - or ‘sign the papers’ to the relevant people to OK their use. \nAs far as we can recall he’d never gone that far before, so it was a start. \nThen he spoiled it by refusing to say he would green light a drone strike on a known terrorist target without having all the information. There was of course no need to ask either of these questions of Theresa May. Vision for Britain - winner Jeremy Corbyn \nWhile Theresa May’s position is defined by a tough stance on Brexit and effectively the continuing of austerity, Corbyn’s position is radically different. \nThe wealthier contributing more to improve schools, the NHS and public services. To deal with pay inequality and poverty. It’s going to cost but will Labour pay the price for the ambition outlined in its manifesto? Read More", "external_links": [], "published": "2017-05-30T20:03:00.000+03:00", "crawled": "2017-05-30T15:17:47.000+03:00", "highlightTitle": ""}