{"organizations": [], "uuid": "33783c53f5dc3e3dd1c9e7c3d4a77a02056d92ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12870793.ece/ALTERNATES/s1200/House-price-growth.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/property-news/parts-region-best-househunters-now-13053490", "country": "GB", "domain_rank": 21960, "title": "Which parts of our region are best for househunters now prices are slowing down", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-19T01:00:00.000+03:00", "replies_count": 0, "uuid": "33783c53f5dc3e3dd1c9e7c3d4a77a02056d92ee"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/news/property-news/parts-region-best-househunters-now-13053490", "ord_in_thread": 0, "title": "Which parts of our region are best for househunters now prices are slowing down", "locations": [], "entities": {"persons": [{"name": "sarah beeny", "sentiment": "none"}, {"name": "tepilo", "sentiment": "none"}, {"name": "richard snook", "sentiment": "none"}], "locations": [{"name": "south shields", "sentiment": "none"}, {"name": "getty images europe", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Which parts of our region are best for househunters now prices are slowing down We reveal the places where prices are down - and those where things are starting to look up Share Sold and For Sale signs (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nHouse prices in the North East have gone down, according to new official figures. \nWe are only region in the country which saw prices fall in the year to March, says the Office for National Statistics. \nAll other regions saw an increase, though not at the high levels seen in previous years. \nWithin the region South Shields recorded the biggest drop in prices. \nThe coastal town tops a list of locations where prices are dropping to more affordable levels. Money (Photo: PA) \nThat’s good news for buyers - but bad news for sellers who are seeing their asking prices do down. \nOnly one other area in the region - Northumberland - saw prices go down. \nOther areas saw increases but the North East average saw prices go down by 0.4 per-cent. \nAll others, including Newcastle , saw prices continue to rise. \nThe rises, however, were not all the same level as the past few years when the cost of buying a house soared. \nBuyers in North Tyneside had the worst luck with the region’s biggest increases. An array of To Let and For Sale signs (Photo: Getty Images Europe) \nHere’s what the figures for the year to March say: \n•The average house price in South Tyneside fell 0.3% in the year to March, down from an average of £119,925 in March 2016 to £119,574. \n•In Northumberland, prices fell 0.2% to £146,332. \n•North Tyneside had the fastest rising prices in the area, up 4% in the year to March, to an average of £155,392. \n•Prices were down by 0.1% in Newcastle to an average of £151,456. Read More \nNationally, there was a slowing down of the housing market, according to new figures from the Office for National Statistics. \nHouse prices dipped by 0.6% month-on-month in March. \nMeanwhile annual growth in property values slowed to its weakest level since 2013. \nWithin England, the lowest annual house price growth was here in the North East, where prices decreased by an average of 0.4% \nRichard Snook, a senior economist at PwC, said: “In a reversal of the normal regional pattern, the south of England showed some of the softest growth with price inflation of 2.8% in the South West, 3.8% in the South East and just 1.5% in London. This is the weakest figure for London since March 2012. \n“These figures are consistent with the Brexit-related slowdown that we anticipated last year and our guidance of 2% to 5% growth this year.” \nThe slowdown was welcomed by some experts. Read More What will happen to North East house prices in 10 and 20 years' time? \nSarah Beeny, owner of estate agent Tepilo, said: “The slowdown in house price growth we are seeing is simply due to the fact that house prices cannot continue rising at the rates we have seen over the past few years. \n“If the large rises we’ve experienced in recent years continued, the average house price would be almost double what it is now in 10 years’ time, and that’s just not realistic.” Like us on Facebook ", "external_links": [], "published": "2017-05-19T01:00:00.000+03:00", "crawled": "2017-05-18T20:17:01.000+03:00", "highlightTitle": ""}