{"organizations": [], "uuid": "b4339f97f83e1365284b3c2870590afd49978a1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13062792.ece/ALTERNATES/s1200/JS120106193.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-vs-tories-vs-lib-13062050", "country": "GB", "domain_rank": 21960, "title": "Labour vs Tories vs Lib Dems - the manifesto key points ahead of the 2017 General Election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-21T12:00:00.000+03:00", "replies_count": 0, "uuid": "b4339f97f83e1365284b3c2870590afd49978a1f"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-vs-tories-vs-lib-13062050", "ord_in_thread": 0, "title": "Labour vs Tories vs Lib Dems - the manifesto key points ahead of the 2017 General Election", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "anne marie trevelyan", "sentiment": "none"}], "locations": [{"name": "wansbeck", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "virgin trains east coast", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "halifax", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "west yorkshire", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "berwick anne-marie trevelyan", "sentiment": "none"}, {"name": "invalid email  labour", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "getty images europe)  conservative", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "getty images europe)  labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour is the only major party in England promising NOT to increase taxes on people on ordinary incomes. \nJeremy Corbyn’s plans for Government, published last week, included proposals to increase taxes by £48.6bn and increase spending by the same amount. \nBut careful reading of the manifestos shows that Labour is actually the only party pledging not to push up taxes for most working people. \nLabour’s manifesto states: “A Labour Government will guarantee no rises in income tax for those earning below £80,000 a year, and no increases in personal National Insurance Contributions or the rate of VAT.” Labour leader Jeremy Corbyn (Photo: Getty Images Europe) \nLabour manifesto key points Make zero-hour contracts a thing of the past Income tax rate 45p on £80,000 and above Abolish tuition fees Raise £48.6bn in taxes Hire 10,000 new police officers, 3,000 new firefighters Create a ‘Crossrail for the North’ between Manchester and Newcastle, which would connect to the HS2 high speed rail network Put the Government back in charge of railways, instead of firms like Virgin Trains East Coast \nBy contrast, the Conservative manifesto promises not to increase the level of VAT, without making any similar promise about income tax or National Insurance. \nThere is a pledge to increase the income tax personal allowance to £12,500, effectively cutting taxes for some people. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nBut the wording of the manifesto would allow a future Conservative Government to press ahead with increases on National Insurance for self-employed people, the measure proposed by Chancellor Philip Hammond in his March Budget. He was forced to drop the measure following protests that it broke a promise not to raise taxes in the 2015 Conservative manifesto. Prime Minister Theresa May speaks to party supporters as she campaigns in the North East of England during a visit to the Linskill Centre (Photo: Getty Images Europe) \nConservative manifesto key points Replace free school lunches with free breakfasts Increase funding in schools by £4bn by 2022 Create around 100 free schools a year Reduce net migration to below 100,000 Scrap a planned £72,000 cap on care costs, which had been due in 2020 Maintain pledge to cut corporation tax to 17% by 2020 Retain the 95% four-hour A&E target \nThe Liberal Democrats have said that they will raise the basic rate of income tax by 1p, to raise £6bn which would be spent on the NHS. \nHe also pledged to hold a second referendum on the EU deal. \nHe said: “Don’t let anyone tell you the only choice at this election is between Jeremy Corbyn and Theresa May. \n“The election is about your future... The more Lib Dem MPs you elect, the better deal we will get in Europe.” Tim Farron (Photo: PA) \nLib Dem manifesto key points Hold a second referendum on the Brexit deal Ban the sale of diesel cars and small vans in the UK by 2025 A pledge to clamp down on those who avoid paying tax Reinstate university maintenance grants for the poorest students 1p in the pound on income tax to raise £6bn for NHS and social care services Pump almost £7bn into the education system Build 300,000 homes a year by 2022, including half a million affordable and energy-efficient homes \nLabour attacked the Conservative failure to promise not to raise taxes. \nIan Lavery, Labour candidate for Wansbeck in Northumberland and the party’s election campaign co-ordinator, said: “The Tory manifesto offers nothing to the majority of working people in the North East. Wansbeck MP Ian Lavery (Photo: Daily Mirror) \n“Whilst the Tories will guarantee a tax cut for big corporations they won’t guarantee that ordinary working families won’t see their taxes go up. \n“No wonder they’ve dropped their previous promise to raising living standards and the phrase “living standards” doesn’t appear at all.” Read More The election policies are out - and here's what North East voters think of them \nTheresa May’s decision to launch her manifesto in Halifax, West Yorkshire, was a sign of her confidence that the Tories could make significant gains in the North and Midlands. \nIt is thought the Conservatives considered holding the launch in Teesside, following their surprise win in the Tees Valley mayor election, but struggled to find a suitable venue. \nMrs May has been criticised over planned changes to funding for social care, which mean people receiving care at home may be expected to pay for it from the value of their home, which would be sold after they die. \nLabour is calling this a “dementia tax”, on the grounds that people with dementia will have to pay for their care while people with other medical conditions do not. Conservative MP for Berwick Anne-Marie Trevelyan \nBut Conservatives say the change is necessary to make social care affordable with a growing elderly population. \nAnne Marie Trevelyan, Conservative MP for Berwick-upon-Tweed, said: “I am pleased my party has pledged to introduce a new cap on care costs, to ensure that, no matter how large the cost of care turns out to be, people will always retain at least £100,000 of their savings and assets, including value in the family home - the present amount is £23,000.” Read More ", "external_links": [], "published": "2017-05-21T12:00:00.000+03:00", "crawled": "2017-05-21T08:28:45.000+03:00", "highlightTitle": ""}