{"organizations": [], "uuid": "c0fafe48b452662c8a6a7e154faa1a2dd3cfb877", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13013812.ece/ALTERNATES/s1200/KOR_NJL_130417bede_01.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/barratt-developments-hails-record-results-13013582", "country": "IE", "domain_rank": 21960, "title": "Barratt Developments hails record results with best completions rate since credit crisis - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Barratt Developments hails record results with best completions rate since credit crisis - Chronicle Live", "spam_score": 0.193, "site_type": "news", "published": "2017-05-10T19:09:00.000+03:00", "replies_count": 0, "uuid": "c0fafe48b452662c8a6a7e154faa1a2dd3cfb877"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/barratt-developments-hails-record-results-13013582", "ord_in_thread": 0, "title": "Barratt Developments hails record results with best completions rate since credit crisis - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "george salmon", "sentiment": "none"}, {"name": "david thomas", "sentiment": "none"}, {"name": "isa", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "barratt developments", "sentiment": "positive"}, {"name": "hargreaves lansdown", "sentiment": "none"}, {"name": "invalid email  barratt developments", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bedewell court", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Barratt Developments hails record results with best completions rate since credit crisis Newcastle-founded company expects profits to come in at the top end of estimates as housing boom continues Share Barratt North East, Bedewell Court, Hebburn (Photo: NJL) Share Get business updates   Thank you for subscribing!   \nBarratt Developments has cheered Britain’s buoyant housing market after securing the highest number of completions since the financial crisis and record forward sales. \nThe Newcastle -founded firm said total completions were on course to reach 17,350 for the full year, the highest amount since 2008, while total forward sales rose by 13% to a record £3.2bn. \nThe UK’s biggest housebuilder said it expects annual pre-tax profits to come in at the top end of estimates, between £675m and £733m for the full year, as it rides high on a strong demand for new homes. \nChief executive David Thomas said it had been a strong period “both operationally and financially” for the company. \nHe said: “Market conditions remain good, with the group delivering a strong performance since the start of the calendar year. \n“Increased competition within the mortgage market has resulted in wide availability of attractive mortgage finance which, alongside Help to Buy, continues to support the very strong consumer demand. \n“This strong demand has helped drive volumes and we are on track to deliver circa 16,650 wholly owned completions for the full year. \n“This, alongside circa 700 joint venture completions would result in 17,350 total completions, the highest total in nine years.” \nShares in Barratt jumped nearly 4% on the London Stock Exchange following the announcement. \nThe firm rolled out 46 new developments over the period and plans to secure around 17,000 plots in the current financial year, compared to 24,387 in 2016. \nIt said the overall sales rate had ticked up to 0.8 from 0.78 in 2016, while net cash is expected to come in ahead of expectations at £600 million by June 30 this year on the back of “strong trading and the timing of land and working capital payments”. \nGeorge Salmon, equity analyst at Hargreaves Lansdown, said: “The good news keeps coming for Barratt shareholders in 2017. \n“February saw the group tack another year of special dividends onto its already generous plans, and now management has told analysts to raise their expectations for profits this year, as growth is ahead of schedule. \n“Conditions certainly look favourable for the builders at present. \n“On the whole, doubts over the disruption Brexit might cause are disappearing into the rear-view mirror, while low interest rates and numerous government schemes, including Help to Buy and the Lifetime Isa, continue to lend support. \n“Of course, conditions won’t stay so favourable forever, but a solid-looking balance sheet and continued improvements in operational efficiency should mean Barratt is well placed to make hay while the sun shines.” Like us on Facebook", "external_links": [], "published": "2017-05-10T19:09:00.000+03:00", "crawled": "2017-05-10T14:13:19.000+03:00", "highlightTitle": ""}