{"organizations": [], "uuid": "5825109e569a8ca9c6ad709942d535b3c4ae64be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30306920/15982530.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/200-jobs-up-for-grabs-at-leicestershire-m-s-warehouse-here-s-how-to-apply/story-30306920-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Marks & Spencer has 200 jobs to fill: Here's how to apply", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Marks & Spencer has 200 jobs to fill: Here's how to apply", "spam_score": 0.0, "site_type": "news", "published": "2017-05-02T18:09:00.000+03:00", "replies_count": 0, "uuid": "5825109e569a8ca9c6ad709942d535b3c4ae64be"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/200-jobs-up-for-grabs-at-leicestershire-m-s-warehouse-here-s-how-to-apply/story-30306920-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Marks & Spencer has 200 jobs to fill: Here's how to apply", "locations": [], "entities": {"persons": [{"name": "jackie thompson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "roger matthews", "sentiment": "none"}, {"name": "scott knowles", "sentiment": "none"}], "locations": [{"name": "north west leicestershire", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "marks & spencer", "sentiment": "negative"}, {"name": "tompegden", "sentiment": "negative"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "dhl", "sentiment": "none"}, {"name": "ups", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}, {"name": "east midlands chamber", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nA huge distribution centre in North West Leicestershire needs 200 people to join the team this summer. \nThe Marks and Spencer distribution hub, in Castle Donington, hopes to fill the new positions with the help of recruitment agency Blue Arrow. \nThe hub, which holds up to 16 million products across 900,000 sq ft of floor space, is one of Europe's biggest state-of-the-art distribution facilities. \nThe centre, which dispatches 2.2 million items a week, is key to the firm's e-commerce business. \nJackie Thompson, an employment partnership leader at Jobcentre Plus, said: \"Blue Arrow approached us to help fill the warehouse operative positions as M&S prepares for an uplift in summer sales. \n\"This latest account reflects the buoyant nature of the jobs market in logistics. We are also recruiting for DHL and UPS at East Midlands Airport.\" \nThe news comes as employment in the UK remains at a record high – despite one business group predicting the jobless total will rise for the rest of the year. \nLatest figures show the UK employment rate at 74.6 per cent, with 31.84 million people in work – an increase of 312,000 on the year and the joint highest rate since records began in 1971. \nThe Office for National Statistics (ONS) said the unemployment rate of 4.7 per cent has not been lower since 1975. \nOver the past year in Leicester city, there has been a 16.5 per cent fall in those claiming jobseeker's allowance and universal credit in the city. \nIn March there were 4,035 claimants, compared with 4,830 in March 2016. \nHowever, claimants were up from the 3,985 in February. \nIn the wider county of Leicestershire, the number of claimants rose month on month from 3,390 in February this year to 3,535, though claimants were down by 5.5 per across the past 12 months. \nRoger Matthews, senior operations leader at the city JobCentre Plus, said: \"The labour market is still very buoyant. \n\"We have 9,044 jobs posted in job centres in Leicester. \n\"We are finding it is taking up to four weeks to find a job through our centres.\" \nScott Knowles, chief executive at East Midlands Chamber, said: \"We make things in the East Midlands and we sell them around the world. The reduced value of sterling has led to something of a boom for many companies and that has helped to keep people in work where there had been predictions of job losses. \n\"The flipside of the reduction in value of sterling means there are inflationary pressures and employers will have to factor in those rising costs. \n\"Month-on-month claimant count figures are beginning to show a rising trend and we have to be realistic and expect that trend to continue for the rest of this year. \n\"What we would like to see is that any fall in employment in the East Midlands happens more slowly than the rest of the country. \n\"We urge the Government to do everything it can to encourage continued investment in jobs and infrastructure, sending a message to the world UK plc remains open for business despite Brexit.\" \nFor more information and to apply, call Blue Arrow on 0800 169 2945 . ", "external_links": [], "published": "2017-05-02T18:09:00.000+03:00", "crawled": "2017-05-02T15:41:29.000+03:00", "highlightTitle": ""}