{"organizations": [], "uuid": "5c92d2233edb3817ccee864bcd1b99a9d5f7b036", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30314830/15988594.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/ukip-lose-all-four-seats-on-devon-county-council/story-30314830-detail/story.html", "country": "GB", "title": "UKIP lose all four seats on Devon County Council", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "UKIP lose all four seats on Devon County Council", "spam_score": 0.0, "site_type": "news", "published": "2017-05-05T21:29:00.000+03:00", "replies_count": 0, "uuid": "5c92d2233edb3817ccee864bcd1b99a9d5f7b036"}, "author": "DanielClark", "url": "http://www.devonlive.com/ukip-lose-all-four-seats-on-devon-county-council/story-30314830-detail/story.html", "ord_in_thread": 0, "title": "UKIP lose all four seats on Devon County Council", "locations": [], "entities": {"persons": [{"name": "gaston dezart", "sentiment": "none"}, {"name": "tony inch", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "dave rollason", "sentiment": "none"}, {"name": "arron banks", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}, {"name": "ron peart", "sentiment": "none"}, {"name": "sam robinson", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "mr banks", "sentiment": "none"}, {"name": "robin julian", "sentiment": "none"}, {"name": "clacton", "sentiment": "none"}, {"name": "linda hellyer", "sentiment": "none"}, {"name": "john hone", "sentiment": "none"}, {"name": "tony dempster", "sentiment": "none"}, {"name": "julian", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}], "locations": [{"name": "devon county council ukip", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}, {"name": "bideford south", "sentiment": "none"}, {"name": "torridge", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "kingsteignton", "sentiment": "none"}, {"name": "hartland", "sentiment": "none"}, {"name": "devon ukip", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "bideford east", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "kingsteignton & teign estuary", "sentiment": "none"}, {"name": "ares ukip", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "bideford west", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UKIP lose all four seats on Devon County Council By DanielClark | Posted: May 05, 2017 1 COMMENTS SHARES UKIP have been wiped out in Devon UKIP lose all four seats on Devon County Council X \nCopy link to paste in your message / Comments (1) \nUKIP have been wiped out in Devon after losing all four seats on Devon County Council. \nComing into Thursday's Devon County Council elections, UKIP held four seats - Bideford South, Bideford East, Exmouth Brixington and Kingsteignton. \nBut UKIP lost all of their seats to the Conservatives \nFollow all the coverage here \nTony Dempster had held the Kingsteignton & Teign Estuary seat and did stand for re-election, but as an independent. \nBut he lost the seat, finished third behind Lib Dem candidate Dave Rollason and Ron Peart, the Conservative candidate, who took the seat. \nBideford East was held by Gaston Dezart, but he chose not to stand this time. The UKIP candidate, Sam Robinson, came fourth and was beaten by Linda Hellyer, the conservative candidate, who took the seat. \nBideford South was held by Robin Julian, but as a result of boundary changes, the seat became Bideford West and Hartland. \nBut the seat was taken by Tony Inch, the conservative candidate, with Mr Julian finishes as the runner up. \nExmouth Brixington was held by John Hone, but he did not stand this time. The two seats in Exmouth both went to Conservatives. \nFormer Ukip county councillor and candidate in this year's county council elections for Bideford East Sam Robinson believes the Conservative clean sweep in Torridge is down to the upcoming General Election, he said: \"The PM's strategy and tactics have greatly affected the course of this election. I wonder how it would all have played out if a General Election had not been called. \n\"It's been a question of going out there and showing Mrs May we in Ukip can deliver what we promise. Now we're leaving the EU I think people feel we have done what we set out to do, 'now shove off'. We'll take it on the chin. \n\"We had a 31% turnout that's one in three people who voted. In the past Ukip gained support from a large number of former Tories but now a lot of them have gone back, I think, to show Theresa May they are behind her in the upcoming EU exit negotiations.\" \nThe result came on the day that UKIP lost almost all of their seats nationwide. \nThe parties millionaire former backer Arron Banks said that Ukip is \"finished as an electoral force\" under its current leadership after a wipe-out in council elections overnight. \nMr Banks accused leader Paul Nuttall of \"crashing the car\" with his focus on Muslim issues over Brexit, and suggested that what the party now needed was \"a strategic bullet to the back of the head\". \nAfter a night in which Ukip saw huge segments of its support switch to the Tories as it lost all 30 of the council seats it was defending, Mr Nuttall insisted the party was \"the victim of its own success\" on Brexit. \nPraising the party's candidates, he said: \"It's been a difficult night. Frankly, there is nothing they could have done in the face of a big national swing to the Tories. \n\"Our electoral success over recent years was a key driver in forcing the Conservatives to embrace our cause under a new prime minister who was campaigning for a Remain vote in the referendum a year ago. \n\"Mrs May's public dispute with the EU in recent days - which led to her speaking about standing up to Brussels in an eve-of-poll statement in Downing Street - was particularly fortuitously timed for the Conservatives. \n\"If the price of Britain leaving the EU is a Tory advance after taking up this patriotic cause, then it is a price Ukip is prepared to pay. \n\"We are the victims of our own success and now we pick ourselves up and go on to further success in the future.\" \nBut Mr Banks said the leader had harmed Ukip's chances by launching his General Election campaign with a message on Muslim issues like a burka ban, instead of treating it as a second referendum on Brexit. \nThe millionaire, who funded the Leave.EU referendum campaign but ducked out of a proposed bid to become MP for Clacton, said pro-Brexit voters should now back \"the most viable candidate\" in the June 8 election. \n\"If we use the analogy of Ukip as a racing car, Nigel (Farage) was a skilled driver who drove the car around the track faster and faster, knowing when to take risks, delighting the audience,\" said Mr Banks. \n\"The current leadership has crashed the car, at the first bend of the race, into the crowd, killing the driver and spectators. \n\"As one of the Leave.EU team said to me: a strategic bullet to the back of the head.\" \nAnd he added: \"In this Brexit election, voters should use their power wisely and vote for the most viable candidate in the election. \n\"Ukip under the current leadership, without positive radical policies, is finished as an electoral force.\" ", "external_links": [], "published": "2017-05-05T21:29:00.000+03:00", "crawled": "2017-05-05T17:27:52.000+03:00", "highlightTitle": ""}