{"organizations": [], "uuid": "849d365370ecf0c235962fe98f9ff714f9b62e6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30323909/15994872.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/westbury-control-systems-taking-on-staff/story-30323909-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Westbury Control Systems taking on staff", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Westbury Control Systems taking on staff", "spam_score": 0.0, "site_type": "news", "published": "2017-05-10T17:37:00.000+03:00", "replies_count": 0, "uuid": "849d365370ecf0c235962fe98f9ff714f9b62e6d"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/westbury-control-systems-taking-on-staff/story-30323909-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Westbury Control Systems taking on staff", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "westb", "sentiment": "negative"}, {"name": "james robinson", "sentiment": "none"}, {"name": "craig hudson", "sentiment": "none"}, {"name": "glynn westbury", "sentiment": "none"}, {"name": "paul knott", "sentiment": "none"}], "locations": [{"name": "westbury", "sentiment": "none"}, {"name": "regent street", "sentiment": "none"}, {"name": "benin", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "narborough", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "coalville", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "westbury control systems", "sentiment": "negative"}, {"name": "control systems", "sentiment": "none"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "warwick university", "sentiment": "none"}, {"name": "edf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Westbury Control Systems taking on staff By TomPegden | Posted: May 10, 2017 0 COMMENTS SHARES Westbury Control Systems, in Narborough is taking on staff. Westbury Control Systems taking on staff X \nCopy link to paste in your message / Comments (0) \nA company that makes control panels for car production lines, ships and power stations is planning to recruit more staff. \nWestbury Control Systems hopes to take on a handful of apprentices and wirers as well as an engineer on the back of new orders and investment in its R&D and software development capabilities. \nThe business, which is based on a Narborough trading estate, builds the control units – often several metres high – for predominantly UK clients who send them around the world. \nEnd users include the likes of Drax power stations, power supplier EDF, RollsRoyce and Jaguar Land Rover, and is working on research with partners such as Warwick University. \nJobs being worked on at present include some of the engineering for a huge mobile quarrying machine, and controllers for a Jaguar Land Rover production line in the West Midlands. Westbury's turnover is £6.5 million and it has 43 staff. Its biggest panels, which contain thousands of electrical connections, can be up to 15ft tall. \nOperations director Paul Knott said business had recently picked up after the Brexit vote led some clients to initially hold back on investments. \nHe said: \"Our business is predominantly set up around repeat, original equipment manufacturing, which gives us stable shop floor hours. \n\"We are getting busier, bringing in new customers and moving into different markets. \n\"Moving forward our goal is to increase turnover and increase staff, and over the next five years we want to get to the £10 million mark. \n\"We are already seeing business picking up, with blue chip customers ranging from manufacturing and engineering for power stations, through to turbine engines for maritime vessels. \n\"We have the right people in place to do that, and the foundations to move on.\" \nHe said they were looking to take on four apprentices in the coming year and four panel wirers as well as an engineer. \nThe business – founded by managing director Glynn Westbury – moved from Coalville to a bigger site in Regent Street, Narborough, four years ago, and is now looking for expansion opportunities following the credit crunch. \nAs well as fabricating control panels, it has broadened its offering to provide technical expertise, software design and testing facilities. \nIts clients ship its products all around the world, including India, Benin, Turkey and the US. \nBrand and marketing manager James Robinson said the business was also trying to make a virtue of its \"Made in Britain\" credentials. \nHe said: \"We are quite progressive really, and want to build on that, and rather than saying Brexit is a negative, we are hoping that the British element of what we do adds value.\" \nEngineering manager Craig Hudson said while many competitors simply worked to customers' designs, they were able to adapt orders and improve them. \nHe said: \"A lot of people that come to see us are surprised at our breadth of knowledge. \n\"They might be using one supplier who builds panels and another who does the software – but we do both, as well as R&D.\" ", "external_links": [], "published": "2017-05-10T17:37:00.000+03:00", "crawled": "2017-05-10T16:25:44.000+03:00", "highlightTitle": ""}