{"organizations": [], "uuid": "51223b1ea327dd2a25a2ed49331411089fd4c9e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12994119.ece/ALTERNATES/s1200/election.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/collapse-ukip-could-lead-conservative-12993029", "country": "GB", "domain_rank": 21960, "title": "Why the collapse of UKIP could lead to a Conservative breakthrough in the North", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why the collapse of UKIP could lead to a Conservative breakthrough in the North", "spam_score": 0.0, "site_type": "news", "published": "2017-05-06T01:00:00.000+03:00", "replies_count": 0, "uuid": "51223b1ea327dd2a25a2ed49331411089fd4c9e1"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/collapse-ukip-could-lead-conservative-12993029", "ord_in_thread": 0, "title": "Why the collapse of UKIP could lead to a Conservative breakthrough in the North", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Why the collapse of UKIP could lead to a Conservative breakthrough in the North Political Editor Jonathan Walker looks at what the local election results tell us about the General Election Share Click to play Tap to play The video will start in 8 Cancel Play now Local elections: National 60-second round-up Share this video Get daily   Thank you for subscribing!   \nOne of the great unknowns of the June 8 General Election is whether or not UKIP’s vote is going to collapse, and where it will go if it does. \nThe local elections provide a clue. As far as local Government is concerned, at least, UKIP do indeed appear to a spent force. \nThey lost council seats council seats across the country, and made no significant gains anywhere. \nThe party was wiped out in Lincolnshire, losing 13 seats, while all nine UKIP councillors in Essex were defeated. \nAnd it seems that beneficiaries are the Conservatives . \nWhy UKIP have lost their appeal is an interesting question. \nThe obvious answer is that their goal was to take the UK out of the European Union , and now that Brexit is happening there is no further need for them. \nThis is the reason UKIP’s only MP, Douglas Carswell, gave for quitting the party in March. \nBut even if UKIP was obsessed with the EU, its voters may not have been. \nPerhaps some UKIP voters felt the other parties had lost touch with working class and hard-pressed middle class voters outside London. They might now have warmed to sensible Theresa May. \nAnd perhaps some UKIP voters were impressed by former leader Nigel Farage, who stood down in November. Nigel Farage (Photo: Yui Mok/PA Wire) \nWhatever the answer, the UKIP bandwagon has hit the rails, at least for now. \nAnd that suggests a lot of former UKIP voters may be looking for a new home. \nIt’s easy to forger that UKIP got a lot of votes in the 2015 General Election . \nThey were defending two seats, and only managed to hold on to one. And their charismatic leader, Mr Farage, failed to get elected. \nBut they received 3.8 million votes across the UK. \nThat’s more than the SNP and the Liberal Democrats put together. Of course it’s not a fair comparison on some ways, as the SNP only stand in Scotland, but the point is that a lot of people voted for UKIP. \nOf the UK’s 650 constituencies, UKIP came second in 120. That includes 75 seats won by the Tories and 44 won by Labour. \nIf - just supposing - those UKIP voters were to vote Conservative this time around, then Labour would be in serious trouble. \nTake Hartlepool , for example. Labour won this seat in 2015 with 14,076 votes, with UKIP second on 11,052 and the Tories third on 8,256. \nIf those UKIP voters were to vote Conservative (or to vote for Theresa May, as they might see it) then Labour would be toast. Read More \nAnd that would be an earthquake. Consider than in 2001, Labour candidate Peter Mandelson held the seat with 22,506 votes, almost three times the number of votes won by the Tories, who came second with 7.935. Norma Redfearn celebrates being re-elected as Mayor of North Tyneside (Photo: Newcastle Chronicle) \nThen there are seats where UKIP came a creditable third. For example, Labour held Bishop Auckland in County Durham in 2015 with 16,307 votes, with the Tories not too far behind on 12,799 votes. \nMeanwhile, UKIP came third, with 7,015 votes. Read More \nIf those UKIP voters were to vote Conservative this time around then the Tories would win. That’s without even considering what Jeremy Corbyn’s apparent unpopularity would do to the Labour vote. \nOverall, the local election results were bad for Labour in the North East. \nConservatives have gained enough seats to become the largest party in Northumberland. Only just missing out on a majority, the Tories won 33 seats across the county while Labour won 24, the Liberal Democrats won three seats and seven independents were elected. \nThe vote for a Tees Valley mayor was a shock win for the Tories - suggesting that they can indeed win in the North. \nThere was a ray of sunshine for Jeremy Corbyn’s party as Labour mayor Norma Redfearn was re-elected in North Tyneside. \nBut it’s plain to see why Conservatives believe they could make real breakthroughs in the North East on June 8, and finally put to bed the idea that the Tory brand is toxic anywhere north of Birmingham. Like us on Facebook", "external_links": [], "published": "2017-05-06T01:00:00.000+03:00", "crawled": "2017-05-05T20:19:36.000+03:00", "highlightTitle": ""}