{"organizations": [], "uuid": "514035b39fadcf667628423ef674d794fa64311b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13051057.ece/ALTERNATES/s1200/JS119759328.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/election-policies-out-heres-what-13050265", "country": "GB", "domain_rank": 21960, "title": "The election policies are out - and here's what North East voters think of them", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "514035b39fadcf667628423ef674d794fa64311b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/election-policies-out-heres-what-13050265", "ord_in_thread": 0, "title": "The election policies are out - and here's what North East voters think of them", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "kezia dugdale", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "len mccluskey", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "getty images europe", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "bbc radio scotland", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "scottish labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   \nNorth East voters back key parts of Labour’s general election manifesto, an exclusive survey has revealed. \nIncreasing school spending, stopping hospital closures and pushing up the minimum wage to £10 an hour are all popular policies. \nVoters also backed a number of Conservative policies - but Labour’s plans were the most popular. \nA new survey found 42.9% of respondents in the North East agreed with Labour ’s plans to boost school budgets by £6bn a year. General Electtion 2017 survey results on May 17 \nThe same proportion backed Jeremy Corbyn’s plans for a freeze on the NHS “Sustainability and Transformation Plans”, which are designed to save £20 billion a year and could mean hospitals close or merge. \nAnd a further 42.4% agreed with Labour’s planned £10 an hour compulsory living wage, effectively an increase in the minimum wage. \nBut the survey also found that voters weren’t impressed by Labour’s plan to protect the pensions “triple lock”, which guarantees a significant increase in pensions even when inflation is low. \nJust 28.9% backed this policy. \nOur survey found the most popular Conservative election promise among North East voters was recruiting 10,000 more mental health staff. Leader of the Labour Party Jeremy Corbyn (Photo: Getty Images Europe) \nThat was supported by 42.2% of people across the region. \nCaps on energy prices were backed by 34.3% in the North East, and Tory plans to cut immigration were backed by 31.7%. \nPerhaps surprisingly, just 16.6% said they backed Tory plans to leave the EU single market - even though the region voted heavily for Brexit. \nThe most popular Liberal Democrat promise was to put more money into education, while for the Green party it was scrapping tuition fees. \nThe study, run in partnership with Google Surveys, was completed online by more than 8,000 people across the regions of England. \nIt follows opinion polls which found widespread support for Labour policies such as re-nationalising the railways and creating local energy firms. Prime Minister Theresa May (Photo: Getty Images Europe) \nBut a ComRes survey for the Daily Mirror found while many voters like Labour’s plans, 56% said Labour leader Jeremy Corbyn would be a disaster as Prime Minister. \nLabour manifesto plans included taking the water and energy industries into public control - and the party said this will cut household bills by £220 a year. \nThe party said it could cut annual water bills by £100 and energy bills by £120, stopping dividends to shareholders and cutting the cost of interest payments on the companies’ debts because the government would be able to borrow more cheaply. \nLabour said the water companies had paid dividends averaging £1.8 billion over the past 10 years while interest payments would be reduced by £500 million a year under public ownership - an annual average saving of £2.3 billion. Liberal Democrats leader Tim Farron (Photo: PA) \nLabour leader Jeremy Corbyn said: “Labour will rebalance our economy so that the many are no longer ripped off by the wealthy and powerful few. \n“Our plans for public ownership and greater transparency will slash bills and drive investment in efficiency and renewables.” \nBut the party was hit by a new row after union boss Len McCluskey said he cannot see Labour winning the General Election. \nThe Unite leader suggested winning 200 seats - nearly 30 fewer than in 2015 - would be a “successful” result for UK leader Jeremy Corbyn. \nScottish Labour leader Kezia Dugdale rejected the claim - saying she defined success as “winning the election”. \nShe told BBC Radio Scotland: “I hope he is wrong, I want to see a Labour government across the whole of the United Kingdom, that’s what I’m spending every waking moment of my day campaigning for.” \nShe added: “I think he’s wrong, I hope he’s wrong.” Like us on Facebook", "external_links": [], "published": "2017-05-18T03:00:00.000+03:00", "crawled": "2017-05-17T22:34:55.000+03:00", "highlightTitle": ""}