{"organizations": [], "uuid": "910be0099e4a043be74d83fada65fb6357a6e0eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30337860/16005201.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/devon-expert-on-immigration-as-an-election-issue/story-30337860-detail/story.html", "country": "US", "title": "Devon expert on immigration as an election issue | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.161, "site_type": "news", "published": "2017-05-17T19:35:00.000+03:00", "replies_count": 0, "uuid": "910be0099e4a043be74d83fada65fb6357a6e0eb"}, "author": "Western Morning News", "url": "http://www.devonlive.com/devon-expert-on-immigration-as-an-election-issue/story-30337860-detail/story.html", "ord_in_thread": 0, "title": "Devon expert on immigration as an election issue | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "patrick nicholls", "sentiment": "none"}, {"name": "simon peplow", "sentiment": "none"}, {"name": "adrian rogers", "sentiment": "none"}, {"name": "rogers", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "whipton barton", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "gavin grant", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john mills", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "calais jungle", "sentiment": "none"}, {"name": "south west devon", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "great torrington", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "labour leave", "sentiment": "none"}, {"name": "beam house", "sentiment": "none"}, {"name": "rogers", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "gqrr", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "comres/ sunday mirror", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Western Morning News | Posted: May 17, 2017 0 COMMENTS SHARES Polling suggests immigration is an important issue for voters in the South West Devon expert on immigration as an election issue X \nCopy link to paste in your message / Comments (0) \nDuring this general election, as with the 2016 EU referendum that set off the chain of events leading to it, immigration is likely to play a key role. Research by the British Election Study into what mattered most to referendum voters demonstrated that leavers were primarily concerned about sovereignty and immigration. \nA recent ComRes/ Sunday Mirror poll suggested that immigration was fourth in the list of issues most important to voters in the South West – behind the NHS, Brexit, and the economy; the Brexit option likely incorporates many such concerns. \nGQRR polling suggests that 58% of voters agree it is \"essential\" for a new immigration system to reduce the number of migrants coming to Britain, with this number rising to 76% for Conservative voters. Despite this, the Conservative position on immigration has appeared to soften as the economic realities of Brexit have become clearer, with Theresa May hinting at allowing temporary free movement after Brexit to allow businesses to adjust, and Brexit Secretary David Davis indicating that immigration levels will rise if the economy requires. \nJeremy Corbyn previously suggested Labour would not limit EU migration, while figures such as Labour Leave chairman John Mills argued they were heading for an election \"bloodbath\" unless they altered their immigration policies. Shadow Brexit secretary Sir Keir Starmer recently said Labour would seek to end free movement, but not \"sever ties\" with the EU. Due to the parties' current polling figures, even Ben Bradshaw's healthy majority of 7,183 in Exeter appears under threat. \nHowever, it was suggested before the EU referendum that, due to lower levels, immigration was less of an issue here than in other UK regions, with greater local concerns directed towards EU regulation on business and wind farms. Despite perceptions otherwise, the South West had the second-lowest Leave majority within English regions (excluding London). \nThe Liberal Democrats hope for a political revival in the South West as the anti-Brexit party: in the words of Gavin Grant, chair of Western Counties Liberal Democrats, by appealing to \"enough angry remain voters to take back parliamentary seats\". Lib Dem support in the South West – previously the party's heartland – collapsed in 2015 and they failed to retain a single seat. This appears unlikely to reverse significantly under the first-past-the-post system, and recent polls suggest that just 7% of respondents in the region are planning to vote Lib Dem, compared with 47% Conservative. Previous UKIP voters are likely to be enticed by Conservative candidates, particularly after Paul Nuttall's suggestion not to field candidates against a pro-Brexit incumbent. \nAlthough immigration might not be the declared foremost issue for its voters, the South West has experienced issues around immigration – a recent example being the temporary relocation of refugees to Great Torrington. When the first child refugees arrived, via the Calais Jungle, at Beam House in October 2016, press coverage portrayed a mixed response. The Sun and Daily Mail led with the \"fury\" of this \"quiet, picturesque village\", whereas The Independent satirically highlighted how locals had \"unleashed [their] anger… by donating £600 worth of jumpers\". While some local opposition was recorded, this appeared to have been outweighed by a positive community response including donations of clothes, toys, and books. \nImmigration has also played a role during general elections in the region. For example, the campaign of Dr Adrian Rogers, Exeter's Conservative candidate in 1997, has gone into the history books for its homophobic tone; but Rogers' strong opposition to immigration and the EU is less remembered. Rogers, who described himself as the \"conscience of the Conservative Party\", called for an end to \"all further primary immigration [as] I do not believe in a multicultural society of ethnic minorities\", further pronouncing that \"we should make people integrate by coercion\". \nRogers had previously supported Eurosceptic Teignbridge MP Patrick Nicholls, who was forced to resign as Conservative vice-chair after receiving criticism for branding Germans \"warmongers\" and French \"collaborators\" in a 1994 Western Morning News article. After his election defeat, Rogers was later expelled from the Conservatives after urging supporters to vote UKIP in European elections, and ran unsuccessfully for UKIP in the 2014 local elections for Exeter's Whipton Barton. \nExeter is one of the few exceptions in a South West turned blue during the last general election. \nIt remains to be seen how that might differ after this election, but one thing is certain: although polls suggest that immigration isn't identified as the main issue for South West voters, its significance and relationship to the Brexit process means debates regarding immigration will be at the heart of politics for some time to come. \nDr Simon Peplow is a history lecturer at the University of Exeter. \nREAD NEXT ", "external_links": [], "published": "2017-05-17T19:35:00.000+03:00", "crawled": "2017-05-17T16:12:37.000+03:00", "highlightTitle": ""}