{"organizations": [], "uuid": "098e0e680fb1d98710e019d5393ec3ca8fdb67dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12974945.ece/ALTERNATES/s1200/NW_tm200504teesd-8.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farmers-life-not-easy-after-12974858", "country": "GB", "domain_rank": 21960, "title": "Farmers' life will 'not be easy' after Brexit, House of Lords committee says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Farmers' life will 'not be easy' after Brexit, House of Lords committee says", "spam_score": 0.0, "site_type": "news", "published": "2017-05-03T07:01:00.000+03:00", "replies_count": 0, "uuid": "098e0e680fb1d98710e019d5393ec3ca8fdb67dd"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farmers-life-not-easy-after-12974858", "ord_in_thread": 0, "title": "Farmers' life will 'not be easy' after Brexit, House of Lords committee says", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "curry", "sentiment": "none"}, {"name": "lord teverson", "sentiment": "none"}, {"name": "cunningham", "sentiment": "none"}], "locations": [{"name": "teesdale", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "kirkharle", "sentiment": "none"}, {"name": "middleton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "business farmers", "sentiment": "negative"}, {"name": "house of lords committee", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "mirrorpix", "sentiment": "none"}, {"name": "invalid email  life", "sentiment": "none"}, {"name": "house of lords eu energy and environment sub-committee", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Farmers' life will 'not be easy' after Brexit, House of Lords committee says Warning that loss of EU funding, possible tariffs on exports and difficulty of attracting seasonal labour could all impact UK farming Share Sheep graze on the slopes above Middleton in Teesdale (Photo: Mirrorpix) Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nLife after Brexit will “not be easy” for farmers, a new report will today warn. \nThe House of Lords EU Energy and Environment Sub-Committee has issued its Brexit : agriculture report in which it warns that the UK’s agriculture sector will face big challenges as a result of Brexit , not least the loss of funding from the Common Agricultural Policy (CAP). \nThe repatriating of agricultural policy to the UK will also need to consider a number of other issues, the report adds, including the country’s ability to trade food products in Europe and access to labour from abroad. \nGiven the long-term nature of the farming industry, the committee has called for a transitional period is needed to allow farmers to avoid a “cliff-edge” on trade if a deal on exports cannot be agreed in the next two years. \nThe committee - which has two North East members, Lord Curry of Kirkharle and Lord Cunningham of Felling - says Brexit offers opportunities for the UK to forge agricultural policy that is better suited to the UK sector. \nBut it warns that such an approach must not lead to tariffs on UK exports. \nSub-committee chairman Lord Teverson said: “Post-Brexit the UK’s agriculture and food sectors face enormous challenges. Life after the EU’s Common Agricultural Policy will not be easy for the many UK farmers who rely on its financial support. \n“But leaving the EU is also an opportunity for the UK, and its constituent nations and regions, to move away from the EU’s ‘one-size-fits-all’ policies on farming and food. We will be able to really think about what we want to do with agriculture, food and the environment. \n“Trade – especially with the EU – is really important for the agri-food sector. It is unlikely that a comprehensive trade deal with the EU will be negotiated before Brexit, so a transitional deal is vital to avoiding a ‘cliff edge’ for farmers. \n“The Government and the devolved administrations will also need to be careful that tailored agricultural policies don’t create non-tariff barriers for UK exports.” Read More Farming groups welcome Co-op pledge to buy all fresh meat from UK \nThe sub-committee says that many farmers in the UK rely on CAP funding to sustain their businesses, while wider rural communities also benefit from EU development programmes. Farmers will need time and clarity from Government to allow them to adapt to any changes in the funding and regulatory systems after Brexit, the report says. \nThe report also highlights the possibility of farmers facing “high tariffs and significant non-tariff barriers when exporting”, as well as cheaper imports, which the sub-committee says will post a challenge to the farming industry. \nA warning has also been issued that some farmers will face “severe difficulties” if restrictions on immigration mean they no longer have access to seasonal labour from the EU. Read More Shortage of agricultural workers could become 'crisis' after Brexit, MPs warn \nThe sub-committee investigated the implications of Brexit for UK agriculture and food, particularly the impact of leaving the EU’s Common Agricultural Policy. \nIt took evidence from key industry representatives, academics and the Government to identify priorities for a post-Brexit relationship with the EU. Like us on Facebook", "external_links": [], "published": "2017-05-03T07:01:00.000+03:00", "crawled": "2017-05-03T02:41:36.000+03:00", "highlightTitle": ""}