{"organizations": [], "uuid": "70a7a45826f458d28dc666157754cba3414b9135", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30354025/16017494.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/general-election-totnes-constituency-hustings-at-dartington-hall/story-30354025-detail/story.html", "country": "US", "title": "General Election: Totnes constituency hustings at Dartington Hall | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.213, "site_type": "news", "published": "2017-05-25T20:36:00.000+03:00", "replies_count": 0, "uuid": "70a7a45826f458d28dc666157754cba3414b9135"}, "author": "Caroline Abbott", "url": "http://www.devonlive.com/general-election-totnes-constituency-hustings-at-dartington-hall/story-30354025-detail/story.html", "ord_in_thread": 0, "title": "General Election: Totnes constituency hustings at Dartington Hall | Devon Live", "locations": [], "entities": {"persons": [{"name": "julian brazil", "sentiment": "none"}, {"name": "jacqi hodgson", "sentiment": "none"}, {"name": "steven harvey", "sentiment": "none"}, {"name": "gerrie messer", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "rhodri samuel", "sentiment": "none"}, {"name": "devonlive", "sentiment": "none"}], "locations": [{"name": "totnes", "sentiment": "none"}, {"name": "dartington hall", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "salcombe", "sentiment": "none"}, {"name": "brixham", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "south hams", "sentiment": "none"}, {"name": "dartington hall's great hall", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "kingsbridge", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "newton abbot", "sentiment": "none"}, {"name": "dartmouth", "sentiment": "none"}, {"name": "south hams", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "dartington hall trust", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nA General Election hustings event in the style of Question Time is being held this evening to give voters and a wide range of different interest groups in the Totnes constituency the chance to hear from and question those seeking to represent them in Parliament. \nAll 250 tickets for the event at Dartington Hall's Great Hall have been snapped up but DevonLive will be live streaming the action from our Facebook page for the benefit of people who can't attend. \nJulian Brazil (Liberal Democrat), Jacqi Hodgson (Green), Gerrie Messer (Labour) and Sarah Wollaston (Conservative) have all confirmed their attendance. UKIP parliamentary candidate Steven Harvey has been invited but it not expected at the event, which starts at 7.30pm. \nThe snap General Election on June 8 has been billed as the most important for a generation, and Dartington Hall Trust said it is 'keen to provide an opportunity for a wide and diverse range of constituency interests, from community groups to farmers, from business to cultural networks, and for residents of all ages to hear from and question prospective parliamentary candidates'. \nRead next: Manchester bomb: Newton Abbot hustings tonight called off after 'appalling' attack \nDartington Hall Trust chief executive Rhodri Samuel said: \"We are holding this event because we think in such extraordinary times it is vital that our would-be MPs hear from and are questioned by a wide range of people and interests – not just the usual suspects. The 'politics as usual' rules don't apply in this election. After the Brexit vote divided the South Hams, none of the parties can necessarily rely on their traditional voter base. The Totnes constituency and the wider South West region have big questions to address: from how we educate our children, provide better health and social care, create more jobs and a sustainable economy and protect our unique rural environment. We would really encourage those who live, work or play in our constituency to hear direct from the candidates seeking to represent them.\" \nThe Totnes constituency covers the Eastern part of the South Hams district, including the towns of Totnes, Dartmouth, Kingsbridge and Salcombe, as well as parts of Torbay including the town of Brixham. In the EU referendum, the South Hams bucked the South West trend, with 52.85 per cent voting to remain compared to 47.15 per cent voting to leave. \nRead next: DevonLive suspends Exeter hustings event after Manchester bombing \nDr Sarah Wollaston (Con) has held the seat since 2010. In the 2015 election she won a 53 per cent share of the total vote, with 24,941 votes. UKIP came second with 14 per cent of the total vote – 6,656 votes. Labour (5,988 votes), the Green Party (4,845 votes) and then Lib Dem candidate Julian Brazil (4,667 votes) followed. \nThe expected audience of 250 this evening will include members of the general public and representatives of various interest groups and their organisations. Audience members have been invited to submit advance questions to be put to all candidates to answer and debate. Tickets for the event were free of charge and available on a first come, first served basis.", "external_links": [], "published": "2017-05-25T20:36:00.000+03:00", "crawled": "2017-05-25T15:40:35.000+03:00", "highlightTitle": ""}