{"organizations": [], "uuid": "807dfa9cd3f4af9f6b6cd7a8f21cd076ae591f0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30321281/15992965.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/company-car-man-people-are-voting-against-the-norm-in-the-hope-they-will-see-a-change/story-30321281-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Company car man: Jereny Corbyn's proposal for more bank holidays is 'an easy vote catcher' | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Company car man: Jereny Corbyn's proposal for more bank holidays is 'an easy vote catcher' | Leicester Mercury", "spam_score": 0.002, "site_type": "news", "published": "2017-05-09T18:58:00.000+03:00", "replies_count": 0, "uuid": "807dfa9cd3f4af9f6b6cd7a8f21cd076ae591f0d"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/company-car-man-people-are-voting-against-the-norm-in-the-hope-they-will-see-a-change/story-30321281-detail/story.html", "ord_in_thread": 0, "title": "Company car man: Jereny Corbyn's proposal for more bank holidays is 'an easy vote catcher' | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "emmanuel macron", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "putin", "sentiment": "negative"}, {"name": "le pen", "sentiment": "negative"}, {"name": "jereny corbyn", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "hinckley", "sentiment": "none"}], "locations": [{"name": "farage", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "marten inn", "sentiment": "none"}], "organizations": [{"name": "leicester mercury comments", "sentiment": "negative"}, {"name": "q chutney ivy", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "paddy", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nQ Marine Le Pen, Emmanuel Macron, Trump, Putin, Farage, Brexit, snap elections… What on earth has happened to politics? \nA Politics has now become a case of who do we dislike the least. People are voting against the norm because they are fed up with policies not being delivered. I guess there's a hope that with voting against the grain, you end up seeing some change. \nQ Autonomous cars being developed near Hinckley will soon be tested on the roads. What are your concerns? \nA Autonomous cars could become very useful. The difficulty will come in being able to integrate these with manually controlled vehicles. If there is a crash, who is in the wrong? The driver or the car? The idea of a car that can switch from manual to automatic would be good. People would be able to go out for a few drinks, drive there and then get driven back by their car! \nQ Would you ever stand for Parliament? What policies would you promote? \nA I'd like to have a go standing for Parliament, but I don't think I would get very far. My policies would be: \n1) Alter benefits. Getting a job at a lower income isn't very appealing to individuals who would rather claim benefits. I would like to increase incentives and rewards for the people who have worked hard to be on a good wage and support a family. There is definitely a place for benefits for those that need them most. \n2) More practical life lessons in schools. Children are able to draw the perfect triangle or explain different rock formations but they can't look after their finances, fill out a mortgage application or build flatpack furniture. There should be more practical skills taught. \n3) Health and fitness is promoted so much nowadays, yet to join a gym or buy healthy food costs way too much. There should be a Government scheme to help companies selling healthy products or services, so it can then be passed on to the consumer. \n4) Encourage companies to take a chance on individuals without experience. There's always the issue that companies want experience – sometimes even for entry level positions. How can you expect somebody to have solid experience for a junior position? \n5) A lot more needs to be done to make housing affordable for first time buyers. There are new housing estates all around Leicestershire, yet the cheapest houses are way over £200,000. More needs to be done to encourage large property developers to build actual 'af fordable housing'. \nQ Chutney Ivy has just won the 2017 Leicester Curry Awards. What is the best meal out you have ever had in Leicester/Leicestershire? \nA The best meal I have probably ever had in Leicester is a curry at Paddy 's Marten Inn. From the outside it looks like an old working class pub, but the food served is incredible. \nQ What do you make of Jeremy Corbyn's plans for four new bank holidays? \nA I think it is definitely an easy vote catcher and would encourage a lot of people who don't have too much interest in politics to vote Labour. All the bank holidays he has declared would be around April and May, we could do with a few in the summer –maybe for certain sporting events.", "external_links": [], "published": "2017-05-09T18:58:00.000+03:00", "crawled": "2017-05-09T13:30:35.000+03:00", "highlightTitle": ""}