{"organizations": [], "uuid": "3458f24ff40da85b1b973e145eb801902c51bdcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13118950.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-lays-conservatives-nhs-13118852", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn lays into Conservatives' NHS and schools plans as he diverts talk away from Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-31T23:00:00.000+03:00", "replies_count": 0, "uuid": "3458f24ff40da85b1b973e145eb801902c51bdcb"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-lays-conservatives-nhs-13118852", "ord_in_thread": 0, "title": "Jeremy Corbyn lays into Conservatives' NHS and schools plans as he diverts talk away from Brexit", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "andy commins", "sentiment": "none"}, {"name": "damian green", "sentiment": "none"}], "locations": [{"name": "brexi", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "brexit news", "sentiment": "negative"}, {"name": "nhs", "sentiment": "negative"}, {"name": "general election", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "department for education", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Jeremy Corbyn lays into Conservatives' NHS and schools plans as he diverts talk away from Brexit The Labour leader attempted to shift the focus on to schools and hospitals and away from Brexit as part of his campaigning Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nJeremy Corbyn claimed the future of the NHS and schools was on the line in the General Election as he attempted to steer the campaign away from Brexit. \nIt comes after Theresa May used the resumption of campaigning to stress her core messages of leadership and exiting the EU, saying Mr Corbyn was not prepared for crunch talks with Brussels that will start within days of the General Election and would find himself “alone and naked” in the negotiations. \nLabour’s analysis claims that under Tory plans, 5.5 million people will find themselves on NHS waiting lists in England by 2022, the scheduled end of the next parliament, a 1.8 million increase from now. Labour leader Jeremy Corbyn (Photo: PA) \nSeeking to exploit perceived Tory weakness on social care, Mr Corbyn also said 1.5 million older and vulnerable people will not have their social care needs met. \nMeanwhile 650,000 school children will be “crammed” into primary school classes larger than 30 pupils, and families will be almost £450 worse off per child as a result of Tory plans to scrap free school meals for 1.7 million children. \nThe Department for Education’s own figures show that this includes more than 19,000 pupils in the North East, with 900 primary pupils taught in classes of 40 or more. Children walking to school (Photo: PA) \nLabour say the number of “super-size” classes shows the Conservatives failed to keep a promise in their 2010 election manifesto, when they pledged “smaller schools with smaller class sizes with teachers who know the children’s names”. Read More NHS is spending more than £1bn a year on drugs to fight obesity \nMr Corbyn said: “The futures of our NHS and schools are at stake in this election. \n“Over the last seven years the Tories have starved the public services we rely on of resources, running them down and pushing them into disrepair. \n“Patients are suffering ever longer waits and overcrowded wards, those who need care have been left without it. Children are crammed into overcrowded and crumbling classrooms. It has to change.” An ambulance leaves the Royal Victoria Infirmary hospital (RVI) in Newcastle (Photo: Andy Commins) \nWork and Pensions Secretary, Damian Green, said: “ Brexit negotiations start 11 days after people vote and are crucial to our economic security and the future of public services. \n“Made-up numbers from Corbyn cannot hide the fact he’s not up to the job of getting the deal we need. \n“Theresa May has the plan to get the right Brexit deal, keep our economy strong, and invest billions more in public services. But a loss of just six seats and Theresa May’s Government will lose its majority. \n“If you don’t want Jeremy Corbyn to be Prime Minister of this country, if you don’t believe he is equipped to negotiate Brexit, keep our economy strong or our nation secure, there’s no safe way to vote Labour - wherever you live.” Read More", "external_links": [], "published": "2017-05-31T23:00:00.000+03:00", "crawled": "2017-05-31T18:48:15.000+03:00", "highlightTitle": ""}