{"organizations": [], "uuid": "28e7fad7e1e4d8c81b754cc61ff9e2ad94bd71d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30315419/15989264.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/owner-of-crediton-milkshake-bar-left-heartbroken-following-shop-closure/story-30315419-detail/story.html", "country": "GB", "title": "Owner of Crediton milkshake bar left 'heartbroken' after shop...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Owner of Crediton milkshake bar left 'heartbroken' after shop...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-06T02:36:00.000+03:00", "replies_count": 0, "uuid": "28e7fad7e1e4d8c81b754cc61ff9e2ad94bd71d7"}, "author": "AbbieBray", "url": "http://www.devonlive.com/owner-of-crediton-milkshake-bar-left-heartbroken-following-shop-closure/story-30315419-detail/story.html", "ord_in_thread": 0, "title": "Owner of Crediton milkshake bar left 'heartbroken' after shop...", "locations": [], "entities": {"persons": [{"name": "owner of crediton", "sentiment": "none"}, {"name": "nicole", "sentiment": "none"}, {"name": "courtney arscott", "sentiment": "none"}, {"name": "maria knight", "sentiment": "none"}, {"name": "crediton", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "nicole flanagan", "sentiment": "none"}, {"name": "melanie coleman", "sentiment": "none"}], "locations": [{"name": "crediton", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "crediton high street", "sentiment": "none"}], "organizations": [{"name": "vagabond milkshake bar", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Owner of Crediton milkshake bar left 'heartbroken' after shop closure announcement By AbbieBray | Posted: May 05, 2017 1 COMMENTS SHARES \"It has taken a lot of soul searching and I would rather walk away now while the memories are good.\" Owner of Crediton milkshake bar left 'heartbroken' after shop closure announceme... X \nCopy link to paste in your message / \"It has taken a lot of soul searching and I would rather walk away now while the memories are good.\" Comments (1) \nThe owner of Crediton's popular milkshake bar has been left 'heartbroken' following the announcement to close the shop. \nVagabond Milkshake Bar is set to disappear from Crediton High Street next week after five years of trading. \nShop owner Nicole Flanagan, 28, announced the final closure on Facebook and said the doors will close for the last time on Friday, May 12. \nThe Facebook post read: \"To my darling milkshake lovelies, it is with the heaviest of hearts that I am announcing the closure of the shop. The last year has been beyond tough and with ever increasing prices I can no longer absorb the additional costs myself, these costs that I cannot pass onto you the customer. \n\"It has taken a lot of soul searching and I would rather walk away now while the memories are good and the loveliest they will ever be. I cannot thank you enough for your support and custom over the last five years, I have had an absolute blast serving you all and without you I would not have won awards and more importantly I wouldn't have grown as a person.\" \nRead more: Devon grandma defied odds to stay alive for birth of grand child \nNicole said she moved to Devon to study at university, but a few years after dropping out she opened Vagabonds. \n\"I have put blood, sweat and tears into the business and I would much rather go out on a high. I moved to Devon for university originally and after I dropped out I opened Vagabonds,\" she said. \n\"I want to stress to people that I have has so much fun running the shop and that I'll miss each and every single customer. I am going to try something new for the time being and she what the future holds. \n\"I can't blame Brexit entirely for closing the shop, however since Article 50 was triggered, prices have only increased and I can't compete with that. So as devastated as I am right now I feel like now is the best time for me to walk away.\" \nSince the post when on the shop's Facebook page, many Crediton residents have voiced their shock and sadness regarding the closure. \nMelanie Coleman said: \"This is devastating news for Crediton and beyond. You have done the most amazing job and we have all thoroughly enjoyed supporting you and your fantastic business and wicked ideas.\" \nCourtney Arscott added: \"This town won't be the same without your lovely business. You have certainly left your mark so you should be incredibly proud of the hard work you've put in. Can't believe it's been five years.\"Best of luck with your future I am 100 per cent sure you'll find something exciting and challenging, if you haven't already. Take care of yourself.\" \nMaria Knight said: \"I am really sorry to hear this, I've always loved and admired your business and your approach and commitment to you shop. It's such a shame you've had to make such a hard decision to close. You will be missed by many.\" ", "external_links": [], "published": "2017-05-06T02:36:00.000+03:00", "crawled": "2017-05-06T00:29:48.000+03:00", "highlightTitle": ""}