{"organizations": [], "uuid": "fd5474f28f0587749cad1cbaa90a3311ae43d6e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12994568.ece/ALTERNATES/s1200/Hinkley-Point-Nuclear-Power-Station-plans.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/business-secretary-greg-clark-refuses-12993749", "country": "GB", "domain_rank": 21960, "title": "Business Secretary Greg Clark refuses to meet Blue Riband MP to discuss job cuts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Secretary Greg Clark refuses to meet Blue Riband MP to discuss job cuts", "spam_score": 0.0, "site_type": "news", "published": "2017-05-06T12:00:00.000+03:00", "replies_count": 0, "uuid": "fd5474f28f0587749cad1cbaa90a3311ae43d6e7"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/business-secretary-greg-clark-refuses-12993749", "ord_in_thread": 0, "title": "Business Secretary Greg Clark refuses to meet Blue Riband MP to discuss job cuts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Secretary Greg Clark refuses to meet Blue Riband MP to discuss job cuts Mr Clark ignores a request from Newcastle North MP Catherine McKinnell to discuss Nestle cuts Share Greg Clark Secretary of State for Business, Energy and Industrial Strategy (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusiness Secretary Greg Clark has refused to meet a Newcastle MP and workers representatives to discuss saving jobs at the city’s Nestle factory. \nNewcastle North MP Catherine McKinnell wrote to Mr Clark asking for talks after the announcement that 110 job losses are expected at the Nestle factory in Fawdon, after the company put forward plans to switch production of the Blue Riband biscuit to one of its plants in Poland. \nRepresentatives of union the GMB would also have attended. \nBut Mr Clark has now replied, with a letter suggesting there is nothing the Government can do to save jobs. \nInstead, he said that there would be no compulsory redundancies and Job Centre Plus staff would help former Nestle workers find new employment. \nMr Clark said in the letter: “I have spoken to Nestle’s CEO, Dame Fiona Kendrick, about the planned restructuring and job losses. Dame Fiona has confirmed that Nestle does not expect to make any compulsory redundancies. \n“However, we will continue to work closely with Nestle to make sure that any employees affected have prompt access to Job Centre Plus support and are able to find alternative employment.” \nHe also said that the job cuts were nothing to do with Brexit, telling Mrs McKinnell: “I have been reassured that Nestle’s decision has been driven by the need to ensure their factories reman globally competitive and that this restructuring would have been necessary irrespective of the UK’s decision to leave the European Union.” \nBut Mr Clark did not respond to the request for a meeting - which in practice means the request was declined. Catherine McKinnell (Photo: Newcastle Chronicle) \nMs McKinnell said : “We need a Government that is willing to intervene, and prepared to fight to save good manufacturing jobs here in Newcastle and elsewhere in the North. \n“Instead, the Business Secretary seems to have simply washed his hands of the situation, and is happy to direct people towards the nearest Job Centre. \n“Clearly, the Government thinks the loss of skilled jobs in Newcastle is a price worth paying to avoid rocking the boat. ‘I think this is totally unacceptable, and it makes a complete mockery of any talk of backing a Northern Powerhouse.” \nNestle sites in York, Halifax, and Girvan, Scotland, are also likely to be hit by job losses, and nearly 300 roles are set to be lost in total. \nPrime Minister Theresa May last month promised help for workers affected. \nShe told the House of Commons: “DWP (Department for Work and Pensions) of course stands ready to put in place their rapid response service to support any workers made redundant, by helping them back into employment as quickly as possible. \n“There are various ways in which JobCentre Plus can help.” Read More Local election results 2017 LIVE: Labour retain Durham and North Tyneside mayor after Tory victory in Northumberland \nAnd she rejected claims by some opposition politicians that the job cuts were caused by Brexit. \nMrs May said: “We should be clear that Nestle have themselves been clear that this is not a decision that was affected by leaving the European Union. They said they’d made it irrespective of that. \n“But of course it’s a worrying time for the workers and their families at Nestle in both York and Newcastle, and I can assure her that we’re already in contact with the company to understand their plans and the next steps.” \nSome opposition politicians have insisted Brexit is to blame. Anita Lower, Leader of the Liberal Democrat Opposition on Newcastle City Council and the Liberal Democrats candidate for Newcastle North, has blamed the falling value of the pound following the Brexit decision, saying it made it more expensive to import raw materials into the UK. Like us on Facebook", "external_links": [], "published": "2017-05-06T12:00:00.000+03:00", "crawled": "2017-05-06T07:10:00.000+03:00", "highlightTitle": ""}