{"organizations": [], "uuid": "f697b8a2d6b4bfb4fd8f2300dff8490a85ad9c91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30331476/16000567.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/what-it-s-like-canvassing-and-campaigning-for-votes-in-plymouth/story-30331476-detail/story.html", "country": "GB", "title": "What it's like canvassing and campaigning for votes in Plymouth", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-14T18:35:00.000+03:00", "replies_count": 0, "uuid": "f697b8a2d6b4bfb4fd8f2300dff8490a85ad9c91"}, "author": "Devon Live", "url": "http://www.devonlive.com/what-it-s-like-canvassing-and-campaigning-for-votes-in-plymouth/story-30331476-detail/story.html", "ord_in_thread": 0, "title": "What it's like canvassing and campaigning for votes in Plymouth", "locations": [], "entities": {"persons": [{"name": "john blanchard", "sentiment": "none"}, {"name": "sam blackledge", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "felicity", "sentiment": "none"}, {"name": "blanchard", "sentiment": "none"}, {"name": "natalie", "sentiment": "none"}, {"name": "alison seabeck", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "natalie wilson-bent", "sentiment": "none"}, {"name": "mercer", "sentiment": "none"}], "locations": [{"name": "thames", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "southway", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "derriford hospital", "sentiment": "none"}], "organizations": [{"name": "army", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "plymouth city council", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "plymouth moor view", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What it's like canvassing and campaigning for votes in Plymouth By Devon Live | Posted: May 14, 2017 1 COMMENTS SHARES \nIn the first of a series of features on candidates canvassing for votes in Devon, reporter Sam Blackledge joins Conservative Johnny Mercer on the doorsteps in Southway, Plymouth. \n\"When you talk about immigration people think you're racist,\" says John Blanchard. \n\"I'm not. I served with a lot of coloured guys and we had a great time together.\" \nJohnny Mercer shifts awkwardly and folds his arms. The Conservative candidate for Plymouth Moor View is canvassing in Southway, a key battleground in his fight to win a second term in Westminster. \nThe exchange with Mr Blanchard started off well – he is happy with Theresa May and believes the Tories are taking the country in the right direction but the 70-year-old is worried about \"all the immigrants coming into Europe\". \n\"Ok they're being welcomed at the moment, but you can't sustain it,\" he says. \nMr Mercer nods sympathetically and says he understands. \nMr Blanchard believes former Ukip leader Nigel Farage did the country a great service by opening up the immigration debate. \n\"For all the years I've been voting Conservative, the issue has always been there,\" he says. \n\"It's always been compromising. Now we've got this opportunity to get our own identity back.\" \nREAD NEXT: Here is the full list of the 2017 General Election candidates in Devon \nAs we walk away, Mr Mercer gives me his take on the exchange. \n\"I think Plymouth is a modern, diverse, forward-thinking place and immigrants have done wonderful things for this city and this country,\" he says. \n\"But his concerns about uncontrolled immigration are absolutely valid. \n\"Yes, I'm uncomfortable with the fact he believes Nigel Farage has put these things into the political debate. Obviously what we were doing as a political class before that wasn't working. \n\"This is why people get annoyed, they feel their voices are not heard. And that has been expressed in the European referendum. \n\"We've got to rally against this view that any conversation about immigration is racist. I'm pretty sure most people understand that it's not.\" \nAwkward conversations aside, Mr Mercer's team are in high spirits. The sun is shining and they are getting a decent reception, two years on from the former Army captain's extraordinary victory. \nHe had no previous political experience and ran a home-made campaign, presenting himself as a man of the people who would speak up for ordinary Plymothians. \nAs morning broke on May 8, 2015, he looked visibly shocked to have defeated Labour's Alison Seabeck, becoming the first Tory MP to represent the area for more than 40 years. \nSince then his high points include leading an inquiry into a \"witch hunt\" against British troops accused of abusing Iraqis, and speaking passionately about the need for better mental health services. \nBut he has seen the harsher side of politics too, fighting accusations of lavish expenses claims – £3,000 on a set of Apple computers for his office, £6,000 on a new website – while choosing to toe the party line on public sector cuts. \nThere have been a few unusual episodes too which have caught the eye of the national press, like the time the media dug up a video of him appearing topless in a shower gel advert. And a period when he lived on a yacht on the Thames to avoid paying London rents. \nREAD NEXT: Devon MPs back 'give a s**t' campaign \nHe promised to let his constituents guide his actions through \"direct democracy\". \nHis one successful attempt so far, on Brexit, ended controversially when he voted to Remain, despite the poll result showing more people favoured Leave. \nStrolling purposefully through Southway, the furrowed brow returns. \n\"What do people say about me?\" he asks. \"How can I do my job better?\" \nI mumble something about broken promises – he made a pledge to not vote for any transport scheme until Plymouth's air and rail links were properly resourced. \n\"I did what I thought was the right thing at the time,\" he says. \n\"I will be judged not by my Labour opponents, but by whether or not I actually deliver something for the people of Plymouth on the railway.\" \nConservative-run Plymouth City Council has to find more than £37 million worth of savings by 2020, which they have started by reducing bin collections, hiking council tax and increasing parking charges. \nFurther cuts lie ahead, with proposals to close 10 city libraries and a warning from council chiefs that money is getting tighter every year. \nMeanwhile Derriford Hospital has recently been on black alert, the city faces huge challenges with social care crisis and across the country head teachers are warning of severe real terms cuts to school budgets. \nREAD NEXT: South West cyber warrior credited with stopping NHS ransomware attack \nMr Mercer refutes my argument that all this is a direct impact of decisions taken by Government, preferring to frame the debate in terms of tightening up on inefficiency. \n\"If we look at a lot of the services that have been cut, it's a question of doing the right thing and getting value for money,\" he says. \n\"You would be hard-pushed to find many people in society five or ten years ago who thought there wasn't quite a lot of waste in the NHS and other bodies. \n\"We had a job to do to get rid of that waste and make sure we were getting value for taxpayers' money.\" \nAs confusing as politics can be, it seems this election presents voters with a clear ideological choice between left and right. \nLabour's manifesto – nationalising the railways, abolishing tuition fees, reversing benefit cuts, raising taxes for those earning more than £80,000 – could hardly be more at odds with the Conservative ethos. \nMr Mercer says Labour's vision of the country simply does not add up, and denies claims they have a monopoly on compassion. \n\"People ask me 'Are you happy about food banks?' \n\"What a stupid question. I had someone the other day who told me I'd stolen their money. I was unaware I had stolen money off anybody. Actually it's taxpayers' money. The welfare system is not an entitlement, it's there to look after people who need it. \n\"This is the critical difference between the Tories and Labour. Labour think you look at poverty and throw more and more money at it. I fundamentally do not believe that. \n\"I think you get in there, you get your hands dirty, you work out why people fall into poverty and provide ladders for them to get out of it. Money is one solution but it's not the only solution.\" \nHe says he has lots of Labour friends in Parliament, but has struggled to adjust to the unpleasant nature of party rivalry. \n\"They absolutely hate me for what I represent,\" he says. \n\"It's something I've never really been able to understand. It's very tribal and I think it does Plymouth a bit of a disservice.\" \nREAD NEXT: Boy, 13, almost died after downing shots of vodka at school \nWe find a Labour voter behind the next door, 25-year-old Natalie Wilson-Bent. \n\"I think the NHS needs a bit more supporting and I don't think the Conservatives are going down that way,\" Natalie tells me. \nShe says Mercer came across as \"really nice, really approachable\", but is unlikely to give him her vote. \nCanvassing can be a thankless job and Mercer is happy to admit he doesn't always get a warm welcome. \n\"We had a bad one last night,\" he says. \n\"Someone came storming out of their house and called me a piece of dirt. \n\"If they're rude then I will go back ask them not to be rude but absolutely people will have different views and I encourage that.\" \nHis wife, Felicity (above) , is a key part of the support team. \nDressed in matching branded T-shirts, the pair joke and horse around for the camera. \nIt is the first time I have seen him looking like he hasn't got the weight of the world on his shoulders. \nExplaining how much they have learned over the last two years, Felicity speaks as if they are one person. \n\"Having not come from a political background and not knowing anyone in politics, we feel more learned about it now,\" she says. \n\"It's hard being a candidate because you don't know whether you have the right to put yourself forward. As an incumbent you have a bit more confidence. \n\"In terms of how our lives have changed – yes he's an MP, but we're just a normal family, we carry on our normal thing and just crack on.\" \nTo find out the latest on the General Election here in Devon visit Devon Live's Politics Homepage . ", "external_links": [], "published": "2017-05-14T18:35:00.000+03:00", "crawled": "2017-05-14T15:03:53.000+03:00", "highlightTitle": ""}