{"organizations": [], "uuid": "c70d7c606b35cc691acbb92b4afcc5e2f0ab1006", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12995967.ece/ALTERNATES/s1200/TKR_NJL_140915KeithAtkinsonMetnorGroupJPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/metnor-group-boosts-sales-85m-12994077", "country": "GB", "domain_rank": 21960, "title": "Metnor Group boosts sales to £85m on the back of buoyant building scene", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Metnor Group boosts sales to £85m on the back of buoyant building scene", "spam_score": 0.0, "site_type": "news", "published": "2017-05-07T23:00:00.000+03:00", "replies_count": 0, "uuid": "c70d7c606b35cc691acbb92b4afcc5e2f0ab1006"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/metnor-group-boosts-sales-85m-12994077", "ord_in_thread": 0, "title": "Metnor Group boosts sales to £85m on the back of buoyant building scene", "locations": [], "entities": {"persons": [{"name": "emily potts", "sentiment": "none"}, {"name": "atkinson", "sentiment": "none"}, {"name": "gardiner richardson", "sentiment": "none"}, {"name": "keith atkinson", "sentiment": "none"}], "locations": [{"name": "maidenhead", "sentiment": "none"}, {"name": "great yarmouth", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "metnor great yarmouth", "sentiment": "none"}, {"name": "norstead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "shieldfield", "sentiment": "none"}, {"name": "killingworth", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "kingston", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "metnor group", "sentiment": "negative"}, {"name": "tyneside company", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "metnor construction", "sentiment": "none"}, {"name": "invalid email  north east", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "kingston vale", "sentiment": "none"}, {"name": "chris cant of metnor construction ltd", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "metnor", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Metnor Group boosts sales to £85m on the back of buoyant building scene The group's Metnor Construction division won Company of the Year at the Northumberland and Tyneside Business Awards Share Keith Atkinson, group managing director at Metnor Group (Photo: Pic supplied free by Emily Potts at Gardiner Richardson) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East construction group Metnor has toasted one of its most successful years after taking turnover up 49% to £85.6m, despite earlier fears it wouldn’t reach its annual targets. \nKillingworth -based Metnor has released financial figures for 2016, which reveal growth across all four of its divisions – general building and construction, property development and investment, mechanical and electrical contracting and specialist testing equipment. \nOverall, gross profit grew from £9.1m to £13.6m, and while pre-tax profits dropped from £11m to £8.2m, underlying profits across the group are up as the 2015 figure included a one-off profit of £8.5m from the disposal of investment properties. \nThe star performer of the group, which also has bases in Maidenhead, Great Yarmouth and Aberdeen, was Metnor Construction – named earlier this year as the Northumberland and Tyneside Company of the Year at the regional heat of the Journal-backed North East Business Awards 2017 – which bumped up turnover from £34.3m to £58.9m on the back of major contracts across the UK. \nA strategic report within the accounts details a number of key projects including care homes in Kingston Vale and student accommodation in Newcastle and Kingston, and the division also has a very strong order book. \nKeith Atkinson, group managing director, said he was delighted with company performance and with the direction in which the group is heading. Read More Metnor Construction wins Company of the Year at Northumberland and Tyneside Business Awards \nHe said: “Our 2016 results are particularly pleasing as the early part of the year was disrupted by the uncertainty caused by the EU referendum and, at one stage, we were concerned we would be unable to meet our targets. \n“Fortunately, the second half of the year saw activity accelerate across all of our divisions. This has continued into the early part of 2017, which is an encouraging sign for the year ahead. \n“Undoubtedly our best performer in 2016 has been Metnor Construction, which continues to grow and prosper under its new management team. \n“Our construction turnover has more than doubled over the last two years and 2016 has seen us complete a number of prestigious projects for blue chip clients around the country. \n“We were delighted to see this performance recognised in the recent Northumberland and Tyneside Business Awards with Metnor Construction named as 2017 Company of the Year.” Chris Cant of Metnor Construction Ltd (Photo: Newcastle Chronicle) \nThe figures also show a large cash inflow in the year, with cash balances at the end of 2016 totalling £14.5m. \nThe property division had what directors describe as a “transformational” year in 2016 thanks to the £40m disposal of a student accommodation scheme in Shieldfield to investors from Singapore. \nProceeds from the sale were used to repay the group’s bank debt and purchase a number of investment properties. \nMr Atkinson said: “Despite the Brexit uncertainty, our property division was able to complete a number of deals in the year and whilst we never expected to repeat the one-off results achieved in 2015, the division still contributed a healthy £3m to our group profits as well as a significant cash inflow. \n“Elsewhere in the group, Norstead, our mechanical and electrical contracting business, and Metnor Great Yarmouth, our oil and gas pressure testing business, both made positive contributions to group profits. \n“The recent growth in the group’s activities has seen us welcome more than 25 new employees to the group over the last two years. They, together with our long serving employees, have been instrumental in helping the group achieve its targets and their hard work, loyalty and dedication is never taken for granted. \n“2017 has started off well across all of the group’s trading activities and we have a healthy order book for the year ahead. With a strong and growing balance sheet this gives us a solid base from which to grow.” Like us on Facebook", "external_links": [], "published": "2017-05-07T23:00:00.000+03:00", "crawled": "2017-05-07T18:50:34.000+03:00", "highlightTitle": ""}