{"organizations": [], "uuid": "d9f563346cfbe4eaf3747c8ffc04b737f9f793e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30337634/16004937.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/full-details-of-exeter-s-ikea-revealed-at-groundbreaking-ceremony/story-30337634-detail/story.html", "country": "GB", "title": "Full details of Exeter's IKEA revealed at groundbreaking ceremony", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-17T17:29:00.000+03:00", "replies_count": 0, "uuid": "d9f563346cfbe4eaf3747c8ffc04b737f9f793e3"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/full-details-of-exeter-s-ikea-revealed-at-groundbreaking-ceremony/story-30337634-detail/story.html", "ord_in_thread": 0, "title": "Full details of Exeter's IKEA revealed at groundbreaking ceremony", "locations": [], "entities": {"persons": [{"name": "gillian drakeford", "sentiment": "none"}, {"name": "nicholas earle", "sentiment": "none"}, {"name": "drakeford", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "newcourt way", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "ikea", "sentiment": "none"}, {"name": "newcourt way", "sentiment": "none"}, {"name": "ikea", "sentiment": "none"}, {"name": "ikea sheffield", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Full details of Exeter's IKEA revealed at groundbreaking ceremony By Alex_Richards | Posted: May 17, 2017 4 COMMENTS SHARES Comments (4) \nFull details of the size and scale of Exeter's IKEA have be revealed at a groundbreaking ceremony officially marking the start of building work on the site. \nThe company has revealed how large the store will be and what will be sold at the first IKEA in Devon when it opens in the early summer of 2018. \nNew pictures of how the store will look were shown at the site next the M5 this morning. IKEA revealed the store will employ 350 people, recruited locally who will all be paid at least the real living wage - and the manager, Nicholas Earle, has strong family links to North Devon. \nIt will be the UK's first sustainably built IKEA, meaning it will harvest rainwater and comply to strict environment regulations. The store will be 28,000 square metres large over two floors and will sell the full IKEA range. \nIt will have a green room - a large greenhouse displaying IKEA's full outdoor range - as well as a restaurant, creche and space for 1,000 vehicles in teh car park. There will be four order collection points. \nThe Swedish home-ware giant is already looking to fill various posts based in Exeter - offering up to £33,000 a year for some roles. \nJobs include HR administrator, sales department managers, HR business partner, kitchen production manager, customer restaurant manager and Swedish food market and bistro manager. \nAnother 480 roles will be created in Sheffield, where Ikea will set up shop this summer. \nSpeaking at a \"groundbreaking\" ceremony in Exeter, Ikea's UK boss Gillian Drakeford said: \"As we continue to expand, we're delighted to bring investment to new areas across the country and create new opportunities for local communities. \n\"This year we are celebrating Ikea's 30th anniversary in the UK, and we are seeing more demand from customers for more stores in areas closer to where they live.\" \nIn November, Ikea said that UK revenues rose 8.9% to £1.72 billion in the year ending August 31, its fifth consecutive year of sales growth. \nOnce opened, the new stores will leave Ikea with 22 outlets in the UK. The retailer also has four smaller format stores. \nLast year Ikea reiterated its commitment to investing in Britain following the Brexit vote, with Ms Drakeford saying at the time: \"We believe there is a lot of opportunity in the UK. \n\"We've been evaluating our newest stores and formats and yes, absolutely, there will be more stores. We will continue to invest in the UK.\" \nIKEA is set to open in Exeter next summer... so if you can't wait to get your hands on their flat packed furniture and famous meatballs, then here is what you can expect when they open. \nAn IKEA spokesperson has said IKEA's 21st store, off Newcourt Way and A379, will open in early summer 2018. \nThe Swedish home-ware giant is already looking to fill various posts based in Exeter - offering up to £33,000 a year for some roles. \nJobs include HR administrator, sales department managers, HR business partner, kitchen production manager, customer restaurant manager and Swedish food market and bistro manager. \nA spokesman for IKEA said a more detailed timeline for the construction of the store will be unveiled this month, alongside further details about the project. So in case you didn't know....what is IKEA? \nIKEA is a Swedish furniture giant famous for its cheap furniture, the flat packed furniture and let's not forget about the meatballs. The retail giant was founded in 1943 and as of January 2008, it was named the world's largest furniture retailer. \nIKEA's famous meatballs \nRead more: New app launched that will tell you where the nearest cash point is How do I shop at IKEA? \nThe shop provides tape measures, and pencils and notepads for you to write down price tag details, including where to pick up your item. \nYou can grab a big yellow bag for those smaller items you like but bigger items have an Argos-style form to fill in. \nThere are lots of details on the price tag of items - colours, materials, sizes, etc. You'll find the shelf number if you can collect the item from the self-serve area or a message to contact staff if you need to collect it at furniture pick-up. What are the opening hours? \nBased on the other branches of IKEA, the Exeter branch is expected to open 11 hours a day. \nMonday to Saturday - 10am-9pm ", "external_links": [], "published": "2017-05-17T17:29:00.000+03:00", "crawled": "2017-05-17T14:10:27.000+03:00", "highlightTitle": ""}