{"organizations": [], "uuid": "15972b6697a88629a678ed64750d8773e88fb978", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13108292.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/northumberland-county-show-draws-big-13108390", "country": "GB", "domain_rank": 21960, "title": "Northumberland County Show draws big crowds to see best of region's farming life", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-30T00:08:00.000+03:00", "replies_count": 0, "uuid": "15972b6697a88629a678ed64750d8773e88fb978"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/northumberland-county-show-draws-big-13108390", "ord_in_thread": 0, "title": "Northumberland County Show draws big crowds to see best of region's farming life", "locations": [], "entities": {"persons": [{"name": "james wardle", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "minette batters", "sentiment": "none"}], "locations": [{"name": "northumberland county", "sentiment": "none"}, {"name": "bywell", "sentiment": "none"}, {"name": "bywell hall", "sentiment": "none"}, {"name": "northumberland county show", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "stocksfield", "sentiment": "none"}, {"name": "northumberland county", "sentiment": "none"}], "organizations": [{"name": "national farmers’ union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northumberland County Show draws big crowds to see best of region's farming life The event at Bywell drew nearly 20,000 visitors for a mix of livestock competitions and family entertainment Share Click to play Tap to play The video will start in 8 Cancel Play now Get   \nThousands of people have flocked to see the best of the North East’s agricultural communities at the Northumberland County Show. \nA crowd approaching 20,000 braved grey skies and occasional drizzle for the region’s largest agricultural event, which combines top-class livestock competitions and rural-themed entertainment. \nHighlights of this year’s event - which took place amid tightened security following last week’s terrorist attack in Manchester - included a monster truck display, Roman re-enactments and a parade of tractors through the ages. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe event came 24 hours after the first Northumberland Day, with red-and-yellow flags displayed with pride around the show field at Bywell, near Stocksfield. \nShow chairman James Wardle said crowds were not as high as last year when the show was blessed with excellent weather but those that had come had enjoyed the event. \nBut he added: “People are here and everybody seems to be enjoying themselves. The monster trucks are a big draw and we’ve got the best of the best in livestock on show too. Horses at the Northumberland County Show 2017 at Bywell Hall (Photo: Newcastle Chronicle) \n“It’s been a very high standard, the cattle and sheep especially. We’re the first show of the season so it’s fresh out of the box for a lot of the stock. \n“In many ways we’re on a high as a farming community. We’re not sure what Brexit is going to bring but we’ll pull through whatever.” \nThe event comes as the farming industry both in the region and nationally is at something of a crossroads, with Brexit offering both challenges and opportunities to rural businesses in the coming years. \nAttending the show was Minette Batters, deputy president of the National Farmers’ Union. Thousands turn out for the Northumberland county show 2017 at Bywell Hall (Photo: Newcastle Chronicle) \nShe said: “This is a wonderful event, a true agricultural show with lots of incredible stock. Events like this are always a showcase of the best of what we do. \n“Agriculture is, above all, a survivor. We’ve been through huge challenges and we’ve got some to come but ultimately this is a time of opportunity. It’s very much for us as farmers to drive the agenda and to look at farming through a new lens. \n“Now it’s about getting the right trade deal sorted and to a certain extent it’s about re-positioning how agricultural is considered by the Government, making sure that food security is a national priority, which it hasn’t been for many years.” Like us on Facebook", "external_links": [], "published": "2017-05-30T00:08:00.000+03:00", "crawled": "2017-05-29T19:26:37.000+03:00", "highlightTitle": ""}