{"organizations": [], "uuid": "e7a74d320304336c9488540f91dcfaaa6535c802", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30337958/16005251.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/public-urged-to-8216-remain-vigilant-8217-after-exeter-burglary/story-30337958-detail/story.html", "country": "US", "title": "Public urged to ‘remain vigilant’ after Exeter burglary | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.032, "site_type": "news", "published": "2017-05-17T20:16:00.000+03:00", "replies_count": 0, "uuid": "e7a74d320304336c9488540f91dcfaaa6535c802"}, "author": "", "url": "http://www.devonlive.com/public-urged-to-8216-remain-vigilant-8217-after-exeter-burglary/story-30337958-detail/story.html", "ord_in_thread": 0, "title": "Public urged to ‘remain vigilant’ after Exeter burglary | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}], "locations": [{"name": "killerton estate", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "hele", "sentiment": "none"}, {"name": "dartington", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "new devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "torridge district council", "sentiment": "none"}, {"name": "dartington food fair", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "devon & cornwall police and dorset police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Public urged to ‘remain vigilant’ after Exeter burglary By Zoe_Stevens | Posted: May 17, 2017 0 COMMENTS SHARES Police believe that the offenders entered the property through an insecure window Public urged to 'remain vigilant' after Exeter burglary X \nCopy link to paste in your message / Comments (0) \nPolice are appealing for witnesses after thieves entered a property in Exeter through a window and took belongings and cash. The burglary happened at a residential property on the Killerton Estate, in the Hele area of Exeter. \nThieves entered the home through an insecure window sometime between 2pm and 2.45pm on May 11, while the resident was out. The offender managed to escape having taken a handbag containing cash and cards from the kitchen table. \nPolice are urging residents in the Hele area of Exeter to remain vigilant. \nRead next: How do I register to vote and when is the deadline? \nA police spokesman said: \"Residents in the area are asked to remain vigilant and to remember to keep their property secure, including keeping windows closed when they are out.\" \nAnyone who has information, or has seen anyone acting suspiciously in the area, is asked to contact police via 101@dc.police.uk or by calling 101 quoting CR/036233/17. \nInformation can also be passed anonymously to independent charity Crimestoppers by calling 0800 555 111 or reporting online at www.crimestoppers-uk.org . READ NEXT: \nDevon expert on immigration as an election issue \nDuring this general election, as with the 2016 EU referendum that set off the chain of events leading to it, immigration is likely to play a key role. Research by the British Election Study into what mattered most to referendum voters demonstrated that leavers were primarily concerned about sovereignty and immigration. A recent ComRes/Sunday Mirror poll suggested that immigration was fourth in the list of issues most important to voters in the South West – behind the NHS, Brexit, and the economy; the Brexit option likely incorporates many such concerns. \nNew Devon gin to be launched at food fair \nA brand new gin, created in South Devon using local ingredients will be launched at Dartington Food Fair. Elmhirst Gin will officially be launched at the food fair which takes place over the bank holiday weekend (May 28 and 29) and will be available to buy both at The Shops at Dartington and online. Created at Dartington, using ingredients from the estate, this new premium gin blends tradition with a modern twist to produce a unique taste. \nDistrict council explains pollution incident warning sign at popular family beach \nA notice warning residents about pollution at a popular family beach has been called a \"precautionary measure\" by the local council. Torridge District Council issued a notice warning the public about pollution in the water at Westward Ho! as a precautionary measure. The notice read: \"There is a pollution incident affecting this beach and bathing water. Sewage has spilled near to this beach. It may be harmful to enter the water. This sign will be removed when there is no further risk from this incident.\" \nPolice body cameras to be rolled out across Devon in transparency bid \nPolice in Devon will be wearing body cameras after a successful study into the tool. Today, Wednesday 17 May, will see the deployment of Body Worn Video (BWV) which is being issued to 270 Authorised Firearm Officers (AFOs), across Devon & Cornwall Police and Dorset Police. The rollout of the cameras follows a successful trial and public consultation. Devon and Cornwall piloted head cameras in 2006, primarily to target cases of domestic abuse, and the six-month Home Office trial was hailed a success, with a reduction in crime. ", "external_links": [], "published": "2017-05-17T20:16:00.000+03:00", "crawled": "2017-05-17T16:12:32.000+03:00", "highlightTitle": ""}