{"organizations": [], "uuid": "c1818b4fe089859e1d1957b7ee33e0f1d33cc7f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12641449.ece/ALTERNATES/s1200/EU-referendum.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farming-groups-put-brexit-heart-12992605", "country": "GB", "domain_rank": 21960, "title": "Farming groups put Brexit at the heart of General Election demands", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Farming groups put Brexit at the heart of General Election demands", "spam_score": 0.0, "site_type": "news", "published": "2017-05-05T22:06:00.000+03:00", "replies_count": 0, "uuid": "c1818b4fe089859e1d1957b7ee33e0f1d33cc7f0"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farming-groups-put-brexit-heart-12992605", "ord_in_thread": 0, "title": "Farming groups put Brexit at the heart of General Election demands", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "darren pepe", "sentiment": "none"}, {"name": "ross murray", "sentiment": "none"}, {"name": "meurig raymond", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "digital", "sentiment": "negative"}, {"name": "business farming", "sentiment": "negative"}, {"name": "tenant farmers association", "sentiment": "none"}, {"name": "government", "sentiment": "none"}, {"name": "national farmers union", "sentiment": "none"}, {"name": "cla", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Farming groups put Brexit at the heart of General Election demands Digital services in rural areas, the future of tenant farmers and housing also on rural groups' election wishlists Share A combine harvester in a field (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBrexit and the future of agriculture dominate General Election manifestos put forward by farming and rural economy organisations. \nA range of bodies have laid out their wishlists for the parties competing at June’s election, with the immediate challenge of Brexit dominating much of their thinking. \nThe NFU has set out five key policy challenges for prospective parliamentary candidates. focusing on making Brexit a success; investing in the agricultural sector, safeguaring supply chains, better use of science and caring for the countryside. \nNFU president Meurig Raymond said: “The General Election in June provides an opportunity for the farming sector to impress on candidates of all colours the critical value of British farming to our economy, to our wellbeing and to our environment. \n“The success of British farming matters to the British electorate – especially at this time of unprecedented change. Indeed, YouGov polling commissioned by the NFU this year shows that 85% of people think it is important that Britain has a productive and resilient farming industry. \n“We can’t ignore that farming is arguably the most vulnerable sector in the Brexit negotiations. But the NFU has its sights fixed on solutions and policies to ensure a productive, profitable and progressive farming sector that puts safe, trusted, affordable and quality food on shoppers’ plates. \n“Over the next parliament, we want to work in partnership with the new Government to achieve this with a predictable and manageable transition process. \n“And while Brexit is one of the newer challenges for the sector, we’re still committed to gaining political traction on the issues that existed in the industry before June 23, and still exist now. \n“The nation needs a food and farming industry with a Government strategy, it needs a safe food chain, and it needs a Government which looks after the countryside and rural communities.” Meanwhile the CLA has highlighted the digital divide in rural areas as well as the need for more resilience in farming as its key priorities. National Farmers Union President Meurig Raymond (Photo: Darren Pepe) \nThe CLA - which represents landowners, farmers and rural businesses - wants a Brexit that works for the countryside, the creation of the homes that rural areas need, implementation of a simpler planning system and a better tax regime for rural business. \nCLA president Ross Murray said: “Every candidate seeking election to a rural constituency should be able to demonstrate how they will stand up for farming and the countryside. They must understand why the countryside matters and that rural communities expect the next government to face up to the big challenges, like how to support farming and the environment once the UK is no longer part of the Common Agricultural Policy. \n“Encouraging more small scale housing development by making better use of existing buildings and relaxing the planning system will help alleviate the acute shortage of homes in rural areas. \n“Delivering universal 4G mobile coverage is essential to modern rural life and by treating diversified rural businesses as single businesses for tax purposes will end the discrimination they currently face and allow for growth and better productivity. \n“We will be out throughout the campaign speaking up for rural businesses, but it is also vital that our members challenge candidates to demonstrate their commitment to standing up for farming and the countryside in Parliament and how they intend to make a difference.” \nThe Tenant Farmers Association has laid out a range of demands on Brexit, but also highlighted food security and supply chain issues, enhancing the resilience of the tenanted sector, simplifying the tax system and tackling bovine TB as election issues. \nThe association said: “The next Government must grasp the nettle to introduce measures to change the fiscal environment within which rural landlords make decisions about letting land to encourage longer term farm business tenancies. \n“The tenanted sector cannot begin to consider issues of resilience and sustainability when average lengths of term on new FBTs are consistently below four years.” Like us on Facebook", "external_links": [], "published": "2017-05-05T22:06:00.000+03:00", "crawled": "2017-05-05T18:06:19.000+03:00", "highlightTitle": ""}