{"organizations": [], "uuid": "e81a587e2d2001ee09057ca03bb20b22a8376d0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30341202/16008145.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/theresa-may-s-conservative-election-manifesto-to-face-up-to-britain-s-five-giant-challenges/story-30341202-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Theresa May's Conservative election manifesto to face 'Britain's...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-19T01:01:00.000+03:00", "replies_count": 0, "uuid": "e81a587e2d2001ee09057ca03bb20b22a8376d0f"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/theresa-may-s-conservative-election-manifesto-to-face-up-to-britain-s-five-giant-challenges/story-30341202-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Theresa May's Conservative election manifesto to face 'Britain's...", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "andy thomas", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "harborough", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}], "organizations": [{"name": "conservative", "sentiment": "negative"}, {"name": "harborough labour", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "loughborough tory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May's Conservative election manifesto to face 'Britain's five giant challenges' By danjmartin | Posted: May 18, 2017 0 COMMENTS SHARES Theresa May outlines the Tory election pledges Theresa May's Conservative election manifesto to face 'Britain's five giant... X \nCopy link to paste in your message / Comments (0) \nTheresa May has promised that a Conservative government will tackle the \"five giant challenges\" facing Britain if her party is returned to power on June 8 . \nThe Prime Minister promised there would be no increase in VAT over the next parliament if she wins the General Election on June 8 and confirmed corporation tax will fall to 17 per cent, but left Chancellor Philip Hammond flexibility to raise other taxes. \nThe manifesto includes plans to fund increased spending on social care by withdrawing the winter fuel payment from wealthier pensioners, and offers protection from the cost of social care for people with assets of £100,000 or less, a dramatic increase from the current £23,250 level in England \nGeneral Election 2017: Click HERE for everything you need to know \nMrs May said Britain was facing the most challenging period in the past 60 years. \nShe restated her determination to get a good Brexit deal for Britain, but said her manifesto also addressed the challenges of building a strong economy, tackling social division and meeting the pressures of an ageing society and fast-changing technology. \nFollowing the publication of the document Loughborough Tory candidate Nicky Morgan said: \"I have been in Loughborough market this morning. \n\"It is a place where you always get frank and honest opinions. \n\"People are saying the big thing they want is economic security. \n\"They want secure jobs and an economy that allows them to do well. That is at the front and centre of the manifesto. \n\"What comes across in Loughborough market is the leadership styles of Theresa May and Jeremy Corbyn who people are worried won't defend the country.\" \nMrs May said: \"The next five years are the most challenging that Britain has faced in my lifetime. Brexit will define us: our place in the world, our economic security and our future prosperity. \n\"So now more than ever, Britain needs a strong and stable government to get the best Brexit deal for our country and its people. \nMrs May said she was maintaining Mr Cameron's controversial target to reduce net immigration below 100,000 - something she failed to do in six years as Home Secretary. \nMr Cameron's triple lock protection for the state pension - requiring it to rise by the largest of 2.5%, inflation or average earnings - will continue to 2020, but then be replaced by a double lock of earnings or inflation. \nTory manifesto commitments include: \n:: Commitment to stick to fiscal rules which require a balanced budget by 2025 \n:: Promise to \"keep tax as low as possible and spend the proceeds responsibly\", with a \"firm intention\" to reduce taxes on Britain's businesses and working families \n:: Increase in personal income tax allowance to £12,500 and higher rate threshold to £50,000 by 2020 \n:: National Living Wage to reach 60% of median earnings by 2020 \n:: Boost of at least £8 billion to NHS spending in real terms over the next five years, with per capita increases in each individual year \n:: A million new homes by the end of 2020 and 500,000 more by 2022. \n:: Modern industrial strategy to spread economic opportunity to all parts of the country \n:: Commitment to spend at least 2% of GDP on defence and to increase spending by at least 0.5% above inflation every year \n:: End to the ban on selective state schools to allow creation of new grammars \n:: £4 extra billion a year for schools by 2022. \nHarborough Labour candidate Andy Thomas said: \"The Tories are a party of contradictions. The biggest one from this manifesto is on long term care. \n\"They tell people they can retain £100,000 but not that that includes the value of their houses. \n\"The average house price in Harborough is £245,000 so it will hardly help anyone. \n\"People have to ask themselves what kind of society they want? \"One of cuts and grumbling under the Tories or one of principle, justice and fairness under Labour?\" ", "external_links": [], "published": "2017-05-19T01:01:00.000+03:00", "crawled": "2017-05-18T20:30:19.000+03:00", "highlightTitle": ""}