{"organizations": [], "uuid": "2c488839b92f6974b3595b71613893691d6bc347", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13008848.ece/ALTERNATES/s1200/Jeremy-Corbyn-Launches-The-Labour-Partys-General-Election-Campaign.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-urges-voters-take-13008633", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn urges voters to 'take our wealth back' in barnstorming general election launch", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Jeremy Corbyn urges voters to 'take our wealth back' in barnstorming general election launch", "spam_score": 0.0, "site_type": "news", "published": "2017-05-09T21:11:00.000+03:00", "replies_count": 0, "uuid": "2c488839b92f6974b3595b71613893691d6bc347"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-urges-voters-take-13008633", "ord_in_thread": 0, "title": "Jeremy Corbyn urges voters to 'take our wealth back' in barnstorming general election launch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jeremy Corbyn urges voters to 'take our wealth back' in barnstorming general election launch Jeremy Corbyn said there would be a 'reckoning' for the rich if Labour wins on June 8 Share Click to play Tap to play The video will start in 8 Cancel Play now In 90 seconds: Corbyn v May in final PMQs before the election Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour leader Jeremy Corbyn urged the British people to “take our wealth back” as he launched his election campaign with a rousing attack on “tax cheats” and “greedy bankers”. \nAnd he vowed to make a success of Brexit if he wins on June 8, promising jobs, strong industries and a fairer society if he becomes Prime Minister. \nMr Corbyn warned: “When Labour wins there will be a reckoning for those who thought they could get away with asset stripping our industry, crashing our economy through their greed and ripping off workers and consumers.” \nAnd in a message likely to rally his supporters, he said criticism of Labour was an attempt by the elite to maintain their privileges and hold the rest of the country back. \nHe said: “ Labour is under attack because we are standing up to the elites who are determined to hijack Brexit to pay even less tax and take even more of the wealth we all create.” \nBut Mr Corbyn pledged: “Labour wants a jobs-first Brexit. A Brexit that safeguards the future of Britain’s vital industries, a Brexit that paves the way to a genuinely fairer society, protecting human rights, and an upgraded economy.” \nSpeaking in Manchester, Mr Corbyn dismissed media speculation that the Conservatives are on course for victory, insisting: “We are fighting to win this election.” Labour Party leader Jeremy Corbyn (Photo: Getty Images Europe) \nIt follows the publication of an interview on Monday night in which Mr Corbyn apparently said he planned to stay on as Labour leader whether his party wins or loses. \nThe Labour leader provided a summary of Labour’s election pledges, telling his audience: “Labour’s plan to transform Britain will mean a big deal to upgrade the economy: new infrastructure to support the industries of the future. And an investment in training and skills to equip our workforce to compete globally. \n“It means rebuilding our NHS and social care services with the funding they need. \n“It means building a million homes to rent and buy. \n“And it means tackling the scandal of air pollution which contributes to 40,000 deaths per year.” \nBy contrast, Conservatives wanted to help the rich keep their wealth and become even richer, he said. \n“But it’s no surprise that the richest have got even richer after the tens of billions the Tories have handed them in tax cuts. \n“That’s what we mean when we say the system is rigged for the rich.” Read More Theresa May and Jeremy Corbyn set to face off in Question Time election special \nHe continued: “Our Westminster system is broken and our economy is rigged. Both are run in the interests of the few.” \nBut Labour would take on “vested interests” and demonstrate that the country could be transformed and run for “the many, not the few”, he said. \nHe continued: “Let’s turn our country around. Let’s come together to transform Britain. Together, we can win for the many not the few. \nDon’t wake on up on 9 June to see celebrations from the tax cheats, the press barons, the greedy bankers, Philip Green, the Southern Rail directors and crooked financiers that take our wealth, who have got away with it because the party they own, the Conservative Party, has won. \nWe have four weeks to ruin their party. We have four weeks to have a chance to take our wealth back.” Like us on Facebook ", "external_links": [], "published": "2017-05-09T21:11:00.000+03:00", "crawled": "2017-05-09T16:24:48.000+03:00", "highlightTitle": ""}