{"organizations": [], "uuid": "2c9bf7ceb0b9fb409514b283846d191542361d90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13094639.ece/ALTERNATES/s1200/UKIP-Launch-Their-General-Election-Manifesto.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-vote-ukip-everything-you-13094578", "country": "GB", "domain_rank": 21960, "title": "Why should I vote UKIP? Everything you need to know ahead of the General Election 2017", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-26T04:32:00.000+03:00", "replies_count": 0, "uuid": "2c9bf7ceb0b9fb409514b283846d191542361d90"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-vote-ukip-everything-you-13094578", "ord_in_thread": 0, "title": "Why should I vote UKIP? Everything you need to know ahead of the General Election 2017", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why should I vote UKIP? Everything you need to know ahead of the General Election 2017 What you need to know about UKIP and its manifesto before the general election on June 8. Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe United Kingdom Independence Party , usually known as UKIP, supported leaving the European Union long before last year’s Brexit referendum. \nMore recently, it has taken a tough approach to the issue of Islamist extremism and backs policies such as a ban on burqas and other face coverings. Critics say some of these measures target ordinary Muslims. \nThe Chronicle has launched a Whatsapp group for general election news. To receive daily messages text GE to 07827 937 000. Add the number to your phone contacts book as ‘Chronicle’. Your number won’t be shared with other members of the group. Who is the UKIP leader? UKIP leader Paul Nuttall (Photo: Getty Images Europe) \nUKIP is led by Paul Nuttall. Previous leader Nigel Farage became a well-known figure. How many seats did UKIP win at the last election? \nOnly one. However, UKIP got more than 3.8 million votes at the last election - and more votes than the SNP and Liberal Democras combined, even though they won far more seats. Read More What are UKIP’s policies? Brexit \nLeave the European Union. The manifesto states that the EU will attempt to prolong the Brexit process as long as possible, adding: “The longer the EU can keep Britain in, the greater the opportunity for a new government to reverse the referendum decision, or sign up to some kind of associated membership agreement which, to all intents and purposes, will be just like EU membership.” \nThe Manifesto states: “UKIP is the only political party in Britain you can trust to deliver a true, unequivocal Brexit.” \nA ban on the EU flag being flown from public buildings. \nJune 23rd, the date of the 2016 EU referendum, to become a bank holiday called Independence Day. \nBring back the classic blue British passport Cost of living A TV licence \nRemove VAT from domestic energy bills and remove a sum currently added to bills to subsidise renewable energy schemes, cutting typical household energy bills by £170 a year. \nAbolish the TV licence, with the BBC adopting a new funding model based on subscriptions and/or advertising. The BBC would retain a “core free-to-air offering”. \nRemove VAT from hot takeaway food such as fish and chips, and from women’s sanitary products. Employment \nAllow women at 60 in return for a lower pension. \nEnsure employers are legally free to choose to hire a young unemployed British person under the age of 25 ahead of a better qualified or more experienced foreign applicant, without faing legal action. Housing \nRoll out high quality, low cost factory-built modular (FBM) homes, affordable on the national average wage of £26,000. Health \nProvide NHS England with an additional £9 billion a year by 2021/22 and five social care an extra £2 billion, using savings from cutting the foreign aid budget. \nLaunch a crackdown on ineligible foreign nationals using the NHS. Only British citizens or foreign nationals who have paid UK taxes for at least five consecutive years will be eligible for non-urgent NHS care. Challenging the media \nReview advertising, broadcast and editorial codes to combat “lad culture” that treats young women as sex objects, and end ‘red circle of shame’ in celebrity magazines that highlights imperfections. \nOpen a grammar school in every town. Pupils will be able to join at any age up to 16. Read More Could you pass a grammar school entrance exam? Put your knowledge to the test with this quiz Support for the elderly \nKeep the winter fuel allowance, free bus passes, prescriptions and eye tests for all over-60s, without means testing. \nKeep the ‘triple lock’ on the state pension, increasing it every year by the highest of inflation, average earnings, or 2.5 per cent. Immigration A Border Force officer checking passports \nSet a target to reduce net migration to zero, over a five-year period. In practice this means the number of people moving to the UK cannot be higher than the number leaving. \nEnd unskilled and low-skilled immigration for five years after we leave the EU. Integration \nTest the “social attitudes” of people hoping to migrate to the UK to ensure they support British values such as respect for women and gay people, and support for democracy and free speech. \nImplement a screening programme for girls identified to be at risk of female genital mutilation from birth to age sixteen, consisting of annual non-invasive physical check-ups \nBan wearing of the niqab and the burqa in public places. \nImmediately putting into Special Measures schools found to be exposing children to Islamism Police \nTrain and deploy 20,000 more police and employ 7,000 more prison officers. Foreign aid \nClose down the Department for International Development and cut aid spending from 0.7 per cent of economic output to 0.2 per cent. Transport \nScrap the HS2 high speed rail line \nInvest in upgrading existing main line services to create additional capacity, expand electrification, and improve east-west rail services and connections across the north of England. Constitution \nIntroduce proportional representation for electing MPs \nAbolish the House of Lords \nCreate a new English Parliament, to sit in the old Lords Chamber. Like us on Facebook ", "external_links": [], "published": "2017-05-26T04:32:00.000+03:00", "crawled": "2017-05-26T00:01:37.000+03:00", "highlightTitle": ""}