{"organizations": [], "uuid": "20afe45145704c95d61abd2583a7087007a6e571", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30327105/15997742.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/rare-opportunity-to-bid-for-east-devon-farm-tenancy/story-30327105-detail/story.html", "country": "GB", "title": "Devon Live published Rare opportunity to bid for East Devon farm tenancy", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Devon Live published Rare opportunity to bid for East Devon farm tenancy", "spam_score": 0.0, "site_type": "news", "published": "2017-05-11T22:08:00.000+03:00", "replies_count": 0, "uuid": "20afe45145704c95d61abd2583a7087007a6e571"}, "author": "Devon Live", "url": "http://www.devonlive.com/rare-opportunity-to-bid-for-east-devon-farm-tenancy/story-30327105-detail/story.html", "ord_in_thread": 0, "title": "Devon Live published Rare opportunity to bid for East Devon farm tenancy", "locations": [], "entities": {"persons": [{"name": "devon live", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "leigh rix", "sentiment": "none"}, {"name": "clare james", "sentiment": "none"}, {"name": "clinton devon estates", "sentiment": "none"}, {"name": "clare", "sentiment": "none"}], "locations": [{"name": "otterton", "sentiment": "none"}, {"name": "sidmouth", "sentiment": "none"}, {"name": "budleigh salterton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "east devon jurassic coast", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "stantyway farm", "sentiment": "none"}, {"name": "clinton devon estates", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rare opportunity to bid for East Devon farm tenancy By Devon Live   0 COMMENTS SHARES Rare opportunity to bid for East Devon farm tenancy for the first time in 20 years Rare opportunity to bid for East Devon farm tenancy X \nCopy link to paste in your message / Comments (0) \nTenders are being invited from entrepreneurial farmers interested in a once-in-a-generation opportunity to become a tenant farmer on the spectacular East Devon Jurassic Coast. \nStantyway Farm, is a 264 acre arable organic farm located just above the idyllic village of Otterton between Budleigh Salterton and Sidmouth. It was farmed by the same family for two generations until their retirement three years ago and, until now, it has been part of Clinton Devon Estates' in-hand farming operation. \nThis is the first time in 20 years that the owners, Clinton Devon Estates, have let a farm on the open market. Stantyway Farm is one of 30 tenant farms on the 25,000 acre estate which encompasses farmland, forests and public open space as well as residential and commercial property across North and East Devon. \nEstates Surveyor Clare James said: \"Stantyway presents an incredibly rare opportunity for a new farmer to farm on the estate. Most farms are passed down the generations and it's not often that one becomes available. We hope to encourage entrepreneurial farmers in East Devon and beyond to bid for the chance to join us. \n\"We are very proud of the close and enduring relationships we have with our tenant farmers and, in many cases, we work with them to support their business aspirations, whether it's in terms of investment or diversification goals.\" \nStantyway Farm is in an idyllic coastal location which is widely renowned as a breeding habitat for the Cirl bunting. Although the farm has organic status, the land and property details state that there is no requirement for the incoming tenant to continue farming organically. \nClinton Devon Estates commits to high environmental standards and regards itself and its farmers as custodians of the natural environment. \nClare said: \"Stantyway Farm is an excellent example that farming with high conservation standards can be achieved in a sustainable way, benefitting wildlife, the landscape and the local community. \nWith Brexit approaching, and the end of Britain's promise to match the EU's farming subsidies scheme set for 2020, Clinton Devon Estates hopes that its new tenant farmer will be \"eco-conscious in their approach to farming, but of a resilient disposition\". \nIn total, UK farmers receive around £3bn a year in subsidies, including £700m for agri-environment schemes. What will replace these essential payments when Britain leaves the Bloc is subject to much speculation. \nClinton Devon Estates' Head of Property and Land, Leigh Rix said: \"We believe that the current basic payment subsidy which is based on farm size is likely to switch over to a conservation related subsidy which encompasses the sustainable soil and water management of the land as well as other public goods and services. \n\"Conservation and protecting our environment is incredibly important to the estate. You can't farm successfully unless you maintain these scarce resources. \n\"In addition to this, our climate is changing and we've seen evidence of it again this spring, where we had two months of virtually no rain; so an innovative and resilient attitude in our farmers in the face of Brexit and climate change is going to be more important than ever.\" \nStantyway Farm includes a recently refurbished four-bedroom detached farmhouse and a range of modern, well-kept farm buildings on an easily accessible yard. Harvesting is due this summer, after which it will be left as grassland and stubble for the new tenant in September. \nTwo viewing days are being held in June and sealed tenders to rent the farm must be made by 12 noon on Monday, July 10. For further information please visit clintondevon.com . Read more property news:", "external_links": [], "published": "2017-05-11T22:08:00.000+03:00", "crawled": "2017-05-11T18:11:26.000+03:00", "highlightTitle": ""}