{"organizations": [], "uuid": "c886cd1db26ed67635939b0b5a34cf1f32b42f14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13032423.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-nhs-unemployment-key-issues-13032211", "country": "GB", "domain_rank": 21960, "title": "Brexit, the NHS and unemployment - key issues for North East voters in the General Election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-14T23:00:00.000+03:00", "replies_count": 0, "uuid": "c886cd1db26ed67635939b0b5a34cf1f32b42f14"}, "author": "Keiran Southern", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-nhs-unemployment-key-issues-13032211", "ord_in_thread": 0, "title": "Brexit, the NHS and unemployment - key issues for North East voters in the General Election", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "berwick-upon-tweed", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "general election", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOur exclusive poll reveals what voters are most concerned about as they prepare to head to the ballot box for June 8’s General Election . \nAs well as asking voting intentions - with some interesting results - we also asked which issues were the most important when considering which party to vote for. \nWe asked about national issues and local issues as well as specifically what they felt about the importance of devolution of power to the region . Which of these local issues will influence how you vote? Nissan's plant in Sunderland (Photo: Owen Humphreys/PA Wire) \nMore than 7,000 people were asked what local issues would influence who they would vote for in the General Election. \nRespondents were given the choice of the threat of Brexit to Nissan staying here, dualling the A1 north of Newcastle, unemployment higher here than anywhere else, council funding cuts, cuts to social care, the importance of the EU funding and exports and none of the above. \nAcross the North East, council funding cuts was the biggest concern, with around one third saying it would impact on who they elected. \nThe social care crisis followed close behind to be the second largest issue, slightly ahead of unemployment levels. \nUnsurprisingly, voters in Sunderland showed a higher concern about the threat of Brexit to the city’s Nissan plant, with 27.4% admitting the issue will affect who they vote for. Read More Which of these national issues will influence how you vote? The Union flag and the EU flag flying (Photo: PA) \nAgain, we polled more than 7,000 people, this time asking what national issues would affect who they would vote for in the General Election. \nWe gave them the choice between immigration, education, health/NHS , economy, Brexit, jobs and none of the above. \nThe NHS topped the poll, with around half of those who responded saying it would play a part in who they elect to Parliament. \nNext came the economy, with around 40% of voters saying it will influence their decision on June 8. \nThis was followed closely by Brexit. \nAcross the region, voters in Berwick-upon-Tweed were most concerned with Brexit, with 48.8% saying it will influence who they vote for. Devolution - the big local issue \nRegional devolution has been a big issue across the country in recent years - but it won’t be high on voters’ agendas for the General Election. \nJust over a quarter of the more than 7,000 people we asked said it should be an issue for General Election candidates. Like us on Facebook", "external_links": [], "published": "2017-05-14T23:00:00.000+03:00", "crawled": "2017-05-14T19:22:40.000+03:00", "highlightTitle": ""}