{"organizations": [], "uuid": "35348f9adf65ec5cbae78d96ade22c6ad364b97d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12974405.ece/ALTERNATES/s1200/CFR_NJL_020517sandman_01.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-success-sandman-hotel-group-12974391", "country": "GB", "domain_rank": 21960, "title": "Newcastle success for Sandman Hotel Group triggers UK expansion plans", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle success for Sandman Hotel Group triggers UK expansion plans", "spam_score": 0.0, "site_type": "news", "published": "2017-05-02T20:18:00.000+03:00", "replies_count": 0, "uuid": "35348f9adf65ec5cbae78d96ade22c6ad364b97d"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-success-sandman-hotel-group-12974391", "ord_in_thread": 0, "title": "Newcastle success for Sandman Hotel Group triggers UK expansion plans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle success for Sandman Hotel Group triggers UK expansion plans The Sandman Signature Hotel close to St James' Park was the company's first in the UK at the former Scottish and Newcastle headquarters Share Left to right: Jane Meikle, Sintons; Mitch Gaglardi, Sandman Hotel Group; Alok Loomba, Sintons; Christopher Dixon, AIB (Photo: sintons) Share Get business   Thank you for subscribing!   \nA hotel group which selected Newcastle to become the base of its first venue outside Canada is eyeing further UK expansion following a multimillion-pound finance deal overseen by North East law firm Sintons. \nSandman Hotel Group transformed the former Scottish and Newcastle HQ in the heart of Newcastle into the Sandman Signature hotel in its first foray into the UK back in 2011. \nNow the firm, which also owns a hotel at Gatwick, is scouring the UK for new sites to open, backed by an eight-figure refinancing package with Allied Irish Bank (GB). \nThe family-owned business, which is the leading hospitality group in Canada more than 40 leisure venues across the country, is currently investing over £20m in its third UK hotel in Aberdeen, creating over 200 jobs. \nMitch Gaglardi, director of Sandman and whose family have owned and run the business since establishing its first site over 40 years ago, said the huge success of its Newcastle hotel has been a key factor in the group’s ongoing UK expansion plans. \nSince first purchasing the Newcastle site in 2009 ahead of its redevelopment, Sandman has been supported by Newcastle law firm Sintons, and has recently secured refinancing from Allied Irish Bank (GB) to help it push on with its ambitions. \nMr Gaglardi said: “We have plans to expand further in the UK - we are looking at a number of sites and have a few irons in the fire. \n“We have successfully been operating here for a number of years now in Newcastle and at Gatwick and the time is right to build on that. \n“Our Aberdeen development is a serious investment and will be a legacy property for us, one that takes us into another new part of the UK. Read More Business groups warn that skills and recruitment are key for UK future \n“Our Newcastle hotel continues to be a huge success and was a great first step into the UK for us. It’s a fantastic city and it’s good to continue to work with specialists there.” \nSintons is Sandman’s long-standing UK advisors, with commercial partner Christopher Welch and real estate partner Alok Loomba having acted for the business on a number of transactions since 2009. Jane Meikle, head of banking at Sintons, oversaw the recent refinancing from AIB (GB). \nMr Loomba said: “This is another significant transaction we have completed for Sandman Hotel Group to help them further their ambitions within the UK. Read More Business Breakfast RECAP: Juncker '10 times more sceptical' after Brexit talks with PM, report claims \n“We are very pleased to be able to work with Mitch and Sandman Hotel Group to support them in another big step forward for the business.” \nChris Dixon, relationship manager from AIB (GB), said: “Sandman Hotel Group brings a wealth of experience to the task of delivering their exciting plans for the North East and several other parts of Britain. \n“We are very pleased that our track record of meeting the complex banking needs of ambitious hotel and hospitality companies has led to an invitation to join the Sandman team on the next stage of their journey.” Like us on Facebook", "external_links": [], "published": "2017-05-02T20:18:00.000+03:00", "crawled": "2017-05-02T16:17:25.000+03:00", "highlightTitle": ""}