{"organizations": [], "uuid": "7daab3a301c49c7a0d44e2b55efc9afcf36f3759", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30347049/16012337.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/devon-needs-an-energy-policy-to-match-the-region-s-needs/story-30347049-detail/story.html", "country": "US", "title": "Devon needs an energy policy to match the region's needs | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.613, "site_type": "news", "published": "2017-05-22T23:50:00.000+03:00", "replies_count": 0, "uuid": "7daab3a301c49c7a0d44e2b55efc9afcf36f3759"}, "author": "Western Morning News", "url": "http://www.devonlive.com/devon-needs-an-energy-policy-to-match-the-region-s-needs/story-30347049-detail/story.html", "ord_in_thread": 0, "title": "Devon needs an energy policy to match the region's needs | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "richard lowes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "devon devon", "sentiment": "none"}, {"name": "penryn campus", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "university of exeter's energy policy group", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "ipsos mori", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Western Morning News | Posted: May 22, 2017 0 COMMENTS SHARES A solar farm in Devon Devon needs an energy policy to match the region's needs X \nCopy link to paste in your message / Comments (0) \nTake a look at the main issues that are high on the agenda for most voters ahead of the General Election, and it's unlikely that energy will feature prominently. \nA recent Ipsos MORI poll showed Brexit, understandably, leading the way, with health, the economy and both poverty and inequality recognised as being among the key areas of public concern ahead of polling day next month. Yet these central themes should act as a catalyst for placing energy issues at the very heart of the election trail. It affects each and every one of us through air pollution, the bills we pay, continued technological advancements and even the comfort we get from our homes and workplaces. \nInvestment in the energy infrastructure is particularly vital in Devon and Cornwall. The South West region has never held a major role in the UK's overriding energy system. Gas, electricity and vehicle fuel are primarily shipped via wires, pipes and tankers from the rest of the country to meet our needs. Much of this energy originates from further afield with half of our gas imported – primarily from Norway – and oil imports coming from wherever it's cheapest. \nWe tend not to use it well. The region suffers from the highest level of fuel poverty – people struggling to pay their bills – in England, due to a large proportion of energy inefficient houses, and high numbers of rural homes and buildings that are not connected to the main gas grid which can provide cheaper heating. Successive governments have failed to invest in delivering energy efficiency in buildings despite the fact that this often pays for itself. \nYet we are blessed with some of the UK's warmest, sunniest, and windiest weather – perfect for the development of locally-based renewable energy. Wind turbines and solar panels are becoming increasingly efficient and are proven to be more reliable than was expected, while the costs of renewable energy have plummeted with onshore wind now being built without any public subsidy and negligible costs to integrate it within the system. \nAnd yet both the coalition and the subsequent Conservative government acted as a brake on this rapidly developing industry. While there has been some growth in renewable electricity, more recent policy changes go against both growing public backing, and national need, for a sustainable, secure and cost-effective energy system. We have seen requirements for high-quality, energy-efficient new buildings cancelled, incentives to deliver small-scale renewable electricity through solar panels cut, and the growth in onshore wind, which now looks like the cheapest way to produce electricity, has been choked off through planning rules. \nWith the election just weeks away, and Brexit looming ever closer, it is imperative that we are shown clear policies which place energy transformation as central to the Government's plans for an 'industrial strategy'. The Conservatives have proposed an energy price cap for certain domestic customers on standard tariffs. This is hardly transformative and likely a retrograde step in an increasingly conscious consumer environment – it copies a Labour policy mooted almost five years ago. \nFor the South West to gain all the benefits which can be provided by new and clean technologies, we need a focus of policy from central government on delivering energy efficiency for households. We also need policies to provide financial certainty for those looking to produce and develop sustainable heat, power and transport as these technologies become cheaper and cheaper. And finally, local authorities need the ability to think about energy locally and invest themselves because it's clear that our centralised energy system with six big suppliers isn't suitable for the emerging decentralised and democratic energy future. \nSo how do the different parties approach energy? The Conservative's track record on energy is poor and they have said little other than mentioning the price cap. At the end of their time in power in 2010, Labour had made some good steps and do, despite appearing quiet on the issues, have plans to deliver a sustainable energy system. \nThe Lib Dems had some success when leading the energy department in the coalition government and support the move towards sustainable energy. The Green Party would like a rapid and complete conversion to renewable energy. Ukip want to scrap the already low VAT on energy bills and scrap VAT on takeaway food so that people can afford to 'heat and eat' – nothing sensible from them. \nThe current government has done little to support energy and consumers in the South West and it looks unlikely that this policy position will change without a different government – the likelihood of which is very uncertain. But no matter how you vote, you can still engage directly with your local MPs and councillors on these issues, which so many feel so strongly about. \nThe author, Richard Lowes, is a member of the University of Exeter's Energy Policy Group, based at the Penryn Campus in Cornwall READ NEXT", "external_links": [], "published": "2017-05-22T23:50:00.000+03:00", "crawled": "2017-05-22T18:46:28.000+03:00", "highlightTitle": ""}