{"organizations": [], "uuid": "51800931aa0125934b37e4a3dfd3883bfa981dda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article6717164.ece/ALTERNATES/s1200/JS30439442.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/rest-eu-dont-give-twig-13042074", "country": "GB", "domain_rank": 21960, "title": "The rest of the EU don't give a twig about the size of Theresa May's majority", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-17T01:00:00.000+03:00", "replies_count": 0, "uuid": "51800931aa0125934b37e4a3dfd3883bfa981dda"}, "author": "Kate Thick", "url": "http://www.chroniclelive.co.uk/news/news-opinion/rest-eu-dont-give-twig-13042074", "ord_in_thread": 0, "title": "The rest of the EU don't give a twig about the size of Theresa May's majority", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "kate thic", "sentiment": "negative"}, {"name": "alan beith", "sentiment": "none"}, {"name": "lord beith", "sentiment": "none"}, {"name": "joan of arc", "sentiment": "none"}, {"name": "alan", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "tuc", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "labour council", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion The rest of the EU don't give a twig about the size of Theresa May's majority Kate Thick says that young people in Britain must feel betrayed by what is going on in our country Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nI am not afraid … I was born to do this. So said Joan of Arc. Best meteoric May resists ruling by decree from her Westminster bunker or wagging her finger at the EU27. \nI asked Alan Beith, formerly Berwick upon Tweed’s MP, now Lord Beith, for his response to news of the election. \n“Theresa May said five times that she was against having an early election – it is purely in the hope of party advantage that she has called it, and in doing so she has already undermined her claim to be someone who keeps her word and puts the national interest first.” \nA memorable news article earlier this week said most lawyers want human rights to be inalienable and universal, and not subject to somebody’s election manifesto. \nAlan said there were quite a few battles with May in the Coalition. “As Home Secretary she was not an instinctive defender of civil liberties. Liberal Democrats have a defining commitment to freedom in its broadest sense – not only civil liberties but also access to good education, health care and jobs, without which civil freedoms cannot be fully enjoyed. The danger in this election is that if people don’t back Lib Dems, there will be no effective opposition and Britain will be run like a one party state.” Read More Why the collapse of UKIP could lead to a Conservative breakthrough in the North \nThe EU27 countries don’t give a twig about the size of May’s parliamentary majority. This is not a war, Mrs May. The EU’s position has been consistent. We are not victims, we started this process voluntarily. The outcome could make or break the British economy for decades but the government has no intention of putting the terms of Brexit to the public. This election must ensure this does not happen. Alan described Brexit as a slow burning fuse. “The worst effects will not be felt until well after the negotiations are over, and they will hit particularly hard some of the less well off who voted for it because they felt let down by successive governments.” \nThe UK has some deep economic problems, from chronically weak investment to profound regional imbalances and a persistent trade deficit. Working families are going to struggle; if May doesn’t significantly shift tactics through this election, a raft of changes to tax and benefits will hit those at the bottom hard. \nIs May prepared to explain the cause of low wages and the crisis of our public services, and why the easy answer of migration bans do more harm than good? \nImmigration has put the question of national identity at the heart of politics. Migration is not to blame for low wages and May knows it. Even before we leave the EU, firms are reporting skills shortages across a range of roles, including engineers, builders, IT specialists, doctors, care workers and accountants. \nThe angry, the alienated; how do we convince them Europe is part of the solution, that the main cause of their problems stem from decades of failed domestic policies and exploitative big business? Job losses and factory closures linked to globalisation will continue to fuel support for European populists. The EU is pressing for tougher world trade rules in a fresh effort to fend off the inequalities of globalisation seized on by hard-right nationalists. The European Commission wants stronger global rules to promote trade fairness while urging EU member states to bolster innovation and education. Read More I don't expect to agree with 100% of my party's manifesto; no politician should \nAfter financial services, higher education makes the second largest contribution to our net balance of payments. With fewer visas on offer, immigration priorities will crowd out those wanting to stay in the UK after graduation. Creators of wealth, including crucial new businesses and the highly skilled, will go to more hospitable countries for their education. \nNewcastle University is the fourth largest employer in the North East and accounts for 6% of all jobs in Newcastle. The university’s UK and international students have significant spending power; in 2014-15, they spent an estimated £240m in the North East outside of the university campus. \nAlan feels both Labour and the Conservatives have let the North East down. “Other areas like Manchester and Cornwall are getting extra powers, but squabbling Labour Council leaders and Tory ministers insisting on a single mayor for the region have made sure that we are not getting those powers to tackle the needs of our region.” \nThe TUC has called on political parties to spell out plans to spread prosperity to all Britain’s regions after warning that economic activity is becoming ever more concentrated down south. An industrial strategy that delivers good jobs where they’re needed most is pivotal. \nThe young in Britain must feel betrayed; the inflation-adjusted hourly pay of those aged 22-29 is still 10% below what it was in 2008, and one in 10 under-25s works part-time. They must find their political voices before it is too late. \nPolitics is brutal but we no longer burn people at the stake. If May’s ruthless party politicking prevails above the needs of the country, we must swiftly usher her on to the down escalator. Like us on Facebook", "external_links": [], "published": "2017-05-17T01:00:00.000+03:00", "crawled": "2017-05-16T20:10:17.000+03:00", "highlightTitle": ""}