{"organizations": [], "uuid": "19528701fba3210fddde1381b5ee551492dcb82c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.liverpoolecho.co.uk/incoming/article13002655.ece/ALTERNATES/s1200/15270495-1.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-reaction-immigration-falls-13090507", "country": "GB", "domain_rank": 21960, "title": "North East reaction as immigration falls and EU migrants stay away from the UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-25T23:00:00.000+03:00", "replies_count": 0, "uuid": "19528701fba3210fddde1381b5ee551492dcb82c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-reaction-immigration-falls-13090507", "ord_in_thread": 0, "title": "North East reaction as immigration falls and EU migrants stay away from the UK", "locations": [], "entities": {"persons": [{"name": "shirley atkinson", "sentiment": "none"}, {"name": "tony stevenson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "paul carbert", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk news north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "border force", "sentiment": "none"}, {"name": "university of sunderland", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East reaction as immigration falls and EU migrants stay away from the UK New figures show immigration has fallen but it's still much higher than the Government's target to get the number below 100,000 Share A Border Force officer checking passports Share Get   \nThousands of Europeans have left the UK since the Brexit referendum vote, new official figures have revealed. \nAnd the number of migrants coming in to the country from the European Union has also fallen. \nIt means the net migration figure for 2016 was 248,000 - down by 84,000 people compared to the year before. \nBut migration is still far higher than the Government’s target, which is to get the number down below 100,000. \nConservative leader Theresa May has said her Government will continue trying to cut immigration to the target figure, if her party wins the general election . \nNet migration is the difference between the number of people coming in to the UK and the number leaving. Conservative leader Theresa May (Photo: Daily Mirror) \nThere were actually 588,000 immigrants coming in to the UK in 2016, according to the Office for National Statistics, and 339,000 people left the country. \nMore EU citizens left than previously. The number of EU citizens leaving the UK was up by 31,000 people compared to the year before. \nAnd the number of migrants from EU countries was down by 43,000 people. \nThe data covers the six month period after least year’s referendum in which the UK voted to leave the EU, as well as the six months before \nAs in previous years, more migrants came to the UK from outside the EU than from EU countries. \nThe most common reason for moving to the UK was to work. The figures show 180,000 people came here because they had a job, and 95,000 people came without a job but because they wanted to look for work in this country. \nStudents made up 136,000 migrants. A total of 9,634 people were granted asylum or an alternative form of protection in the year ending March 2017. \nNorth East business leaders warned earlier this month that employers need immigrant workers. \nPaul Carbert , North East England Chamber of Commerce policy adviser, said: “Our members want to see flexible migration rules that allow businesses in our region to retain and compete for highly skilled overseas talent. Paul Carbert, policy advisor, North East England Chamber of Commerce (Photo: handout) \n“Building and maintaining our overseas links is a key priority to help create a Global North East. \n“Our five world-class universities attract international students and staff who bring enormous economic, societal and cultural benefits to the region, and this must not be put under threat by Government attempts to reduce net migration. \n“Any future reform of migration or visa policy should take into account the specific needs of the North East region.” Read More PM Theresa May committed to reducing net migration \nNorth East universities have also warned that Brexit is discouraging EU students, who are included in the immigration figures, from coming to the UK. \nShirley Atkinson, Vice-Chancellor of the University of Sunderland, told a House of Commons inquiry that the UK was giving the impression EU students and staff were not welcome. Shirley Atkinson, Vice-Chancellor of the University of Sunderland (Photo: Handout) \nShe said: “There is a wider issue about the reputation of British universities in the world now as a result of the Brexit vote.” \nProfessor Tony Stevenson, Deputy Vice-Chancellor of Newcastle University, told the inquiry: “If you look at the immigration policy and the mood music and the perception in markets out there that are receiving all of that, they do not see Britain at the moment as a welcoming place, despite the rhetoric from Government.” Like us on Facebook", "external_links": [], "published": "2017-05-25T23:00:00.000+03:00", "crawled": "2017-05-25T18:18:51.000+03:00", "highlightTitle": ""}