{"organizations": [], "uuid": "69aef98ff2c9bc2c4d3f4a0c78510bb392a77f76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30309828/15984659.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/why-theresa-may-will-not-be-visiting-exeter-on-the-campaign-trail/story-30309828-detail/story.html", "country": "GB", "title": "Why the political map of Devon will remain unchanged", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Why the political map of Devon will remain unchanged", "spam_score": 0.0, "site_type": "news", "published": "2017-05-03T21:30:00.000+03:00", "replies_count": 0, "uuid": "69aef98ff2c9bc2c4d3f4a0c78510bb392a77f76"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/why-theresa-may-will-not-be-visiting-exeter-on-the-campaign-trail/story-30309828-detail/story.html", "ord_in_thread": 0, "title": "Why the political map of Devon will remain unchanged", "locations": [], "entities": {"persons": [{"name": "alison hernandez", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "iain dale", "sentiment": "none"}, {"name": "tory derek thomas", "sentiment": "none"}, {"name": "tory oliver colville", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "sutton", "sentiment": "none"}, {"name": "kevin foster", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}, {"name": "lib dem andrew george", "sentiment": "none"}, {"name": "dale", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "jonny mercer", "sentiment": "none"}, {"name": "tamar", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "devonport", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "west cornwall", "sentiment": "none"}, {"name": "newquay", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "moor view", "sentiment": "none"}], "organizations": [{"name": "commen", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "st austell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why the political map of Devon will remain unchanged By WMN_PGoodwin | Posted: May 03, 2017 3 COMMENTS SHARES Mrs May need not worry about Devon, according to one blogger Why the political map of Devon will remain unchanged X \nCopy link to paste in your message / Comments (3) \nThe political map of Devon will remain unchanged on June 9, according to a top Tory blogger, \nPolitical analyst Iain Dale, whose blog Dale's Diary has been going for 15 years, says the county's 12 MPs will all be returned to parliament. \nNational opinion polls are predicting a Conservative landslide – in Devon there may be little more than a gentle tremor. \nDale's prediction for the 12 seats in Devon is eleven Tory holds and a victory for Labour's Ben Bradshaw in Exeter. \nVoters in Devon and Cornwall got their first taste of Theresa May's tightly stage-managed campaign and its relentless sound bites yesterday. \nObviously, her choice of destination was no accident with a keen eye on marginal seats. \nShe took in a West Cornwall seat threatened by Lib Dem Andrew George, who won four elections prior to losing to Tory Derek Thomas in 2015. \nFurther north in the Duchy Steve Double - newly-elected in Newquay and St Austell in 2015 with a majority of 8,173 but criticised locally for an extra-marital affair - also received a visit. \nAcross the Tamar she toured Plymouth with former Army captain and Tory MP Jonny Mercer, whose 1,026 majority in Moor View faces renewed pressure from Labour, who held it prior to 2015. \nMrs May's visit to the homes of Armed Services families was designed to play directly to any military folk wavering ahead of the poll. \nIt would also hope to help Tory Oliver Colville in Sutton and Devonport, whose majority of 523 is the slenderest in the entire region. \nMathematical analysis would suggest a visit to Torbay's Kevin Foster, who will be slightly nervous at defending a majority of 3,286 against the resurgent Lib Dems who hope to win it back. \nHowever, the focus of the investigation into election expenses on the seat, where police and crime commissioner Alison Hernandez, as election agent, and Foster, as MP, are both facing potential charges, may have made that visit less than perfect. \nGiven the polls, the eight seats outside Plymouth, Torbay and Exeter, are dyed-in-the-wool Tory and are unlikely to require a heavyweight visit from the leader to rally the troops. \nIf Dale's predictions are correct, voters in Exeter are unlikely to catch a glimpse of Mrs May, disappearing into a behind-closed-doors rally or emerging to speed away in a Government car. \nMr Bradshaw believes the seat he has held since the Labour landslide of 1997 is under threat. \nHis opponent is to be revealed at the weekend after the only opposition candidate selection meeting in Devon . \nHe told Devon Live last week: \"The simple brutal answer is the Conservatives see the chance to turn a working majority into a landslide. \nIf the opinion polls are right (and remember, whenever they've been wrong before, they have underestimated the Conservative lead) we're looking at a rout. \n\"On the current national polling, the Tories would take back Exeter – leaving the South West a one-party state.\" \nIt is worth considering that for a moment. No MP from our region to challenge Government policy on the NHS, schools or other public services. No-one to hold them to account for all the promises they made in 2015 of lavish investment in the Westcountry, which they've failed to keep. No-one to stand up for jobs, investment and living standards and the importance of continued full access to the Single Market and Customs Union in any Brexit deal. \n\nRead: Five questions we would ask Theresa May if she showed up in Exeter", "external_links": [], "published": "2017-05-03T21:30:00.000+03:00", "crawled": "2017-05-03T19:43:59.000+03:00", "highlightTitle": ""}