{"organizations": [], "uuid": "5d1f3f0fcad488f17012c4c6afd4303263ee8fb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30364745/16025331.jpg", "site_section": "http://www.middevongazette.co.uk/entertainment-news.rss", "section_title": "Devon Live Entertainment News RSS feed", "url": "http://www.devonlive.com/georgia-toffolo-and-jack-monroe-go-on-a-political-blind-date/story-30364745-detail/story.html", "country": "GB", "title": "Watch Made in Chelsea's Georgia Toffolo and blogger Jack Monroe...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-31T22:36:00.000+03:00", "replies_count": 0, "uuid": "5d1f3f0fcad488f17012c4c6afd4303263ee8fb7"}, "author": "DanielClark", "url": "http://www.devonlive.com/georgia-toffolo-and-jack-monroe-go-on-a-political-blind-date/story-30364745-detail/story.html", "ord_in_thread": 0, "title": "Watch Made in Chelsea's Georgia Toffolo and blogger Jack Monroe...", "locations": [], "entities": {"persons": [{"name": "dan", "sentiment": "none"}, {"name": "jack monroe", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "georgia toffolo", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "katie hopkins", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "brexit  jack", "sentiment": "none"}, {"name": "toff", "sentiment": "none"}, {"name": "jeremy cobryn  georgia", "sentiment": "none"}], "locations": [{"name": "georgia toffolo", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "victoria derbyshire", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}], "organizations": [{"name": "chelsea", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "women's equality party", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "torquay girls' grammar school", "sentiment": "none"}, {"name": "on social welfare  georgia", "sentiment": "none"}, {"name": "national health action", "sentiment": "none"}, {"name": "on tax  georgia", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "university of westminster", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Watch Made in Chelsea's Georgia Toffolo and blogger Jack Monroe discuss their political views By DanielClark | Posted: May 31, 2017 3 COMMENTS SHARES Comments (3) \nMade in Chelsea star Georgia Toffolo and blogger Jack Monroe were sent on a political blind date by the BBC's Victoria Derbyshire programme to discuss their differing political ideologies. Georgia, 22, from Torquay, comes from a more privileged background and is a member of the Conservative Party, while at one time Jack was unemployed and unable to afford food. \nJack hit the headlines after Exeter's Katie Hopkins was ordered to pay £24,000 damages to the writer at the end of a case dubbed \"Twibel\" by media pundits. \nThe former Apprentice star, who faces a costs bill running into six figures, was also ordered to pay £107,000 on account within 28 days. \nGeorgia, a former Torquay Girls' Grammar School pupil, who is now studying Politics at the University of Westminster, sits on the right of the political spectrum, while Jack sits on the left. \nThe pair on the opposite sides of the political debate sit down for dinner to debate their views. \nJack said: \"I used to be a 999 call-handler. I got pregnant with my son, and when I went back to work I couldn't work the shift patterns any more. I ended up in a shoddy personal situation - I didn't eat for three days in a row to feed my child. I started to write about being a single mum on the dole and it seemed to strike a chord with people. Then I got offered a recipe book deal and life went stratospheric. \n\"I've been a member of the Labour Party on and off for the past few years, about six or seven years, eight maybe. I've also been a member of the Green Party at that time. I'm also a member of the Women's Equality Party and the National Health Action party.\" \nGeorgia said: \"I'm very lucky I went to a nice school and I live in a very lovely part of London. I'm a member of the Conservative Party and I have been for about eight years now. I believe that the traditions of our country should be upheld and I'm a real advocate of business. I can't comprehend why someone my age would support the Labour Party.\" \nHERE IS A SUMMARY OF THEIR VIEWS \nON BREXIT \nJack said that she spoiled her ballot while Georgia said that we were lucky to have the vote. She said that she voted to remain, but that she wished she voted to leave and that leaving the EU will be a positive thing for the country. \nON SOCIAL WELFARE \nGeorgia said that the Conservatives have done a great job in scaling back welfare payments and that seeing people sign on when they could work angers her, but Jack said that she knows people who have had their support cut left, right and centre and she was in that situation where she was freezing, starving, not had heating turned on for three days. \nON TAX \nGeorgia said that a flat rate of tax is a much better option as if you work really hard but just flip into a new tax bracket, it as if the government are punishing you for doing well, and if you work hard in this country, then you do earn well. But Jack said that everyone needs a certain amount to live on and that lots of people work hard but don't earn a lot. She added: \"Why should the healthcare assistant who wipes arses be on £11,000 a year and the guy who was basically born into a banking role be on ten times as much. I don't think that hard work and income are equivalent.\" \nON FOX HUNTING \nJack said that it is awful and if someone came up with it now as a sport to get a pack of dogs to chase through the woods after an animal, they would be tried and go to prison for it as we would see it as barbaric. But Toff said that foxes are out of control and affect farmers and that it is a great old British tradition. \nON LEGALISING CANNABIS \nGeorgia said that it is an addiction and a drug and does cause mental problems and that she would find it deeply distressing if it was to be made legal here. But Jack said that she is a recovering alcoholic and used to drink a bottle of whisky in the evening, and she would have done a lot less damage to herself if she could have just had a spliff. \nON SECURITY \nBut Toff and Jack agreed that if something is helping to keep us save then it is okay for us to be watched. \nON JEREMY COBRYN \nGeorgia said his leadership has been a shambles and that it is a shame that he is the leader of the Labour Party. She said that he is a non-functioning leader and as a Tory it is great for her. But she added that the party in power should be scrutinized and held to question and she worries that the Labour Party isn't doing that. Jack said that Jeremy was a very good campaigner and a very good back bench MP, but that her vote for Labour is for good Labour MPs and a political ideology rather than for Corbyn. \nAfterwards Jack said: \"We both seemed to have shifted slightly closer to the centre by the end of lunch. I don't think she'll be going home and telling all her friends to vote for Jeremy Corbyn but I'd like to think that we've both given each other something to think about. \n\"I think my views are quite strongly held. I wouldn't say that she'd drastically changed my mind about anything but it certainly put a human face to some of the things that I consider to be more radical Conservative beliefs.\" \nGeorgia said: \"I actually agreed with her a lot on our views on national security. We also agreed on LGBT rights, which is fantastic.The thing that angered me the most is our differing views on tax. I just cannot comprehend how anyone could have her views on taxation. The lower the better. \n\"I think I did convince her a little bit because when we looked at our political spectrum again she moved a little bit more centre.\" \nShe said: \"She did say a few things that hit home a bit and it was quite thought provoking after often we can be politically ignorant.\"", "external_links": [], "published": "2017-05-31T22:36:00.000+03:00", "crawled": "2017-05-31T19:11:34.000+03:00", "highlightTitle": ""}