{"organizations": [], "uuid": "a0c9f60fb5ac1fc0ad9f54016b2f9a44cf768750", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13107645.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/corbyn-project-continue-vows-labours-13107561", "country": "GB", "domain_rank": 21960, "title": "The 'Corbyn project' will continue, vows Labour's election coordinator Ian Lavery", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-30T15:00:00.000+03:00", "replies_count": 0, "uuid": "a0c9f60fb5ac1fc0ad9f54016b2f9a44cf768750"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/corbyn-project-continue-vows-labours-13107561", "ord_in_thread": 0, "title": "The 'Corbyn project' will continue, vows Labour's election coordinator Ian Lavery", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "negative"}, {"name": "ian lavery", "sentiment": "negative"}, {"name": "ian lavery the north eas", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "lavery", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "wansbeck", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "invalid email  labour", "sentiment": "none"}, {"name": "ms may", "sentiment": "none"}, {"name": "getty images europe", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "sunday times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The 'Corbyn project' will continue, vows Labour's election coordinator Ian Lavery The North East politician running Labour's election campaign says the new policies and direction set by Jeremy Corbyn will continue Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour is changing British politics and the process will continue after the general election, election coordinator Ian Lavery said. \nMr Lavery, the party’s candidate in Wansbeck, said the “Corbyn project” would continue after the election. \nLabour’s campaign has enjoyed a boost as opinion polls suggest the gap with the Conservatives is closing, although the Tories still appear to be in the lead in the run-up to the June 8 general election. \nMr Lavery appeared to suggest that the policies and direction of the party would continue regardless of the outcome. \nSpeaking before Mr Corbyn at a rally in Glasgow, he said: “People don’t want austerity, people have had enough of cuts. Today’s economy is completely fractured – it’s broken, it only serves the rich and the wealthy and we’ll change that. \n“We want change that and we’re in the process – it will be a long, long, long process, of changing politics in Britain. Whatever happens at the election isn’t the end of the Corbyn project, it’s only the beginning of the Corbyn project.” Ian Lavery (Photo: Getty Images Europe) \nWhen Conservative leader Mrs May decided to call an early general election, she said she needed a mandate to negotiate a Brexit agreement for the UK. But many people thought the decision was also due to opinion polls giving the Tories a massive lead, which meant she might win a landslide victory and gain seats in the North and the Midlands. \nHowever, the Conservative poll lead has fallen significantly since then. One ORB poll for the Sunday Telegraph put Ms May’s party just six points ahead of Labour, and another by YouGov for the Sunday Times put the gap at seven points. \nIt may be a result of the Conservatives’ botched manifesto launch, which included plans to make some elderly people pay far more for social care at home, possibly forcing them to sell their house. Critics called this a “dementia tax”, and Mrs May announced a partial u-turn days later. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIt’s also possible that support for Labour leader Jeremy Corbyn has grown as people see more of him. \nWhatever the cause, Conservatives will this week attempt to get their campaign back on track with a firmer focus on Brexit and the question of who is the best person to lead the UK. \nBut Labour are highlighting Mrs May’s refusal to take part in a head-to-head TV debate with Mr Corbyn. \nLabour Deputy Leader Tom Watson accused the Prime Minister of showing “contempt for voters” by refusing to take part in a proper debate, the Guardian reports. Read More A week we will never forget: How everything changed for parents after the Manchester attack \nHe said: “The more they avoid exposing the deficiencies of Theresa May to public scrutiny, the more people are beginning to realise that she’s not up to the job. \n“You’ve only got to look at her handling of the dementia tax issue to know what a poor negotiator she is.” \nLabour has called on Mrs May to answer “the most basic questions” about her plans for social care, tax and public services. Like us on Facebook ", "external_links": [], "published": "2017-05-30T15:00:00.000+03:00", "crawled": "2017-05-30T11:48:53.000+03:00", "highlightTitle": ""}