{"organizations": [], "uuid": "37907280a61d231e874d5be03cc9b5871cffe8b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.6491527.1495188268!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "http://www.bostonstandard.co.uk/news/general-election-boston-and-skegness-candidates-talk-brexit-1-7968907", "country": "GB", "title": "GENERAL ELECTION: Boston and Skegness candidates talk Brexit", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-20T19:00:00.000+03:00", "replies_count": 0, "uuid": "37907280a61d231e874d5be03cc9b5871cffe8b6"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/general-election-boston-and-skegness-candidates-talk-brexit-1-7968907", "ord_in_thread": 0, "title": "GENERAL ELECTION: Boston and Skegness candidates talk Brexit", "locations": [], "entities": {"persons": [{"name": "matt warman", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "skegness", "sentiment": "none"}, {"name": "victoria percival", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "paul kenny", "sentiment": "none"}, {"name": "matt warman", "sentiment": "none"}, {"name": "paul kenny", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "philip smith", "sentiment": "none"}, {"name": "victoria percival", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "philip smith", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "mike gilbert", "sentiment": "none"}, {"name": "mike gilbert", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Have your say \nAhead of the election on June 8 we are asking each candidate – in 150 of their own words – to explain their stance on the major topics which affect your everyday lives. - this week, Brexit. \nThe nominations have closed...and we now know our next MP will be one of those featured on these pages. Mike Gilbert (Blue Revolution) \nSix candidates have put their names forward... but who will be victorious on election night? Your votes will decide. \nThis, we hope, will help inform your decision at the ballot box. \nToday, we start with Brexit. Over the coming weeks we will also look at education and health. \nThe Wednesday prior to the election we will also be giving the candidates one last chance to try to win your vote - as they address you directly telling you why you should put a cross at the side of their name. Matt Warman (Conservative) \nBut to have your say you must make sure you are registered to vote by 11.59pm on Sunday, May 22 - visit www.gov.uk/register-to-vote for more details. \nWe will then have reaction from the count at www.bostonstandard.co.uk \nHere’s what your candidates have to say (list in alphabetical order by party): \nMIKE GILBERT (BLUE REVOLUTION) – Brexit was necessary for us to regain control of our borders and bring sovereignty back to Britain. The EU is a bureaucracy with very poor democratic credentials. For the people in our area we felt like we were being ‘done to’ by faceless politicians who we could not hold to account. With the Brexit vote confirming Britain’s faith and belief in democracy, freedom and accountability we can struggle from under the dead weight of the EU and start to develop our economy and society as we want to rather than sitting around waiting directives from Brussels or Strasbourg. Youth unemployment, migration, the Euro, stagnating economies and indebtedness will create tensions that the EU will be incapable of dealing with. The EU is not ‘global’ in outlook it is a protectionist club for weak economies that hide behind the economic might of Germany. I am glad we are coming out. Victoria Percival (Green Party) \nMATT WARMAN (CONSERVATIVE) – I am confident that Britain can thrive outside the European Union, and that’s why I voted to trigger Article 50 in Parliament. Only a Conservative majority, with Theresa May as Prime Minister, will be able to deliver the best possible Brexit deal for Boston and Skegness. Strong and stable leadership will deliver control of our laws, control of our borders and an outward-looking, optimistic United Kingdom that stands tall on the world stage, trading globally and thriving economically. People tell me on the doorsteps how much they want this, as well as a strong economy to deliver the best local health services and local infrastructure. As your Conservative MP I will continue to represent these matters at the highest level in Westminster. A vote for any other candidate risks a dangerous coalition of chaos led by Jeremy Corbyn that puts our nation’s future at risk. \nVICTORIA PERCIVAL (GREEN PARTY) – I am sure all parties agree we need a healthy economy while Brexit happens, the end results should not leave people poorer. I would put the argument forward for a ‘green’ economy. This would be an investment in renewable energy, low carbon products and encouraging industry to look at ways to lower their impact on the environment. We could be at the forefront of a green revolution. Like the industrial revolution it would create skilled work, something Boston and Skegness desperately needs. Moving away from low skilled low paid jobs. With extra money in people’s pockets, this would create a disposable income, which would improve the retail industry and stop Boston losing trade to both Springfields and Lincoln. A green economy would not only produce skilled work and boost the local economy, it could also lower outgoings like energy bills. We need to be looking long term and not thinking in short fixes. \nPAUL KENNY (LABOUR) – Most people in Boston & Skegness voted to leave the EU. I fully respect that decision and accept we will see the end of free movement. I believe EU citizens already living and working here play an important role in our towns, they should not be used as pawns by political parties and should have services provided to help them to integrate fully. I believe that we need to protect all workers’ rights, local people should get first option of local jobs before other people are brought in, all jobs within the UK should be paid at a minimum of £10 per hour, zero hour contracts banned, people offered proper contracts of employment, employers or country of origin should pay contributions towards EU citizen’s health services with proper funding of all public services including the NHS instead of more privatisation. We need a Brexit for the many, not the few. \nPHILIP SMITH (LIBERAL DEMOCRAT) – I respect the outcome of the referendum in June, we are a more prosperous country when we are part of the world’s largest economy. Most people would agree free trade is a good thing. It creates jobs, increases prosperity and helps pay for the NHS, schools and public services. Business can only grow if we have free trade - that’s why if elected I would be fighting for Britain to remain a member of the Single Market. The British people voted to leave the EU but not for what the deal would be. I will be calling for the government to give the British people a vote on the deal that’s negotiated with Europe. The Brexit deal will have a huge impact on jobs, security and the opportunity to travel and live abroad. The government should be made to put their deal to the British people before it’s finalised. Paul Kenny (Labour) \nPAUL NUTTALL (UKIP) – Last year the people of Boston and Skegness voted overwhelmingly to take back control of their lives, their country and their borders by voting to Leave the European Union. In March this year as leader of the country’s only reliable Eurosceptic party I set down six key tests to ensure that Brexit really does means Exit. These tests include ensuring that Parliament becomes fully sovereign again, that we regain full control of our borders, that we take our seat again at the World Trade Organisation, that we don’t pay the EU a divorce bill and that our fishermen get a fair deal and are not sold down the river. There are already signs that an overwhelming Conservative majority in Parliament after June 8 will lead to backsliding, electing me as your UKIP MP will help ensure that the people of this constituency get the Brexit they voted for. Philip Smith (Liberal Democrat)", "external_links": [], "published": "2017-05-20T19:00:00.000+03:00", "crawled": "2017-05-20T18:03:48.000+03:00", "highlightTitle": ""}