{"organizations": [], "uuid": "7334078f3aa6c111c93b4e1f1e27a528e07c4c66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13024769.ece/ALTERNATES/s1200/The-UK-Hosts-The-2017-Somalia-Conference.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-insists-voters-wont-fooled-13024692", "country": "GB", "domain_rank": 21960, "title": "Labour insists voters 'won't be fooled' by Theresa May's plea for support in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-12T18:00:00.000+03:00", "replies_count": 0, "uuid": "7334078f3aa6c111c93b4e1f1e27a528e07c4c66"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-insists-voters-wont-fooled-13024692", "ord_in_thread": 0, "title": "Labour insists voters 'won't be fooled' by Theresa May's plea for support in the North East", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "tory  mrs may", "sentiment": "none"}], "locations": [{"name": "north east lab", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "north east news labour", "sentiment": "neutral"}, {"name": "labour", "sentiment": "neutral"}, {"name": "invalid email  labour", "sentiment": "none"}, {"name": "national education service", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour insists voters 'won't be fooled' by Theresa May's plea for support in the North East Labour hits back as Conservative leader makes an audacious bid for support in their traditional North East heartland Share Click to play Tap to play The video will start in 8 Cancel Play now Theresa May refuses to rule out cuts to disability benefit Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour say North East voters “won’t be fooled” by Theresa May’s plea for their support, as the Prime Minister launches an ambitious bid for a breakthrough in the region. \nMrs May is visiting the North East to urge working class voters who backed Labour “for generations” to switch to the Tories. \nBut Wansbeck MP Ian Lavery , Labour’s national campaign chair, described the visit as “farcical”. \nHe said: “This is nonsense. The wonderful people of the North East of England won’t be fooled by this farcical attempt by Theresa May to mask the damage her Tories have done to the lives of working people across the country. Ian Lavery (Photo: Daily Mirror) \n“Under the Tories working families are set to be an average of £1,400 a year worse off, real wages are lower now than they were in 2010 and nearly six million people are paid less than the living wage. All this while the few at the top have been given tax breaks worth tens of billions of pounds. \n“To be the party of working people would be the party to have established the NHS , introduced the minimum wage and now has a plan to introduce a £10 minimum wage and create a National Education Service. As the party of cuts to public services, the bedroom tax and a VAT rise, the Tories remain – as ever – a party of the few. Only Labour can be trusted to deliver a country for the many.” Prime Minister Theresa May (Photo: Getty Images Europe) \nThe Prime Minister’s visit reflects Conservative hopes that this could be the election when they make an historic breakthrough in the North of England, following their victory in the Tees Valley mayoral election. Read More Theresa May in North East to convince region's voters to turn Tory \nMrs May is to claim that Labour has deserted “proud and patriotic working class people” and will portray Labour’s leaked manifesto plans, including nationalising railways, energy supply and the mail service, as a return to “the disastrous policies of the 1970s”. \nShe will pledge: “If you put your trust in me, back me, I will strive to be a leader worthy of our great country.” \nThe Prime Minister will also reiterate that the election is a clear choice between her strong and stable leadership or the risk of having Jeremy Corbyn to lead Britain through the Brexit negotiations, adding: “Our future success and prosperity as a country depends on getting the next five years right.” \nAfter the speech Theresa May will be campaigning in the North of England as she seeks to win over voters. Read More", "external_links": [], "published": "2017-05-12T18:00:00.000+03:00", "crawled": "2017-05-12T14:28:18.000+03:00", "highlightTitle": ""}