{"organizations": [], "uuid": "d9da161eb3137da4241cc61221769c0a8ce51488", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30347212/16012502.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/road-blocked-following-collision-between-cyclist-and-skateboarder/story-30347212-detail/story.html", "country": "GB", "title": "Road blocked following collision between cyclist and skateboarder", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-23T00:11:00.000+03:00", "replies_count": 0, "uuid": "d9da161eb3137da4241cc61221769c0a8ce51488"}, "author": "RomPEllis", "url": "http://www.devonlive.com/road-blocked-following-collision-between-cyclist-and-skateboarder/story-30347212-detail/story.html", "ord_in_thread": 0, "title": "Road blocked following collision between cyclist and skateboarder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The cyclist is treated in the road Road blocked following collision between cyclist and skateboarder X \nCopy link to paste in your message / Comments (0) \nA cyclist has been injured after colliding with a skateboarder in Plymouth on Thursday afternoon. \nFerry Road, which leads to the Torpoint Ferry, is partially blocked in both directions between Park Avenue and John Street following the crash, which happened shortly before 4.30pm, reports the Plymouth Herald. \nAn eyewitness said the cyclist was lifted into a police car by police officers and taken to Derriford Hospital for treatment. \nIf the road remains closed it could potentially cause huge problems for commuters, as rush hour begins on Monday afternoon. \nTamar Crossings have said the priority lane is open to buses and bikes at the moment. Ferry: Priority lane now open for use of buses and bikes. \nA spokesperson for Tamar Crossings said: \"We are helping to redirect the traffic. \n\"The diversion is around the tower and into one of the overflow lanes. \n\"Pottery Road is closed off while police investigate.\" \nSee the live blog below for further updates Updating 16:35 PICTURED: Scene of crash in Plymouth \nA picture has been sent in of the scene of a crash in Plymouth this afternoon. \nThe crash took place on the A374 Ferry Road 16:35 PICTURED: Scene of crash in Plymouth \nA picture has been sent in of the scene of a crash in Plymouth this afternoon. \nThe crash took place on the A374 Ferry Road 16:18 Crash on busy Plymouth road \nThere are reports of a crash on the A374 in Plymouth. The crash, in Devonport is on the A374 Ferry Road between Park Avenue and John Street. 15:05 \nvia GIPHY \nIt's time for me to get rambling, as my doppleganger George Clooney might say, if he was battling hordes of blood-sucking vampires in a Mexican stripjoint. \nMy colleagues Jon Bayley and Charlotte Gosling are much less Clooney-esque than I am, but they'll be keeping the live blog running until dusk, and I'll be back at dawn - well, about 7ish, anyway. See you then 14:56 Firm responds to 'pub war' open letter as public meeting arranged \nThe firm slammed by a Plymouth pub tenant charged double the price for rent and beer as a rival just a few doors away has responded - as a leading pub campaigner is arranges a public meeting to discuss the issue. \nOn Friday, The Herald reported that the Post Office Inn in Plympton had declared war after finding out its neighbour, the Sir Joshua Reynolds gets half-price beer and rent from EI Publican Partnerships , the pub group which owns and leases both establishments. \nSpeaking to The Herald, a spokesperson for Post Office Inn stressed the letter and the A-board were not directed at the Sir Joshua Reynolds Pub, or its management, but were solely a criticism of EI Publican Partnerships. \nAs part of the lease deal, the tenants of both pubs must purchase their beer from EI Publican Partnerships, and pay the firm rent. \nA spokesman for EI Publican Partnerships, formerly known as Enterprise Inns, has now said: \"We offer a wide range of different business models across our pub estate. \n\"We are aware of the concerns of our publicans at The Post Office Inn at Plympton and we are in regular dialogue with them regarding their business performance and how we can assist them.\" Devonport gun drama suspect is being hunted by police \nPolice are continuing to hunt for a suspect following an assault in Devonport. \nOfficers found a pistol, believed to be an airgun, after an alleged assault at a property in Pembroke Street on on Saturday afternoon. \nPolice, backed by armed officers, searched several addresses in the area but the suspect was not found. \nA spokesman from Devon and Cornwall Police today said \"enquires are ongoing to locate the suspect\". Three fire crews attend gas leak in Plymouth 13:24 Traffic back to normal on M5 12:34 Police widen search in manhunt after armed robbery and cordon off second address \nPolice are now widening their search for an armed robber following searches of two houses in Hayle. \nEarlier this morning they were thought to be talking to him through a window of a house near the Spar shop that was robbed, trying to coax him out. \nHowever, police then moved their attention to another address and put a new police cordon in place. 12:15 All lanes on M5 re-open after crash - but delays remain 12:12 Is graffiti like this art or vandalism? \nA graffiti artist - or some would say vandal - in Plymouth is backing Labour ahead of the general election.The huge 'Vote Labour' slogan has been spray-painted on wall in Millbay, which has long been a favourite of budding-Banksys.The wall on Martin Lane, which run between Bath Street and Martin Street, has been covered in graffiti for many years - but this has now been all but covered up by the pro-Labour message. Traffic still queueing on M5 after crash \nLocation The M5 southbound between junctions J24 and J25 \nReason Congestion \nStatus Currently Active \nReturn To Normal Normal traffic conditions are expected between 11:45 and 12:00 on 22 May 2017 \nDelay There are currently delays of 30 minutes against expected traffic \nEarlier Reason Caused by an earlier accident Plymouth Graffiti artist backs Labour ahead of general election \nA graffiti artist in Plymouth is backing Labour ahead of the general election. \nThe huge 'Vote Labour' slogan has been spray-painted on wall in Millbay, which has long been a favourite of budding-Banksys. 11:12 Traffic still queueing on M5 between Taunton and Bridgwater after crash 11:04 Met Office says heatwave coming later this week \nThe Met Office is predicting some glorious weather later this week, with wall-to-wall sunshine and temperatures above 20c. \nWhile today will cloud over, and we could see some light rain on Tuesday and Wednesday, the forecast for Thursday and Friday is for it to turn drier and warmer with increasing amounts of sunshine. Today: \nA dry, bright and sunny start to the day. High cloud may turn the sunshine hazy at times, but in the light winds it will feel warm. Maximum temperature 21 °C. Tonight: \nStaying dry and mild overnight with some clear spells at first, before low cloud and coastal fog pushes in from the southwest during the early hours. Minimum temperature 10 °C. Tuesday: \nRemaining rather cloudy through Tuesday with some low cloud possibly bringing some light drizzle over the hills. Drier elsewhere with some bright spells. Not feeling as warm as today. Maximum temperature 19 °C. Outlook for Wednesday to Friday: \nPartly cloudy through Wednesday with light rain possible in places, before it turns drier and warmer with increasing amounts of sunshine. Very warm or hot away from south coast. Traffic still queuing on M5 after crash \nREAD MORE 10:30 Sausages could give you hepatitis because of 'Brexit virus', says Devon scientist \nEuropean sausages could give you hepatitis thanks to a mutant 'Brexit virus', claims a Devon-based scientist. \nThe new strain of hepatitis E (HEV) is being linked to pig farms in France, Holland, Germany and Denmark, it could land you with anything from nasty flu-like symptoms to something much more serious. \nPublic Health England says it has seen a surge in serious complications from the bug, with 1,244 cases last year. \nHEV used to spread from person to person and could be halted by better hygiene, reports The Mirror. But the mutant virus infects livestock too and scientists believe it now affects 10% of sausages. The bug is killed only by longer cooking times. \nDr Harry Dalton, a gastroenterologist at Exeter University, told a conference on neurological infectious diseases last week that HEV had become a major threat. \nHe said: \"I call it the Brexit virus. It attacks the liver and nerves, with a peak in May. It is particularly dangerous for people with suppressed immune systems such as those who have had organ transplants and possibly cancer. The virus seems to come from Europe,\" Dalton said. \nREAD MORE Traffic back to normal in Forder Valley \nB3413 FORDER VALLEY ROAD - PLYMOUTH - DEVON \nTraffic returned to normal on B3413 Forder Valley Road around B3432 Novorossisk Road. 10:24 Police have house under siege after armed robbery \nAn eyewitness has said a suspected armed robber is holed-up in house inj Hayle, Cornwall - armed trying to coax him out. \nREAD MORE 10:08 Schools 'in lockdown' as armed police swarm on shop after armed robbery \nSchools are are reportedly 'in lockdown' as armed police swarm on a shop following an armed robbery. \nThe drama has been sparked by an armed robbery at a Spar shop in Hayle, Cornwall, police have confirmed. As result, schools in the area have been placed on lockdown, with pupils being kept in classrooms, reports Cornwall Live. 09:56 Two lanes now open on M5, but long delays remain 09:48 Traffic still slow on Forder Valley Road \nB3413 FORDER VALLEY ROAD - PLYMOUTH - DEVON \nSlow traffic on B3413 Forder Valley Road around B3432 Novorossisk Road. \nHowever... traffic is back to normal on Tavistock Road and the A38 around Carkeel \nA386 TAVISTOCK ROAD - CROWNHILL - DEVON \nTraffic returned to normal on A386 Tavistock Road around Derriford Road / Looseleigh Lane / Brest Road (Derriford Roundabout). \nA38 - CARKEEL - CORNWALL \nTraffic returned to normal on A38 around A388 / B3271 Callington Road (Carkeel Roundabout). Load more", "external_links": [], "published": "2017-05-23T00:11:00.000+03:00", "crawled": "2017-05-22T21:05:37.000+03:00", "highlightTitle": ""}