{"organizations": [], "uuid": "4c6b10f535673aeb102543262dd6b8791c20c555", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30310825/15985683.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/labour-s-liz-kendall-launches-her-leicester-west-general-election-campaign/story-30310825-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Labour's Liz Kendall launches her Leicester West General Election...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published Labour's Liz Kendall launches her Leicester West General Election...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-04T00:29:00.000+03:00", "replies_count": 0, "uuid": "4c6b10f535673aeb102543262dd6b8791c20c555"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/labour-s-liz-kendall-launches-her-leicester-west-general-election-campaign/story-30310825-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Labour's Liz Kendall launches her Leicester West General Election...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Labour's Liz Kendall launches her Leicester West General Election campaign By danjmartin | Posted: May 03, 2017 0 COMMENTS SHARES Comments (0) \nLiz Kendall has launched her General Election campaign in Leicester West. \nThe Labour candidate is hoping to be re-elected on June 8 as MP for the constituency she has represented for seven years. \nLabour peer and justice campaigner Baroness Lawrence, mother of murdered London teenager Stephen Lawrence, has endorsed her campaign. \nMs Kendall is defending a majority of just over 7,000 and the Tories are understood to be targeting Labour seats with majorities of under 8,000 across the country. \nGeneral Election 2017: Click HERE for everything you need to know \nMs Kendall pledged, if re-elected, to fight the Government's cuts to school budgets and the NHS. \nShe said she was proud to have played a part in the campaign to prevent NHS England from closing the children's heart unit at Glenfield Hospital. \n\"I have never taken this seat for granted,\" Ms Kendall said. \n\"I have always treated it is a marginal. I think it will be a tough campaign and I will fight for every single vote here. \n\"I am determined to do that and I am very proud of my record of standing up for people in this area.\" \nMs Kendall ran as a Labour leadership candidate in 2015, when she secured 4.5 per cent of party support and was roundly defeated by Jeremy Corbyn. \nThe Mercury twice asked her if wanted to see Mr Corbyn as the next Prime Minister but she did not answer the yes/no question. \nShe said: \"I want him to be successful in this election. I want to see as many Labour MPs returned as possible. \n\"People know I have had my differences with him but that is in the past and we are united now in trying to get a Labour Government.\" \nShe will face a Tory challenge from Jack Hickey. \nMs Kendall said she did not know anything about the 24-year-old teacher but was looking forward to meeting him. \nMr Hickey said: \"A vote for Labour's Leicester West candidate risks putting Jeremy Corbyn in Downing Street, propped up with others including the SNP. \n\"I would work closely with Theresa May to get the best Brexit deal for Leicester and champion our communities around the clock in Westminster.\" \nThe Lib Dems have also picked their candidate for Leicester West – blind disability campaigner Ian Bradwell, who came fifth when he contested the seat in 2015.", "external_links": [], "published": "2017-05-04T00:29:00.000+03:00", "crawled": "2017-05-03T20:15:20.000+03:00", "highlightTitle": ""}