{"organizations": [], "uuid": "b1634d735390b120fa96358f7bff06e4129ed71a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11498754.ece/ALTERNATES/s1200/JS93033722.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12972732", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE:Richard Branson warns of Brexit 'danger' to smaller businesses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE:Richard Branson warns of Brexit 'danger' to smaller businesses", "spam_score": 0.0, "site_type": "news", "published": "2017-05-03T14:55:00.000+03:00", "replies_count": 0, "uuid": "b1634d735390b120fa96358f7bff06e4129ed71a"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12972732", "ord_in_thread": 0, "title": "Business Breakfast LIVE:Richard Branson warns of Brexit 'danger' to smaller businesses", "locations": [], "entities": {"persons": [{"name": "richard branson", "sentiment": "negative"}, {"name": "crozier", "sentiment": "none"}, {"name": "alok loomba", "sentiment": "none"}, {"name": "gaglardi", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "adam crozier", "sentiment": "none"}, {"name": "rowe", "sentiment": "none"}, {"name": "peter bazalgette", "sentiment": "none"}, {"name": "jamie martin", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "tom marshall", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "gina miller", "sentiment": "none"}, {"name": "jonathon manning law", "sentiment": "none"}, {"name": "sandman", "sentiment": "none"}, {"name": "chris rigg", "sentiment": "none"}, {"name": "mitch gaglardi", "sentiment": "none"}, {"name": "ian griffiths", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "marcus watson", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}, {"name": "jonathon manning newcastle", "sentiment": "none"}, {"name": "mick hogan", "sentiment": "none"}, {"name": "sintons", "sentiment": "none"}, {"name": "adam", "sentiment": "none"}, {"name": "jonathon manning halfords", "sentiment": "none"}, {"name": "jill mcdonald", "sentiment": "none"}, {"name": "steve rowe", "sentiment": "none"}, {"name": "christopher dixon", "sentiment": "none"}, {"name": "coupe", "sentiment": "none"}, {"name": "gerard murray", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "jill", "sentiment": "none"}, {"name": "jane meikle", "sentiment": "none"}, {"name": "jo whitfield", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gloucester rugby", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "gatwick", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "kingston park", "sentiment": "none"}, {"name": "broadchurch", "sentiment": "none"}], "organizations": [{"name": "jonathon manning farming", "sentiment": "negative"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "niche pharmaceuticals", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "gloucester rugby", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "irish bank", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "allied irish bank", "sentiment": "none"}, {"name": "mike coupe", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "sandman signature", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "aib", "sentiment": "none"}, {"name": "newcastle falcons", "sentiment": "none"}, {"name": "quantum pharma", "sentiment": "none"}, {"name": "argos digital", "sentiment": "none"}, {"name": "halfords", "sentiment": "none"}, {"name": "sintons", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle hq", "sentiment": "none"}, {"name": "falcons", "sentiment": "none"}, {"name": "sandman hotel group", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Farming groups welcome Co-op pledge to buy all fresh meat from UK \nFarming groups have welcomed a move by supermarket chain Co-op to only source fresh meat from the UK. \nThe retailer said it made the move to sell only home-sourced meats amid rising imports. \nQuoting customs data, the store said meat imports to the UK have doubled in the last two decades, and called on other retailers to follow suit by buying local. \nJo Whitfield, retail chief executive of the Co-op, said: \nBritish consumers will be shocked to see how meat imports have grown while at the same time retailers hang out the bunting and claim to back British farmers. \nOnly the Co-op offers 100% British fresh meat all year round, and not just in the meat cabinet but also in our sandwiches, our pies and our ready meals. \nWe can do this because we’re owned by members, not shareholders, and can invest long-term in what matters to communities, not what provides the fastest shareholder return. \nI call on other retailers and food providers to do more to help our farmers, particularly as they head towards uncertain times.” \nThe Co-op now sources 100% British beef, chicken, ham, pork, duck and turkey and uses only British meat in all sausages and in its own-label chilled ready meals, pies and sandwiches. A Co-op shopping bag (Photo: PA) 8:45 Jonathon Manning Halfords chief Jill McDonald drafted in to head M&S's clothing arm \nMarks & Spencer has poached the chief executive of Halfords and put her in charge of shoring up its embattled clothing arm. \nThe high street bellwether said Jill McDonald had been recruited into the new role of managing director for clothing, home and beauty, joining the retailer in the autumn of this year. \nThe move will see Ms McDonald take over the responsibility of running of the clothing division from chief executive Steve Rowe, who has remained in charge of the operation since his promotion to the top job in April last year. \nM&S was given a boost at the start of the year when like-for-like sales in its clothing and home division rose 2.3% in the 13 weeks to December 31 - the first growth since the January to March quarter in 2015. However, Mr Rowe stressed at the beginning of 2017 that there was more work to do in its efforts to revive clothing sales and suggested the quarterly rise may not mark a return to sustained sales growth. \nSpeaking about Ms McDonald’s appointment, Mr Rowe said: \nI am pleased with the progress we have made in Clothing & Home over the last year and the time is now right for this appointment. \nJill is an excellent addition to the M&S senior leadership team and we are delighted that she is joining us. \nJill’s first-class customer knowledge and great experience in running dynamic, high- achieving teams make her exactly the right person to lead this all-important part of our business from recovery in to growth. Marks and Spencer (Photo: Getty Images Europe) 8:35 KEY EVENT Quantum Pharma set for \"future growth\" despite statutory losses \nQuantum Pharma has said its latest set of financial results “draw a line under” the group’s past performance after the Newcastle-headquartered firm increased turnover by 28% to £69.2m. \nAlong with the increase in turnover the firm said it had spent the year creating a more focused and simplified business strategy led by a new board of directors. \nIn the company accounts CEO Chris Rigg said: \nI am very pleased with the progress we have made to date. We have driven a step change in the profitability of the Niche Pharmaceuticals division in the second half by focusing on launching and commercialising products where we have a competitive advantage. \nIn addition, the group has cemented its position as the UK’s market‐leading specials business by renewing exclusive contracts with three of the four main wholesale and pharmacy chains in the UK. \nOperating costs across the Group have been reduced and our net debt position at the year‐end was lower than expected at £13.0m. We exited the financial year with a much improved profitability run‐rate that is supportive of market expectations for the current financial year and we are well‐placed to deliver future growth by focusing on our core Niche and Specials businesses. \nGross profit remained flat at £25.9m for the year ending January 32 2017. However, The firm made an operating loss of £9.8m and a bottom line loss of £22.8m. In 2016 the firm made an operating profit of £6.7m and a bottom line profit figure of £5.6m. \nChief financial officer Gerard Murray said that the business’s transition over the year led to “substantial non-recurring costs”. These costs were attributed to discontinued operations, impairment of product developments, and costs incurred in implementing the simplified strategy. Chris Rigg, CEO of Quantum Pharma 8:28 Jonathon Manning Newcastle success for Sandman Hotel Group triggers UK expansion plans \nA hotel group which selected Newcastle to become the base of its first venue outside Canada is eyeing further UK expansion following a multimillion-pound finance deal overseen by North East law firm Sintons. \nSandman Hotel Group transformed the former Scottish and Newcastle HQ in the heart of Newcastle into the Sandman Signature hotel in its first foray into the UK back in 2011. \nNow the firm, which also owns a hotel at Gatwick, is scouring the UK for new sites to open, backed by an eight-figure refinancing package with Allied Irish Bank (GB). \nThe family-owned business, which is the leading hospitality group in Canada more than 40 leisure venues across the country, is currently investing over £20m in its third UK hotel in Aberdeen, creating over 200 jobs. \nMitch Gaglardi, director of Sandman and whose family have owned and run the business since establishing its first site over 40 years ago, said the huge success of its Newcastle hotel has been a key factor in the group’s ongoing UK expansion plans. \nSince first purchasing the Newcastle site in 2009 ahead of its redevelopment, Sandman has been supported by Newcastle law firm Sintons, and has recently secured refinancing from Allied Irish Bank (GB) to help it push on with its ambitions. \nMr Gaglardi said: \nWe have plans to expand further in the UK - we are looking at a number of sites and have a few irons in the fire. \nWe have successfully been operating here for a number of years now in Newcastle and at Gatwick and the time is right to build on that. \nOur Aberdeen development is a serious investment and will be a legacy property for us, one that takes us into another new part of the UK. Left to right: Jane Meikle, Sintons; Mitch Gaglardi, Sandman Hotel Group; Alok Loomba, Sintons; Christopher Dixon, AIB (Photo: sintons) 8:23 Jonathon Manning Law firm Ward Hadaway sponsors Newcastle Falcons for two more seasons \nLaw firm Ward Hadaway has pledged to support Newcastle Falcons rugby for a further two seasons as one of the team’s official sponsors. \nThe Newcastle company has sponsored the top flight rugby team since 2015 and will now continue to do so during the 2017/18 and 2018/19 seasons. \nNewcastle Falcons managing director Mick Hogan said: \nWe have enjoyed a long and mutually-beneficial association with Ward Hadaway over a number of years and it is great news that it will continue for at least another two seasons. \nIt is an exciting period for the Falcons given the improvements we have seen this season, and the way in which the squad is coming together for 2017-18. \nSeason ticket membership sales are very strong, we have made some fantastic player signings and with companies like Ward Hadaway on board we are continuing to make good progress. \nAs a result of the sponsorship deal, Ward Hadaway’s name will be emblazoned across the back of the Falcons’ home, away and European shirts. \nThe deal comes shortly after Newcastle was confirmed as the host city for the European rugby’s showpiece finals in 2019. \nJamie Martin, managing partner at Ward Hadaway, said: \nWe are delighted to be continuing our backing of Newcastle Falcons for a further two seasons. \nAs a northern law firm for national business we have always believed in supporting home-grown talent, and our relationship with the Falcons has proven to be the perfect fit over the past two years. Marcus Watson of Newcastle Falcons evades Tom Marshall of Gloucester Rugby during the Aviva Premiership match between Newcastle Falcons and Gloucester Rugby at Kingston Park (Photo: Getty Images Europe) 8:18 KEY EVENT Sainsbury's warns over challenging trading as profits dip to £503m \nSupermarket Sainsbury’s has cautioned over “challenging” trading and ongoing price pressures as it posted an 8.2% fall in annual profits. \nThe chain reported pre-tax profits of £503m for the year to March 11, down from £548m the previous year. \nProfits fell 1% on an underlying basis to £581m as it sought to keep prices low amid cost pressures from the Brexit-hit pound, which offset a £77m boost from the recently bought Argos chain. \nThe group said the market remains “competitive and the impact of cost price pressures remains uncertain”, with like-for-like supermarket sales down 0.6% over the year. But Sainsbury’s chief executive Mike Coupe said its food business remained “resilient in a challenging market”. \nHe added: \nThis has been a pivotal year and we have made significant progress delivering and accelerating our strategy. \nGroup sales, including VAT, surged 12.7% thanks to a robust contribution over the final six months from the Argos business, which the group bought when it acquired Home Retail for £1.4bn last year. \nSainsbury’s said it made cost savings of £130m as part of a three-year target to cut £500m by the end of 2017/18. It also outlined aims to slash costs by another £500min the next three years. \nMr Coupe said the group was “pleased” with its progress so far since snapping up Argos, having already opened 59 Argos Digital stores in its supermarkets, which it said were performing well. It is also ramping up plans to open 250 Argos Digital stores, the group added. Sainsbury's saw profits drop to £503m 8:13 The FTSE and pound update \nThe FTSE-100 index at 7:44am was unchanged at 7250.05. \nThe pound at 8am was 1.2914 dollars compared to 1.2920 dollars at the previous close. \nThe euro at 8am was 0.8456 pounds compared to 0.8444 pounds at the previous close. 8:10 Jonathon Manning ITV's chief executive steps down amid boardroom shake-up \nBroadcasting giant ITV has unveiled a top-level shake-up that will see chief executive Adam Crozier step down after seven years at the helm. \nThe group, home to shows such as Britain’s Got Talent and Broadchurch, said Mr Crozier will leave the company on June 30, with a long-term successor to be revealed “in due course”. \nITV chairman Sir Peter Bazalgette will take on the role of executive chairman, while Ian Griffiths will become the combined chief operating officer and group finance director. \nIn a statement, Sir Peter said: \nAdam has been talking to me and the board for some time now about his future plans. \nHe has made a fantastic contribution to ITV and the board is deeply indebted to him for his strong leadership and personal dedication in very successfully turning around the business and building a more global and diversified organisation with real scale in key creative markets around the world. ITV chief executive Adam Crozier (Photo: ITV/PA Wire) 8:05 KEY EVENT Sir Richard Branson warns of Brexit 'danger' to smaller businesses \nSir Richard Branson has warned small businesses are at far greater risk from Brexit than larger firms, and could be clobbered with a costly amount of bureaucracy once Britain leaves the EU. \nThe billionaire tycoon said the impact of Brexit could be bigger than “any small businesses ever imagined” and it is “critical” they continue to enjoy access to EU markets. \nHe added: \nSmall businesses are likely to suffer more than big businesses from Brexit and that’s because big businesses have overseas earnings in dollars, and as the pound goes down they can cushion themselves. \nThe massive question is, will small businesses have access to Europe in the way that they had in the past? \nThere is a danger that if the Brexit negotiations go wrong, the bureaucracy could be far, far greater than any small businesses ever imagined. \nImportation duties, the exportation duties, this big market being made much more inaccessible, it is critical. \nThe Virgin boss was an outspoken Remainer prior to last year’s vote, and over the weekend said a hard Brexit would be a “disaster” for the UK and could warrant a second referendum. \nSir Richard has also helped pay for the office used by Gina Miller, the businesswoman whose legal action forced a parliamentary vote on withdrawal from the EU. She launched the Best For Britain crowdfunded initiative to influence the result in marginal seats last week. \nHe added it is vital government negotiators “realise the importance of us being able to trade within Europe” and that small firms are not “precluded” from the EU market in any deal that is struck. He said: \nThat’s the most important thing, that that market is not precluded for small businesses and that it doesn’t become cumbersome, bureaucratic and expensive as it did before the European Union was formed. \nIf we can get rid of that thing hanging around our necks, I think small businesses can continue to flourish as they’ve been doing for a long time. \nPrime Minister Theresa May has confirmed Britain will leave the single market and the customs union post Brexit, in contrast to the desire of most British businesses. \nHowever, Sir Richard said he will not take sides ahead of the election on June 8. \nIt’s invidious for business people to get involved in party politics. \nBusiness people should talk out on issues but not get involved in backing political parties. \nIt’s invidious for the businessman and invidious for the party itself. \nThe businessman was speaking on the sidelines of the launch of Voom, a Virgin initiative that allows budding entrepreneurs to pitch their ideas and give them the chance to win funding and other support. Sir Richard said Voom aims to challenge people to “put aside their fears” and pitch business ideas that are going to make a positive difference to lives. Sir Richard Branson (Photo: Ben Pruchnie/PA Wire) Share", "external_links": [], "published": "2017-05-03T14:55:00.000+03:00", "crawled": "2017-05-03T11:22:06.000+03:00", "highlightTitle": ""}