{"organizations": [], "uuid": "46137925fddc5eb9d91e1000a63157ba8602c8d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12579690.ece/ALTERNATES/s1200/Nissan-results.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-sunderland-brexit-government-car-13015908", "country": "GB", "domain_rank": 21960, "title": "Government accused of 'bowing to Nissan's demands' to keep carmaker in the North East after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Government accused of 'bowing to Nissan's demands' to keep carmaker in the North East after Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-05-11T12:00:00.000+03:00", "replies_count": 0, "uuid": "46137925fddc5eb9d91e1000a63157ba8602c8d1"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-sunderland-brexit-government-car-13015908", "ord_in_thread": 0, "title": "Government accused of 'bowing to Nissan's demands' to keep carmaker in the North East after Brexit", "locations": [], "entities": {"persons": [{"name": "greg clark", "sentiment": "none"}, {"name": "paul willcox", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "greg clark  nissan", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bre", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "brexit news government", "sentiment": "negative"}, {"name": "innovate uk", "sentiment": "none"}, {"name": "office for low emission vehicles", "sentiment": "none"}, {"name": "nissan europe", "sentiment": "none"}, {"name": "energy and industrial strategy", "sentiment": "none"}, {"name": "times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Government accused of 'bowing to Nissan's demands' to keep carmaker in the North East after Brexit A letter setting out Nissan's requests to the Government has been published after the Liberal Democrats sent a Freedom of Information request Share Nissan (Photo: Andrew Matthews/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Government has been accused of “having to bow to every demand” from carmaker Nissan to encourage it to invest in the North East after Brexit. \nThe Times newspaper has obtained a four-page letter from Paul Willcox, chairman of Nissan Europe, to Greg Clark, the business secretary, setting out how the Government could ensure production continues at the Nissan plant in Sunderland . \nIt appears to confirm claims by Nissan and by Ministers that there has been no direct financial aid to Nissan, but that the Government has provided assistance in other ways. \nNissan announced in October last year that it would build the third generation of Qashqai models at its Sunderland factory, and bring production of the X-Trail SUV from Japan to Sunderland. The announcement safeguarded more than 7,000 jobs at the Sunderland plant. \nBut this came after the Government offered reassurances to the Japanese-owned carmaker. \nMinisters say they simply offered support to Nissan as part of a long-standing commitment to backing the car industry - but Liberal Democrat leader Tim Farron said the Government was forced to make extra guarantees because of Brexit . Business Secretary Greg Clark \nNissan’s letter to Greg Clark, sent last October, has now been published in a heavily-censored form following a Freedom of Information request to the Department for Business, Energy and Industrial Strategy from the Liberal Democrats. \nIt highlights a project to ensure batteries used in Nissan’s electric cars can be recycled for use in homes and offices. \nLast month, Government agency Innovate UK announced plans to invest in “exploring how old Nissan electric vehicle batteries can be used to store peak electricity from UK homes”. It’s one of 12 projects paid for with an £18m fund. \nThe letter also urged the Government to change planning rules to to make it a requirement for large residential developments to have electric charging points, and to force councils to ensure they are operational and accessible. Read More 140 jobs saved at Team Valley firm as US owners scrap closure plan \nIn October, the Government announced that it would offer grants to support the wider use of electric and hybrid vehicles, with the Office for Low Emission Vehicles providing funding towards the cost of installing electric vehicle charge points at UK homes. \nOther UK-based carmakers have also been calling on the Government for many years to take steps to encourage consumers to choose electric vehicles, including providing more charge points. Workers at Nissan's plant in Sunderland (Photo: Owen Humphreys/PA Wire) \nTim Farron, the Liberal Democrat leader , said: “The government have just copy and pasted Nissan’s demands and turned it into a press release. This saga shows the Government has no real industrial policy and is having to bow to every demand to keep vital manufacturing jobs in Britain post-Brexit.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now ", "external_links": [], "published": "2017-05-11T12:00:00.000+03:00", "crawled": "2017-05-11T09:58:04.000+03:00", "highlightTitle": ""}