{"organizations": [], "uuid": "573f7d0d70037770993cddfb4be9f60bd713a8a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11771226.ece/ALTERNATES/s1200/JS45032999.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/profits-revenue-rise-banknote-manufacturer-13079444", "country": "GB", "domain_rank": 21960, "title": "Profits and revenue rise at banknote manufacturer De La Rue", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-23T21:15:00.000+03:00", "replies_count": 0, "uuid": "573f7d0d70037770993cddfb4be9f60bd713a8a4"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/profits-revenue-rise-banknote-manufacturer-13079444", "ord_in_thread": 0, "title": "Profits and revenue rise at banknote manufacturer De La Rue", "locations": [], "entities": {"persons": [{"name": "martin sutherland", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}, {"name": "sutherland", "sentiment": "none"}], "locations": [{"name": "de la rue", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "de la rue", "sentiment": "negative"}, {"name": "de la rue profits", "sentiment": "negative"}, {"name": "dlr analytics", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "invalid email  banknote", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Profits and revenue rise at banknote manufacturer De La Rue The firm, which has a major plant in Gateshead, has been diversifying into passports and stamps Share Get   \nBanknote maker De La Rue has notched up a rise in annual profits as the first growth in its passport printing business for three years helped offset a fall in currency earnings. \nThe firm - which has a major base in Gateshead - reported a 6% rise in pre-tax profits to £58.2m for the year to March 25. Annual revenue was 2% higher at £461.7m. \nThe figures exclude the cash processing solutions business, which the company sold last May. \nWith the global banknote paper market facing oversupply, the firm has been stepping up efforts to expand into other areas, such as making passports and tax stamps. \nBanknote print still comprises the largest chunk of the company’s business, but underlying earnings in the division fell 9% to £50.3m. \nThis was offset by the strong performance of De La Rue’s identity solutions - or passport making - business, where revenue grew 5% to £80.6m, the first rise since 2014. \nThis helped underlying earnings in the division surge 37% to £11.4m. \nGroup results were also boosted by a 29% leap in underlying operating profits at De La Rue’s product authentication and traceability business, to £9m. \nMartin Sutherland, chief executive of De La Rue, said: “We are two years into our five-year strategic plan and have made solid progress against our objectives to diversify the business and improve the quality of earnings.” \nThe company, which has produced banknotes since 1860, also said it received a fillip from the fall in sterling since the Brexit vote, as it makes more than 80% of its revenues outside the UK. \nDe La Rue said it produced 7.1bn banknotes last year, while the volume of polymer banknote paper it makes increased by 18% to 11,800 tonnes - a seven-year high. \nVolumes of polymer notes nearly quadrupled to 380 tonnes, it added. Read More De La Rue upgrades Gateshead factory to improve banknote printing line \nIt follows the decision by the Bank of England to proceed with its new plastic £5 note, despite concerns raised by some vegans and vegetarians about the use of animal fat in the production process. \nMr Sutherland added the company has introduced six new products into its pipeline, including DLR Analytics, a software solution to help central banks manage their cash cycle requirements, which is being piloted in 26 countries. \nThe full-year dividend was maintained at 25p per share. Like us on Facebook", "external_links": [], "published": "2017-05-23T21:15:00.000+03:00", "crawled": "2017-05-23T17:03:28.000+03:00", "highlightTitle": ""}