{"organizations": [], "uuid": "ccaeb07f9341c5e15640b770637362032eb7ef19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30360073/16022008.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/more-hustings-events-to-quiz-would-be-mps-in-south-devon/story-30360073-detail/story.html", "country": "GB", "title": "C_Abbott published More hustings events to quiz would-be MPs in South Devon", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-29T22:06:00.000+03:00", "replies_count": 0, "uuid": "ccaeb07f9341c5e15640b770637362032eb7ef19"}, "author": "C_Abbott", "url": "http://www.devonlive.com/more-hustings-events-to-quiz-would-be-mps-in-south-devon/story-30360073-detail/story.html", "ord_in_thread": 0, "title": "C_Abbott published More hustings events to quiz would-be MPs in South Devon", "locations": [], "entities": {"persons": [{"name": "carol", "sentiment": "none"}, {"name": "julian brazil", "sentiment": "none"}, {"name": "deborah brewer", "sentiment": "none"}, {"name": "sam moss", "sentiment": "none"}, {"name": "kevin foster", "sentiment": "none"}, {"name": "tony mcintyre", "sentiment": "none"}, {"name": "jim parker", "sentiment": "none"}, {"name": "caroline abbott", "sentiment": "none"}, {"name": "paul raybould", "sentiment": "none"}, {"name": "jacqi hodgson", "sentiment": "none"}, {"name": "sally", "sentiment": "none"}, {"name": "sally lord", "sentiment": "none"}, {"name": "steven harvey", "sentiment": "none"}, {"name": "jonathan cooper obe", "sentiment": "none"}, {"name": "gerrie messer", "sentiment": "none"}, {"name": "brian harland", "sentiment": "none"}, {"name": "tim godfrey", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}], "locations": [{"name": "torquay", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "south hams", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}, {"name": "dartington hall", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "brixham", "sentiment": "none"}, {"name": "salcombe", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "riviera international conference centre", "sentiment": "none"}, {"name": "kingsbridge", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}, {"name": "kingswear", "sentiment": "none"}], "organizations": [{"name": "dartmouth", "sentiment": "none"}, {"name": "brixham rugby club", "sentiment": "none"}, {"name": "caroline abbott comments", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "abbott", "sentiment": "none"}, {"name": "herald express", "sentiment": "none"}, {"name": "community partnership", "sentiment": "none"}, {"name": "newton abbot chamber of trade at the university technical college", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "brixham community partnership", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "exeter chiefs", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "More hustings events to quiz would-be MPs in South Devon By C_Abbott | Posted: May 29, 2017 By Caroline Abbott 0 COMMENTS SHARES Caroline Abbott Totnes parliamentary hustings event at Dartington Hall. L-R: Julian Brazil (Lib Dem), Jacqi Hodgson (Green), Sarah Wollaston (Con), hustings chairman Jonathan Cooper OBE, Gerrie Messer (Lab). UKIP candidate Steven Harvey absent. More hustings events to quiz would-be MPs in South Devon X \nCopy link to paste in your message / Pictures: Caroline Abbott Comments (0) \nMore hustings events have been organised to give South Devon members of the public a chance to hear from and question the people seeking to represent them in Parliament. \nOn Monday, June 5 – just three days before the General Election on Thursday, June 8 – four of the five candidates for the Totnes seat, which includes Brixham, will attend a hustings event at Brixham Rugby Club. The Conservatives' Sarah Wollaston, Green Party's Jacqi Hodgson, Labour Party's Gerrie Messer and Liberal Democrats' Julian Brazil will attend the hustings which will be chaired by former Brixham councillor Brian Harland. UKIP's candidate Steven Harvey will be in America on that date. \nThe Totnes constituency covers the Eastern part of the South Hams district, including the towns of Totnes, Dartmouth, Kingsbridge and Salcombe, as well as parts of Torbay including the town of Brixham. In the EU referendum, the South Hams bucked the South West trend, with 52.85 per cent voting to remain compared to 47.15 per cent voting to leave. \nDr Sarah Wollaston (Con) has held the seat since 2010. In the 2015 election she won a 53 per cent share of the total vote, with 24,941 votes. UKIP came second with 14 per cent of the total vote – 6,656 votes. Labour (5,988 votes), the Green Party (4,845 votes) and then Lib Dem candidate Julian Brazil (4,667 votes) followed. \nRead next: Watch Devon Air Ambulance collect collision casualty from Torbay Heritage Regatta \nThe hustings event is being hosted by Brixham Community Partnership, in the rugby club's Tribute Room from 7pm to 8pm. Brixham Community Partnership chairman Sally Lord said she had been approached by local residents to organise a hustings event. She said: \"Brixham is in perhaps a unique position, being a part of Torbay but, at the same time, firmly situated in the Totnes constituency. It has issues that are specific to the town.\" \nThe event will take the form of a Question Time-style hustings and in order to tackle the issues of most importance to Brixham residents, Sally has asked that questions be left on the Community Partnership's telephone line of 07460 253442 or emailed to bcpchair@gmail.com by midnight on Sunday, June 4. The top six questions will be put to the candidates, who will not know these in advance of the event. \nSally added: \"This should be a fascinating but quite short event so candidates will have to be concise in their replies. We may not be able to cover all of the issues involved in this election but we will try to make sure that those of the most interest to Brixham residents are covered.\" \nRead next: Live: Exeter celebrates Exeter Chiefs with open-top bus parade through the city centre \nThe same four candidates attended a hustings event at Dartington Hall last Thursday , which was chaired by Jonathan Cooper OBE, an international human rights barrister from Kingswear. It was attended by 275 people from the community and broadcast live on DevonLive's Facebook page. Questions from the audience covered topics including Brexit, terrorism and health service spending. The video from the event can be seen here. \nMeanwhile, the Herald Express has teamed up with the Princess Theatre in Torquay and Torbay Business Forum to stage a hustings event for the Torbay seat. Candidates Paul Raybould (Lab), Deborah Brewer (Lib Dem), Kevin Foster (Con), Tony McIntyre (UKIP) and Sam Moss (Green) have all agreed to attend the event at the venue on Wednesday, May 31, starting at 5.30pm. Forum chairman Tim Godfrey and Herald Express editor Jim Parker will chair the event. \nThe Business Forum will also be staging its own hustings with the candidates as part of its business breakfast at the Riviera International Conference Centre in Torquay on Tuesday, May 6, from around 8.15am. \nOn Tuesday, May 30, there will be a Newton Abbot hustings organised by the Newton Abbot Chamber of Trade at the University Technical College at 6.30pm.", "external_links": [], "published": "2017-05-29T22:06:00.000+03:00", "crawled": "2017-05-29T18:04:59.000+03:00", "highlightTitle": ""}