{"organizations": [], "uuid": "d53c779c5641a05c4fbeecd8009432c3a80367bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30316572/15989895.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/corbyn-promises-leicester-labour-supporters-a-reckoning-with-greedy-bankers-and-tax-cheats/story-30316572-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Corbyn promises Leicester Labour supporters a 'reckoning' with greedy bankers and tax cheats | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Corbyn promises Leicester Labour supporters a 'reckoning' with greedy bankers and tax cheats | Leicester Mercury", "spam_score": 0.69, "site_type": "news", "published": "2017-05-07T01:36:00.000+03:00", "replies_count": 0, "uuid": "d53c779c5641a05c4fbeecd8009432c3a80367bb"}, "author": "", "url": "http://www.leicestermercury.co.uk/corbyn-promises-leicester-labour-supporters-a-reckoning-with-greedy-bankers-and-tax-cheats/story-30316572-detail/story.html", "ord_in_thread": 0, "title": "Corbyn promises Leicester Labour supporters a 'reckoning' with greedy bankers and tax cheats | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "negative"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "phillip green", "sentiment": "none"}], "locations": [{"name": "welford road", "sentiment": "none"}, {"name": "labour stronghold leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicester mercury corbyn", "sentiment": "negative"}, {"name": "leicester labour", "sentiment": "negative"}, {"name": "general election", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "southern rail", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "leicester tigers", "sentiment": "none"}, {"name": "tory north west leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Corbyn promises Leicester Labour supporters a 'reckoning' with greedy bankers and tax cheats By danjmartin | Posted: May 06, 2017 0 COMMENTS SHARES Comments (0) \nJeremy Corbyn has been in Labour stronghold Leicester today to hold a rally to lift the party in the run up to the General Election . \nAround 800 invited Labour supporters gave their leader a rapturous reception filling the function hall at Leicester Tigers' Welford Road ground. \nAfter a bruising set of local election results this week in which his party suffered reverses in other traditional Labour heartlands and in Leicestershire , Mr Corbyn acknowledged it would be a huge challenge to catch the Tories. \nHowever his 30 minute speech was a rallying cry against what he described as an economy 'rigged for the rich' and a 'broken' Westminster system. \nGeneral Election 2017: Click HERE for everything you need to know \nHis speech, laced with the party's campaign slogan 'For the Many', was well received by a friendly audience as he urged activists to do their best and work night and day a polling day approaches. \nHe told the hall: \"Today I say to tax cheats, rip-off bosses and greedy bankers, enough is enough. \n\"When Labour wins there will be a reckoning for those who thought they could get away with asset stripping our industries, crashing our economy through their greed and ripping off workers and consumers. \n\"Don't wake up on June 9 to see celebrations from the tax cheats, the press barons, the greedy bankers, Phillip Green, Southern Rail. \n\"I'm not normally a party pooper. \n\"I like people to enjoy themselves but I don't think they should. \n\"I want a Labour Government that empowers the whole community so everyone can achieve their full potential and not be held back by discrimination, sexism, racism. \n\"We face a huge challenge in the next four and a bit weeks but this General Election campaign is also an opportunity, a chance to break free, to create a society in which people are no longer held back by a system that is rigged for the rich. \n\"It is a chance to rebuild Britain for the many and not the few.\" \nMr Corbyn added: \"There is also a huge danger - that Tories fear-mongering and spin machine will make some people settle for less than they should and resign themselves to things the way they are.\" \nMr Corbyn said it was the Tory's mission to rig the system for the rich. \n\"We know from the (local) election results that the gap between the Tories and us is not as great as some of the pundits have been saying. \n\"But we still have many people to convince. \n\"Our Westminster system is broken and our economy is rigged. \n\"Both are run in the interests of the few. \n\"Things can and must be different. \n\"Labour are under attack because we are standing up to the elite who are determined to hijack Brexit, to pay even less tax and take even more of the wealth we all create. \n\"The only time the Conservatives stand up is when they are taking orders from their billionaire friends. \n\"We are under attack because we are standing up to corporate interests plundering the NHS. \n\"£13 billion of NHS budget is already privatised. \n\"How much more will be left if the Tories get another five years damaging our NHS. \n\"We are drawing a line under decades of privatisation from energy to rail to health and social care that has made some people very rich but has not delivered richer lives to the many.\" \nDespite the enthusiastic reception in Leicester, a number of party figures have said Mr Corbyn's leadership is hindering their chances of getting elected. \nTory North West Leicestershire parliamentary candidate Andrew Bridgen contacted the Mercury after becoming aware Mr Corbyn was in town. \nHe said: I wish Jeremy Corbyn would come to my area because I could do with getting my campaign off to a flying start. \n\"If Jeremy Corbyn is the answer I shudder to think what the question could be?\"", "external_links": [], "published": "2017-05-07T01:36:00.000+03:00", "crawled": "2017-05-06T20:23:05.000+03:00", "highlightTitle": ""}