{"organizations": [], "uuid": "82986aae8ea6cea445c514a62cd6f1c172b7b299", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13106695.ece/ALTERNATES/s1200/GWR_-NJL_290517laws_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/former-newcastle-airport-boss-david-13106620", "country": "GB", "domain_rank": 21960, "title": "Former Newcastle Airport boss David Laws takes top job at Northern rival", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-29T17:39:00.000+03:00", "replies_count": 0, "uuid": "82986aae8ea6cea445c514a62cd6f1c172b7b299"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/former-newcastle-airport-boss-david-13106620", "ord_in_thread": 0, "title": "Former Newcastle Airport boss David Laws takes top job at Northern rival", "locations": [], "entities": {"persons": [{"name": "david laws", "sentiment": "positive"}, {"name": "jones", "sentiment": "none"}, {"name": "nick jones", "sentiment": "none"}, {"name": "john parkin", "sentiment": "none"}], "locations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "former newcastle airport", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "leeds bradford airport", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "yorkshire airport", "sentiment": "none"}, {"name": "amp capital", "sentiment": "none"}, {"name": "leeds bradford airport", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former Newcastle Airport boss David Laws takes top job at Northern rival Mr Laws has been appointed as chief executive of Leeds Bradford Airport Share David Laws, chief executive at Leeds Bradford Airport (Photo: publicity handout from Leeds Bradford Airport) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe former head of Newcastle Airport has been appointed to take charge of a rival site in the North. \nLeeds Bradford Airport has appointed David Laws as its new chief executive after the retirement of John Parkin, another former boss at Newcastle. \nMr Laws held the top job at Newcastle for 10 years and had worked there since 1979 but stepped down from his role last year. His time in charge at Newcastle saw expansion in passenger numbers and the addition of a number of key flight destinations, including Dubai and New York, though the American link has since been cancelled. \nMr Laws, who also oversaw substantial re-development of the airport, had been working in a part-time advisory role for Newcastle’s co-owners AMP Capital after leaving the airport. \nNow he is promising similar developments at Newcastle’s nearest large rival airport in the North. \nHe said: “My passion is for airport development and ensuring that the customer journey is a truly great experience. \n“I am excited about joining Leeds Bradford Airport to further improve, expand and develop the business and look forward to working with the team at Leeds Bradford Airport and all those involved from the airlines, stakeholders and partners to develop the next phase of the airport’s growth.” Read More Avoiding hard Brexit is keen concern for North East businesses, Journal survey shows \nDespite serving a larger population, Leeds Bradford Airport is smaller than Newcastle, serving 3.6m passengers a year to Newcastle’s 4.8m. The Yorkshire Airport had 44,000 flights last year compared to Newcastle’s 56,000. \nEarlier this year Newcastle Airport confirmed that Nick Jones, who had been interim chief executive since Mr Laws’ departure, would take the top job on a permanent basis. He had been at the airport since 2015, having joined as chief financial officer. \nMr Jones took the top job at a time when the airport is experiencing its strongest growth in almost a decade, with passenger numbers growing by 6% in 2016 and a number of new routes being announced. Read More \nBut it also lost direct American flights last year and has highlighted a potential threat to future services if Scottish airports are allowed to reduce their air passenger duty and offer cheaper flights. Like us on Facebook ", "external_links": [], "published": "2017-05-29T17:39:00.000+03:00", "crawled": "2017-05-29T13:01:38.000+03:00", "highlightTitle": ""}