{"organizations": [], "uuid": "6c9b86a2c1b4cf2cda8b039e7cffe75efe61ec44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12987190.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-eu-paranoia-cost-12987121", "country": "GB", "domain_rank": 21960, "title": "Theresa May's EU 'paranoia' will cost North East jobs, claims Labour", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May's EU 'paranoia' will cost North East jobs, claims Labour", "spam_score": 0.0, "site_type": "news", "published": "2017-05-04T23:22:00.000+03:00", "replies_count": 0, "uuid": "6c9b86a2c1b4cf2cda8b039e7cffe75efe61ec44"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-eu-paranoia-cost-12987121", "ord_in_thread": 0, "title": "Theresa May's EU 'paranoia' will cost North East jobs, claims Labour", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "tajani", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "juncker", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "philip  mrs may", "sentiment": "none"}, {"name": "elizabeth ii", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "antonio tajani", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "buckingham palace", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "labour news theresa may", "sentiment": "negative"}, {"name": "labour labour", "sentiment": "negative"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle labour", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May's EU 'paranoia' will cost North East jobs, claims Labour Labour hits out after Conservative leader claims the EU is trying to fix the result of the general election Share Click to play Tap to play The video will start in 8 Cancel Play now Theresa May talks about nurses using Food Banks Share this video Get daily   Thank you for subscribing! Could   \nTheresa May’s claim that the EU is trying to interfere in the general election has been condemned as “paranoia” by a Labour candidate. \nBut the Conservative leader’s claims could have a damaging impact on North East jobs by making it harder to get a good Brexit deal for Britain, it was claimed. \nCatherine McKinnell , Labour’s candidate in Newcastle North, said she was concerned that Mrs May’s comments risk “totally souring our relations” with the EU. \nIt follows the Prime Minister’s statement on Wednesday in which she accused Brussels and EU leaders of trying to affect the result of the June 8 general election, and said they wanted to ensure the UK failed to prosper after Brexit. \nMrs May was responding to leaked reports of a meeting with European Commission President Jean-Claude Juncker, which said the talks had gone badly. \nGerman leader Angela Merkel then said in a speech that “some in Britain still have illusions” about the Brexit process, in an apparent reference to the meeting. Prime Minister Theresa May makes a statement in Downing Street, London, after visiting Queen Elizabeth II at Buckingham Palace to mark the dissolution of Parliament for the General Election (Photo: PA) \nAnd it emerged that the EU was asking the UK to pay 100 billion Euros as it exited the EU , based on its share of EU liabilities and contributions the UK owes. \nAll this prompted a remarkable statement from Mrs May, who said: “Britain’s negotiating position in Europe has been misrepresented in the continental press. The European Commission’s negotiating stance has hardened. \n“Threats against Britain have been issued by European politicians and officials. \n“All of these acts have been deliberately timed to affect the result of the General Election that will take place on June 8.” \nMs McKinnell said the Prime Minister was attempting to appear tough, but the result would be damage to the North East’s economy. \nShe said: “The bunker mentality and level of paranoia now being displayed by Theresa May is really quite disturbing and it’s actually like listening to Donald Trump. \n“We need to secure the best possible deal for Britain, and yet she risks totally souring our relations with Europe before the negotiations have even properly begun. \n“This has enormous consequences for the North East economy and local jobs, given so many of our region’s firm trade with Europe. It’s really shocking that she is willing to put that at risk, for the sake of appearing tough at this election.” Catherine McKinnell spoke out after new statistics from Australia show smoking is at an all time low \nA spokesman for Mr Juncker dismissed the Prime Minister’s claims, saying his office was “too busy” to meddle in the election. \nThe president of the European Parliament, Antonio Tajani, also insisted there was no attempt to influence the vote, Speaking at a Brussels press conference, Mr Tajani said: “We are not seeking to influence the result in the UK.” Read More Newcastle Labour candidate sparks backlash after controversial tweet about Prince Philip \nMrs May’s comments follow claims that Russia interfered in last year’s US presidential elections to support Donald Trump. \nLeaving the EU will not be quick or painless for Britain, the European Commission’s chief negotiator has warned. \nMichel Barnier refused to be drawn on reports the Commission plans to hand Theresa May a bill of 100 billion euro (£84.5 billion), but said there must be a “settling of accounts”. \nBut Brexit Secretary David Davis insisted “we will not be paying 100 billion”. \nHe said, if Brussels failed to reach a deal acceptable to Britain, the UK would pay nothing. Like us on Facebook", "external_links": [], "published": "2017-05-04T23:22:00.000+03:00", "crawled": "2017-05-04T18:41:31.000+03:00", "highlightTitle": ""}