{"organizations": [], "uuid": "bc56730b0500d9a6ae96df05f9a6f04c0497a877", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12676935.ece/ALTERNATES/s1200/mobile-drivers.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-makes-car-compartment-block-12984844", "country": "GB", "domain_rank": 21960, "title": "Nissan makes car compartment to block mobile phone signals and prevent driver distractions", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan makes car compartment to block mobile phone signals and prevent driver distractions", "spam_score": 0.0, "site_type": "news", "published": "2017-05-04T18:54:00.000+03:00", "replies_count": 0, "uuid": "bc56730b0500d9a6ae96df05f9a6f04c0497a877"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-makes-car-compartment-block-12984844", "ord_in_thread": 0, "title": "Nissan makes car compartment to block mobile phone signals and prevent driver distractions", "locations": [], "entities": {"persons": [{"name": "alex smith", "sentiment": "none"}, {"name": "tomasz kroker", "sentiment": "none"}, {"name": "pete williams", "sentiment": "none"}], "locations": [{"name": "newbury", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "nissan signal shield", "sentiment": "none"}, {"name": "rac", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "nissan juke", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "signal shield", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan motor gb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Nissan makes car compartment to block mobile phone signals and prevent driver distractions The Sunderland manufacturer says the prototype Signal Shield will be built into the arm rest of the Nissan Juke crossover vehicle Share Click to play Tap to play The video will start in 8 Cancel Play now What are the mobile phone law changes? Share this video Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nCar manufacturer Nissan has developed a compartment that blocks mobile phone signals. \nThe Sunderland firm says the prototype Signal Shield, built into the arm rest of its Juke crossover vehicle, will eliminate distractions caused by incoming calls, messages and social media notifications. \nThe box works on the principle of the Faraday cage - invented in the 1830s - which uses material such as a wire mesh to shield its contents from electromagnetic fields. \nAll mobile, Bluetooth and Wi-Fi signals are prevented from reaching inside the compartment once the lid is closed. A Nissan Juke crossover vehicle which has a prototype Signal Shield, built into the arm rest to block mobile phone signals to eliminate distractions caused by incoming calls, messages and social media notifications (Photo: PA) \nPenalties and fines for illegal phone use by drivers doubled to six points and £200 on March 1 following a series of high-profile cases and research suggesting the practice is widespread. \nNissan Motor GB managing director, Alex Smith, said: “Mobile phone use at the wheel is a growing concern across the automotive industry, and indeed society, particularly with the high number of pushed communications such as texts, social media notifications and app alerts that tempt drivers to reach for their devices. Read More Sunderland - a city still divided over Brexit as the UK enters the unknown \n“The Nissan Signal Shield concept presents one possible solution for giving drivers the choice to remove all smartphone distractions while driving. This is about delivering more control at the wheel, not less. \n“Some drivers are immune to the activity of their smartphone, but for those who struggle to ignore the beeps and pings, this concept provides a simple solution in this very connected world we live in.” Nissan's prototype Signal Shield, built into the arm rest of their Juke crossover vehicle, which blocks mobile phone signals to eliminate distractions caused by incoming calls, messages and social media notifications (Photo: PA) \nAn RAC survey of more than 1,700 UK motorists found that the proportion who admit to using a hand-held phone behind the wheel increased from 8% in 2014 to 31% last year. Read More Why can't patients use mobile phones in NHS hospital wards? \nIn October, lorry driver Tomasz Kroker was jailed for 10 years after killing a woman and three children by ploughing into their stationary car while distracted by his phone on the A34 near Newbury, Berkshire. \nTwenty-two people were killed and 99 seriously injured in accidents on Britain’s roads in 2015 where a motorist using a mobile was a contributory factor, Department for Transport figures show. \nRAC road safety spokesman, Pete Williams, said: “Our research shows that hand-held phone use by drivers has reached epidemic proportions. \n“As mobile phone technology has advanced significantly, many people have become addicted to them. However, the use of a hand-held phone when driving represents both a physical and mental distraction and it has been illegal since 2003. \n“The Nissan Signal Shield is a good example of a technology that can help drivers be phone smart. \n“For those who can’t avoid the temptation, this simple but pretty clever tech gives them a valuable mobile-free zone.” Like us on Facebook", "external_links": [], "published": "2017-05-04T18:54:00.000+03:00", "crawled": "2017-05-04T14:25:22.000+03:00", "highlightTitle": ""}