{"organizations": [], "uuid": "c4acf1fce648d0943c45ead250d5d86c1eb1647c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13037167.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-should-vote-2017-general-13036887", "country": "GB", "domain_rank": 21960, "title": "Who should I vote for in the 2017 general election? The runner and riders are all here", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-15T20:46:00.000+03:00", "replies_count": 0, "uuid": "c4acf1fce648d0943c45ead250d5d86c1eb1647c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-should-vote-2017-general-13036887", "ord_in_thread": 0, "title": "Who should I vote for in the 2017 general election? The runner and riders are all here", "locations": [], "entities": {"persons": [{"name": "caroline lucas", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "jonathan bartley", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "north east ukip", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "united kingdom independence party", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour  labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Who should I vote for in the 2017 general election? The runner and riders are all here Here's a guide to the parties and what they believe in - so who will get your vote in this June's General Election? Share   General Election polls and projections: May 15 Share this video Get     \nDeciding how to vote in the June 8 general election isn’t easy. \nMost candidates standing for election will be representing one of the political parties. \nAnd people usually vote based on which party they support. \nBut there are exceptions. If there’s a candidate in your constituency who seems particularly impressive based on their commitment to the local area then you could consider backing them, regardless of which party they’re in. \nIf not, then you might choose who to vote for based on their party: Who should I vote for in the 2017 general election? Conservatives \nThe Conservatives , also known as the Tories, are currently in Government. \nThey are led by Theresa May, the Prime Minister. So if they win this election then she will continue as Prime Minister. \nMrs May actually opposed Brexit in last year’s EU referendum. But now, she says she’s going to ensure Brexit happens and is a success. \nConservatives are traditionally seen as the party which backs business and wealthier people. \nBut they’ve tried to change their image in recent years, for example by cutting taxes for working people on average and below-average salaries. \nMrs May’s plans include allowing councils to build more council homes. Labour \nLabour are the main opposition party. \nIn practice, if any party is going to replace the Conservatives as the Government, it can only be Labour. \nTheir leader is Jeremy Corbyn. So if Labour wins the general election, Mr Corbyn will become Prime Minister. \nLabour also opposed Brexit in last year’s referendum, but now say they respect the result of the vote and want Brexit to be a success. \nLabour is usually seen as the party most committed to helping the poorest people in society, and to funding public services such as the NHS. \nAnd Labour says it plans to increase NHS funding by £37 billion over five years if it wins the general election, funded partly by putting up taxes for people on salaries of £80,000 a year or more. Liberal Democrats \nThe Liberal Democrats , also known as the Lib Dems, have traditionally been seen as the “third party” in the UK. \nThat means they don’t have enough MPs to form a government, but they do have enough to be important. \nBut the Lib Dems lost a lot of MPs at the last election, in 2015. This seems to be because they were part of a Coalition government with the Conservatives from 2010 to 2015, and some of their traditional supporters were unhappy about this. \nThey are often seen as a “centre” party, somewhere in between Labour and the Conservatives. \nThey also have a history of supporting equal rights for minorities and civil liberties. \nTheir current leader is Tim Farron. \nLiberal Democrat policies include making cannabis legal, so you can buy it in shops. \nThey also want to have a second referendum on Brexit, giving people the chance to vote to stay in the EU after all. Read More Voting survey reveals the Conservatives could take safe Labour seat in the North East UKIP \nThe United Kingdom Independence Party , usually known as UKIP, campaigned for the UK to leave the EU back when the other parties, and most of the media, dismissed the idea as silly. \nTheir leader for many years was Nigel Farage, who became very well known. \nNow they are led by Paul Nuttall. \nTheir policies include banning people from covering their faces in public. This would include a ban on face veils worn by some Muslim women. Green Party \nThe Green Party is known as a party with a strong commitment to protecting the environment. \nBut it has policies on other issues too. It’s usually seen as a left-wing party, although the Greens call themselves “progressive”. \nPolicies include building 500,000 socially rented homes to provide new, affordable homes to thousands of families. And they want to scrap tuition fees paid by university students. \nThe Green Party has two leaders - Caroline Lucas and Jonathan Bartley. Like us on Facebook", "external_links": [], "published": "2017-05-15T20:46:00.000+03:00", "crawled": "2017-05-15T16:05:23.000+03:00", "highlightTitle": ""}