{"organizations": [], "uuid": "e16c1391bc985a15686a2fa5b75b92f735afac54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13002744.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/case-creativity-election-plea-john-13002530", "country": "GB", "domain_rank": 21960, "title": "The case for creativity - an election plea by John Kampfner ahead of The Journal Culture Awards", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The case for creativity - an election plea by John Kampfner ahead of The Journal Culture Awards", "spam_score": 0.0, "site_type": "news", "published": "2017-05-09T01:00:00.000+03:00", "replies_count": 0, "uuid": "e16c1391bc985a15686a2fa5b75b92f735afac54"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/case-creativity-election-plea-john-13002530", "ord_in_thread": 0, "title": "The case for creativity - an election plea by John Kampfner ahead of The Journal Culture Awards", "locations": [], "entities": {"persons": [{"name": "john kampfner", "sentiment": "negative"}, {"name": "angel of the north", "sentiment": "negative"}, {"name": "antony gormley", "sentiment": "none"}, {"name": "chris ramsey", "sentiment": "none"}, {"name": "kathryn tickell", "sentiment": "none"}, {"name": "daniel hope", "sentiment": "none"}, {"name": "sarah millican", "sentiment": "none"}, {"name": "callum evans", "sentiment": "none"}, {"name": "lady macbeth", "sentiment": "none"}, {"name": "david almond", "sentiment": "none"}, {"name": "rachel unthank", "sentiment": "none"}, {"name": "daniel blake", "sentiment": "none"}], "locations": [{"name": "west end", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "wearside", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "durham cathedral", "sentiment": "none"}, {"name": "creative industries federation", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "creative industries federation like", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "hexham abbey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "John Kampfner (inset) and The Angel of the North (main pic) Share Get what's on updates   Thank you for subscribing!   \nSince the Angel of the North spread its wings nearly 20 years ago, Sir Antony Gormley’s giant sculpture has been an important symbol of the ambition of the North East and a new creative economy. \nA region once renowned for its heavy industry and manufacturing has been in the vanguard of recognising the potential of businesses such as film and television production and the economic as well as intrinsic value of world-class culture presented in venues such as Sage Gateshead. \nThe North East demonstrates how powerful a tool culture can be in promoting civic pride and generating new jobs and is a key contributor to a sector which is the fastest growing part of the British economy, worth £87bn (gross value added). \nIt is the sector we at the Creative Industries Federation – a not-for-profit body representing the arts, creative industries and cultural education – was set up to champion and we are delighted to be joining you and some of our members in celebrating the region’s talent at The Journal Culture Awards at Hexham Abbey on Thursday. \nBritain’s reputation as a global cultural powerhouse has been built on talent such as that recognised in past Culture Award winners including the writer David Almond, musicians Rachel Unthank and Kathryn Tickell and the comedian Sarah Millican, as well as rising stars such as the standup Chris Ramsey and West End performers Callum Evans and Daniel Hope. Read More Have fun after hours as The Late Shows returns with new venues and attractions \nYet talent is rarely enough to guarantee success. \nThere is also a need for investment, on infrastructure, such as fast broadband connections and affordable workspace, and in public funding of the arts and tax credits for film and animation production. \nA good creative education, such as that offered by the universities of Sunderland, Newcastle and other Federation members, is also a key building block in the creation of acclaimed British exports such as I, Daniel Blake and arthouse entertainment like Lady Macbeth, filmed in Wearside. \nIt makes it ever more important to recognise and address some of the challenges facing the sector today, such as public spending cuts, the Brexit trade negotiations and education policies which have contributed to the marginalisation of creative subjects in schools. \nTo focus the thinking, we have produced our own 10-point general election manifesto which we will be discussing with politicians of all parties and at every level of government, from local authorities and LEPs (local enterprise partnerships) to No 10. Read More Is Newcastle now Britain's poetry capital? Events next week make a good case for it \nA key element is education. \nOne in 11 of the national workforce is now employed in the creative economy and there is huge potential to deliver more jobs. Yet a focus on ‘traditional’ subjects in schools means take-up of subjects such as design and technology has fallen dramatically. \nWe are not educating our young people with the right mix of creative and technical skills for many of the posts that are available. \nThere are already government-recognised skills shortages in parts of the creative industries such as animation and visual effects. If this was addressed in the right way, it could be your children working on the set of the new Avengers movie currently being filmed at Durham Cathedral. \nTo open up the creative industries to all young people and not just those who already have the right contacts, we propose a creative careers campaign to counter existing advice which is often poor or misleading. \nA skills commission should identify what exactly we should be teaching in our schools and colleges to prepare the workforce for jobs of the future – including those that might not even have been invented yet. Read More Following War Horse comes Running Wild and a man who knows puppets inside out \nOther proposals aim to help the thousands of small creative businesses and freelancers who are the bedrock of the creative sector. \nWe argue that a ‘business booster’ network, for instance, should provide advice on intellectual property law, finance and exporting in the early, often risky, stages of a company’s development. \nAs we look towards the future, the creative sector will be at least as important for the British economy as traditional industries such as car manufacturing. \nThe North East has built a strong record in this area and will have another opportunity to showcase its fantastic art and culture in the Great Exhibition of the North next year. \nIt is also impressive to see how historic rivalries are being put aside as Newcastle backs Sunderland’s bid to be UK City of Culture in 2021. \nThat’s exactly the kind of joined-up thinking that delivers results. It is what we want to see happening UK-wide. \nJohn Kampfner, chief executive, Creative Industries Federation Like us on Facebook", "external_links": [], "published": "2017-05-09T01:00:00.000+03:00", "crawled": "2017-05-08T20:29:19.000+03:00", "highlightTitle": ""}