{"organizations": [], "uuid": "6074c4b58583d077fbbb74aa8dcdc4e16ca1e444", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30312401/15986740.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/labour-accuses-tories-buying-off-voters-in-exeter-with-front-page-newspaper-ad/story-30312401-detail/story.html", "country": "GB", "title": "WMN_PGoodwin commented Labour accuses Tories of buying votes in Exeter with front-page...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "WMN_PGoodwin commented Labour accuses Tories of buying votes in Exeter with front-page...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-04T22:30:00.000+03:00", "replies_count": 0, "uuid": "6074c4b58583d077fbbb74aa8dcdc4e16ca1e444"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/labour-accuses-tories-buying-off-voters-in-exeter-with-front-page-newspaper-ad/story-30312401-detail/story.html", "ord_in_thread": 0, "title": "WMN_PGoodwin commented Labour accuses Tories of buying votes in Exeter with front-page...", "locations": [], "entities": {"persons": [{"name": "po", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jim parker", "sentiment": "none"}, {"name": "patrick phelvin", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}, {"name": "helston", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "tories labour", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "express & echo", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "trinity mirror", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour accuses Tories of buying votes in Exeter with front-page election advert By WMN_PGoodwin | Posted: May 04, 2017 2 COMMENTS SHARES Ben Bradshaw hit out after his local paper sold an ad to the Tories Labour accuses Tories of buying votes in Exeter with front-page election advert X \nCopy link to paste in your message / Comments (2) \nLabour has accused the Conservatives of trying to buy off the electorate in Exeter with a front page advertisement in the local paper - because they don't have the \"foot soldiers\" on the ground. \nBen Bradshaw, MP for Exeter since 1997, has attacked the Tories for lavishing \"thousands of pounds\" on a wrap-around advert urging voters to support \"Theresa May for Britain\". \nThe paid-for promotion appeared in the Exeter and East Devon editions of the Express & Echo on Thursday as the polls opened for Devon County Council elections. \nReaders took to social media to accuse the weekly title of bias, with one Twitter user branding it a \"Tory rag\". \nMr Bradshaw, who worked as a reporter at the newspaper – one of four titles in Devon now owned by Trinity Mirror, along with the website Devon Live – said most readers understood it was an advert. \n\"The Tories are spending thousands of pounds all over the country in newspaper advertisements to buy this election because they don't have the foot soldiers on the ground,\" he told Devon Live. \n\"We have scores of local Exeter volunteers out every day talking to the people of the city about their concerns and following them up and we are getting a fantastic reception for me as their local MP.\" \n\"I think most Echo readers will recognise this for what it is – a paid advert – because the Conservatives have got no effective way of campaigning in Exeter and they are targeting the seat in an attempt to defeat me. \nRead: Tory blogger says the political map of Devon will remain unchanged on June 9 \n\"Exeter is the Tories' number one target in the South West because I am the only non-Conservative MP this side of Bristol. \n\"They will be throwing a lot of money at this seat and if the current national polls where repeated here they could win it. We are finding more positive responses to me personally on the doorstep.\" \nThe E&E was just one of many titles around the country to carry the ad after owners Trinity Mirror signed a national promotional deal. \nIt was billed on the front as an \"advertiser's announcement\" and mentioned the Conservative Party in a footnote in small type. \nThe four-page pull-out repeated campaign messages and urged voters to choose \"strong and stable leadership\" over a \"coalition of chaos and instability\". \nA letter from Theresa May on the back page was devoted to the Prime Minister's plans for Brexit, claiming a vote for \"my Conservative candidate\" was the only way to \"get this right\". \nIt came just days after Theresa May angered media in Cornwall by denying a reporter from Trinity Mirror access to a factory visit in Helston. \nMrs May has been criticised for not meeting the public and resorting to slogans rather than engaging in debate as she bids to win the snap General Election she called for June 8. \nShe visited Plymouth on her campaign tour on Tuesday but by-passed Exeter as she continued on to Bristol. \nRead: Five questions we would ask Theresa May if she showed up in Exeter \nThe Express & Echo insisted the promotion did not signal support for Mrs May or the Conservatives. \nThe edition carried stories including criticism of local Tories including a council candidate who was slammed for Twitter rants. \nThe East Devon edition front-page splash was a probe into a senior Conservative's alleged failure to declare a financial interest in a planning application.\" \nJim Parker, print editor for Trinity Mirror's four Devon titles, said: \"We would just like to emphasise that this week's wrap-around of the Echo is an advertisement paid for by the Conservative Party. \n\"The Echo has always been and will continue to be politically independent.\" \nPatrick Phelvin, editor of Devon Live, the county-wide website which provides content for the Express & Echo said: \"There is a distinct line between paid-for content and editorial content which we are proud to uphold. \n\"All our reporters and writers are impartial and work hard to ensure content is balanced and fair.\" \nThe Conservatives have been contatced but have yet to make any comment. ", "external_links": [], "published": "2017-05-04T22:30:00.000+03:00", "crawled": "2017-05-04T19:49:05.000+03:00", "highlightTitle": ""}