{"organizations": [], "uuid": "f2cb15a4c59a8895cf853f188f6aa59b6b525d3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12972468.ece/ALTERNATES/s1200/JS117936800.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12972435", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Juncker '10 times more sceptical' after Brexit talks with PM, report claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Juncker '10 times more sceptical' after Brexit talks with PM, report claims", "spam_score": 0.0, "site_type": "news", "published": "2017-05-02T14:55:00.000+03:00", "replies_count": 0, "uuid": "f2cb15a4c59a8895cf853f188f6aa59b6b525d3d"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12972435", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Juncker '10 times more sceptical' after Brexit talks with PM, report claims", "locations": [], "entities": {"persons": [{"name": "juncker", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "negative"}, {"name": "jean-claude juncker", "sentiment": "negative"}, {"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Bovis putting customers first after complaints over poor-quality homes \nHousebuilder Bovis Homes said it has made “clear progress” in addressing customer complaints over the poor quality of its properties. \nThe Kent-based group has been dogged by complaints over homes that were sold unfinished and had electrical and plumbing faults. \nBut the firm said in a trading update: \nWe have made clear progress in addressing the issues faced during 2016 and in particular have re-established a ‘customer first’ culture across the business. \nThe group is confident it will deliver on its expectations for 2017. \nBovis has already made a £7m provision to cover remedial work and compensation for affected customers and the group has announced a raft of measures to improve service. This includes more staff to deal with complaints, the creation of a dedicated homebuyers’ panel and an improved quality assurance process. \nChief executive Greg Fitzgerald, who is leading a strategic review of the business, said: \nThe clear focus for 2017 is on improving our production processes and efficiency, thereby ensuring we deliver quality homes to our customers. \nBy the end of June I will have visited all our developments and met the majority of our people; we have already identified improvements to streamline the business, provide greater focus and be more agile. \nBovis said trading in the first four months of the year was in line with expectations, with customer interest strong and demand for homes “robust” across all regions, with modest house price inflation seen in the period. \nThe group said its sales rate of 0.48 net private reservations per site per week is in line with its production plans and reflects a “controlled sales release”. \nBovis also said it will continue to deliver “shareholder value” following aborted attempts by rivals Galliford Try and Redrow to take over the housebuilder. The firm added: \nWe are clear in our goal of delivering shareholder value through maximising returns from the group’s valuable landbank and returning Bovis to being an industry-leading housebuilder. \nGreg Fitzgerald will conclude a strategic and structural review of the group over the coming months and will provide an update with the half-year results announcement. Bovis Homes development (Photo: PA) 9:08 Jonathon Manning Head back to the Roaring Twenties with new bar from top North East hotelier \nAround 25 new jobs have been created at Newcastle city centre’s newest bar which will aim to transport guests back to the Roaring Twenties. \nColonel Porter’s – full name Colonel Porter’s Tavern, Botanical Garden and Rhum Bar – is opening in Milburn House, Dean Street, following a full makeover for the former Canteen and Cocktails venue. \nTaking its name from Colonel J. Porter, the creator of Newcastle Brown Ale, who originally came up with the brew in 1925, the Victorian-style bar has been created by John Adamson, managing director of Durham-based Ramside Estate Group, which includes the prestigious Hardwick Hall and Ramside Hall hotels. \nMr Adamson, who also owns Bar Beyond at The Gate, has invested a significant sum into converting the bar, completely ripping out the interior that had been more modern and building a secret backroom bar called Archie’s Lab, where rum classes will take place, hidden behind a library wall. \nThe centrepiece of the room will be a giant flowering tree which spreads out across the ceiling, alongside stuffed animal heads and a roll of honour featuring numerous well-known North East names. \nAlong with a range of cask ales, the bar will offer more than 100 rums and a full programme of unusual events including “tipsy teas” and talks by politicians, explorers and entrepreneurs. \nAround 25 jobs have been created, with an undisclosed sum invested in creating the transformed bar. John Adamson who is shortly to open a new bar in Dean Street, Newcastle (Photo: newcastle chronicle) 8:55 Jonathon Manning Rising oil prices and cost cutting help BP return to profit \nOil giant BP has returned to profit in the first three months of the year thanks to rising oil prices and ongoing cost cutting efforts. \nThe group said it swung out of the red with replacement cost profits of $1.4bn (£1.1bn) for the first quarter against losses of $485m (£377m) a year earlier. \nA bounce back in oil prices saw Brent crude stand around 58% higher than a year earlier in the first quarter, at around $53.69 a barrel. \nBob Dudley, group chief executive of BP, said the year had “started well” for the group. \nHe added: \nBP is focused on the disciplined delivery of our plans. First quarter earnings and cash flow were robust. \nOn an underlying basis, BP nearly trebled replacement cost profits to $1.5bn (£1.2bn) from $532m (£413m) a year earlier. \nThe better-than-expected figures came after BP said it saw a 5% rise in production, boosted as the first of a raft of new projects came on stream. \nMr Dudley said: \nThe first of our seven new upstream major projects has started up, with a further three near completion. \nWe expect these to drive a material improvement in operating cash flow from the second half. \nThe figures follow impressive earnings reports from US rivals ExxonMobil and Chevron last week as the industry benefits from a bounce back in crude prices, which had hit near 13-year lows early last year. BP’s closest rival, Royal Dutch Shell, is also expected to post a leap in profits when it reports on Thursday. \nFirst quarter figures from BP come after it revealed last month it had slashed Mr Dudley’s 2016 pay package by 40% and cut his maximum earnings by $3.7m (£2.9m) to see off a fresh shareholder rebellion. \nIts annual report showed Mr Dudley’s pay package was cut to $11.6m (£8.5m) as the group looked to avoid a repeat of last year’s investor revolt, when almost 60% of BP shareholders voted against his 20% pay hike. BP boss Bob Dudley (Photo: Dominic Lipinski/PA Wire) 8:48 KEY EVENT Work starts on new homes at Vivo Northshore \nConstruction has started on the third phase of an 82 home development in Stockton on Tees. \nA ground breaking cermony was held last week to mark the official start of the latest phase of the residential development at Northshore on the banks of the River Tees and close to the Infinity Bridge. \nNational developer and urban regeneration specialist, Muse, is delivering the £300 million Northshore regeneration scheme in partnership with HCA and Stockton Borough Council. \nNational developer and urban regeneration specialist, Muse, is delivering the £300 million Northshore regeneration scheme in partnership with HCA and Stockton Borough Council. \nWhen complete, the 56 acre development will provide a mix of family housing, offices, a new Hampton by Hilton hotel and leisure space. \nThe scheme has already delivered 126 new homes, Fusion Hive - a 36,000 sq ft Innovation Centre for digital and technology sector start-ups and a 43,000 sq ft head office for Thirteen Housing Group. \nSimon Dew, Senior Development Surveyor at Muse, said: \nFollowing the success of phases one and two at Vivo Northshore, Muse has continued its investment into more housing, with another 82 family homes now under construction. The new homes will follow in the footsteps of the previous phases, focusing on innovative and contemporary design with many offering stunning riverside views. \nIt’s been great to see the Northshore community develop over the past few years and this latest phase of housing will be a further positive addition to the area, which is now a vibrant and attractive place to live, work and visit. \nThe proposed 128 bed Hampton by Hilton hotel recently received planning permission and work is due to start on the site in the Summer of this year. Housing provider Thirteen Group also purchased 20 two and three bed houses at the development, which will be available for shared ownership. \nLeader of Stockton-on-Tees Borough Council, Councillor Bob Cook, commented: \nVivo at Northshore is already providing high quality housing and is in a fantastic location with stunning views of the River Tees, water sports and other leisure activities in close proximity and the shops, cafes, bars and eateries as well as the nationally acclaimed events and festivals of Stockton Town Centre just a short walk away. \nIt is great to see this latest stage of Vivo get under way complementing the homes which have already been constructed as well as the office space occupied by Fusion Hive and Thirteen. 8:43 Jonathon Manning Just Eat revenues soar as more customers order food online \nRevenues at online delivery firm Just Eat rocketed in the first quarter as it continues to benefit from hungry customers ordering food online. \nSales rose 46% to £118.9m in the three months to March 31, with UK orders rising 17% to 24m. On a like-for-like and currency neutral basis, revenue was up 40% and total orders grew 25% to 39m. \nJust Eat said the figure would have been higher had it not been for an early Easter and one day less of trading because of the leap year. \nJust Eat is experiencing management upheaval, with chief executive David Buttress forced to step down in February due to “urgent family matters” and chairman and interim boss John Hughes also taking a leave of absence in order to undergo treatment for a medical condition. \nInterim chief executive Paul Harrison said: \nJust Eat has enjoyed another period of strong growth. \nIn addition to structural market growth, we are also seeing the benefits of ongoing investments in technology and marketing. \nThe firm reiterated its full year guidance of revenues of between £480m and £495m, and underlying earnings of between £157, and £163m. 8:38 KEY EVENT Newcastle app firm Gospelware are global Webby Award winners \nA North East app firm will jet to New York to claim an international award after triumphing against some of the biggest names in the global. \nGospelware has triumphed against global giants Dollar Shave Club and Metropolitan Museum of Art New York to scoop a Webby, international awards which see companies from more than 70 countries compete for prizes. \nThe Newcastle firm has won the award for Best User Interface on mobile app project Realrider, having been the only UK company in its category and one of only a handful of UK firms across the awards to win a prize. Gospelware succeeded out of 13,000 entries including all 50 US states. \nThe work submitted by Gospelware showed its interface design of mobile app Realrider for their client Realsafe Technologies, a multi-award winning motorcycle app that keeps riders ‘safe and connected’ with its built in crash detection technology. \nIn the event of an accident, the crash detection technology feature sends a rider’s location, medical information and contact details to emergency services allowing riders to be found within the ‘golden hour’ for optimal chance of survival, and it is the first app to be 999-certified. \nNow the senior teams at Gospelware and Realrider are preparing for a trip across the ocean to New York for the Webby Awards grand final, being held at the Cipriani Hotel’s on Wall Street on May 15, ahead of a star-studded after party at The Highline Ballroom, complete with DJ set by Roots member Questlove. \nRyan Davies, managing director of Gospelware said: \nThe Webby Awards are awesome, and it’s great to win the best user interface especially being the only UK company in our category. We’ve wanted to win a Webby since we started the business six years ago. \nThis is a massive achievement for the team, I couldn’t be prouder of the hard work that went into this. Left to right: lead designer on the project, Paul Bingham, MD Ryan Davies and CTO Michael Dunn - Ryan and Michael the co-founders of Gospelware (Photo: Gospelware) 8:33 Jonathon Manning Ward Hadaway achieves top IT safety accreditation \nNewcastle law firm Ward Hadaway has received a cyber security seal of approval for its IT systems and processes. \nThe firm, which has offices in Newcastle, Leeds and Manchester, has achieved the Government-backed Cyber Essentials Plus. \nThe firm’s IT team worked alongside IT company Pulsant to make sure Ward Hadaway’s systems passed an inspection. Following the successful inspection the firm was awarded with the Cyber Essentials Plus accreditation by accreditation body IASME \nDavid Bullock, IT director at Ward Hadaway, said: \nCyber Essentials Plus is a high standard of accreditation when it comes to Government-approved cyber security measures so we are delighted to have achieved the standard. \nThis is a tremendous achievement by everyone involved and securing Cyber Essentials Plus will make a major difference both to the staff who work at Ward Hadaway and to our clients. \nIt ensures that as a firm we can continue to bid for work from an increasing list of Government and public sector organisations whose suppliers must have Cyber Essentials Plus. \nIt also gives additional peace of mind to all our clients that we are doing what we can to help ensure that their information, interests and data are being kept secure. \nJamie Martin, managing partner at Ward Hadaway, said: \nDavid and the IT team at Ward Hadaway deserve a huge amount of credit for the way they have achieved this important accreditation for the firm. \nOur aim as a law firm is to always provide the very best in client service and securing Cyber Essentials Plus is very much a part of that. \nProtecting data, information and IT systems is a vital part of being a law firm in the 21 st century. Jamie Martin, managing partner at Ward Hadaway 8:28 Jonathon Manning Ladies only to men only: These Girls Can Run looks to expand community running group \nA woman who turned a mission to get fit into an award-winning running community for women only is now vying to create a similar group for men . \nKim Scott took up running around 10 years ago when she set about losing weight, putting on her trainers “under the cover of darkness” instead of going to the gym where she feared others would judge her. \nAs she lost weight she gained confidence and saw the need for groups that could make running more accessible for other women, of all abilities, where they could train in a safe and supportive environment. \nTwo years after setting up the first These Girls Can Run group, in Cramlington, Northumberland, the community has grown to 10 groups across the North East, with more set to get out of the starting blocks this year, thanks to a following of more than 4,000 who have been inspired to get back into running and fitness. \nNow Mrs Scott, who received the best newcomer award at the Chronicle’s Glass Slipper Awards held in February, is aiming to launch a similar community of groups just for men, with help from the Entrepreneurial Spark Powered By NatWest programme based at NatWest’s Newcastle Quayside offices. \nMrs Scott, 39, said: \nIn my early twenties I was very overweight and knew I needed to do something to get fit. I didn’t want to use a gym as I was worried that people would judge me on my size and lack of fitness. Although I had hated running at school, it was something I could do on my own under cover of darkness so I decided to give it a try. \nRunning became part of my daily life and soon it was about much more than weight loss. It helped me deal with the stresses of daily life, and after the birth of my two beautiful girls it helped me through Post Natal Depression and gave me some much needed ‘me time’. \nI knew there had to be so many other women out there who felt the same. Women who wanted to do something to have fun and be active, who maybe lacked the confidence to join a gym or run on their own - women who could benefit from the support of a group which wasn’t competitive Glass Slipper Awards at the Hilton Hotel in Gateshead: Kim Scott with sponsor Nicola Wrightson (left) (Photo: Newcastle Chronicle) 8:23 Jonathon Manning UK holiday park firms rake in £2.7bn as staycations popularity rises \nBritain’s biggest holiday parks raked in £2.7bn last year and are in line for a further boost as the Brexit-hit pound inspires a rise in staycations, a report said. \nThe UK’s 100 largest caravan, camping and holiday parks saw turnover climb 9% to £2.67bn in 2016, up from £2.46bn five years ago, according to research by Ortus Secured Finance. \nStaycations have taken on a broader appeal since the recession as a cheaper alternative to an overseas holiday. Sterling’s slump against the US dollar and the euro since the EU referendum vote has also made holidaying at home more attractive, as the pound’s weakness bumps up the cost of foreign travel. \nJohn Salisbury, Ortus managing director, said: \nCaravan, camping and holiday parks are going from strength to strength, combining value for money with high standard facilities to maximise the guest experience. \nThe recession and the ensuing trend for ‘staycations’ gave holiday parks, camping and caravan sites access to an even broader customer base, and they have been building on this ever since. \nBritain’s holiday park firms have become the subject of a flurry of private equity deals, with robust growth and solid revenues catching the eye of investors. \nActivity has included the £1.35bn sale of Newcastle-headquartered Parkdean Resorts , the UK’s largest caravan operator, to Canadian private equity firm Onex Corporation in December. \nPark Leisure was snapped up for £103m by a consortium led by Midlothian Capital Partners, while Intermediate Capital Group bought Park Holidays for £362m last year. Flags of St George, the flag of Scotland and the Great Britain flag (Photo: PA) 8:18", "external_links": [], "published": "2017-05-02T14:55:00.000+03:00", "crawled": "2017-05-02T10:05:52.000+03:00", "highlightTitle": ""}