{"organizations": [], "uuid": "f65dd6225ce464a68222c4b12ac092bcebf98a90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13005593.ece/ALTERNATES/s1200/Passport-control-at-Gatwick-Airport.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/warning-over-impact-conservatives-migration-13005462", "country": "GB", "domain_rank": 21960, "title": "Warning over impact Conservatives' migration target would have on North East economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Warning over impact Conservatives' migration target would have on North East economy", "spam_score": 0.0, "site_type": "news", "published": "2017-05-09T12:00:00.000+03:00", "replies_count": 0, "uuid": "f65dd6225ce464a68222c4b12ac092bcebf98a90"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/warning-over-impact-conservatives-migration-13005462", "ord_in_thread": 0, "title": "Warning over impact Conservatives' migration target would have on North East economy", "locations": [], "entities": {"persons": [{"name": "theresa may con", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "paul carbert", "sentiment": "none"}, {"name": "stephen martin", "sentiment": "none"}, {"name": "mrs rudd", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gatwick airport", "sentiment": "none"}], "organizations": [{"name": "northumbria university", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "neecc", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "institute of directors", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "border force", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Warning over impact Conservatives' migration target would have on North East economy Theresa May confirms the Conservatives will continue trying to get migration below 100,000 despite failing so far Share Click to play Tap to play The video will start in 8 Cancel Play now Theresa May on net migration target Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusiness leaders have warned they need immigrants to fill vacancies, as Prime Minister Theresa May confirmed the Conservative manifesto will repeat a promise to get net migration below 100,000. \nThe Tories first promised in 2010 to get net migration, the difference between the number of people coming in to the country and the number leaving, into the tens of thousands. \nBut the Government has failing to live up this pledge, and latest figures showed net migration dropped to 273,000 in the year to September, the first time in two years the balance of people arriving and leaving the UK dipped below 300,000. Prime Minister Theresa May (Photo: PA) \nMrs May has now confirmed that the promise will continue to be Conservative policy going in to the General Election . \nBut the North East England Chamber of Commerce (NEECC) urged Ministers to consider the needs of the region, and highlighted the benefits overseas students bring to North East universities. \nPaul Carbert, NEECC policy adviser, said: “Our members want to see flexible migration rules that allow businesses in our region to retain and compete for highly skilled overseas talent. \n“Building and maintaining our overseas links is a key priority to help create a Global North East. Our five world-class universities attract international students and staff who bring enormous economic, societal and cultural benefits to the region, and this must not be put under threat by Government attempts to reduce net migration.” Northumbria University (Photo: Newcastle Chronicle) \nThe Institute of Directors, which represents smaller businesses, also issued a warning. \nStephen Martin, its director general, said: “A target is a poor substitute for a proper immigration policy. \n“All parties should instead see Brexit as an opportunity to come up with a new system that is good for the economy, but also addresses voters’ concerns.” \nMr Martin called for better training for young people so they can get jobs in developing industries, as well as the removal of international students from official migration figures. \nThe Prime Minister said it was important to hit this target given the pressure immigration had put on public services and those on lower incomes. \nMrs May said: “I think it is important that we continue, and we will continue, to say that we do want to bring net migration down to sustainable levels. \n“We believe that is the tens of thousands, and of course once we leave the European Union we will have the opportunity to ensure that we have control of our borders here in the UK, because we’ll be able to establish our rules for people coming from the European Union into the UK.” \nShe added: “That’s a part of the picture that we haven’t been able to control before and we will be able to control it. \n“Leaving the EU means that we won’t have free movement as it has been in the past.” Border Force check the passports of passengers arriving at Gatwick Airport (Photo: Getty Images Europe) \nConservative sources had earlier said the commitment would appear in the party’s General Election manifesto. \nIt follows comments by Home Secretary Amber Rudd over the weekend in which she appeared to suggest the Government could soften its migration policy. \nMrs Rudd said on Sunday she wanted to “continue to bring immigration down” but stopped short of guaranteeing that the target would be repeated. \nLabour leader Jeremy Corbyn said his party would set out its immigration policy next week. \nHe promised a “fair” and managed immigration system that “works for all”, while pointing out many immigrants have made a “massive contribution” to the NHS, education, industry and public transport services. Read More ", "external_links": [], "published": "2017-05-09T12:00:00.000+03:00", "crawled": "2017-05-09T07:30:31.000+03:00", "highlightTitle": ""}