{"organizations": [], "uuid": "243774ab378dc8b5cd36a044722b70d11bf3ee78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12980411.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/see-moment-furious-leave-voter-12980274", "country": "GB", "domain_rank": 21960, "title": "See the moment furious Leave voter attacks Tim Farron on the campaign trail", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "See the moment furious Leave voter attacks Tim Farron on the campaign trail", "spam_score": 0.0, "site_type": "news", "published": "2017-05-03T21:06:00.000+03:00", "replies_count": 0, "uuid": "243774ab378dc8b5cd36a044722b70d11bf3ee78"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/news/north-east-news/see-moment-furious-leave-voter-12980274", "ord_in_thread": 0, "title": "See the moment furious Leave voter attacks Tim Farron on the campaign trail", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News See the moment furious Leave voter attacks Tim Farron on the campaign trail Video captured the moment the Liberal Democrat leader was shouted at by a man while campaigning near Oxford Share Click to play Tap to play The video will start in 8 Cancel Play now Pensioner confronts Tim Farron during campaign visit Share this video   \nThis is the moment an angry voter disrupted a Liberal Democrat campaign visit to confront leader Tim Farron over his position on Brexit. \nPensioner Malcolm Baker told Mr Farron voters “did know” what they were voting for in the EU referendum and accused him of believing Leave supporters were racist. \nThe party leader was in the middle of a television interview in Kidlington, near Oxford, when the 65-year-old took him to task over his position on the EU. \nMr Baker said voters “do know, we did know” what they were backing in the referendum. \nWhen Mr Farron insisted he did not believe Leave voters were racist, he replied: “Yes, you do. I tell you what, you keep going on all the time...” \nMr Farron questioned the disgruntled voter about whether he was proud his grandchildren “would inherit a poorer, less powerful, less secure country”. \n“I’m proud that they will be coming out of Europe and that we will have our own destiny and not have people telling us we are going to pay £100 billion to get out,” Mr Baker replied. Pensioner Malcolm Baker confronts Liberal Democrat leader Tim Farron while he was the election campaign trail in Kidlington, near Oxford (Photo: PA) \n“If that’s your policies I hope you are going to get six seats.” \nMr Baker added: “I have always voted Labour but I will be voting for Theresa May .” \nHe later told the Press Association: “I’m fed up of hearing this chap keeping on running Britain down.” \nMr Farron said Mr Baker had only voted for Britain’s departure, not the final deal. Read More \nHe told the Press Association: “We didn’t get round to the niceties of the argument. What Malcolm voted for was departure last June. I respect that. \n“He didn’t vote for destination, he wasn’t asked. None of us were asked.” \nThe Lib Dem leader said claims about clashes between the Prime Minister and EU Commission president Jean-Claude Juncker showed how the negotiations were playing out. \n“The destination that we end up at ... we are getting some little clues from May and Juncker about what the next several months might look like, which will be ‘he said, she said’, pointless spats, lots of things behind closed doors, bits of which leak, and the end result imposed on the lot of us with a stitch-up,” he said. \n“That is not democracy. So, for Malcolm’s sake and, dare I say, particularly for his grandchildren’s sake, that stitch-up must not be imposed on the British people. \n“People should have the final say, not the politicians.” Liberal Democrats leader Tim Farron pets cockapoo dog 'Bonnie' whilst campaigning for the British general election at Eastfield regeneration site on April 27, 2017 in Cambridge, England (Photo: Getty Images Europe) \nHe added: “If you believe in democracy and if you believe in the British spirit then neither of those things lead to you rolling over and dying when you have lost the result.” \nAfter initially walking off, Mr Baker returned for a less heated chat with Mr Farron, joking: “I’ve got no eggs on me whatsoever.” Read More \nHe added: “Don’t tell people who voted Leave that they didn’t know what they were voting for.” \nThe pair parted with Mr Farron wishing Mr Baker, who turned 65 on Wednesday, a happy birthday. \nBut the pensioner was not the only aggrieved voter to make their feelings known during the Oxford West campaign event. \nShortly before Mr Farron arrived in Kidlington High Street, a passer-by shouted at the group of Lib Dem activists waiting for the leader: “You and the coalition, bloody Cameron” before booing. \nBut Mr Farron insisted the party is winning back the voters who deserted it last time round. \n“The canvassing that we have been doing already is very, very clear that people who are progressive minded voters don’t need any persuading to know that the Liberal Democrats have the only real hope for them in terms of beating a Conservative here and in terms of providing Britain with a different direction of travel from the one the Conservatives are taking us on.” Like us on Facebook", "external_links": [], "published": "2017-05-03T21:06:00.000+03:00", "crawled": "2017-05-03T16:29:12.000+03:00", "highlightTitle": ""}