{"organizations": [], "uuid": "2470c8b9c3557047b3492d2d58d0ab0579101978", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.skegnessstandard.co.uk/webimage/1.7981122.1495813896!/image/image.jpg", "site_section": "http://www.skegnessstandard.co.uk/rss/cmlink/1.346949", "section_title": "Skegness Standard MSKP.news.feed", "url": "http://www.bostonstandard.co.uk/news/general-election-boston-and-skegness-candidates-talk-health-1-7981129", "country": "GB", "title": "GENERAL ELECTION: Boston and Skegness candidates talk health", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-28T21:00:00.000+03:00", "replies_count": 0, "uuid": "2470c8b9c3557047b3492d2d58d0ab0579101978"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/general-election-boston-and-skegness-candidates-talk-health-1-7981129", "ord_in_thread": 0, "title": "GENERAL ELECTION: Boston and Skegness candidates talk health", "locations": [], "entities": {"persons": [{"name": "matt warman", "sentiment": "none"}, {"name": "louth", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "victoria percival", "sentiment": "none"}, {"name": "paul kenny", "sentiment": "none"}, {"name": "matt warman", "sentiment": "none"}, {"name": "paul kenny", "sentiment": "none"}, {"name": "philip smith", "sentiment": "none"}, {"name": "victoria percival", "sentiment": "none"}, {"name": "philip smith", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "grantham", "sentiment": "none"}, {"name": "mike gilbert", "sentiment": "none"}, {"name": "mike gilbert", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "pilgrim hospital", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "skegness", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "none"}, {"name": "boston & skegness", "sentiment": "none"}, {"name": "skegness", "sentiment": "none"}, {"name": "grantham a&e", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "skegness hospital", "sentiment": "none"}, {"name": "ambulance service", "sentiment": "none"}, {"name": "international health service", "sentiment": "none"}, {"name": "national health service", "sentiment": "none"}, {"name": "pfi", "sentiment": "none"}, {"name": "labour government", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ahead of the election on June 8 we are asking each candidate – in 150 of their own words – to explain their stance on the major topics which affect your everyday lives. - this week, health. \nThe nominations have closed...and we now know our next MP will be one of those featured below. Mike Gilbert (Blue Revolution) \nSix candidates have put their names forward... but who will be victorious on election night? Your votes will decide. \nAhead of the election on June 8 we will be asking each candidate – in their own words – to explain their stance on the major topics which affect your everyday lives. \nThis, we hope, will help inform your decision at the ballot box. \nLast week, our candidates took a look at what many consider to be the central issue of this year’s election – Brexit. Matt Warman (Conservative) \nToday, we continue with another important local issue – health. \nNext week we will also look at education. \nThe Wednesday prior to the election we will also be giving the candidates one last chance to try to win your vote - as they address you directly telling you why you should put a cross at the side of their name. \nWe will then have reaction and coverage from the count at www.bostonstandard.co.uk Victoria Percival (Green Party) \nMIKE GILBERT (BLUE REVOLUTION) – Britain’s health service is under pressure because of Britain’s poor health. We must stop thinking that the tax payer can increase funding come what may. Britain eats, in a post-industrial age, an industrial diet of carbs, fats and sugars and unlike in the past too many of us eat that diet on an industrial scale. Many jobs depend on it! Today it causes problems like diabetes, cancer and strokes. We also have social lives to often influenced by social media, insecure relationships, student indebtedness all causing mental and emotional distress. We need to ensure that we fund the health service properly and have the local expertise necessary to make us well, but we should recognise that as individuals we may need to change too. Diet, stress and anxiety are personal issues before they become medical ones that need expensive healthcare interventions which should ideally be delivered locally and economically. \nMATT WARMAN (CONSERVATIVE) – I hear from patients that doctors, nurses and staff in our health services provide them with excellent care every day, but I know recruiting NHS staff or getting a GP appointment can still be a real challenge. I’ve been clear with health bosses locally and in Westminster that more resources are needed so I welcome my party’s commitment to increase NHS spending by at least £8bn over the next five years, and continue to invest in training new doctors. I am supporting a new medical school for Lincolnshire which will help us train and retain more clinicians. At Pilgrim Hospital, I will continue to back consultant-led maternity services and our excellent Stroke Unit, as well as making sure A&E isn’t overburdened with patients who can’t get a GP appointment. Likewise, we need an approach which allows Skegness Hospital to deliver more services locally, but this must come with proper planning so tourists don’t become a strain on the local healthcare system. \nVICTORIA PERCIVAL (GREEN PARTY) – 40,000 people die from poor air quality in the UK and that figure is rising. There are many options to help improve our air quality, like removing traffic coming through town centres. Good cycle routes, so adults and children feel they can cycle in safety. These simple options would not just improve air quality but people’s general health and fitness. The NHS is part of our British identity, we are incredibly proud of it. The majority of people know the NHS is in crisis. Hundreds of thousands have taken to the streets to stand up for our NHS. For all the staff working under immense pressure, while facing cuts and possible department closure. We should be investing in training people locally and keeping them here. We really need to take the NHS out of politics and just fund it. To ask me more please email victoria.percival@greenparty.org.uk \nPAUL KENNY (LABOUR) – It was a radical Labour Government that in July 1948 brought the NHS into being, giving everyone the right to free healthcare at the point of delivery. Nearly 69 years later, we have the chance to elect a radical Labour Government that will save the NHS for us all. The Tories voted against the formation of the NHS and now under the guise of Sustainability & Transformation Plans are seeking to dismantle it – threatening the Urgent Care Centres in Skegness and Louth, transferring services from Pilgrim Hospital to Lincoln and privatising others. A 2017 Labour Government promises an extra £7.4 billion a year for the NHS throughout the next Parliament, including £2 billion annually to modernise buildings and IT systems, give free car parking at NHS sites and it will end the Sustainability & Transformation Plan. Only Labour will mend our NHS - we cannot afford to lose it. Paul Kenny (Labour) \nPHILIP SMITH (LIBERAL DEMOCRAT) – The Lincolnshire Sustainability and Transformation Plan (STP) will almost certainly propose cuts to our health services in Boston & Skegness. Problems, from Pilgrim Hospital back in ‘Special Measures’, poor Ambulance Service standards, the night-time closure of Grantham A&E, and severe hospital recruitment problems, remain untackled. Funding and staffing are not keeping up with growing demands. Britain has fallen behind comparable countries´ standards, is not training enough doctors and nurses, and post-Brexit, it’s even harder to attract skilled people from elsewhere. Now the Conservatives are demanding longer GP opening hours - without paying for them. Liberal Democrats know good health services have to be paid for. Our policy is for an extra 1p on income tax, ring-fenced for the NHS and social care, and to develop a long-term funding settlement for health and social care with a dedicated, transparent NHS and care tax. \nPAUL NUTTALL (UKIP) – UKIP wants to see the NHS kept free at the point of delivery for all British people and to see an end to health tourism, it is after all the National Health Service, not the International Health Service. We want to scrap Private Finance Initiative (PFI) deals like the one that’s left the NHS saddled with £76 billion of debt, scrap hospital car parking charges and invest in more nurses. We are the only party who can tell you how we’re going to fund that, and that’s by slashing foreign aid and spending substantially more on the NHS than the extra £3bn a year we promised in our 2015 manifesto. At a local level, like many of the constituents of Boston and Skegness, I want to see both Boston’s major A&E and Skegness’s minor A&E kept open and not downgraded like Grantham’s. I’m also opposed to the relocating of services to Lincoln. Philip Smith (Liberal Democrat)", "external_links": [], "published": "2017-05-28T21:00:00.000+03:00", "crawled": "2017-05-29T00:57:22.000+03:00", "highlightTitle": ""}