{"organizations": [], "uuid": "b38a9002f67a6348e98f092499fdd9344ae089c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30320141/15992499.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/devon-county-councillor-in-bid-to-become-east-devon-8217-s-first-independent-mp/story-30320141-detail/story.html", "country": "GB", "title": "Devon County Councillor in bid to become East Devon's first...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Devon County Councillor in bid to become East Devon's first...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-09T04:06:00.000+03:00", "replies_count": 0, "uuid": "b38a9002f67a6348e98f092499fdd9344ae089c2"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/devon-county-councillor-in-bid-to-become-east-devon-8217-s-first-independent-mp/story-30320141-detail/story.html", "ord_in_thread": 0, "title": "Devon County Councillor in bid to become East Devon's first...", "locations": [], "entities": {"persons": [{"name": "claire", "sentiment": "none"}, {"name": "sandy park", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "claire wright", "sentiment": "none"}], "locations": [{"name": "devon county", "sentiment": "none"}, {"name": "otter valley", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "east devon", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}, {"name": "torquay pavilion", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "devon county councii", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon County Councillor in bid to become East Devon’s first Independent MP By Zoe_Stevens | Posted: May 08, 2017 0 COMMENTS SHARES Comments (0) \nClaire Wright, who last week regained her seat on Devon County Council with 3,638 votes and a 75 per cent share, has announced that she is to again stand for parliament in the General Election in a bid to become East Devon's first Independent MP. \nThe independent candidate came second in the East Devon constituency behind Hugo Swire in 2015, but did secure more than 13,000 votes. \nLast Thursday, she retained her seat in the Otter Valley ward for Devon County Council, and on Monday night, announced to followers that she would once again try and take on Hugo Swire and become a member of parliament. \nRead next: Chairman reports 'bullying' of members as Torquay Pavilion plans approved \n\"Following my decisive win in the county council elections, I have decided to say YES to my army of supporters by once again challenging the Conservative candidate. \n\"In the 2015 parliamentary election I came second, with a 24 per cent share of the vote - more than Labour and the Lib Dems combined. \nRead next: Stagecoach just hiked the prices on Devon bus services \n\"People are telling me that they are angry and frustrated with the current government's policies. East Devon residents are looking for someone different, someone who will work solely for them, without being tied to a political party. \n\"As a direct result of this government's policies local NHS provision is under threat, education budgets face massive shortfalls, local businesses will suffer hikes in business rates, local council services have diminished under massive government cuts - and national debt has actually increased. \n\"As well as this there are real fears of a damaging hard Brexit if the Conservative government is re-elected with a substantial majority, as is predicted. \n\"In 2015, although a long-standing and hard-working local councillor, I was a parliamentary newcomer. \n\"Now I have a track record that shows how local people are prepared to back me. I am the only candidate who can win this seat from the Conservative MP. \nRead next: Major eight-storey hotel plan for Exeter's Sandy Park \n\"I am calling on everyone in this constituency from the youngest to the oldest voter to join in a campaign based on progressive values and to return me as their MP. \n\"As an Independent MP I would be free from the party whip and I would campaign on the issues that local people tell me are important to them. I would be free to speak and free to act. \n\"If every resident who would like to see change in East Devon votes for me, history can be made in East Devon.\" \nRead next: Newton Abbot Lib Dem election candidate confident she can take... \nSpeaking after her Devon County Councii win, she said her secret to winning in a traditionally Tory seat was \"hard work.\" \nShe said: \"I think it is a really good opportunity, especially during an election period, to knock on as many doors as you can and find out what issues are concerning people the most. It means you start a new term with a really clear picture of what people are concerned about. \n\"In my area it's the loss of hospital beds, it's the education and funding cuts sending school's into crises, it's protection of the environment and it's austerity. \nClaire says she doesn't feel alone on a mainly Tory county council, she feels liberated. \n\"It's a myth, I'm not a lone voice at all and in last four years you can get a lot done if you work with other councillors, working across parties to achieve things. I'm free to represent people's views without having to tow any party lines. It's wonderful and I love being a councillor.\" ", "external_links": [], "published": "2017-05-09T04:06:00.000+03:00", "crawled": "2017-05-09T00:19:04.000+03:00", "highlightTitle": ""}