{"organizations": [], "uuid": "0b3ff59929afe2c6ec80981e70390e56c0f3635f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30363416/16023949.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/labour-given-huge-boost-as-green-candidate-backs-out-of-marginal-seat/story-30363416-detail/story.html", "country": "GB", "title": "Neil_Shaw commented Labour given huge boost as Green candidate backs out of marginal...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-31T13:24:00.000+03:00", "replies_count": 0, "uuid": "0b3ff59929afe2c6ec80981e70390e56c0f3635f"}, "author": "Neil_Shaw", "url": "http://www.devonlive.com/labour-given-huge-boost-as-green-candidate-backs-out-of-marginal-seat/story-30363416-detail/story.html", "ord_in_thread": 0, "title": "Neil_Shaw commented Labour given huge boost as Green candidate backs out of marginal...", "locations": [], "entities": {"persons": [{"name": "green", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "josh pope", "sentiment": "none"}, {"name": "pope", "sentiment": "none"}, {"name": "sam blackledge", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "alison seabeck", "sentiment": "none"}, {"name": "josh", "sentiment": "none"}, {"name": "sue dann", "sentiment": "none"}, {"name": "mercer", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "plymouth moor view", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "mt mercer", "sentiment": "none"}, {"name": "herald", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "devonport high school for boys", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour given huge boost as Green candidate backs out of marginal seat By Neil_Shaw | Posted: May 31, 2017 By Sam Blackledge Comments (4) \nLabour has been given a huge boost in one Devon constituency after the Green candidate stepped down and said he would now endorse the party. \nThe move by Green Party candidate Josh Pope, 19, in Plymouth Moor View means Labour is within a couple of votes of reclaiming the seat from sitting Conservative Johnny Mercer. \nMr Mercer won the seat from labour;s Alison Seabeck in 2015 with a majority of 1,026 votes. The Green Party won 1,023 votes. \nThe move puts Mt Mercer at serious risk of losing his seat to Labour's Sue Dann. \nMr Mercer accused the former Devonport High School for Boys student of \"treating politics like a game\", but has vowed to redouble his efforts ahead of next week's election. \nIn a statement on his website , Mr Pope said he took the decision after seeing Labour gaining ground in national opinion polls. \n\"I am a Green through and through and I do believe that the Green Party and Labour Party have differences in our vision for the future,\" he said. \n\"However, with values close to ours so close to being implemented into Government, I have to be pragmatic and realise what is best for the country - that is to put Jeremy Corbyn into Downing Street. \n\"The Green Party is leading by example, taking steps to help ensure that there is a strong opposition after the election, one that will hold the government to account on important issues. \n\"I would love to do that myself, but I recognise that in this election it is the Labour candidate, Sue Dann, who has the best chance of beating the Conservatives and helping to create a more balanced parliament.\" \nLast month Labour and the Greens held discussions about forming a \"progressive alliance\", which might have meant both parties deciding not to stand against each other in key seats, but the talks broke down. \nMr Pope said: \"All I urge is that for one election, we look at the bigger picture and support the party with the best chance of putting our values into action,\" he said. \n\"In 2017, that is Labour, that is Jeremy Corbyn, and in Plymouth Moor View, that is Sue Dann. \n\"People who wish to vote for me and the Green Party will still have a chance to do so - and I am incredibly proud of that - but we must look at the bigger picture for once. \n\"We can, and we will work together to make Britain a confident and caring place, and one that works for everyone. That is why, in this election, we have to do the right thing.\" \nMr Pope, who cannot now be removed from the ballot paper under election rules, told The Herald he will no longer be campaigning for Green votes ahead of next week's election. \nConservative candidate Johnny Mercer accused Mr Pope of \"treating politics like a game\" \n\"it is disappointing to see someone who I thought was standing for what he believes in go the way of so many politicians in Plymouth and hitch his carriage to the next passing locomotive to 'get on' in politics. \n\"I suggest the good people of Plymouth make their own minds up on who to vote for without taking his advice. \n\"The Green Party is still on the ticket in Plymouth and I suspect their supporters will still vote for them, even if Josh won't. \n\"We must redouble our efforts, and win this seat for those who don't treat politics as a game, and deliver a Brexit that works for every family in Plymouth.\" \nThe Herald has contacted the Green Party's national headquarters for a comment. ", "external_links": [], "published": "2017-05-31T13:24:00.000+03:00", "crawled": "2017-05-31T12:43:58.000+03:00", "highlightTitle": ""}