{"organizations": [], "uuid": "fafe329d3fce01e156153151e9b89a6cfefe7e61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12496122.ece/ALTERNATES/s1200/Greggs-on-Caroline-Street-Cardiff.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13046436", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Greggs sales grows as baker continues investing in £2 breakfasts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-18T14:55:00.000+03:00", "replies_count": 0, "uuid": "fafe329d3fce01e156153151e9b89a6cfefe7e61"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13046436", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Greggs sales grows as baker continues investing in £2 breakfasts", "locations": [], "entities": {"persons": [{"name": "greggs", "sentiment": "negative"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "christopher bailey", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "burberry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning John Lewis is top employer as people 'love to work where they shop' \nRetailers and technology firms dominate a list of the companies people most want to work for, a study shows. \nThe John Lewis Partnership, including Waitrose, was the most sought-after employer for the second year in a row in a list compiled by networking service Linkedin. \nOnline fashion firm Asos was second, followed by Topshop owners the Arcadia Group, Harrods, TV and broadband firm Liberty Global, Sainsbury’s, Virgin, Google, Facebook and the BBC. \nLinkedin said its research among millions of its members showed people still loved to work where they shopped. \nKate Corcoran, of the John Lewis Partnership, said: \nAttracting top talent is incredibly important as our business is owned by our partners and LinkedIn plays a key role in this. \nSarah Andrews, retail director at Harrods, said: \nIt is fantastic to see the retail industry, which offers such a variety of careers and opportunities, to continue to lead the way for prospective UK employees. \nPart of what makes Harrods such a special business is the diversity of roles we are able to offer, all under one roof. John Lewis in Eldon Square 9:03 Jonathon Manning Facebook fined £94m over data claim in WhatsApp takeover \nFacebook has been slapped with a €110m (£94.5m) fine after the EU’s anti-trust watchdog said it provided “incorrect or misleading” information regarding its $19bn (£15.3bn) takeover of WhatsApp. \nThe European Commission said the US social network inaccurately claimed it would be unable to combine user data between the two companies’ accounts. \nThe commission said: \nContrary to Facebook’s statements in the 2014 merger review process, the technical possibility of automatically matching Facebook and WhatsApp users’ identities already existed in 2014, and Facebook staff were aware of such a possibility. \nIt added that the ruling does not affect its decision to approve the merger. Commissioner Margrethe Vestager, who has recently put the tax affairs of a number of high-profile firms including Apple, Amazon and Google under the microscope, said the sanction was “proportionate and deterrent”. \nShe added: \nToday’s decision sends a clear signal to companies that they must comply with all aspects of EU merger rules, including the obligation to provide correct information. \nAnd it imposes a proportionate and deterrent fine on Facebook. The commission must be able to take decisions about mergers’ effects on competition in full knowledge of accurate facts. Whatsapp being used on a smartphone (Photo: Jonathan Brady/PA Wire) 8:57 Jonathon Manning Newcastle Building Society to close branches in Dumfries and Gibraltar as part of new strategy \nNewcastle Building Society is set to create 130 new jobs this year as part of moves to strengthen its presence in its North East heartland. \nThe region’s largest building society has set in motion a new branch review which will involve investment in a number of branches in the North East and Cumbria. \nThe programme will involve the relocation or refurbishment of three branches – in Durham, Carlisle and Berwick – all of which will be completed over the next 18 months. \nThe building society’s strategy to focus more closely on its heartland area will lead to branch closures in Dumfries and Gibraltar, a decision the society said had not been made lightly. \nMeasures have been put in place to support staff and assist customers when the branches shut their doors at Dumfries, in September, and in Gibraltar, in October. \nThe Society has begun consultations with the 12 affected staff. \nChief executive Andrew Haigh said the firm is committed to the North East and that it wants to make the branch network fit for the future. Having created 118 new jobs during 2016 as part of an ongoing £10m investment programme across the business, which took its overall headcount past the 1,000 mark, the society is also aiming to create 130 new roles this year. \nMr Haigh said: \nWe are committed to our heartland area and are continuing to invest in a modern high street branch network that is fit for the future and designed around the needs of our customers. \nOur latest branch investments are complemented by additional investment in digital and telephony options to support the first class service we aim to provide through whichever channels our customers choose to connect with us. \nBranch closures are always regrettable. The changes we’re making are in line with our strategic focus on our heartland, and we will ensure that customers and staff in these two locations are fully supported through the closure process. Newcastle Building Society chief executive Andrew Haigh (Photo: Lawrenson & Grebby Photography LLP) 8:52 Jonathon Manning New investment planned as Northumberland care home is snapped up by family firm \nNew investment is being planned for a Northumberland care home after a f amily firm snapped it up from its long-term owner. \nParkside Care has added the Northlands Care Home in Morpeth to its portfolio of properties, which also includes facilities in Sunderland, Gateshead and North Shields. \nThe 35-bed home has been bought from owner Jill Lax, who had run it since 1995 as part of the Autumncare Group Ltd, which had added an extension to the original building shortly after its purchase to almost treble its capacity from the original 13-bed size. \nOver the next 18 months, Parkside Care, headquartered in North Shields, will carry out an extensive refurbishment project to bring the building in line with its corporate standards, with a new nurse call system, new lighting and new flooring all due to be installed. \nAll of the 40 full and part time staff that work at Northlands are remaining in place, and the Parkside management team said it is open to making further regional acquisitions as and when the right opportunities come along. \nMatthew Flinders of RMT Accountants and Business Advisors and Debra Swinburn of Evans and Co advised Jill Lax on the disposal of the Northlands Care Home, while Darrell Francoisy of NatWest Bank and Christopher Welch of Sintons Law Firm worked with Parkside Care on the acquisition. \nJill Lax said: \nAfter running it for more than two decades, Northlands has become far more than just a business to us, and we have made significant financial and emotional investments in creating the kind of supportive environment that residents deserve. \nWe had to be certain that we were going to be passing it on to the right sort of operator which would look after the residents and staff as we would wish and keep developing the quality of services that Northlands could offer. From left to right: Jill Lax of the Autumncare Group, Maxine Pott and Matthew Flinders of RMT Accountants, Christopher Welch and Alok Loomba of Sintons, Parkside Care's Andrew Kerr and Darrell Franciosy of Natwest (Photo: Simon Williams Crest Photography) 8:47 Jonathon Manning Lloyds boss buys £36,000 of shares amid speculation of HSBC switch \nLloyds Banking Group boss Antonio Horta-Osorio has splashed out £36,000 buying shares in the lender amid rising speculation over his future. \nMr Horta-Osorio picked up 50,000 shares in Lloyds at 72.31p each, according to a stock market filing issued just a day after the Government sold its final stake in the bank. \nThe sale, which returned the bank to private ownership nearly a decade after its £20.3bn bailout, has sparked further questions over the chief executive’s future. \nOn Wednesday Mr Horta-Osorio insisted he is “very happy” at Lloyds, adding that “a job is never done”, dampening rumours he could be headed for the exit. \nSpeculation in the Square Mile has linked Mr Horta-Osorio with a possible move to HSBC, where Stuart Gulliver will step down as chief executive in 2018. \nLloyds said on Wednesday that the taxpayer had made a profit of £894m on the original £20.3bn of cash pumped in as part of its rescue. \nIn an accompanying statement, Mr Horta-Osorio said: \nSix years ago we inherited a business that was in a very fragile financial condition. Thanks to the hard work of everyone at Lloyds, we’ve turned the group around. \nBut the job is not done. We’re going to continue to use our strong position to Help Britain Prosper. Lloyds Banking Group chief executive Antonio Horta-Osorio 8:41 KEY EVENT FTSE closes in the red amid jitters over Donald Trump's future \nThe FTSE 100 followed international benchmarks into the red on Wednesday, as calls for US President Donald Trump’s impeachment sent jitters across global markets. \nLondon’s blue chip index ended the day down 0.25%, or 18.56 points, at 7,503.47, ending a three-day streak of record highs. \nThe French Cac 40 and German Dax also closed lower, by 1.6% and 1.3% respectively, while American indices including the Dow Jones Industrial Average, S&P 500 and Nasdaq Composite were all down more than 1% in early US trading. \nEquity markets were hit by growing calls for Mr Trump to be forced out of office, after fresh details emerged about his recent interaction with the recently-fired FBI boss James Comey. \nConnor Campbell, a financial analyst at SpreadEx, said: \nInvestors have been shaken by reports that Trump urged the then-FBI chief Comey to drop his investigation into Michael Flynn, the latest twist in the Russia saga that is gradually engulfing the president. \nThere are a couple of reasons as to why this has caused such jittery trading. Firstly, it threatens to delay, or completely derail, Trump’s market-lifting infrastructure and tax policies. \nSecondly, and more drastically, it could actually lead to the impeachment of the sentient Wotsit, an eventuality that would completely erase the foundations of the market’s recent record highs. \nIn currency markets, the pound was mixed, up 0.2% against the US dollar at 1.294, but down 0.2% versus the euro at 1.162. That is despite fresh data showing the UK’s unemployment rate has fallen to a 32-year low of 4.6%. \nHowever, a 2.1% rise in wages - excluding bonuses - failed to keep up with the rate of inflation which came in at 2.7% for April. US President Donald Trump (Photo: AP) 8:37 Jonathon Manning Northumbria University unveils state-of-the-art Business Clinic in partnership with Santander \nA university business clinic helping to drive forward North East firms has moved into a new state-of-the art base in Newcastle following an £800,000 investment. \nNorthumbria University’s highly successful Business Clinic has relocated to its own 500 square metre premises on New Bridge Street, where it has also received a £150,000 from Santander Universities UK. \nThe Business Clinic forms part of Northumbria University’s Business School and sees business students participate in a ‘consultancy firm’ to provide advice for clients, including big name firms Greggs Plc and Parker Hannifin. \nThe university, which has 34,000 students from 132 countries, has invested more than £800,000 to move the Business Clinic into the vibrant, purpose-built premises, which includes client briefing rooms, a boardroom, reception area, a conferencing and event space and a digital communications system. \nThe clinic itself offers a free service to all types of businesses, from SMEs and multinationals to charities, social enterprises and not-for-profit organisations, and students are encouraged to work closely with the clients to get to the root of their problems and deliver genuine solutions. \nTo date, the Business Clinic has helped more than 600 students advise more than 145 organisations including the Dyspraxia Foundation, Northumbria Police, North West Ambulance Service, BALTIC Centre for Contemporary Art, Greggs plc, Helix Arts and Parker Hannifin. \nNigel Coates, director of the Business Clinic, said: \nFew universities in the UK offer their business students the opportunity to work directly with business leaders but Northumbria is an exception. \nSince 2013, the Business Clinic has been supporting our final-year undergraduate and Masters’ students to provide clients with a free-of-charge, full consultancy service under the supervision of experienced staff. \nThe Business Clinic’s new premises also offer the ideal venue for growing numbers of SMEs and social enterprises that are expressing their need to us for external engagement and networking opportunities. Left to right, Javier Rogla, Global Managing Director, Santander Universities & Universia, Matt Hutnell, Director Santander Universities UK, Professor Andrew Wathey CBE, Vice-Chancellor & Chief Executive, Northumbria University, David Warcup, University Governor, Northumbria University, Lucy Winskell OBE, DL, Pro Vice-Chancellor (Employability & Partnerships) Northumbria University and Chris Sayers, Chair of Board of Governors, Northumbria University (Photo: North News & Pictures Ltd ) 8:34 Jonathon Manning Burberry's figures: wholesale turnover drops 14% \nBurberry said the weak pound flattered full-year revenues, up 10% at £2.8bn, but sales fell 2% at constant exchange rates. \nStore sales - which make up 77% of revenues - rose 1% on a like-for-like basis after a 3% rise in the final six months, with the UK leading a double-digit sales hike across the Europe, Middle East, India and Africa region. \nBut underlying wholesale turnover dropped 14% and licensing sales slumped 48%. This was offset in part by efforts to slash costs across the group. \nBurberry has been leading a turnaround plan that has included simplifying the product line, revamping its digital store and cutting costs. It has also moved to license out its beauty range as part of a new partnership with make-up brand Coty. \nThe group said earlier this month it would relocate 300 jobs from its London offices to a new site in Leeds as part of cost-saving measures. \nStaff at its London headquarters have begun a consultation where they will be offered the chance to move to the North or face the prospect of redundancy. \nThe move is part of a plan that aims to deliver at least £100m in cost savings by 2019. However, Burberry’s plans for a flagship manufacturing and weaving facility in Leeds remain on hold. The former Burberry shop KEY EVENT Underlying profits tumble at Burberry despite Brexit boost \nLuxury fashion firm Burberry has revealed underlying annual profits tumbled by more than a fifth, but saw the Brexit-hit pound boost sales in a “year of transition”. \nThe group said underlying pre-tax profits plunged 21% to £462m as it was hit by weak wholesale trading in the US. But including the boost from the weak pound since the Brexit vote, underlying profits lifted 10%, while Burberry cheered ongoing “exceptional” sales in the UK thanks to the boom in spend on luxury goods from tourists. \nThe group cautioned the benefit from the pound would begin to fade later this year, which will hit hit profits in the new financial year by around £30m. \nOutgoing chief executive Christopher Bailey said: \n2017 was a year of transition for Burberry in a fast-changing luxury market. \nThe actions we have taken to lay the foundations for future growth are yielding early benefits and I remain confident that these will build over time. \nThe full-year results outline the challenges facing new boss Marco Gobbetti, who takes on the top role in July, when Mr Bailey will step aside to become president and chief creative officer. A Burberry store ", "external_links": [], "published": "2017-05-18T14:55:00.000+03:00", "crawled": "2017-05-18T10:05:36.000+03:00", "highlightTitle": ""}