{"organizations": [], "uuid": "056c21a91d597f15aed3f596228c59784789cde5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13083928.ece/ALTERNATES/s1200/Jeremy-Corbyn-Continues-Campaigning-For-The-Labour-Party-In-Yorkshire.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-vote-labour-everything-you-13083012", "country": "GB", "domain_rank": 21960, "title": "Why should I vote Labour? Everything you need to know about the Labour Party ahead of the election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-24T18:28:00.000+03:00", "replies_count": 0, "uuid": "056c21a91d597f15aed3f596228c59784789cde5"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-vote-labour-everything-you-13083012", "ord_in_thread": 0, "title": "Why should I vote Labour? Everything you need to know about the Labour Party ahead of the election", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "lyla lister-pattinson", "sentiment": "none"}], "locations": [{"name": "south east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "nhs england", "sentiment": "none"}], "organizations": [{"name": "labour party", "sentiment": "negative"}, {"name": "customs union", "sentiment": "none"}, {"name": "social  labour", "sentiment": "none"}, {"name": "bame", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "jeremy corbyn labour", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "immigration  labour", "sentiment": "none"}, {"name": "national insurance contributions", "sentiment": "none"}, {"name": "national education service", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "bedroom tax", "sentiment": "none"}, {"name": "un", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "education  labour", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "royal mail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why should I vote Labour? Everything you need to know about the Labour Party ahead of the election What you need to know about the Labour Party ahead of the general election set to take place on June 8 Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe Labour Party is one of the two major largest parties in the UK. \nIt has been the official opposition since 2010. Before that, it was in government for 13 years. \nThe Chronicle has launched a Whatsapp group for general election news. To receive daily messages text GE to 07827 937 000. Add the number to your phone contacts book as ‘Chronicle’. Your number won’t be shared with other members of the group. Who is the Labour Party leader? \nThe Labour leader is Jeremy Corbyn Labour leader Jeremy Corbyn (Photo: Getty Images Europe) How many seats did Labour win at the last election? \nLabour won 232 seats in the last general election , which was in 2015 What are the Labour policies? \nPolicies set out in the Labour manifesto include: TAX \nNo income tax rises for those earning below £80,000 a year - but “top 5% of earners will be asked to contribute more in tax” to fund public services. \nNo rise in personal National Insurance Contributions or the rate of VAT. \nLower small profits rate of corporation tax will be reintroduced to protect small businesses. Read More \nEnsure national debt is lower at the end of the next Parliament than at present. A message from 5yr old Lyla Lister-Pattinson at a Labour Party rally in Newcastle City Centre (Photo: Newcastle Chronicle) INFRASTRUCTURE \nNational Transformation Fund will be created to invest £250 billion over 10 years to upgrade economy. \nComplete HS2 high-speed rail line , and link the project with other rail investments such as Crossrail of the North and the Durham Freight Centre. \nBuild a new Brighton Main Line for South East. \nRail electrification and expansion across the country. Read More What is an MP and what do they do? Our guide as Britain prepares to go to the polls BREXIT \nScrap Conservatives’ Brexit White Paper and replace with “fresh negotiating priorities” with strong emphasis on retaining Single Market and Customs Union. \nLabour government would “immediately guarantee” existing rights for all EU nationals in Britain. \nIt would “reject ‘no deal’ as a viable option”. IMMIGRATION \nLabour will not “scapegoat migrants” and will not set a cap on immigration, describing targets as “bogus”. \nInternational students will not be included in immigration numbers, but the party will crack down on “fake colleges”. EDUCATION \nLabour will create a National Education Service for England to incorporate all forms of education. \nOverhaul existing childcare system and extend the 30 hours of free childcare to all two-year-olds. Labour promises to reduce class sizes to “less than 30” for five, six and seven-year-old children. \nDevolve responsibility for skills to city regions or devolved administrations. Read More \nScrap university tuition fees and reintroduce maintenance grants for students. WORK \nZero hours contracts will be banned to guarantee workers a “number of hours each week”. \nMaximum pay ratios of 20:1 to be rolled out in public sector. \nFour new public holidays to mark national patron saints’ days. \nRaise minimum wage to “at least £10 per hour by 2020”. \nBan unpaid internships. \nThe party will “clamp down on bogus self-employment” and extend rights of employees to all workers - including shared parental pay. SOCIAL \nLabour will guarantee state pension triple lock, as well as the Winter Fuel Allowance and free bus passes. \n“Rejects” proposal to increase state pension age further. \nCuts to Bereavement Support Payment will be scrapped, as will the Bedroom Tax and the “punitive sanctions regime”, while the Housing Benefit for under-21s will be reintroduced. HOUSING \nBuild at least 100,000 council and housing association homes a year by end of the next parliament, for “genuinely affordable rent or sale”. \nGuarantee Help to Buy funding until 2027 and give locals buying their first home “first dibs on new homes built in their area”. \nLegislate to ban letting agency fees for tenants, and look at giving the Mayor of London power to give London renters “additional security”. \nMake 4,000 additional homes available for rough sleepers to end homelessness. HEALTH \nOne million people will be taken off NHS waiting lists by “guaranteeing access to treatment within 18 weeks”. \nFree parking in NHS England will be funded by increasing tax on private medical insurance premiums. \nScrap NHS pay cap. \nNHS will receive more than £30 billion in extra funding over the next parliament. \nMental health budgets will be ring-fenced, and Labour will ensure all children in secondary schools have access to a counselling service. CRIME \nRecruit 10,000 more police officers, and will work to “eliminate institutional biases against BAME (black, Asian and minority ethnic) communities”. \nReintroduce “effective judicial oversight” on how and when investigatory powers are used, when “the circumstances demand that our collective security outweighs an individual freedom”. UTILITIES \nLabour will bring energy supply networks, the water system and Royal Mail, as well as private rail companies, back into public ownership. DEFENCE \nCommit to spending at least 2% of GDP on defence. \nSupport renewal of Trident nuclear deterrent, but Labour will “lead multilateral efforts with international partners and the UN to create a nuclear-free world”. Like us on Facebook", "external_links": [], "published": "2017-05-24T18:28:00.000+03:00", "crawled": "2017-05-24T14:15:40.000+03:00", "highlightTitle": ""}