{"organizations": [], "uuid": "f4f04186f6d85debaadd1de14cae0a88af687263", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30348476/16013154.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/topps-tiles-on-acquisition-trail-despite-fall-in-sales/story-30348476-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published Topps Tiles on acquisition trail despite fall in sales", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-23T17:10:00.000+03:00", "replies_count": 0, "uuid": "f4f04186f6d85debaadd1de14cae0a88af687263"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/topps-tiles-on-acquisition-trail-despite-fall-in-sales/story-30348476-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published Topps Tiles on acquisition trail despite fall in sales", "locations": [], "entities": {"persons": [{"name": "matthew williams", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "matthew williamson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "topps tiles", "sentiment": "negative"}, {"name": "brexit  topps tiles", "sentiment": "none"}, {"name": "topps", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Topps Tiles on acquisition trail despite fall in sales By Lauren_Mills | Posted: May 23, 2017 0 COMMENTS SHARES Topps CEO Matthew Williamson inside the tile retailer's Enderby warehouse Topps Tiles on acquisition trail despite fall in sales X \nCopy link to paste in your message / Comments (0) \nBritain's biggest tile retailer said it was considering acquisition opportunities, despite a fall in sales. \nSales at Enderby-based Topps Tiles fell by nearly 2 per cent in the 26 weeks to April 1, with profits down from £10.3 million to £10.1 million. \nThe company said trading had been more challenging as a result of a weaker macro environment this year and a continuation of \"the particularly strong comparatives\" from the prior year when sales were boosted by changes to stamp duty. \nRead more: Topps Tiles hit by tougher housing market \nSame-store sales, which do not include revenue from newly opened outlets, fell by nearly 5 per cent in the seven weeks to May 20, compared to an 8.4 per cent increase for the same time last year. \nThe company said: \"Taking a prudent view of the second half outlook, management expect pre-tax profits for the full year are likely to be towards the lower end of the range of market expectations.\" \nRead more: Tiling giant launches £2 million office revamp \nChief executive Matthew Williams said: \"Our results for the first half reflect the more challenging macro-economic environment we have traded through so far in 2017 and the strong performance we delivered in the corresponding period in 2016 when housing transactions were boosted ahead of the changes to stamp duty. \n\"While these tougher comparatives begin to ease from the end of June, the key macro indicators for our market are weaker year-on-year and we are taking a prudent view of the second half prospects.\" \nDespite this, Mr Williams said he remained confident in the longer term outlook for the business. \nHe said: \"We will continue to focus on executing our proven strategy of 'out-specialising the specialists' and to invest in important sources of future growth. \n\" In particular, our recently completed analysis of the UK commercial tile market has confirmed it as attractive and we are now evaluating a number of small acquisition opportunities to increase our reach into this part of the market.\" \nRead more: Topps Tiles chief executive feeling calm post Brexit \nTopps Tiles opened eight new stores in its first half which it said were \"delivering strong performance and returns\". The company now has 359 stores. \nA further 10 new stores are planned for the second half as it continues with its ambitions of operating a total of 450 UK outlets. \nInvestment in new products continued to boost Topps Tiles overall trading with more than 10 per cent of tile revenues generated from ranges launched in the last 12 months. \nTrade sales also increased – to more than half the total, driven by the accelerating \"do it for me\" trend and growth of its new Rewards+ trade loyalty scheme.", "external_links": [], "published": "2017-05-23T17:10:00.000+03:00", "crawled": "2017-05-23T14:17:30.000+03:00", "highlightTitle": ""}