{"organizations": [], "uuid": "84425df7ce158c33db70a55f927ba4c16d73f234", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9795935.ece/ALTERNATES/s1200/JS69514765.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-companies-still-attractive-13073935", "country": "GB", "domain_rank": 21960, "title": "North East companies still attractive to investors, but Brexit warning looms", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-23T07:01:00.000+03:00", "replies_count": 0, "uuid": "84425df7ce158c33db70a55f927ba4c16d73f234"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-companies-still-attractive-13073935", "ord_in_thread": 0, "title": "North East companies still attractive to investors, but Brexit warning looms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East companies still attractive to investors, but Brexit warning looms Surveys by PwC, EY and Bond Dickinson highlight Brexit blip this summer and warn of potential slowdown to come Share Paul Mankin, corporate finance partner at PwC in Newcastle Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North East remained an attractive destination for investors in 2016 but a ‘Brexit blip’ in the summer could be a warning of problems to come, three separate reports find. \nAccountancy ‘Big Four’ players PwC and EY have both surveyed deal activity in the North East during 2017 while law firm Bond Dickinson, whose largest office is in Newcastle, has brought out a study logging deals involving North East SMEs . \nAll three companies highlight a slowdown in deal activity around last June’s EU referendum, and though normal activity was resumed shortly afterwards, experts believe the looming prospect of Brexit could make North East firms less attractive when it comes to future acquisitions. \nMajor deals that took place last year include the £1.35bn takeover of Newcastle holiday park company Parkdean Resorts, which was sold to Canadian investment group Onex in December, the sale of Newcastle’s Nomad Digital to French transport giant Alstom for an undisclosed sum and the acquisition of Teesside chemicals manufacturer Fine Industries by a Chinese group. \nPaul Mankin, corporate finance partner at PwC’s Newcastle office , said a slowdown in deal activity was seen around the EU referendum but this had been “remarkably short - weeks rather than months.” \nHe said: “Overall the deal activity during the year was clearly impacted by the UK’s decision to leave the European Union which resulted in a slowdown in the third quarter - an impact which was not unexpected given the level of uncertainty in the market as businesses tried to assess the implications of a post-Brexit future and what that might mean to them with resultant investment decisions put on hold. \n“Surprisingly, though, as the final quarter of 2016 drew to a close deal volumes began to recover and reached their highest quarterly level since 2004 with a total of 67 transactions completed, a clear indication that buyers and sellers had become to realise that to some extent many of the possible implications were unlikely to be seen for some time and as such there was little to be gained by adopting ‘a wait and see attitude’.” Read More North East could get more flights to London under Heathrow plans \nMr Mankin said that the slump in sterling following the EU referendum had made hi-tech manufacturing companies in the North East doubly attractive to foreign buyers, by both boosting exports and lowering their value. \n2016 had been a record year for activity for private equity in the region, Mr Mankin said, while the final quarter of the year had seen the highest value of disclosed deals since Q4 of 2011. \nMeanwhile, EY’s UK Attractiveness Survey recorded 26 foreign direct investment (FDI) projects in the North East in 2016, 38% made by overseas investors entering the region for the first time. Sandra Thompson, EY head partner (Photo: EY) \nNewcastle received the lion’s share of the investment after attracting seven projects last year, followed by Sunderland with five and Newton Aycliffe seeing three. Of the investment projects 15 were in the manufacturing sector, and nine were in the financial and business services market. \nSandra Thompson, North East senior partner at EY, said: “The work that has taken place to position the North East, and indeed, the whole of the North of England, as a strong investment location in the global marketplace is starting to pay off. \n“These figures show that the international investment community sees the potential in the region with its access to the right skills, infrastructure and strong supply chain networks.” Read More Hi-tech jobs come north as Seaham's BE Group invests in artificial intelligence company Kevin Robertson, Head of Office, Bond Dickinson LLP \nNewcastle law firm Bond Dickinson said that Brexit had caused deals between large organisations and UK SMEs to fall 28% during 2016/17, ending a three-year upward trend in the number of mergers and acquisitions, joint ventures, and minority stake deals across the country. \nKevin Robertson, head of Bond Dickinson’s Newcastle office, said: “We are one of the UK’s fastest growing regions for tech start-ups. Collaboration with corporates will become increasingly important to these dynamic businesses, which are brilliant at proof of concept innovation but often lack the regulatory pathways, brand and finance to make the most of their intellectual property.” Like us on Facebook", "external_links": [], "published": "2017-05-23T07:01:00.000+03:00", "crawled": "2017-05-23T02:32:23.000+03:00", "highlightTitle": ""}