{"organizations": [], "uuid": "bab529defc8580c8c2431409a55195304656e242", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13087497.ece/ALTERNATES/s1200/JS120741829.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-neil-hart-managing-13087624", "country": "GB", "domain_rank": 21960, "title": "A Meeting With: Neil Hart, managing director of Bradley Hall and BH Group", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-25T12:00:00.000+03:00", "replies_count": 0, "uuid": "bab529defc8580c8c2431409a55195304656e242"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-neil-hart-managing-13087624", "ord_in_thread": 0, "title": "A Meeting With: Neil Hart, managing director of Bradley Hall and BH Group", "locations": [], "entities": {"persons": [{"name": "neil hart", "sentiment": "positive"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}], "locations": [{"name": "bradley hall", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}], "organizations": [{"name": "bh group", "sentiment": "positive"}, {"name": "bradley hall", "sentiment": "positive"}, {"name": "bh group neil hart", "sentiment": "positive"}, {"name": "bh financial", "sentiment": "none"}, {"name": "bh planning and design", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Neil Hart, group managing director of Bradley Hall and BH Group Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email What is the best thing about your job? \nThere are so many aspects of the property market to fuel the workload, and now that Bradley Hall has expanded I have more team members and clients to manage and more general business matters to address. My days are always full as there is so much going on, which is exactly how I like it. What is your proudest achievement? \nWorking my way up the ranks at Bradley Hall and becoming the managing director of the company. The past couple of years have been very exciting for the business. We added BH Financial, BH Mortgages and BH Planning and Design as subsidiary businesses, expanded the team and moved to larger head offices, as well as opening new residential offices across Alnwick and Morpeth . What advice would you give to someone starting your career? \nGet a good real-life work placement. Without doubt my first break in business came after gaining my placement year from university with Bradley Hall in 2000. I learnt so much and genuinely loved working for the company – I joined and never looked back. Which individual has inspired you most and why? \nThere are some famous people and quite a few closer to home who I admire for a variety of reasons. Thanks to my work I now know a handful of people who are self-made millionaires. I have a lot of admiration for those who have started from scratch; it takes a lot of hard work and dedication to reach that status. What’s the best piece of advice you have been given? \nHard to put my finger on it, the old ones are good. The phrase ‘two ears one mouth’ has served me well in the past. \nAlso, surround yourself with people who are more intelligent than you – that way you are always learning. What was the biggest challenge you’ve faced so far? \nPersuading my now wife that she should be my wife. Those in the know will remember that I chased her for a very long time. \nOn the business front, diversifying during any economic crisis. During Brexit and the uncertainty of the market we have still been able to expand, make more jobs, take on more clients and bigger projects. This has been achievable through a lot of hard work from the Bradley Hall team, coupled with a drive to succeed and be the best. How is your business going to change in the next ten years? \nContinued growth is the aspiration for us. We want to expand the team from 35 to 50 in the next 18 months, and following that we will look to continue taking on more talented young people and experienced industry professionals. I also predict that we will add further services to BH Group while continuing to offer our clients the unrivalled service they receive from Bradley Hall. What do you like to do outside of work? \nI like to spend time with my family. I’m married with a son who is toddler age and we have another baby on the way. Socialising with friends and clients with a few beers never goes amiss. \nI also like to watch and support local sport, particularly rugby. My son calls our local the rugby pub. Local grassroots sport also gets support from myself and the business. What do you always carry with you? \nI always have my phone with me so I never miss a deal. What would you do if you had to change career? \nI wouldn’t. I am so passionate about this industry that nothing else would compare. Like us on Facebook", "external_links": [], "published": "2017-05-25T12:00:00.000+03:00", "crawled": "2017-05-25T07:08:58.000+03:00", "highlightTitle": ""}