{"organizations": [], "uuid": "8ea28486b67c19a0063dd1d08029389d433e8a53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12995916.ece/ALTERNATES/s1200/Leader-of-Sunderland-City-Council-Cllr-Paul-Watson-left-with-Paul-Butler-chief-executive-of-the.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-supplier-kasai-blames-brexit-12992851", "country": "GB", "domain_rank": 21960, "title": "Nissan supplier Kasai blames Brexit vote for plummeting profit line", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan supplier Kasai blames Brexit vote for plummeting profit line", "spam_score": 0.0, "site_type": "news", "published": "2017-05-07T18:00:00.000+03:00", "replies_count": 0, "uuid": "8ea28486b67c19a0063dd1d08029389d433e8a53"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-supplier-kasai-blames-brexit-12992851", "ord_in_thread": 0, "title": "Nissan supplier Kasai blames Brexit vote for plummeting profit line", "locations": [], "entities": {"persons": [{"name": "cllr paul watson", "sentiment": "none"}, {"name": "paul butler", "sentiment": "none"}], "locations": [{"name": "kasai", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "kasai uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "kasai kogyo", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "neaa", "sentiment": "none"}, {"name": "invalid email  nissan", "sentiment": "none"}, {"name": "north east automotive alliance", "sentiment": "none"}, {"name": "nissan infiniti", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Nissan supplier Kasai blames Brexit vote for plummeting profit line The Washington car parts maker said its profit slipped a gear after the pound faltered against the US dollar, Euro and Japanese Yen Share Leader of Sunderland City Council, Cllr Paul Watson, left, with Paul Butler, chief executive of the North East Automotive Alliance, at automotive supply company R-Tek (Photo: Publicity Pic) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNissan supplier Kasai UK took sales up a gear to top £100m but its profit was almost halved after taking a hammering from the weakened pound, latest accounts reveal. \nThe car interior components maker, which is headquartered in Washington with a second base in Wales, has sought out new customers in recent years to reduce its dependence on Japanese giants Nissan and Honda, resulting in contracts with Jaguar Land Rover. \nLast year saw headcount grow, predominantly at its North East plant, to support work for the Nissan Infiniti, and turnover grew from £89.8m to £100.05m on the back of strong volumes. \nHowever, profit for the financial year dropped from £8.3m to £4.6m having taken a drastic hit from currency fluctuations, the firm said. Read More Nissan developing mobile phone blockers for cars made in Sunderland to prevent driver distractions \nIn a strategic report, the company – which changed its name from R-Tek to Kasai UK last year to come in line with parent group Kasai Kogyo – said: “The company is dependent mainly on the trade of Nissan and Honda at Washington and Merthyr, respectively. \n“Any variances in the production volumes of these customers would have a significant impact on the sales volumes of the company. The directors are seeking to expand the company’s customer base to counteract the reliance placed on these two key customers. During 2016 Jaguar Land Rover has been added to the company portfolio. \n“Foreign exchange movements are recognised as a risk to the company on the purchasing side due to certain materials and parts being imported from outside of the UK, primarily from EU, USA, Thailand and Japan. \n“Risk management strategies include derivatives in the form of forward currency contracts for purchases in foreign currencies which seek to mitigate this risk in the short, medium and long term. \n“Profit was adversely affected by the GBP weakening against Euro, US dollar and Japanese Yen after the result of the UK referendum on EU membership. \n“Following the referendum vote for the UK to leave the EU there has been a significant hurt due to the GBP weakening against the Euro, US dollar and Japanese Yen. Management continues to closely monitor developments in relation to Brexit and the potential consequential political and economic uncertainties in order to mitigate any risks to the business.” Read More US auto giant brings research facility to Sunderland in vote of confidence in city \nThe company’s workforce rose from an average of 749 to 824 employees, mainly here in the North East where staffing was increased for the Infiniti model, taking the wages bill from £18.4m to £21.3m. \nLooking ahead, the directors of the firm, a member of the North East Automotive Alliance (NEAA), said this year will be tough but that volumes are expected to rise higher. \nThe report added: “Planned volumes for 2017 are expected to be 10.3% higher than 2016 achievement. \n“The directors expect trading in 2017 to continue to be challenging, but based on current production forecasts, they expect the company to continue to generate profits and positive cash flows.” Like us on Facebook ", "external_links": [], "published": "2017-05-07T18:00:00.000+03:00", "crawled": "2017-05-07T13:48:28.000+03:00", "highlightTitle": ""}