{"organizations": [], "uuid": "ea91fcdc49e680c3c58308bafe14b8966e0838bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13055317.ece/ALTERNATES/s1200/torymanifesto.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-published-conservative-manifesto-heres-13055288", "country": "GB", "domain_rank": 21960, "title": "Theresa May has published the Conservative manifesto - here's what you need to know", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-18T21:26:00.000+03:00", "replies_count": 0, "uuid": "ea91fcdc49e680c3c58308bafe14b8966e0838bb"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-published-conservative-manifesto-heres-13055288", "ord_in_thread": 0, "title": "Theresa May has published the Conservative manifesto - here's what you need to know", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "leeds  building", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "west yorkshire", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "halifax", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "health  increasing nhs", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Theresa May warned that Britain faces “giant challenges” as she launched the Conservative general election manifesto. \nThe Tory plan for Britain includes measures to take on big businesses such as energy firms and phone companies that fail to give a fair deal to consumers. \nBut it also takes some perks away from middle class voters who might be seen as typical Conservative voters. \nPrimary school pupils from wealthier families would lose the right to free school meals, and the winter fuel allowance of up to £300 will be taken away from all but the poorest pensioners. \nThere will also be an increase in the contribution many elderly people are expected to make to the cost of social care in their home, with the value of their property now being taken into account when authorities determine whether they can afford to pay. \nAnd the manifesto scraps the previous Conservative promise not to raise income tax or National Insurance (NI), suggesting that Mrs May wants a future Tory government to have the freedom to increase taxes such as NI if needed. \nLaunching the manifesto in Halifax, Mrs May said: “It is the responsibility of leadership to be upfront and straight with people about the challenges ahead, about the difficult decisions and trade-offs that need to be made, and the hard work required to overcome the obstacles in our way. \n“That is what this Manifesto does.” Conservative party leader Theresa May during the Conservative Party manifesto launch in West Yorkshire (Photo: PA) \nHere’s what’s in the Conservative manifesto : Tax \nIncreasing the income tax threshold to £12,500 by 2020, effectively cutting income tax for some low earners \nIncreasing the threshold for the higher rate of income tax to £50,000 \nNo increases in VAT \nBut the manifesto does not repeat the previous Tory pledge not to increase income tax or National Insurance at all A better deal for workers \nIncreasing the “living wage”, effectively the minimum wage, to 60 per cent of median earnings \nMore legal rights for self-employed workers in the “gig” economy \nTougher rules to stop business owners abusing pension funds \nOverseas firms bidding to take over UK companies will have a legal obligation to keep any promises they make during the bidding process \nFirms will have to publish some details of how much they pay executives and how this compares to pay in the wider workforce, to discourage excessive pay at the top Boris Johnson is joined by other cabinet ministers as Prime Minister Theresa May launches the Conservative Party Election Manifesto (Photo: Getty Images Europe) Pensions \nMaintain the triple-lock pension guarantee until 2020, then replace it with a double lock - meaning pensions will rise in line with earnings or inflation, whichever is highest. Energy \nAn independent review into the cost of energy to ensure that businesses and households are paying the lowest bills possible Transport Pressing ahead with the HS2 high speed rail line between London, Birmingham, Manchester and Leeds \nBuilding a “Northern Powerhouse rail” line. Planning for this is at an early stage but it is expected to link Liverpool, Manchester, Leeds, Hull, Sheffield and Newcastle. \nEnsuring every car and van is zero emission by 2050 Cities and regions \nSupporting a UK city in making a bid to host the 2022 Commonwealth Games \nMoving senior civil servants out of London into the south east \nMoving Channel 4 out of London \nContinuing to back elected mayors for towns and cities, but not for rural areas Conservative party leader Theresa May during the Conservative Party manifesto launch in West Yorkshire (Photo: PA) Education \nAt least 100 new free schools built ever year \nA specialist maths college in every city \nGetting independent schools to sponsor or open schools in the state system \nEnding the ban on opening new grammar schools \n“We will expect every 11-year-old to know their times tables off by heart” \nContinuing to introduce a “fair funding” system which increases cash for schools in many rural areas, but guaranteeing that this change will not lead to cuts in funding elsewhere \nScrapping the policy of free school meals for every primary school pupil, although they will still be free for pupils from low income families \nNew Institutes of Technology, similar to universities but teaching technical subjects Immigration \nGetting net immigration, currently 273,000 people a year, down to below 100,000 A fairer society \nRequiring larger firms to to publish more data on the pay gap between men and women \nTougher equalities laws to stop employers or landlords discriminating against ethnic minorities \nThreatening police with laws to prevent “stop and search” powers being used disproportionately against black and other ethnic minority people. \nA goal to halve rough sleeping over five years and end it by 2027 A better deal for consumers \nIncreasing security for good tenants and encouraging landlords to offer longer tenancies as standard \nMaking phone bills fairer and easier to understand, including making clear when a mobile customer has paid off the price of their handset \nA crackdown on rogue private parking operators \nA review of rail ticketing, to ensure passengers are sold the cheapest ticket \nHelping people get the best tariff from their energy supplier Health \nIncreasing NHS spending by a minimum of £8 billion in real terms over the next five years Housing \nEnsuring a previous pledged to build 1 million homes between 2015 and 2020 is met, and building half a million more by the end of 2022 \nHelping councils build new homes but only those “who will build high-quality, sustainable and integrated communities” \nSome of the new properties will have to offered to sale within 10 or 15 years. Read More The election policies are out - and here's what North East voters think of them Childcare \nA Conservative government will introduce, this year, thirty hours of free childcare for three and four-year-olds for working parents who find it difficult to manage the costs of childcare Brexit \n“We want to agree a deep and special partnership with the European Union . This partnership will benefit both the European Union and the United Kingdom: while we are leaving the European Union, we are not leaving Europe, and we want to remain committed partners and allies to our friends across the continent. \n“The negotiations will undoubtedly be tough, and there will be give and take on both sides, but we continue to believe that no deal is better than a bad deal for the UK. But we will enter the negotiations in a spirit of sincere cooperation and committed to getting the best deal for Britain.” Fox hunting \nA free vote in the House of Commons on whether to scrap the hunting ban Democracy \nMP numbers will be cut from 650 to 600, and the Fixed Term Parliament Act will be repealed, returning to the days when a government could call an election without consulting MPs \nVoters will have to show ID to take part in elections, and there will be reforms of postal voting aimed at cutting fraud Like us on Facebook ", "external_links": [], "published": "2017-05-18T21:26:00.000+03:00", "crawled": "2017-05-18T16:49:13.000+03:00", "highlightTitle": ""}