{"organizations": [], "uuid": "f25bf290ea29c1e6e2bbca5635327076a1f96ec8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12657354.ece/ALTERNATES/s1200/Lloyds-shares.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13042237", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Lloyds Bank returns to private ownership after business turnaround", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-17T14:55:00.000+03:00", "replies_count": 0, "uuid": "f25bf290ea29c1e6e2bbca5635327076a1f96ec8"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13042237", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Lloyds Bank returns to private ownership after business turnaround", "locations": [], "entities": {"persons": [{"name": "newton ayc", "sentiment": "negative"}, {"name": "manorcrest", "sentiment": "none"}, {"name": "phil urban", "sentiment": "none"}, {"name": "nic budden", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "finley", "sentiment": "none"}, {"name": "paul drechsler", "sentiment": "none"}, {"name": "robert mcalpine", "sentiment": "none"}, {"name": "jon graham", "sentiment": "none"}, {"name": "david morris", "sentiment": "none"}], "locations": [{"name": "hull", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "hilton hotel", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}], "organizations": [{"name": "jonathon manning newton aycliffe", "sentiment": "negative"}, {"name": "lloyds bank", "sentiment": "negative"}, {"name": "all bar one and harvester", "sentiment": "none"}, {"name": "foxtons", "sentiment": "none"}, {"name": "interserve construction", "sentiment": "none"}, {"name": "doncaster sixth form college", "sentiment": "none"}, {"name": "toby carvery", "sentiment": "none"}, {"name": "hull venue", "sentiment": "none"}, {"name": "carillion construction", "sentiment": "none"}, {"name": "ryde academy", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "jonathon manning middle", "sentiment": "none"}, {"name": "mitchells & butlers", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "finley structures", "sentiment": "none"}, {"name": "isle of wight", "sentiment": "none"}, {"name": "sizzling pizza & carvery", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sizzling pub & grill", "sentiment": "none"}, {"name": "mitchells", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "roundhay school", "sentiment": "none"}, {"name": "general data protection regulation", "sentiment": "none"}, {"name": "a&h construction", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Newton Aycliffe steel firm wins major contract to build venue in Hull \nA Newton Aycliffe steel firm has won a major contract to help build a £36m entertainment venue in Hull. \nFamily-run Finley Structures will work on the 960-tonne projects to fabricate and erect the steel frame for Hull Venue, on behalf of the main contractor Bam Construction. \nHull Venue will be a state-of-the-art music and events complex with up to 3,500 seats that will help the city attract large corporate conferences, concerts, stand-up comedy and sporting events. \nAs well as fabricating and erecting the steel for the multi-use complex, Finley Structures is also installing pre-cast concrete stairs, lift shafts and terrace units as part of the project. \nThe Durham firm is already on site in Hull, while working on another redevelopment project closer to home in Durham city, on the multi-million pound Riverwalk development. \nFinley Structures operations manager Jon Graham said: \nThis is another phoenix from the flames type of project. \nThere’s a lot of redevelopment going on in Hull at the moment, as part of its 2017 City of Culture programme, and it’s another good example of how we’re helping to transform an old site into a state- of-the- art venue. \nThe Hull Venue contract is one of several major projects won by Finley Structures in the first part of 2017. They also include a 283-tonne project to build a new Hilton Hotel in Lincoln for main contractor Manorcrest, a 300-tonne warehouse in Leicester for A&H Construction and a 614-tonne project for Carillion Construction in Sunderland. \nThe education sector has also been a significant area of growth for Finley Structures in the last 12 months. Recent projects have included Roundhay School in Leeds for Interserve Construction, Ryde Academy on the Isle of Wight for Sir Robert McAlpine, and Doncaster Sixth Form College for BAM Construction. Hull Venue will have 3,500 seats 8:43 Jonathon Manning We need a business Brexit taskforce, CBI president to say \nThe next government should set up a business Brexit taskforce to help smooth the way to the UK leaving the European Union, an industry leader is urging. \nPaul Drechsler, president of the CBI, said business and the government shared the same goal of a thriving economy. He will tell the CBI’s annual dinner in London today that the next government should champion the value of businesses in this country. \nMr Drechsler will tell 1,000 businessmen and women that to he Brexit right, the new government will need to get to grips with the complexity of the task. He said: \nAt this time of unprecedented challenge, we need unparalleled co-operation between companies and the next government. \nSo in their first 50 days, we want the next government set up a Business Brexit Taskforce. Where the top minds from government and business work together on the most complex issues, it’s a ‘win-win’ situation for everyone. \nHe used an exampled of computer part being bought by a customer in Germany from Wales. He argued that the metals used in the chip came from South Africa and Turkey, using free trade agreements the UK holds with the EU. \nThe plastics are also processed in EU countries and engineers in France, Croatia and Hungary might also work on the chip with their colleagues in Wales. \nHe added: \nThe chip has been made to shared European standards with its intellectual property protected by a Europe-wide trademark. The chip is insured with a financial package covered by EU passporting. And when the chip is incorporated into a computer for sale it will meet Europe-wide levels of consumer protection. All that complexity for one product, made by one company. \nThat’s just the tip of the iceberg and this is what the next government needs to get its head around. But here’s the good news. As business, we can help the next government navigate this labyrinth of Brexit complexity. The Union flag and the EU flag flying (Photo: PA) 8:35 Jonathon Manning Soaring wage costs and Brexit-hit pound hit profits at Mitchells & Butlers \nThe owner of All Bar One and Harvester has reported falling half-year profits after taking a hit from the Brexit-hit pound and soaring wage costs. \nMitchells & Butlers said profits fell almost 10% to £75m in the six months to the end of April, despite a number of measures put in place to mitigate the effects of rising inflation. \nBoss Phil Urban said: \nMargins have been adversely impacted by increased costs, most notably from wage inflation, property costs and exchange rate movements. \nIn order to partially mitigate these costs we have been working hard to encourage our guests to trade up and increase spend per head for a more premium experience whilst challenging our general managers to run their businesses as cost effectively as possible. \nThe group also noted that wholesale food inflation increased 6% in March and said that it has carried out “some price adjustments”, including increases and reductions, as a result. \nIn better news, like-for-like sales at Mitchells rose 1.6% in the period, with overall sales growing 2.4% to £1.2bn. \nMr Urban added: \nOverall, we are pleased with the turnaround in our sales trajectory and relative performance against the market. In a challenging cost and consumer environment we will continue to focus on our three priority areas. \nMitchells is in the process of overhauling its pub estate, targeting more upmarket brands. The group has launched Sizzling Pizza & Carvery and Sizzling Pub & Grill in an attempt to fight back against new competition in the eating out sector. Mitchells & Butlers, which owns the Toby Carvery brand 8:30 Jonathon Manning Slowing property sales in London blamed for Foxtons revenue slump \nRevenues at Foxtons slumped in the first quarter as the London-focused estate agent pointed to a slowing sales market in the capital. \nThe group said revenue fell 25% to £28.7m in the quarter ending on March 31, down from £38.4m in the same period last year. Of that figure, property sales commissions nearly halved to £11.1m from £20m. \nFoxtons said the performance was set against record sales volumes in the first quarter last year, when transactions were brought forward ahead of the stamp duty surcharge on buy-to-let investments and second homes. \nThe estate agent has previously flagged the EU referendum as a factor in slowing the London property market. Boss Nic Budden said in March that the London market was “severely impacted” by the Brexit vote, which he claimed had led to a “substantial reduction in property sales transactions”. \nLettings revenues were broadly flat at £15.5m and mortgage broking fees came in at £2.1m versus last year’s £2.6m. A branch of Foxtons in London 8:25 Jonathon Manning Middle market business found to have serious cyber security failings \nFollowing widespread cyber attacks on the NHS and Nissan, a recent ethical exercise has found serious deficiencies in the cyber security of many middle market companies. \nThe hacking simulation was carried out by audit, tax and consulting firm RSM, with the permission of the other organisations involved. It revealed significant weaknesses in the strength of the businesses’ internal controls. \nIn one instance, RSM sent more than 200 spoof emails asking employees to validate their staff login. Within minutes, 16 per cent of employees had followed the instructions and clicked on the link and by the end of the day this had climbed to 35 per cent. \nThe findings are backed up by the results of a new RSM survey which has revealed that 40 per cent of organisations admit they have been a victim of cybercrime, with over a quarter saying they have been hit in the past 12 months. \nDespite the high level of incidents, one in five firms that have suffered breaches have since done nothing to improve their security against future attacks. \nDavid Morris, a technology risk assurance director at RSM, said: \nThe events of the last few days have shown just how disruptive a cyber-attack can be and how important effective defences are. \nHowever, our recent ethical hacking exercise has revealed some startling weaknesses in the defences of sizeable middle market companies that you would expect to be better prepared to withstand an attack. If we had been carrying out a genuine hacking attempt with malicious content, the business ramifications could have been catastrophic. \nOur survey has shed light on the ignorance and at times wilful complacency among some businesses with respect to the threat from cybercrime. Hackers are becoming increasingly savvy about organisations’ specific vulnerabilities, and can seek to exploit these weaknesses with targeted methods such as whaling or phishing. \nA successful cyber-attack can lead to operational disruption, financial loss and reputational damage, so organisations must do more to plug their knowledge gap to protect their customers, employees and their future business. \nProtecting customer data is also becoming increasingly important. New data protection rules which come into force in May 2018 will significantly increase penalties for data breaches. Failure to comply with the new General Data Protection Regulation, known as GDPR, could result in fines of up to €20m or 4 per cent of annual global turnover. A woman using a laptop (Photo: PA) 8:20", "external_links": [], "published": "2017-05-17T14:55:00.000+03:00", "crawled": "2017-05-17T10:56:59.000+03:00", "highlightTitle": ""}