{"organizations": [], "uuid": "20c79aabfed4b36a3ed023673a79c8527736189c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13090762.ece/ALTERNATES/s1200/Untitled-design-41.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/roaming-charges-use-mobile-phones-13089881", "country": "GB", "domain_rank": 21960, "title": "Roaming charges to use mobile phones in EU will be scrapped this summer - but will Brexit affect it?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-25T19:15:00.000+03:00", "replies_count": 0, "uuid": "20c79aabfed4b36a3ed023673a79c8527736189c"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/roaming-charges-use-mobile-phones-13089881", "ord_in_thread": 0, "title": "Roaming charges to use mobile phones in EU will be scrapped this summer - but will Brexit affect it?", "locations": [], "entities": {"persons": [{"name": "ken welsh", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "kester mann", "sentiment": "none"}, {"name": "dave dyson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "us virgin islands", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "macau", "sentiment": "none"}, {"name": "vatican city", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "marbella", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "liechtenstein", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "jersey", "sentiment": "none"}, {"name": "bosnia and herzegovina", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "sri lanka", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "channel islands", "sentiment": "none"}, {"name": "west indies", "sentiment": "none"}, {"name": "eiffel tower", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "albania", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "guernsey", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "san marino", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "tesco", "sentiment": "none"}, {"name": "ccs insight", "sentiment": "none"}, {"name": "vodafone  eu", "sentiment": "none"}, {"name": "vodafone", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "ee  ee", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "costa del sol", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "You won't be charged more to use your phone in other EU countries - but for how long? Share   Thank you for subscribing!   \nGood news for holiday makers - by June 15 your mobile phone company will no longer be allowed to charge British customers extra to use their phones in other EU countries. \nSome operators have already got rid of the extra charges, which have left unwitting customers with huge bills simply because they forgot to disable “data roaming” when they arrived in a new country . \nIt follows a lower cap on charges introduced last year. \nBut, of course, Brexit is coming and Britain is set to eventually leave the European Union , which means British customers will no longer be subject to the agreement. Marbella, Costa del Sol, Spain (Photo: Ken Welsh) \nHere’s everything you need to know For the last decade, the EU has been working to slash the price of using your phone in another member state \nIn 2015, the EU announced roaming charges will be banned from June 15, 2017. This means customers will pay the same price for calls, texts and data wherever they are in the EU if they’re a customer of a mobile phone company in any EU member state. \nThe European Commission - which draws up and drafts EU laws - says it spent 10 years driving decreases in roaming charges. Between 2007 and 2015, it became 80% cheaper to send texts and use mobile data throughout the EU, while roaming charges were cut by 91%. \nFrom April 2016, a lower cap was placed on roaming charges. Operators could only charge a small amount more than their domestic prices. The maximum surcharge was around 3.5p/minute per call, 1.4p per text and 3.5p per MB of data. \nFrom June 2017, using your phone in any EU member state abroad will cost the same as it would in Britain - but some operators have already removed the charges and extended that to countries outside the EU. Read More What has my phone company done and when will it remove roaming charges? O2 \nFrom June 15, roaming charges will be scrapped in the EU for O2 customers \nThe operator is extending the surcharge-free service to all customers using their phones in some non-EU destinations. \nThey are Iceland, Norway, San Marino, Vatican City. \nIf you are an O2 Pay Monthly or business customer, you can also use your phone for no extra cost in the following non-EU locations: Guernsey, Isle of Man, Jersey, Monaco and Switzerland. Three \nThree abolished roaming charges in 2013, becoming the first UK Network to do so. It also doesn’t charge extra to use your phone in a some non-EU countries. \nFrom June 15, these will include Brazil and Singapore. \nThese are the non-EU destinations which Three has removed or is removing roaming charges from: Australia, Brazil, Guernsey, Hong Kong, Iceland, Indonesia, Isle of Man, Macau, \nNew Zealand, Norway, Puerto Rico, San Marino, Singapore, Sri Lanka, Switzerland, US Virgin Islands, USA and Vatican City. Read More Why can't patients use mobile phones in NHS hospital wards? EE \nEE customers on some plans can already roam worry-free in the European Union, but those on the “4G Essential” tariff have to pay £4 a day for unlimited calls and 500mb of roaming data. \nBut from June 15, every one will be in the same boat. You can use your EE phone in Europe as you would in the UK. \nAnd, EE is extending the deal to eight non-European Union destinations. \nThese are: Iceland, Norway, Liechtenstein, Switzerland, Monaco, Isle of Man, Jersey and Guernsey. Vodafone \nEU roaming charges were scrapped in April by Vodafone, meaning early season holiday makers have been able to use their phones without fear of nasty charges across the EU. \nAnd, Vodafone won’t charge customers extra to use their phones in some non-EU countries and destinations either. \nThey include: Albania, Bosnia and Herzegovina, Channel Islands, French West Indies, Iceland, Isle of Man, Liechtenstein, Monaco, Norway, San Marino, Switzerland, Turkey and Vatican City. Tesco Mobile \nLast summer, Tesco ran a “Home from Home” promotion which scrapped roaming to 47 different countries, including those in the EU. \nBut its website still says customers can expect to pay roaming charges in the EU this year. \nBut from June 15, these will have to be scrapped in EU member states. So what happens after Brexit? The Union flag and the EU flag flying (Photo: PA) \nBritain is set to leave the EU and has already kick-started the Brexit process, which should take two years. \nArticle 50 was triggered on March 29, so Britain aims to quit the EU by April 2019. \nThat means agreements like the one scrapping roaming charges may no longer be valid in Britain, as it will not be in the EU. \nBut does that mean we will see a return of the high roaming charges? Not necessarily. \nMany operators have scrapped roaming charges beyond the EU’s borders, and experts think they would be silly to reintroduce them for British companies, as they would lose customers. \nKester Mann, telecoms analyst at CCS Insight told the Mirror it would be a “foolhardy option”. \nHe added: “I think it would go down very, very badly with customers. \n“It would be very difficult for them to do that just because the UK is such a competitive market and we’ve moved such a long way from roaming.” \nIt’s also worth remembering Three scrapped roaming charges four years before the law came in, which indicates operators are willing to cut bill costs to win customers. Its chief executive Dave Dyson says the goal is for 100% roam free overseas travel. \nBut there is nothing stopping the operators reintroducing them if they wanted to. Could I find a cheaper mobile deal in another EU country and then just use it as my UK phone? A general view of the Eiffel Tower, Paris (Photo: PA) \nPossibly, but there are rules which define roaming as temporary and state customers have to be “normally resident” or have “stable links” to the country where their phone is registered. So if your roam for too long, they might just cut you off. Like us on Facebook", "external_links": [], "published": "2017-05-25T19:15:00.000+03:00", "crawled": "2017-05-25T16:03:10.000+03:00", "highlightTitle": ""}