{"organizations": [], "uuid": "e419758701626a8756edb30daa71170f7338c2c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30309236/15983933.jpg", "site_section": "http://www.westernmorningnews.co.uk/farming.rss", "section_title": "Devon Live Farming RSS feed", "url": "http://www.devonlive.com/leading-firm-appointed-to-guide-east-devon-organic-dairy-through-brexit/story-30309236-detail/story.html", "country": "GB", "title": "Leading firm appointed to guide Devon organic dairy through...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Leading firm appointed to guide Devon organic dairy through...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-03T17:03:00.000+03:00", "replies_count": 0, "uuid": "e419758701626a8756edb30daa71170f7338c2c9"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/leading-firm-appointed-to-guide-east-devon-organic-dairy-through-brexit/story-30309236-detail/story.html", "ord_in_thread": 0, "title": "Leading firm appointed to guide Devon organic dairy through...", "locations": [], "entities": {"persons": [{"name": "barney tremaine", "sentiment": "none"}, {"name": "velcourt", "sentiment": "none"}, {"name": "robbie taylor", "sentiment": "none"}, {"name": "clinton devon estates", "sentiment": "none"}, {"name": "john varley", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "clinton devon farms partnership", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "clinton devon estates", "sentiment": "none"}, {"name": "lower otter valley", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "cdfp", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "clinton devon farms partnership", "sentiment": "none"}, {"name": "devon farms partnership", "sentiment": "none"}, {"name": "nitrate vulnerable zones", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leading firm appointed to guide Devon organic dairy through Brexit   A five-year plan for the farming business at Clinton Devon Farms Partnership will focus on improving organic dairy performance in terms of output and productivity Leading firm appointed to guide Devon organic dairy through Brexit   A five-year plan for the farming business at Clinton Devon Farms Partnership will focus on improving organic dairy... Comments (0) \nOne of the South West's largest organic dairies has appointed a leading farming company to help manage the business in the run-up to Brexit. Velcourt, which manages and advises on farms around the UK, will help Clinton Devon Farms Partnership (CDFP), a Clinton Devon Estates farming business, steer its East Devon organic dairy through the complexities of leaving the European Union. \nThe firm has been advisor to CDFP since November 2016, working with the farm partners to develop a strategy to meet the challenges and opportunities facing agriculture once the UK leaves the European Union in 2019. \nA five-year plan for the farming business will focus on improving organic dairy performance in terms of output and productivity whilst meeting ambitious targets for soil and water quality. It also identifies targets for improving wildlife habitats and biodiversity, which are informed by Clinton Devon Estates' Wildlife Prospectus. \nJohn Varley, estates director for Clinton Devon Estates, said: \"Post Brexit, successful dairy farming operations will be those that have the right systems in place. They will need to be resilient to volatile currencies and input costs and able to take advantage of global and local demand for milk. \n\"We have very high standards for our farms and have always been proud of our professional management. We continue to make focussed investments to raise productivity and competitiveness while, all the time, innovating, improving animal health and enhancing the environment. Velcourt share our values and aims and we look forward to a successful partnership.\" \nREAD NEXT: Devon family machinery firm celebrates historic relocation \nCDFP operates a 750 cow organic dairy, producing approximately 4.8 million litres of organic milk each year. The Friesian herds graze on land primarily in the Lower Otter Valley, alongside the East Devon Pebblebed Heaths SSSI, SPA, SAC. CDFP has had full organic status since 2009. \nIn 2011, Clinton Devon Farms Partnership invested £100,000 in a dirty water storage facility with a 20,000 cubic metre capacity for storing farm slurry. The slurry is spread on land at the appropriate time of year, replacing the need for nitrogen fertiliser and, most importantly, helping to keep streams and rivers clean by meeting the requirements of the Nitrate Vulnerable Zones anti-pollution legislation. Over the past five years over £1.5 million has been invested in infrastructure to ensure the highest standards of animal welfare and to improve efficiency and productivity. \nRobbie Taylor, Velcourt's livestock director, added: \"We are delighted to be associated with Clinton Devon Estates and are looking forward to working closely with the Clinton Devon Farms Partnership to deliver a farming strategy that plays to our shared values of achieving the highest standards for farming and milk production. This is a great opportunity to take the farm to the next stage in readiness for Brexit and changing economic circumstances with a new agricultural policy on the horizon post 2020.\" \nVelcourt's Barney Tremaine, has been appointed to the role of farms manager and is working with the CDFP team to manage day to day operations and the implementation of the new five-year strategy. \nHe concluded: \"Organic farming is all about farming the land sustainably and we are focusing on where to invest to get the best return; not only for the business and the welfare of our animals but also for nature, the environment and society.\" READ NEXT:", "external_links": [], "published": "2017-05-03T17:03:00.000+03:00", "crawled": "2017-05-04T02:55:39.000+03:00", "highlightTitle": ""}