{"organizations": [], "uuid": "24dd4612bb31a847072c9f13eaa86ea0dc85383b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30324758/15996010.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/exeter-s-ben-bradshaw-reacts-to-green-party-offer-to-stand-aside/story-30324758-detail/story.html", "country": "US", "title": "Exeter's Ben Bradshaw has reacted to the Green Party offer to stand aside | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Exeter's Ben Bradshaw has reacted to the Green Party offer to stand aside | Devon Live", "spam_score": 0.186, "site_type": "news", "published": "2017-05-10T23:34:00.000+03:00", "replies_count": 0, "uuid": "24dd4612bb31a847072c9f13eaa86ea0dc85383b"}, "author": "", "url": "http://www.devonlive.com/exeter-s-ben-bradshaw-reacts-to-green-party-offer-to-stand-aside/story-30324758-detail/story.html", "ord_in_thread": 0, "title": "Exeter's Ben Bradshaw has reacted to the Green Party offer to stand aside | Devon Live", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "vix lothian", "sentiment": "none"}, {"name": "moore", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "wight", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "devon live exeter", "sentiment": "none"}, {"name": "isle of wight", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "green party", "sentiment": "none"}, {"name": "labour's headquarters", "sentiment": "none"}, {"name": "exeter greens", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "exeter green party's candidate", "sentiment": "none"}, {"name": "exeter green party", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "exeter's labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter's Ben Bradshaw has reacted to the Green Party offer to stand aside By Alex_Richards | Posted: May 10, 2017 0 COMMENTS SHARES Exeter's Labour Party candidate for the upcoming general election has reacted to a surprising offer from the Green Party. Exeter's Ben Bradshaw has reacted to the Green Party offer to stand aside X \nCopy link to paste in your message / Exeter's Labour Party candidate for the upcoming general election has reacted to a surprising offer from the Green... Comments (0) \nExeter's Labour Party candidate for the upcoming general election has reacted to a surprising offer from the Green Party. \nExeter Greens voted overwhelmingly to support a deal which would see the local Party stand down in the general election in return for Labour standing back in one of their target constituencies, the Isle of Wight. \nExeter's Labour candidate Ben Bradshaw said: \"It would be a pity if the Green Party fielded a candidate against me in Exeter, as that could hand the seat to the Conservatives. \n\"However, I'm in no position to dictate to Labour members elsewhere in the country whether or not to field a candidate in their area. \nReturn to Devon Live home page or read next: Devon crime czar says election expenses investigation was 'sobering experience' \n\"Exeter is the only non-Tory constituency this side of Bristol and the Conservatives are throwing everything at us. \n\"So I urge all those who believe it's vital to keep at least some opposition to the Government in our region and prevent the South West becoming a one-party state to support my re-election in Exeter.\" \nThe letter with the proposition, hand delivered to Labour's Headquarters, applauds efforts in recent weeks to forge electoral alliances in a number of constituencies and 'makes a serious offer to save Exeter from a Tory victory locally' \nHowever, it makes clear the offer is wholly dependent on confirmation that Labour will stand down in the Isle of Wight. \niana Moore, Exeter Green Party's Candidate in the 2015 General Election, quadrupled the Green vote to 3491 votes, a 6.5% share and saved the deposit for the first time ever in Exeter. She said: \"Theresa May's snap election is a cynical and underhand move. \n\"Another Tory government will have a devastating effect on this country, especially with the extreme Brexit she plans and the continued austerity program which is cutting into people lives, dismantling our public services and wrecking our environment. \n\"This election shows that our electoral system is not fit for purpose. We need a system of proportional representation to ensure that every vote counts rather than counting on tactical voting. \n\"However, while we have such an unfair system, Exeter Green Party, backed by its membership, has taken a bold move to try and stop the Tories. \n\"We will stand back in Exeter if the Labour Party stand back on the Isle of Wight. Greens came second on the island in the County Council elections and there is real momentum building behind our excellent candidate, Vix Lothian. \n\"Labour cannot win on the Isle of Wight; we urge them to back a progressive candidate who can. But we are clear: reciprocation is needed; alliances cannot be a one-way street. \" \nExeter Green Party will submit the nominations papers for its candidate by 4pm tomorrow if the deal isn't brokered with Labour.", "external_links": [], "published": "2017-05-10T23:34:00.000+03:00", "crawled": "2017-05-10T18:36:13.000+03:00", "highlightTitle": ""}