{"organizations": [], "uuid": "e101cc21b3905805099bb1413b49c11964e20977", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12969680.ece/ALTERNATES/s1200/iainmalcolm.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/firm-plan-needed-governments-plan-12969688", "country": "GB", "domain_rank": 21960, "title": "Why a firm plan is needed for the Government's plan to help boost industry", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why a firm plan is needed for the Government's plan to help boost industry", "spam_score": 0.0, "site_type": "news", "published": "2017-05-02T12:00:00.000+03:00", "replies_count": 0, "uuid": "e101cc21b3905805099bb1413b49c11964e20977"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/news/north-east-news/firm-plan-needed-governments-plan-12969688", "ord_in_thread": 0, "title": "Why a firm plan is needed for the Government's plan to help boost industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Why a firm plan is needed for the Government's plan to help boost industry Iain Malcolm argues that the industrial strategy will help boost jobs but without a proper plan it could be a missed opportunity Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA new industrial strategy, designed to encourage growth, could offer parts of the North East a lifeline. \nSouth Tyneside Council is working alongside Sunderland City Council on the International Advanced Manufacturing Park – a £91.9m project – but Councillor Iain Malcolm, leader of the authority believes a firm plan for the strategy will be vital to ensure the regions don’t get left behind. \nThe Government’s emerging Industrial Strategy provides an opportunity for local growth and could help rebalance the economy nationally. \nHowever, without resources for sensibly targeted intervention by central and local government, it can only achieve limited success. \nSouth Tyneside Council welcomes the publication of the Government’s Industrial Strategy which mirrors many of our own aims to strengthen our local and regional economy. The Green Paper recognises the disparity of growth across the UK and the need to redress this to spread wealth across the nation, not just from South to North, but within regions too. \nIt is only by rebalancing the UK economy that we can deliver a more diversified economic model. \nBy maximising the assets in South Tyneside, for example, we can make a greater contribution to UK growth as a whole, as well as closing the gap in economic performance which will result in better opportunities and prospects for our residents. \nA different approach is needed to address inter-regional disparities so that all communities can realise their full potential. Growth isn’t just about playing to our strengths but should also be about identifying potential and carrying out the right interventions to maximise those. \nThis is something about which the Confederation of British Industry (CBI), the British Chambers of Commerce (BCC) and the Engineering Employers’ Federation (EFF) are all in agreement. They have called on the government to tackle inequality across the country as part of the industrial strategy. The CBI proposed a pledge to reduce the gap in productivity between the richest and poorest regions by 15 percentage points by 2030 while the EEF said that spreading new technologies across the country is crucial to reducing imbalances. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Philip Hammond: Post-Brexit Britain won't 'slink off like a wounded animal' Share this video Watch Next \nAt local level, there is a real desire to deliver. Businesses and local authorities are united in their desire to boost economic growth and prosperity for the nation as a whole. In South Tyneside we remain committed to working with key private sector partners to create jobs and boost growth. We aim to attract new businesses as well as create an environment in which existing businesses can grow and prosper. We are beginning to see the results of our efforts but an Industrial Strategy with the resources to properly support it could create the conditions for economies to grow - facilitating and enabling regeneration and development. \nOne example of how this approach is already paying dividends is the International Advanced Manufacturing Park (IAMP). Our partnership with Sunderland City Council has created the environment for long term economic growth and job creation, exploiting the A19 economic artery to develop a cross-boundary scheme with a focus on large scale advanced manufacturing. \nThe funding already announced by central government for this £91.9m project has been earmarked for the supporting infrastructure of new roads, access and utilities. This will allow us to capitalise on current and future improvements to upgrade the strategic A19 corridor. \nThe role of local government in this arena should not be overlooked. Local authorities have whole place responsibility and can bring in private sector partners where appropriate on infrastructure projects. The IAMP is just one example. The South Shields 365 masterplan and our vision for Holborn in South Shields are others where we will kick start investment by working with the private sector. It’s important to remember that none of these economic projects would happen without local government leading them. Read More Ken Loach on Labour: I, Daniel Blake director urges MPs and supporters to 'get behind Jeremy Corbyn' \nTo be able to deliver the aims of the Industrial Strategy we need both the capacity and the resources to be able to identify opportunities, build on strengths and galvanize ourselves into action to deliver practical solutions on the ground. It is, therefore disappointing that the strategy completely ignores tourism and culture which, particularly in coastal areas, such as South Tyneside, play a vital role. Tourism is one of South Tyneside’s key strengths, brings £275 million into our economy every year and supports nearly 3,000 full time jobs. It is pivotal to the social and economic future of our region. By investing in our Foreshore we have enhanced the customer experience for our visitors and created an environment for private sector growth, helping to sustain our economy in the longer term. While the ten pillars of growth set out in the Strategy are right for driving growth, the contribution made by culture and tourism should be considered within the wider approach. \nTo conclude, the industrial strategy provides a framework but what is needed is a plan, and resources to deliver it. As we look ahead to post-Brexit Britain, central Government must address what financial support will be available when the current government programme (LGF) and European funding ceases. Resources need to be allocated to a strategy that aims to improve living standards across the whole nation. Funding must be aligned to it if it is to be a success. Only then will local areas be able to redress inter-regional economic inequality. Like us on Facebook", "external_links": [], "published": "2017-05-02T12:00:00.000+03:00", "crawled": "2017-05-02T07:29:26.000+03:00", "highlightTitle": ""}