{"organizations": [], "uuid": "6b1fc68668ac0d4aec084f7fa4ad6acb6e8530c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30319396/15991743.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/company-is-helping-to-get-medicine-to-africa-s-poor/story-30319396-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Morningside Pharmaceuticals is helping to get medicine to Africa's poor | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Morningside Pharmaceuticals is helping to get medicine to Africa's poor | Leicester Mercury", "spam_score": 0.767, "site_type": "news", "published": "2017-05-09T18:22:00.000+03:00", "replies_count": 0, "uuid": "6b1fc68668ac0d4aec084f7fa4ad6acb6e8530c6"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/company-is-helping-to-get-medicine-to-africa-s-poor/story-30319396-detail/story.html", "ord_in_thread": 0, "title": "Morningside Pharmaceuticals is helping to get medicine to Africa's poor | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "diane hardy", "sentiment": "none"}, {"name": "morningside", "sentiment": "none"}, {"name": "nik kotecha", "sentiment": "none"}], "locations": [{"name": "africa", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "liberia", "sentiment": "none"}, {"name": "castle business park", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "syston", "sentiment": "none"}, {"name": "morningside", "sentiment": "none"}], "organizations": [{"name": "leicester mercury morningside pharmaceuticals", "sentiment": "negative"}, {"name": "morningside pharmaceuticals", "sentiment": "negative"}, {"name": "dr nik kotecha morningside pharmaceuticals", "sentiment": "none"}, {"name": "voluntary service", "sentiment": "none"}, {"name": "inter care", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "unicef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Morningside Pharmaceuticals is helping to get medicine to Africa's poor By Leicester Mercury | Posted: May 09, 2017 By tom pegden 0 COMMENTS SHARES lifesaving work: Inter Care sends medical products and equipment to the poorest parts of Africa. Below, Morningside chief executive Dr Nik Kotecha Morningside Pharmaceuticals is helping to get medicine to Africa's poor X \nCopy link to paste in your message / lifesaving work: Inter Care sends medical products and equipment to the poorest parts of Africa. Below, Morningside... Comments (0) \nA pharmaceutical company is helping a charity send recycled medicines and medical equipment to sick people in the developing world. \nMorningside Pharmaceuticals has paid for an online system to help the Inter Care charity track the recycled medicines and healthcare products it sends to rural health units in the poorest parts of Africa. \nInter Care, which is based in Syston, sends high quality items such as dressings and instruments which would otherwise be incinerated. \nIt supports about 130 health units in six African countries, which collectively serve more than 11 million people. \nMorningside chief executive Dr Nik Kotecha said: \"By supporting Inter Care with this new IT system, we are helping them to provide lifesaving medicines to deprived countries which need it the most. \n\"Inter Care do great work in developing countries and Morningside are delighted that they are able to help enhance Inter Care's quality management system.\" \nMorningside is a major wholesaler and exporter of branded and generic medicines and healthcare products, with experience of exporting to more than 90 countries. \nRead more: 'Talks on Brexit vital if we are to prosper' \nAs well as supplying the public and private sector, the business, located on the Castle Business Park, Loughborough, has been supporting global aid efforts for more than two decades. \nLast year, it won a £1.2 million Unicef contract to supply medicines for emergency aid projects in the Middle East as well as Haiti and Liberia. \nAround 20 per cent of its annual turnover – accounting for around £10 million – comes from providing overseas aid. \nRead more: Business leaders chosen as Export Champions \nCloser to home, Morningside supplies clients including the NHS and the retail pharmacy sector. \nThis will be the first electronic stock control system Inter Care has had since it was set up in 1974, and means the charity can track aid it sends to Africa from the point it enters its warehouse, right through to delivery to each health unit. \nInter Care general manager Diane Hardy said as a charity which places recycling at the core of its work, the new system will also help its own in-house recycling by replacing paper record-keeping with digital records. \nLess paperwork also means more space to store donated medical aid and less time spent looking through files, which will now be accessible at the click of a mouse. \nShe said: \"Thanks to Morningside, Inter Care now has a highly professional and efficient stock control system, putting us at the top of our game for a charity of our size. \n\"Morningside's mission is to make quality healthcare an affordable and accessible reality throughout the world, which echoes that of Inter Care. \n\"This makes them the perfect partner for our charity and we are hugely grateful and honoured to receive their support.\" \nBoth Morningside and Inter Care are proud winners of a Queen's Award. \nMorningside holds the Queen's Award for Enterprise – International Trade, for outstanding achievement by UK businesses. While Inter Care holds the Queen's Award for Voluntary Service, in recognition of the support the charity receives from more than 50 volunteers, many of whom are medically trained.", "external_links": [], "published": "2017-05-09T18:22:00.000+03:00", "crawled": "2017-05-09T13:30:33.000+03:00", "highlightTitle": ""}