{"organizations": [], "uuid": "ed3878b7f39c29e00acdf352717de1bd4af0403f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30316531/15989837.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/exeter-conservatives-choose-local-barrister-to-take-on-ben-bradshaw-in-the-general-election/story-30316531-detail/story.html", "country": "GB", "title": "Rich_Booth published Exeter Conservatives choose local barrister to take on Ben...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Rich_Booth published Exeter Conservatives choose local barrister to take on Ben...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-06T23:14:00.000+03:00", "replies_count": 0, "uuid": "ed3878b7f39c29e00acdf352717de1bd4af0403f"}, "author": "Rich_Booth", "url": "http://www.devonlive.com/exeter-conservatives-choose-local-barrister-to-take-on-ben-bradshaw-in-the-general-election/story-30316531-detail/story.html", "ord_in_thread": 0, "title": "Rich_Booth published Exeter Conservatives choose local barrister to take on Ben...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter Conservatives choose local barrister to take on Ben Bradshaw in the General election By Rich_Booth | Posted: May 06, 2017 1 COMMENTS SHARES James Taghdissian was today chosen as the Conservative candidate for Exeter in the General Election Exeter Conservatives choose local barrister to take on Ben Bradshaw in the Gener... X \nCopy link to paste in your message / Comments (1) \nA local barrister who went to Exeter University has been selected as the Conservative candidate for Exeter. \nJames Taghdissian was today chosen as the Conservative candidate for Exeter in the General Election. The decision was made at the Masonic Hall in the city centre following a meeting that lasted several hours. \nThe candidate, who describes himself as a 'barrister, husband, dad' on his Twitter profile said 'Exeter deserves a strong voice' following his selection. \nHe was an Exeter City Councillor for the Polsloe ward between 2008 and 2012 and a former school governor at Ladysmith Junior School and Exeter School. \nHe also stood for Cardiff West in the 2015 General Election where he earned a 25.2% share and lost out to Labour's Kevin Brennan. \nRead more: Here's the full round-up of the Devon County Council results \nIn a statement he vowed to be Exeter's champion alongside Theresa May, working together to 'strengthen the economy and get the best possible deal from Brexit and beyond.' \nHe added: \"It would be an honour to be Exeter's next MP; I've spent most of the past 17 years here and am passionate about our beautiful, diverse and vibrant city. \n\"I went to University in Exeter, my wife works in the local hospital, we're raising our children here and our eldest is in a local primary school. \n\"I know what our area needs because my family and I rely on the same public services as everyone else. Exeter deserves a strong voice. \n\"The choice on 8 June is clear. It is a choice between Theresa May's Conservative Team providing strong and stable leadership for the United Kingdom, or a coalition of chaos and instability led by a failed and bumbling Jeremy Corbyn that will put our nation's future at risk.\" \nThe local priorities listed in the announcement today by The Conservatives included: \nFair funding for schools \nInvestment in the city and the south west \nA Brexit deal that works for Exeter \nA member of Coleton Chambers , the barrister and new Conservative candidate lists a string of recent cases on the Chambers' website, including the 'Marine B case' where he defended the second marine accused of murdering Afghan insurgent at preliminary hearings. \nThe site adds: \"A well regarded junior, James has extensive experience of conducting criminal trials in the Youth, Magistrates' and Crown Courts. James is a category 3 prosecutor on the Unified List of Advocates although his practice frequently includes conducting cases above his grade. \n\"James's prosecution experience includes multi-handed trials of burglary and public disorder as well as drugs, violence and dishonesty offences. He also defends in the Magistrates' and Crown Courts including recent and historic sexual offences. He has successfully defended a lorry driver accused of causing death by careless driving and represented \"Marine B\" in the preliminary \"anonymity\" argument before the Judge Advocate General. \n\"In addition, James has defended large-scale multi-handed cases including conspiracy to defraud (six-handed £500,000 fraud against a well-known insurer) and conspiracy to burgle (gang targeting supermarket cash machines across the Midlands and south of England). \n\"James has experience of proceeds of crime applications including restraint, forfeiture and confiscation. He frequently appears in the Magistrates' Courts in relation to cash forfeiture and in the Crown Court in post-trial applications for confiscation.\" \nMr Taghdissian was rumored to be selected ahead of today despite reports the party planned to \"parachute\" in potential candidates to take Devon's only Labour seat. \nThe news came after after senior figures decided that \"Exeter is doable\" at the general Election. \nMr Taghdissian will be taking on Labour's Ben Bradshaw who held his seat in 2015 with an increased majority of 7,000 despite a poor performance nationally for the party under Ed Miliband. He has held Exeter since 1997.", "external_links": [], "published": "2017-05-06T23:14:00.000+03:00", "crawled": "2017-05-06T19:30:32.000+03:00", "highlightTitle": ""}