{"organizations": [], "uuid": "d4dde020625e5e865d55825b954da6bab500e0ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13005253.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-easts-greatest-mps-welfare-13005071", "country": "GB", "domain_rank": 21960, "title": "The North East's greatest MPs: From the Welfare State to the Nobel Prize", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The North East's greatest MPs: From the Welfare State to the Nobel Prize", "spam_score": 0.0, "site_type": "news", "published": "2017-05-09T15:00:00.000+03:00", "replies_count": 0, "uuid": "d4dde020625e5e865d55825b954da6bab500e0ef"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-easts-greatest-mps-welfare-13005071", "ord_in_thread": 0, "title": "The North East's greatest MPs: From the Welfare State to the Nobel Prize", "locations": [], "entities": {"persons": [{"name": "macdonald", "sentiment": "none"}, {"name": "charles grey", "sentiment": "none"}, {"name": "ellen", "sentiment": "none"}, {"name": "henry hetherington emmerson", "sentiment": "none"}, {"name": "earl grey", "sentiment": "none"}, {"name": "glenamara  born edward watson short", "sentiment": "none"}, {"name": "ramsay macdonald", "sentiment": "none"}, {"name": "shelley", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}, {"name": "eldon  he", "sentiment": "none"}, {"name": "eldon", "sentiment": "none"}, {"name": "john scott", "sentiment": "none"}, {"name": "burt", "sentiment": "none"}, {"name": "william beveridge", "sentiment": "none"}, {"name": "william gladstone", "sentiment": "none"}, {"name": "arthur henderson arthur henderson", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "beveridge", "sentiment": "none"}, {"name": "castlereagh", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "freeman", "sentiment": "none"}, {"name": "thomas burt", "sentiment": "none"}, {"name": "robert stephenson", "sentiment": "none"}, {"name": "bessie surtees", "sentiment": "none"}, {"name": "glenamara", "sentiment": "none"}, {"name": "ellen wilkinson ellen wilkinson  best", "sentiment": "none"}, {"name": "grey charles grey", "sentiment": "none"}, {"name": "henderson", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "peterloo fields", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "peterloo", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "quayside", "sentiment": "none"}, {"name": "thockrington", "sentiment": "none"}, {"name": "eldon square", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "invalid email  britain", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "jesmond cemetery", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "tyne bridge  thirty", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "welfare state", "sentiment": "none"}, {"name": "grey street", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "murton row", "sentiment": "none"}, {"name": "warcop", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "independent labour party", "sentiment": "none"}, {"name": "world disarmament conference", "sentiment": "none"}, {"name": "board of trade", "sentiment": "none"}, {"name": "liberal", "sentiment": "none"}, {"name": "liberal party", "sentiment": "none"}, {"name": "st aidan’s church", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "barnard castle division", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "national health service", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "radical labour", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The North East's greatest MPs Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBritain’s greatest electoral reformer, the architect of the Welfare State, a Nobel prize winner and first ever Labour cabinet minister, all were North East MPs. \nIn the run up to the 2017 election we’ve taken a look back at some of the men, and women, to have represented the region over a 200-year period. \nIn recent years we’ve had a Prime Minister but stretching back to Charles Grey the North East has a track record of producing era-defining politicians. \nHere are some of the most famous. Lord Grey Charles Grey, 2nd Earl Grey, by Henry Hetherington Emmerson (Photo: Newcastle Journal) \nA Whig politician, Charles Grey, oversaw radical political reform that had enormous impact on the development of democracy in Britain. \nLord Grey’s most remarkable achievement was the Reform Act of 1832, which set in train a gradual process of electoral change, sowing the seeds of the system we recognise today. \nAround 130 years of parliamentary reform began with this act and culminated in universal suffrage for men and women over 18, secret ballots and legitimate constituencies. \nGrey’s Monument was built in Newcastle in 1838 to honour his political achievements. Grey's Monument on Grey Street, Newcastle Lord Beveridge Lord Beveridge \nResponsible for the Beveridge Report, published in 1942, which formed the basis of the Welfare State. \nIn it William Beveridge, a Liberal economist who briefly represented Berwick as an MP, identified five “Giant Evils” in society: squalor, ignorance, want, idleness, and disease, and went on to propose widespread reform to the system of social welfare to address these. \nThe report came in the midst of war, and promised a reward for the sacrifices undertaken by everyone. \nIt included the expansion of National Insurance and the creation of the National Health Service. \nIn 1946, Beveridge was made a peer and became leader of the Liberals in the House of Lords. He died on 16 March 1963 and is buried alongside his wife in St Aidan’s Church, Thockrington, Northumberland . Thomas Burt \nA British trade unionist and one of the first working-class Members of Parliament. \nHe was born in the colliery village of Murton Row in Northumberland in November, 1837. \nLike his father he became a miner, and active trade unionist and a Primitive Methodist. In the 1874 General Election, Burt stood as the Radical Labour candidate for Morpeth and was elected. After the 1892 General Election, William Gladstone appointed Burt as Parliamentary Secretary to the Board of Trade, a post he held for three years. Burt remained loyal to the Liberal Party and refused to join the Independent Labour Party when it was formed in 1893. He died in 1922 and was buried at the Jesmond Cemetery near his Newcastle home. Arthur Henderson Arthur Henderson \nHe was the first Labour cabinet minister, won the Nobel Peace Prize in 1934 and, uniquely, served three separate terms as Leader of the Labour Party in three different decades. \nBorn in Glasgow, he moved to Newcastle aged 10 after the death of his father with the rest of his family. \nHe was an iron moulder at Robert Stephenson’s locomotive works and foundry in Newcastle, became a union activist and served as a Liberal councillor before in 1903 he went to the House of Commons as a Labour Party member from Barnard Castle Division, Durham. \nWhen Labour held power for the first time (January–November 1924), Henderson served as home secretary under Ramsay MacDonald. \nLater as foreign secretary in MacDonald’s second Labour ministry, he strongly supported the League of Nations, and in May 1931 he was chosen to head the World Disarmament Conference, which was to meet in Geneva intermittently from February 1932. His work on disarmament led to him receiving the Nobel Prize. Ellen Wilkinson Ellen Wilkinson \nBest remembered as ‘Red Ellen’ and for her role in the 1936 Jarrow Crusade, the 300 mile march of around 2000 unemployed workers from the South Tyneside town she represented to petition the government for help. \nHowever she was also involved in a series of campaigns, from the quest for official recognition of the Spanish Republican government, to the fight for Indian independence, to the effort to smuggle Jewish refugees out of Germany. \nShe served as Minister of Education from July 1945 until her death in 1947. \nJS*118990714 Former Prime Minister Tony Blair \nOne of the most controversial politicians of modern times. \nBlair moved with his family to Durham when he was aged five and later aged 30 became MP for Sedgefield in 1983. \nHe led ‘New’ Labour to three general election victories in 1997, 2001 and 2005 and despite many triumphs - Blair’s government introduced the National Minimum Wage Act, Human Rights Act, the Freedom of Information Act as well as securing the Good Friday Agreement - he is perhaps now best remembered for the dubious way Britain entered the Iraq war. \nHe is proving equally divisive today as, firmly pro-European, he has become an outspoken critic both of Brexit and current Labour leader Jeremy Corbyn. Lord Eldon \nHe was born John Scott, son of a humble coal dealer in Love Lane on Newcastle’s Quayside in 1751. \nHis name lives on today in Eldon Square, while in his lifetime he featured in one of Tyneside’s great romantic stories then later became infamous for his part in the Peterloo massacre of 1819. \nHe famously eloped in 1772 with Bessie Surtees, the daughter of an eminent banker, which set him on the road to becoming the Lord Chancellor of England. \nBessie Surtees house, from which she jumped into his arms,is now a listed building run by English Heritage just off the Quayside by the Tyne Bridge \nThirty years later Scott had become Lord Eldon. As the country’s foremost law officer it was his job to quell unrest in the UK at a time when revolution was taking place across the channel in France. \nAt a peaceful meeting at Peterloo Fields in 1819 to urge social reform and universal suffrage to replace the corrupt and repressive electoral system of the time, yeomanry cavalry, armed with sabres, rode down a crowd of several thousand men, women and children, leaving 11 people dead and more than 347 injured, though many estimates put the figure much higher. \nThe people held the Prime Minister, Lord Castlereagh, and his Cabinet, including Lord Eldon, to blame. \nEldon’s tears were immortalised in a poem by Shelley, written in 1819 to mark the Manchester massacre, called The Mask of Anarchy. Lord Glenamara Lord Glenamara \nBorn Edward Watson Short in 1912, the son of a draper in the village of Warcop in Cumbria. \nHe served as MP for Newcastle Central from 1951 to 1976. During the course of his political career, he was leader of the House of Commons, government chief whip - at a time when the Labour majority was down to just one - postmaster general, and secretary of state for education and science. \nAfter holding his seat for 24 years, he moved to the Lords to complete an unbroken stint at Westminster of more than 60 years. \nIn 2001, he was made a Freeman of the City of Newcastle “in recognition of his eminent and outstanding public service”. Read More ", "external_links": [], "published": "2017-05-09T15:00:00.000+03:00", "crawled": "2017-05-09T10:24:23.000+03:00", "highlightTitle": ""}