{"organizations": [], "uuid": "061cffb7eb4c21951ec072413ff2865824b70c5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30349345/16014076.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/battling-ben-bradshaw-vows-i-will-never-desert-labour-or-stand-as-independent/story-30349345-detail/story.html", "country": "US", "title": "Battling Ben Bradshaw vows 'I will never desert Labour or stand as Independent' - Long read | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2017-05-26T01:19:00.000+03:00", "replies_count": 0, "uuid": "061cffb7eb4c21951ec072413ff2865824b70c5a"}, "author": "", "url": "http://www.devonlive.com/battling-ben-bradshaw-vows-i-will-never-desert-labour-or-stand-as-independent/story-30349345-detail/story.html", "ord_in_thread": 0, "title": "Battling Ben Bradshaw vows 'I will never desert Labour or stand as Independent' - Long read | Devon Live", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "goodwin", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "carlisle", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "clifton hill", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "wembley", "sentiment": "none"}, {"name": "belmont park", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexiteer conservative", "sentiment": "none"}, {"name": "met office", "sentiment": "none"}, {"name": "exeter college", "sentiment": "none"}, {"name": "labour government", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "exeter labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Battling Ben Bradshaw vows 'I will never desert Labour or stand as Independent' - Long read By WMN_PGoodwin | Posted: May 25, 2017 2 COMMENTS SHARES Mr Bradshaw is relishing the general election campaign Battling Ben Bradshaw vows 'I will never desert Labour or stand as Independent'... X \nCopy link to paste in your message / Comments (2) \nBen Bradshaw insists he is enjoying the political fight of his life as he bids to hold onto the Exeter seat he has made his own since the Labour landslide of 1997. \nThe 56-year-old, the only opposition MP in the South West, is campaigning hard to hold onto a constituency he affectionally calls \"our little red dot\" in a sea of Tory blue. \nSpeaking from his constituency office in Clifton Hill, overlooking Belmont Park, on the morning after the terror attack in Manchester put campaigning on hold, he said this was the toughest election he has ever faced but insisted he was relishing the battle as much as any of his previous five. \nThe keen cyclist has also been putting in the hard yards – clocking up more than 12 miles every day on his pedometer. \n\"We have done more work in this campaign at this stage than any other including 1997,\" he said. \n\"We have spoken to 16,000 people– it is a phenomenal achievement and we are getting a positive response. \nHe says he has now got over the \"initial irritation at Mrs May's announcement of an unnecessary election\" and is at full pace. \n\"I have got into my stride and I absolutely love it,\" he added. \n\"It is what politics is all about. Having those one-to-one conversations is the most valuable thing you can do as elected representative. \n\"I have an extraordinary band local volunteers who have been out in greater numbers in this election than since 1997 – we had 50 people out on Saturday and 20 out on Sunday and we are out from 11am until 8pm.\" \nMr Bradshaw, who is at odds with the party leadership, has faced criticism for his lack of enthusiasm for the manifesto and has been criticised by his Tory opponent for adopting a \"bizarre\" independent stance. \nLocal Tories regard the collapse of UKIP and Labour divisions as an opportunity to exploit, believing that that those members unhappy with Corbyn will not vote. \nMr Bradshaw says local fears over cuts to education and public services and concerns over a hard Brexit are focussing minds in the city away from political divisions. \n\"Some people say they have a problem with current Labour leadership but I am finding that people, whatever their misgivings, say they will vote and want to keep me not least because they understand it's important to maintain some opposition,\" he added. \nThe 'crazy' Exeter estate where Labour voters can't support Ben Bradshaw \n\"If the Tories do take Exeter – which they might – we will have a one-party state in the South West and the Government will be able to do whatever they like with absolutely no challenge no scrutiny, no checks and balances and that is extremely bad for our public services and our democracy. \n\"People also understand there will be no one left to hold the Government's feet to the fire on Brexit. \n\"Exeter exports 70 per cent of what we export to the EU, higher than anywhere else in the country. It's vital that our exporters enjoy full, tariff-free access to the single market and access without other non-tariff barriers – that's something I will fight for. It is not something a hard Brexiteer Conservative will fight for.\" \nAsked about if he would leave Labour and fight on an independent ticket, he rejects the idea \"absolutely\", though he reserves judgement on the future of the Labour party until after the election. \n\"I am Labour through and through have been in the party almost all my adult life and am extremely proud of what Labour has delivered in local government and 13 years in power – five brand new high schools, new primary schools an FE college – Exeter College – that used to be middling and is now one of the best performing in the country, a world-class university, the relocation of the Met Office, one of the first new medical schools in Britain... these are all things the Labour Government and I helped to deliver for Exeter. \n\"This is my party as much as anybody else's party – I will never, ever join any other party and would certainly never run as an independent. \n\"However, I do accept that I have a reputation as independent-minded MP – I have shown by my actions that I am prepared to vote against my party when the interests of Exeter or the South West is at stake or if I think my party is wrong. \n\"I did so over Article 50 and I did so over HS2. \n\"I have never said Labour can't win I have simply pointed out the polls suggest a huge Conservative lead. \n\"I am fighting for every vote I can to keep this little red dot in the sea of blue. We are giving out a leaflet showing this and it is going down extremely well. They are very proud of this and want to keep it. \n\"I will happily talk about the future of the party on June 9 if I am still here.\" \nAsked about Jeremy Corbyn's performance so far, he offers some praise for the leader's common touch. \nHe believes the Tory U-turn over the so-called dementia tax could have a bigger effect but points out the Tory lead remains unassailable. \n\"There has been a narrowing in some polls because of the disastrous Conservative manifesto including this cruel and callous dementia tax,\" he added. \n\"There must be a cap and a threshold but critically there must be a pooling of risk – this is something I and the Labour party support. \n\"To penalise those who have worked hard all their lives, bought a homes and got savings in this way is absolutely extraordinary. It shows the promises in the Tory manifesto are not worth the paper they are written on. \n\"There is another thing which has been missed – they are planning to cut the Winter Fuel payment of 18,000 pensioners in Exeter and scrap the so-called triple lock to protect the value of the state pension. It is a triple whammy aimed at our elderly who are unable to protect ourselves. \n\"This has helped our campaign a bit and I think Jeremy is in his element out on the stump, performing, meeting real people whereas Theresa May has been hidden away, protected from any scrutiny and public gaze for her and when she has been confronted by members of the public it has been an absolute car crash. \n\"Theresa May was clearly rattled when she was confronted over this policy. And this is just the latest in a number of huge U-turns, such as the one over National Insurance in the budget. \n\"Policies are being developed within a very small and secretive cabal of people around Mrs May which are ill-thought through and unravel at first exposure. It doesn't instil confidence. \n\"The Conservatives have had a dreadful campaign and it is the first time in history that a political party has done such a U-turn on a manifesto commitment within days and before the election but that doesn't change the fact that overall there is a huge amount of ground to be made up. \n\"People are recognising those two different types of campaigning. But look, the poll of polls still gives the Conservatives an unprecedented 17 per cent lead – that is the simple fact. \nAn enforced break in canvassing agreed by all parties in the wake of the terror attack has given Mr Bradshaw time to catch up with emails and paperwork at the city HQ. \nHe had been planning to door-knock right through Exeter's big sporting weekend after being ordered to stay put by his campaign manager. \nBut depending on how long political hostilities are put on hold, he may yet find himself on the terraces at Wembley or Twickenham. \n\"My agent is a season ticket holder who is not going because of the election,\" he explained. \n\"She wants me to stay down here campaigning but wants me to take some time off to watch the match down here in a local pub with other Exonians who are not able to make the trip. \n\"We went to the club to watch the first play-off against Carlisle. I don't know if they are laying that one again but if not we will go to a local pub. There's a big contingent from Exeter Labour going up in my place but if campaigning is still suspended that might change. \n\"I was thrilled by the result. It was worse for my nerves than the count on general election night but what an amazing atmosphere when we scored that thirds goal and the rugby similarly. I wish both teams the best of luck.\" ", "external_links": [], "published": "2017-05-26T01:19:00.000+03:00", "crawled": "2017-05-25T19:47:48.000+03:00", "highlightTitle": ""}