{"organizations": [], "uuid": "4d7fc12917a13722239b034d0d66fec02ba30c32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30362251/16023472.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/farmers-face-critical-time-as-election-nears-somerset-leaders-warn/story-30362251-detail/story.html", "country": "GB", "title": "AthwennaIrons published Farmers face 'critical time' as election nears, Somerset leaders...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-30T23:42:00.000+03:00", "replies_count": 0, "uuid": "4d7fc12917a13722239b034d0d66fec02ba30c32"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/farmers-face-critical-time-as-election-nears-somerset-leaders-warn/story-30362251-detail/story.html", "ord_in_thread": 0, "title": "AthwennaIrons published Farmers face 'critical time' as election nears, Somerset leaders...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Farmers face 'critical time' as election nears, Somerset leaders warn By AthwennaIrons | Posted: May 30, 2017 0 COMMENTS SHARES Many farming sectors are under a great deal of pressure as the general election nears, industry leaders in Somerset are warning Farmers face 'critical time' as election nears, Somerset leaders warn   Many farming sectors are under a great deal of pressure as the general election nears, industry leaders in Somerset are... Comments (0) \nSomerset farmers are being urged to 'get the message out' to their parliamentary candidates about the opportunities and challenges facing the industry ahead of next week's general election. \nSpeaking on the eve of this year's Bath & West Show - which opens tomorrow (Wednesday) at the Shepton Mallet showground - James Miller, the National Farmers' Union's (NFU) Somerset county chairman, said it was a 'critical time' for farming, with many sectors under a great deal of pressure. \n\"Dairying continues to be challenged in just about every way conceivable, in particular by recent reductions in milk prices and hikes in most key costs, like feed and fertiliser. \n\"As someone who has significant involvement with dairy farmers across the South West, I get to see first-hand the pressure they remain under, working incredible hours and maintaining the highest standards possible, often under huge financial pressure,\" said Mr Miller, a former dairy farmer himself. \nWith an election campaign in progress and Brexit on the horizon there is sure to be discussion at the show about who will form the new Government and what its attitude towards agriculture is likely to be. The industry is directly worth about £200m to the economy of Somerset and employs just over 12,000 people, with the financial benefits rippling out along the supply chain to include food processors, allied trades like vets and feed suppliers – a recent NFU report found that for every £1 invested in farming, £7.40 is returned to the rural economy. \nIn its election manifesto, the NFU is calling for the new Government to develop an export strategy which would open new markets and give British dairy farmers the chance to sell their produce globally, a move which could substantially lower the current trade deficit in dairy products, currently running at about £1bn. \nREAD NEXT: Final call for dairy farmers to apply for share of funding \nMr Miller believes that the government could also do more to promote the UK's dairy products, which are some of the most recognisable food brands in the world, and – once Britain is free of the burden of current EU state aid rules – should change sourcing and procurement rules so more British produce is used in schools, hospitals and prisons. \nIn addition, the NFU wants to see mandatory price reporting in the dairy sector. They say this would provide farmers with reliable and timely market information which is not currently available, allowing them to better manage their businesses. \n\"All farming sectors will be affected by the trade deals which will be struck in the wake of Brexit. Europe is a key export market for British farmers, with 38% of the country's lamb being sold there,\" said Mr Miller. \n\"So it is vital that trade agreements provide fair and level access to markets, protect the integrity of British food production and give farmers access to sufficient numbers of seasonal and permanent workers from outside the UK – in the horticulture sector alone, 80,000 workers will be needed to plant, pick and pack fruits and vegetables.\"He continued: \"Adjusting to world trade conditions is not straightforward as we have a higher-cost farming economy, partly as a result of very high welfare standards but also because of the high cost of land, the regulatory burden and labour costs. \n\"Lamb is a key sector for Somerset, and one that is highly vulnerable to changes in trading conditions and may see the most impact from Brexit. To this end it needs the maximum amount of domestic support. \"Now is a critical time for farming to get our message across to all Parliamentary candidates and I would urge members to find out if your prospective MP is going to support farming, food and the wider rural economy.\" READ NEXT:", "external_links": [], "published": "2017-05-30T23:42:00.000+03:00", "crawled": "2017-05-30T19:28:42.000+03:00", "highlightTitle": ""}