{"organizations": [], "uuid": "f79d2b1d5b53fdff8f2f78727215f9e4c69b0d78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12982241.ece/ALTERNATES/s1200/TMP_NEC_110614EldonSquare_03JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/metrocentre-eldon-square-welcome-top-12982208", "country": "GB", "domain_rank": 21960, "title": "Metrocentre and Eldon Square welcome top international names amid tough times in retail", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Metrocentre and Eldon Square welcome top international names amid tough times in retail", "spam_score": 0.0, "site_type": "news", "published": "2017-05-04T01:00:00.000+03:00", "replies_count": 0, "uuid": "f79d2b1d5b53fdff8f2f78727215f9e4c69b0d78"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/metrocentre-eldon-square-welcome-top-12982208", "ord_in_thread": 0, "title": "Metrocentre and Eldon Square welcome top international names amid tough times in retail", "locations": [], "entities": {"persons": [{"name": "van mildert", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "milton keynes", "sentiment": "none"}, {"name": "david fischel", "sentiment": "none"}], "locations": [{"name": "eldon square", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "merry hill", "sentiment": "none"}, {"name": "intu trafford centre", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "intu eldon square", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "intu metrocentre", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "sharps bedrooms", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "intu properties", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Metrocentre and Eldon Square welcome top international names amid tough times in retail Intu Properties said brands are being selective about expansion plans but are choosing its centres to open new stores Share Entrance to Eldon Square from Northumberland Street (Photo: newcastle chronicle) Share Get business   Thank you for subscribing!   \nMetrocentre and Eldon Square owner Intu Properties is weathering tough times in retail, having already attracted a raft of top international names this year. \nUncertainty surrounding Brexit and the rise of online shopping is serving up a challenging market for the high street, with several national firms already warning of difficult times ahead. \nIntu Properties, however, which owns intu Eldon Square in Newcastle and Gateshead’s intu Metrocentre among 17 centres in the UK and Spain, has released a trading update in which it says demand from tenants remains high, despite the fact that many retailers are being selective about their expansion plans. \nOccupancy is 95.8%, marginally reduced from 96.0% at 31 December 2016 reflecting seasonal fluctuations since Christmas, but year-on-year footfall in the period, from January 1 to May 3 2017, is unchanged and is continuing to outperform the UK ShopperTrak benchmark, which is down by 2.5%. Inside intu Metrocentre in Gateshead (Photo: handout from Sorted PR) \nDirectors said aspirational brands are continuing to recognise the attraction of destination shopping centres, with Hugo Boss and Guess joining the line up at intu Metrocentre, Tesla at intu Milton Keynes and Tag Heuer opening its first store in the West Midlands at intu Merry Hill. \nTraditional retail park tenants are also introducing smaller format stores in high footfall locations, including Sharps Bedrooms which now has a unit at intu Eldon Square. \nRestaurant chains which have previously focused on London and the south east are looking to expand in the regions, such as Leon which is opening its first store in the north west at intu Trafford Centre. Read More Van Mildert in Newcastle set to grow after receiving multi-million pound investment \nDavid Fischel, intu chief executive, said: “Although retailers are being selective with their expansion plans, they are prioritising expansion to prime established locations with strong footfall. intu as the UK market leader with 17 prime centres is well positioned to take advantage of this demand. \n“The environment for business this year is likely to be challenging with considerable uncertainty regarding the UK’s EU exit. However, it is our intention to deliver continuing growth in like-for-like net rental income.” Like us on Facebook", "external_links": [], "published": "2017-05-04T01:00:00.000+03:00", "crawled": "2017-05-03T20:30:12.000+03:00", "highlightTitle": ""}