{"organizations": [], "uuid": "7b7f109757a425779c85cb7863ca89c88bebf03c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12982863.ece/ALTERNATES/s1200/Theresa-May-Campaigns-In-Constituencies-In-The-South-West.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-speech-north-tyneside-13024041", "country": "GB", "domain_rank": 21960, "title": "Theresa May in the North East LIVE: Updates from the PM's speech as Labour say 'voters won't be fooled'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-12T18:00:00.000+03:00", "replies_count": 0, "uuid": "7b7f109757a425779c85cb7863ca89c88bebf03c"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-speech-north-tyneside-13024041", "ord_in_thread": 0, "title": "Theresa May in the North East LIVE: Updates from the PM's speech as Labour say 'voters won't be fooled'", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "tom eden corbyn", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tom eden jeremy corbyn", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jo swinson", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "tom eden theresa may", "sentiment": "none"}, {"name": "miller", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "norman lamb", "sentiment": "none"}, {"name": "gina miller", "sentiment": "none"}, {"name": "gareth fuller/pa wire", "sentiment": "none"}, {"name": "tom eden lib dems", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "maidenhead", "sentiment": "none"}, {"name": "minsk", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "chatham house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "trump white house", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "lib dems", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "chatham house", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May's speech in Northumberland \nTheresa May has just made her “strong and stable” stump speech in Felton, Northumberland. \nThe Tory leader, delivering a speech in front of a bus with ‘Theresa May for Britain’ plastered on the side, said: \n“This election is not about who people might have voted for before, it is about who they want to see leading this country over the next five years.” \nShe didn’t answer any questions. 13:29 Tom Eden Ukip MEP comments \nThe Ukip MEP Jonathan Arnott has tweeted his thoughts about the speech May is giving now: 13:26 Theresa May in Northumberland \nTheresa May has landed in Northumberland: \nShe will be giving another speech at a community centre later, that we will be at. 13:19 Tory activists waiting for May \nHere’s a gaggle of Conservative Party activists waiting for the arrival of Theresa May: 13:02 KEY EVENT Theresa May's visit — latest \nTheresa May is due to arrive in the North East, at an as-yet-mystery location at about 3pm. \nOur reporter Mike Kelly will be at the speech, but other than an estimated time of arrival and a few trailed lines, we know very little about her visit at this stage. \nYou can read what May is expected to say here. \nWill Mike face the same situation at the Cornwall Live journalists who were essentially locked in a cupboard while she delivered a speech? \nThe county’s biggest news website was banned from filming the prime minister’s visit to a factory the marginal seat of St Ives in Cornwall: \nReporters from Cornwall Live complained that they were shut in a room to enforce the video ban while the prime minister was visiting a diving equipment factory in Helston. Brexit Tom Eden Brexit Secretary claims Jean-Claude Juncker is trying to get him sacked \nA senior Cabinet minister has claimed Brussels’ top official is trying to get him sacked in the latest sign of the Tory conflict with the European Commission. \nBrexit Secretary David Davis claimed European Commission president Jean-Claude Juncker was trying to force him out of his job. \nTheresa May has claimed Brussels figures are trying to influence the outcome of the June 8 General Election and has made the need for a bigger majority to strengthen her position in forthcoming Brexit talks a key part of her pitch to voters. \nLeaks about a difficult meeting between Mrs May and Mr Juncker at Downing Street appeared designed to undermine the Prime Minister and suggested that Mr Davis’s future could be in doubt. \nMr Juncker admitted earlier this week the leaking of accounts of his dinner in No 10 to discuss Brexit with the PM had been a “serious mistake”, although he denied responsibility for the move. \nMr Davis told the Daily Telegraph: \n“I think to be honest he has now learned his lesson - he is not going to be meddling in British politics any more or at least if he does he will get the same reaction.” 12:17 Tom Eden Corbyn pledges more funding for diplomacy \n“Labour’s support for the renewal of Trident... doesn’t preclude” working towards nuclear disarmament, Jeremy Corbyn says. \nAnd he says “for all their bluster” the Tories have left the morale of the armed forces at rock bottom. \n“We will work to halt the drift toward confrontation with Russia,” he says. \nAnd Labour will “seek to diffuse the crisis in Ukraine” by implementing the Minsk agreements. \n“Our armed forces will have the necessary capabilities to fulfil the full range of obligations. \n“Security is not only about direct military defence. \n“It’s about conflict resolution... underpinned by strong diplomacy”. \nHe says Labour would “rebuild” non-military services like human rights advisors in embassies and would give more resources to diplomacy. 12:15 May building a 'coalition of risk and insecurity with Donald Trump' \nJeremy Corbyn is still speaking about defence and national security. \nHere’s a new line of attack towards Theresa May: 12:13 Tom Eden Theresa May's competition \nA candidate standing against Theresa May in here Berkshire constituency of Maidenhead has had this fantastic exchange with a BuzzFeed journalist: \n(Click through the pictures) KEY EVENT 'No more hand holding with Donald Trump' \nIn his Chatham House speech, Jeremy Corbyn has accused Donald Trump of making the world a more dangerous place, referencing his rhetoric on North Korea. (Photo: AP) \nHe also accused Theresa May of “pandering” towards Trump and claims this is not the sign of strong leadership. \nCorbyn said: \n“Waiting to see which way the wind blows in Washington isn’t strong leadership. And pandering to an erratic Trump administration will not deliver stability. \n“Britain deserves better than simply outsourcing our country’s security and prosperity to the whims of the Trump White House. \nSo no more hand-holding with Donald Trump – a Labour government will conduct a robust and independent foreign policy made in London. Lib Dems Tom Eden More on the cannabis pledge \nFurther to that last post, the Press Association have just filed the full story about the Lib Dems plans to legalise cannabis: Jo Swinson \nPlans to legalise cannabis so it can be taxed and sold on the high street will be brought forward if the Liberal Democrats gain power. \nThe party will commit to creating a legal market for the production and sale of the substance in its manifesto, it confirmed, making it one of the first political parties to fight an election on a ticket of relaxing drug laws. \nCannabis would only be sold to people over 18 and sales would be strictly regulated under the new proposals, which could generate up to £1 billion per year in tax revenues, the party predicts. \nThe Lib Dems have long campaigned to legalise the drug, with former health minister Norman Lamb attempting to bring in a Bill last year to tackle what he called “a catastrophic failure” of the war on drugs. \nAnother manifesto commitment would offer fathers an extra month of paid parental leave, to encourage greater sharing of parental responsibilities. \nFormer minister Jo Swinson said: “Parents across the UK have already benefitted from greater flexibility and freedom in how they share the care for their new baby. \n“But more needs to be done in order to encourage men to take leave when they become a dad, to bond with their child during the early weeks and months of their life.” 11:56 Tom Eden Lib Dems would legalise cannabis \nThe Liberal Democrats will pledge to legalise cannabis in what it calls “one of the most radical drugs policy manifesto commitments ever made by a British political party”. \nTim Farron’s party would allow cannabis to be sold from high street shops, and spend the tax raised from sales on public health efforts, according to BuzzFeed. (Photo: Gareth Fuller/PA Wire)", "external_links": [], "published": "2017-05-12T18:00:00.000+03:00", "crawled": "2017-05-12T14:28:25.000+03:00", "highlightTitle": ""}