{"organizations": [], "uuid": "c5e5180f0178c3d319993d3de9db917d8abe5495", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12979099.ece/ALTERNATES/s1200/CFR_NJL_030517rose_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/more-120-jobs-lost-north-12979089", "country": "GB", "domain_rank": 21960, "title": "More than 120 jobs lost at North Shields furniture maker Hobart Rose", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "More than 120 jobs lost at North Shields furniture maker Hobart Rose", "spam_score": 0.0, "site_type": "news", "published": "2017-05-03T18:34:00.000+03:00", "replies_count": 0, "uuid": "c5e5180f0178c3d319993d3de9db917d8abe5495"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/more-120-jobs-lost-north-12979089", "ord_in_thread": 0, "title": "More than 120 jobs lost at North Shields furniture maker Hobart Rose", "locations": [], "entities": {"persons": [{"name": "cameron ross", "sentiment": "none"}, {"name": "dunelm", "sentiment": "none"}, {"name": "martin robinson", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "david rose", "sentiment": "none"}, {"name": "zytronic", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "moscow metro", "sentiment": "none"}], "organizations": [{"name": "hobart rose business more", "sentiment": "negative"}, {"name": "hobart rose directors", "sentiment": "negative"}, {"name": "north shields", "sentiment": "negative"}, {"name": "tait walker", "sentiment": "none"}, {"name": "business growth service", "sentiment": "none"}, {"name": "fuda hobart rose ltd", "sentiment": "none"}, {"name": "hobart rose", "sentiment": "none"}, {"name": "fuda international trading company", "sentiment": "none"}, {"name": "manufacturing advisory service", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "sage group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business More than 120 jobs lost at North Shields furniture maker Hobart Rose Directors at the firm, which makes furniture for the likes of Next, were forced to close the doors after losing a major contract Share From left: Martin Robinson, David Rose (both Fuda Hobart Rose Ltd) and Cameron Ross (MAS) back in 2015 when the firm was tapping into funding to bring work back to the North East (Photo: tark archive)   \nMore than 120 jobs have been lost at a North East furniture maker after the firm lost a major client. \nFuda International Trading Company, which traded as Hobart Rose, produced furniture and soft furnishings for the likes of Dunelm, John Lewis and Next from its North Shields base. It also ran a popular factory outlet shop. \nHowever, the long-established family firm has ceased to trade with the loss of the entire 122-strong workforce after running into financial issues following the loss of a major contract. \nA statement issued on behalf of the firm told how the directors were unable to come to repayment agreements with creditors and unfortunately had no option other than to close the doors. \nThe company’s affairs are now being dealt with by accountancy firm Tait Walker. \nEstablished around 58 years ago, Hobart Rose used to run an operation in China with two other local partners, which employed 150 people, but recent years had seen the firm make efforts to reshore jobs. \nOnly two years ago it was announced that the furniture manufacturer had managed to reshore around 20% of its manufacturing back from China and that it expected to create 100 jobs in the process. Read More Tech titan Sage Group's profits leap 41% as subscriber numbers rise \nThe North Shields-based firm used funding from the Manufacturing Advisory Service (MAS) to make the move and it also received around £285,000 investment from The Journal’s Let’s Grow fund to help to equip the firm, along with support from the Business Growth Service. \nThe firm’s last accounts, for the year ended April 30 2016, showed that moves to “home-shore” was going as planned, but that trading conditions remained tough throughout the last year, Brexit was challenging margins and there was a significant reduction in sales in the run-up to the crucial Christmas trading period. \nIn a review of the business, filed at companies house on January 27 2017, directors described how a reorganisation at its main customer led to a drop in sales, which slipped from £8.4m to £7.15m. The previous year’s operating profit of £63,432 also dropped to a loss of £127,061. \nDespite an extensive sales effort and a cost cutting programme implemented over several months, directors found it was not possible to trade out of the losses. Read More Gateshead tech firm Zytronic wins deal to work on the Moscow Metro \nAgreements were not able to be made with creditors regarding repayment schedules and, despite the best efforts of the directors, additional funding could not be secured, leaving them with no alternative other than to release the workforce following the payment of April’s salary. \nThe directors said they are now focussed on working with customers and suppliers alike to identify an appropriate route forward. Like us on Facebook", "external_links": [], "published": "2017-05-03T18:34:00.000+03:00", "crawled": "2017-05-03T14:04:14.000+03:00", "highlightTitle": ""}