{"organizations": [], "uuid": "3f9b6cb4621ee88e2291fea797c7477a62374d13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13056745.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-aims-manifesto-labour-ukip-13056733", "country": "GB", "domain_rank": 21960, "title": "Theresa May aims manifesto at Labour and UKIP voters in the North", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-19T15:00:00.000+03:00", "replies_count": 0, "uuid": "3f9b6cb4621ee88e2291fea797c7477a62374d13"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-aims-manifesto-labour-ukip-13056733", "ord_in_thread": 0, "title": "Theresa May aims manifesto at Labour and UKIP voters in the North", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "west yorkshire", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "halifax", "sentiment": "none"}], "organizations": [{"name": "north news theresa", "sentiment": "negative"}, {"name": "north conservative", "sentiment": "negative"}, {"name": "ukip", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May aims manifesto at Labour and UKIP voters in the North Conservative leader sets out plans to boost schools and hospitals, but social care will cost more for many elderly people Share Conservative party leader Theresa May (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May has launched a manifesto designed to appeal to wavering Labour and UKIP voters with cash for schools and hospitals and a delay to deficit reduction plans. \nBut there was also an end to some middle class benefits, while some elderly people will have to pay far more for social care provided at home. \nMrs May launched the 84-page manifesto, titled Forward Together, in Halifax, West Yorkshire, symbolising her desire to reach out to Labour and UKIP voters in the North and Midlands. \nThe Tory plan for Britain includes measures to take on big businesses such as energy firms and phone companies that fail to give a fair deal to consumers. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nBut it also takes some perks away from middle class voters who might be seen as typical Conservative supporters. \nPrimary school pupils from wealthier families would lose the right to free school meals, and the winter fuel allowance of up to £300 will be taken away from all but the poorest pensioners. \nThere will also be an increase in the contribution many elderly people are expected to make to the cost of social care in their home, with the value of their property now being taken into account when authorities determine whether they can afford to pay. \nAnd the manifesto ditches a previous Tory commitment not to raise income tax or national insurance. \nNew fiscal rules will be introduced to clear the deficit by 2025, three years later than previously planned, giving the government more flexibility over public spending. \nThe manifesto promises £8 billion extra for the NHS, and £4 billion for schools by 2022. Guy Opperman MP at the Northern Farming Conference in Hexham (Photo: Newcastle Journal) \nAnd it includes a commitment to build a “Northern Powerhouse rail” line, expected to link Liverpool, Manchester, Leeds, Hull, Sheffield and Newcastle. \nGuy Opperman, Conservative candidate in Hexham, Northumberland, said: “I am delighted with the May Manifesto that sees a focus on securing a successful Brexit, and greater funding for our NHS and schools. \n“We face a real test in the years ahead and I have no doubt that Theresa May is the leader we need to grow our economy and make a success of Brexit. The alternative of Jeremy Corbyn and a divided Labour Party unsure of what it wants to do about Europe, and in hock to the unions, is not a real choice for the British people.” Read More \nBut Chi Onwurah, Labour candidate for Newcastle Central, said: “It is clear that Theresa May called this election not only to hide her increasingly apparent incompetence over Brexit but to get out of her 2015 manifesto commitments. \n“This manifesto will make pensioners poorer. There are no promises on tax other than VAT \n“And there is a lack of vision comes to an industrial strategy to ensure our north eastern economy can grow and prosper and deliver high wage, high skill jobs.” \nLaunching the manifesto in Halifax, Mrs May said: “It is the responsibility of leadership to be upfront and straight with people about the challenges ahead, about the difficult decisions and trade-offs that need to be made, and the hard work required to overcome the obstacles in our way. \n“That is what this Manifesto does.” Like us on Facebook", "external_links": [], "published": "2017-05-19T15:00:00.000+03:00", "crawled": "2017-05-19T10:21:20.000+03:00", "highlightTitle": ""}