{"organizations": [], "uuid": "5a5828a8c68a0ba72628189d1ccd643cb61dc0bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13017839.ece/ALTERNATES/s1200/corbmay.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/numbers-show-how-conservatives-set-13017834", "country": "GB", "domain_rank": 21960, "title": "The numbers which show how the Conservatives are set to eat into the Labour vote in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The numbers which show how the Conservatives are set to eat into the Labour vote in the North East", "spam_score": 0.0, "site_type": "news", "published": "2017-05-11T03:44:00.000+03:00", "replies_count": 0, "uuid": "5a5828a8c68a0ba72628189d1ccd643cb61dc0bf"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/numbers-show-how-conservatives-set-13017834", "ord_in_thread": 0, "title": "The numbers which show how the Conservatives are set to eat into the Labour vote in the North East", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}], "organizations": [{"name": "north east news", "sentiment": "neutral"}, {"name": "labour", "sentiment": "neutral"}, {"name": "general election", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The numbers which show how the Conservatives are set to eat into the Labour vote in the North East A survey has shown that significant numbers of people who backed Labour in 2015 intend to switch come the General Election on June 8 Share Click to play Tap to play The video will start in 8 Cancel Play now Theresa May on net migration target Share this video Get daily   Thank you for subscribing!   \nThe Tories are set to eat into Labour’s vote in its North East heartland , a new survey has revealed. \nThe data shows significant numbers of people who backed the party in the 2015 General Election intend to switch - with the Conservatives the main beneficiaries. \nAccording to the survey, 45% of respondents said they backed Labour in 2015 - but only 42% are intending to do so this time. \nMeanwhile, the Conservatives could be on course to increase their share of the North East vote. \nOnly 25% of respondents said they voted Tory in 2015, but 32% say they will do so on June 8. \nThe party currently holds Berwick and Hexham - both in Northumberland - and Stockton South. \nUKIP’s vote is set to fall, however. Some 12% said they backed the party in 2015 but only 8% intend to do so this time. \nBoth the Lib Dems and the Greens could see similar vote shares in the region as in 2015. \nIn addition, 6% of respondents said they planned to vote Lib Dem, and 7% for the Greens. \nA list of 150 ‘Tory target’ seats which the Conservatives could win with a 15% swing of voters or less features eight constituencies in our region, including Bishop Auckland and Tynemouth. \nJeremy Corbyn and his party seem to have their strongest support in the North East among the young. \nMore than half (56%) of people aged 18 to 24 said they intended to vote Labour, while 57% of those aged 65 and over said they planned to vote for the Conservatives. Read More Labour 88%, Conservatives 8%, the Lib Dems 4% - how red rules in the North East \nThe survey also reveals more than half of voters in the North East (52%) claim Brexit will NOT be a factor in how they vote next month. \nA majority of people in the region believe Theresa May would be a better Brexit negotiator than Mr Corbyn, with 50% of people in the region saying they think she’ll do the best job compared to 38% for the Labour leader. \nConfidence in Mrs May increases with age, with nearly three-quarters of those aged 65 and over (72%) thinking she would do the best job. \nThose aged under 35 in the region are more likely to back Jeremy Corbyn as the best negotiator, with 52% of those aged 25 to 34 and 50% of those aged 18 to 24 saying the Labour leader would be best. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-05-11T03:44:00.000+03:00", "crawled": "2017-05-10T23:27:56.000+03:00", "highlightTitle": ""}