{"organizations": [], "uuid": "550260ace82afcb5f1795e8347e0f5ba226312b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13010780.ece/ALTERNATES/s1200/The-27-Remaining-Members-Of-The-European-Union-Meet-To-Discuss-Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-firms-most-lose-13010716", "country": "GB", "domain_rank": 21960, "title": "North East firms have most to lose from Brexit, new report claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East firms have most to lose from Brexit, new report claims", "spam_score": 0.0, "site_type": "news", "published": "2017-05-10T07:01:00.000+03:00", "replies_count": 0, "uuid": "550260ace82afcb5f1795e8347e0f5ba226312b4"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-firms-most-lose-13010716", "ord_in_thread": 0, "title": "North East firms have most to lose from Brexit, new report claims", "locations": [], "entities": {"persons": [{"name": "martin mctague", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "kasai", "sentiment": "none"}], "organizations": [{"name": "fsb", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "bbb", "sentiment": "none"}, {"name": "british business bank", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu council", "sentiment": "none"}, {"name": "council of the european union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "metnor group", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East firms have most to lose from Brexit, new report claims FSB says North East SMEs are most likely to get finance from Europe and calls on the new Government to bridge the gap Share The red carpet is swept at the Council of the European Union ahead of an EU Council meeting (Photo: Getty Images Europe) Share Get business   Thank you for subscribing!   \nSmall firms in the North East are likely to be worst affected by any Brexit -related disruption to small business finance markets, a new report claims. \nThe report from the Federation of Small Businesses (FSB) says billions of pounds in EU funding dedicated to supporting small firms must be replaced to avoid the risk of an economic slowdown when the UK leaves the European Union . \nTake-up of finance from European schemes, including the European Regional Development Fund, is higher across the North East than any other part of England. Small firms in the North East have benefitted to the tune of £5,660 on average from such initiatives, compared to an average of £2,420 across the country. Read More Metnor Group boosts sales to £85m on the back of buoyant building scene \nIn addition, 69% of small business equity deals in the North East involve public investors, many of which are backed by EU funds. That figure is also higher than any other region of the UK. \nMartin McTague, FSB national policy director, who is based in County Durham , said: “EU investment in UK finance markets has served as a vital lifeline for small firms across the North East. \n“If the new Government is serious about developing an Industrial Strategy that supports growth across all regions, it must stand ready to expand the British Business Bank post-Brexit. Failure to do so will massively hamper the ability of small firms to invest and grow, threatening an economic slowdown across the region as a whole.” Read More Nissan supplier Kasai blames Brexit vote for plummeting profit line \nThe FSB’s Reformed Business Funding: What small firms want from Brexit report finds that small businesses across the North East are among the most likely to apply for EU-funded schemes, with the proportion of applicants across the region standing at 22%, higher than the average for the UK as a whole (15%). \nMore than two thirds (68%) of firms in the North East say that access to finance should be a priority for any EU funding replacement. \nThe FSB is calling on the new Government to prepare the British Business Bank to replicate the current role of EU funds in supporting small business finance markets following Brexit. Under its proposals, the BBB would receive extra resources to promote access to finance for small firms, helping to support regional economic growth across the UK. \nEU funds have backed several finance schemes across the North East, including the £159.5m North East Finance initiative and the £145m North East Fund. Like us on Facebook", "external_links": [], "published": "2017-05-10T07:01:00.000+03:00", "crawled": "2017-05-10T02:49:23.000+03:00", "highlightTitle": ""}