{"organizations": [], "uuid": "92bb8f5d46e5f36aa73477000496e5549efcdff9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13107017.ece/ALTERNATES/s1200/GWR_-NJL_290517sagey_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-companies-urged-see-13106873", "country": "GB", "domain_rank": 21960, "title": "North East companies urged to see value of culture to their businesses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-30T07:01:00.000+03:00", "replies_count": 0, "uuid": "92bb8f5d46e5f36aa73477000496e5549efcdff9"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-companies-urged-see-13106873", "ord_in_thread": 0, "title": "North East companies urged to see value of culture to their businesses", "locations": [], "entities": {"persons": [{"name": "abigail pogson", "sentiment": "none"}, {"name": "james ramsbotham", "sentiment": "none"}, {"name": "sage gateshead", "sentiment": "none"}, {"name": "sandra thompson  sage gateshead", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "north east england", "sentiment": "none"}, {"name": "neecc", "sentiment": "none"}, {"name": "uk city", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sage gateshead", "sentiment": "none"}], "organizations": [{"name": "newcastle technology company sage", "sentiment": "none"}, {"name": "commerce", "sentiment": "none"}, {"name": "creative industries federation", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east culture partnership", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastlegateshead cultural venues, arts council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East companies urged to see value of culture to their businesses North East England Chamber of Commerce and Sage Gateshead aim to make region best at linking culture and business Share James Ramsbotham, NEECC, and Abigail Pogson of Sage Gateshead at launch of joint project (Photo: Copyright unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA new partnership has been launched to promote the value of cultural organisations to the wider business community in the North East. \nSage Gateshead has joined the North East England Chamber of Commerce’s partner programme, which also includes a number of the region’s leading businesses as members. \nThe venue - itself sponsored by Newcastle technology company Sage - is now working with the Chamber on a project that aims to deepen engagement between the cultural sector and the wider business community, to encourage business growth and investment across the region. \nThe scheme aims to make the North East the leading region in the country at partnership working between the business and cultural communities. \nIn the coming months, a series of reports will be published highlighting the work of North East cultural organisations to improve skills, promote the region and support local business communities. \nEach report will highlight the activities of the cultural sector on these issues, how the work benefits North East businesses and how the business community can build mutually beneficial partnerships with cultural venues. Read More School leaver at 16 becomes head of major accountancy office: meet Sandra Thompson \nSage Gateshead managing director Abigail Pogson said: “The arts and culture are a crucial element which make the North East a special place to live, work, invest and do business. \n“Our partnership with the Chamber gives us the opportunity to contribute, with other sectors, to influencing policy for the north and to championing it as a fantastic place. We look forward to working with the Chamber to bring the arts and culture into partner activity.” Read More Newcastle tech firm hedgehog lab named one of best in Europe \nThe new partnership aims to build on the work previously undertaken to build links between business and cultural organisations by groups including the North East Culture Partnership, NewcastleGateshead Cultural Venues, Arts Council and the Creative Industries Federation. \nIt comes as Sunderland is bidding to become UK City of Culture in 2021 while Newcastle and Gateshead are preparing to host the Great Exhibition of the North next year. \nChamber chief executive James Ramsbotham said: “Sage Gateshead is one of the largest music organisations outside of London and a great asset to the North East. We are delighted to be working with such a well- regarded institution on a campaign to really exploit our cultural assets to best effect. Read More Avoiding hard Brexit is keen concern for North East businesses, Journal survey shows \n“The cultural sector enriches all our lives as well as being a major promoter of our regional image, a valuable developer of the skills of young people and a source of commercial opportunities for business across the North East.” \nOrganisations who want to find out more about the partnership or who would like to be involved should contact Jonathan Walker, the chamber’s head of policy and campaigns, by emailing jonathan.walker@neechamber.co.uk. Like us on Facebook", "external_links": [], "published": "2017-05-30T07:01:00.000+03:00", "crawled": "2017-05-30T06:51:00.000+03:00", "highlightTitle": ""}