{"organizations": [], "uuid": "45430be4275aea3c653c634e76be22497a49617d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13095767.ece/ALTERNATES/s1200/IBP_NEC_240317roman_03JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/local-news/election-2017-north-tyneside-constituency-8650813", "country": "GB", "domain_rank": 21960, "title": "North Tyneside constituency General Election 2017 - parties, candidates and the history of the seat", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-26T17:32:00.000+03:00", "replies_count": 0, "uuid": "45430be4275aea3c653c634e76be22497a49617d"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/local-news/election-2017-north-tyneside-constituency-8650813", "ord_in_thread": 0, "title": "North Tyneside constituency General Election 2017 - parties, candidates and the history of the seat", "locations": [], "entities": {"persons": [{"name": "martin collins", "sentiment": "none"}, {"name": "margaret bondfield", "sentiment": "none"}, {"name": "john appleby", "sentiment": "none"}, {"name": "gary legg", "sentiment": "none"}, {"name": "greg", "sentiment": "none"}, {"name": "henry newman", "sentiment": "none"}, {"name": "scott hartley", "sentiment": "none"}, {"name": "martin collins martin collins", "sentiment": "none"}, {"name": "claire-louise leyland", "sentiment": "none"}, {"name": "gary legg  raf", "sentiment": "none"}, {"name": "north heaton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mary glindon", "sentiment": "none"}, {"name": "henry", "sentiment": "none"}, {"name": "mary", "sentiment": "none"}, {"name": "henry newman henry newman", "sentiment": "none"}, {"name": "gary", "sentiment": "none"}, {"name": "greg stone", "sentiment": "none"}, {"name": "howdon", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "tim wall", "sentiment": "none"}, {"name": "bob batten", "sentiment": "none"}, {"name": "hadrian", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "greg stone  greg", "sentiment": "none"}, {"name": "mary glindon  mary", "sentiment": "none"}, {"name": "martin mcgann", "sentiment": "none"}], "locations": [{"name": "segedunum roman fort", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "camden", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "west london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "killingworth", "sentiment": "none"}, {"name": "brentford", "sentiment": "none"}, {"name": "tynemouth", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "longbenton", "sentiment": "none"}], "organizations": [{"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "socialist coalition", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "child support agency", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "north tyneside council", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "people’s theatre arts group", "sentiment": "none"}, {"name": "northern rail", "sentiment": "none"}, {"name": "trade unionist", "sentiment": "none"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "raf", "sentiment": "none"}, {"name": "national front", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "tyne & wear integrated transport authority", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Roman soldier Sculpture at Segedunum Roman Fort in Wallsend (Photo: Newcastle Chronicle) Share Get daily   Thank you for subscribing!   \nIf you’re due to cast your vote in the North Tyneside constituency on June 8 we’ve got everything you need to know right here. \nBritain will go to the polls to elect a Government and Prime Minister after Theresa May called a snap general election. \nWe’ll be covering events on our live blog on election day, but in the meantime we’ve got the information you need before you decide which box to put your cross in. \nThe North Tyneside seat curls around the east of Newcastle and is largely made up of large local authority housing developments like Killingworth, Howdon and Longbenton, built in the 1950s and 60s to house the overspill population from Newcastle. The town of Wallsend (the name comes from being the end point of Hadrian's Wall) on the banks of the Tyne at the far south of the seat has a longer history, long associated with shipbuilding and coal mining. Which parties and candidates are standing in North Tyneside: Labour - Mary Glindon MP Mary Glindon \nMary was born in North Shields in 1957 and educated at the Sacred Heart Grammar School, in Newcastle, before going to Northumbria University and gaining a degree in sociology. She has worked in the public, voluntary and private sectors over the years, before getting elected in 2010. \nElected in 2010, she became North Tyneside’s first female Labour MP since Margaret Bondfield in 1926. \nPrior to winning the election, Mary worked as an administrative officer in the Child Support Agency at Longbenton and was a North Tyneside councillor for 15 years. \nAs an MP, she has served as Shadow Minister for Environment, Food and Rural Affairs between October and May. Conservatives - Henry Newman Henry Newman is running for the Conservatives in North Tyneside \nA former advisor to Michael Gove, Henry Newman has been chosen as the Conservative candidate for North Tyneside. \nHe was shortlisted to run for the Tories this year in Camden, London, but lost out to Claire-Louise Leyland. \nHenry campaigned for Brexit and worked for the Vote Leave campaign. He now runs a think tank which advises on Brexit. \nIn Camden, Henry has campaigned actively on bin collections and litter problems. He has worked in the Cabinet office, focussing on Government efficiency, and spent time with the Justice Department working on prison reform. Prior to that, he taught at universities. \nHe says he will “champion” North Tyneside schools, stand up for businesses and support the fishing industry. UKIP - Gary Legg \nRAF veteran Gary Legg is standing for UKIP in North Tyneside . \nHe spent 27 years serving with the RAF and later worked for Northern Rail. \nGary says he had little interest in politics until 2010, and voted for UKIP as he wanted to cut immigration and end EU freedom of movement. He joined the party in 2013, chairs the North Tyneside branch and stood in Tynemouth in 2015. \nIn his spare time Gary enjoys cycling and hiking. Green Party - Martin Collins Martin Collins, Green Party \nOriginally from Brentford, West London, Martin moved to Wallsend in 1988 to study Plant Biology at Newcastle University and has lived in the town ever since. \nMartin says he is a greenist and wants to move forward to an “economy based on devolved communities, built on sustainability and non-violence, but with a world view.” \nOutside of politics, he is vice president of the People’s Theatre Arts Group. He also has interests in science and the arts. \nMartin stood in the same seat in 2015. Liberal Democrats - Greg Stone Liberal Democrat candidate for North Tyneside, Greg Stone \nGreg has served as a councillor for North Heaton on Newcastle City Council since 1998. He’s originally from York, but moved to the North East to attend Newcastle University, and has lived in the area since 1992. He has worked as an external funding officer in the university sector, and a consultant in the planning and regeneration sector. \nHis interests include regeneration, economic development, housing and transport. As well as standing as a Liberal Democrat candidate in 2001, 2005 and a by-election in 2007, Greg has represented his party as group leader on the Tyne & Wear Integrated Transport Authority. \nHe has also worked as a spokesman for the party in the North East. What was the result in North Tyneside in 2015? \nMary Glindon won the seat with 26,191, a 55.9% share. \nConservative candidate Martin McGann came second place with 8,997. \nUKIP’s Scott Hartley followed closely with 7,618, Liberal Democrat John Appleby was fourth with 2,075. \nThe Green Party’s candidate Martin Collins received 1,442 votes, Tim Wall for the Trade Unionist and Socialist Coalition had 304 and Bob Batten, for the National Front, received 191. Which parties and MPs have held the seat in the past? \nThe constituency was created in 1997 and won by Labour. \nNorth Tyneside and its predecessor, Wallsend, have been held by Labour since 1945, often with landslide margins. The Tories last won the old Wallsend constituency in 1931. Where are my polling stations? \nNorth Tyneside Council has a list of polling stations here http://my.northtyneside.gov.uk/page/7163/find-your-polling-station To find yours, check your polling card. Like us on Facebook", "external_links": [], "published": "2017-05-26T17:32:00.000+03:00", "crawled": "2017-05-26T12:56:13.000+03:00", "highlightTitle": ""}