{"organizations": [], "uuid": "e0fea293c1b1d3c871c8ae04b301a405d2b1e87f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13105097.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/food-drink-news/top-chefs-serve-special-lamb-13101990", "country": "GB", "domain_rank": 21960, "title": "Top chefs to serve special lamb recipes at sheep industry gathering at Tow Law", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-29T20:00:00.000+03:00", "replies_count": 0, "uuid": "e0fea293c1b1d3c871c8ae04b301a405d2b1e87f"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/food-drink-news/top-chefs-serve-special-lamb-13101990", "ord_in_thread": 0, "title": "Top chefs to serve special lamb recipes at sheep industry gathering at Tow Law", "locations": [], "entities": {"persons": [{"name": "heather stoney-grayshon", "sentiment": "none"}, {"name": "simon", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "jimmy bell", "sentiment": "none"}, {"name": "simon hicks", "sentiment": "none"}, {"name": "stephanie moon", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "blanchland", "sentiment": "none"}], "organizations": [{"name": "nsa north sheep", "sentiment": "none"}, {"name": "lord crewe arms", "sentiment": "none"}, {"name": "nsa northern region", "sentiment": "none"}, {"name": "national sheep association", "sentiment": "none"}, {"name": "east wingates farm", "sentiment": "none"}, {"name": "tow law", "sentiment": "none"}, {"name": "nsa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Top chefs to serve special lamb recipes at sheep industry gathering at Tow Law As many as 8,000 people are expected at the NSA North Sheep event which will also have a Festival of Lamb Share Simon Hicks (left) and Stephanie Moon (right) Share Get what's on updates   Thank you for subscribing!   \nThe Smith family from Tow Law, County Durham , are preparing to welcome as many as 8,000 visitors to their home on Wednesday, June 7. \nTo be fair, they do have the space to accommodate them and the visitors won’t, in any case, be expecting a cup of tea in the living room. \nThe Smiths farm 1,200 acres at West Shields Farm which is the location for one of the key events in the calendar for the National Sheep Association, an industry get-together called NSA North Sheep. \nHeld every two years, it is billed as an occasion for sheep farmers to get together and discuss the lie of the land and how things might change. The election and Brexit are sure to feature this time. \nAs part of the festival, and to highlight changes in consumer habits to producers, there is to be a Festival of Lamb with noted chefs creating a series of dishes using only the best British lamb. \nThere will be butchery demonstrations by Jimmy Bell, aka The Lamb Man, from East Wingates Farm, Morpeth. \nSimon Hicks, head chef at the Lord Crewe Arms, Blanchland, will give barbecue demonstrations and celebrity chef Stephanie Moon willmake lamb dishes to sample. Read More \nSimon was born and brought up in Australia but has an approach to cooking that has been developed over many years while travelling to Europe. \nHe will be out to show that there is more to barbecue food than burgers and buns. \nHis recipes will include grilled rolled lamb shoulder and involve other cuts of meat. “I wanted to highlight the diversity of dishes that can be created with different cuts of lamb that would perhaps not normally be the number one choice for people. \n“I want to showcase to the producers what the end consumer is after and, of course, how delicious it can taste.” \nStephanie Moon will create dishes to demonstrate the diversity of lamb as an ingredient for different occasions. \nThey wil linclude a lamb sharing platter, slow pulled lamb with sticky sauce and tagine-spiced lamb steaks. \nHeather Stoney-Grayshon, manager of the NSA Northern Region and event organiser, said: “We are delighted for everyone attending this year’s event to have this new initiative showing producers exactly what today’s consumers are looking for. \n“The emphasis is very much these days on the end product.” \nFind details of the NSA North Sheep event, which also has sheepdog handling demonstrations and 200 agricultural stands, at www.nationalsheep.org.uk/northsheep RECIPE by Simon Hicks, head chef, Lord Crewe Arms, Blanchland. \nGrilled rolled shoulder of lamb with chickpeas \nIngredients", "external_links": [], "published": "2017-05-29T20:00:00.000+03:00", "crawled": "2017-05-29T15:27:26.000+03:00", "highlightTitle": ""}