{"organizations": [], "uuid": "a628eb27e58a40bc043f763cfaacc2dab74a20f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13039960.ece/ALTERNATES/s1200/Theresa-May-Campaigns-In-Labours-Heartland-Of-North-Tyneside.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-support-tory-party-13039632", "country": "GB", "domain_rank": 21960, "title": "North East support for the Tory party rockets in UK-high swing", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-16T04:00:00.000+03:00", "replies_count": 0, "uuid": "a628eb27e58a40bc043f763cfaacc2dab74a20f2"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-support-tory-party-13039632", "ord_in_thread": 0, "title": "North East support for the Tory party rockets in UK-high swing", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "su", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "matthew smith", "sentiment": "none"}, {"name": "cathy mohan", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "oxfordshire", "sentiment": "none"}, {"name": "abingdon", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "wansbeck", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour’s national elections coordinator", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Theresa May (Photo: Getty Images Europe) Share Get   Thank you for subscribing!   \nSupport for the Conservatives has shot up in the North East, a shock new poll found. \nThe proportion of voters saying they plan to back Theresa May’s Tory party is up to 40% - a massive increase on the 25% who voted Conservative in the region in 2015 – making it the biggest swing to the Tories in the country. \nAnd 42% say they will back Labour, down from 47% in the 2015 general election. \nIt would mean Labour is just two points ahead of the Conservatives in the North East, once seen as their impregnable heartland. \nThe findings, published by leading polling firm YouGov, were based on surveys conducted from April 24 to May 5. \nYouGov analyst Matthew Smith said in a blog post on the firm’s website: “The fifteen point increase in the Conservative vote since the last election is the highest of any region in the country, while the five point Labour drop is one of their worst. \n“The region also played host to the shock Conservative victory at the Tees Valley mayoral election, which could be a harbinger of further surprise Tory wins to come at the general election.” \nMrs May has attempted to appeal to working class voters in the North East, visiting the region last week to ask for their support and highlighting her patriotism, which she says contrasts with Labour leader Jeremy Corbyn’s London-centric values. Labour leader Jeremy Corbyn (Photo: PA) \nConservatives have also revealed plans for a “new deal for workers” including protections for people in the “gig economy”, a statutory right to leave for those who need to care for a family member and a commitment to further increases in the national living wage. \nIn a further sign of the Prime Minister’s drive to woo Labour voters, Mrs May set out what she claims is the “greatest expansion in workers’s rights by any Conservative government”. \nThe package includes measures to protect workers’ pensions in the wake of the BHS scandal and a guarantee European Union rights will be protected in the Brexit process. Read More How to avoid political rows in the workplace over the general election period \nBut Mrs May came under fire as she campaigned in Oxfordshire, when a woman with mental health problems confronted her over Government cuts to disability payments. \nCathy Mohan, who lives in Abingdon, Oxfordshire, told the Prime Minister how changes to benefits had left her living on £100 a month and pleaded with the premier to help her. Wansbeck MP Ian Lavery (Photo: Daily Mirror) \nWansbeck MP Ian Lavery , Labour’s National Elections Coordinator, said: “This is what happens when Theresa May meets real people. \n“The Tories have failed to support disabled people and those with learning difficulties, while changes to Personal Independence Payments will deny 350,000 disabled people the support they need. \n“Only a Labour Government will support those in need and build a Britain for the many, not the few.” Read More Who should I vote for in the 2017 general election? The runner and riders are all here \nMrs May also had a surprise when she took part in a question and answer session on Facebook - and Mr Corbyn posed a question issuing a direct challenge to the Prime Minister to take part in a TV debate with him. \nBut the Conservative leader dismissed his call, saying that it was more important for her to take questions directly from voters. Video Loading  ", "external_links": [], "published": "2017-05-16T04:00:00.000+03:00", "crawled": "2017-05-15T23:28:10.000+03:00", "highlightTitle": ""}