{"organizations": [], "uuid": "4ed6f2bd2102fc33d436e75c7111e1f3767cd4d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30315092/15988867.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/tories-retain-control-of-leicestershire-council-as-unseated-labour-leader-blasts-jeremy-corbyn/story-30315092-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin commented Tories retain control of Leicestershire council as unseated...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin commented Tories retain control of Leicestershire council as unseated...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-05T23:27:00.000+03:00", "replies_count": 0, "uuid": "4ed6f2bd2102fc33d436e75c7111e1f3767cd4d2"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/tories-retain-control-of-leicestershire-council-as-unseated-labour-leader-blasts-jeremy-corbyn/story-30315092-detail/story.html", "ord_in_thread": 0, "title": "danjmartin commented Tories retain control of Leicestershire council as unseated...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tories retain control of Leicestershire council as unseated Labour leader blasts Jeremy Corbyn By danjmartin | Posted: May 05, 2017 1 COMMENTS SHARES Comments (1) \nThe Conservatives have regained control of Leicestershire County Council - taking Labour seats and expelling UKIP from County Hall. \nThe Tories went into yesterday's election with 31 councillors and after Thursday's poll they had stretched that number to 36 giving them an increased majority of 17. \nThe Conservative success in Leicestershire mirrors national gains made by the party and will encourage activists going into the General Election on June 8. \nConservative council leader Nick Rushton , who held his Valley division, said: \"I'm delighted with the results. \n\"I'd like to thank all the candidates who stood. \n\"We know we have some tough times ahead with our finances and we will have again. \n\"We will have a budget reduced by £135 million so we have some difficult decisions to make. \n\"But the people of Leicestershire have trusted us with the challenge because they know we are the party that will protect front line services.\" Council leader Nick Rushton offers his verdict \nA national surge in Liberal Democrat membership was not reflected in the Leicestershire results but the party remains the principal opposition at County Hall having held onto their total of 13 seats. \nLib Dem group leader councillor Simon Galton acknowledged it had been a tough campaign. \nHe said: \"We are as we were. The story here is that Labour has suffered and UKIP no longer has any representation on the council so it is down to us to make sure we continue to hold the Tories to account. \n\"They will be back cutting services again soon and we all know that.\" \nLabour suffered a reverse in Leicestershire losing three of the nine seats they held. \nThe Tories took a major scalp by unseating Labour group leader Robert Sharp from his seat in Loughborough South. Police and crime commissioner Willy Bach on today's poll results \nMr Sharp said: \"I am personally disappointed but we saw it coming. \n\"I have said before that it has been tough on the doorstep we have struggled to get local issues noticed. \n\"All we have had back at us is Brexit and 'Bloody Corbyn'. \n\"I don't want to sound like a bitter candidate who has just lost his seat and is trying to blame someone else but we can't hide behind it any more. \n\"It's a fact Jeremy Corbyn has had a negative impact on us in this campaign.\" \nUKIP lost both of their seats to the Conservatives. \nFormer UKIP councillor for Markfield Desford and Thornton David Sprason said: \"We have suffered locally because of the national picture.\"", "external_links": [], "published": "2017-05-05T23:27:00.000+03:00", "crawled": "2017-05-05T23:10:25.000+03:00", "highlightTitle": ""}