{"organizations": [], "uuid": "a691d56b1037d456dad187056ddf88a0c4fb5fe9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30305334/15981659.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/teresa-may-visits-devon-and-says-a-vote-for-tories-is-a-vote-for-strong-government/story-30305334-detail/story.html", "country": "GB", "title": "EdOldfield published Teresa May tells Devon a vote for Tories is a vote for strong...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "EdOldfield published Teresa May tells Devon a vote for Tories is a vote for strong...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-02T12:00:00.000+03:00", "replies_count": 0, "uuid": "a691d56b1037d456dad187056ddf88a0c4fb5fe9"}, "author": "EdOldfield", "url": "http://www.devonlive.com/teresa-may-visits-devon-and-says-a-vote-for-tories-is-a-vote-for-strong-government/story-30305334-detail/story.html", "ord_in_thread": 0, "title": "EdOldfield published Teresa May tells Devon a vote for Tories is a vote for strong...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May tells Devon a vote for Tories is a vote for strong government By EdOldfield   4 COMMENTS SHARES Theresa May tells Devon a vote for Tories is a vote for strong government   \nPrime Minister Theresa May is visiting Devon today as part of her election campaign tour of Britain. \nHere is a campaign speech written by the Prime Minister ahead of today's visit: \n\"I am visiting the South-West today with a simple message: this General Election is the most important in a generation, and every vote will count. \n\"That is why I have been touring the country to make my case and show that I am worthy of your support. Since the start of this campaign, I have travelled right across Great Britain - from cities like London and Leeds, Aberdeen and Newport, to proud towns like Bolton and Dudley, Bridgend and Banchory. I have had the pleasure of visiting communities in England, Scotland and Wales. And I have campaigned in both urban and rural areas too. \n\"I am determined to earn every vote I can because that will strengthen my hand in the Brexit negotiations, and enable me to provide the country with the strong and stable leadership it needs to see us through Brexit and beyond. \nRead more: North Devon Conservatives confirm Peter Heaton-Jones as official candidate for General Election \n\"We need that strong and stable leadership more than ever before. We face a crucial time in the history of our nation. Our future prosperity, our place in the world, and our standard of living all depend on getting the next five years right. \n\"Yet as we have seen in recent days, it will not be easy. The negotiations ahead will be tough. Across the table from us sit 27 European member states who are united in their determination to do a deal that works for them. We need that same unity of purpose here at home to ensure we can get a deal that works in Britain's national interest too. \nRead more: Will Rachel Johnson anger brother Boris by standing as an anti-Brexit MP at the general election? \n\"Every vote for me and my local team in this election will be a vote to demonstrate that unity of purpose, to strengthen my negotiating position, and to help me secure the best possible deal for families and businesses across this United Kingdom. \n\"That is why I called this election, and why we need it now. It is a chance to put old divisions behind us and to bring the country together. It is why I am determined we should not spend this campaign rerunning old arguments, and why we should move beyond the language of 'leave' and 'remain'. And it is why I am determined not to allow parties like the Liberal Democrats to prosper, because it is in their interests to prop up a Corbyn coalition of chaos so that the Brexit process stalls and they can reopen the battles of the past. Wherever it says Labour or Liberal Democrat on the ballot, it's a weak, nonsensical Jeremy Corbyn that gets the vote. \nRead more: The general election and defence in Devon and Cornwall \n\"Yet now is not a time for weakness, but strength. \n\"Five years of strong and stable leadership will enable us to lock in the economic progress we have made together. That economic progress has resulted in over a quarter of a million more jobs here in the South-West since 2010, and allowed us to raise the National Living Wage to £7.50 an hour while cutting taxes for 2.7 million people across the region. And it means we have been able to meet our NATO commitment to spend 2% of GDP on defence, supporting 30,000 local jobs. \nRead more: Tories 'parachute' in Exeter election hopefuls for selection meeting at Masonic Hall \n\"Five years of strong and stable leadership will mean we can continue to spread jobs and prosperity across the country as we rebalance the economy away from London and the South-East. That is why we have introduced a Rural Productivity Plan to grow the rural economy and boost our rural areas – connecting the country with faster broadband and more modern transport links, protecting critical local services, expanding apprenticeships, creating new enterprise zones and helping rural areas thrive, so that we ensure there are opportunities for young people to remain in the communities they grew up in, rather than moving away to find homes elsewhere. \nRead more: Devon leads the way in demanding tough protection for Nature after Brexit \n\"And five years of strong and stable leadership will help us shape a brighter future for farmers and fishermen in the South-West as we leave the EU. That means working with farmers and landowners to build the best possible system to underpin a world-leading food and farming industry as we leave the Common Agricultural Policy, ensuring we preserve our precious landscape and work towards a cleaner, healthier environment. And it will mean leaving the Common Fisheries Policy that has let fishing communities down. I simply do not agree with those such as the Liberal Democrats who want to retain membership of this unpopular policy. It is time for a new approach instead. \n\"At the last election, voters here in the South-West were the difference between a strong, majority government and a weak, unstable coalition of Labour, the Liberal Democrats and the SNP. Yet the country faces the same choice again. The opposition parties are lining up to prop up Jeremy Corbyn and disrupt our Brexit negotiations – a recipe for years of drift and division at this crucial time. \n\"So my message to voters across the region is clear: if you want five years of strong and stable leadership with me as your Prime Minister, you have to go out and vote for it.\"", "external_links": [], "published": "2017-05-02T12:00:00.000+03:00", "crawled": "2017-05-02T08:05:03.000+03:00", "highlightTitle": ""}