{"organizations": [], "uuid": "b49feaf97e2fbd73c399c9496c9cb156375a95a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30347127/16012412.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/police-appeal-after-caf-window-atatcked-by-vandals/story-30347127-detail/story.html", "country": "US", "title": "Police appeal after café window atatcked by vandals | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2017-05-23T00:28:00.000+03:00", "replies_count": 0, "uuid": "b49feaf97e2fbd73c399c9496c9cb156375a95a0"}, "author": "", "url": "http://www.devonlive.com/police-appeal-after-caf-window-atatcked-by-vandals/story-30347127-detail/story.html", "ord_in_thread": 0, "title": "Police appeal after café window atatcked by vandals | Devon Live", "locations": [], "entities": {"persons": [{"name": "timothy holman", "sentiment": "none"}, {"name": "geoffrey mercer", "sentiment": "none"}, {"name": "steven joyce", "sentiment": "none"}, {"name": "andrew mcneilly", "sentiment": "none"}, {"name": "stix", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "peters marland", "sentiment": "none"}, {"name": "torrington", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "wellswood", "sentiment": "none"}, {"name": "torwood street", "sentiment": "none"}, {"name": "langdon hospital", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "ilfracombe", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "exeter prison", "sentiment": "none"}, {"name": "guildhall shopping centre", "sentiment": "none"}], "organizations": [{"name": "devon live police", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "marland school", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Police appeal after café window atatcked by vandals By Zoe_Stevens | Posted: May 22, 2017 0 COMMENTS SHARES Google maps The window of the cafe was damaged between 3.30pm on May 19 and 6.45am on May 20 Police appeal after café window atatcked by vandals X \nCopy link to paste in your message / Pictures: Google maps The window of the cafe was damaged between 3.30pm on May 19 and 6.45am on May 20 Comments (0) \nPolice are appealing for witnesses and information after a shop window was damaged by vandals in Torquay. \nThe offenders cracked the front shop window of a café in the Wellswood area of Torquay 'in an attempt to smash it'. \nThe incident happened at French Stix on Torwood Street between 3.30pm on May 19 and 6.45am on May 20. \nA police spokesperson said: \"Unknown offenders cracked the front shop window by unknown means in an attempt to smash it at French Stix along Torwood Street.\" \nAnyone with information is asked to contact police via or by calling 101 quoting CR/038919/17. \nInformation can also be passed anonymously to independent charity Crimestoppers by calling 0800 555 111 or reporting online at www.crimestoppers-uk.org . READ NEXT: \nNorth Devon man admits making a bomb in his home \nA man has admitted building a home made pipe bomb which led police to evacuate houses in North Devon when it was discovered. Timothy Holman, who has a history of mental illness, pleaded guilty to making an explosive substance at his home in Ilfracombe on December 9 last year. Judge Geoffrey Mercer, QC, adjourned his case until June 27 for a psychiatric report after hearing he had been moved from Exeter Prison to Langdon Hospital for mental treatment. \nEx boarding school worker faces jail for abuse of boys at Devon school \nA former boarding school house parent has been warned to expect a jail sentence after he admitted the historic abuse of four boys. Steven Joyce carried out the sexual assault on boys while employed to look after the welfare of vulnerable and troubled children at the Marland School at Peters Marland, near Torrington, in the 1980s. At the time it was a privately run school for what were described as maladjusted children, but it is now a special school run by Devon County Council. \nMore big plans for Exeter's Guildhall Shopping Centre \nIt's only been nine months since Exeter's new eating quarter opened its first restaurant, but it has been exclusively revealed that more changes are in store for the Guildhall Shopping Centre. The confirmation has come from centre manger Andrew McNeilly, but what that might entail is being kept closely under wraps for now. Discussions about how to make the best use of the space in the Guildhall in the future have been prompted by the success of launching its Queen Street quarter as a premium dining destination. \nDevon needs an energy policy to match the region's needs \nTake a look at the main issues that are high on the agenda for most voters ahead of the General Election, and it's unlikely that energy will feature prominently. A recent Ipsos MORI poll showed Brexit, understandably, leading the way, with health, the economy and both poverty and inequality recognised as being among the key areas of public concern ahead of polling day next month. ", "external_links": [], "published": "2017-05-23T00:28:00.000+03:00", "crawled": "2017-05-22T18:46:26.000+03:00", "highlightTitle": ""}