{"organizations": [], "uuid": "41b6a114628f70fd4e6a4e22c0aaf720e4e0c1e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11342924.ece/ALTERNATES/s1200/JS90195948.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13035252", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Zytronic's revenues hit £11.3m after demand for touch screens grows", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-16T14:55:00.000+03:00", "replies_count": 0, "uuid": "41b6a114628f70fd4e6a4e22c0aaf720e4e0c1e5"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13035252", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Zytronic's revenues hit £11.3m after demand for touch screens grows", "locations": [], "entities": {"persons": [{"name": "chris white", "sentiment": "negative"}, {"name": "mark cambridge", "sentiment": "negative"}, {"name": "zytronic", "sentiment": "negative"}, {"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "zytronic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Uber launches gift cards for UK users \nCar-hailing service Uber has launched gift cards for journeys in the UK. \nThe ride-sharing app will now allow users to buy cards with a minimum value of £15 for use on its traditional service and the UberEATS food delivery service. \nUsers can buy and send electronic cards through the firm’s official app, or from Uber’s website where personal messages can also be added. \nThe value can then be put towards journeys on the service or to order food via UberEATS. Physical cards will also be available in more than 800 WHSmith stores in the UK, Uber said. The technology firm is keen to attract new customers after a series of controversies in recent months, as well as the departure of several executives. \nOne incident saw chief executive Travis Kalanick caught on video arguing with an Uber driver over fares earlier this year. He later apologised. \nThe company has also been locked in a court battle with Google’s Waymo over self-driving car technology. \nIn a blog, the company said: \nToday we are excited to announce the launch of Uber gift cards for the first time in the UK. \nWhether it’s a birthday present for that friend who has everything, a little something for travel lovers to explore cities or a treat for food lovers - the Uber gift card really is for everyone. An Uber taxi (Photo: PA) 8:59 KEY EVENT Consett register office converted into kids' role play centre \nA new role play centre where children can pretend to be fireman, doctors, or hairdressers has opened in the former register office in Consett town centre . \nBelieve and Be was set up by sisters-in-law Helen Pyke and Victoria Johansen, after they converted the register office in the County Durham town into an indoor street. \nThe scaled down buildings, known as Believe Town, include a hairdressers, doctor’s surgery, police and fire stations, a local shop and a kitchen. It also includes a real café serving food and drinks for parents. \nAfter opening in February, the centre now holds four sessions a day each full of around 20 children. \nExplaining the importance of role play, Ms Pyke said: “Role play is extremely education for children, as well as entertaining. It allows them to explore the world around them and think of new concepts. \n“We cap the classes at 20 children as we want every child to be able to enjoy the experience, so it’s not too full and they can really get into the role playing and parents can relax a little.” \nThe play centre is believed to be the first of its kind in the area. Believe Town is designed for children from the moment they can start walking up to the age of seven. \nFor young babies, who cannot yet walk, there is also a snug area containing play mats and age appropriate toys. (L-R) Victoria Johansen and Helen Pyke set up Believe and Be in Consett (Photo: Staff) 8:50 Jonathon Manning Business Durham chief Simon Goon to leave his post later this year \nA leading figure in the region’s business community has announced he is to leave his post later this year . \nSimon Goon, managing director of Business Durham, is stepping down from his position at the economic development company to take up a job as chief operating office at Synoptica, an early-stage Artificial Intelligence company based in Guilford, Surrey. \nMr Goon, who will leave in August, has held his position at Business Durham for the last four years, overseeing the growth of the NetPark science site at Sedgefield, as well as developing employment sites elsewhere in the county. \nHe said: \nI have enjoyed a great few years at Business Durham, helping the organisation to achieve its aim of supporting businesses to create wealth and jobs for County Durham and driving enterprise and innovation. \nI’ve worked with a brilliant team who care passionately about the economic development of County Durham. \nI’d like to thank them for their support and I look forward to an exciting new chapter in my career working in a sector which is at the cutting edge of economic advancement. Simon Goon Jonathon Manning Falling profits for Premier Foods as company battles soaring costs \nMr Kipling cakes firm Premier Foods has served up falling full year profits as the company battles soaring costs. \nThe group said adjusted pre-tax profit fell 11.8% to £74.2m in the year to April 1, down from £84.2m in 2016. \nUnderlying revenue fell 1.4% to £790.4m in the period, with chief executive Gavin Darby flagging a “challenging year” as he updated the group’s strategy. \nHe said: \nThis financial year has been a challenging one for the industry, with the return of food inflation and changing retailer promotional strategies. \nWith the industry changing rapidly, we have updated our strategy to give an equal focus to revenue growth, cost efficiencies and cash generation. \nIn the UK, growing ahead of our categories continues to be a core objective for us and our plans for international are for further strong growth. \nThe group, which also owns a raft of household brands including Oxo and Batchelors, has been stung with surging costs of commodities such as sugar, chocolate, dairy, wheat and palm oil, as well as the collapse in the pound. \nIn January, the firm warned that annual profits would be around 10% lower than expected and unveiled a “substantial” cost-cutting plan, weeks after confirming it was in talks with supermarket giants and retailers over price hikes. \nPremier said it would take a “blended approach” to managing cost increases, including looking at “limited price increases where these cannot be avoided”. Premier Foods Jonathon Manning Northern workers three times more likely to go to work ill than take time off \nWorkers in the North of England are three times more likely to go to work unwell, rather than pull a “sickie”. \nAccording to research from insurance giant Aviva, 67% of private sector employees in the North have gone to work unwell. \nHowever, on in five (21%) of people have admitted to pulling a “sickie” when not actually ill. \nDr Doug Wright, Medical Director, Aviva UK Health, said: \nWhile every business wants the right level of resource in place, having employees who are unwell at work is a false economy. Businesses need to ensure they create a working culture whereby people do not feel pressurised into coming to work when they are unwell, safe in the knowledge their absence can be effectively managed. \nThe research shows that workers in the region are fearful that their workload will pile up if they are off sick. This trend of “presenteeism” has helped cause a drop in the number of average sick days, from 7.2 in 1993 to 4.3 in 2016. \nDr Wright added: \n“Presenteeism, driven in part by an increased ‘always-on’ culture, poses a genuine threat to overall business performance through the adverse impact on productivity and morale in the workplace. Businesses should ensure they take the lead on communicating proactively to employees that it’s important to take a step back when unwell and it can be in everyone’s interest. \n“Businesses can also counter such issues by ensuring they continue to explore new ways in which to improve the working experience for employees. While flexible working cannot be offered by every employer, advances in technology are providing new solutions. Investment in health and wellbeing is no longer a nice to have; it must be looked on as a priority that can aid business growth and boost staff retention.” More people in the North are going to work while ill (Photo: Getty Images) 8:28 KEY EVENT Newcastle Start-Up Week kicks off with rallying call to new businesses \nA week-long series of events designed to encourage more start-up businesses in the North East has kicked off with a call to arms for budding entrepreneurs in the region. \nNewcastle Start-Up Week has been organised by former Tech North and Sage executive Paul Lancaster in a bid to help people thinking of starting a new company to take the plunge. \nThe event has kicked off with a launch at Newcastle’s Boiler Shop and will be followed by a series of talks from experts in all areas of business taking place around the city over the next five days. \nIntroducing the week, Mr Lancaster said: \nI’ve been helping people to start their own businesses for the last 15 years. I finally started mine last year. \nI’ve wanted to do that for five years but I never felt I was quite ready. I’d read all the books, I’ve got great friends who are entrepreneurs but I still didn’t feel it was quite the right time for me. \nIt occurred to me that if I felt like that, what about everyone else? What we’re trying to do in this week is put on a plate in five days the sort of thing you need to know to start a business that would normally take you five weeks or five months to learn. \nNewcastle Start-Up Week is a great showcase for all the great support that exists in the North East to help people start up their own business. Paul Lancaster from Plan Digital UK (Photo: Newcastle Chronicle) 8:23 KEY EVENT EasyJet racks up half-year losses after being hit by pound's collapse \nBudget airline easyJet has racked up large half-year losses after being stung by the collapse in the value of the Brexit-hit pound and the later timing of Easter. \nThe low-cost carrier reported a £236m pre-tax loss in the six months to March 31, which compares with an £18mloss in the same period last year. \nEasyJet said that the impact of the timing of Easter into the second half of the year stood at around £45m while currency woes cost it £82m in the period. \nChief executive Carolyn McCall said: \nThe first half loss is in line with market expectations and reflects the movement of Easter into the second half as well as currency effects which together had an estimated impact of circa £127 million on the bottom line. \nHowever, Dame Carolyn added that summer bookings are ahead of last year and that demand for flights and holidays remains “strong”, with consumers prioritising travel expenditure over “non-essential” items. \nDespite the loss, easyJet is maintaining its full-year expectations. Revenue grew 3.2% to £1.8bn in the period, with the company recording a 9% rise in passengers to 33.8m and a 0.5% increase in load factor to 90.2%. \nThe group is also in the midst of setting up a new operating company in mainland Europe and applying for a new licence to secure flying rights on continental routes after Brexit. \nTo this end, easyJet said it “remains on track” to secure a European Air Operator Certificate by the summer. \nDame Carolyn added: \nLooking ahead, we are seeing an improving revenue per seat trend as well as the continued reduction of competitor capacity growth. \nCost performance for the full year will continue to be strong, easyJet is delivering on its strategy of purposeful investment in securing and building strong positions at Europe’s leading airports which is driving competitive advantage with sustainable returns. A pilot boarding an easyJet flight (Photo: PA) 8:18", "external_links": [], "published": "2017-05-16T14:55:00.000+03:00", "crawled": "2017-05-16T10:20:44.000+03:00", "highlightTitle": ""}