{"organizations": [], "uuid": "cc94bf38f0b14b14131c1c7e10c1eaee1cd57b3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13018276.ece/ALTERNATES/s1200/JS119242897.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13018283", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: BT chief executive Gavin Patterson stripped of annual bonus", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: BT chief executive Gavin Patterson stripped of annual bonus", "spam_score": 0.0, "site_type": "news", "published": "2017-05-11T15:30:00.000+03:00", "replies_count": 0, "uuid": "cc94bf38f0b14b14131c1c7e10c1eaee1cd57b3d"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13018283", "ord_in_thread": 0, "title": "Business Breakfast LIVE: BT chief executive Gavin Patterson stripped of annual bonus", "locations": [], "entities": {"persons": [{"name": "gavin patterson", "sentiment": "negative"}, {"name": "stephenson", "sentiment": "none"}, {"name": "ellen deboeck", "sentiment": "none"}, {"name": "catherine o’riordan", "sentiment": "none"}, {"name": "stephen harrison", "sentiment": "none"}, {"name": "harrison", "sentiment": "none"}, {"name": "redfern", "sentiment": "none"}, {"name": "mr broadly", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "stuart broadley", "sentiment": "none"}, {"name": "euan sutherland", "sentiment": "none"}, {"name": "broadley", "sentiment": "none"}], "locations": [{"name": "travelodge hull", "sentiment": "none"}, {"name": "uk export finance", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "novotel birmingham city centre", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "intu eldon square", "sentiment": "none"}, {"name": "north lakes hotel penrith", "sentiment": "none"}, {"name": "crowne plaza", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "mercure manchester", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "bt", "sentiment": "negative"}, {"name": "coreena ford energy", "sentiment": "negative"}, {"name": "us securities and exchange commission", "sentiment": "none"}, {"name": "barclays capital", "sentiment": "none"}, {"name": "doubletree", "sentiment": "none"}, {"name": "coreena ford barclays", "sentiment": "none"}, {"name": "energy industries council", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "hilton leeds", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "hilton tower hill", "sentiment": "none"}, {"name": "superdry", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "sec enforcement division’s asset management unit", "sentiment": "none"}, {"name": "financial reporting council", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "frc", "sentiment": "none"}, {"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "eic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Newcastle firm wins $8m deal with US Army to help in fight against terrorism \nNEWCASTLE defence specialist Pearson Engineering has secured its position as a global leader in counter IED equipment after winning an $8m deal to supply the US Army. \nThe Newcastle-based firm – part of the Reece Group – is already an award-winning provider of counter-mine and counter-IED equipment for armoured vehicles, with products like its Spark mine roller having been credited with saving countless lives in conflicts in Iran and Afghanistan. \nNow the firm’s counter-IED roller systems, manufactured to be attached to armoured vehicles, are to be made for the US Army, as part of a foreign military sales contract which will see them put to use in Afghanistan. \nThe contract, worth nearly $8m (£6.2m) will see Pearson Engineering provide a large number of rollers, similar to deals which has seen the firm supply its defence systems for use in Iraq and Afghanistan during recent campaigns. \nNamed Spark OIF(R), it is part of the Spark roller family, fielded during Operation Iraqi Freedom and Operation Enduring Freedom, which was specifically designed for the terrain and threat. \nThe system is designed to protect mine-resistant vehicles from the effects of IEDs over the track width of the vehicle and will support the mobility of the humvee fleet in Afghanistan. \nPearson’s in-house manufacturing capability will be supporting a US supply chain which includes manufacturing services in Michigan, and at Pearson’s storage and transportation facility in Georgia. 9.13 Coreena Ford Bus drivers employed by Stagecoach in strike ballot \nHundreds of bus drivers and other workers are to be balloted for strikes over the sacking of a union official. \nOver 400 members of the Rail, Maritime and Transport union employed by Stagecoach in the South West will vote in the coming weeks on whether to launch a campaign of industrial action. \nMost of the workers are based in Exeter. The union claims the sacking of a branch official was “grossly unfair”. \nRMT general secretary Mick Cash said: “This ballot has been forced on us by Stagecoach’s wholesale refusal to listen to reason throughout the disciplinary procedure. \n“Instead, they have chosen to pick on this particular member of staff and single him out for special treatment which has resulted in dismissal. \n“As far as we are concerned that amounts to victimisation of a highly respected local union official.” 9.07 Coreena Ford A third of Britons make travel plans based on tech needs \nMore than a third of Britons make travel plans based on their ability to use their gadgets, a survey has found. \nSome 35% consider the ability to use gadgets such as smartphones and tablets before choosing a mode of transport or accommodation, according to the poll of 2,052 people commissioned by train ticket retailer Trainline. \nThe research found that 44% of people feel more in control of travel plans when they can use their electronic devices, with 18% keeping all their booking documents on a smartphone. Travellers can use mobile tickets for selected journeys serving more than half of stations on the UK rail network, Trainline figures show. \nThe rail industry is part-way through a three-year plan to enable passengers to travel using mobile phones, contactless credit or debit cards and smartcards, in a bid to reduce reliance on the traditional orange paper ticket. \nA Trainline spokeswoman said: “People are using technology to make journeys better and we’ve seen more than 120% year-on-year growth in app transactions, demonstrating that people are seeing the benefits of using technology for train travel.” \nAll this will be music to the ears of Newcastle based Nomad Digital, which worked on the BEAM in-seat entertainment service for Virgin Trains. Virgin Trains photo of a person using its new Netflix-style entertainment system (Photo: Virgin Trains/PA Wire) 9.00 Coreena Ford Snapchat's parent firm reports £1.7bn loss \nSnapchat’s parent company Snap Inc has reported a net loss of more than $2.2bn (£1.7bn) in the company’s first ever earnings report. \nThe loss was higher than some analysts predicted, and follows a steady drop in the company’s share price amid pressure from rivals, including Facebook. Snapchat floated on the US stock market in March and in early trading saw its valuation rise above £25 billion. \nShare prices and the company’s value are likely to drop in the wake of the results. \nHowever, the photo sharing app was able to report an increase in the number of daily active users - who grew from 158 million at the start of the year to 166 million. \nIt is also an increase of 36% on the 122 million daily users the app had this time last year. \nSnapchat has come under intense pressure from Facebook in recent months, with the social media giant adding several Snapchat-like features to its own network, which includes Messenger, Instagram and WhatsApp. \nConfidence in Snapchat was also dented last month when Instagram revealed its Stories feature - similar to Snapchat’s Story - had surpassed 200 million daily users, well ahead of Snapchat. \nEarlier this week, Snapchat announced it would allow users to send images and video without time limits for the first time, expanding one of the app’s signature features in what is seen as an attempted fightback against Facebook. The logo of mobile app \"Snapchat\" is displayed on a tablet (Photo: Lionel Bonaventure/AFP/Getty Images) 8.55 Coreena Ford Energy companies are innovating but not exporting after oil crisis, report finds \nONE of the energy industry’s leading figures says 2017 will be ‘the turning point for the sector’. \nSpeaking on Teesside, Stuart Broadley, CEO of the Energy Industries Council (EIC), said: “After three years of crisis many of our members are seeing green shots with the levels of enquiries going up again. \n“With oil in the region of $45 to $55 a barrel, and following years of significant cost improvements, projects are now becoming viable and if that remains the case we will see projects going in 2018.” \nMr Broadley was speaking at the launch of the EIC’s new insight report; ‘Survive & Thrive’ which features input from 120 member companies, and in-depth findings from interviews with 26 EIC members - including a few from the North East. \nNot one of the 26 companies mentioned any concerns over the forthcoming Brexit, and in a world where the UK will need to open up new markets, Mr Broadly highlighted one worrying finding from its research. \nIn the months and years that followed the oil price crash which started three years ago, only 8% turned to exporting. \nMr Broadley said: “We are very surprised by the findings it seemed the companies we have spoken to decided it would be too difficult to embark on an export drive in the situation they were finding themselves in. \n“Instead they decided it would be more worthwhile to invest in new technology and collaborate. \n“They decided exporting was too expensive, and too risky, and they chose to work with their core customers and innovate. \n“This is quite worrying as all the Government seems to care about as we approach Brexit is exporting, and this says it is not going to work. \n“British businesses aren’t resourced or able to invest in that two or three-year cycle themselves and are instead focusing on the UK and that creates future risk. The companies have a very short-term view right now of what they have to do to survive.” \nMr Broadley suggested the government consider re-instating the TAP fund for SMEs, which exhibit abroad. It would allow SMEs access to finance to attend shows like the annual Offshore Technology Conference, which took place in Houston last week. \nMr Broadley said there needed to be more promotion around the UK Export Finance, which supplies companies with bonds and guarantees as they trade around the world. Stuart Broadley of the Energy Industries Council (Photo: Copyright unknown) 8.50 Coreena Ford Newcastle hotel one of the UK's best for women travellers \nA new hotel in Newcastle city centre is one of the best in the country for catering for women guests. \nThe Crowne Plaza hotel in Newcastle’s Stephenson Quarter has been shortlisted for the Solo awards, which are run by travel management company Redfern and celebrate the most female-friendly hotels in the country. \nThe awards are based on nominations of more than 100 women who travel for business and who nominated hotels they felt went above and beyond when it came to ensuring the needs of female corporate travellers are met. \nEight hotels around the country have been nominated for the award, with the Crowne Plaza competing for the top prize alongside the Hilton Leeds, Mercure Manchester, Novotel Birmingham City Centre, Park Regis Birmingham, Travelodge Hull city centre, North Lakes Hotel Penrith and Doubletree by Hilton Tower Hill. \nEllen Deboeck, who recently took over as general manager at the Crowne Plaza, said: “As a team that strives to make women travellers feel comfortable and at home when they stay with us, we’re really delighted to be nominated for this award. \n“Many of our staff are women and we always try to ensure our guests have a wonderful experience, whatever the occasion for their stay – so it’s fantastic to have our efforts recognised.” Crowne Plaza Hotel, Newcastle (Photo: handout publicity) 8.45 Coreena Ford Barclays agrees settlement over US overcharging claims \nBarclays has agreed a settlement of $97m (£75m) over allegations it overcharged more than 2,000 of its investment bank clients. \nThe US Securities and Exchange Commission (SEC) said it took enforcement action against Barclays Capital over alleged violations that the organisation said saw clients overcharged by nearly $50m (£39m). \nThe SEC said it found two of the British lender’s advisory programmes charged fees to more than 2,000 clients for services that were not performed as sold. These included advisory clients who invested in third-party investment managers and investment strategies which under-performed while they were not monitored, the SEC said. \nThe bank also allegedly collected excess charges on the sales of investment funds from 63 brokerage clients by recommending more expensive share classes when less expensive options were available, while another 22,138 accounts overpaid due to alleged miscalculations and billing errors by the firm. Without admitting or denying the findings, Barclays agreed to set up a fund, including a $30m (£23m) penalty, to repay the clients. \nCatherine O’Riordan, co-chief of the SEC Enforcement Division’s Asset Management Unit, said: “Barclays failed to ensure that clients were receiving the services they were paying for. \n“Each set of clients who were harmed are being refunded through the settlement.” \nA spokesman for Barclays declined to comment. Barclays bank Coreena Ford Fashion firm SuperGroup gets a boost from plunging pound \nSuperGroup has reported a bumper rise in revenues after enjoying a boost from the plunging pound. The company behind fashion retailer Superdry said that full-year sales rose 27.2% to £750.6m, with currency benefits accounting for a third of its growth. \nSuperGroup has operations in Europe, the US and China, as well as the UK. Like-for-like sales were up 12.7% in the period and the board anticipates that full-year profit will be in the range of £86m and £87m, in line with market expectations. \nChief executive Euan Sutherland said: “2017 has seen another good year of sales and profit growth. \n“This has been achieved by improving our product ranges and introducing new categories to excite, inspire and maintain the brand’s relevance while, in parallel, investing in our development markets and improving our infrastructure.” \nSuperGroup, which has 555 stores globally including Newcastle, Gateshead, Sunderland, Middlesbrough and Durham, added that a strong online performance and improving store sales has seen it break even in the US. Superdry owners SuperGroup, which has stores at intu Eldon Square and intu Metrocentre, are benefiting from the weak pound (Photo: Hasselblad H5D) 8.35 KEY EVENT PwC slapped with £5m fine \nBritain’s accountancy watchdog has slapped PwC with a £5m fine for “misconduct” in relation to its 2009 audit of Connaught. \nThe Financial Reporting Council (FRC) said that PwC and Stephen Harrison, a retired audit partner at the firm, have been “severely reprimanded” following an investigation. \nMr Harrison has been fined £150,000. \nThe reprimands relate to PwC’s audit of Connaught, a FTSE 250 company which went into administration in 2010. \nThe misconduct charge relates to three audit areas - mobilisation costs, long-term contracts and intangible assets. \nPwC has also been ordered to pay the FRC’s legal costs and to make an interim payment on account of £1.5m. pwc logo", "external_links": [], "published": "2017-05-11T15:30:00.000+03:00", "crawled": "2017-05-11T11:08:49.000+03:00", "highlightTitle": ""}