{"organizations": [], "uuid": "d7bd30718f876a2a1662d08745b73d4b692b8093", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13094423.ece/ALTERNATES/s1200/Deadly-Blast-Kills-22-at-Manchester-Arena-Pop-Concert.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/love-mcr-its-time-embrace-13094425", "country": "GB", "domain_rank": 21960, "title": "We Love MCR: It's time to embrace our Northern cousins", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-26T02:39:00.000+03:00", "replies_count": 0, "uuid": "d7bd30718f876a2a1662d08745b73d4b692b8093"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/love-mcr-its-time-embrace-13094425", "ord_in_thread": 0, "title": "We Love MCR: It's time to embrace our Northern cousins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A giant TV screen displays the 'We Love Manchester' logo (Photo: Getty Images Europe) Share Get business   Thank you for subscribing! Could   \nIn my first job in journalism, I occasionally reported on a parish council in Northumberland that covered two tiny villages a few miles from each other. \nEvery time a councillor from Village A suggested something be done in his community, a councillor from Village B would object until his community got something of equal or higher value. The intense rivalry of these two tiny places, each not big enough to support a parish council of their own, was obvious, if slightly pathetic. \nYou can see that same rivalry between Newcastle and Sunderland, between Northerners and Southerners, between England and other countries, and it can all be summed up in the deadpan headline I once saw in an American magazine: “The Sports Team from my Area is Superior to the Sports Team from your Area”. \nIt always amazes me that when the Ryder Cup comes around every two years, sports fans can support an entire continent, yet will return to hating that lot down the road the next day. \nI’m not immune to this. For many years I had the typical Northern chippiness about London. But when I was last in the capital I saw a multi-racial, cosmopolitan city that elected a Labour mayor and voted against Brexit. It was a tad chastening to recognise that London reflects pretty much everything I stand for. Read More Cruise ships set to put £50m into North East economy, study shows \nAnd it occurred to me this week that many people in the North East have been grumbling about Manchester getting all the benefits from the Northern Powerhouse, but this week we have stood in solidarity with the the largest city in the North. \nI have visited Manchester a number of times in recent years, occasionally for work and sometimes for pleasure, including a trip to a concert much like that made by Ariana Grande fans from the North East. \nIt shouldn’t take a horrific act for us to realise that we have more in common with our friends in Manchester than that which separates us. \nThere’s nothing wrong with trying to get the best for your community, whether it’s a region like the North East or a little village in rural Northumberland. But maybe what we can learn from this horrible week is that we can do that without having to grumble about other places being better off than us. Read More Newcastle lawyer scoops award after launching LGBQT legal teams \nIt would be good too if the positivity that has followed Monday’s tragedy had a permanence to it. \nThe public response to some other recent tragedies - the deaths of Alan Kurdi and Jo Cox, for example - was for many people to row back on some of the more extreme rhetoric that has surrounded migration. But a few months on, many resorted to type. \nThis time we should do better. Like us on Facebook", "external_links": [], "published": "2017-05-26T02:39:00.000+03:00", "crawled": "2017-05-25T22:27:27.000+03:00", "highlightTitle": ""}