{"organizations": [], "uuid": "76dd86e7e9d8a4f6c045387cdc2883aae56a7b3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11855202.ece/ALTERNATES/s1200/CFR_NJL_060916countyhotel_04.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13084547", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Newcastle County Hotel £8m transformation plan unveiled", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-25T15:05:00.000+03:00", "replies_count": 0, "uuid": "76dd86e7e9d8a4f6c045387cdc2883aae56a7b3c"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13084547", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Newcastle County Hotel £8m transformation plan unveiled", "locations": [], "entities": {"persons": [{"name": "gainford", "sentiment": "none"}, {"name": "jim gillon", "sentiment": "none"}, {"name": "coreena ford gateshead", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "bar livello", "sentiment": "none"}, {"name": "estelle blanks", "sentiment": "none"}, {"name": "khaliq", "sentiment": "none"}, {"name": "jill mcdonald", "sentiment": "none"}, {"name": "aveika", "sentiment": "none"}, {"name": "tim warrillow", "sentiment": "none"}, {"name": "peter mccusker", "sentiment": "none"}, {"name": "charles rolls", "sentiment": "none"}, {"name": "simon arora", "sentiment": "none"}], "locations": [{"name": "vermont hotel", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "zappatista", "sentiment": "none"}, {"name": "hudson", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "park road", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "vermont aparthotel", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "financecamp north east", "sentiment": "none"}, {"name": "ramside hall", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}], "organizations": [{"name": "newcastle county hotel", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "negative"}, {"name": "b&m", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "halfords", "sentiment": "none"}, {"name": "coreena ford halfords", "sentiment": "none"}, {"name": "newcastle central station", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "energy centre", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "gainford group  impressive", "sentiment": "none"}, {"name": "gainford group", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Grey Street Hotel owners in Newcastle unveil beauty retreat as part of £1.2m investment \nMore hotel news now, and this time it’s the Grey Street Hotel’s £1.2m investment into its facilities that is being unveiled. \nOwners the Malhotra Group has opened All ABout You, an urban beauty retreat at the Grade II-listed Grey Street Hotel. \nThe spa is offering everything from facials and massages, to pedicures and spray tans to women – and men – in need of a daytime, post work or pre-night out boost. \nOwner Elaine Beattie said the venue, which comprises three treatment rooms, a nail bar, a pedicure station and a make-up area on a mezzanine level – is the perfect place in which to end the day and prepare for the evening – or visit as part of a day trip to town. \nAll About You is the latest stage of a £1.2m development programme at Grey Street Hotel previously announced by the group which has included the refurbishment of its 49 bedrooms, the extension and development of the hotel’s main conference room to hold more than 100 people and a smaller meeting room to hold five people. \nOperations director, Atul Malhotra, said: “These refurbishments and the creation of All About You have helped Grey Street Hotel regain its position as the most elegant hotel in the city. \n“We are delighted with the re-development and very excited for the future.” The All About You treatment spa has opened at Grey Street Hotel 9.10 Coreena Ford Late Easter holiday blamed for 18% fall in car production last month \nCar production fell by almost a fifth last month compared to a year ago, but the outlook for the industry is still positive, a report shows. \nAround 122,000 cars were built, 18% fewer than April 2016, with the reduction blamed on the late Easter bank holiday. \nThe Society of Motor Manufacturers and Traders (SMMT) said car production in the year so far remained strong at almost 600,000, up 1% on the same period last year, and the highest level for the first four months of the year since 2000. \nDemand from overseas buyers was up by 3.5%, offsetting a 7% fall in the home market. Almost four out of five cars made in the UK this year have been shipped overseas, mainly to European Union countries. \nMike Hawes, chief executive of the SMMT, said: “Car production fell significantly in April due to the later Easter bank holiday weekend which reduced the number of active production days that month and also due to unplanned production adjustments. \n“Overall, British car manufacturing remains in good health with the production outlook still very positive and significant new models due to go into UK production shortly.” Workers at Nissan's plant in Sunderland 9.05 Coreena Ford Cramlington-based budget holiday company Sunshine.co.uk sold for £12m \nBudget holiday company Sunshine.co.uk has been sold to a rival business for £12 m a decade after the business launched. \nThe Cramlington-based firm has been bought by rival holiday company On The Beach plc, a listed company based in Cheadle, near Manchester, which is one of the UK’s biggest online travel companies. \nSunshine.co.uk specialises in low-cost holidays, as well as car hire and airport transfers. It was founded in 2007 and was recently named as one of the fastest-growing businesses in the North East in the Ward Hadaway Fastest 50. \nSimon Cooper, chief executive of On the Beach Group plc, said: “We are delighted to have acquired a brand as well established with beach holidaymakers as Sunshine.co.uk. \n“This earnings enhancing transaction reflects the board’s ambition to consolidate On the Beach’s leading position in the online beach holiday space, while supporting our drive to exclusivity and underpinning our ability to further leverage our scale.” \nSunshine reported gross assets of £18.6m last year and an EBITDA of £1.6m. The deal is expected to add an additional 200,000 customers to On the Beach’s business, which currently serves around 1.2m people a year. \nThe sale completed on May 20 and led to On The Beach’s share price jumping from 360.25p to 379.5p overnight. The company’s share price currently stands at 389.25p. Holidaymakers on a beach (Photo: PA) 9.00 Coreena Ford Travelodge looks to fill 1,000 jobs \nLeading hotel chain Travelodge is looking to fill 1,000 vacancies in the coming months, ranging from managers and receptionists to bar staff and cleaners. Around 700 jobs are permanent, while the rest are for the summer period, combining full and part-time positions. \nTravelodge, which has 544 hotels, says it has an in-house management development programme that has helped hundreds of employees climb the career ladder. A sign on a Travelodge hotel (Photo: Nick Ansell/PA Wire) 8.55 Coreena Ford Petrofac chief Marwan Chedid suspended amid fraud probe \nOil services firm Petrofac has suspended its chief operating officer, Marwan Chedid, following a corruption and bribery probe by Britain’s fraud squad. \nThe Serious Fraud Office (SFO) announced earlier this month that it is investigating the firm’s activities under suspicion of “bribery, corruption and money laundering” in relation to oil contractor Unaoil. \nAs a result, Petrofac said this morning that Mr Chedid and chief executive Ayman Asfari had been arrested by the SFO and later released without charge. \nMr Chedid has now been suspended and, as a consequence, resigned from the board. \nMr Asfari will continue in his role, although he will not be involved in any matters connected to the investigation and will have “no role or responsibilities for engaging with or liaising with agents and consultants”, Petrofac said. \nChairman Rijnhard van Tets said: “These decisions signal the board’s determination to co-operate fully with the SFO and its investigation, whilst ensuring Petrofac continues to deliver for its clients.” \nPetrofac has also formed a committee to engage with the SFO and has mandated an “external specialist” to oversee the company’s management of and response to the investigation. 8.50 KEY EVENT Has your company made the CIPD North East Awards 2017 shortlist of finalists? \nTHE judges have met, deliberated and judged – and now the shortlist of 21 finalists for this year’s CIPD North East of England HR&D Awards can be revealed. \nThe awards, delivered in association with The Journal and associate sponsors Nigel Wright Recruitment, feature seven categories spanning everything from learning and development, health and fitness, diversity and more. \nFinalists from across the North East will gather on June 22 at the Newcastle Marriott Hotel, Gosforth Park, to find out if they are among the winners. \nThe co-chairs of CIPD North East, Elouise Leonard Cross and Sarah Carnegie, said: “The awards focus on building awareness of the profession and the growing importance of those working in all areas of HR and Learning & Development. \n“They celebrate the innovation and good practice happening in the North East, having the opportunity to highlight the people, teams and organisations leading the way. \n“Providing a platform to recognise the great practice and positive outcomes of HR&D professionals is important, and the HR&D Awards allow us to do this in style. \n“Since the awards were established we have enjoyed the company of over 3,500 people at the evening dinners and celebrated the achievement of 82 winners. \n“We have a great line-up of finalists for the 2017 awards and we are looking forward to being able to celebrate the achievements of all the 2017 winners.” The CIPD Awards at the Marriott Hotel in Newcastle last year - the 2016 winners on stage with Sarah Carnegie and Elouise Leonard-Cross of CIPD (Photo: Newcastle Journal) 8.45 Coreena Ford Fever Tree co-founder toasts £73m windfall after selling a company stake \nOne of the founders of posh mixer maker Fever-Tree is celebrating a £73m windfall after cashing in on the firm’s recent success by selling a stake in the group. \nDeputy chairman Charles Rolls offloaded a 3.9% stake - almost doubling the number of shares he originally intended to sell after “significant” demand from institutional investors, according to the group. \nHe sold 4.5 million shares at a price of £16.25 each. \nIt comes after the tonic water group has seen its share price rise more than 900% since its stock market flotation in late 2014. \nShares in the group have risen more than 50% this year alone. \nMr Rolls continues to own an 11.2% stake in the company following the share sale. Charles Rolls, left, and Tim Warrillow of Fever Tree mixer company. Mr Rolls has sold a 3.9% stake in the firm. 8.40 Coreena Ford FinanceCamp brings investors to the North East to boost growing companies \nDozens of investors from around the country came to an event in the North East to offer finance to companies in the region looking to expand. \nFinanceCamp North East took place at Ramside Hall in Durham, with 90 businesses from the region getting meetings with funding bodies from around the UK, including venture fund managers, angel investors, banks, social investment funders and crowdfunding platforms. \nA number of investors from outside of the region attended for the first time, adding further expertise to returning and regional investors and helping to bridge the North-South funding gap. \nFinanceCamp organises hundreds of meetings with businesses and investors, with entrepreneurs, established businesses and social enterprises looking for everything from a £1,000 start-up loan to multi-million equity funding. \nEstelle Blanks, deputy director of event organisers Innovation SuperNetwork, said: \nIn the North East we are acutely aware of the need to improve access to finance for businesses with the talent and ambition to grow, and that’s where FinanceCamp comes in. \nWe make it easy for them to meet with a series of investors matched to their needs, and the overwhelming response we’ve had from those registered is proof the format works for businesses and investors alike. Estelle Blanks - Deputy Director of the Innovation SuperNetwork, organiser of FinanceCamp (Photo: publicity handout) 8.35 Coreena Ford Gateshead heads energy revolution with massive 'battery' powering Sage and Baltic \nThis week’s energy feature by Peter McCusker looks at a council-led project which will see buildings in Gateshead getting cheaper energy bills thanks to a ground-breaking scheme. \nAt 4pm every weekday the two massive batteries based in the corner of a Gateshead Council depot on Park Road will click into operation, delivering electricity to high-profile Tyneside buildings including The Sage and the Baltic. \nThe batteries can store and release up to 3MW of electricity, which is equivalent to the output of one million standard AA batteries. This electricity will have been generated more cheaply in Gateshead’s Energy Centre earlier in the day. \nThey are connected to these iconic Tyneside buildings, and others, through a newly created network of ‘private’ electricity wires – alongside a similar new network of heat pipes –following an £18m investment by Gateshead Council. \nThose connected to the network are set to achieve to significant savings of around 5% on electricity bills and 10% on heat bills every year – and plans are under way to explore similar schemes at the MetroCentre and the Team Valley. \nJim Gillon, energy services manager at Gateshead Council, said: “The council sees the development of a low-carbon energy resource as key to meeting our climate change goals, but also in generating vital revenues to support our public services such as schools and social care. \n“The energy centre, and the new battery storage facility, are key developments in supporting these ambitions, that will both generate income for the council, as well as saving up to £200,000 in energy costs per year for the initial customers.” Gateshead energy storage unit (Photo: Copyright unknown) 8.30 Coreena Ford B&M ramps up expansion plans after profits soar \nDiscount retailer B&M has reported soaring full-year profits and is ramping up expansion plans as it prepares to cash in on a slowing economy and a squeeze in consumer spending. \nThe group said that pre-tax profit rose 18% to £182.9 million in the year to March 25, while revenue rocketed 19% to £2.4 billion. \nLike-for-like sales in the UK increased 3.1% and B&M said that it now plans to open 950 stores in the UK, up from its previous target of 850. \nB&M currently has 537 outlets in the UK and the extra 100 stores will create around 5,000 new jobs. \nThe firm said that trading this year had got off to an “excellent start”, adding that 40 to 50 new stores are slated to open in the UK over the next 12 months at a rate of one a week. \nChief executive Simon Arora said a faltering economy and soaring inflation eating into household budgets means B&M is well positioned to grow further. \nHe said: \nFor many commentators, the current economic uncertainty is generating concern about UK consumers and the impact on the retail sector. \nAt B&M we know we are at our best when household budgets are under pressure and consumers are looking even harder at making savings. \nIn an environment of rising prices, we think that consumers become even more receptive to discount propositions such as ours. \nWe are therefore confident that the business is well-positioned to deliver further growth in the year ahead, even in an uncertain political environment or challenging economy. \nShoppers have had to stomach rising prices as the slump in sterling following the Brexit vote has meant soaring import costs for retailers, which have then been passed on to consumers - and discount retailers such as B&M tend to thrive in such conditions. B & M are set to create 5,000 new jobs through store openings 8.25 Coreena Ford Halfords reports 10.5% drop in full year profits \nRetailer Halfords has posted a 10.5% fall in annual profits as it took a hit from the weak pound and saw the timing of Easter knock recent sales. \nThe car parts-to-bicycles chain reported pre-tax profits of £71.4 million for the year to March 31, down from £79.8 million a year earlier, as the pound’s plunge since the Brexit vote sent the costs of imported goods surging by £14 million. \nIt also revealed a 1.2% drop in like-for-like retail sales in the final three months due to the later timing of Easter this year. \nBut the group said retail sales were 3.9% higher on a more comparative basis for the 15 weeks to April 28. \nOutgoing chief executive Jill McDonald - who is leaving in October to head up Marks & Spencer’s clothing, home and beauty business - said: “Profit performance for the year was impacted by the weaker pound, but our plans are well developed and I am confident this will be offset over time.” \nHalfords warned the weak pound will continue to impact profits, but said plans to offset the cost pressures were “encouraging”. 8.15 What's the FTSE 100 and pound latest? \nThe FTSE-100 index opened at 7514.90. \nThe pound at 8am was 1.2982 dollars compared to 1.2934 dollars at the previous close. The euro at 8am was 0.8651 pounds compared to 0.8635 pounds at the previous close. (Photo: PA) KEY EVENT North East cool offices 2017: here's where you should work \nComing to work isn’t meant to be fun, that’s why we get paid to do it - or so people used to believe. \nThese days discerning employers know that boosting staff morale can do wonders for attracting and retaining staff, and for helping boost productivity. \nCompanies have a number of ways of making work more fun, and one of them is through having nice offices. \nTwo years ago The Journal singled out the region’s 10 best offices, highlighting workplaces with great views, fancy boys’ toys and unusual settings being used by companies large and small to make the world of work a bit less mundane. These are some of the coolest workplaces in the region 8.00 KEY EVENT Newcastle County Hotel's £8m transformation plan is unveiled by Gainford Group \nImpressive plans to invest £8m into The County Hotel in Newcastle have been unveiled by the hotel’s owners, Gainford Group. \nThe company, which already operates the successful Vermont Hotel and Vermont Aparthotel on Newcastle Quayside, together with late night venues Aveika and Bar Livello, acquired the landmark property opposite Newcastle Central Station in a £12m deal last year. \nNow the growing leisure group, which employs more than 2,000 people, has revealed it will create around 100 jobs through a detailed transformation of its leisure, conferencing and accommodation facilities, involving Space ID architects. \nThe first to be seen by the public will be introduction of a new cocktail bar and all day eatery called The Hudson, set to open in July. \nA further 20 high-end suites including living space overlooking the city will also be created and Gainford plan to introduce a secondary private entrance, private parking and 24hr butler and concierge service for these suites. \nThree new function areas are also being introduced, to provide facilities for weddings and other ceremonies, conferences and parties and private dining. \nDirectors at the firm say more than 100 jobs will be created though employment and fit-out as part of these changes. \nThe group, run by the Khaliq family, want to install the hotel as a “jewel in the crown” for the city and the deal also included 10 retail units within the building as well as the 114-bed hotel, let to tenants including Starbucks, Zappatista and Bowyers of Newcastle, all of whom will remain. \nNow the firm has revealed that the remaining three empty retail units close to the main entrance, which have lain empty for more than two years, have been let to businesses. \nA spokesman for the hotel owners said: “Gainford Group is a family run organisation that is proud of our North East roots and weare delighted to start work on this landmark hotel in the heart of Newcastle city centre.” The County Hotel is set for impressive changes (Photo: Gainford Group) Share", "external_links": [], "published": "2017-05-25T15:05:00.000+03:00", "crawled": "2017-05-25T10:51:46.000+03:00", "highlightTitle": ""}