{"organizations": [], "uuid": "75101d8535075c5a2da67e72bfb8a4b38b484b8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30361339/16022614.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/devon-midwife-asks-theresa-may-to-justify-chronic-under-funding-of-hospitals/story-30361339-detail/story.html", "country": "GB", "title": "Devon Live published Devon midwife asks Theresa May to justify 'chronic under-funding...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-30T18:07:00.000+03:00", "replies_count": 0, "uuid": "75101d8535075c5a2da67e72bfb8a4b38b484b8b"}, "author": "Devon Live", "url": "http://www.devonlive.com/devon-midwife-asks-theresa-may-to-justify-chronic-under-funding-of-hospitals/story-30361339-detail/story.html", "ord_in_thread": 0, "title": "Devon Live published Devon midwife asks Theresa May to justify 'chronic under-funding...", "locations": [], "entities": {"persons": [{"name": "devon live", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "devon live | poste", "sentiment": "none"}, {"name": "clarke", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "paxman", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "kenneth clarke", "sentiment": "none"}, {"name": "jeremy paxman", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "national health service", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon midwife asks Theresa May to justify 'chronic under-funding' of hospitals By Devon Live | Posted: May 30,   Theresa May and Jeremy Corbyn went head to head Devon midwife asks Theresa May to justify 'chronic under-funding' of hospitals X \nCopy link to paste in your message / Comments (0) \nTheresa May was asked to justify the \"chronic under-funding\" of hospitals by a Devon midwife on live TV on Monday night. \nMrs May and Labour leader Jeremy Corbyn were being questioned separately by studio audiences and interviewed by Jeremy Paxman in a Sky News/Channel 4 \"Battle for Number 10\" broadcast, after the Prime Minister refused to go head-to-head with other party leaders in a debate. \nTheresa May was asked to justify the \"chronic under-funding\" of hospitals by a Devon midwife on live TV on Monday night. \nMrs May, in her reply, said: \"We're making greater demands on the health service every year, the overall figure we're spending over the five years up to 2020 will be half a trillion pounds in total on the National Health Service, and we do need to make sure that money is being spent well. \n\"So we are increasing the funding to the health service and will increase funding to the health service in the future - and we're committed to that in our manifesto, both in terms of buildings and technology but also in terms of increasing the per head funding for the National Health Service in real terms every year.\" \nResponding to Mrs May's comments on the NHS, her questioner said: \"I see a lot of efficiency savings that are actually cuts. I see hospitals closing. I see staff that are at their wits' end because they can't give the care that they want to give. I will believe it when I see it.\" \nTheresa May has insisted she is providing police with the resources and powers they need, after she was confronted by a serving officer on live TV about \"devastating\" cuts during her time as home secretary. \nBut the Prime Minister did not provide an answer to a request from the officer, whose name was given as Martin, for a specific number of additional officers which she would recruit if re-elected in the June 8 general election. \nMrs May and Labour leader Jeremy Corbyn were being questioned separately by studio audiences and interviewed by Jeremy Paxman in a Sky News/Channel 4 \"Battle for Number 10\" broadcast, after the Prime Minister refused to go head-to-head with other party leaders in a debate. \nIn response to the policeman's question, Mrs May acknowledged that numbers of police in England and Wales had fallen by around 20,000. \nBut she said: \"What we had to do when we came into government in 2010 was to ensure that we were living within our means and that was very important because of the economic situation we had inherited. \n\"It's not just about the numbers of police - people often focus on the numbers of police. It's actually about what the police are able to do and how they are being deployed on our streets. \n\"In counter-terrorism policing we have protected those budgets and we are currently protecting police budgets. \n\"But crime is changing and the sort of job that the police officers need to do is changing. That's why we are also putting extra money into things like cyber-crime, because that's today's world. \n\"A government has to ensure that we are keeping abreast with the changes that take place, with the challenges out there that we need to deal with. \n\"Of course the terrorist threat is severe, but that's why we ensure that our police, our security service have that counter-terrorism budget and we are increasing the budgets for our security services, but also that they have the powers they need to do the job.\" \nMartin responded: \"I appreciate you are protecting the budgets, but we still need the staff to carry out the role of the police officer of keeping the public safe.\" \nMrs May was pressed about the Conservative Party's social care plans, dubbed the \"dementia tax\", with one elderly audience member asking: \"Why should we in my generation vote for you?\" \nThe PM said the UK faces the challenge of an ageing society, adding about her party's proposals: \"It's about ensuring that nobody is going to have to sell their house to pay for care in their lifetime. \n\"It's about ensuring that £100,000 of savings and assets are protected to pass on to their family. \n\"We will put an absolute cap on the level of money that people have to spend on care. \n\"And I think what we're doing is ensuring we can have a sustainable solution for the long-term.\" \nAsked about plans to means-test winter fuel payments, Mrs May said she did not want to \"pull out a figure\" during an election campaign but \"listen to people, talk to people, to take people's views and then make a proposal as government\". \nShe said: \"So there's a proper consultation so we're actually hearing from voters, hearing from organisations and charities and others who work with older people about what they think is the right level to set that threshold for winter fuel payments. \n\"The key principle that would drive what we do is less well-off pensioners will be protected.\" \nMrs May was challenged whether her boasting about Kenneth Clarke's description of her as a \"bloody difficult woman\" risked returning the Tories to the \"nasty party\" image which she fought against in the past. \nShe said that Mr Clarke had use the term because \"he saw me as somebody who stood by what I thought was right and was willing to fight for what I believe is the right thing to do\". \nMrs May added: \"That's what drives me. Doing what is the right thing by the country. Sometimes you have to be difficult in order to do that. \n\"But if I look at what is coming ahead for this country, we stand at a very important moment in our history. \n\"We have the opportunity now to really change this country for the better for the future.\" \nThis involved not only conducting the Brexit negotiations, but also dealing with domestic issues like the ageing population, divisions within society, changing technology and economic growth, she said. \n\"We need to have a government that is open about these things and is willing to find ways of addressing them,\" she said. \n\"If in order to address them and do the right thing by the country, it takes being a difficult woman, then that's exactly what I will be.\" \nShe added: \"Some of them will involve difficult choices, but I think it's right if I'm saying to people I want a mandate to be prime minister and have the government of this country, that we are open with people and say there will be hard choices.\" \nMrs May, asked about protecting schools funding in real terms per pupil, said: \"Nobody can guarantee the real terms per pupil funding increase. \n\"In the Labour Party's manifesto we know the figures don't add up.\" \nThe PM was heckled by some audience members, with one heard saying: \"You've clearly failed.\" \nMrs May went on: \"What we need to do is to ensure we will put those record levels of funding into schools, we need to ensure we get that better spread of funding in terms of the fair funding formula.\" \nThe PM also faced questions about the NHS, with a Devon midwife asking her to justify the service's \"chronic under-funding\". \nMrs May, in her reply, said: \"We're making greater demands on the health service every year, the overall figure we're spending over the five years up to 2020 will be half a trillion pounds in total on the National Health Service, and we do need to make sure that money is being spent well. \n\"So we are increasing the funding to the health service and will increase funding to the health service in the future - and we're committed to that in our manifesto, both in terms of buildings and technology but also in terms of increasing the per head funding for the National Health Service in real terms every year.\" \nResponding to Mrs May's comments on the NHS, her questioner said: \"I see a lot of efficiency savings that are actually cuts. I see hospitals closing. I see staff that are at their wits' end because they can't give the care that they want to give. I will believe it when I see it.\" \nMrs May was repeatedly pressed by Mr Paxman if she had changed her mind on Brexit after she supported Remain during last year's referendum campaign. \nShe replied: \"I also said that the sky wouldn't fall in if we left the European Union.\" \nShe added: \"I believe that we are doing the right thing in making a success of Brexit.\" \nMrs May defended the proposed changes to the funding of social care saying the previous plans protected wealthier pensioners but did nothing for those on modest incomes. \n\"The proposals I have put forward actually do that. They protect pensioners on modest incomes and crucially they ensure we have a long-term sustainable solution for social care,\" she said. \nMr Paxman challenged Mrs May over how her plan to protect the value of inherited estates by imposing a cap on social care costs would help the \"just about managing\" people she has said she wants to support. \nShe replied: \"If you have a social care system which relies on taxing those just about managing at higher levels, that's not helping them. \n\"What we are doing is putting forward a proposal which means that people don't have to sell their house in their lifetime to pay for care. \n\"It means they can pass on savings to their children. And it means there will be that cap. \n\"But it's fair across the generations.\" \nShe accepted that she had backed down earlier this year over proposed hikes on national insurance contributions by the self-employed. \nMr Paxman said: \"What one's bound to say is that if I was sitting in Brussels and I was looking at you as the person I had to negotiate with, I'd think 'she's a blowhard who collapses at the first sign of gunfire'.\" \nMrs May responded: \"I think, Jeremy, you will find that what the people in Brussels look at is the record I had of negotiating with them in Brussels and delivering for this country on a number of issues on justice and home affairs which people said we were never going to get, and I got those negotiations.\" \nThe studio audience applauded loudly when Mr Paxman pointed out that Mrs May and her spokesmen had promised on six occasions since becoming Prime Minister that there would not be a general election before 2020. \nMrs May said that when she arrived at Number 10 she felt the most important thing was to maintain \"stability\" in order to get on with the Brexit negotiations, but that she had found that other parties wanted to \"frustrate\" the process. \nAnd she said: \"What became clear and is increasingly clear in this election, is the desire of other parties to frustrate the will of the British people. \n\"That's why I thought it was right to call an election.\" \nMrs May was told by Mr Paxman it was \"her job\" when home secretary to deal with immigration, with the PM replying: \"There is no single moment where you take one measure which changes the immigration figures. \n\"It's a constant work to ensure you're dealing with immigration and ensuring there is no more abuse in the system. There's more work to be done. \n\"We will of course have another tool to do this when we leave the European Union as we'll be able to introduce rules for people coming within the European Union.\" \nMrs May was also challenged several times over how much the UK is prepared to pay Brussels as part of Brexit. \nShe said: \"It isn't a question of what it's worth paying to get out, it's a question of what is going to be the right deal for us to leave the European Union, which will stop us from paying huge sums of money into the EU every single year, which will enable us to have control of our money, of our borders and our laws.\" \nMrs May also repeated her \"no deal is better than a bad deal\" slogan when asked if she was prepared to walk away from Brexit talks. \nMr Paxman said: \"So you are prepared to walk away?\" \nMrs May replied: \"I think you have to. In negotiations you have to recognise that you're not in there to get a deal at any price. \n\"We're in there to get the best deal for the United Kingdom, and actually I'm optimistic about that because I think in the European Union they want to continue their relationship with us as well.\" \nMr Paxman remarked: \"You can be as optimistic as you like but you might have to walk away from it.\" \nMrs May said: \"What I'll be doing is being a difficult woman and ensuring we're negotiating hard.\"", "external_links": [], "published": "2017-05-30T18:07:00.000+03:00", "crawled": "2017-05-30T13:58:37.000+03:00", "highlightTitle": ""}