{"organizations": [], "uuid": "adf81c7bd3851acb817de1c68cd0120901d2eb84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13039983.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/offer-hope-tories-offer-fear-13039891", "country": "GB", "domain_rank": 21960, "title": "We offer hope while the Tories offer fear, says Jeremy Corbyn as Labour launch manifesto", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-16T05:30:00.000+03:00", "replies_count": 0, "uuid": "adf81c7bd3851acb817de1c68cd0120901d2eb84"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/offer-hope-tories-offer-fear-13039891", "ord_in_thread": 0, "title": "We offer hope while the Tories offer fear, says Jeremy Corbyn as Labour launch manifesto", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "tories", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "invalid email  labour", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "north east  and labour", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We offer hope while the Tories offer fear, says Jeremy Corbyn as Labour launch manifesto D-Day for Jeremy Corbyn as Labour launches its general election manifesto a week after a major leak Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour leader Jeremy Corbyn will offer “a responsible programme of hope” when he launches his party’s election manifesto on Tuesday. \nAnd he will accuse his Conservative opponents of peddling “fear”. \nIn a cutting attack on Prime Minister Theresa May and her colleagues, Mr Corbyn will insist: “The Tories are still the nasty party. The party of prejudice, the party of the rich, the party of the tight-fisted and the mean-spirited.” \nHe will stress that Labour’s radical plans, including a huge cash boost for the NHS and investment in infrastructure projects such as major transport schemes, have been fully costed. \nMr Corbyn will say: “It will change our country while managing within our means”. Labour Party Leader Jeremy Corbyn (Photo: PA) \nAnd he will insist that Labour can win the general election on June 8, saying: “I am confident that once the people of Britain have the chance to hear our promises and plans, they will decide now is the time for Labour.” \nLabour’s manifesto launch comes after a draft version of the document was leaked last week. It included plans to bring railways back into public control, cap fuel bills and create regional energy companies to compete with private sector firms. \nThe draft manifesto also included plans to for 20:1 limit on gap between the lowest and highest paid workers in companies given Government contracts - so that the highest-paid staff can’t get more than 20 times as much as the lowest-paid. \nThere were plans to invest to build one million new homes, including 100,000 council and housing association homes. Read More Voting survey reveals the Conservatives could take safe Labour seat in the North East \nAnd Labour has also said it will provide an extra £37 billion for the NHS over five years, paid for partly by increasing tax on people earning more than £80,000. \nMr Corbyn will challenge Mrs May to take part in a TV debate where both leaders defend the manifesto plans. She has already ruled out appearing in a debate alongside the Labour leader. Prime Minister Theresa May speaks to party supporters as she campaigns in the North East of England (Photo: Getty Images Europe) \nHe will say: “Prime Minister, come out of hiding and let’s have that debate on television so millions can make up their minds. \n“What are you afraid of? It’s not too late. Let’s debate our two manifestos. Have the argument.” \nAnd he will attack Mrs May’s record in Government, saying: “For the last seven years, our people have lived through the opposite – a Britain run for the rich, the elite and the vested interests. \n“They have benefitted from tax cuts and bumper salaries while millions have struggled and been held back. \n“Whatever your age or situation, people are under pressure, struggling to make ends. Our manifesto is for you. \n“Parents worrying about the prospects for their children and anxious about the growing needs of their own elderly parents. Read More Brexit, the NHS and unemployment - key issues for North East voters in the General Election \n“Young people struggling to find a secure job and despairing of ever getting a home of their own. \n“Children growing up in poverty; students leaving college burdened with debt; workers who have gone years without a real pay rise coping with stretched family budgets.” \nLabour’s mission is to change all that over five years, Mr Corbyn will say. \n“Our manifesto spells out how – with a programme that is radical and responsible. \n“It’s a programme that will reverse our national priorities to put the interests of the many first. It will change our country while managing within our means. \n“And it will lead us through Brexit while putting the preservation of jobs first.” \nMr Corbyn will claim: “This is a programme of hope. The Tory campaign, by contrast, is built on one word: fear.” Like us on Facebook", "external_links": [], "published": "2017-05-16T05:30:00.000+03:00", "crawled": "2017-05-16T00:36:16.000+03:00", "highlightTitle": ""}