{"organizations": [], "uuid": "c2297ade315b13ed63c4c96fca3775be9ac66652", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.liverpoolecho.co.uk/incoming/article12806257.ece/ALTERNATES/s1200/JS115010785.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-secretary-david-davis-determined-13108228", "country": "GB", "domain_rank": 21960, "title": "Brexit Secretary David Davis on why he is determined to get a good deal for Nissan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-29T23:00:00.000+03:00", "replies_count": 0, "uuid": "c2297ade315b13ed63c4c96fca3775be9ac66652"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-secretary-david-davis-determined-13108228", "ord_in_thread": 0, "title": "Brexit Secretary David Davis on why he is determined to get a good deal for Nissan", "locations": [], "entities": {"persons": [{"name": "davis sai", "sentiment": "negative"}, {"name": "david davis", "sentiment": "negative"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "andrew matthews/pa wire", "sentiment": "none"}, {"name": "tim bell", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "mrs thatcher", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "nissan news brexit", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "nissan qashqai", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Brexit Secretary David Davis on why he is determined to get a good deal for Nissan Mr Davis said the Government planned to negotiate a customs agreement as well as a free trade agreement with the EU Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBrexit Secretary David Davis has pledged the Government is working to negotiate customs agreements that will benefit Sunderland ’s Nissan plant as the UK prepares to leave the EU. \nThe car giant has expressed concern about the impact of Brexit , and Mr Davis said talks had been going on with the car industry to ensure there was a deal that worked for them. \nA particular concern raised by Nissan has been the need to ensure car parts can be imported and exported easily between the UK and the EU. \nMr Davis said the Government planned to negotiate a customs agreement as well as a free trade agreement with the EU , to “minimise any administrative burdens at the borders and allow vehicle parts to cross borders.” Nissan (Photo: Andrew Matthews/PA Wire) \nHe said: “The main strategy is to maintain free and frictionless trade with the EU, while allowing us to do trade with the rest of the word on a freeer basis. \n“At the moment we do 58 per cent of our trade with the rest of the world, 42 per cent with the EU. \n“The aim is to hang on to as much of the 42 per cent as we can, all of it if we can, and expand on the 58 per cent. \n“That is the overall strategy. There is a very high chance of it working, for a very simple reason - we sell roughly £230bn a year to the EU and they sell £290bn a year to us. \n“Most countries are in a positive export position with us. So they want to maintain a trade relationship as much as we do. So the outcome in my view should be an optimistic one.” \n“The second element of it is the industrial strategy side. \n“We want to have an industrial strategy which encourages innovation, encourages job creation, and helps companies like Nissan, like Jaguar Land Rover, to develop. To improve their supply chain, improve their innovation rate and improve the competitiveness of their product. Nissan Qashqai (Photo: Handout) \n“Of course what we are seeing at the moment is a really sharp increases in exports. So its an optimistic picture.” \nMr Davis also said he believed the Tories are in with a good chance of winning seats in the North of England next week. He dismissed suggestions that the Conservative general election campaign has gone wrong - saying: “You have ups and downs in every campaign”. \nHe pointed out that Margaret Thatcher’s 1987 election campaign suffered a setback known at the time as “wobbly Thursday”, but she went on to win a landslide victory. Read More \nAsked why the Conservative campaign had gone wrong, he said: “I don’t think it’s gone wrong. \n“You have ups and downs in every campaign. \n“I have fought seven campaigns as an MP and quite a few before that, and every one has its bumpy bits. \n“Margaret Thatcher’s most successful campaign had a famous sort of Wobbly Thursday. These things happen.” \nA poll during the 1987 campaign showed the Tory lead over Labour down to 4 per cent, and concerned Mrs Thatcher handed the management of the campaign over to advertising guru Tim Bell. A week later, she was returned to power with a landslide majority of 102. \nMr Davis added: “Astonishingly, in places like Hartlepool. You wouldn’t have thought Hartlepool was a 50/50 call.” Like us on Facebook", "external_links": [], "published": "2017-05-29T23:00:00.000+03:00", "crawled": "2017-05-29T19:49:52.000+03:00", "highlightTitle": ""}