{"organizations": [], "uuid": "90130c73bbfd99e504554ca8fc46edb8e3846f85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13106861.ece/ALTERNATES/s1200/hedgehog-lab-founders-CEO-Sarat-Pediredla-left-and-Chief-Product-Officer-Mark-Forster.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-tech-firm-hedgehog-lab-13106725", "country": "GB", "domain_rank": 21960, "title": "Newcastle tech firm hedgehog lab named one of best in Europe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-29T18:10:00.000+03:00", "replies_count": 0, "uuid": "90130c73bbfd99e504554ca8fc46edb8e3846f85"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-tech-firm-hedgehog-lab-13106725", "ord_in_thread": 0, "title": "Newcastle tech firm hedgehog lab named one of best in Europe", "locations": [], "entities": {"persons": [{"name": "mark forster", "sentiment": "none"}, {"name": "david laws", "sentiment": "none"}, {"name": "sarat pediredla", "sentiment": "none"}, {"name": "sandra thompson  alex vieux", "sentiment": "none"}], "locations": [{"name": "europe newcastle", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "hyderabad", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "red herring", "sentiment": "none"}, {"name": "newcastle hq", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle tech firm hedgehog lab named one of best in Europe The app developer has made the Red Herring Top 100 Europe list after years of substantial growth Share Hedgehog Lab founders, CEO Sarat Pediredla, left, and chief product officer Mark Forster (Photo: Hedgehog Lab) Share Get business   Thank you for subscribing!   \nA Newcastle tech company has been named one of the best in Europe after a period of major growth. \nhedgehog lab, which develops apps, has been named on the Top 100 Europe list, which is compiled by technology website Red Herring to highlight the year’s most promising private technology ventures across Europe. \nThe list - which is based on a number of factors, including growth rate, innovation, international trade and other industry awards - comes after a number of years of strong performance by the company, which last year saw revenues grow by 160%. \nThe company, which was one of only 18 UK firms on the list, says it is on track to double its turnover in 2017, aided by growing interest in the virtual, augmented and mixed reality services it has been offering since the establishment of an immersive technologies division in January. Read More Former Newcastle Airport boss David Laws takes top job at Northern rival \nCEO Sarat Pediredla said: “It is a true honour to win this award; we have been pleased with our recent growth, but it was a real surprise to be acknowledged at such a high level. \n“We are proud to fly the flag for UK tech - and were delighted to learn we were the only UK company specialising in mobile to make it on to this prestigious list. That, I believe, is a testament to the hard work of our team as well as the dedication of our senior management. \n“We have many exciting projects ahead of us this year and, having invested in expanding our Newcastle HQ , are well placed to bring the best we can offer to our clients. \n“Innovation also remains critical to our vision; we are committed to providing cutting-edge solutions, making use of the latest, most impactful technologies.” Read More Avoiding hard Brexit is keen concern for North East businesses, Journal survey shows \nhedgehog lab, which recently took more room at the Generator Studios in Newcastle to allow for expanstion, was selected for the award from a 200-strong shortlist, compiled after Red Herring reviewed more than 1,200 companies in industries ranging from telecommunications to hardware and software. \nNominees were evaluated on 20 different criteria, including disruptive impact, financial performance, technology innovation, social value and quality of management. \nEach company’s score also included an evaluations of its track record and standing, allowing judges to discover those most likely to grow. Read More School leaver at 16 becomes head of major accountancy office: meet Sandra Thompson \nAlex Vieux, publisher and CEO of Red Herring, said: “This year was rewarding beyond all expectations. There are many great companies generating really innovative and disruptive products in Europe. \n“We had a very difficult time narrowing the pool and selecting the finalists. We know that the 2017 crop will grow into some amazing companies that are sure to make an impact.” \nhedgehog lab was established in 2010 as a ‘post-PC’ technology consultancy, building apps for mobile, tablets, wearables and other connected devices. \nAs well as its North East headquarters, the company has offices in London, Boston, Austin and Hyderabad. It also opened an office in the Danish capital, Copenhagen, to ensure access to the European market as the UK prepares for Brexit. Like us on Facebook", "external_links": [], "published": "2017-05-29T18:10:00.000+03:00", "crawled": "2017-05-29T13:55:31.000+03:00", "highlightTitle": ""}