{"organizations": [], "uuid": "0473857e72208c2b44854d9d8c81fe61d27daff0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11315126.ece/ALTERNATES/s1200/JS50879759.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13012088", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Record results at Vertu as sales motor towards £3bn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Record results at Vertu as sales motor towards £3bn", "spam_score": 0.0, "site_type": "news", "published": "2017-05-10T15:43:00.000+03:00", "replies_count": 0, "uuid": "0473857e72208c2b44854d9d8c81fe61d27daff0"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13012088", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Record results at Vertu as sales motor towards £3bn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Snapchat parent company set to post big loss \nSnapchat’s parent company Snap Inc is expected to report a big loss when it reveals its first financial results on Wednesday. \nThe camera company behind the Snapchat photo messaging app listed on the US stock market for the first time in March and the company’s value initially rose beyond £25 billion when it began trading. \nHowever, shares in the company have since dropped in value, partly due to pressure from rivals including Facebook and Instagram, and some analysts are now predicting the company could report a net loss of up to £1.5 billion. \nSnapchat has recently been challenged by Facebook and its family of apps - including Instagram, Messenger and WhatsApp - all of which have introduced features similar to those that have made Snapchat popular. \nInvestor confidence has also been hit by the news that Instagram Stories - the photo sharing app’s own version of Snapchat’s Story feature - has surpassed it in terms of daily active users. \nFacebook revealed last month that Instagram Stories had 200 million daily users, while Snapchat has around 158 million. \nOn Tuesday, Snapchat announced it was updating another signature feature - time sensitive photo and video messages - to allow users to view them for as long as they wished, in a move seen by many as the first attempt to fight back against its rivals. Snapchat (Photo: Lionel Bonaventure/AFP/Getty Images) 9.18 Coreena Ford Britons favouring staycations over travel abroad \nBritish holidaymakers are opting for more staycations and spending less on overseas travel as the pound’s collapse begins to hit the vacation market. \nData released by holiday rental firm HomeAway shows that British travellers paid an average rate of £27 per person per night for its vacation lettings in the final three months of last year, marking a 15% drop from the same period a year earlier. \nElena Novokreshchenova, HomeAway’s regional director for the UK, Ireland and emerging markets, said: “Our data suggests HomeAway travellers are responding to the fluctuating value of sterling since the EU referendum, by becoming smarter about where and how they spend their holiday time with their loved ones.” \nMarket reaction to the Brexit vote has weakened the pound, making imported goods and trips abroad more expensive for Brits. \nSterling has regained some strength since the start of this year, but had lost 18% of its value against the US dollar and fallen 10% versus the euro in the second half of last year. However, UK travellers did not cut back on their holidays, extending their stay by around 10% in the fourth quarter. Staycations are on the up on the back of a weak pound 9.15 Coreena Ford Sports Direct store at Metrocentre sells to charity investors for £33m \nA giant retail store near the Metrocentre which houses Sports Direct and The Range has been sold in a £33m deal. \nThe Charities Property Fund – which handles property investments for charities around the country – has bought the freehold lease for the site from supermarket chain Tesco. \nThe building was first built as a Marks and Spencer “lifestore” before being used by Scandinavian furniture chain Ilva, though neither operator lasted long at the site. \nTesco had planned to open a supermarket on the site, despite the fact that it is only yards away from rivals Asda, but shelved the plans in 2015 when it also abandoned planned new stores in Amble, Peterlee and Stanley in a nationwide cost-cutting scheme. \nAngy Benitz, portfolio manager of The Charities Property Fund, said: “This purchase was a rare opportunity to acquire a prominent, sizable and income-producing site next to an Ikea and close to the Metrocentre, which is one of the most recognised retailing destinations in the country, attracting over 21m shoppers each year. Sports Direct store on Gibside Way, Gateshead (Photo: Newcastle Chronicle) 9.10 Coreena Ford 32 North East firms make list of UK's Most Inspiring Companies \nA total of 32 companies across the North East have been named among the UK’s most inspiring firms after being included in a high-profile annual list from the London Stock Exchange. \nThe Stock Exchange’s 1,000 Companies to Inspire Britain report has highlighted 14 firms on Tyneside, six in County Durham and four in Sunderland, with those on the list working in a range of sectors. \nThe North East firms on the list are growing at an average rate of 72% and show how the reg­ion’s business community has excellence in retail, real estate, architecture and professional services, as well as its traditional strengths in manufacturing and engineering. \nAmong the companies singled out for praise are trendy Newcastle fashion retailer End, County Durham technology group Kromek, Newcastle’s Frank Recruitment and two organisations within County Durham’s Lanchester Group – Greencroft Bottling and Lanchester Wines. \nThe firms in the list have been praised by Business Secretary Greg Clark, who said: “I want to congratulate the 1,000 companies from across the UK featured in London Stock Exchange Group’s pioneering 1,000 Companies to Inspire Britain report. \n“Championing high-growth innovative SMEs is crucial for the continued success of the UK economy and a country that works for everyone. We are committed to ensuring that companies of all sizes can access finance to grow, scale-up and create high-quality well-paid jobs across the country.” Bottling facilities at Greencroft Bottling 9.05 Coreena Ford North East firms have most to lose from Brexit, new report claims \nSmall firms in the North East are likely to be worst affected by any Brexit-related disruption to small business finance markets, a new report claims. \nThe report from the Federation of Small Businesses (FSB) says billions of pounds in EU funding dedicated to supporting small firms must be replaced to avoid the risk of an economic slowdown when the UK leaves the European Union. \nTake-up of finance from European schemes, including the European Regional Development Fund, is higher across the North East than any other part of England. Small firms in the North East have benefitted to the tune of £5,660 on average from such initiatives, compared to an average of £2,420 across the country. \nIn addition, 69% of small business equity deals in the North East involve public investors, many of which are backed by EU funds. That figure is also higher than any other region of the UK. \nMartin McTague, FSB national policy director, who is based in County Durham, said: “EU investment in UK finance markets has served as a vital lifeline for small firms across the North East. \n“If the new government is serious about developing an industrial strategy that supports growth across all regions, it must stand ready to expand the British Business Bank post-Brexit. Failure to do so will massively hamper the ability of small firms to invest and grow, threatening an economic slowdown across the region as a whole.” \nThe FSB’s Reformed Business Funding: What small firms want from Brexit report finds that small businesses across the North East are among the most likely to apply for EU-funded schemes, with the proportion of applicants across the region standing at 22% – higher than the average for the UK as a whole (15%). \nMore than two thirds (68%) of firms in the North East say that access to finance should be a priority for any EU funding replacement. The red carpet is swept at the Council of the European Union ahead of an EU Council meeting (Photo: Getty Images Europe) 9.00 Coreena Ford Barratt Developments hail strong results \nNorth East-founded Barratt Developments has cheered Britain’s buoyant housing market after securing the highest number of completions since the financial crisis and record forward sales. \nThe firm, originally set up in Newcastle, said total completions were on course to reach 17,350 for the full year, the highest amount since 2008, while total forward sales rose by 13% to a record £3.2 billion. \nThe UK’s biggest housebuilder said it expects annual pre-tax profits to come in at the top end of estimates, between £675 million and £733 million for the full year, as it rides high on a strong demand for new homes. \nThe firm rolled out 46 new developments over the period and plans to secure around 17,000 plots in the current financial year, compared to 24,387 in 2016. Net cash is expected to come in ahead of expectations at £600 million by June 30 this year on the back of “strong trading and the timing of land and working capital payments”. \nChief executive David Thomas said it had been a strong period “both operationally and financially” for the company. He said: “Market conditions remain good, with the group delivering a strong performance since the start of the calendar year. \n“Increased competition within the mortgage market has resulted in wide availability of attractive mortgage finance which, alongside Help to Buy, continues to support the very strong consumer demand. \n“This strong demand has helped drive volumes and we are on track to deliver circa 16,650 wholly owned completions for the full year. \n“This, alongside circa 700 joint venture completions would result in 17,350 total completions, the highest total in nine years.” \nShares in Barratt are currently up 3.77% at £6.19 on the London Stock Exchange following the announcement. Signs on a Barratt Developments site (Photo: PA) 8.55 Coreena Ford 800 jobs to go in £11bn Standard Life merger with Aberdeen Asset Management \nThe proposed £11 billion merger between Standard Life and Aberdeen Asset Management is expected to result in the phased loss of around 800 jobs, documents have revealed. \nThe posts are due to be cut over three years as the companies, which have a combined worldwide workforce of approximately 9,000 people, restructure. Bosses said they expect “natural turnover” to account for some of the reductions, while other steps will be taken to minimise compulsory redundancies. \nThe information is contained in a detailed prospectus published by Standard Life on the deal, which would create one of the world’s industry powerhouses, overseeing £660 billion worth of global assets. \nThe merger of Edinburgh-based Standard Life and Aberdeen is aimed at creating cost savings that could add up to £200 million per year. \nThe prospectus for shareholders stated “there will be a need to maximise operational efficiencies and cost synergies” to achieve the expected benefits of the merger. \n“At this time it is estimated that the integration and restructuring will result in a phased reduction of approximately 800 roles from the total global headcount of the combined group as at 31 December 2016 of approximately 9,000 over the three-year integration period,” it said. \n“Synergies will come in part from employee departures arising from natural turnover. Other appropriate steps will be taken to minimise the number of compulsory redundancies, including the active management of Standard Life’s and Aberdeen’s recruitment and vacancies.” \nThe document further reveals that the newly-merged company will be renamed Standard Life Aberdeen plc. \nBoth companies have agreed on a 16-strong board made up of an equal number of Standard Life and Aberdeen directors. \nStandard Life chairman Sir Gerry Grimstone will be the chairman of the newly-merged company while Aberdeen’s chairman Simon Troughton will become deputy chairman. Keith Skeoch, the Standard Life chief executive, and Aberdeen boss Martin Gilbert will become co-chief executives of the new firm. \nThe two companies agreed the terms of the merger, which will create Britain’s biggest asset manager, in March. \nUnder the terms of the deal, Aberdeen shareholders would own 33.3% and Standard Life shareholders would own 66.7% of the combined group. A general meeting has been scheduled for June at which shareholders will be asked to approve the merger. \nIf backed, the deal is expected to be closed by mid-August. 8.50 Coreena Ford Just East faces probe over Hungryhouse takeover \nOnline takeaway ordering firm Just Eat faces a potential full-blown investigation into its takeover of rival Hungryhouse amid concerns the deal could curb competition. \nThe Competition and Markets Authority (CMA) said its initial probe into the acquisition - worth up to £240 million - found the two firms were close competitors because of the service they offer and their reach across the UK. \nIt said other rivals offering delivery services, such as Deliveroo, UberEATS and Amazon Restaurants, provided little direct competition because they target different types of restaurant and did not have the same scale of service. \n“The CMA is therefore concerned that the loss of competition resulting from the Just Eat/Hungryhouse merger may result in worse terms for restaurants using either of the two companies,” the CMA said. \nIt will now refer the deal to an in-depth competition investigation, unless Just Eat can address the concerns. \nJust Eat has until May 17 to put forward proposals. \nThe CMA also said on Wednesday it was poised to refer Capita’s takeover of Vodafone’s paging services business for a full-scale inquiry, unless the two companies can address competition concerns. \nIt said the acquisition, announced in February, could lead to a “substantial lessening of competition” and see customers face price hikes for paging services and reduce quality of coverage. \nJust Eat said it “looks forward to co-operating with the CMA and is committed to demonstrating to the CMA that the market is, and will remain, competitive following completion of the proposed transaction”. 8.46 The FTSE and pound latest \nThe FTSE-100 index at 8:15am was up 0.50 at 7342.71. \nThe pound at 8am was 1.2971 dollars compared to 1.2938 dollars at the previous close. The euro at 8am was 0.8395 pounds compared to 0.8407 pounds at the previous close. 8.45 Coreena Ford Revenues drop at ITV amid 'uncertain' economic environment \nBroadcasting giant ITV endured a fall in revenues at the start of the year and expects the TV advertising market to remain tough as it grapples with an “uncertain” economic environment. \nThe group, home to shows such as Britain’s Got Talent, Broadchurch and The Voice, saw net advertising revenue drop 9% to £393 million in the first quarter, but said predictions for the full-year were unchanged. \nRevenues also slipped 3% to £731 million over the period, as it braces itself for a rough ride in the coming months, with advertising income expected to drop by between 15% and 20% in June after a boost from last year’s European Championships. However, efforts to shift revenue streams away from the turbulent advertising market continue to bear fruit, with its ITV Studios production arm bolstering revenues by 7% to £343 million in the three months to the end of March this year. \nThe update comes as ITV remains on the hunt for a new top boss to replace outgoing chief executive Adam Crozier who will leave the company on June 30. Mr Crozier said: “ITV’s overall performance and the shape of the UK advertising market are very much as we anticipated and our guidance for the full year remains unchanged. \n“Over the first half we expect ITV Family NAR to be down 8% to 9%. In line with previous guidance April was up 5%, while we expect May to be down 8% and June to be down 15% to 20% against the tough comparator of the Euros last year. \n“The first half performance will also be impacted by the weighting of the programme budget to the first six months and the phasing of Studios deliveries, most significantly the non-recurring benefit of The Voice of China in 2016. \n“While the economic environment remains uncertain our guidance over the full year remains unchanged.” ITV, which screens shows such as Broadchurch, has seen revenues slip (Photo: Patrick Redmond/ITV/PA Wire) 8.40 KEY EVENT Gateshead's Vertu motors towards £3bn in sales \nGateshead headquartered Vertu Motors Plc has boost revenues by 16.5% to top £2.8bn in a record tenth year of trading. \nThe acquisitive automotive retailer, which now has 124 sales and aftersales outlets across the UK, also grew EBITDA by 20% to £41.4m, and has a strong balance sheet of £21m to help pursue further growth. \nDirectors said the record group trading performance has been driven by improvement in recently acquired businesses, a strong used car performance and growth in the higher margin service area. \nIts growth strategy also progressed with a greater premium mix, including the addition of the Mercedes-Benz franchise. \nRobert Forrester, chief executive of Vertu said: \nSince our inception ten years ago, Vertu has remained focused on consolidating the UK automotive retail sector to grow a scaled and sustainable dealership business. Today’s results, our fifth consecutive year of growth, evidences our continued delivery of this strategy. Significant acquisitions have been integrated through the year and have enriched the premium mix of the franchise portfolio. Record Profit before Tax of £29.8m represented a 14.6% increase for the Group, EBITDA rose to over £40m for the first time and cash conversion was excellent. \nOur strong balance sheet with net cash of £21.0m together with our unutilised debt facilities provide scope for further scaling-up in due course to drive value and further enhance shareholder returns. \nTrading up to the end of April 2017 has been strong giving the Board confidence for the future. The full year dividend has been increased by 7.7%. Robert Forrester ", "external_links": [], "published": "2017-05-10T15:43:00.000+03:00", "crawled": "2017-05-10T12:27:53.000+03:00", "highlightTitle": ""}