{"organizations": [], "uuid": "1a201b9c66924436b8c1de1a21bcfb9ab02957f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13021372.ece/ALTERNATES/s1200/Jeremy-Corbyn-Campaigns-In-South-Yorkshire.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-mps-back-leaked-manifesto-13021212", "country": "GB", "domain_rank": 21960, "title": "Labour MPs back leaked manifesto plans as party pledges new North rail line", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Labour MPs back leaked manifesto plans as party pledges new North rail line", "spam_score": 0.0, "site_type": "news", "published": "2017-05-11T23:00:00.000+03:00", "replies_count": 0, "uuid": "1a201b9c66924436b8c1de1a21bcfb9ab02957f6"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-mps-back-leaked-manifesto-13021212", "ord_in_thread": 0, "title": "Labour MPs back leaked manifesto plans as party pledges new North rail line", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "ian mearns", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "matt zarb-cousin", "sentiment": "none"}, {"name": "michael fallon", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "len mccluskey", "sentiment": "none"}], "locations": [{"name": "south east", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "bradford", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "virgin trains", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "cancel play now labour general election", "sentiment": "none"}, {"name": "conservative defence", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "gateshead labour", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour MPs back leaked manifesto plans as party pledges new North rail line Labour MPs are happy with party plans after surprise leak of general election manifesto commits party to sweeping policy changes Share Click to play Tap to play The video will start in 8 Cancel Play now Jeremy Corbyn: Labour manifesto is an 'offer that will transform lives' Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour MPs have welcomed policies set out in the party’s leaked draft manifesto, which include increasing the minimum wage and bringing railways back into public ownership. \nThe spectacular leak, in advance of the manifesto’s official launch in Bradford on Tuesday, came as Mr Corbyn prepared to present the proposals to a meeting of senior Labour officials and MPs. \nMPs stressed that they had not seen the full manifesto, but said they backed proposals revealed in media reports. \nGateshead Labour MP Ian Mearns said: “The measures in the manifesto appear to line up with the announcements of recent weeks and the vast majority of that I welcome. \n“People I talk to, and certainly party activists and people that I talk to on the doorstep, welcome many of the initiatives within the party manifesto. \n“What we have to do now is to convince people that we have a chance to implement such a manifesto on behalf of ordinary working people and their families.” Gateshead MP Ian Mearns \nManifesto proposals which may be of particular relevance to the North East include building a “Crossrail for the North” to link the North East and North West, linking up to the HS2 high speed rail line. \nThe draft manifesto - which could change before it is officially launched - also says Labour would extend HS2 to Scotland. That could mean it runs north from Leeds via Newcastle, or it could mean extending it up the west coast north from Manchester. \nLabour would end the Tory policy of requiring regions to have mayors if they want extra cash and powers. It would mean at long last there was an end to debates about whether the North East should have a mayor, as local council leaders would almost certainly choose to accept the offer of extra funding without a mayor. \nThe manifesto also includes a pledge to improve the A1 in the North and allow local councils to set up their own bus companies. \nIt also pledges an end to the “sanctions” regime which means some claimants lose their benefits because they are said to have failed to co-operate with job centres. North East Labour MPs have been fiercely critical of sanctions, saying that in practice they penalise people for no reason. Ronnie Campbell MP (Photo: Newcastle Chronicle) \nThere would be extra funding for schools and hospitals, paid for partly by increasing income tax on people earning more than £80,000. \nAnd rail franchises such as the East Coast Main Line would be taken back into public control, rather than being run by private firms such as Virgin Trains. \nRonnie Campbell, Labour’s MP for Blyth Valley, said: “I’m happy with it. I think it’s good. \n“The East Coast Main Line, when it was run by the government and the workers together, was brilliant.” \nWansbeck MP Ian Lavery, Labour’s general election co-ordinator, told the Chronicle he would rather talk about the manifesto when officially published, but he said: “The draft includes policies that will transform the lives of millions of people in the UK. \n“It will ensure that no-one will be held back on our communities and will be actively assisted to achieve their maximum potential, for the many not the few.” \nThe draft manifesto contains a specific pledge to ensure regions outside London and the south east get a fair share of funding, such as money for major transport schemes. Wansbeck MP Ian Lavery (Photo: Daily Mirror) \nIt says: “Historic under-investment in infrastructure is a major barrier to productivity and growth, and a major contributor to the disparity between the south-east and the rest of the country. Unlike previous governments, we will ensure that investment is fairly shared around every region and nation of the UK.” \nIt adds: “While the South- East struggles with a rising cost of living crisis, many northern and coastal towns have seen their economies and communities left behind. Britain’s failure to get all all our regional and local economies working can be seen in the deterioration of the current account, weak productivity growth and under investment in infrastructure.” \nUnite boss Len McCluskey hailed the policies as “really, really exciting”. Read More What's in Labour's leaked General Election manifesto? The key issues at a glance \nHe predicted voters would welcome a higher minimum wage, the abolition of zero-hour contracts and the nationalisation of the railways, which he described as “the most popular policy out there”. \nBut Conservative Defence Secretary Sir Michael Fallon said the manifesto contained “lots of promises to spend lots more money on lots of different things”. \nHe added: “What they have not made clear is how that is going to be financed, how much more borrowing there’s going to be and what the implications are for the economy if you go on a massive borrowing spree like the last Labour government did. \n“They would borrow more and that in the end is the road to ruin.” \nMr Corbyn’s effort to win support from voters who backed Brexit may be hampered by the manifesto’s measures on the EU and immigration. \nThe document rules out setting a target for cutting net migration - something Theresa May has committed to despite so far failing to hit the Conservatives’ “tens of thousands” ambition. Read More Ian Lavery launches Labour election poster as gig goes ahead without leader Jeremy Corbyn \nInstead, it says Labour believes in “fair rules and reasonable management” of migration, but rules out “making false promises on immigration numbers”. \nMr Corbyn has insisted “Britain is leaving the European Union” but the manifesto rules out breaking away from Brussels without a deal. \nA senior Labour source said suggestions the manifesto was leaked by Mr Corbyn’s team were “categorically and completely untrue”, while a separate Labour source denied the leak had come from the party’s headquarters, insisting no-one there had the manifesto. \nOne former Corbyn aide, ex-spokesman Matt Zarb-Cousin, pointed the finger of blame at members of Labour’s HQ staff, who he has previously accused of undermining the leadership during his time in the party. Read More ", "external_links": [], "published": "2017-05-11T23:00:00.000+03:00", "crawled": "2017-05-11T18:22:52.000+03:00", "highlightTitle": ""}