{"organizations": [], "uuid": "4184675be1ae103b805f4bf97cdfec34c009c060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article8817135.ece/ALTERNATES/s1200/JS34754209.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/local-news/election-2017-tynemouth-constituency-candidates-8650775", "country": "GB", "domain_rank": 21960, "title": "Tynemouth constituency General Election 2017 - parties, candidates and the history of the seat", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-26T23:15:00.000+03:00", "replies_count": 0, "uuid": "4184675be1ae103b805f4bf97cdfec34c009c060"}, "author": "Sonia Sharma", "url": "http://www.chroniclelive.co.uk/news/local-news/election-2017-tynemouth-constituency-candidates-8650775", "ord_in_thread": 0, "title": "Tynemouth constituency General Election 2017 - parties, candidates and the history of the seat", "locations": [], "entities": {"persons": [{"name": "nick varley nick varley", "sentiment": "none"}, {"name": "nick varley", "sentiment": "none"}, {"name": "stuart houghton tynemouth", "sentiment": "none"}, {"name": "anthony", "sentiment": "none"}, {"name": "tynemouth  whitley bay", "sentiment": "none"}, {"name": "alan", "sentiment": "none"}, {"name": "campbell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "julia erskine", "sentiment": "none"}, {"name": "julia", "sentiment": "none"}, {"name": "brexiteeer", "sentiment": "none"}, {"name": "alan campbell", "sentiment": "none"}, {"name": "stuart houghton  stuart houghton", "sentiment": "none"}, {"name": "john appleby john appleby", "sentiment": "none"}, {"name": "coleman", "sentiment": "none"}, {"name": "green", "sentiment": "none"}], "locations": [{"name": "tynemouth", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "whitley bay", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "tynemouth  raised", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "shiremoor", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "monkseaton", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "all party small shops group", "sentiment": "none"}, {"name": "hirst high school", "sentiment": "none"}, {"name": "whitley bay high school", "sentiment": "none"}, {"name": "lancaster university", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "north tyneside council", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "all party fisheries group", "sentiment": "none"}, {"name": "north tyneside green party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour government", "sentiment": "none"}, {"name": "newcastle polytechnic", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "tynemouth labour - alan campbell alan campbell", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  \nIf you’re due to cast your vote in the Tynemouth constituency on June 8 we’ve got everything you need to know right here. \nBritain will go to the polls to elect a government and prime minister after Theresa May called a snap general election. \nWe’ll be covering events on our live blog on election day , but in the meantime we’ve got the information you need before you decide which box to put your cross in. \nThis is largely a coastal constituency on the northern bank of the Tyne, the main population centres being Whitley Bay , Tynemouth, Shiremoor, North Shields and Monkseaton. For many years, this was a Conservative seat, returning Tory MPs from 1950 to 1997, albeit often on narrow majorities. However it has been represented by Labour since 1997. \nWhich parties and candidates are standing in Tynemouth Labour - Alan Campbell Alan Campbell (Photo: Newcastle Chronicle) \nConsett-born Alan studied politics at Lancaster University before qualifying as a teacher and then gaining a postgraduate history degree at the former Newcastle Polytechnic. \nHe taught at Whitley Bay High School and Hirst High School in Ashington before he was elected in 1997. \nSince 2010, he has served as Opposition Deputy Whip, after a stint as assistant whip for the Labour Government. \nHe has served on Labour MPs’ seaside and coastal towns group, the All Party Small Shops Group and the All Party Fisheries Group. Conservatives - Nick Varley Nick Varley, pictured with Theresa May, is running for the Tories in Tynemouth \nRaised in County Durham, Nick Varley leaded the ground campaign for Vote Leave during the EU referendum. \nA committed Brexiteeer, he says he wants to get the “best deal possible” for Tyneside. \nHe wants parents to have more “choice” about where their kids go to school and says he will boost fishing. \nHe says: “Only a vote for me will give Theresa May the strongest hand possible in the Brexit negotiations. She will get a good Brexit deal for Tynemouth.” UKIP - Stuart Houghton Tynemouth's UKIP candidate is Stuart Houghton \nStuart Houghton is the UKIP candidate for Tynemouth. \nHe stood in May’s mayoral elections, where he took 6.1% of the votes. \nBorn and raised in the North Tyneside borough, he lives in Monkseaton and teaches psychology. He has also lectured at degree level. \nA Brexiteer, he has previously said he wants to help the fishing industry take advantage of leaving the European Union. Liberal Democrats - John Appleby John Appleby, Liberal Democrat candidate for Tynemouth \nWhitley Bay man John is head of mechanical engineering at Newcastle University and teaches maths. \nHe has served as a councillor, school governor, union branch president and on church committees. \nJohn brands himself as a “pragmatist”, who aims to balance well-being with efficiency and acting in everybody’s interest. \nHe wants to see increased cooperation in the UK and with Europe through communication and trade. \nOn Brexit, he wants further debate before the final deal to leave the European Union is agreed on by MPs. Green Party - Julia Erskine Green Party candidate for Tynemouth, Julia Erskine \nSelf-employed dogn walker Julia has been supporting the Green Party since the 1980s, when she was involved with the Newcastle branch. She joined the North Tyneside Green party in 2007 and has lived in Whitley Bay for 12 years. Julia stood in North Tyneside in 2007 and 2015. \nShe says: “I have always believed the Green Party to be the only real alternative to the others, and so much of it just makes sense to me that I’ve never wanted to vote for anything else. That is why I do this - to give myself and others the choice to vote Green, and to bring about real, sustainable change.” Independent - “Anthony the Durham Cobbler” Which parties and MPs have held the seat in the past? \nOver the 20th Century the Tories dominated in Tynemouth, although Labour’s Grace Coleman held the seat between 1945 and 1950. Between 1950 and 1997 the Tories won in Tynemouth, before Alan Campbell was elected. Mr Campbell has held the seat since. \nProvide link to council website with polling stations \nType your post code into North Tyneside Council’s website to find your nearest polling station.", "external_links": [], "published": "2017-05-26T23:15:00.000+03:00", "crawled": "2017-05-26T18:44:22.000+03:00", "highlightTitle": ""}