{"organizations": [], "uuid": "21577ebf56d525e01e06157afe875dd5a3f40486", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13029232.ece/ALTERNATES/s1200/SGP_NEC_120517MAY10JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-north-east-five-things-13028995", "country": "GB", "domain_rank": 21960, "title": "Theresa May in the North East: Five things we learned from her trip", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-13T03:45:00.000+03:00", "replies_count": 0, "uuid": "21577ebf56d525e01e06157afe875dd5a3f40486"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-north-east-five-things-13028995", "ord_in_thread": 0, "title": "Theresa May in the North East: Five things we learned from her trip", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "susan beevers", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jane cowley", "sentiment": "none"}, {"name": "jane", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "linskill", "sentiment": "none"}, {"name": "linskill centre", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "women against state pension inequality", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  \nTheresa May brought her campaign trail to the North East today in a bid to win over traditional Labour voters. \nThe Prime Minister’s “campaign coach” started in Northumberland - visiting Eshott airfield and Berwick. \nShe then headed to the Linskill Centre in North Shields , where she gave a speech urging voters to “put your trust in me”. \nHere’s what we learned from Mrs May’s visit to the region. She’s serious about winning over voters in the North East... \nThe Conservative leader denied that she was living “in a fantasy” by trying to urge working class voters to switch to the Tories. \nWhen asked about her campaigning in the traditional Labour heartland she said: “Tynemouth used to be a Conservative-held seat, and in recent years we’ve had a Conservative Mayor in North Tyneside.” \nMrs May said the crucial choice people faced was between her as Prime Minister, or Jeremy Corbyn.   Read More   \nIn her speech she claimed: “Proud and patriotic working class people in towns and cities across Britain have not deserted the Labour Party – Jeremy Corbyn has deserted them.” \nAnd in a bid to urge people who may never have voted Tory before to “put your trust in me”, Mrs May highlighted her plans to intervene in the market to protect working people, including capping energy bills and protecting pensions from “unscrupulous bosses”. But she doesn’t actually want to speak to them \nOnly invited guests were allowed to watch Mrs May’s speech in the Linskill Centre, but that didn’t stop a sizeable crowd from gathering outside to wait for her arrival. \nThere were campaigners   hoping to highlight their causes to the Prime Minister. \n  \nJane   She’s still strong and stable \nNo-one following the election coverage could have failed to miss this Conservative party slogan. \nThere were five mentions of the phrase “strong and stable” during Mrs May’s speech - plus two on the screen behind her as she delivered it. \nThe Prime Minister also reiterated that the election is a clear choice between her strong and stable leadership or the risk of having Jeremy Corbyn to lead Britain through the Brexit negotiations, adding: “Our future success and prosperity as a country depends on getting the next five years right.”   It’s the economy, stupid \nMrs May claimed the Labour party would plunge the country into “economic chaos” and described their leaked manifesto as “a multimillion pound wishlist of undeliverable promises”. \nWhile “strong and stable” was the mantra used to describe the Tories, Mrs May repeatedly used the terms “government of chaos” and “coalition of chaos” to describe the alternative. \nShe also made repeated references to Diane Abbott’s policing policy gaffe, describing her as “a Shadow Home Secretary who can’t add up”. Brexit is the key \nThe PM made it clear she thinks Brexit is the key issue facing voters on June 8, and claimed Jeremy Corbyn has “no real bargaining position” for Brexit. \nShe said: “We can only make a success of our future if we first make a success of Brexit. \n“We’ve seen the European Commission’s negotiating stance has hardened, \n“We’ve seen the remaining 27 states are determined to work together. \n“We’ve seen they mean business - but so do I.” \nShe promised that Britain would “reclaim our money, our borders and our laws”. Like us on Facebook", "external_links": [], "published": "2017-05-13T03:45:00.000+03:00", "crawled": "2017-05-12T23:05:08.000+03:00", "highlightTitle": ""}