{"organizations": [], "uuid": "ec9df10436b8d9f1da59f57f050a00220b23d1ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12988847.ece/ALTERNATES/s1200/Blue-sky-over-the-Polling-Station-at-Toxteth-LibraryLiverpoolfor-the-inaugural-Liverpool-City-Regi.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/votes-thousands-head-polls-local-12988786", "country": "GB", "domain_rank": 21960, "title": "The votes are in as thousands head to the polls for local elections in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The votes are in as thousands head to the polls for local elections in the North East", "spam_score": 0.0, "site_type": "news", "published": "2017-05-05T03:33:00.000+03:00", "replies_count": 0, "uuid": "ec9df10436b8d9f1da59f57f050a00220b23d1ae"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/votes-thousands-head-polls-local-12988786", "ord_in_thread": 0, "title": "The votes are in as thousands head to the polls for local elections in the North East", "locations": [], "entities": {"persons": [{"name": "sarah jeffery", "sentiment": "none"}, {"name": "jack campbell", "sentiment": "none"}, {"name": "julie wood", "sentiment": "none"}, {"name": "stephen brooks", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}, {"name": "weimaraner murphy", "sentiment": "none"}], "locations": [{"name": "north east councillo", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ridsdale", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "rushyford", "sentiment": "none"}], "organizations": [{"name": "northumberland county council", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "darras hall first school", "sentiment": "none"}, {"name": "ponteland united reform church in darras hall", "sentiment": "none"}, {"name": "north tyneside council", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "dli museum", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The votes are in as thousands head to the polls for local elections in the North East Councillors will be elected in Northumberland and Durham and an elected mayor will be chosen for North Tyneside Share A polling station (Photo: LIVERPOOL ECHO) Share Get   Thank you for subscribing!   \nSchools, sports halls, churches and community centres have become the centre of democracy once again as local elections are held across the region. \nThousands of voters across County Durham, Northumberland and North Tyneside headed to the polls on Thursday to vote for their local councillors, or in North Tyneside their Mayor. \nLabour currently holds control of both Northumberland and County Durham councils. \nCounty Durham is seen as one of the reddest places in the UK and Labour hold 94 of the 126 seats, although with recent issues, including the firing and rehiring of teaching assistants and closing the DLI Museum, independent candidates are hoping to muscle in. \nIn Northumberland, Labour hold a much slimmer majority, with 31 of the 67 seats. Read More Local election results 2017 LIVE: Northumberland and Durham voters elect their local councillors and North Tyneside elects a mayor \nThe Tories are hoping to increase their 20 seats on the authority, and have been campaigning against house building. \nOutside the polling station at the Ponteland United Reform Church in Darras Hall, Stephen Brooks, 55, a coal merchant said he voted Conservative based purely on local pledges. \n“I voted for the individual and the party at a local level, not just down a party line. \n“I think there are too many plans to build in the area which will ruin it, and that the Conservatives would be able to do something about it.” \nHe added: “Local elections are about your community and what’s more important than where you live?” \nDozens of curious children from Darras Hall First School asked their parents about the polling station as they left school for the day on Thursday. Read More Your dogs at polling stations photos in Durham, Northumberland and North Tyneside \nWylam grandmother Julie Wood said: “I’ve explained it as best I can. It’s important children understand how valuable voting is.” \nThat message hasn’t sunk in with the majority and turnout for the local elections are expected to be low. \nOne passing 21-year-old admitted he hadn’t even known about the local election and that he probably wouldn’t bother voting in the General Election next month either. \nJack Campbell said: “The only time I ever voted was for Brexit, I voted out, that’s the only thing that’s got me driven enough to vote.” \nMeanwhile the ever popular dogs at polling stations trend reappeared on social media on Thursday as voters shared photos of their pooches waiting while their mark their polling card. Impatient Weimaraner Murphy waits in North Tyneside. Owner Sarah Jeffery tweeted: \"Murphy wasn't very keen on voting\" #dogsatpollingstations (Photo: UGC TNE) \nWhile polling stations in church halls and primary schools are commonplace, the North East is home to a couple of more unusual places to cast your vote. \nThe Gun Inn in Ridsdale, Hexham, and Eden Arms Hotel, Rushyford, Ferryhill are two polling stations where you can get a pint after posting your polling card. \nNorthumberland County Council and North Tyneside Council will count votes through the night from when polls close at 10pm while Durham County Council will start its count at 11am on Friday. Like us on Facebook", "external_links": [], "published": "2017-05-05T03:33:00.000+03:00", "crawled": "2017-05-04T22:58:39.000+03:00", "highlightTitle": ""}