{"organizations": [], "uuid": "1e30b57c1e4926652ad4177b36f2da33482d2684", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13117637.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-theresa-lost-nerve-forgot-13117096", "country": "GB", "domain_rank": 21960, "title": "How Theresa May lost her nerve and forgot about the just about managing classes", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-01T01:00:00.000+03:00", "replies_count": 0, "uuid": "1e30b57c1e4926652ad4177b36f2da33482d2684"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-theresa-lost-nerve-forgot-13117096", "ord_in_thread": 0, "title": "How Theresa May lost her nerve and forgot about the just about managing classes", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "south east", "sentiment": "none"}, {"name": "shepton mallet", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "west show", "sentiment": "none"}], "organizations": [{"name": "huddersfield examiner", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How Theresa May lost her nerve and forgot about the just about managing classes The 'cult of May was a huge mistake' warns one Conservative candidate, as Tory campaign falters Share Click to play Tap to play The video will start in 8 Cancel Play now Get   \nOne of the surprises of this election is how little we’ve heard about Theresa May’s plan to be the champion of working people. \nIt was meant to be her big idea. She talked about it during her conference speech in Birmingham last year, and in her campaign for the Tory leadership. \nBut during the general election campaign, there have been two messages. \nOne (stop me if you’ve heard this before) is that she offers the strong and stable leadership the UK needs as it negotiates Brexit. \nThe second is that the Conservatives will make you sell your house if you need long-term care at home. \nOne might assume that the second message is one the Tories never wanted to push. Perhaps the Labour Party, or maybe the media, spotted a flaw in the Conservative general election manifesto and pounced on it. \nThat’s not what happened. Bizarrely, the Conservatives chose to highlight their social care policy when they sent a short preview of the manifesto to the media on the evening before the official launch, ensuring that it was picked up by press and broadcasters. \nIt’s particularly strange because there are policies in the manifesto, vague as it is, that could be used to construct a very different narrative. \nMrs May could have presented herself as the Prime Minister offering a fair deal in the workplace. The manifesto includes plans to increase the living wage, give more legal rights to staff who are technically self-employed but actually work for big businesses, and to name and shame firms which pay their chief executives massive sums compared to the average employee. Prime Minister Theresa May during a General Election campaign visit to The Royal Bath and West Show near Shepton Mallet in Somerset (Photo: PA) \nOr she could have highlighted plans to end “rip-off Britain”. The manifesto includes a promise to cut energy bulls, make it harder for private landlords to throw tenants out and make mobile phone bills fairer and easier to understand. \nAnother option was to present Mrs May as the champion of the regions, with manifesto pledges to build a new “Northern Powerhouse rail” line, order civil servants to move out of London - which will boost regional economies - and tell Channel 4 to move its headquarters out of the south east. \nThe trouble is that you have to read through the manifesto to dig out these policies. The Conservative PR machine and Tory politicians haven’t drawn attention to them. Read More General Election 2017 - is it May or Corbyn for North East voters? \nIn theory, journalists should be picking through all the manifestos with a fine tooth comb rather than accepting the agenda pushed by the parties. But that’s just not how the world works. \nIt’s possible that Conservative reticence to talk about policies - the policies that people might actually like - is part of a deliberate plan to keep the message simple. \nIt’s clear that the Tories want to focus on Brexit as much as possible, and to get voters thinking about whether Theresa May or Jeremy Corbyn are the best people to lead us through it. \nMeanwhile, Labour believes its best bet is to change the subject on to other topics. Prime Minister Theresa May speaks at the launch of the Tory manifesto (Photo: Huddersfield Examiner) \nThe problem for the Conservatives, however, is that they had to publish a manifesto at some point. And this inevitably had to talk about more than just Brexit. \nSo why not try to make the best of it, at least for a day or two until the manifesto was safely out of the way? \nThis isn’t to say that a slick PR operation would have prevented the social care plan, now popularly known as the dementia tax, becoming an issue. The only way to do that was probably not to have included it in the first place - or, at least, not have been so specific about the details. \nBut Theresa May could have had the courage of her convictions and focused more on the philosophy which is supposed to define her, the idea that the Conservatives are the party of the “just about managing” classes, people who work hard and pay their own way but find life a struggle. Read More Avoiding hard Brexit is keen concern for North East businesses, Journal survey shows \nConservative candidates agree the campaign has gone wrong - but dismiss suggestions their party could actually lose seats, as suggested by a new survey published by YouGov. \nOne said that the party had made “a huge mistake” by focusing the entire campaign around Theresa May. \nAnd Labour leader Jeremy Corbyn had a run a very good campaign, and come across as sincere and compassionate. \nHowever, this still won’t mean voters think Mr Corbyn is the right person to be Prime Minister, Tories say. \n“The cult of May was a huge mistake,” said one. “But who do you want negotiating the Brexit strategy? Answer: not Corbyn.” Like us on Facebook", "external_links": [], "published": "2017-06-01T01:00:00.000+03:00", "crawled": "2017-05-31T20:16:30.000+03:00", "highlightTitle": ""}