{"organizations": [], "uuid": "2045c5726ccb37e3458b1abf925b6cd28e7ff8e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13092031.ece/ALTERNATES/s1200/mptwi.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/its-happened-us-scale-abuse-13088685", "country": "GB", "domain_rank": 21960, "title": "'It's happened to all of us': Scale of abuse directed at MPs online revealed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-28T12:00:00.000+03:00", "replies_count": 0, "uuid": "2045c5726ccb37e3458b1abf925b6cd28e7ff8e5"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/its-happened-us-scale-abuse-13088685", "ord_in_thread": 0, "title": "'It's happened to all of us': Scale of abuse directed at MPs online revealed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Roberta Blackman-Woods and Catherine Mckinnell have spoken about Twitter abuse Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNew research reveals the scale of the abuse politicians are subjected to online. \nOne in 20 of all tweets sent to UK MPs are abusive, according BCS - The Chartered Institute for IT and the independent think tank Demos. \nThat’s nearly 190,000 insulting tweets sent across three months of last year. \nThe figures came as little surprise to some of those who’ve served as MPs in parts of the North East. \nRoberta Blackman-Woods , currently standing for re-election as MP for the city of Durham, said: “It’s happened to all of us MPs, increasingly I just ignore it, unless it’s really abusive stuff or threatening the safety of my staff. \n“It probably was a shock to me when it started, one of the things about Twitter and Facebook is people can say things that they would never say if they were sitting in front of you. \n“Serious abuse does have to be challenged, and there should be really good safeguarding from social media providers.” \nFormer Newcastle North MP Catherine Mckinnell , also running for office this year, said more needed to be done to combat online abuse, not just for public officials but for people from all walks of life. \nShe said: “It’s clear there’s a problem with social media across the board, not just Twitter, and people feeling they can make comments or direct abuse that they wouldn’t dream of saying to someone’s face or even by email. \n“I do have concerns about what effect this has on people - and particularly young women - who might be considering putting themselves forward for an elected position. \n“But this doesn’t just affect MPs and other people in public life, and cyber bullying or abuse can be hugely damaging for whoever it happens to. Social media firms could and should be doing much more to clamp down on this type of abuse.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAccording to the study, the abuse peaked on the day of the EU referendum result, June 24, and the day Boris Johnson pulled out of the Conservative leadership race, June 30. Read More Teenager interviewed by police after vile Bradley Lowery message on social media \nBrexit was the most commonly occurring hashtag in abusive tweets, while Boris Johnson and VoteLeave ranked second and third. \nParty leaders, deputy leaders and prominent campaigners in the EU referendum were among the most frequently abused MPs, according to the research. \nBut not all of the abuse mentioned political subjects: analysis also found that 34% of it was “unqualified” — abuse with no context or information about why it was sent. Read More What you can and can't post on Facebook revealed for the first time as 'policies' are leaked \nDespite the potential for misuse, Ms Blackman-Woods highlighted how social media can be a positive force for democracy. \nShe said: “MPs should be accessible and people should be able to challenge us - it’s how they challenge that’s important. You can discuss without being abusive.” Like us on Facebook", "external_links": [], "published": "2017-05-28T12:00:00.000+03:00", "crawled": "2017-05-28T07:22:00.000+03:00", "highlightTitle": ""}