{"organizations": [], "uuid": "1b42f0db62e87138fc8d02107a2dd5b539bb2245", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30339019/16006433.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/devon-independent-backed-by-tactical-voting-site-as-only-candidate-to-beat-tory-hugo-swire/story-30339019-detail/story.html", "country": "US", "title": "Devon candidate the only independent in UK backed by tactical voting site | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.896, "site_type": "news", "published": "2017-05-18T02:00:00.000+03:00", "replies_count": 0, "uuid": "1b42f0db62e87138fc8d02107a2dd5b539bb2245"}, "author": "", "url": "http://www.devonlive.com/devon-independent-backed-by-tactical-voting-site-as-only-candidate-to-beat-tory-hugo-swire/story-30339019-detail/story.html", "ord_in_thread": 0, "title": "Devon candidate the only independent in UK backed by tactical voting site | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon live devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "wright", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "claire wright", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "patrick mcloughlin", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "sidmouth", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "national planning policy framework", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon candidate the only independent in UK backed by tactical voting site By WMN_PGoodwin | Posted: May 17, 2017 0 COMMENTS SHARES Claire Wright is the only independent candidate in the country to get backing Devon candidate the only independent in UK backed by tactical voting site X \nCopy link to paste in your message / Comments (0) \nAn independent candidate has been backed by a website which tells voters how to vote tactically to prevent a Tory landslide next month. \nClaire Wright failed in her bid to unseat Hugo Swire in the East Devon seat in 2015, losing by 12,000 votes to the former Foreign Officer minister. \nAfter she announced her intention to run again in the snap general election on June 8, the chief tactical voting site Tactical 2017 endorsed her as the only candidate who can defeat the Conservatives. \nThis follows bookmaker's odds of 9/2 from William Hill, who confirmed that they see Ms Wright as the official opposition in the constituency and makes her the only non-aligned candidate to get support from the organisation. \nMs Wright decided to put her name forward after an appeal generated crowdfunding of £7,500 in just 10 days with 100 separate donations. \nShe said: This is half the amount we fundraised in a whole year during the 2015 General Election campaign. \n\"The momentum behind my campaign now is incredible. \n\"My boards and posters are appearing all over the constituency and my team continue to be deluged with offers of help, as my manifesto is hand delivered across East Devon by my army of helpers.\" \n\"People's generosity and faith in me is astonishing.\" \nMany Labour supporters, including MPs, admit the party cannot win a majority in the Commons. \nTheresa May has focused her campaign around the supposed threat from a \"coalition of chaos\" led by Jeremy Corbyn. \nThe endorsement comes as progressive alliances have been agreed in 31 constituencies in the past few weeks. \nThe Greens have stood down in 29 seats to give Labour or the Lib Dems a higher chance of winning, while the Lib Dems have stood down in two seats for the Greens. \nThere is also a drive at a local level towards tactical voting in areas where a progressive candidate has a good chance of beating the Conservative candidate. \nConservative Party chairman Patrick McLoughlin has warned that voting for either the Green Party or the Liberal Democrats would lead to votes for \"the nonsensical Corbyn\". \nIn East Devon, based on the result two years ago, Ms Wright would need to hoover up most of the 16,000 votes cast for the Lib Dems, Labour and UKIP to topple the incumbent. \nBut with UKIP's collapse and Tory wins in local elections, experts expect Brexit supporters to return to the Conservatives, potentially making the job harder. \nAdded to that, two other independent candidates are challenging for the seat this time around. \nThe backing comes as Ms Wright launches her manifesto in Sidmouth tomorrow (Thursday) evening. \nIntroducing the manifesto, the mother of one will outline plans to fight community hospital closures, press for more funding for social care and fight for a fair level of funding for local education. \n\"For small business I will work to reverse the recent increase in business rates, listen to small businesses and their requirements and work to achieve a better deal and be a champion for independent traders, especially those working in tourism,\" she added. \n\"For younger people I will work towards giving 16 year olds the right to vote; help young people to have a voice in improving their communities and work for improvements to underfunded mental health services, counselling and pastoral support in schools. \n\"On the environment, I accept that we need some development, especially for younger people and those of us on low incomes and I will work to amend the permissive National Planning Policy Framework so it is less about growth at any price and more about balanced communities. \n\"In East Devon nature, as elsewhere in the country, is in serious trouble due to habitat loss, pesticide use and climate change. \n\"I will listen and act upon local people's views on protection of the countryside and nature and urge government ministers to do all they can to comply with vital climate change targets. \n\"I am asking the people of East Devon to listen carefully to what I am saying and use their vote to elect a hardworking and effective MP to represent them in parliament.\" ", "external_links": [], "published": "2017-05-18T02:00:00.000+03:00", "crawled": "2017-05-17T20:31:50.000+03:00", "highlightTitle": ""}