{"organizations": [], "uuid": "0bfd66e1ebcbbb48eb69f6d44735a182170bd397", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30321650/15994283.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/tory-candidate-attacks-ben-bradshaw-s-independent-stance-as-bizarre/story-30321650-detail/story.html", "country": "GB", "title": "Exeter Tory candidate calls Ben Bradshaw's 'independent' election...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Exeter Tory candidate calls Ben Bradshaw's 'independent' election...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-10T04:00:00.000+03:00", "replies_count": 0, "uuid": "0bfd66e1ebcbbb48eb69f6d44735a182170bd397"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/tory-candidate-attacks-ben-bradshaw-s-independent-stance-as-bizarre/story-30321650-detail/story.html", "ord_in_thread": 0, "title": "Exeter Tory candidate calls Ben Bradshaw's 'independent' election...", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "james taghdissian", "sentiment": "none"}, {"name": "taghdissian", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "kevin brennan", "sentiment": "none"}, {"name": "fran", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "devon live", "sentiment": "none"}, {"name": "masonic hall", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "maidstone", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "st loyes", "sentiment": "none"}, {"name": "heavitree", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "exeter tory", "sentiment": "none"}, {"name": "cornwallis academy", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "exeter university", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "tardis", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cardiff west", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "college green", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "government exeter", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter Tory candidate calls Ben Bradshaw's 'independent' election stance 'bizarre' - The long read By WMN_PGoodwin   5 COMMENTS SHARES James Taghdissian says he wold be more effective on the Government benches than an opposition MP Exeter Tory candidate calls Ben Bradshaw's 'independent' election stance 'bizarr... X \nCopy link to paste in your message / Comments (5) \nThe candidate hoping to snatch Exeter back for the Tories claims Labour's Ben Bradshaw will be mired in political infighting if he wins back the seat. \nJames Taghdissian, the prospective parliamentary candidate for the city, has given his first interview since being chosen by the Conservatives at the weekend . \nThe barrister and father of two, who launched his campaign this week, has just four weeks to overturn Labour's 7,000-plus majority at the 2015 General Election. \nMr Bradshaw, a fierce critic of leader Jeremy Corbyn, has admitted Labour cannot win power on June 8 and has set out his stall as a constituency MP. \nHe has called on voters to support him as the only politician able to hold a Tory government to account and fight for the South West on issues around cuts to education and the NHS. \nMr Taghdissian says Mr Bradshaw's position is \"completely and utterly bizarre\" as he is \"trying to position himself as an independent\". \nHe added: \"It's an interesting way of positioning yourself as a politician and is essentially this: my leader is awful, my shadow cabinet team is awful and should not be let anywhere near the reins of power, I have written the election off in my own mind but vote for me because I am the Labour candidate because I'm a nice guy – that's essentially it.\" \nHe argues that a Tory majority is not inevitable nationally, claiming that Labour's divisions would offer a distraction from the Brexit negotiations, which is the most important issue facing the country. \n\"We have got a 17-seat majority and you only need a few seats to go and that disappears – the vote in Exeter matters just as much as elsewhere and it is extremely dangerous to suggest the result here doesn't matter,\" he told Devon Live. \n\"Ben is an extremely popular MP, I accept that, and it is good we have a popular MP but he is an isolated MP. \n\"He is estranged from the party leadership – they don't particularly like him, he doesn't like them – so his focus is going to be on resolving the issues of the Labour party – it is inevitable. \n\"This is the first election where the words \"vital\" are true – it is our biggest since the Second World War, trying to find a different path after 42 years of British trade and economic policy. \n\"If elected I would be part of the governing party with all the influence that has, not shouting from the opposition benches but explaining the issues, meeting with ministers and telling the Government Exeter voted Conservative and expects its interests to be protected. \n\"The focus has got to be on getting Brexit right – we don't need distractions such as who is going to be the next Labour leader getting in the way and that, sadly, is where Ben and the Labour party are.\" \nMr Bradshaw responded to the criticism and insisted he would stand or fall on his constituency reputation. . \n\"I never comment on or criticise other candidates,\" he said. \n\"I am running on my record of delivery for Exeter. I've spoken to many people who are not natural Labour supporters who will back me because they think it's vital to keep at least one opposition MP in the South West and because they value the work I've done for Exeter.\" \nMr Taghdissian – pronounced not with a hard \"g\" but instead like Dr Who's time-travelling Tardis – sat down with Devon Live for an interview following his selection by local party bosses at the Masonic Hall on Saturday. \nThe unusual surname comes from his Iranian father, who moved to the UK from Tehran in the 1970s and became a computer programmer, marrying his mother, a teacher, and settling down in Maidstone. \nHis elder son, now 35, grew up in a semi-detached house, attended the state comprehensive, Cornwallis Academy before going on to study law at Exeter University in 2000. \nHe met wife Fran, from Wales, and went on to have to boys, living in Heavitree and working as a self-employed barrister, practicing civil and family law as well as prosecuting and defending criminal cases. \nA runner, enthusiastic five-a-side footballer, cricketer and hockey umpire, he won the Polsloe seat on Exeter City Council between 2008 and 2012 but failed to be re-elected. \nHe then lost again in 2016 in St Loyes, finishing fourth to two Tories and a Labour candidate in a three-seat ward, gaining 12 per cent of the vote. \nHe also stood for Cardiff West in the 2015 General Election where he earned a 25.2 per cent share and lost out to Labour's Kevin Brennan. \nHe denies being an opportunist in seeking a Commons seat above all else, pointing out that his job and the danger of prejudicing cases precludes him from a long campaign. \nRead more: Labour's election campaign secret in Exeter revealed by fitness app \nThe snap election suits him better and he has taken a four-week break from legal work to concentrate on fighting for the Exeter seat. \nHe said: \"I was trying to become an MP, there is nothing wrong with [that], and I would like to become an MP for my home city.\" \nIn the EU referendum last June, he was swayed to vote to Remain after not being \"persuaded by the economic case to leave\". \nHe is concerned how the University of Exeter will fare well outside the European Union but accepts leaving the Single Market and the Customs Union as inevitable. \n\"It was a difficult one for me but I plumped for Remain in the end though I thought politically we should leave,\" he added. \n\"What I am looking for as a person interested in politics and someone in Exeter is a pragmatic Brexit. \n\"We have got a university Exeter which is probably the best in the world, as the saying goes – I went there and I am going to say that – and the uncertainty affects the people working there and the way it plans. \n\"The 20 to 30,000 students are a huge part of the population and a huge driver for the economy. Getting it right, making us a global Britain with immigration that works, attracting students from around the world, keeping the university thriving is a major issue and one that is pretty high on my agenda.\" \nAsked about schools funding – his son's primary school is expecting a £90,000 cut – he says he will not support the Tory funding formula, which works against rural areas like Devon. \nMr Bradshaw has criticised a so-called backbench Tory rebellion against the recent funding changes, which he says makes a bad situation worse. \nHe says the cuts schools are suffering, which mean they have to lay off teachers and other staff, are not the result of the funding formula. \n\"They are the result of an overall cut by the Conservative Government of 7 per cent in all school budgets between now and 2020. \n\"The Tories' proposed new formula would make the situation in Exeter even worse. Devon's Conservative MPs have had numerous opportunities to vote against these cuts in Parliament and have consistently failed to do so. I have shown by my actions, including at times voting against my own party leadership, that I will always put the interests of Exeter and my constituents first.\" \nAgain Mr Taghdissian claims a newly-elected voice from the Government benches will be more effective at reversing the policy than Labour \"railing\" from the opposition benches, which he says will have \"little of no effect\". \n\"If we have a substantial number of Conservative MPs saying 'we will not support this' then the Conservative government is likely to sit up and think again,\" he added. \n\"The proof of the pudding is what happened with benefit cuts - there was a huge rebellion which resulted in change. \n\"If you are working in parliament for your constituents you are not going to be standing on College Green railing against your party you are going to be having forceful, private conversations saying either you change this or you will not get my vote.\" \nAsked about the crisis in the NHS, in which his wife works, particularly in Devon where the massive deficit is the highest in England, Mr Taghdissian admits he is not an expert in the area, adding that he \"doesn't know the issues right, left and centre\". \n\"It would be a total lie to suggest that I did,\" he added. \n\"I use the NHS and my family have used it twice in the past eight months - it is extremely important to me and people are right to be concerned about the future. \n\"There is no easy solution to how the NHS is funded but I will do whatever I can to ensure it is safeguarded and remain the reliable service I have always found it to be. \n\"In terms of the funding, well, I think the Government knows it's important to get the funding for the NHS - quite how we do it, I don't know, and what the plans are, I will have to see the manifesto as well everybody else. \n\"I rely on it and I am not going to allow it to be destroyed or ruined in some way which is what the attack always seems to be against Conservatives.\" \nRead more: Where UKIP must go now if it is to survive - Devon County Council elections \nMr Taghdissian met with Devon Live in a cafe in Exeter as it emerged that Theresa May would allow Tory MPs a free vote on repealing the ban on hunting. \nHe refused to be drawn on the issue, claiming he had always lived in urban environments and had never hunted. \n\"I was only selected on Saturday and hunting has not crossed my agenda,\" he added. \n\"I will cross that bridge when I come to it.\" \nAsked about criticism of Theresa May for refusing to join in a televised media debate, he called the spectacle a \"fake environment\". \nHe called the leader's debate reduced the election to a \"personality contest\" and said he preferred a Question Time format. \nHowever, he did agree to take part in one of the proposed Devon Live election debates soon to be announced.", "external_links": [], "published": "2017-05-10T04:00:00.000+03:00", "crawled": "2017-05-10T00:03:56.000+03:00", "highlightTitle": ""}