{"organizations": [], "uuid": "1b4c9f85dc9913e7868a0ce55203f8ca4c206f45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13072353.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-could-more-flights-13072253", "country": "GB", "domain_rank": 21960, "title": "North East could get more flights to London under Heathrow plans", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-22T20:00:00.000+03:00", "replies_count": 0, "uuid": "1b4c9f85dc9913e7868a0ce55203f8ca4c206f45"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-could-more-flights-13072253", "ord_in_thread": 0, "title": "North East could get more flights to London under Heathrow plans", "locations": [], "entities": {"persons": [{"name": "emma gilthorpe", "sentiment": "none"}, {"name": "simon laffin", "sentiment": "none"}, {"name": "zac goldsmith", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "durham tees valley", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East could get more flights to London under Heathrow plans Heathrow wants to ring-fence flight slots for domestic services, which was previously impossible under EU regulations Share A plane taking off from Heathrow Airport (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBrexit could give the North East more flights to Heathrow because of a relaxation of competition laws. \nHeathrow has written to the Government asking it to ring-fence a number of flight slots for domestic services so that regions like the North East can benefit from the planned expansion of the airport. \nThis has previously been impossible because EU regulations prohibit discrimination against other member states. \nBut Heathrow - which enlisted the help of many UK regions as it tried to make a case for a third runway - says ring-fencing slots for domestic services will ensure that UK regions retain access to the nation’s largest hub airport and the onward connections and trading links that provides. \nThe move has been welcomed by business leaders in the North East, though it has sparked a row with British Airways , which operates some of Newcastle’s current flights to Heathrow. \nHeathrow’s executive director for expansion Emma Gilthorpe said: “We’ve always been clear that an expanded Heathrow must deliver for all of Britain and that’s why we’re urging the Government to back our proposal to ring-fence slots at an expanded Heathrow for domestic use – an opportunity now possible because Britain is leaving the EU. \n“Every corner of our country should be able to benefit from the growth and trade that stems from links to the nation’s hub airport. We look forward to working alongside ministers, our airlines and stakeholders on the details of this exciting proposal to boost Britain’s domestic connectivity.” \nHeathrow has previously said that the North East would gain up to 5,000 new jobs from a third runway while Durham Tees Valley could be one of six airports to get new links to the capital. \nBusiness leaders in the region consistently backed Heathrow’s bid for expansion for the links the airport provides to overseas trade, though high profile opponents of the expansion remain in the likes of Foreign Secretary Boris Johnson and Zac Goldsmith, who is hoping to get back into Parliament after losing his seat last year. Read More Prime Minister accused of 'dither and delay' over Heathrow expansion \nJonathan Walker, head of policy at the North East England Chamber of Commerce, said: “Access to the country’s international hub airport is vital for businesses across North East England. As a strong exporting region with growing global aspirations it is essential that we are able to build upon the excellent connectivity to Heathrow we currently enjoy from Newcastle Airport. \n“Protecting and expanding connections to Heathrow from the regions of the UK will ensure that our businesses can reach markets and opportunities around the world.” \nHeathrow’s proposals have also been backed by Simon Laffin, chairman of Flybe, which runs a number of routes out of Newcastle. \nHe said: “We are delighted that Heathrow has committed to increase the number of domestic connections the airport serves. UK domestic connectivity is key to Heathrow’s position as a leading hub airport. \n“Flybe recently successfully launched two new routes to Heathrow, from Edinburgh and Aberdeen, delivering enhanced connectivity for passengers in Scotland, London and the South East. We look forward to working with Heathrow to develop more domestic routes to ensure the expanded airport benefits the whole of the UK.” Like us on Facebook ", "external_links": [], "published": "2017-05-22T20:00:00.000+03:00", "crawled": "2017-05-22T16:01:55.000+03:00", "highlightTitle": ""}