{"organizations": [], "uuid": "6ba402264ec2bdf09c335bc9d095b72a6ee9f203", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13058565.ece/ALTERNATES/s1200/Out-Of-Order.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/theatre-news/say-good-moaning-arthur-bostrom-13057794", "country": "GB", "domain_rank": 21960, "title": "We say 'Good moaning' to Arthur Bostrom as the ’Allo ’Allo star returns to the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-19T23:00:00.000+03:00", "replies_count": 0, "uuid": "6ba402264ec2bdf09c335bc9d095b72a6ee9f203"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/theatre-news/say-good-moaning-arthur-bostrom-13057794", "ord_in_thread": 0, "title": "We say 'Good moaning' to Arthur Bostrom as the ’Allo ’Allo star returns to the North East", "locations": [], "entities": {"persons": [{"name": "arthur bostrom", "sentiment": "negative"}, {"name": "jeremy lloyd", "sentiment": "none"}, {"name": "arthur", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "horne", "sentiment": "none"}, {"name": "david croft", "sentiment": "none"}, {"name": "croft", "sentiment": "none"}, {"name": "jane", "sentiment": "none"}, {"name": "richard willey", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "artois", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "bostrom", "sentiment": "none"}, {"name": "crabtree", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "gorden kaye", "sentiment": "none"}, {"name": "ray cooney", "sentiment": "none"}, {"name": "jeffrey harmer", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east what", "sentiment": "none"}, {"name": "prebends bridge", "sentiment": "none"}, {"name": "west end", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "forestry commission", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "newcastle theatre royal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "6ft 4ins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On We say 'Good moaning' to Arthur Bostrom as the ’Allo ’Allo star returns to the North East The Durham University graduate plays a hotelier in Ray Cooney's award-winning farce Out of Order at the Theatre Royal Share Arthur Bostrom and Jeffrey Harmer in Out of Order (Photo: Newcastle Theatre Royal) Share Get what's on   Thank you for subscribing!   \nIt would be understandable if Arthur Bostrom refused point blank to do interviews, or even venture out of the house, before midday. \nThat would reduce the risk of him being greeted with “Good moaning”. \nAttempts at humour can be tiresome if you’re always on the receiving end, as was made clear to me by the man I saw walking four Dalmatians. \n“Where are the other 97?” I inquired cheerfully. \nIn return came the grunt of a man who wished long ago that he had opted for spaniels. \nFor those not old enough to remember, Arthur played Crabtree, a British spy posing as a French police officer in the sitcom ’Allo ’Allo, which ran on BBC One from 1982 to 1992 (85 fondly remembered episodes in all). \nThe joke about Crabtree was that he was working behind enemy lines in occupied France because he could speak French. \nThe fact that he couldn’t speak it very well was conveyed by the actor’s scripted mangling of the English language. Hence his “Good moaning” for “Good morning”. \nAfter resisting the urge to address Mr Bostrom with “Good moaning”, I tentatively suggested that people must regularly do that very thing. \n“Ha ha,” he replied rather drily. “I’m afraid they do, yes.” \nThe phone line went quiet and a memory of the unamused Dalmatian man sprang to mind. \nBut Arthur was still there. “I’m moving around, pouring some coffee,” he explained. \nAt 62, he is still a hard-working actor and part of the cast bringing Ray Cooney’s Olivier Award-winning political farce, Out of Order, to the Theatre Royal next week. \nArthur plays the manager of a Westminster hotel in which all sorts of political shenanigans are taking place. \nA Tory junior minister, Richard Willey, has been trying to spend the evening with Jane, a secretary working for Her Majesty’s Opposition. \nIt doesn’t go according to plan. Jane’s distraught husband turns up, there’s an unscrupulous waiter and, oh yes, there’s a dead body. \n“It’s going well,” said Arthur. “The actual mechanics of it are classic farce. \n“It’s been around since the early 1990s but because its lead character is a junior minister in the Conservative government, it has now been updated with some modern references, so we have Theresa May and Jeremy Corbyn and even mentions of the upcoming election. \n“I think people really like that.” \nI think Arthur meant audience members rather than the aformentioned leaders of Britain’s two biggest political parties. Anything smelling of ‘sleaze’ tends to make politicians look queasy. \nArthur plays his hotel manager with the stiffest of stiff upper lips. \n“The hotel manager is a very deadpan person,” he explained. \n“He has this strict, forbidding demeanour, as if to say, ‘Not in my hotel’. \n“He’s described in the script as severe and that’s his function and that’s my function.” \nThe play is the thing and the actors must trust to the script and the director. \n“You’ve definitely got to do that because everyone in this is in it up to their necks,” said Arthur, who at 6ft 4ins is more ‘in it’ than most. \n“If you do give away that you kind of know that something’s funny, that’s when the mask slips. \nBut there were, he allowed, occasions when the mask could be allowed to slip. \n“There was a moment, weeks ago when we were first starting out, when a curtain fell down and someone in the cast made a reference to it that was very clever and everyone enjoyed it. \n“I suppose you could say that’s the joy of live theatre.” \nAudiences had been revelling in the production so far, he said. \n“They tend to be two steps ahead of us all the time and every night there are gales of laughter. \n“I think people need that at the moment.” \nThere’s nothing very funny about politics at the moment, we agreed. \nArthur Bostrom is no stranger to the North East, it turns out. Although he was born in Rugby, he went to Durham University. \n“It was while I was at Durham that I started acting,” he said. \n“At school I was always imitating teachers and that was my way to impress people. You’ve always got to have something that people notice you for and I could make people laugh, although I never saw that as remarkable at the time. \n“I had bit parts in school plays and people were very complimentary, saying, ‘You should go to drama school’. \n“I’d also done an amateur play in my home town but you tend to think you’ll be found out and that everyone else must be brilliant but then you realise they’re not. \n“At Durham I became a leading light in the revue company and we did a Shakespeare play, Twelfth Night, beside Prebends Bridge.” Arthur Bostrom as the hotel manager in Out of Order (Photo: Newcastle Theatre Royal) \nOstensibly Arthur was in Durham from 1974-77 to study geography. \n“It was the place to go for geography. It had a huge and wonderful department,” he recalled. \n“I suppose I saw myself out somewhere in the field eventually, working for something like the Forestry Commission. But I got derailed by circumstances. \n“Really it was during my last year in Durham that I thought: ‘What do I want to do in life? What do I enjoy most?’ \n“It was acting, so I decided to go for it. People seemed to think I was good enough and that’s the thing. It gives you confidence.” \nAsked if he had had any moments of regret, he said: “Well, I suppose I could have had a more regular income. But I am trying to rediscover my interest in geography. \n“The Royal Geographical Society made me a fellow so I’m hoping to do something more in that line. \n“I’ve done some presenting on radio programmes and I’d like to go back into the field, literally and figuratively, and put it out there how important it is. \n“How did geography lead to acting? Well, it does actually because we were taught to notice things. \n“You go out and see a town in the landscape and work out how it came to develop there and it does make you observant and that’s what you need as an actor. \n“If you’re going to represent different types of people and characters, you need to be sharp and have your eyes and ears open, so those techniques follow on.” \nGrowing up, said Arthur, he loved the madcap 1960s radio show Round the Horne. \n“But my favourite comedy series on television was Dad’s Army and my ambition was to work with David Croft.” \nIt was Croft who, with Jeremy Lloyd, created ’Allo ’Allo, which is now regarded as a classic BBC sitcom. \n“It was absolutely huge,” said Arthur who joined in series two as Crabtree. \n“In the early days there were only four channels and it was always in the top 10 programmes. \n“But it used to get 15m viewers which was absolutely gigantic. Then we did the stage version in the West End and on tour and it was sold out every night. It was ridiculous.” \nArthur said he didn’t find it hard to do Crabtree’s uniquely scrambled language, uttering such immortal lines as: “I was pissing by the door when I heard two shats.” \nAnd as he recalled it, he started to laugh. \n“I remember when I auditioned for it and saw the script, I thought: this is brilliant. It was a send-up of anyone going to France with their phrasebook. We are very lazy with languages. \n“There’s one scene which I think explains why Crabtree got away with it. \n“René (Artois, the café owner played by the late Gorden Kaye) says, ‘Your accent is terrible’. And I say, ‘Nobiddy ’as comploned so fur’. I thought that was such a British attitude.” 'Allo 'Allo (Photo: BBC) \nIronically, said Arthur, he is the proud possessor of a French A level. \n“I’ve got a good ear so I can do the accent. I can take a piece of French and make it sound pretty good. I can go that guttural sound, as in ‘RRRené’. \n“But my French master at school got quite a lot of flak once I’d started appearing on television.” \nIt was ‘Good moaning’, though, which tickled the nation’s funnybone and Arthur, having warmed to his theme, said he had heard it many, many times. \n“After I said it for the first time, everyone with me in rehearsal was saying it and David and Jeremy, who were always looking for a catchphrase, put it in every episode after that. \n“It just took off. I’ve heard people using it as a greeting in shops and thought they must have recognised me but then realised they haven’t.” \nAnd at this point Arthur said he is writing a book which should come out in time for Christmas. \nThe working title is Good Moaning France and it will be a Crabtree-style guide to the French language. \n“It is ridiculous but I did a quick version to see how it would go down and people loved it, so I’m doing a proper one. I’ve had the go-ahead from David Croft’s estate. \n“It’s the sort of thing people will probably put in the bathroom but it made me laugh writing it.” \nWith a new French president in office and Brexit looming, the timing could be perfect – even if the book could also set a record for the longest gap between a hit show and a piece of spin-off merchandise. \n“The thing is,” said the man who on TV declared ‘I admit my Fronch cod be butter’, “I’m a great fan of France. I love going there and I think the country has a great deal to offer.” \nIn a funny way, it certainly offered Arthur Bostrom a chance to shine. \n* Out of Order is at Newcastle Theatre Royal from Monday, May 22 to Saturday, May 27. Tickets: www.theatreroyal.co.uk or tel. 08448 112121. Like us on Facebook", "external_links": [], "published": "2017-05-19T23:00:00.000+03:00", "crawled": "2017-05-19T18:33:05.000+03:00", "highlightTitle": ""}