{"organizations": [], "uuid": "40ec9520db4f54bb32793705ec7bd8ab6210f1b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12681012.ece/ALTERNATES/s1200/green-wall.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13077689", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Marks & Spencer profits tumble as clothing sales slip", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-24T15:00:00.000+03:00", "replies_count": 0, "uuid": "40ec9520db4f54bb32793705ec7bd8ab6210f1b5"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13077689", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Marks & Spencer profits tumble as clothing sales slip", "locations": [], "entities": {"persons": [{"name": "kevin green", "sentiment": "none"}, {"name": "petards", "sentiment": "none"}, {"name": "veronique laury", "sentiment": "none"}, {"name": "jon mabbitt", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "sarat pediredia", "sentiment": "none"}, {"name": "kantar worldpanel", "sentiment": "none"}, {"name": "kantar", "sentiment": "none"}, {"name": "sarat pediredla", "sentiment": "none"}, {"name": "eaton", "sentiment": "none"}, {"name": "rowe", "sentiment": "none"}, {"name": "neil hart", "sentiment": "none"}, {"name": "jonathan brady/pa wire", "sentiment": "none"}, {"name": "fraser mckevitt", "sentiment": "none"}, {"name": "seb james", "sentiment": "none"}, {"name": "richard scaife", "sentiment": "none"}, {"name": "steve rowe", "sentiment": "none"}, {"name": "aidan baker", "sentiment": "none"}, {"name": "jamie mableson", "sentiment": "none"}, {"name": "chris herron", "sentiment": "none"}, {"name": "milton keynes", "sentiment": "none"}, {"name": "laury", "sentiment": "none"}, {"name": "muller", "sentiment": "none"}], "locations": [{"name": "trafalgar street", "sentiment": "none"}, {"name": "coreena ford gateshead", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "wilton", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "wellington hotel", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "screwfix", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "east-west london crossrail", "sentiment": "none"}, {"name": "collingwood street", "sentiment": "none"}, {"name": "kingsmill", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "coreena ford nissan", "sentiment": "negative"}, {"name": "coreena ford tech", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "fuse connect", "sentiment": "none"}, {"name": "university of sheffield advanced manufacturing research centre", "sentiment": "none"}, {"name": "amrc", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "dixons carphone", "sentiment": "none"}, {"name": "kantar worldpanel", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "halfords - jill mcdonald", "sentiment": "none"}, {"name": "coreena ford marks & spencer", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}, {"name": "fuse telecoms", "sentiment": "none"}, {"name": "metnor property group", "sentiment": "none"}, {"name": "cadbury dairy milk", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "castorama", "sentiment": "none"}, {"name": "fuse telecom", "sentiment": "none"}, {"name": "diamond strip", "sentiment": "none"}, {"name": "prodrive composites limited", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "ruskin photography", "sentiment": "none"}, {"name": "agm", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "metnor property group ltd", "sentiment": "none"}, {"name": "bombardier transportation", "sentiment": "none"}, {"name": "eaton", "sentiment": "none"}, {"name": "b&q", "sentiment": "none"}, {"name": "collingwood buildings", "sentiment": "none"}, {"name": "coreena ford b&q", "sentiment": "none"}, {"name": "rec", "sentiment": "none"}, {"name": "brico depot", "sentiment": "none"}, {"name": "recruitment and employment confederation", "sentiment": "none"}, {"name": "cadbury", "sentiment": "none"}, {"name": "kingfisher", "sentiment": "none"}, {"name": "generator studios", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "bombardier", "sentiment": "none"}, {"name": "coreena ford dixons carphone", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "coreena ford boutique", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "bnp paribas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Nissan to launch home batteries that can save people hundreds off their energy bills \nAutomotive giant Nissan is taking a leap into a lucrative new market with a partnership that will allow people to control and store energy in their own homes and avoid rising power bills. \nBattery cells made by Nissan at its Sunderland plant for electric cars are to be made available for use in people’s homes thanks to a link-up between the Japanese firm and US power company Eaton. \nPeople will be able to buy used batteries that are no longer fit for use in vehicles, in a move that Nissan hopes will make power storage affordable to thousands of people. \nThe project will also have the benefit of making renewable energy sources such as solar panels more attractive by giving homeowners a means of storing electricity produced from them until it is needed. \nThe xStorage device developed by Nissan and Eaton will be available from September at a price of around £3,500. The two firms hope to sell more than 100,000 units over the next five years with the promise of reducing people’s energy bills by more than £500 a year. Home energy storage unit being produced by Nissan and US firm Eato (Photo: Copyright unknown) 9.00 Coreena Ford Firms planning to boost temp workforce amid chronic skills shortages \nFirms are set to become more reliant on temporary workers in the coming months to plug a shortage of skilled staff, a report says. \nA survey of more than 600 employers showed virtually all were planning to increase or maintain their temporary workforce. \nThe Recruitment and Employment Confederation (REC) said the trend was in response to fewer candidates available to fill permanent vacancies. \nAlmost half of those questioned said they expected a shortage of workers for certain jobs, especially in construction, engineering, health and social care. One in five businesses said hiring agency staff would be more expensive than having permanent employees. \nREC chief executive Kevin Green said: \nThis looks like a tipping point for the jobs market. \nFaced with chronic skills shortages, some employers are giving up on trying to fill permanent vacancies, and instead looking for temp resource to ensure they have the manpower needed to meet demand. \nFor jobseekers this means there are opportunities out there to boost earnings, because employers are prepared to pay a premium for people to fill vacancies on an interim basis. “We could see this become a more attractive option for people in the context of rising inflation and poor pay growth. \nFor employers there is a growing sense of urgency about the skills shortage because it threatens to throw the UK jobs market off track. 8.56 Coreena Ford Marks & Spencer CEO Steve Rowe's comments on full year results \nChief executive Steve Rowe said consumer spending on clothing was “extremely volatile at the moment and slightly depressed”. \nThis comes as the squeeze from the Brexit-hit pound takes its toll on household budgets, while high street chains have also been impacted by a shift in spending towards leisure and eating out. \nBut Mr Rowe said the group’s “self-help” measures would help it ride out the tougher trading. \nIt has stripped out eight online sales and three store promotions and plans to reduce in-store clearance events from six to four over the current year. \nThis means M&S has seen its longest run of full-price sales days for a decade, with full-price sales surging by around 11% in the second half of its financial year. “We’ve got much more to do, but we’re on track,” said Mr Rowe. \nShares fell initially, but have recovered to stand nearly 2% higher. 8.55 Coreena Ford Tech firms hedgehog lab and Fuse Telecoms expand further into Generator Studios \nNorth East app developer hedgehog lab has expanded its headquarters after growing its workforce on the back of a 160% rise in revenues. \nThe global technology consultancy, based at Generator Studios in Newcastle, has seen staff numbers rise from 46 to 120 people as demand for its innovations soars. \nNow the firm, which also has offices in London, Boston, Austin, Denmark and India, has leased space extending to around 7,500 sq ft for its Newcastle employees, having outgrown the initial 1,700 sq ft of space it took on five years ago. \nhedgehog lab CEO Sarat Pediredla said: “Our offices at Generator Studios have served us well and we are sure the new space will benefit us greatly as we continue to work with global brands and push the boundaries of emerging technologies such as Virtual Reality.” \nGenerator Studios, a 42,400 sq ft scheme owned by Metnor Property Group Ltd on Trafalgar Street, provides studio accommodation in a Grade II-listed building for a range of businesses. \nThe building offers a range of small to large suites of contemporary design and innovative working space with ample expansion opportunities, attracting a number of high-tech occupiers in recent years. \nBusiness telecoms provider Fuse Telecom has also taken further space at Generator Studios. \nThe expanding firm has doubled its floorplate in order to meet demand for its new business, Fuse Connect, which provides 4G data connections and access solutions for construction sites and remote locations. Left to right: Aidan Baker (BNPPRE), Sarat Pediredia (CEO, hedgehog lab) and Jamie Mableson (Metnor Property Group). (Photo: BNP Paribas) 8.50 Coreena Ford B&Q owner Kingfisher posts drop in sales \nSales at B&Q owner Kingfisher dipped in the first quarter after a slowdown at the firm’s French division hit its performance. \nThe group posted a 0.6% decline in like-for-like sales in the three months to April 30, with comparable sales falling 5.5% in France, where the group trades as Castorama and Brico Depot. \nHowever, in the UK like-for-like sales rose 3.5%, helped by surging revenues at Screwfix, where same-store sales rocketed 12.6%. \nTotal revenues came in at £2.86bn over the period and Kingfisher chief executive Veronique Laury, who is overseeing a turnaround plan at the retailer, said: “We have set ourselves up well for our transformation, which continues in line with our plans. \n“Strong performance in Screwfix and Poland continues, though performance in France remains weak.” \nThe group has recently completed a B&Q store closure programme, which has seen it shut 65 shops and slash around 3,000 jobs in the UK and Ireland over the last two years. \nMs Laury also flagged business disruption linked to clearing old ranges and the rollout of a new unified IT platform. \nKingfisher shares are currently 6.6% down at 335.30p. B&Q logo Coreena Ford Gateshead's Petards on track for more rail success with flagship technology system \nGateshead security specialist Petards has secured a new £3m contract with train manufacturers Bombardier for its flagship product. \nThe Team Valley business, which employs more than 100 people, announced it has been awarded a contract to supply Bombardier Transportation with Petards eyeTrain systems. \nThe new multimillion-pound contract will see the firm supply the hi-tech CCTV systems to be fitted to five and 10-car Bombardier Aventra trains, which are currently under construction by the rail manufacturer ahead of being used for the first time on the East-West London Crossrail project. \nEngineering activities are starting straight away, with the first equipment deliveries starting in July 2017 and it is expected that the project will be completed in 2019. \nThe AIM-listed firm announced the contract on the same day as its annual report was published, detailing a successful year with revenues rising 17% to £15.3m and EBITDA increasing by 28% to £1.62m. \nAnd that growth is put down to demand for the eyeTrain system. \nPetards, which first listed backed in 1997, makes and maintains technologies used for advanced security and surveillance within transport, defence and the emergency services, but it’s the eyeTrain brand, software driven systems that can provide everything from automatic passenger counting systems and driver’s view cameras to saloon car CCTV, that is getting picked up by rail operators everywhere and eyeTrain products accounted for 60% of group revenues. Petards' eyeTrain systems are to be installed in the new Bombardier Aventra trains as part of the new contract (Photo: PA) 8.40 Coreena Ford Boutique business centre on Newcastle's Diamond Strip gets £300,000 investment \nA boutique business centre within a historic building on Newcastle’s Diamond Strip has had a £300,000 makeover to attract new tenants. \nThe owners of the Grade II listed Collingwood Buildings on Collingwood Street have invested the six-figure sum to deliver more top quality offices in the city centre, where Grade A office space is dwindling. \nThe investment breathes new life into the buildings, which were first created back in 1899 to provide shops, offices and a banking hall on the site of the former Wellington Hotel. \nNow the building has been updated to provide luxury amenities including shower facilities and complimentary beverages. \nCollingwood Buildings has 130 fully furnished offices, 35 of which are currently available. \nThe suites, which are on the market with chartered surveyors and estate agents Bradley Hall, range from 125sq ft to 2,000 sq ft. \nNeil Hart, managing director at Bradley Hall, said: “The Collingwood Buildings stand out as a collection of the region’s most impressive office suites thanks to the newly refurbished interiors, additional facilities and the benefit of its fantastic city centre location. \n“Opportunities to occupy spaces like this, especially at such a fair rental cost, don’t come around very often. We anticipate the suites to be filled very quickly after coming to market.” Inside Collingwood Buildings in Newcastle which has a boutique business centre (Photo: Ruskin Photography) 8.34 KEY EVENT Applied Graphene Materials announces major breakthrough in technology \nNorth East ‘wonder material’ manufacturers Applied Graphene Materials (AGM) has announced a major breakthrough involving the patenting of new technology. \nThe Redcar firm is one of a handful across the UK involved in the potentially multi-billion pound graphene market, racing to commercialise graphene - a form of carbon that is tougher than diamond, a better conductor than copper and is just one atom thick. \nNow the firm has registered a patent after developing a highly innovative new technology called Structural InkTM, which can be printed directly onto composites, that once fully commercialised will be targeted at the advanced composites industry. \nFour firms are already working with AGM, exploring Structural Ink, including Milton Keynes based Prodrive Composites Limited, which works in the motorsport industry. \nThe team at Wilton, Redcar, is already working on a number of partnerships looking at ways to apply graphene and now they have signed heads of terms for a Joint Development Agreement (JDA) with the University of Sheffield Advanced Manufacturing Research Centre with Boeing. \nRichard Scaife, the AMRC Composites Centre manager, said: “Over the last 24 months, our research staff and engineers have been collaborating with Applied Graphene Materials on its Structural InkTM technology development and we are delighted that we are now able to progress to a formal, long term agreement. \n“While this technology is still relatively immature in aerospace terms, we believe it highlights significant potential for performance improvements with both weight and cost savings to those designing critical composite structures. \n“ In the near future we will be sharing information on this technology with our aerospace partners, but also see the potential for early adoption with partners operating in less safety critical industrial sectors.” \nJon Mabbitt, Chief Executive Officer of Applied Graphene Materials, said: “We are very excited about the opportunity that Structural InkTM opens up for AGM and our customers. Whilst we continue to collaborate with customers on developing tailored graphene dispersions for a range of applications, this printing technology offers AGM another route to market and a tried and tested product offer that we believe will be very compelling for composites end users. It is pleasing that we are being recognized as a highly supportive and competent development partner for industrial graphene applications. The foundations we have laid over the last 3 years are really starting to bear fruit. We have consistently focused on the core markets where we know we can deliver significant enhancements for large-scale industries and our collaborations across these areas continue to build momentum.” CEO of Applied Graphene Materials plc, Jon Mabbitt, right, with colleague Dr Chris Herron. 8.20 Coreena Ford Shoppers spurning brands in favour of supermarkets' own labels \nBritons are turning away from brands in favour of supermarket own label groceries, spurred on by the success of discounters such as Aldi and Lidl, figures show. \nEvery brand named in an annual top 10 by analysts Kantar Worldpanel has seen the proportion of the population buying them fall by an average 2.5%. Overall, branded sales of fast-moving consumer goods (FMCG) have decreased by 1.6% compared with own brand growth of 1.7%. \nHowever, Britons appear to be increasingly favouring local brands, with the number of British favourites among the top 10 increasing to seven from six last year. \nFor the first time ever, none of the world’s 10 most chosen brands appear in the equivalent UK top 10 ranking, Kantar said. \nIn the UK, five of this year’s top 10 brands - Kingsmill, Walkers, Muller, Cadbury Dairy Milk and Cadbury - have seen consumers buy their goods more frequently, even though the percentage of the population buying them has fallen. \nFraser McKevitt, head of retail and consumer insight at Kantar Worldpanel, said: “British retailers have stepped up their own label offer, consolidating and recalibrating their private-label lines in response to consumer demand for quality goods at low prices. \n“The growth of Aldi and Lidl’s market share has also played a role as consumers become accustomed to seeing non-branded products on the shelves.” Cadbury's is still a favourite brand - but retailers' own brands are gaining in popularity 8.13 Coreena Ford Dixons Carphone sees revenues rise \nElectricals and mobile phones giant Dixons Carphone has hailed rising full-year revenue, despite what it described as a “lively political backdrop”. \nThe retailer reported a 9% rise in annual sales, with like-for-like sales growing 4% in the period. \nAs a result, Dixons Carphone expects pre-tax profit for the full year to come in between £485m to £490m. \nIn the UK, full year revenues were up 2% and like-for-like sales rose 4%. \nChief executive Seb James said: “Despite a lively political backdrop, we have been able to continue to grow our business and maintain very high levels of customer satisfaction across the group.” \nThe firm said that in the fourth quarter, sales in the UK and Ireland were impacted by the later launch of the Samsung S8 and by a late Easter. \nAs a result, revenue in the UK fell 1% in the fourth quarter, although like-for-like sales nudged up 2%. \nMr James added: “Given our performance despite this headwind, our view is that the UK consumer continues to be active in the market, but we anticipate no let-up in their very rational view that price and service are critical factors in deciding where to shop.” \nThe chief executive said in January the retailer is primed to ride out a Brexit-induced economic slowdown and backed UK shoppers to keep spending with credit while borrowing is cheap. 8.07 What's the FTSE latest? \nThe FTSE-100 index opened at 7485.29. \nThe pound at 8am was 1.2972 dollars compared to 1.2982 dollars at the previous close. The euro at 8am was 0.8615 pounds compared to 0.8633 pounds at the previous close. 8.00 KEY EVENT M&S profits plunge by 63.5% amid clothing sales dip \nRetail giant Marks & Spencer has seen annual profits tumble by nearly two thirds and revealed sales across its under-pressure clothing arm have plunged back into reverse. \nChief executive Steve Rowe admitted the group’s overhaul has “come with a cost” as he posted a 63.5% plunge in bottom line pre-tax profits to £176.4m on a comparable 52-week basis. \nUnderlying pre-tax profits were 10.3% lower at £613.8m in the year to April 17. \nThe group said sales in its clothing business dropped 5.9% in the last three months, with falls compounded by the timing of Easter, marking an abrupt end to the revival seen in the third quarter, when sales rose by 2.3%. \nM&S said the timing of its December sale also knocked fourth quarter trading which, when combined with the Easter impact, knocked around 3.8% off clothing and home sales and around 1.9% off food sales. \nThis left like-for-like sales in its food halls 2.1% lower in the quarter. \nThe profits plunge comes as Mr Rowe has invested heavily in slashing prices and overhauled its clothing ranges to win back customers. \nIts bottom line results were also hit by the cost of its swingeing UK store closure programme, its move to pull out of 10 international markets and the decision to shut its defined benefit staff pension scheme to future accrual. \nM&S said it plans to cut store space devoted to clothing and home products by around 1% to 2% and revamp around 25% of its non-food shop space in the current financial year, while growing its Simply Food chain by around 90 new stores. \nIt wants to add around another 250 new Simply Food outlets by the end of the 2019/20 financial year. But the cost of its turnaround will continue to weigh on results, the group warned, particularly in the first half of the new financial year. \nM&S has recently poached the chief executive of Halfords - Jill McDonald - to lead the turnaround in its clothing business. A Marks and Spencer store (Photo: Jonathan Brady/PA Wire) Share", "external_links": [], "published": "2017-05-24T15:00:00.000+03:00", "crawled": "2017-05-24T23:05:09.000+03:00", "highlightTitle": ""}