{"organizations": [], "uuid": "fd17fd943af8bc9ae8ae91559744b67cb401b7db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30327679/15998385.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/ukip-chairman-explains-why-they-are-not-fielding-a-candidate-in-exeter/story-30327679-detail/story.html", "country": "GB", "title": "UKIP chairman explains why they are not fielding a candidate in...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-12T04:04:00.000+03:00", "replies_count": 0, "uuid": "fd17fd943af8bc9ae8ae91559744b67cb401b7db"}, "author": "DanielClark", "url": "http://www.devonlive.com/ukip-chairman-explains-why-they-are-not-fielding-a-candidate-in-exeter/story-30327679-detail/story.html", "ord_in_thread": 0, "title": "UKIP chairman explains why they are not fielding a candidate in...", "locations": [], "entities": {"persons": [{"name": "james taghdissian", "sentiment": "none"}, {"name": "vanessa newcombe", "sentiment": "none"}, {"name": "newton abbot lib dem", "sentiment": "none"}, {"name": "joe levy", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "jonathan bishop", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "jonathan west", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "exeter conservatives", "sentiment": "none"}, {"name": "ukip exeter", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "exeter ukip", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UKIP chairman explains why they are not fielding a candidate in Exeter By DanielClark | Posted: May 11, 2017 0 COMMENTS SHARES UKIP are not standing in Exeter UKIP chairman explains why they are not fielding a candidate in Exeter X \nCopy link to paste in your message / \nThe chairman of the Exeter UKIP branch has explained why they will not be fielding a candidate in Exeter in the upcoming general election. \nThe deadline for nominations closed on Thursday afternoon at 4pm – with no UKIP candidate standing in Exeter. \nThe six candidates who are vying for the seat are James Taghdissian (Conservative), Vanessa Newcombe (Liberal Democrats), Joe Levy (Green), two independents in Jonathan West and Jonathan Bishop, and previous MP Ben Bradshaw (Labour). \nThe Green Party will stand after a deal to stand aside and help Labour was rejected. Read more Labour's election campaign secret in Exeter revealed by fitness app \nShe said: \"As the only true Brexit party we are morally obligated to ensure that the result of the referendum last year is carried out and that we not only leave the EU but also the single market and customs union. To stay in the single market is, in substance, to stay in the EU. \n\"The Exeter constituency will be a close-run thing between Labour and the Conservatives. If we had stood a UKIP candidate, we would split the Conservative vote and in doing so cause the return of the anti-democratic Ben Bradshaw. This poses a danger to Brexit and democracy. Read more Newton Abbot Lib Dem election candidate confident she can take... \n\"Ben Bradshaw voted not to trigger article 50 and in doing so betrayed the British people. For obvious reasons this election, Mr Bradshaw is understandably desperate to distance himself from the party he belongs to and represents. He is trying to manipulate and dupe the electorate into not associating the Marxists Messrs. Corbyn and McDonnell with himself but I doubt Exeter will be fooled by a seasoned politician's spin. \n\"Of course, he could leave the party and stand as an independent but he knows that to do this would be electoral suicide for him. So instead, his aim is to take the unthinking Labour vote by default, and persuade everybody else that he is effectively an Independent. \n\"UKIP Exeter has taken the decision to clear the way for the Conservatives to take on Bradshaw. \n\"It is important to stress here that no 'deal' in anyway was made with the Tories. Read more Exeter Conservatives choose local barrister to take on Ben... \n\"I, as chairman, have not spoken to a single official from the Conservative party. This decision has been made purely on the basis that the conservatives have more chance of getting rid of Bradshaw. \n\"This is by no means to say that UKIP doesn't have plenty to offer in Exeter after this general election. UKIP has put this country back on track, it has set the political agenda and taken on issues that other parties were blind to or simply lacked the moral courage to address. We will continue to listen and address the very genuine concerns of the British people and our soon to be released manifesto will lay out what we stand for, what we value and what we'll fight for. \n\"As a moral and proudly patriotic party UKIP will always put country before party. We are a party that was borne out of a strong moral sense of what is right and we intend to always put the British people and democracy first and if in this case that means standing aside, so be it.\"", "external_links": [], "published": "2017-05-12T04:04:00.000+03:00", "crawled": "2017-05-11T23:54:51.000+03:00", "highlightTitle": ""}