{"organizations": [], "uuid": "af1e9c947f6cc7fc23387b1cfdb8df7c10b6db05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13062792.ece/ALTERNATES/s1200/JS120106193.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13110148", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Sterling falls as poll suggests Tories will lose majority", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-31T14:55:00.000+03:00", "replies_count": 0, "uuid": "af1e9c947f6cc7fc23387b1cfdb8df7c10b6db05"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13110148", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Sterling falls as poll suggests Tories will lose majority", "locations": [], "entities": {"persons": [{"name": "muckle", "sentiment": "negative"}, {"name": "tim farron share", "sentiment": "none"}, {"name": "mark rigby", "sentiment": "none"}, {"name": "richard nixon", "sentiment": "none"}, {"name": "stephenson", "sentiment": "none"}, {"name": "jess swindells", "sentiment": "none"}, {"name": "stephanie coulson", "sentiment": "none"}, {"name": "james armstrong", "sentiment": "none"}, {"name": "stephan shakespeare", "sentiment": "none"}, {"name": "jess", "sentiment": "none"}, {"name": "julie adams", "sentiment": "none"}, {"name": "joanne", "sentiment": "none"}, {"name": "theresa may  theresa may", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "lisa kelly", "sentiment": "none"}, {"name": "jason wainwright", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "joanne davison", "sentiment": "none"}, {"name": "jennifer hirst", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "muckle", "sentiment": "none"}], "organizations": [{"name": "muckle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "consett steelworks", "sentiment": "none"}, {"name": "cvs", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "institute for fiscal studies", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "mrp", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "muckle llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Online estate agency IAM Sold sees profits jump 43% as it targets future growth \nA business started by two university friends when they were stuck in a traffic jam has seen sales and profits rise by more than 40% to top £12m . \nNewcastle-based IAM Sold is the largest independent residential auctioneer in the UK, and has this year been highlighted as one of the fastest growing companies in both the UK and Europe. \nThe company began in 2009 when friends Jamie Cooke and Ben Ridgway were stuck in traffic near the Team Valley and began talking about possible business ideas. Now, along with its parent company, it employs more than 120 people. \nAccounts for the firm have shown that its turnover for the year ending October 31 2016 grew by 40% to £12.8m while operating profit increased 43% to £1.4m. \nThe company is part of the Intelligent Services Group (ISG), which has also seen a big increase in profits and turnover in its latest accounts period. \nThe company was recently named in the FT1000 list of the fastest growing companies in Europe and is now targeting further growth. \nMr Ridgway, managing director of ISG, said: \nWe are thrilled with last year’s result which demonstrates our unique, integrated offering to estate agents across the country and we remain on track to achieve our ambitious target of doubling revenue and profits within the next three years. \nOur people are behind every aspect of our strategy and we will continue to invest heavily in them and our infrastructure to ensure these targets are met. \nWe have a number of significant projects to execute this year which will put the group on a stable footing and give us a platform for success having recently made two key appointments bringing in Malcolm McClen as sales and operations director and Eoghan Johnston as finance director. \nWe are continuing to invest significantly in our future growth and this expansion includes our move in July to bespoke office space, and investing in the technical infrastructure in order to further improve our service offering. Ben Ridgeway and business partner Jamie Cooke who run Iamsold, Newcastle (Photo: Newcastle Chronicle) 8:55 KEY EVENT Facebook lets users compare major parties on key election issues \nFacebook has launched a new feature enabling users to compare the stances of the major political parties on key issues ahead of the General Election. \nThe feature, called Perspectives, will appear as a prompt beneath articles linked to the election and will allow viewers to read each party’s position on issues such as housing, the economy and foreign affairs. \nThe feature will be location-sensitive and will show parties relevant to the country of the UK the user is viewing in. Facebook, which has more than 30m users in the UK, said the feature will appear up to three times a day and will be activated by the type of article, not the individual viewing it. The site said it will display each party’s stance on the issues in random order. \nPerspectives was first used by the social networking giant ahead of the French presidential election earlier this month. Facebook said it created the feature to make it easier for users to find and compare information about different political parties, as well as to help build an informed community. \nThe social media giant has been heavily criticised for its policing of so-called “fake news” and other content on its platform. Facebook's logo reflected in a pair of glasses (Photo: Dominic Lipinski/PA Wire) 8:50 Jonathon Manning British business confidence hit eight-month low \nConfidence among British businesses has slumped to an eight-month low in May as firms worry over their prospects, according to a survey. \nThe latest Lloyds Bank Business Barometer showed overall business confidence plunged to its lowest level since last September, with a net balance of 27% marking a sharp reversal of the 17-month high seen in April, when it hit 47%. \nThe drop came amid growing fears over outlook, with a steep decline in firms expecting stronger business prospects - plunging to 39% from 61% in April. The report - which surveyed around 200 UK firms with turnover above £1m - also showed that 13% now expect weaker prospects, up from just 1% last month. \nIndustrial companies were the most gloomy, with the survey showing sentiment plunged to a net balance of 6% from 56% in April. \nThese concerns look set to hit recruitment, with a net balance of 19% of firms expecting to expand their workforces over the coming year, down from 37% in April. \nBut the survey showed optimism over the wider economy remains fairly robust, with a net balance of 28% down only moderately on the 34% recorded last month and remaining above the long-term average. This comes despite official figures showing growth nearly stalled at 0.2% in the first quarter. \nHann-Ju Ho, senior economist for Lloyds Bank Commercial Banking, said: \nAlthough we have seen a drop in overall business confidence from last month’s elevated level, it is only slightly below the long-term average. \nThe June survey will provide a more complete picture for the quarter, but the results from our survey so far still point to a pick-up in growth after the 0.2% out-turn in the first quarter. A sign for Lloyds Banking Group (Photo: John Stillwell/PA Wire) 8:45 Jonathon Manning Newcastle firm Patrick Parsons continues expansion with purchase of Manchester firm \nEngineering consultancy Patrick Parsons has continued its expansion across the UK with the acquisition of Manchester-based building design company BCM . \nThe Newcastle company , which has offices in London, Glasgow, Huddersfield, Chester, Birmingham, Guildford, Sydney and Dubai, has bought BCM to expand its presence in the North West and also to strengthen its building services expertise. \nThe Manchester firm was established in 2002 and specialises in sustainability and low cost, low carbon building solutions. \nBCM has built up a strong client portfolio in both the public and private sectors and has been awarded consultancy of the year for the last three years running at The Chartered Institution of Building Services Engineers (CIBSE) Building Performance Awards. \nPeter Stienlet, managing director of Patrick Parsons, said: \nWe’re delighted to welcome BCM to the Parsons Group. The award-winning firm are leaders in electrical and mechanical design, with an established reputation through their work on many high-profile projects. \nThe move will allow us to not only extend our reach in the North West but also strengthen the building services design service that we provide to our clients across the country. Patrick Parsons’ director Doug Tidswell and managing director Peter Stienlet sign the deal with BCM’s Brian Morris (Photo: Copyright unknown) 8:40 Jonathon Manning Mobile phone users to be able to make calls on Tube \nPassengers may soon be able to use their phones while travelling on London’s underground system, it is reported. \nPeople can already access the internet through their phone on many platforms of London Underground stations, but service in the tunnels is non-existent. \nOther major cities including Paris, New York and Tokyo already have the technology to prevent mobile blackspots while on their metro systems. \nThe Financial Times said Transport for London (TfL) and London mayor Sadiq Khan will invite bids for telecoms groups after the General Election next week. According to the paper, three people familiar with the plans said a “number of companies were vying for the work”. \nA TfL spokesman told the FT: \nWe are keen to offer mobile phone coverage for our customers. The introduction of this would need to be commercially viable and would follow engagement with staff and customers. London Underground sign (Photo: Katie Collins/PA Wire) 8:35 KEY EVENT Nissan to let drivers sell electricity back to the grid through new partnership \nNissan has unveiled plans to allow motorists to sell electricity back into the national grid, after striking a partnership deal with Northern Powergrid. \nThe two firms have agreed to work together on a number of projects that will focus on how electric vehicles, batteries and other technology can be used to support the energy network. \nOne of the plans involves plugging Nissan’s electric vehicles back into the grid at peak times to increase the country’s electricity supply. The scheme could also allow drivers to make money by selling their electricity back to the grid during high tariff periods. \nThe scheme is likely to involve the use of the Nissan LEAF, which is built in Sunderland and is the best selling electric vehicle in the world. \nEd Jones, electric vehicles manager at Nissan Motor (GB) Ltd, said: \nWe’ve always known that Nissan’s EV technology can be used for so much more than just getting people from A-to-B and we’re delighted to be sharing our expertise to help create more sustainable energy networks in the UK. \nThrough the integration of Nissan EVs, we can find new solutions that will help shape a society whose energy use is sustainable, efficient and affordable. \nIf successful, the new technology could increase the network’s energy capacity and make renewable energy sources more affordable and more widely available. \nMobile energy hubs could also be created by connecting large numbers of electric vehicles directly into the power grid. Nissan battery plant, Sunderland (Photo: Copyright unknown) 8:30 Jonathon Manning Housebuilder Telford posts record annual profits \nLondon-focused housebuilder Telford Homes has delivered a record annual profits haul as it shrugged off the impact of Brexit uncertainty and tax hikes. \nThe group posted a 5.9% rise in pre-tax profits to £34.1m for the year to March 31 after sales jumped 19% to an all-time high of £291.9m. \nIt said its strategy of focusing on the “build-to-rent” sector had paid off, with robust demand from institutional investors helping offset a slower buy-to-let market since the Brexit vote and stamp duty changes. \nTelford added that profits were set to surge to more than £40m for the year to next March and £50m the following year, with the majority of gross profit already secured for the next two years. \nJon Di-Stefano, chief executive of Telford Homes, said: \nDespite uncertainty in relation to the outcome of the EU referendum and tax changes impacting primarily UK based individual investors, our underlying market has remained resilient. \nAny potential dampening effect of these factors has been outweighed by the structural imbalance between supply and need for new homes in London, particularly at our typical price point. (Photo: Joe Giddens/PA Wire)", "external_links": [], "published": "2017-05-31T14:55:00.000+03:00", "crawled": "2017-05-31T10:43:09.000+03:00", "highlightTitle": ""}