{"organizations": [], "uuid": "5fa90d96dae76a36fe627c8a05404e411bf23138", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.liverpoolecho.co.uk/incoming/article12989512.ece/ALTERNATES/s1200/JS118574873.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-people-like-voting-12993718", "country": "GB", "domain_rank": 21960, "title": "Theresa May: Why do people like her and why are they voting Conservative?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May: Why do people like her and why are they voting Conservative?", "spam_score": 0.0, "site_type": "news", "published": "2017-05-06T15:00:00.000+03:00", "replies_count": 0, "uuid": "5fa90d96dae76a36fe627c8a05404e411bf23138"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-people-like-voting-12993718", "ord_in_thread": 0, "title": "Theresa May: Why do people like her and why are they voting Conservative?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nWhy are people voting for Theresa May ? \nLocal election results, and even the election of a regional mayor, aren’t always connected to national politics. \nA row about bin collections may have more effect on how people vote than the performance of party leaders. But the trend is clear. Across the country, the Conservatives are picking up support. So why is it happening? People like Theresa May Prime Minister Theresa May makes her way into 10 Downing Street (Photo: Getty Images Europe) \nThe Prime Minister is a down-to-earth, middle class woman. She’s a vicar’s daughter. \nAnd she doesn’t quite have the charisma of a Tony Blair of David Cameron. \nBut people seem to like her. \nShe’s not fake. She comes across as honest. \nAnd that makes a change from the likes of Mr Cameron, who people found hard to trust, however charming he could be. She offers strong and stable leadership over Brexit Prime Minister Theresa May having some chips while on a walkabout during a election campaign stop in Mevagissey, Cornwall (Photo: PA) \nJournalists are sick of hearing the Prime Minister talk about “strong and stable leadership”. It’s the slogan we’re going to hear from her again and again, until the general election on June 8. \nCritics say she’s like a robot, repeating the same phrase over and over. \nBut Brexit is the biggest issue facing the country - so it’s natural to ask who is the best person to lead us through the difficult process of leaving the EU. Read More \nGiven a choice between Mrs May and Labour leader Jeremy Corbyn, voters seem to prefer Mrs May. She’s lucky in her opponent Labour party leader Jeremy Corbyn (Photo: Getty Images Europe) \nMany of Jeremy Corbyn’s supporters insist that he would make a great Prime Minister, if only the media would give him a chance. \nBut whatever the reason, many voters don’t seem to want him in Number 10. And as they’ve seen more of him, during the general election campaign, their opinion of him only seems to have hardened. \nBoth Labour and Conservative politicians say they have been surprised at the level of hostility to Mr Corbyn on the doorstep, as they canvassed for votes in the local elections and the forthcoming general election. \nMrs May looks good by comparison. Read More \nSome Labour MPs, and some commentators in the media, think she would be far less popular if she faced a better leader of the opposition. She’s got the right political message \nBrexit is the top issue, but it’s not the only issue. \nTheresa May has a political philosophy designed to appeal to working people. \nShe talks about getting them better schools, better healthcare and a pay rise. \nIt may seem obvious, but politicians don’t always talk about things that people really care about. \nDavid Cameron posed with huskies in the Arctic to show he cared about the environment. You can’t imagine Theresa May doing that. Like us on Facebook", "external_links": [], "published": "2017-05-06T15:00:00.000+03:00", "crawled": "2017-05-06T10:12:35.000+03:00", "highlightTitle": ""}