{"organizations": [], "uuid": "81a2a799a53ba8b9a19ec811a0035b9c3f3a0f0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13036455.ece/ALTERNATES/s1200/true.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/true-potential-profits-hit-15m-13036217", "country": "GB", "domain_rank": 21960, "title": "True Potential profits hit £15m despite impact of Brexit and Trump", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-15T19:17:00.000+03:00", "replies_count": 0, "uuid": "81a2a799a53ba8b9a19ec811a0035b9c3f3a0f0d"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/true-potential-profits-hit-15m-13036217", "ord_in_thread": 0, "title": "True Potential profits hit £15m despite impact of Brexit and Trump", "locations": [], "entities": {"persons": [{"name": "david harrison", "sentiment": "none"}, {"name": "harrison", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "trump the newcastle", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "dubrovnik", "sentiment": "none"}], "organizations": [{"name": "trump business true potential", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "deloitte technology fast", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business True Potential profits hit £15m despite impact of Brexit and Trump The Newcastle fintech company - which was recently named best business in Europe - saw its turnover grow by 23% to £69m Share David Harrison, managing partner at True Potential (inset) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTyneside fintech company True Potential saw its turnover soar by 23% to £69m last year despite “market-moving events” like Brexit. \nProfits at the group, which offers tech products to financial advisers, also grew from £12.4m to £14.9m for the year ending March 31 2017. \nThe firm’s products are used by 20% of the UK’s financial advisors, and its online investment site is used by consumers to put money into pensions and ISAs. \nAlong with its fintech products the company also has a range of 27 investment funds. In total True Potential has £52bn of client assets under its adminstration. \nDavid Harrison, managing partner at True Potential, said: “True Potential has been enjoying tremendous growth for many years now. In 2016 we had some notable market-moving events, including Brexit and the election of Donald Trump. \n“As an investment and financial advice business, to end that year with turnover up by a quarter and profits up by a fifth is a remarkable achievement and shows the strength of our offer to consumers.” \nAll of True Potential’s investment portfolio’s performed well over the year. Its low risk “Defensive” grew by 7.67%, while its higher risk “Aggressive” portfolio grew by 21.79%. \nThe firm’s headcount soared over the year from 155 members of staff in 2015 to 212 in 2016. \nDespite the large increase in headcount the firm’s wages and salary bill fell from £4.1m to £3.5m. \nAt the start of the month True Potential won the top prize at the European Business Awards, being named the Business of the Year (€26m - €150m turnover) category at the awards which were held in the Croation city of Dubrovnik. \nThe year also saw True Potential included for the third consecutive year on the Deloitte Technology Fast 50 list, which highlights the UK’s fastest growing technology companies. Read More Newcastle company True Potential wins European Business Award \nMr Harrison added: “Our aim is to give people in the UK the best chance of growing their savings and investments in an era of record low interest rates that are easily outstripped by rising inflation. \n“We are doing that by offering high quality financial advice and investment funds that are designed to perform in unpredictable conditions. \n“Then our unique technology gives clients instant access to their wealth and the ability to make instant micro-top ups so that they stay on track to reach their goal.” Like us on Facebook ", "external_links": [], "published": "2017-05-15T19:17:00.000+03:00", "crawled": "2017-05-15T14:39:08.000+03:00", "highlightTitle": ""}