{"organizations": [], "uuid": "5a0732453e6fc1cf67f320c9baf80178fcd5fa88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30359803/16021594.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/chanting-crowd-protests-outside-keith-vaz-s-leicester-labour-meeting/story-30359803-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Chanting crowd protests outside Keith Vaz's Leicester Labour...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-29T20:06:00.000+03:00", "replies_count": 0, "uuid": "5a0732453e6fc1cf67f320c9baf80178fcd5fa88"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/chanting-crowd-protests-outside-keith-vaz-s-leicester-labour-meeting/story-30359803-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Chanting crowd protests outside Keith Vaz's Leicester Labour...", "locations": [], "entities": {"persons": [{"name": "keith vaz", "sentiment": "negative"}, {"name": "manjula sood", "sentiment": "none"}, {"name": "nitesh dave", "sentiment": "none"}, {"name": "yvette cooper", "sentiment": "none"}, {"name": "vaz", "sentiment": "none"}, {"name": "mr vaz", "sentiment": "none"}, {"name": "tory edward yi he", "sentiment": "none"}, {"name": "keith", "sentiment": "none"}, {"name": "barot", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "kendall", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mo chouhan", "sentiment": "none"}, {"name": "sujata barot", "sentiment": "none"}, {"name": "maria", "sentiment": "none"}, {"name": "liz kendall", "sentiment": "none"}], "locations": [{"name": "leicester labour", "sentiment": "none"}, {"name": "cossington park", "sentiment": "none"}, {"name": "leicester east", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "belgrave neighbourhood centre", "sentiment": "none"}], "organizations": [{"name": "leicester west school", "sentiment": "none"}, {"name": "leicester labour", "sentiment": "none"}, {"name": "conservative candidate", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "bnc lunch club", "sentiment": "none"}, {"name": "belgrave library", "sentiment": "none"}, {"name": "rushey mead library", "sentiment": "none"}, {"name": "caste legislation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chanting crowd protests outside Keith Vaz's Leicester Labour meeting By danjmartin | Posted: May 29, 2017 0 COMMENTS SHARES \nAngry chants rang out as part of a demonstration held outside a venue Keith Vaz was using for an election event. \nA crowd gathered outside the Belgrave Neighbourhood Centre while Mr Vaz was hosting a meeting attended by Yvette Cooper in the run up to June 8. \nSome 30 people, including Leicester East candidates Independent Sujata Barot, Tory Edward Yi He and Lib Dem Nitesh Dave, were at the protest to express their concerns about Mr Vaz and the Labour city councillors who also attended the meeting on Saturday evening. \nGeneral Election 2017: Click HERE for everything you need to know \nMs Barot told the Mercury: \"We went along to express how unhappy we are with Labour in this city. \n\"People were chanting 'Vaz Out' and 'Stop the cuts'. \n\"Keith is no longer an effective MP in resisting the cuts being carried out by the Labour members of the city council. \n\"Inside they were saying we were just a bunch of Tories protesting but there were members of the community, the Lib Dem candidate, myself as an independent and the Conservative. \n\"There was a wide range of people wanting to say how fed up they were with Keith and Labour in this city.\" \nThe demonstrators wanted to enter the city council-owned building and there were angry scenes involving at least one Labour city councillor when they were told they would not be admitted. \nAfter the meeting the candidates and some residents were admitted to speak to Mr Vaz, who is defending a majority of more than 18,000. \nRead more: Tory candidate challenges Kendall over Corbyn's 'terror' speech \nMr He said: \"The protest was organised by the local community and I was invited to attend along with fellow parliamentary candidates to listen to the public's concerns and their views over trust and integrity with the Labour Party here in Leicester. \n\"How people can be blocked from entering a publicly owned building leaves more questions with some members of the public feeling it was Labour's attempt to ignore the people of Leicester. \n\"It is clear Leicester Labour not only ignore the Leicester people, but they have taken them for granted for too long. \n\"That's not a plan for our city that's chaos which will lead to more debt, more waste and higher taxes.\" \nThe Mercury contacted Mr Vaz's campaign for a comment and the following statement was provided by a Labour party spokesman. \n\"The \"demonstration\" consisted of the Conservative Candidate, one of the Independent candidates and the Liberal Democrat, and some footballers who were playing on Cossington Park who asked to join in but admitted they didn't know what it was about. \n\"Those outside told those on their way in that this was a demonstration against cuts to Belgrave Library and Rushey Mead Library. \n\"Others said it was about Caste Legislation. \n\"The only placard said 'Stop The Cuts'. \n\"Any \"cuts\" are as a result of Government policy. \n\"Following the end of the meeting the Independent, Conservative and Liberal Democrat candidates asked for a meeting with Keith Vaz to raise some issues with him. \n\"He was delighted to see them. The three had prior to this entered the building together to use the toilets. \nRead more: Liz Kendall rounds on Tory teacher election rival over Leicester West school cash cuts \n\"The meeting with the candidates included Councillor Mo Chouhan, Councillor Manjula Sood, Mr Vaz's wife Maria, the chair of the BNC Lunch Club and three others. \n\"The Independent candidate began by thanking Keith Vaz for all the help he had given her in the past including the campaign to remove pigeons from Cossington Park and other casework done for her, she said he was a good MP. \n\"She then asked him to support Rushey Mead Library. \n\"She also said that her father had not been properly recognised for the work he had done for the local community. \n\"The Liberal Democrat candidate asked for Mr Vaz to assist his grandmother who was being asked to pay £50 a year to use the BNC. \n\"He then referred to a visit to see Mr Vaz at his surgery about a personal problem. \n\"At the end he said he hoped to meet Mr Vaz before the Count. \n\"The Conservative candidate had an argument with the Liberal Democrat candidate about Brexit. \n\"On the way out he asked for a photograph with Mr Vaz and the Chairman of Chinese for Labour. \n\"The two people with him also asked for photographs with Mr Vaz. \n\"He then asked Mr Vaz for some career advice.\" \nThe Labour party said the meeting lasted 45 minute but the meeting with the other Candidates lasted 1 hour and 3 minutes. \nThe statement added: \"Anyone can hire these premises. \n\"This is clearly stated in the council's guide for Elections. In this case in fairness the three other candidates should probably share the cost for their meeting.\"", "external_links": [], "published": "2017-05-29T20:06:00.000+03:00", "crawled": "2017-05-29T16:05:00.000+03:00", "highlightTitle": ""}