{"organizations": [], "uuid": "339aebc6a4c24944db228f32537823a0bb2dd5e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13051857.ece/ALTERNATES/s1200/The-Conservative-Party-Hold-A-Press-Conference-In-Central-London.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-pledges-radical-changes-social-13051924", "country": "GB", "domain_rank": 21960, "title": "Theresa May pledges radical changes to social care to protect inheritances in Tory manifesto", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-18T05:30:00.000+03:00", "replies_count": 0, "uuid": "339aebc6a4c24944db228f32537823a0bb2dd5e0"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-pledges-radical-changes-social-13051924", "ord_in_thread": 0, "title": "Theresa May pledges radical changes to social care to protect inheritances in Tory manifesto", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "tim farron", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "tory", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May pledges radical changes to social care to protect inheritances in Tory manifesto The Conservative manifesto will ensure the elderly stop paying for care once wealth falls to £100,000 Share Click to play Tap to play The video will start in 8 Cancel Play now Theresa May speaking at the Linskill Centre Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May is to ensure elderly people are no longer forced to hand over their life savings to pay for social care - allowing them to leave far more to their families. \nRadical changes to the way social care is funded will be included in the Conservative general election manifesto, launched by Tory leader Theresa May on Thursday. \nUnder the plans, elderly people will no longer have to contribute towards the cost of residential care or care at home once their assets, including the value of their home, fall below £100,000. Prime Minister Theresa May (Photo: Getty Images Europe) \nAt the moment, they are expected to keep on paying until they have just £23,250 in housing wealth or savings, dashing hopes of leaving a substantial inheritance to their loved ones. \nA Conservative government would also make sure that no one, no matter what their condition, has to sell their home within their lifetime to contribute towards care costs. \nInstead, they will be allowed to defer payments, so that the property is not sold until after they die. \nAnd if they share a home with a partner who outlives them, the home will also be safe until the partner also passes away. \nBut there will be further changes which save money for the taxpayer - with the cash going back into social care. \nWinter fuel payments of up to £300 a week will be means-tested, instead of going to everyone born on or before 5 May 1953 as they do now. Prime Minister Theresa May speaks to party supporters as she campaigns in the North East of England (Photo: Getty Images Europe) \nThe payments were meant to end the scandal of elderly people freezing to death in their own homes, but the policy of giving the cash even to the very wealthy has been widely criticised. \nAnd the value of a person’s home will also be included when people receiving domiciliary care - care in their own home - are means-tested to see if they should contribute towards the cost. It is already included in the means test for residential care. Read More Liberal Democrat manifesto: Tim Farron says he wants to be leader of the opposition \nMrs May will say that she is committed to getting to grips with the great challenges of our time, starting with social care. \nThere will be a third more people aged 85-plus in 2024 than there were in 2014, and the growth of long term conditions such as dementia is putting increasing pressure on the social care system. \nThe manifesto, called “Forward, Together”, will also focus on proposals to get the best deal from Brexit. \nIn a foreword to the manifesto, Mrs May will say: “This manifesto sets out a vision for Britain’s future – not just for the next five years, but beyond. \n“The next five years are the most challenging that Britain has faced in my lifetime. Brexit will define us: our place in the world, our economic security and our future prosperity.” \nRepeating her call for a “strong and stable” government, the Conservative leader will say: “People are rightly sceptical of politicians who claim to have easy answers to deeply complex problems. It is the responsibility of leaders to be straight with people about the challenges ahead and the hard work required to overcome them. Read More Labour's Nick Brown says party manifesto offers a fair deal for the North East at last \n“Above all, it will require a unity of purpose stretching across this precious union of nations, from north to south and east to west. For as we embark on the momentous journey ahead of us over the next few years, our shared values, interests and ambitions can – and must – bring us together as a united country.” Like us on Facebook ", "external_links": [], "published": "2017-05-18T05:30:00.000+03:00", "crawled": "2017-05-18T00:56:00.000+03:00", "highlightTitle": ""}