{"organizations": [], "uuid": "c34cd46c31c922e7f538250b5f45f62a1895b471", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13098330.ece/ALTERNATES/s1200/DMR_NEC_170716consett_05.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-red-town-county-durham-13098303", "country": "GB", "domain_rank": 21960, "title": "Could Red Town in County Durham turn blue at this general election?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-27T01:00:00.000+03:00", "replies_count": 0, "uuid": "c34cd46c31c922e7f538250b5f45f62a1895b471"}, "author": "Peter McCusker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-red-town-county-durham-13098303", "ord_in_thread": 0, "title": "Could Red Town in County Durham turn blue at this general election?", "locations": [], "entities": {"persons": [{"name": "pat glass", "sentiment": "none"}, {"name": "jim callaghan", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "hilary", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "mrs hart", "sentiment": "none"}, {"name": "sally-ann hart", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "dominic horsman", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "hart", "sentiment": "none"}, {"name": "alan breeze", "sentiment": "none"}, {"name": "peter mccusker", "sentiment": "none"}, {"name": "ernest armstrong", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "john prescott", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "red town", "sentiment": "none"}, {"name": "east durham", "sentiment": "none"}, {"name": "northumberland county", "sentiment": "none"}, {"name": "sydney harbour bridge", "sentiment": "none"}, {"name": "shotley bridge", "sentiment": "none"}, {"name": "pidcock", "sentiment": "none"}, {"name": "blackpool tower", "sentiment": "none"}, {"name": "lanchester", "sentiment": "none"}, {"name": "east sussex", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ebchester", "sentiment": "none"}, {"name": "consett", "sentiment": "none"}, {"name": "derwent valley", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "durham county", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "tuc", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "liberal democrat owen temple", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "consett", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "consett steel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Could Red Town in County Durham turn blue at this general election? We look at the town of Consett in the North West Durham constituency, where there have been huge changes Share Consett steelworks last day, 1980 (Photo: NCJ Archive) Share     \nAfter nearly choking on red dust we never played hedge-hopping again. \nIt was deposited in Consett’s privet hedges by the belching, spewing steelworks, and gave rise to the place’s nickname - Red Town. \nAt its peak the ‘works’ employed over 7,000 and when it closed in 1980, 4,500 lost their jobs. Efforts to regenerate Consett saw former steelmen turn to hairdressing, social work and delivery driving. \nBy the end of the Eighties many cars were 10 years old, one-third of the working population were jobless and Consett was a by-word for industrial decline. \nWhilst the steelworks reclamation swept away the red dust, politically, the town was still red. \nSitting Labour MP Ernest Armstrong passed the North West Durham seat to his daughter Hilary in 1987, and she beat Theresa May in 1992; polling 58% compared to the current Prime Minister’s 28%, with current Liberal Democrat leader Tim Farron third. \nLabour polled 31,855 in 1997 - over 24,000 more than the Tories. \nThe gap has narrowed in recent years; retiring Labour MP Pat Glass secured a majority of 10,000 over the Conservatives in 2015. So, a poll for Chroniclelive last week which found the seat could fall to the Tories raised a few eyebrows. \nThe same poll shows one Labour seat in Sunderland Central could also switch to Tory blue but little anticipated change in the rest of the Labour-dominated North East. So why North West Durham? \nDurham County Councillor for Consett and Liberal Democrat Owen Temple will be fighting the seat for the third time in June, having finished a distant fourth in 2015. \nSince arriving in Consett in 1979 Mr Temple has grown fond of the town, and like many others, is delighted with the progress made in the last 15 years (see panel). \nConsett’s transformation into a well-located North East commuter town sees Mr Temple reflect: “It’s not an impossibility the Tories will win.” \nIf so, it will not be first time Consett has been out of sync with the region; in John Prescott’s failed 2004 regional assembly election this was the North East district most in favour. \nMr Temple has recently noticed a change of attitude in the terraced streets around the town centre. \n“Back in 1983, when I first stood for the district council, people would rip my leaflets up. I would be chased from the doors, but people are now more prepared to engage. \n“The passion has gone, and they seem to have fallen out of love with Labour, but whether they vote Conservative – well, that is another step.” \nAs for the reason for this drift from Labour, like many, his focus turns to its leader and his supporters. \n“Labour in Consett was always fairly middle of the road, a broad church. More Tony Blair, and before him Jim Callaghan \n“With Corbyn and this drift towards Marxism, here in Consett, it feels like they’ve left the battlefield,” he said. \nLaura Pidcock, the Labour candidate, postponed starting a new job for the TUC to fight the seat after being selected from an all-women shortlist. \nThe former Northumberland County councillor for Cramlington (she lost her seat there in the local elections this month), who recently moved to Lanchester, scoffed at such claims. Read More Fancy a flutter? Check out the odds for North East General Election constituencies \nShe said: “I have noticed a change in reaction on the doorstep in the last week, since the launch of the fully-costed Labour Manifesto and the disastrous, un-costed Conservative one. \n“Labour’s Manifesto is not a revolutionary document suggesting the state seizes the assets of the wealthy! But, for the first time in many years people are telling us there is a big difference between the two parties. Voters have a genuine political choice to make and they seem to welcome that. \n“People are concerned about jobs, the health service housing and schools and our Manifesto speaks to those concerns. \nConsett Steel was used in the Sydney Harbour Bridge and Blackpool Tower, and before closure of the works the town had a population of 40,000 and its own MP. \nBut the subsequent population decline means it’s now in the North West Durham constituency, along with the rural settlements of Crook and Stanhope. \nHowever, Consett’s population is rising once more - up by 20% since the turn of the century to over 36,000 - as thousands of new homes have been built with more to follow. \nWhilst parts of the town still suffer, Consett is now far-removed from its post-industrial cousin of East Durham, where the population is relatively stagnant, ageing, and almost one-quarter are classed as deprived. \nUnemployment in Consett and the rest of the North East is now less than that of London. \nEarlier this week Conservative candidate Sally-Ann Hart visited the street where her dad once lived in the picturesque Derwent Valley village of Ebchester, less than three miles from Consett. \nNow a councillor in East Sussex, she was born on Tyneside, and brought up in Riding Mill. She is proud of her family’s North East mining roots. \nDuring the 1990s Mrs Hart would often return to visit her family who’d then moved to the well-heeled Consett suburb of Shotley Bridge, and is impressed with what she now finds. Read More UKIP pledges to defend our country and way of life at manifesto launch \nShe said: “It’s been many years since I’ve been to Consett and the transformation has been phenomenal. \n“It’s been smartened up and has fantastic clean air. Many people are moving to Consett from places like Newcastle because it’s such an amazing town to now live in. \n“We’ve had lots of fantastic new developments, but people tell me they don’t want to have to commute and my aim as the town’s MP will be to bring new jobs to Consett.” \nThe transformation in the town’s environment appears to be happening with its politics, too, says Mrs Hart. \n“There seems to be a silent Conservative movement in the area. We are getting a fantastic reception on the doorstep, although we are taking ginger steps and not asking anyone to put up posters, just yet.” \n“People feel like they’ve been taken for granted by Labour for years. Some people who’ve voted Labour all of their lives are feeling guilty, but they have no time for what they’re calling ‘Corbyn’s Trotskyite policies’. Things seem to be changing up here.” \nMr Temple and the two main party candidates will be up against Alan Breeze for UKIP and Dominic Horsman for the Greens. \nBeing the only one of the main party candidates who lives in the town he hopes this will play to his advantage. \nIn Mr Temple’s mind the destination of the 7,000 UKIP voters in 2015 will be crucial, with polls suggesting its vote is waining with Brexit imminent. \nThe candidates for the three traditional main parties say leaving the EU is not a key feature in Consett; an area that voted Out. \n“Some people just won’t vote Tory, and some just won’t vote Corbyn. We’re hoping they turn to us. But I feel it’s the stay at homes who will win this election in Consett.” \nLabour has its foot-soldiers out in numbers with Ms Pidcock saying: “The data we collect shows our vote is holding up. We are campaigning strongly, but not out of anxiety.” \nDiscussing the election with Consett man in his 60s, who’d swallowed the red dust - and prose - during his time at the works, his first reference was Jeremy Corbyn. He turned the air blue. \nOn June 9 we’ll see if Red Town, itself, turns blue. \nFollow Peter McCusker on Twitter @mccusker60 Like us on Facebook", "external_links": [], "published": "2017-05-27T01:00:00.000+03:00", "crawled": "2017-05-26T21:01:41.000+03:00", "highlightTitle": ""}