{"organizations": [], "uuid": "544154eae6efc6d05b74023b2025549ed91fd5a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30363601/16024060.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/theresa-may-is-back-in-plymouth-rallying-voters/story-30363601-detail/story.html", "country": "GB", "title": "Devon Live published Theresa May visits Devon to rally voters as one poll says she...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-31T16:10:00.000+03:00", "replies_count": 0, "uuid": "544154eae6efc6d05b74023b2025549ed91fd5a6"}, "author": "Devon Live", "url": "http://www.devonlive.com/theresa-may-is-back-in-plymouth-rallying-voters/story-30363601-detail/story.html", "ord_in_thread": 0, "title": "Devon Live published Theresa May visits Devon to rally voters as one poll says she...", "locations": [], "entities": {"persons": [{"name": "devon live", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "devo", "sentiment": "none"}, {"name": "josh pope", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "john allen", "sentiment": "none"}, {"name": "sue dann", "sentiment": "none"}, {"name": "oliver colvile", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "stephan shakespeare", "sentiment": "none"}, {"name": "alison seabeck", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}, {"name": "john allen  theresa may", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "mercer", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "plymouth moor view", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "plymouth fisheries", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "plymouth herald", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "mrp", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May visits Devon to rally voters as one poll says she will LOSE the General Election By Devon Live | Posted: May 31, 2017 0 COMMENTS SHARES Comments (0) \nPrime Minister Theresa May visited Devon this morning to drum up support for the Conservative Party as the clock ticks down to next week's General Election. With just over a week to go until polling day, Theresa May arrived at Plymouth Fisheries to chat to fishermen and traders. \nIt's the former home secretary's second visit to the region in a month, after she stopped by the Plymouth Herald's headquarters on May 2 to talk about why she wants to be a champion for the armed forces . \nJohn Allen HERE IS THE FULL LIST OF CANDIDATES STANDING FOR ELECTION IN DEVON \nIt comes one poll puts her on course to dramatically lose the General Election. \nThe constituency-by-constituency estimate for The Times by YouGov indicates the Conservative Party could lose 20 seats and see its majority wiped out, while Jeremy Corbyn's Labour may gain 28 seats. \nTheresa May has played down polling that puts her on course to lose the General Election and insisted the only poll that matters is the June 8 vote after the seat projection study suggested the UK faces a hung parliament. Read more Ask your election candidates how they plan to save schools - COMMENT \nThe analysis is based on a complex model and suggests Mrs May's gamble of calling a snap election in the hope of a landslide win could backfire spectacularly. \nDuring a visit to Plymouth Fisheries, where she met local fishermen, Mrs May said: \"The only poll that matters is the one that's going to take place on June 8 and then people will have a choice as to who they want to see as leader, who they want to see as prime minister taking this country forward in the future, me or Jeremy Corbyn. \n\"I have the plan for the Brexit negotiations but I've also got a plan to build a stronger and more prosperous Britain and I'm confident we can do that because I believe in Britain and I believe in the British people.\" \nThe visit comes on the same day that Labour have been given a boost in Plymouth Moor View after the Green Party candidate stepped down and endorsed Labour. \nThe move by Green Party candidate Josh Pope, 19, in Plymouth Moor View means Labour is within a couple of votes of reclaiming the seat from sitting Conservative Johnny Mercer. \nMr Mercer won the seat from labour;s Alison Seabeck in 2015 with a majority of 1,026 votes. The Green Party won 1,023 votes. \nThe move puts Mr Mercer at serious risk of losing his seat to Labour's Sue Dann. \nIn a message to the people of Plymouth through the Plymouth Herald, Mrs May said: \"I am determined to earn every vote I can because that will strengthen my hand in the Brexit negotiations, and enable me to provide the country with the strong and stable leadership it needs to see us through Brexit and beyond. \nJohn Allen \nTheresa May arrives with Oliver Colvile \n\"We need that strong and stable leadership more than ever before. We face a crucial time in the history of our nation. Our future prosperity, our place in the world, and our standard of living all depend on getting the next five years right.\" \nJohn Allen \nA Plymouth fisherman listens to what the prime minister has to say \nThe latest Y ouGov's analysis puts the Tories on 310 seats, down from the 330 they went into the election campaign with, and 16 short of a majority. \nLabour would get 257 seats, up from 229, the Liberal Democrats 10, up from the nine Tim Farron's party held when the election was called, the SNP 50, the Greens one and Plaid Cymru three. Read more Thousands of East Devon postal voters reassured after voting slip error \nThose figures are from the model's central estimate, which acknowledges a large range of variation. \nA good night for the Tories could see Mrs May's party pick up 345 seats - a net gain of 15 but still well short of the kind of majority she would have hoped to secure following the decision to go to the country. \nA bad night could see the Conservatives plummet to 274 seats. \nYouGov's model draws on the data collected from around 50,000 panellists quizzed on their voting intention over the course of a week and uses a recently-developed technique called multilevel regression and post-stratification (MRP). \nThe pollster's MRP model is based on the fact that people with similar characteristics tend to vote similarly, but not identically, regardless of where they live. \nDuring the EU referendum campaign it consistently showed that more voters favoured Leave than Remain. \nBut YouGov acknowledged that models could not produce estimates as accurate as a full-scale poll in each constituency. \nYouGov chief executive Stephan Shakespeare said the data could change dramatically between now and June 8. \n\"The data suggests that there is churn on all fronts, with the Conservatives, Labour and the Liberal Democrats all likely to both lose and gain seats,\" he wrote in The Times. \n\"Based on the model's current estimates, some seats are likely to change hands along EU referendum dividing lines. \n\"This is just a snapshot based on data from the past seven days and people can and do change their minds in the closing days of a general election campaign. \n\"Furthermore, it would not take a slight fall in Labour's share and a slight increase in the Conservatives' to see Theresa May returning to No 10 with a healthy majority.\"", "external_links": [], "published": "2017-05-31T16:10:00.000+03:00", "crawled": "2017-05-31T12:43:53.000+03:00", "highlightTitle": ""}