{"organizations": [], "uuid": "2979e50b3ca82a4d8cfebb48d12f2d0d6fe6c08b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13083985.ece/ALTERNATES/s1200/2017-General-Election-campaign.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-vote-conservative-everything-you-13083014", "country": "GB", "domain_rank": 21960, "title": "Why should I vote Conservative? Everything you need to know about the Tory Party", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-05-24T18:36:00.000+03:00", "replies_count": 0, "uuid": "2979e50b3ca82a4d8cfebb48d12f2d0d6fe6c08b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-vote-conservative-everything-you-13083014", "ord_in_thread": 0, "title": "Why should I vote Conservative? Everything you need to know about the Tory Party", "locations": [], "entities": {"persons": [{"name": "theresa may how", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "leeds  building", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "tory party", "sentiment": "negative"}, {"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "health  increasing nhs", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why should I vote Conservative? Everything you need to know about the Tory Party What you need to know about the Conservative Party for the general election on June 8. Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Conservative Party , also known as the Tory Party, is one of the two major largest parties in the UK. \nIt has been in government since 2010, first as the larger party in a Coalition (with the Liberal Democrats as the smaller party) and then on its own. \nThe Chronicle has launched a Whatsapp group for general election news. To receive daily messages text GE to 07827 937 000. Add the number to your phone contacts book as ‘Chronicle’. Your number won’t be shared with other members of the group. Who is the Conservative Party leader? Conservative leader Theresa May (Photo: PA) \nThe Conservative leader is Theresa May How many seats did the Conservatives win at the last election? \nConservatives won 330 seats in the last general election , which was in 2015 What are the Conservative policies? \nPolicies set out in the Conservative manifesto include: Tax \nIncreasing the income tax threshold to £12,500 by 2020, effectively cutting income tax for some low earners \nIncreasing the threshold for the higher rate of income tax to £50,000 \nNo increases in VAT \nBut the manifesto does not repeat the previous Tory pledge not to increase income tax or National Insurance at all \nA better deal for workers \nIncreasing the “living wage”, effectively the minimum wage, to 60 per cent of median earnings \nMore legal rights for self-employed workers in the “gig” economy \nTougher rules to stop business owners abusing pension funds \nOverseas firms bidding to take over UK companies will have a legal obligation to keep any promises they make during the bidding process \nFirms will have to publish some details of how much they pay executives and how this compares to pay in the wider workforce, to discourage excessive pay at the top Conservative leader Theresa May (Photo: Daily Mirror) Pensions \nMaintain the triple lock pension guarantee until 2020, then replace it with a double lock - meaning pensions will rise in line with earnings or inflation, whichever is highest. Energy \nAn independent review into the cost of energy to ensure that businesses and households are paying the lowest bills possible Read More \nPressing ahead with the HS2 high speed rail line between London, Birmingham, Manchester and Leeds \nBuilding a “Northern Powerhouse rail” line. Planning for this is at an early stage but it is expected to link Liverpool, Manchester, Leeds, Hull, Sheffield and Newcastle. \nEnsuring every car and van is zero emission by 2050 Cities and regions \nSupporting a UK city in making a bid to host the 2022 Commonwealth Games \nMoving senior civil servants out of London into the south east \nMoving Channel 4 out of London \nContinuing to back elected mayors for towns and cities, but not for rural areas Education \nA specialist maths college in every city \nGetting independent schools to sponsor or open schools in the state system \nEnding the ban on opening new grammar schools \n“We will expect every 11-year-old to know their times tables off by heart” \nContinuing to introduce a “fair funding” system which increases cash for schools in many rural areas, but guaranteeing that this change will not lead to cuts in funding elsewhere \nScrapping the policy of free school meals for every primary school pupil, although they will still be free for pupils from low income families \nNew Institutes of Technology, similar to universities but teaching technical subjects Immigration \nGetting net immigration, currently 273,000 people a year, down to below 100,000 A fairer society \nRequiring larger firms to to publish more data on the pay gap between men and women \nTougher equalities laws to stop employers or landlords discriminating against ethnic minorities \nThreatening police with laws to prevent “stop and search” powers being used disproportionately against black and other ethnic minority people. \nA goal to halve rough sleeping over five years and end it by 2027 A better deal for consumers \nIncreasing security for good tenants and encouraging landlords to offer longer tenancies as standard \nMaking phone bills fairer and easier to understand, including making clear when a mobile customer has paid off the price of their handset \nA crackdown on rogue private parking operators \nA review of rail ticketing, to ensure passengers are sold the cheapest ticket \nHelping people get the best tariff from their energy supplier Health \nIncreasing NHS spending by a minimum of £8 billion in real terms over the next five years Read More When is the 2017 UK general election being held? Housing \nEnsuring a previous pledged to build 1 million homes between 2015 and 2020 is met, and building half a million more by the end of 2022 \nHelping councils build new homes but only those “who will build high-quality, sustainable and integrated communities” \nSome of the new properties will have to offered to sale within 10 or 15 years. Childcare \nA Conservative government will introduce, this year, thirty hours of free childcare for three and four year olds for working parents who find it difficult to manage the costs of childcare Read More What is an MP and what do they do? Our guide as Britain prepares to go to the polls Brexit \n“We want to agree a deep and special partnership with the European Union. This partnership will benefit both the European Union and the United Kingdom: while we are leaving the European Union, we are not leaving Europe, and we want to remain committed partners and allies to our friends across the continent. \n“The negotiations will undoubtedly be tough, and there will be give and take on both sides, but we continue to believe that no deal is better than a bad deal for the UK. But we will enter the negotiations in a spirit of sincere cooperation and committed to getting the best deal for Britain.” Fox hunting \nA free vote in the House of Commons on whether to scrap the hunting ban Democracy \nMP numbers will be cut from 650 to 600, and the Fixed Term Parliament Act will be repealed, returning to the days when a government could call an election without consulting MPs \nVoters will have to show ID to take part in elections, and there will be reforms of postal voting aimed at cutting fraud Like us on Facebook", "external_links": [], "published": "2017-05-24T18:36:00.000+03:00", "crawled": "2017-05-24T14:15:39.000+03:00", "highlightTitle": ""}