{"organizations": [], "uuid": "8230998f02d3faa91e0fa903c3477c50dc3b0327", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30321445/15993309.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/conservative-majority-will-be-indecently-huge-or-humungous-says-former-lib-dem-mp/story-30321445-detail/story.html", "country": "GB", "title": "Conservative majority will either be 'indecently huge' or...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Conservative majority will either be 'indecently huge' or...", "spam_score": 0.0, "site_type": "news", "published": "2017-05-09T18:47:00.000+03:00", "replies_count": 0, "uuid": "8230998f02d3faa91e0fa903c3477c50dc3b0327"}, "author": "JoeBulmer", "url": "http://www.devonlive.com/conservative-majority-will-be-indecently-huge-or-humungous-says-former-lib-dem-mp/story-30321445-detail/story.html", "ord_in_thread": 0, "title": "Conservative majority will either be 'indecently huge' or...", "locations": [], "entities": {"persons": [{"name": "heaton-jones", "sentiment": "none"}, {"name": "north devon ricky knight", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "harvey", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}, {"name": "nick harvey", "sentiment": "none"}, {"name": "devonlive", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}], "organizations": [{"name": "conservative", "sentiment": "none"}, {"name": "liberal democrat", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "veteran green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Conservative majority will either be 'indecently huge' or 'humungous' says former Lib Dem MP By JoeBulmer | Posted: May 09, 2017 0 COMMENTS SHARES \"The risk is that the Tories win so 'big' that we are basically left with a one-party state.\" Conservative majority will either be 'indecently huge' or 'humungous' says forme... X \nCopy link to paste in your message / \"The risk is that the Tories win so 'big' that we are basically left with a one-party state.\" Comments (0) \nTheresa May's Conservative party will win by \"an indecently huge majority, or a positively humungous one\" and \"there's nothing much anyone in North Devon can do about that\", claims former Liberal Democrat MP and armed forces minister Nick Harvey. The statement from Mr Harvey comes after the Conservative Party made big gains across the UK in last week's local elections. \nIn a statement sent to DevonLive he expressed his concern that the country maybe left with \"a one-party state\" after the general elections in June and compared the PM to a prep school headmistress. \n\"Local election results from around the country have left the Conservatives with beaming smiles and everyone else nursing their bruises,\" said Mr Harvey. \n\"The brutal truth is this: all that remains to be determined on June 8 is whether Theresa May wins by an indecently huge majority, or a positively humungous one. And there's nothing much anyone in North Devon can do about that. \n\"The risk is that the Tories win so 'big' that we are basically left with a one-party state. An autocratic government with a 'blank cheque' mandate, facing none of the usual checks and balances because of the fractured state of the opposition parties. If that happens, it could be fifteen or twenty years until the political tides catch up with them. \n\"But what the people of North Devon can decide on June 8 is what sort of MP they want to represent them. Do we want an anonymous Tory to vanish into these swollen ranks and do the Government's bidding? Or do we want a strong independent voice who will stand up for North Devon, say 'no' to the Government when it is damaging our communities, cut up rough and rock the boat? \n\"Theresa May has her strengths, but welcoming robust challenge is not among them. She reacts rather like the headmistress of a girls' prep school when anyone dares to disagree with her. You half expect her to haul them over her knee for 'six of the best'.\" \nREAD NEXT: Here's the full round-up of the Devon County Council results \nIn sharp contrast Peter Heaton-Jones, the Conservative MP who ousted Mr Harvey in 2015, puts the election results down to good work by local councillors and believes \"nobody should be taking a Conservative victory in June for granted\", he said: \"These county council results in North Devon, with the Conservatives holding five seats and winning a sixth, show just how much people appreciate their hard-working local councillors. \n\"I have been campaigning with many of them over the last few weeks and have seen first-hand the deep ties they have with their communities. It's testament to their hard work that the Conservatives have had such a good result in North Devon. But these local elections were just that – local. They tell us very little about what might happen in the general election five weeks from now. \n\"People vote very differently in local elections, and the turnout is much lower as well, which makes any comparison virtually meaningless. Votes might swing backwards and forwards for all sorts of reasons, and none of them might be replicated in a national poll.\" \nREAD NEXT: UKIP lose all four seats on Devon County Council \nMr Heaton-Jones acknowledges the result is promising for his party but has resisted declaring victory already for two reasons. \n\"Firstly, I don't want to be hunched over spreadsheets and calculators; I would rather get straight back out knocking on doors, delivering leaflets and talking to people. \n\"Secondly, the only thing these local election results actually tell us is that the battle for votes in North Devon, and the country as a whole, is very real indeed. Nobody should be taking a Conservative victory in June for granted.\" \nVeteran Green Party campaigner and the party's chosen candidate for North Devon Ricky Knight expects a \"meltdown\" after the general election, he said: \"If the local election results locally, regionally and nationally, are seen as a credible Litmus Test for next month's general election, then the progressive elements of the left and the populist party of the far right have to take a deep breath and prepare for meltdown. \n\"Traditionally, local elections are a moment for the electorate to vote against the Government, for whatever reason – not this time. Party allegiances have been eroded; Conservative strategists have seized the post-referendum initiative and ushered their flock back into the pen. \n\"Every party now has a significant percentage of their supporters on both sides of the Brexit divide. No pundit knows where the collapsed Ukip vote is going to go.\" \nTo keep up to date with all the county's political news and opinion bookmark DevonLive's politics homepage . ", "external_links": [], "published": "2017-05-09T18:47:00.000+03:00", "crawled": "2017-05-09T16:21:21.000+03:00", "highlightTitle": ""}