{"organizations": [], "uuid": "a6b83948a12b4079bc9056c09667e684a8fc2373", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13348970.ece/ALTERNATES/s1200/DBR_SCU_011214foodstuufs_05.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13989977", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: McColl's sales top £1bn, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-04T10:30:00.000+02:00", "replies_count": 0, "uuid": "a6b83948a12b4079bc9056c09667e684a8fc2373"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13989977", "ord_in_thread": 0, "title": "Business Breakfast LIVE: McColl's sales top £1bn, plus latest news", "locations": [], "entities": {"persons": [{"name": "mccoll", "sentiment": "negative"}, {"name": "tim martin", "sentiment": "none"}, {"name": "coreena ford pendragon", "sentiment": "none"}, {"name": "iain malcolm", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jd wetherspoon", "sentiment": "none"}, {"name": "evans halshaw", "sentiment": "none"}, {"name": "palmer", "sentiment": "none"}, {"name": "frazer thompson", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "harvey", "sentiment": "none"}, {"name": "coun harry trueman", "sentiment": "none"}, {"name": "charlton hall", "sentiment": "none"}, {"name": "richard shell", "sentiment": "none"}, {"name": "trevor finn", "sentiment": "none"}, {"name": "thompson", "sentiment": "none"}], "locations": [{"name": "jesmond dene nursery", "sentiment": "none"}, {"name": "kent", "sentiment": "none"}, {"name": "herefordshire", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "café rouge", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "sunderland  north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "washington road", "sentiment": "none"}, {"name": "grey street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "doxford barns", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "coreena ford luxury", "sentiment": "negative"}, {"name": "jesmond nurseries  boutique", "sentiment": "neutral"}, {"name": "lre capital", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "condeco software", "sentiment": "none"}, {"name": "coreena ford technology", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "ferrari", "sentiment": "none"}, {"name": "cobalt business exchange", "sentiment": "none"}, {"name": "shell", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "doxford barns", "sentiment": "none"}, {"name": "porsche", "sentiment": "none"}, {"name": "iamp", "sentiment": "none"}, {"name": "esmond dene house", "sentiment": "none"}, {"name": "safeway", "sentiment": "none"}, {"name": "aston martin", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "tuc", "sentiment": "none"}, {"name": "gainsborough house", "sentiment": "none"}, {"name": "condeco", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "faulknerbrowns architects", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pendragon", "sentiment": "none"}, {"name": "desert island discs", "sentiment": "none"}, {"name": "cambridge university", "sentiment": "none"}, {"name": "jaguar", "sentiment": "none"}, {"name": "jesmond dene house", "sentiment": "none"}, {"name": "national farmers’ union", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Luxury spa and housing mooted amid plans for former Jesmond Nurseries \nBoutique hotel Jesmond Dene House is set expand and create a luxury spa as part of plans for a prime piece of development land in Newcastle . \nThe former Jesmond Dene Nursery site in Newcastle was initially put up for auction a year ago by Newcastle City Council , with a guide price of £4m. \nHowever, that auction was extended and altered when an agreement was made to separate the historic Real Tennis Club from the land deal. \nPlanners have since pondered over bids for the remaining land, which includes cleared land, a number of vacant buildings and historic police stables. \nNow it can be revealed that retirement home specialist PegasusLife has been chosen by the council as a preferred bidder for the Jesmond site. \nIts plans for the plot of land would see Jesmond Dene House extended through the redevelopment of the old police stables to create new hotel rooms and a spa. \nSubject to contract, PegasusLife is aiming to deliver a mix of 91 later living apartments and, with joint venture partners, 18 executive family homes. A CGI of how the Jesmond Nursery site could be redeveloped by PegasusLife (Image: FaulknerBrowns Architects) 9.10 Coreena Ford Technology firm moves into new offices on Newcastle's Grey Street \nThe regeneration of Grey Street’s offices in Newcastle continues and it’s attracting lot of new tenants. \nTech firm Condeco Software has become the latest firm to move into the city , relocated from Cobalt Business Exchange to Gainsborough House, Grey Street, to become the latest tenant at the Grade II listed building following a major refit. \nThe five-storey building was acquired by LRE Capital in 2015, which has led the six-figure refurbishment to create much needed grade A office space, which is in very short supply in the city centre. \nThe historic building is a mixed-use building on Grey Street with Café Rouge on the ground floor. Gainsborough House on Grey Street, Newcastle (Image: Condeco) 9.05 Coreena Ford Most staff on zero-hours contracts would prefer guaranteed work \nMost workers on zero-hours contracts would rather have a job with guaranteed hours, a new report reveals. \nA survey of 300 adults employed on one of the controversial contracts showed that two thirds would rather have a guaranteed number of hours every week. \nThe main reason people were on a zero-hours contract was because it was the only type of work available to them, research by the TUC found. Only one in eight said they received sick pay, two fifths do not get holiday pay and only 7% would receive redundancy pay, it found. \nHalf of those questioned said they had shifts cancelled with less than 24 hours notice, and most wanted to work more hours. \nThe TUC estimated that zero-hours working is costing the exchequer £1.9 billion a year because those on the contracts pay less tax and national insurance and are more reliant on tax credits. The entrance to a Jobcentre Plus (Image: Philip Toscano/PA Wire) 9.00 Coreena Ford No 10 wine supplier says UK will starve if door is closed to fruit pickers \nAnd still on a Brexit-theme,the chief executive of Chapel Down, an official wine supplier to 10 Downing Street, warns that Britons will “starve” if the door is closed to foreign fruit pickers after Brexit. \nEngland’s biggest winemaker, based in Kent, relies on EU workers to pick grapes for its drinks, which also include beer, cider and gin. \nIn comments that are likely to cause embarrassment for Prime Minister Theresa May, Chapel Down chief executive Frazer Thompson said: “The biggest potential impact (of Brexit) is on agricultural labour. \n“Kent has had Eastern Europeans picking fruit in recent years, but we’ll all starve if the labour issue is not sorted after Brexit.” \nMr Thompson’s comments come as tonnes of fruit have been left to rot in farms across the country - including in Kent, Scotland and Herefordshire - because Brexit has made it harder to recruit European pickers. \nAccording to the National Farmers’ Union, the horticulture industry had a 29% shortfall of seasonal workers in September. A person picking strawberries (Image: PA) 8.55 KEY EVENT Wetherspoon chairman says immigration is 'good thing' for Britain \nJD Wetherspoon’s Brexit-backing chairman has admitted the future success of Britain’s economy will rely on inward immigration which he said was a “good thing” for the country. \nTim Martin said he does not deny that immigration benefits the UK, but he was keen to see it come under domestic control and ensure it is “subject to the will of the people”. “Immigration is a good thing but you don’t need to give your democracy away to get what you want,” he told the BBC’s Desert Island Discs programme. \n“You need a slightly rising population as the years go by to have a successful economy and a successful country.” \nHe said an Australian-style “points system” would still help make up for a low birth rate in Britain. \nThe pubs chain employs between 2,000 and 3,000 staff from other EU countries, reflecting the high number of foreign nationals that help run Britain’s bars and restaurants, which are expected to suffer if access to foreign workers is restricted as a result of Brexit. JD Wetherspoon chairman Tim Martin 8.50 Coreena Ford Own bitcoins? You can use them to pay for your wedding at these North East venues \nA leisure operator in Northumberland is planning to accept payment in bitcoin for luxury weddings held at its two venues. \nCharlton Hall and Doxford Barns are owned by entrepreneur Richard Shell, winner of the award for rural diversification at the 2017 North East Rural Awards, who is also an investor in bitcoin and is beginning to accept the cryptocurrency payment in a bid to offer clients more convenient ways to pay for their weddings. \nHe said the move will open up audience reach and position the two premium venues in front of the international cryptocurrency community as it becomes the first multi-venue operator in the UK to accept the virtual currency. \nResearch by Cambridge University shows there are around 5.8m users of cryptocurrency, the majority of whom use bitcoin. The average cost of a wedding at Doxford Barns equates to approximately 3.5 bitcoins or £15,000. \nMr Shell said: “My enterprising personality naturally makes me want to bring something new and different to the table for the ventures I invest in. \n“In this instance, I’m embracing technology and responding to emerging trends by offering clients the opportunity to pay in bitcoin so we can develop and enhance the service we provide.” \n“Large companies have been accepting payment in cryptocurrency for years now and it’s becoming more commonplace to transact in this way. \n“With online marketplaces also opening up their options, we need to embrace this movement if we’re serious about what we do. \n“The market in which we operate has already seen clients pay for wedding suits and dresses in bitcoin, so by accepting the same, we’re improving our service and convenience in a way that positions our brand leaps ahead of the competition. This marks an incredibly exciting and very important time for the company.” Charlton Hall in Northumberland (Image: Charlton Hall) 8.43 What's the FTSE and pound latest? \nThe FTSE-100 index at 8.15am was up 53.04 at 7353.53. \nThe pound at 8am was 1.3439 dollars compared to 1.3505 dollars at the previous close. The euro at 8am was 0.8817 pounds compared to 0.8818 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.40 Coreena Ford Pendragon to shut UK dealerships and sell US division \nCar firm Pendragon is to shut dealerships in Britain and offload its US division following a profit warning in October and a slowdown in UK new vehicle sales. \nThe company said that following a strategic review of the business, it will “reduce” the number of its premium brand franchises over the next three years. \nA total of 70 Pendragon dealerships house brands such as Aston Martin, BMW, Ferrari, Jaguar and Porsche. \nPendragon also announced that it will offload its US division, from which it expects to bank over £100m. \n“Given the strong performance of this division, we have concluded it is economically right to sell the business at this time to realise its value,” the firm said. \nThe decisions follow an October profit warning which sent Pendragon’s share price tumbling, with boss Trevor Finn pointing to a decline in demand for new cars amid falling consumer confidence. \nHe also said “certain manufacturers” were forcing vehicles into the market despite “softening demand”. It also comes after dire November figures from the Society of Motor Manufacturers and Traders (SMMT), which showed that Britain’s new car market declined for a seventh consecutive month. Pendragon will instead focus on the used car market, where it trades as Evans Halshaw with 118 dealerships and is aiming to double revenue by 2021. 8.35 Coreena Ford 10 companies looking to create jobs on automotive park in Sunderland \nNorth East councils hoping to bring 5,000 automotive jobs to the region say they already have 10 companies that want to set up on a planned business park. \nA planning application for the first phase of the International Advanced Manufacturing Park, close to the Nissan plant on the boundary between Sunderland and South Tyneside, is being prepared and is set to be lodged early next year. \nThe application for the Sunderland section of the park will seek permission for up to 10 specialist automotive and manufacturing units, as well as a new road link to the A1290 Washington Road plus car parking, service yards, access, landscaping and drainage ponds. \nIf the application is approved as hoped, companies could be on the site by the autumn of 2019. \nCoun Harry Trueman, deputy leader of Sunderland City Council, said: “There’s still a lot of work to do, but being able to indicate that 10 companies are already keen to locate and invest in this project is very, very encouraging.” \nSouth Tyneside Council leader Iain Malcolm added: “We’ve already carried out one round of consultation and demand from occupiers is stronger than we had anticipated. Having up to 10 specialist automotive and manufacturing businesses already interested in locating at IAMP and bringing new investment and jobs to our region is excellent news.” Sunderland IAMP (artist's impression) (Image: EYELEVEL CREATIVE LIMITED 2017) 8.30 KEY EVENT McColl's sales top £1bn for the first time \nConvenience retailer McColl’s has recorded annual revenue of over £1bn for the first time, despite a slowdown in the fourth quarter. \nThe group said the acquisition of 298 Co-Op stores helped it boost sales 19.1% in the year to November 26. \nFourth quarter sales rose 29%, but on a like-for-like basis, they were down 1.1% as McColl’s said “declining traditional categories and unfavourable weather” negatively impacted the business. \nMcColl’s, which recently sealed a supply deal with Morrisons, said full-year like-for-like sales nudged up 0.1%. \nNext year the firm is focusing on delivering an enhanced customer offer in over 1,300 stores through the wholesale partnership signed with Morrisons, which will see it launch hundreds of Safeway branded products, exclusively in McColl’s from January 2018. \nCommenting on the administration of wholesaler Palmer and Harvey, McColl’s said it was trying to minimise any potential impact on customers. \n“We are in ongoing discussions with our supply chain partners, and manufacturers, with a contingency plan already in place to ensure continuity of supply to the around 700 newsagents and smaller convenience stores, previously supplied by P&H, within our estate of 1,611 stores,” the group said. \nP&H crashed into administration last week, sparking 2,500 job losses and putting a further 900 at risk. McColl's acquisition of 298 Co-Op stores gave it a boost (Image: PA) More On", "external_links": [], "published": "2017-12-04T10:30:00.000+02:00", "crawled": "2017-12-04T11:50:20.025+02:00", "highlightTitle": ""}