{"organizations": [], "uuid": "759b896c999d9e887bc5c05889981c631a0f2579", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10578984.ece/ALTERNATES/s1200/JS34183511.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/south-shields-barbour-performs-strongly-14069056", "country": "GB", "domain_rank": 21960, "title": "South Shields' Barbour performs strongly around the globe in competitive market", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-21T18:29:00.000+02:00", "replies_count": 0, "uuid": "759b896c999d9e887bc5c05889981c631a0f2579"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/south-shields-barbour-performs-strongly-14069056", "ord_in_thread": 0, "title": "South Shields' Barbour performs strongly around the globe in competitive market", "locations": [], "entities": {"persons": [{"name": "barbour", "sentiment": "negative"}, {"name": "j barbour", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}], "organizations": [{"name": "sons ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business South Shields' Barbour performs strongly around the globe in competitive market The firm, which is famed for its Barbour jackets, is preparing to invest in areas of the business to boost its credentials Share Get business   Thank you for subscribing!   \nNorth East clothing company Barbour is toasting strong performance around the world in the face of a competitive market, latest accounts reveal. \nThe South Tyneside business J Barbour and Sons Ltd, famed for its jackets which are loved by the royals, the rural community and rock stars, posted turnover of £184.3m in the year ended April 2017. \nThat represents a 10% drop on the £205m posted for the 16-month prior period, but when adjusted for comparisons the firm’s bosses said it represented reasonable growth. \nOperating profit margins rose from 13.76% to 15.96%, with profit for the financial year coming in at £24.1m, up from the £19.95m chalked up in the last accounts. \nThe firm’s 12-month operating profit was also an improvement on the amount recorded for the previous 16 months, coming in at £29.4m compared to £28.2m. \nThe figures come as the fifth generation family business, which sells the Barbour and Barbour International ranges across the world, is working to bring all of its warehousing and distribution under one roof, by converting a 270,000sqft industrial unit close to its South Shields base. Dame Margaret Barbour \nLooking ahead, investment within its logistics infrastructure and IT and systems platforms is also planned, and opportunities for growth in markets around the world are also set to be explored. \nIn the group’s strategic report, director Dame Margaret Barbour added: “The EEA (European Economic Area) is a significant market for the business and Brexit is a source of considerable uncertainty and risk. we are currently developing various contingency plans to manage and mitigate its effect.” \nFollowing the publication of the accounts, managing director Steve Buck said: “Barbour continues to perform strongly and we are satisfied with our progress despite the challenging market conditions we face and significant adverse currency fluctuations. \n“Our success is down to the hard work of all our employees in the North East and around the world who are passionately involved in the brand’s growth. \n“Turnover is £184.3m, which when adjusted for the previous 16 month period (due to a change in year end) reflects a continued steady growth in sales. \n“Our operating profit is satisfactory given the competitive marketplace we operate in and the pressure that this brings on margins. \n“Despite these difficult conditions, we saw growth in most of our major markets and across many product categories including men’s shirts, ladies knitwear, footwear and accessories as we stay focused on our long term vision as a high quality global lifestyle brand. \n“It is also pleasing to note that both brands, Barbour and Barbour International - inspired by our motorcycle heritage since 1936 - have performed strongly, broadening our target consumer base and market opportunities. \n“We continue to support manufacturing in the UK and investment in our people. Our new one site distribution centre located in the local area will bring together all of Barbour’s distribution and warehousing into one area enabling increased efficiency and the capacity for future growth. \n“The Barbour Foundation which supports charitable causes, cultural and community projects and women’s groups, primarily in the North East receives its generous funding from the company dividend. Since its inception, The Foundation has donated over £13.1m to charitable causes.” Like us on Facebook", "external_links": [], "published": "2017-12-21T18:29:00.000+02:00", "crawled": "2017-12-21T18:37:37.001+02:00", "highlightTitle": ""}