{"organizations": [], "uuid": "fe4c2da24771ad145b957c94ca6b4798ae004052", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12241781.ece/ALTERNATES/s1200/Sports-Direct-agency-worker-conditions.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/mike-ashleys-sports-direct-see-14038208", "country": "GB", "domain_rank": 21960, "title": "Mike Ashley's Sports Direct see profits fall by £95m - but he says results are a success", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-14T15:35:00.000+02:00", "replies_count": 0, "uuid": "fe4c2da24771ad145b957c94ca6b4798ae004052"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/mike-ashleys-sports-direct-see-14038208", "ord_in_thread": 0, "title": "Mike Ashley's Sports Direct see profits fall by £95m - but he says results are a success", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "fiona cincotta", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "city index", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Direct founder Mike Ashley (Image: Joe Giddens/PA Wire) Share Get business   Thank you for subscribing! Could   \nMike Ashley’s Sports Direct has seen its pre-tax profits plummet by £95m at the half-year mark, after the retailer closed a number of stores. \nProfit before tax fell 67% from £140.m in 2016 to £45.8m for the six months ending October 2017. The fall in profits came despite turnover increasing by 4.7% to £1.7bn. \nSports Direct said that the profit decrease was the result of falling UK sales following store closures, reduced online promotions, and the Brexit hit pound. \nBut Mr Ashley , who also owns Newcastle United, has hailed the results as a triumph, adding that the firm’s flagship stores were seeing “spectacular” trading. \nMr Ashley, who is chief executive of Sports Direct, said: “Our high street elevation strategy is currently delivering spectacular trading performance within our flagship stores. We intend to open between 10 and 20 new flagship stores next year. \n“Whilst our reported profit before tax has been impacted by fair value adjustments and transitional factors such as the disposal of assets in FY17; our underlying profit before tax remains healthy. We will continue to invest for the long-term and our net debt has increased in line with management expectations. \n“We continue to anticipate that growth in underlying EBITDA during FY18 will be within our forecast range of 5% to 15%.” \nFinancial analysts have said that the firm’s results are not as negative as the profit decline would suggest, as Sports Directs’ 2016 profits were largely buoyed by the sale of its stake in JD Sports. Read More 'Newcastle is failing tech entrepreneurs' - business leader issues rallying call to help start-ups \nFiona Cincotta, a senior market analyst at City Index, said: “On an underlying basis, earnings are tracking in line with company guidance, albeit at the bottom end of the range. \n“Margins are still in decay, as excess inventory is written off and competition with the likes of JD Sports bites. The newly-established US business, meanwhile, has blighted the books with an inaugural £23m operating loss. \n“Mike Ashley is certainly bullish about the new store format, describing its performance so far as spectacular. Evidence of a sustained margin recovery will be needed before such bombastic descriptions can be applied to the share price.” \nMr Ashley and his company has suffered from a number of controversies over the last year, including issues regarding workers rights at its UK warehouse. \nLast week Sports Direct was also named and shamed for paying 383 workers below the minimum wage. In total the firm was require to retrospectively pay workers £167,036.24. \nIn the results, the board said it was committed to “ensuring that our people are treated with dignity and respect”. In September the company paid out bonuses worth £43m to eligible employees. Like us on Facebook", "external_links": [], "published": "2017-12-14T15:35:00.000+02:00", "crawled": "2017-12-14T16:28:58.004+02:00", "highlightTitle": ""}