{"organizations": [], "uuid": "805b4445b168e4165e131b063901f53116faa3c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article139965.ece/ALTERNATES/s1200/Highcross-shopping-centre.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/owner-highcross-agrees-34b-deal-882870", "country": "US", "domain_rank": 48128, "title": "Owner of Highcross agrees £3.4b deal to buy shopping centres including Lakeside - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.121, "site_type": "news", "published": "2017-12-06T11:00:00.000+02:00", "replies_count": 0, "uuid": "805b4445b168e4165e131b063901f53116faa3c4"}, "author": "Sam Dimmer", "url": "http://www.leicestermercury.co.uk/news/business/owner-highcross-agrees-34b-deal-882870", "ord_in_thread": 0, "title": "Owner of Highcross agrees £3.4b deal to buy shopping centres including Lakeside - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "highcross", "sentiment": "negative"}, {"name": "david atkins", "sentiment": "none"}, {"name": "david tyler", "sentiment": "none"}, {"name": "intu", "sentiment": "none"}, {"name": "john strachan", "sentiment": "none"}, {"name": "atkins", "sentiment": "none"}, {"name": "tyler", "sentiment": "none"}], "locations": [{"name": "bicester village", "sentiment": "none"}, {"name": "intu", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "trafford centre", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "hammerson", "sentiment": "none"}, {"name": "new aldi", "sentiment": "none"}, {"name": "intu", "sentiment": "none"}, {"name": "brent cross", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cancel play", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Owner of Highcross agrees £3.4b deal to buy shopping centres including Lakeside Hammerson announced the deal this morning Share Sam Dimmer Digital Development Editor 09:00, 6 DEC 2017 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe owner of Leicester shopping centre Highcross has announced a huge deal to buy a rival firm. \nHammerson has agreed an all share takeover of rival Intu in a £3.4 billion deal that will create Britain's biggest property company. \nIt will see the likes of Intu owned Lakeside, Highcross and the Bullring, come under one roof, creating create a £21 billion shopping centre giant. \nThe deal represents a value of approximately 253.9p per Intu share, equivalent to £3.4 billion. \nThe deal is unlikely to have an affect on Highcross, but it will mean the giant firm owns three shopping centres in the East Midlands. Read More New Aldi set to open \nThe combined group will be led by Hammerson boss David Atkins and chaired by David Tyler. \nShareholders will vote on the deal next year, with Intu having already secured 50% of investor support for the all-paper deal. \nMr Tyler said: \"This transaction will deliver real value for shareholders. \n\"The financial strength of the enlarged group and its strong leadership team will make it well-placed to take advantage of higher growth opportunities on a pan-European scale.\" \nThe groups plan to slash costs, offload at least £2 billion worth of assets and target high growth markets such as Spain and Ireland. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIntu also operates the Trafford Centre in Manchester while Hammerson owns Bicester Village and Brent Cross shopping centre. \nJohn Strachan, chairman of Intu, said: \"A combination of both Intu and Hammerson will create a more resilient, diversified and stronger group that we believe will benefit all our stakeholders. \n\"Intu offers high-quality retail and leisure destinations in the UK and Spain, which when merged with Hammerson's own top-quality assets in the UK, in France and in Ireland, present a highly attractive proposition for retailers and shoppers in Europe's leading cities.\" Read More Which Toys 'R' Us store in Leicester is closing? \nThe acquisition will result in Hammerson shareholders owning 55% of the combined firm and Intu investors the remainder. \nThe deal comes at a time when consumer confidence has taken a pounding following the Brexit vote, resulting in a sharp decline in retail sales. \nHowever, shopping centres in city locations have tended to fare better than high streets during economic downturns. \nMr Atkins added: \"This marks an exciting milestone in the history of Hammerson. Bringing together the high-quality portfolios of both companies establishes Hammerson as a larger, leading European retail REIT, enhances shareholder returns and supports opportunities for long-term growth. \n\"The acquisition creates a leading pan-European platform of desirable retail and leisure destinations which are better positioned to serve the needs of our retailers, excite our customers and support our partners and communities.\" Like us on Facebook ", "external_links": [], "published": "2017-12-06T11:00:00.000+02:00", "crawled": "2017-12-06T12:54:19.007+02:00", "highlightTitle": ""}