{"organizations": [], "uuid": "8a207d06240ba98fdb71e518eab18aa8a829cd41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13741214.ece/ALTERNATES/s1200/BAE-Systems-jobs.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14020716", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: BAE Systems strikes £5bn Qatar aircraft deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-11T10:00:00.000+02:00", "replies_count": 0, "uuid": "8a207d06240ba98fdb71e518eab18aa8a829cd41"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14020716", "ord_in_thread": 0, "title": "Business Breakfast LIVE: BAE Systems strikes £5bn Qatar aircraft deal", "locations": [], "entities": {"persons": [{"name": "khalid bin mohammed al attiyah", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}], "locations": [{"name": "qatar", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "lancashire.bae systems", "sentiment": "none"}, {"name": "warton", "sentiment": "none"}, {"name": "oman", "sentiment": "none"}], "organizations": [{"name": "bae", "sentiment": "negative"}, {"name": "qatar emiri air force", "sentiment": "none"}, {"name": "bae systems", "sentiment": "none"}, {"name": "qatar armed forces", "sentiment": "none"}, {"name": "bae systems  bae systems", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Music entrepreneurs plan recruitment drive after launching 'game changing' online library \nA group of North East music entrepreneurs is set to start a recruitment drive after launching an online library set to be a game changer for the way people access royalty free music. \nWhitley Bay-based FCP Audio is the brainchild of owners and founders Anthony Dow and Ryan Davidson, who launched the library in November and have experienced large-scale traffic in over 90 countries. \nThe pair have already laid down ambitious growth plans for their new platform, which include finding a new base. \nThey said their online music library is the only one in the world that offers customisable, authentic genre styles of music for people who are familiar with the professional film editing software Final Cut Pro X. \nCo-Founder Ryan Davidson believes it will transform the way that film editors, ‘Youtubers’, and home movie enthusiasts can access affordable music for their projects. \nIn order for their platform to excel, the duo has assembled a team of nine music production, PR and marketing professionals to place their product in front of the eyes of millions of downloaders. \nFCP Audio will also look to roll out an extensive recruitment drive in 2018 in order to fulfil their second phase of development and reach their £1.5m turnover target in three years. \nMr Davidson said: \nOur product is aimed at any user of Final Cut Pro X who need credible and affordable music. Better yet, music that they can build themselves, exactly how they want to, with no added complications. \nWe felt that other music providers do not presently offer authentic genre styles. \nWe hope to continue to build our brand up until we become the major ‘go to’ Royalty Free music site for all FCPX users. We feel FCP Audio offers more control over the final composition than any of our competitors and our licence agreement lets you use our music on any platform, forever. All at no extra cost. Inside the FCP Audio studio (Image: FCP Audio) 9:00 Jonathon Manning Hollywood Bowl strikes big with profits leap \nHollywood Bowl, Britain’s biggest ten-pin bowling operator, has reported a sharp rise in profits as the group continues to grow sales and open new sites.The Hemel Hempstead-headquartered group, which listed on the stock exchange last year, saw pre-tax profit rocket from £2.6m to £21.1m in the year to September 30.The figures were flattered by the absence of large exceptional items, which dragged down its performance last year.Revenue at Hollywood Bowl rose 8.8% to £114m, while like for like sales grew 3.5% as more people rocked up at its venues to partake in the pastime.Total game volumes increased 8.5% with 13m games bowled as the average spend per game increased 0.8% to £8.70.Boss Stephen Burns said: \nI am delighted to report a strong operational and financial performance for our first full year since IPO. \nOur rebrands and refurbishments have delivered significant returns and new centres opened in the year have performed ahead of expectations. \nThe investments we have made in improving our brand and customer offer have been well received by customers, resulting in more visits and increased spend per game across our portfolio. \nThe group has over 50 centres across the UK and opened three new centres - in Derby, Southampton and The London O2 - in the period.Hollywood Bowl also announced a final ordinary dividend of 3.95p per share and a special dividend of 3.33p.Mr Burns added that Brexit is unlikely to impact the firm, despite a squeeze on consumer spending triggered by the collapse in the pound following last year’s referendum. \nHe said: \nThere is much talk in the press and elsewhere of the impact of ‘Brexit’. \nWe do not believe that the exit of the United Kingdom from the EU will have an impact on the underlying performance of our business because Hollywood Bowl, and the activities we offer, have great customer appeal throughout the country and through all economic cycle. \nThe firm raised £181m in 2016 through an initial public offering on the London Stock Exchange, valuing the firm at £240m. A Hollywood Bowl venue KEY EVENT RealRider motorcycle app strikes deal with Close Brothers \nNewcastle motorcycle safety app RealRider has struck a major deal that will see its service for free to customers of Close Brothers Motor Finance. \nRealRider is a crash detection app, which helps to save lives by informing the 999 emergency services of a motorcyclist’s location if they have had an accident. It also sends the ambulance control room medical details such as the rider’s blood type. \nThe new partnership means that any motorcyclist taking out finance with Close Brothers will now have free access to the app for the first three months. \nAndrew Richardson, chief commercial officer of REALRIDER’s parent company Realsafe Technologies, said: \nThe opportunity to collaborate with Close Brothers began earlier in the year at the Sunderland Software City round of HRH’s Pitch@Palace program. As sponsors of the event, Close Brothers Technology Services’ Relationship Director Craig Smith saw the potential for us to work together following a presentation of our technology to protect motorcyclists. \nAfter months of discussions, I’m delighted to be working in partnership with Close Brothers, which already counts tens of thousands of bikers among its customers. \nIt is a great opportunity for riders to check out a technology which could potentially save their lives and demonstrates Close Brothers’ own commitment to helping its policyholders stay safe on the road, particularly at this time of year. \nNeil Richardson, Head of the Motorcycle Division at Close Brothers Motor Finance, added: \nWe’re excited about what this innovative partnership will mean for consumers that buy bikes on finance, especially given REALRIDER’s commitment to top of the range technology. Safety and security are two of our key goals, and we’re looking forward to working with REALRIDER to offer motorcyclists some piece of mind this winter. \nWe’re committed to putting our dealers in a position to ensure that the best offers and equipment are available to their customers, be it stock on the forecourt or apps on their phones. This partnership gives dealers something special to add to their offering as we approach the Christmas season. (R-L) His Royal Highness Prince Andrew, CEO Zoe Farrington, CCO Andrew Richardson (Image: RealRider) 8:50 Young's Seafood owners eye potential sale Young's Seafood salmon with roast potatoes 8:45 KEY EVENT Newcastle pair take company from bedroom enterprise to a £1.3m turnover operation \nA Newcastle marketing company that was founded in a bedroom is now expecting to double its workforce and turnover over the next 12 months. \nEvolved Digital was launched in 2014 by David Watts and Ian McIntosh but has since grown into a £1.3m business employing 28 members of staff. \nThe firm specialises in improve search engine optimization for businesses, which allows a firm’s website to drive sales by appearing higher up in Google search lists. \nDespite being launched from the founders’ bedrooms in Gosforth, Newcastle, Evolved Digital has grown rapidly after winning a number of national clients, such as comparison site Money Guru, mattressonline.co.uk, and FTSE 250 construction firm SIG Group. \nThe company, which is based at the Toffee Factory in Newcastle, is hoping to double the size of its business in the next year. \nDavid Watts, co-founder and digital director, said: \nThe current turnover is £1.3m. We must be one of the fastest growing digital businesses in Newcastle. We should double our size year-on-year. \nWe have taken on five or six people already in he last couple of months. \nAt the moment Evolved Digital operates two offices, its headquarters at the Toffee Factory and a smaller satellite office in London. \nBut the firm’s growth plans will soon force the company to move and it is currently looking for a large, high quality site in Newcastle. Evolved Digital accepting the award for Best SEO Campaign last year. (L-R) comedian Jason Manford with Ian Macintosh, David Watts, Mark Tonge, Daniel Jones and John Ridley (Image: Evolved Digital) 8:40 Jonathon Manning Lakes Distillery raises £1.75m in 30 days through crowdfunding site \nThe Lakes Distillery has successfully raised £1.75m through a crowdfunding campaign designed to help the company grow. \nThe company, headquartered in Newcastle with its distillery in Cumbria, took to Crowdcube last month to raise £1m to expand the business’ production of its single malt whisky. \nIt became the fastest funded distillery in Crowdcube’s history after hitting the target within three days. \nAfter discovering how popular the venture was with investors, The Lakes Distillery decided to add an additional £750,000 target onto the campaign. \nAfter less than a month the firm has hit its second target and ended its campaign. \nCommenting on the successful completion of the share sale, co-founder Nigel Mills said: \nWe are immensely proud that the campaign has managed to fulfil its full quota of funding before the time was up. \nIt just goes to show that the right business, with the right product, at the right time, is an investment worthy of anyone’s money, and we thank everyone for their contributions. \nIt also showcases the effectiveness of the EIS scheme, which has encouraged a whole new generation of potential investors to take stakes in new and growing businesses across the UK. Financially backing entrepreneurship is one of the best ways to get the most out of great innovation, because too many great ideas are lost due to lack of support. Lakes Distillery managing director Paul Currie with the firm's first batch of single malt whisky (Image: Kevin Gibson Photography Ltd) 8:35 KEY EVENT North East first time buyers will save less than £12 from stamp duty changes \nRecently introduced Stamp Duty Changes will benefit southern house buyers far more than those in the North, after figures reveal that the average first time buyer in the North East will save less than £12. \nIn this year’s Autumn Budget the Conservatives radically reformed Stamp Duty changes so that first time buyers no longer need to pay the tax on the first £300,000 of any home that costs up to £500,000. \nThe changes have the potential to save first time buyers thousands of pounds. \nHowever, in the North East where the average first time buyer pays only £125,591 for a new home, they will save an average of £11.82. \nFigures released by Avant Homes show that the biggest savings will be made by those in London, which can expect to save on average £4,999.50. Those in the South East will save an average of £3,838.65, the South West will save £1,477.52, while those in East Anglia will no longer pay £1,477.52 \nColin Lewis, CEO of Avant Homes, said: \nThe Autumn Budget was a real missed opportunity and big disappointment for the North of England. Yet again, we saw misguided Government policies slanted in favour of the South and an outright failure to address several key elements that could be make or break for the success of its Northern Powerhouse project. \nOur research of workers across the UK highlights that the chronic and expanding undersupply of housing in the North of England is a key element missing from the Government’s housing strategy, which needs specific policies targeted at the region, rather than the Chancellor’s current ‘one-size- fits-all’ approach. \nAs our Northern Powerhouse Building Manifesto sets out, if the Government can fix the North’s broken housing market, this will play a huge part in ensuring fairer housing provision for all and, ultimately, a lasting legacy for the project. A woman looking at houses for sale (Image: PA) 9:28 Jonathon Manning More skilled engineers 'fundamental' for Government's industrial strategy \nTackling the shortage of skilled engineering workers is “fundamental” to the success of the Government’s flagship industrial strategy, ministers are being told.Research by the Institution of Engineering and Technology (IET) among 800 employers found that three out of five believed trying to recruit suitably qualified staff was a barrier to their business prospects.Most of those surveyed said digital technologies and automation will advance rapidly over the next few years in engineering.Joanna Cox, head of policy at the IET, said: \nAs the UK goes through a period of economic uncertainty, the skills shortage in engineering remains an ongoing concern for engineering companies. \nEmployers tell us that tackling this problem is fundamental to making the Government’s industrial strategy viable. Workers in a factory (Image: PA) 8:23 Jonathon Manning Investec warns of profits dip over Poundland owner exposure \nInvestec has warned that its exposure to Poundland’s South African owner, Steinhoff, could dent profits.It comes after shares in Steinhoff tanked last week with the firm’s chief executive quitting amid an investigation into accounting irregularities.Investec said its exposure represents a “small portion of the group’s balance sheet” and it is not “expecting to suffer any losses”.However, it added: \nInvestec Bank Limited (South Africa) does have certain derivative exposures linked to the Steinhoff share price, where a trading loss could materialise. \nThe loss could be zero but the maximum potential loss could be approximately 3% of the Investec group’s post-tax operating profit. \nLast week Stenihoff announced that chief executive Markus Jooste will resign with immediate effect, adding that information has come to light which “relates to accounting irregularities requiring further investigation”. Poundland shop ", "external_links": [], "published": "2017-12-11T10:00:00.000+02:00", "crawled": "2017-12-11T10:29:18.000+02:00", "highlightTitle": ""}