{"organizations": [], "uuid": "3201a21bfc76719eb66a69fc3174cc0b52fa221f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article562948.ece/ALTERNATES/s1200/JonAsworth.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/leicester-news/the-new-vaughan-college-essential-890900", "country": "GB", "domain_rank": 48128, "title": "'The new Vaughan College is essential to our community'", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-07T14:43:00.000+02:00", "replies_count": 0, "uuid": "3201a21bfc76719eb66a69fc3174cc0b52fa221f"}, "author": "leicestermercury", "url": "http://www.leicestermercury.co.uk/news/leicester-news/the-new-vaughan-college-essential-890900", "ord_in_thread": 0, "title": "'The new Vaughan College is essential to our community'", "locations": [], "entities": {"persons": [{"name": "jon ashworth", "sentiment": "positive"}, {"name": "vaughan centre", "sentiment": "none"}, {"name": "miriam gill", "sentiment": "none"}], "locations": [{"name": "leicester south", "sentiment": "none"}, {"name": "vaughan centre", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "vaughan college", "sentiment": "positive"}, {"name": "leicester adult education college", "sentiment": "none"}, {"name": "belvoir st", "sentiment": "none"}, {"name": "leicester vaughan college community benefit society", "sentiment": "none"}, {"name": "leicester vaughan college", "sentiment": "none"}, {"name": "community benefit society", "sentiment": "none"}, {"name": "city council", "sentiment": "none"}, {"name": "leicester adult skills and learning service", "sentiment": "none"}, {"name": "leicester vaughan college ltd", "sentiment": "none"}, {"name": "adult education", "sentiment": "none"}, {"name": "university of leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'The new Vaughan College is essential to our community' Leicester South MP Jon Ashworth's latest Mercury column Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nI believe that everyone deserves a second chance in their life no matter the circumstances, and that includes lifelong learning. \nAdult Education is life-changing and it should be accessible to everyone who wishes to develop new skills, increase career opportunities available to them, or just learn to new things in subjects that they are passionate about. Read More ‘Growing up in a Leicester pub, I was the envy of all my mates’ \nIt is heart-breaking that many teenagers are forced to drop-out of school or college in order to support a family, and the number of young adults who face personal unforeseen circumstances and cannot continue with learning. \nBut this does not mean that this is where their learning journey ends. As long as there is motivation there should not be anything to stop people from accessing education later in life. \nFrom the very beginning I backed the Vaughan Centre and I campaigned with its supporters to save it from closure. The Vaughan Centre was the only provider of face-to-face, part-time, evening, certificated, Higher Education in the region. Read More Brexit bot threat \nDespite the high profile campaign, the University of Leicester went ahead and closed the Centre last year. But the campaign led by Dr Miriam Gill continued to fight on and Vaughan College was officially re-established last month. \nIt is incredible that the college will be offering university level courses dedicated to the needs of part-time learners and to those wanting a second chance to study. \nI was honoured to speak at the official launch of Vaughan College and become a founding member of the Community Benefit Society that will run Vaughan College. \nThe college is now independent of the University of Leicester and will work in partnership with the City Council’s Leicester Adult Skills and Learning Service to provide courses to students from diverse communities. \nPeople who are willing to continue learning should not feel left out, and this is why I am such a strong advocate of Vaughan College. I want people in Leicester to know that it is never too late to start over, and having a second chance is sometimes all we need. \nThe campaigners did an amazing job in re-establishing Vaughan College, and with everything that is going on in the world today, it is good to see people coming together to help the wider community. Read More Leicestershire councillor faces investigation over allowance remarks \nI strongly believe that the college is essential to our community and will play an important role in transforming peoples’ lives. You can become a member of Leicester Vaughan College Community Benefit Society for a fee of only £1. For more details contact Leicester Vaughan College at . \nYou can also donate to the college by sending cheques payable to ‘Leicester Vaughan College Ltd’ to: Leicester Vaughan College Ltd, c/o Leicester Adult Education College, 54 Belvoir St, Leicester, LE1 6QL Like us on Facebook ", "external_links": [], "published": "2017-12-07T14:43:00.000+02:00", "crawled": "2017-12-07T15:12:44.003+02:00", "highlightTitle": ""}