{"organizations": [], "uuid": "175c2957d681794b68ae4122d8c9e7bd179dd7ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/news/north-east-news/article14013090.ece/ALTERNATES/s1200/may-brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-urges-eu-nationals-stay-14024926", "country": "GB", "domain_rank": 21960, "title": "Theresa May urges EU nationals to stay in the UK after agreeing Brexit deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-11T20:13:00.000+02:00", "replies_count": 0, "uuid": "175c2957d681794b68ae4122d8c9e7bd179dd7ee"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-urges-eu-nationals-stay-14024926", "ord_in_thread": 0, "title": "Theresa May urges EU nationals to stay in the UK after agreeing Brexit deal", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "ken clarke", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "iain duncan smith", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "brexiteer", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "newcastle  labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May urges EU nationals to stay in the UK after agreeing Brexit deal The Prime Minister appears to have healed Tory divisions over Brexit after negotiating a divorce deal with the EU Share   daily   Thank you for subscribing! Could   \nPrime Minister Theresa May has urged more than three million European Union nationals living in Britain to stay in the country after Brexit. \nShe wrote an open letter to Europeans who came to the UK under freedom of movement rules, pledging that their rights would be protected under a deal announced last week. \nIt came as Mrs May was praised by Conservative MPs for negotiating a “divorce” deal with the EU, suggesting that any Tory divisions over Brexit have been resolved for the time being at least. \nBrexit rebels such as former minister Anna Soubry and former cabinet minister Ken Clarke, both pro-EU MPs, congratulated the Prime Minister for her “triumph” last week. \nAnd Iain Duncan Smith, a prominent Brexiteer also praised Mrs May for “driving through an improved agreement”. \nMeanwhile, Labour Shadow Chancellor John McDonnell said he stood by his earlier claim that staying inside the single market under current rules, which include accepting free movement of EU citizens, would not respect the Brexit referendum result - but said Labour wanted the UK to stay in “a single market” instead. \nMr McDonnell said: “What I said is that remaining within the single market would not respect the referendum result. \n“What we’ve been using as the phraseology, a single market, not the single market, and a customs union not the customs union, so therefore a reformed single market or a new negotiated relationship with the single market.” \nHe also said: “We want to keep all the options on the table and that way we think we can protect the economy and at the same time get a negotiated settlement with Europe itself.” Read More \nThe outbreak of Tory unity emerged as Mrs May updated the Commons about last week’s talks. \nShe confirmed reports that the UK could pay the EU up to £40 billion. \nThe Prime Minister said: “We have agreed the scope of the commitments and methods for valuation and adjustments to those values. \n“It is the case that that is, the calculations currently say that that would be £35 billion to £39 billion.” \nBut she warned she would take the offer of a financial settlement “off the table” unless the EU agreed to an acceptable trade deal. \nMrs May also confirmed the Government will push ahead with its proposal to include the Brexit date in key legislation despite a potential Tory rebellion. \nThe Prime Minister said she believes fixing March 29 2019 as the leaving date in the European Union (Withdrawal) Bill, which seeks to transfer European law into British law, will give “confidence” to people. Read More Labour party could create a regional Bank of England office in Newcastle \nLabour leader Jeremy Corbyn said the Prime Minister “has scraped through phase one of the negotiations”. \nHe added: “Scraped through after 18 months, two months later than planned, with many of the key aspects of phase one still not clear. \n“This weekend Cabinet members have managed to contradict each other. Indeed some have managed to go even further and contradict themselves.” \nNorth East employers have warned the Government “still has work to do” before firms can have confidence that Brexit can be implemented successfully. Like us on Facebook", "external_links": [], "published": "2017-12-11T20:13:00.000+02:00", "crawled": "2017-12-11T20:29:42.035+02:00", "highlightTitle": ""}