{"organizations": [], "uuid": "97b336df3ffb98f00f1664b41f4b72c0e2d1e502", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11919631.ece/ALTERNATES/s1200/JS100289332.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/digital-skills-deficit-within-small-14013612", "country": "GB", "domain_rank": 21960, "title": "Digital skills deficit within small businesses must be tackled, FSB warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-11T02:01:00.000+02:00", "replies_count": 0, "uuid": "97b336df3ffb98f00f1664b41f4b72c0e2d1e502"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/digital-skills-deficit-within-small-14013612", "ord_in_thread": 0, "title": "Digital skills deficit within small businesses must be tackled, FSB warns", "locations": [], "entities": {"persons": [{"name": "david wala", "sentiment": "none"}, {"name": "jim mawdsley", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}, {"name": "generator", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "gospelware", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sage uk", "sentiment": "none"}], "organizations": [{"name": "fsb", "sentiment": "negative"}, {"name": "business digital", "sentiment": "negative"}, {"name": "lloyds bank business digital index", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "digital drive county durham", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "be group and business durham", "sentiment": "none"}, {"name": "digital union", "sentiment": "none"}, {"name": "sunderland software city", "sentiment": "none"}, {"name": "national retraining scheme", "sentiment": "none"}, {"name": "orange bus", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Digital skills deficit within small businesses must be tackled, FSB warns Research by the Federation of Small Businesses is calling for urgent Government and industry action to tackle the skills gap Share Mike Cherry, chair of the Federation of Small Businesses Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nProductivity growth in the UK will continue to stall without Government and industry action to tackle a digital skills deficit in small businesses, according to new research from the Federation of Small Businesses (FSB). \nThe research finds that over a quarter (26%) of business owners across the North East and the rest of the UK lack confidence in their basic digital skills, and more than a fifth (22%) believe a lack of basic digital skills among their staff is holding them back from increasing their digital and online presence. \nLast month the Chancellor announced plans in the Budget to invest £76m into retraining adults who want to work in the digital and construction sectors – but the FSB warns that small firms will be left behind unless the National Retraining Scheme is designed with them in mind. \nThe warning follows a further study published in the Lloyds Bank Business Digital Index 2017 which revealed 34% of firms in the region lack simple tech skills that could help them save costs and improve productivity. \nDespite evidence that digital skills can have a major impact on the success of a business, with digitally capable organisations proving to be twice as likely to report an increase in turnover compared to digital illiterate businesses, a quarter of small firms do not consider digital skills to be important to the growth of their business. \nMike Cherry, FSB national chairman, said: “We know that embracing digital technology can help businesses in every sector to be more productive. \n“Firms risk being left behind unless they have the skills to take advantage of technology to remain competitive and responsive to their customers. \n“We need to highlight the benefits of going digital and then make sure that small businesses and their staff can access basic digital skills training that meets their needs through initiatives like the National Retraining Scheme. If we can harness the digital potential of small firms, we stand a real chance of creating more world-beating businesses and boosting growth. Read More Will.i.am and Atom Bank: The story behind the superstar board signing \n“As the UK moves towards Brexit, a technical skills black hole threatens the economy. Small firms also tell us that technical skills are crucial to the future growth of their businesses. The clock is ticking to tackle the ever-widening skills gap. \n“The twin pressures of rapid technological change and Brexit make upskilling the current workforce more important than ever.” \nDespite most small business owners providing some kind of skills training for themselves and their staff over the 12 month period, half (49%) do not have a formal training plan or budget. In addition, three quarters of self-employed have no plan or budget to support training. \nFSB believes a strategic approach to training is essential to support small business growth aspirations, so small businesses must know where to turn for help on this. Small firms say the main barriers to training are the fact that their staff are too busy (25%), training is too expensive (21%) or the type of training desired is not available locally (16%). \nWithin the North East a number of initiatives are being launched to tackle the digital knowledge gap. \nA £4m programme, Digital Drive County Durham, gets under way in January in a partnership between BE Group and Business Durham, to help companies thrive in a digital world. \nMeanwhile, creative and digital support agency Generator will next month roll out an eight-week digital training programme to drive forward the skills agenda for the region’s tech sector. \nThe extensive programme, to be delivered by the likes of Gospelware, Orange Bus, hedgehog lab, Sage UK and Atomhawk, will be officially launched at Newcastle’s Live Theatre this week. Jim Mawdsley, CEO of Generator, speaks at the Digital Union event (Image: David Wala) \nJim Mawdsley, CEO of Generator said: “The findings of the FSB are right and this is of growing concern to the tech and digital sectors of the North East. \n“We are working with partners including the North East LEP, Sunderland Software City and local authorities in the North East to ensure there are appropriate digital skills action plans in place but also wherever possible secure the funding to improve skills in digital businesses and digital skills in none digital businesses. Read More Lakes Distillery raises £1.75m in 30 days through crowdfunding site \n“The Government however need to wake up and realise that unless radical change is made in school curriculum alongside investment in training teacher with both skill needed in the Tech Sector and knowledge of the roles that require these skills we may lose out and fall behind those economies who are reacting quicker. \n“Skills for tech businesses are also short in the ways they work with teamworking, communicating, pitching and presenting in short supply which is why we have set up the Generator Digital Bootcamp to help bring graduates, recent industry entrants and career changers up to speed with this fast paced ever changing sector.” Like us on Facebook ", "external_links": [], "published": "2017-12-11T02:01:00.000+02:00", "crawled": "2017-12-11T05:02:52.017+02:00", "highlightTitle": ""}