{"organizations": [], "uuid": "75c8d14f29277e10a374325e756b59074f541620", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/news/north-east-news/article14013090.ece/ALTERNATES/s1200/may-brexit.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-divorce-deal-might-sealed-14013410", "country": "GB", "domain_rank": 21960, "title": "Brexit divorce deal might be sealed but North East employers warn there's much more to do", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-08T18:09:00.000+02:00", "replies_count": 0, "uuid": "75c8d14f29277e10a374325e756b59074f541620"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-divorce-deal-might-sealed-14013410", "ord_in_thread": 0, "title": "Brexit divorce deal might be sealed but North East employers warn there's much more to do", "locations": [], "entities": {"persons": [{"name": "jean-claude juncker", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "david davis  mrs may", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}, {"name": "gavin barwell", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "north east ukip", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom flag", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "republic", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union flag", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Brexit divorce deal might be sealed but North East employers warn there's much more to do Trade talks with the EU can now begin after UK agrees £40 billion Brexit divorce deal in boost for Theresa May Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nEmployers in the North East refused to join in celebrations over the Government’s £40 billion Brexit deal, saying there were still many issues to be resolved before business could have confidence. \nThe European Commission has agreed to begin talks on a trade deal with the UK, in a major breakthrough after six months of Brexit negotiations. \nIt comes after the EU and UK came to an agreement on the terms of the UK’s withdrawal. Key proposals include the UK paying \nin to the EU budget up to the end of 2020 “as if it had remained in the Union”, and continuing to finance EU projects funded by the 2014-20 budget until they are completed. \nBritish payments are expected to come to around £40 billion in total. \nThe agreement still needs the approval of the remaining 27 EU states, who meet next Thursday, Prime Minister Theresa May speaks during a media conference with European Commission President Jean-Claude Juncker at EU headquarters in Brussels on Friday, Dec. 8, 2017 (Image: AP Photo/Virginia Mayo) \nBut it was hailed by Prime Minister Theresa May as “a hard-won agreement in all our interests”, while European Commission president Jean-Claude Juncker said it represented “sufficient progress” for negotiations to move on to their second phase. \nNorth East England Chamber of Commerce said it was just the start. Policy director Ross Smith said: “It is a huge relief for businesses to have got through this stage of negotiations, we now need swift progress on both a comprehensive trade deal and a sensible transition period. \n“There remains many aspects to be resolved before we can have confidence that Brexit can be implemented successfully. The confusion over impact assessments this week hasn’t help build confidence so the Government still has work to do to reassure our members that risks can be mitigated and opportunities capitalised upon.” \nConservative MP Guy Opperman, MP for Hexham in Northumberland, said: “ Guy Opperman (Image: Newcastle Chronicle) \nTrade talks will be tough but today’s breakthrough is genuine sunshine on a winters day.” \nHowever, some staunch supporters of Brexit condemned the proposals. Read More Brexit chief says Government did NOT study impact of Brexit on sectors of the economy \nNorth East UKIP MEP Jonathan Arnott said in a post on his website: “Theresa May’s Brexit negotiations are indeed a betrayal of what we voted for, but these plans will eventually result in leaving the European Union.” \nHe added: “EU courts will continue to overrule our own for up to 8 years on certain issues. We’ll still be paying to EU projects well beyond the end of 2020. Our fishing waters will not be regained immediately on Brexit Day, but at some indeterminate point beyond it. The question of the border between Northern Ireland and the Republic has been kicked into the long grass. \n“However big a betrayal this is of our nation, the one silver lining to this cloud is that we will eventually regain our freedom. We will eventually stop paying money to the European Union, and it will eventually leave us regaining our democracy and saving vast sums on EU membership.” The European Union Flag and United Kingdom Flag intertwined (Image: Getty Images Europe) \nKey points of the joint report agreed between the UK and EU include giving full and permanent legal rights to EU citizens who came to the UK under freedom of movement, to be enforced by the European Court of Justice for eight years after Brexit. \nThere will be no “hard border” between Northern Ireland and the Republic and if there is no trade deal then the UK will maintain “full alignment” with single market and customs union rules that “support North-South co-operation, the all-island economy” and the protection of the 1998 Good Friday peace agreement. \nMrs May is expected to deliver a statement to the Commons on Monday. Leaders of the remaining 27 EU states, meeting at a scheduled European Council summit, will consider the proposals on Thursday and Friday, and are expected to give the green light to move negotiations on to a trade deal. \nA final treaty on withdrawal and a transition agreement may be ready by October 2018. Brexit Secretary David Davis \nMrs May grabbed only “a couple of hours” of sleep as she raced against the clock to get agreement on the terms of Britain’s withdrawal from the EU on Thursday night, according to reports.. \nThe Prime Minister and close colleagues, including Brexit Secretary David Davis and chief of staff Gavin Barwell, worked late into the night, as the Number 10 staff Christmas party took place in the building around them. \nAfter the agreement was announced, she said: “Getting to this point has required give and take on both sides. \n“And I believe that the joint report being published is in the best interests of the whole of the UK. \n“I very much welcome the prospect of moving ahead to the next phase, to talk about trade and security and to discuss the positive and ambitious future relationship that is in all of our interests.” Like us on Facebook", "external_links": [], "published": "2017-12-08T18:09:00.000+02:00", "crawled": "2017-12-08T19:53:26.004+02:00", "highlightTitle": ""}