{"organizations": [], "uuid": "d84b38933c5ce6fe7e92cc39b4af6348239fbb90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article925245.ece/ALTERNATES/s1200/IMG_0650JPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/tributes-continue-come-much-loved-925236", "country": "GB", "title": "Tributes continue to come in for much loved Bideford man", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-14T14:08:00.000+02:00", "replies_count": 0, "uuid": "d84b38933c5ce6fe7e92cc39b4af6348239fbb90"}, "author": "Joe Bulmer", "url": "http://www.devonlive.com/news/devon-news/tributes-continue-come-much-loved-925236", "ord_in_thread": 0, "title": "Tributes continue to come in for much loved Bideford man", "locations": [], "entities": {"persons": [{"name": "andrew lock", "sentiment": "none"}, {"name": "andrew lock tributes", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "johnny", "sentiment": "none"}, {"name": "john taylor", "sentiment": "none"}, {"name": "cheryl wheeler", "sentiment": "none"}, {"name": "clayton", "sentiment": "none"}, {"name": "steven", "sentiment": "none"}, {"name": "mervyn fudge", "sentiment": "none"}, {"name": "bideford", "sentiment": "none"}, {"name": "andy", "sentiment": "none"}, {"name": "nikki gordon", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "lacey", "sentiment": "none"}], "locations": [{"name": "fremington", "sentiment": "none"}, {"name": "river torridge", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "johnnies bar", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "instow", "sentiment": "none"}, {"name": "bideford", "sentiment": "none"}, {"name": "the town", "sentiment": "none"}], "organizations": [{"name": "bideford", "sentiment": "none"}, {"name": "bideford man news tributes", "sentiment": "none"}, {"name": "bishops tawton", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Tributes continue to come in for much loved Bideford man Andrew Lock has been described by friends and family as “a very good friend”, the “life and soul of a party“ and “one of the kindest men they knew”. Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTributes to a much loved Bideford man known to friends as “Woo” continue to flood in after news of his death reaches friends and family. \nAndrew Lock has been described by friends and family as “a very good friend”, the “life and soul of a party“ and “one of the kindest men they knew”. \nAndy's body was found on mud flats at the edge of the River Torridge on Friday afternoon. Andy has been described by friends and family as “a very good friend”. Read More \nPolice and fire services were informed by the ambulance service at around 2.50pm and a cordon was put in place around the area. \nOn Friday police said they were treating the death as 'unexplained'. \nDevonLive.com was contacted this week by long time friend John Taylor, he had this to say about Andy: “I have known Andrew since the mid 80’s where we worked together on building the Tavern in The Town and what is now Clayton’s in Barnstaple. Andrew Lock Tributes to loving father who died on Devon mud flats \n“He lived at Fremington then with his friend Mervyn Fudge and his wife where he was affectionately known as “Woo”. \n“Andrew also worked at Bishops Tawton with me and then he assisted me with my son Steven in the building of The Tavern in the Port and Johnnies Bar (now known as Lacey’s) in Bideford. \n“He was in charge of maintenance at both places and also did shifts behind the bar, where he made many friends. A very practical person who could turn his hand to anything and a very good friend. We shall all miss him.” Andy's body was found on mud flats at the edge of the River Torridge on Friday afternoon. Read More \nTributes have been pouring in for Andy on social media from friends and loved ones who have described him as “one of the kindest men they knew” and say he will be “dearly missed”. \nNikki Gordon said Andy was “like her favourite uncle”. \nShe said: “We were next door neighbours when I lived in Instow and he was just the best friend my family could have had. Andy in Johnny's Bar in Bideford, now called Lacey's. Read More Council set to spend an extra £19.5m on adult social care, health and children’s services \n“He was like my favourite uncle! He was always there to lend a shoulder and could always rely on him to be the life and soul of a party. \n“‘Woo’ as we all knew him, would give the shirt off his back to help anyone and we were very lucky to have shared that time in our lives with him. Andy hard at work. Brexit rebel Sarah Wollaston hits back over 'self-consumed malcontent' headline \n“My family and I send all our love to Andy’s family and friends at this very difficult time.” \nCheryl Wheeler used to meet with Andy at the Heavitree Arms in Bideford and said they would always “have a good laugh”. Like us on Facebook ", "external_links": [], "published": "2017-12-14T14:08:00.000+02:00", "crawled": "2017-12-14T15:06:09.000+02:00", "highlightTitle": ""}