{"organizations": [], "uuid": "8ac792616bcbdc07cf282242daa05a80fba1ece5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article922710.ece/ALTERNATES/s1200/Untitled-design-80.png", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/news-opinion/racism-gets-you-kicked-out-922729", "country": "GB", "title": "So racism gets you kicked out of the Jungle.... but not the Conservative Party", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-13T18:51:00.000+02:00", "replies_count": 0, "uuid": "8ac792616bcbdc07cf282242daa05a80fba1ece5"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/news-opinion/racism-gets-you-kicked-out-922729", "ord_in_thread": 0, "title": "So racism gets you kicked out of the Jungle.... but not the Conservative Party", "locations": [], "entities": {"persons": [{"name": "anne mar", "sentiment": "none"}, {"name": "hemsworth", "sentiment": "none"}, {"name": "james forsyth", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "jon trickett", "sentiment": "none"}, {"name": "jack maynard", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "anne marie", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "conservative party news", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "nasty party", "sentiment": "none"}, {"name": "tory party", "sentiment": "none"}, {"name": "axe valley academy", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "devon conservative", "sentiment": "none"}, {"name": "party", "sentiment": "none"}, {"name": "brixham express", "sentiment": "none"}, {"name": "conservative hq", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "shadow cabinet office", "sentiment": "none"}, {"name": "conservative association", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion So racism gets you kicked out of the Jungle.... but not the Conservative Party Anne Marie Morris has had the Tory whip restored - but in what other walk of life would you get a second chance after using racist language Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIt was the news that everyone had been waiting for – almost since she was suspended in the first place - Anne Marie Morris has had the Conservative Whip restored. \nThe Newton Abbot MP had the whip taken away from her when she described the UK leaving the EU without a deal as a “real n r in the woodpile” at the launch of a report into the future for the UK’s financial sector after Brexit. \nSince then, she has remained an MP and serving the constituents of Newton Abbot to the best of her ability. Read More \nHer constituents voted her back into office in June with 55 per cent of the vote and an eight per cent vote increase, although there are those who question what she has actually achieved. Anne Marie Morris MP \nEver since she was suspended from the whip, she has though remained a Tory in all but name. She has voted in line with her Tory colleagues in every single vote in the current parliament, she has appeared at Conservative Party fundraising events, and was still listed as being a Conservative MP on the local Conservative Association website. \nAnd it felt as if ever since the suspension was announced, the party were just waiting for the right time to bring her back into the fold – and it would have been earlier had the Chief Whip had not unexpectedly been made the new Defence Secretary. Read More Devon Conservative MP Anne Marie Morris has whip restored after 'n r in the woodpile' comment \nWhen questioned at the Conservative Party conference, Prime Minister Theresa May refused to answer the question as to when she would be brought back into the fold and she reiterated that the Newton Abbot MP was 'suspended' from the Party when asked if she could return – clearly paving the way for her to come back when they could find a way. \nShe also said: “We have suspended her because what she said was wrong and it was inappropriate for her to say what she said. I was concerned when I heard about the remarks which is why I took the action I did.” Read More Racist brothers asked taxi driver to show his passport and told him to go back to his own country after he refused them \nBut the feeling has always been that if the PM was that concerned about the remarks that Anne Marie made in public (and also by the lack of reaction from her fellow MPs who heard the remark), then there would have been no way back for her into the fold – and especially not as quickly as it has been. \nIn any other walk of life, had she made the remarks that she did, regardless of whether or not you actually think she holds racist views or not, she would have been out in the cold forever. \nIf a journalist was tweet out or use racist language in any story they wrote, it would be the last story that they ever wrote. Read More \nJack Maynard was kicked out of the Jungle and sent home from I’m a Celebrity… Get Me Out Of Here when it emerged that in his youth he had made some racist and homophobic tweets. Jack Maynard (Image: ITV) \nAnd the news of Anne Marie Morris’ return to the Tory Party hasn’t quite been met with the positive reaction they might have been hoping for. \nThey may have expected the reaction of Shadow Cabinet Office minister Jon Trickett, who is the MP for Hemsworth, who said: \"It's a disgrace that the so-called 'caring' Conservatives have welcomed back Anne Marie Morris, who made an appallingly racist comment. \n\"It appears the prime minister is so weak and desperate to avoid a Parliamentary Brexit defeat she is prepared to forgive and forget racism. \n\"Theresa May once branded the Conservatives the 'nasty party' and it is clear nothing has changed.\" \nBut when right-wing columnists like James Forsyth of the Spectator are saying it is a mistake, questions might be being asked of the decision. Read More MP hopes solution can be found to save Axe Valley Academy sixth form \nHe said: “This decision is a mistake. Restoring the whip to Morris less than six months after it was taken away from her suggests that the Tories are not taking this incident as seriously as they should. This is the wrong call both politically and morally. Morally, this kind of casual use of racist language is deplorable bad manners. \n“Politically, it is foolish because it makes the party look tolerant of racist language at a time when the progress it made with ethnic minority voters under David Cameron is being reversed.” \nA quick search of Twitter takes a long timing searching to find someone who thinks they have made the right decision. \nAnd no official reason has been given by the Conservative Party for her having the party whip restored – the news was announced in an email that her office sent to DevonLive.com with her monthly column for the website rather than in an official statement from Conservative HQ, who have remained silent so far on the matter. Read More Revealed: The total amount of taxpayers' money given to Brixham Express for now-defunct ferry service \nApologising for her actions, Ms Morris said: “ I would like to take this opportunity to apologise again for using such inappropriate and offensive language. The whip has been returned to me today. I feel proud and privileged to be a Conservative Member of Parliament and I will continue to serve my community and my country to the best of my ability.” \nHer comments suggest that she knows what she said was wrong, inappropriate and offensive. It has been made clear to her that her comment was \"completely unacceptable\" and has been reminded that both she and all MPs have to uphold the highest standards. \nAnd the people of Newton Abbot obviously think highly of her judging by the results of the snap General Election in June. \nBut the message from the Conservative Party bringing her back so soon just gives rise to those who think that they are still the ‘Nasty Party’ – and cynics would say the timing, right before a critical vote on Brexit in Parliament – and raises questions as to what do you need to do to be kicked out of the Party. Read More \nIf using racist language in your youth is enough to kicked out of a reality TV show, then what does say about the Conservative Party that they won’t kick out an MP for the same? Like us on Facebook ", "external_links": [], "published": "2017-12-13T18:51:00.000+02:00", "crawled": "2017-12-13T19:17:33.005+02:00", "highlightTitle": ""}