{"organizations": [], "uuid": "2ba1d1928a5fe2ceb9663f0feba5f8c2cd21e35d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13792761.ece/ALTERNATES/s1200/BELGIUM_EU_115488.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14005238", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Brexit talks finally make 'sufficient progress' as May and Juncker do deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-08T10:20:00.000+02:00", "replies_count": 0, "uuid": "2ba1d1928a5fe2ceb9663f0feba5f8c2cd21e35d"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14005238", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Brexit talks finally make 'sufficient progress' as May and Juncker do deal", "locations": [], "entities": {"persons": [{"name": "juncker", "sentiment": "negative"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "arlene foster", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "mrs foster", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "irish sea", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Cultural venues receive major funding for new training \nA new training programme is being rolled out to upskill people working in cultural venues across Newcastle and Gateshead. \nThe Go>Grow programme will provide training to more than 100 people working in front-of-house and other customer service roles at Newcastle Gateshead Cultural Venues (NGCV). The NGCV is a partnership of 10 organisations operating 20 venues across Tyneside. \nThe training has been made available after Gateshead College secured £15m of funding from the European Social Fund through the Education and Skills Funding Agency (ESFA). \nIvan Jepson, director of business development at Gateshead College said: \nGo>Grow is a fully funded programme that will see us working together with other training providers to meet the skills needs of many of the region’s businesses. \nThis will contribute to the economic prosperity of the North East, benefitting local employees and organisations like Sage who need upskilled and confident workforces. \nIan Burke head of HR for Sage Gateshead, added: \nThis funded training is helping our employees to increase their management and leadership skills, better understand customer needs as well as increase their skills, boost their confidence, help them to progress their careers in the cultural sector. Ian Burke and staff from Sage Gateshead, who are benefitting from free skills training programme, Go>Grow 9:13 Jonathon Manning Berkeley profits rise in first half but group cautious over future \nBerkeley has seen interim profits leap as the housebuilder upgraded its long-term forecast off the back of strong demand in the South East, but the firm also warned over political uncertainty hanging over the property market.The company posted a 36% rise in pre-tax profits to £533.3m in the six months to October 31, while revenue grew 14% to £1.6bn.Berkeley sold 2,117 homes in the period, up marginally from last year but at a much higher average selling price of £719,000, compared with £655,000.The company said its pre-tax profit guidance has now been upgraded to £3.3bn from £3bn.However, Berkeley added that the 2017/18 full-year results will represent a “peak”, before going back to more normal returns in 2018/19.The firm also warned over the future, with Boss Rob Perrins saying: \nThere remains good underlying demand for property in London and the South East, but the combination of uncertain UK economic and political outlook and high property taxation continues to mean customers are more circumspect and inevitably purchasing later in the development cycle. \nBrexit uncertainty and concerns over growth and inflation, coupled with the changes to SDLT (stamp duty land tax) and mortgage interest deductibility, continue to impact the market. \nBerkeley flagged the high levels of tax involved in buying a property, and welcomed the Government’s recent move to scrap stamp duty for first-time buyers on the first £300,000 of properties worth up to £500,000.There have been contrasting views among builders on the housing sector in recent weeks, although most agree there is a clear slowdown in London - Berkeley’s main market.The group put this down to prior changes to stamp duty, adding: \nOther changes to SDLT and mortgage interest deductibility in recent years remain a constraint on transaction levels and social mobility. \nThis is felt most keenly in London, where all housing transactions are down 18% since last year and new starts remain more than 30% down on 2015. Builders on a building site (Image: PA) 9:08 What is the National Living Wage? 9:05 KEY EVENT North East firms among those 'named and shamed' for not paying the minimum wage \nNine North East firms are among a long list of companies which have been ‘named and shamed’ for failing to pay their staff the National Minimum and Living Wage . \nThe businesses are on the latest list published by the Department for Business, Energy and Industrial Strategy, highlighting 260 UK businesses who have been ordered to hand over £1.7m in back pay to staff members – on top of fines totalling £1.9m. \nRetail, hairdressing and hospitality businesses were among the most prolific offenders with common reasons for errors made include failing to pay workers travelling between jobs, deducting money from pay for uniforms and not paying for overtime. \nThe list, which is published twice a year, includes retail giants Primark and Newcastle United owner Mike Ashley’s business Sports Direct. \nPrimark Stores Limited, headquartered in Reading failed to pay 9,735 of its workers £231,973.12, while Sports Direct is named and shamed for not paying 383 workers a collective £167,036.24. \nBusiness Minister Margot James said: \nThere is no excuse for not paying staff the wages they’re entitled to and the government will come down hard on businesses that break the rules. \nThe nine North East businesses are: Ramside Estates Limited, County Durham DH1, failed to pay £17,536.59 to 8 workers. Headlam Leisure Limited trading as Headlam Hall Hotel, County Durham DL2, failed to pay £9,157.42 to 8 workers. Sabai Hairdressing Ltd., Newcastle upon Tyne NE1, failed to pay £8,144.38 to 6 workers. Cuba Lily (North East) Limited, County Durham DH1, failed to pay £7,917.09 to 26 workers. Cornhill Carriage Company, Northumberland TD12, failed to pay £4,974.26 to 1 worker. Hughes & Daughters Care Ltd trading as Blue Ribbon Community Care Tyne and Wear, Sunderland SR2, failed to pay £2,789.06 to 22 workers. Mrs Andrea McKie trading as Angels Assisted Living Services, Northumberland NE42, failed to pay £772.45 to 1 worker. Inspired Care Limited, Newcastle upon Tyne NE15, failed to pay £220.00 to 1 worker. TAAE Management Ltd trading as Bluebird Care Sunderland, Sunderland SR1, failed to pay £131.42 to 1 worker. \nAll the businesses were contacted for comment. Read there replies here . Margot James, Minister for Small Business (Image: Handout) 9:00 Jonathon Manning British Airways to close final salary pension scheme \nBritish Airways is to close its final salary pension scheme and replace it with a new one next year.The current defined benefit scheme, which has 17,000 members, was £2.8bn in deficit at its last valuation in 2015.The airline’s defined contribution pension scheme, which has about 20,000 members, will also be replaced.The plans were first announced in September, since when there has been consultation with unions.International Airlines Group, which owns BA, said it would launch a flexible benefits scheme incorporating a new defined contribution pension scheme.A statement said: \nThe scheme will open on April 1, 2018 replacing the main UK defined benefit scheme, the New Airways Pension Scheme (NAPS), and the main UK defined contribution scheme, the British Airways Retirement Plan (BARP). \nThe changes are subject to NAPS trustees agreeing to amend the scheme’s rules to enable closure to future accrual. \nThe new scheme will offer market-competitive arrangements with a choice of contribution rates and the ability to opt for cash instead of a pension. \nActive NAPS members will also be offered a choice of transition arrangements including a cash lump sum, additional company pension contributions or additional pension benefits in NAPS prior to its closure. \nThe overall financial impact on British Airways will depend, in part, on the transition arrangements members select. A British Airways plane (Image: Newcastle Journal) 8:55 Jonathon Manning Newcastle's Bede Gaming moves into South Africa with multimillion-pound deal \nNewcastle games studio Bede Gaming has struck a multimillion-pound deal that will see it enter the South African market for the first time. \nThe landmark deal was made between Bede, based at Great Park in Gosforth, and Sun International, which operates hotels, casinos and online gambling sites. \nUnder the new agreement the firm has become Sun International’s preferred online gaming technology partner, and will provide sports betting to customers exclusively in South Africa. \nSun International plans to use the licensed platform to support its digital growth ambitions in the market, including its leading Sunbet brand. \nMichael Brady, chief executive officer of Bede Gaming, said: \nTo enter the South African market with such a respected name as Sun International really underlines our commitment to grow Bede’s footprint in global regulated markets. \nWe have been selected by Sun International because we offer a flexible platform and lightning fast integrations that have proven successful in multiple jurisdictions. \nOperators are demanding greater speed and flexibility, which is something we are able to deliver. \nWe look forward to building a long and mutually beneficial relationship with Sun International, and will continue to build upon our market-leading offer. \nBede’s technology is designed to allow operators to grow quickly in the digital market. The software can be integrated rapidly and allows operators to choose from an extensive choice of suppliers. Dan Smith of Bede Gaming (Image: newcastle chronicle) 8:52 ", "external_links": [], "published": "2017-12-08T10:20:00.000+02:00", "crawled": "2017-12-08T10:34:04.005+02:00", "highlightTitle": ""}