{"organizations": [], "uuid": "56848570a407f4bfd6aa5c3916f2e28379cb32db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.gazettelive.co.uk/incoming/article14056117.ece/ALTERNATES/s1200/Glass-Slipper-Award-launch.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/special-features/tis-season-be-busy-top-14056090", "country": "GB", "domain_rank": 21960, "title": "T'is the season to be... busy: Top New Year's resolutions for business success", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-19T16:40:00.000+02:00", "replies_count": 0, "uuid": "56848570a407f4bfd6aa5c3916f2e28379cb32db"}, "author": "Adam Gray", "url": "http://www.chroniclelive.co.uk/special-features/tis-season-be-busy-top-14056090", "ord_in_thread": 0, "title": "T'is the season to be... busy: Top New Year's resolutions for business success", "locations": [], "entities": {"persons": [{"name": "alison hall", "sentiment": "neutral"}], "locations": [], "organizations": [{"name": "newcastle chronicle", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Alison Hall, partner at Hay & Kilner Law Firm (Image: Newcastle Chronicle) Share Get daily   \nAs we prepare ourselves for Christmas and the New Year, I hope you have received your Basic Payment and you’re ready for the festive season. \nThere has been plenty to do in the legal world and my farming clients have been inundated with preparations for winter. \nI am not one for New Year’s resolutions but with 2018 nearly upon us I find myself considering what activities might make the list of things to do next year. \nHere are a few suggestions that might make your list for 2018: 1) Business plan \nWhether it is evaluating your financial structure, investing in marketing, ensuring you’re up to date with recent compliance rules or considering succession planning, updating or starting a business plan should be one of your resolutions. 2) Formalise your business structure \nI am sure many of you have been faced by a solicitor, who looks on in horror, as you explain the informal business arrangement with family. \nThere is reason behind the concern – most agricultural solicitors have seen the problems for a farm which can be caused by arguments, retirements, divorces and changes in family circumstances. \nWhether you choose to formalise a family partnership, review your articles of association or change your business structure entirely, formalising any arrangement should certainly make the list for 2018. 3) Review your property portfolio \nIf you’re renting properties review your tenancy agreements and make sure you have the right agreement in place to protect you. \nThe new year is also a good time to consider the condition of properties, ensure the structure is sound and that fire alarms and carbon monoxide detectors are checked. \nThe review of agreements does not end with tenancies, if you rent land or benefit from informal grazing agreements, it might be time to formalise those arrangements. 4) Look after your staff \nDo your employees have employment contracts and are these up to date? \nAre you up to speed with minimum rates of pay, paid holiday requirements and minimum break requirements? \nThe New Year is not just a time to review those contracts but it is also a good time to communicate with staff and ensure the smooth operation of your work force. 5) Fight your corner \nAs the UK prepares to leave the European Union, it is an important time for the agricultural community in terms of future trade agreements, regulations, staff recruitment and financial support/incentives. \nWhatever your views on Brexit, 2018 is a time to express those views and be part of shaping the UK’s future farming industry. \nWhatever you do decide to do with 2018, at least these jobs can wait until the new year so I will take this opportunity to wish you a very Merry Christmas. \nIf you would like further information about any of the above, please contact Alison Hall on 0191 232 8345 or email alison.hall@hay-kilner.co.uk Like us on Facebook", "external_links": [], "published": "2017-12-19T16:40:00.000+02:00", "crawled": "2017-12-19T17:04:36.005+02:00", "highlightTitle": ""}