{"organizations": [], "uuid": "5787fa3e9df3eea43748ea73589d1b10fc22d8fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article7133776.ece/ALTERNATES/s1200/JS32950460.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14070787", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Betting giant Ladbrokes Coral to be acquired in £4bn deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-22T10:10:00.000+02:00", "replies_count": 0, "uuid": "5787fa3e9df3eea43748ea73589d1b10fc22d8fa"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14070787", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Betting giant Ladbrokes Coral to be acquired in £4bn deal", "locations": [], "entities": {"persons": [{"name": "barbour", "sentiment": "negative"}, {"name": "j barbour", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}], "organizations": [{"name": "ladbrokes coral", "sentiment": "negative"}, {"name": "barbour international", "sentiment": "none"}, {"name": "sons ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford County Durham climbing centre to bring in new attractions after £350,000 investment \nA £350,000 investment has given a County Durham climbing facility a major lift and created a raft of jobs . \nROF 59 activity centre on Aycliffe Business Park, which is owned by local businessman John Finley, has spent the cash to re-launch its climbing area with five new elements. \nEntre-Prises, based in Lancashire, has been enlisted to install the new climbing facilities, for people of all abilities, with help of local climbing consultant Nick Pilling from Mountain Activity Company (MAC). \nAnd the four-month programme has created two new full-time and 10 part-time roles at ROF 59 after the closure of Rock Antics earlier this year. \nAdventure walls, speed climbing walls, a tower climbing area, mosaic climbing walls and bouldering are all now available at ROF 59, with courses and party bookings available next month. Finley Leisure managing director John Finley with ROF 59 lead climbing instructor Matthew Breadin (left) and consultant Nick Pilling (Image: ROF 59) 9.20 KEY EVENT Jeremie fund is set to go live.... \nA vital North East jobs fund with the potential to support 600 firms and create 3,500 jobs is back on track after stalling following the Brexit vote. \nThe release of the £120m North East Fund – also known as Jeremie – had been put on pause as the financial organisations involved in the scheme waited for movement on Brexit talks. \nBut following the recent breakthrough in talks, it has now been announced that the fund is hoped to go live early in the new year. \nThe fund will offer a range of equity investments and loans to firms, to drive growth and job creation in the North East Local Enterprise Partnership (LEP) area. \nThe final piece of the funding jigsaw was agreed in principle this week by the European Investment Bank’s (EIB) top level Management Committee, after several months of intensive negotiations which came after the triggering of Article 50 in March. \nThe North East LEP led the project team negotiating for the region, saying that the loan represented a significant vote of confidence in the North East. \nBusiness organisations in the region have welcomed the news. European Council President Donald Tusk arrives for an EU summit at the Europa building in Brussels (Image: AP) 9.13 Coreena Ford Bitcoin plunges as rally runs out of steam \nBitcoin has gone into freefall this morning, its price collapsing from the dizzying heights of nearly $20,000 earlier this week to around $13,000 as steam appeared to be running out of its year-end rally. \nAccording to Coindesk, the cryptocurrency was trading at 13,155 US dollars, a fall of over 30% in five days. \nIts price has fallen by over 2,000 US dollars in the space of 12 hours. It comes after a troubled week for Bitcoin, in which a cryptocurrency exchange went bust in South Korea following a cyber attack, knocking its price. \nCoinbase, another exchange based in the US, also said it was opening an investigation into sharp price increases. \nNeil Wilson, senior market analyst at ETX Capital, said: “Has the bubble finally popped? It’s hard to see the bell tolling just yet.” Bitcoin logo (Image: PA Photo/Screengrab) 9.09 Coreena Ford Newcastle firm says it will to pay customers hundreds - for turning off their kettle \nA Newcastle tech firm is planning to pay people up to £600 a yea r simply by cutting down on their electricity usage. \nStart-up company Equiwatt has developed a ‘smart plug’ device that will switch off household appliances for a few minutes, relieving pressure on the National Grid. \nDuring peak periods of electricity consumption, the National Grid is forced to activate expensive standby power plants to meet the nation’s needs. To avoid having to do this, energy providers offer cash incentives to people who reduce their power usage between 6pm and 9pm. \nEquiwatt combines a smart plug with its own artificial intelligence software to automatically switch off its customers’ household devices, allowing them to earn cash. \nThe company was founded by entrepreneur Johnson Fernandes and Ravneed Kaur, who came up with the idea while studying post graduate degrees at Newcastle University. Equiwatt's Powercapsule (Image: Unknown) Coreena Ford Supermarkets braced for biggest ever trading day \nSupermarkets are braced for one of their biggest ever trading days as consumers do their “big shop” ahead of the festive long weekend. \nSainsbury’s expects today to be the best trading day in its history, with customers predicted to spend more than £160m in store and online on their last major shop before Christmas Day. \nWaitrose has predicted 11am to 12 noon to be the busiest hour of the festive season at its tills. \nA vehicle has been leaving a Waitrose distribution centre every 90 seconds during the week before Christmas and the grocer has recruited 5,000 temporary staff to help over the period, while Sainsbury’s will be delivering an online grocery order every second throughout the day on Friday between 7am and 11pm. Tesco expects to serve 15,000 customers every minute and is braced for more than 20 million people to shop in its stores over Friday and Saturday. \nTesco branches are stocked to sell 200,000 turkey crowns and birds today alone, a total of 27 million Christmas carrots and 60 million British Brussels sprouts. \nKantar Worldpanel estimates UK shoppers will spend a record £4.2bn on food and drink during this last week before Christmas, with today seeing the biggest single day of sales. Nine in 10 shoppers in England now use their own carrier bags following the 5p Government levy introduced a year ago, according to a study (Image: Chris Radburn/PA Wire) 8.45 KEY EVENT Who's going to be the business editor's Businessman of the Year? A man who knows the true spirit of Christmas \nIt’s very much awards season at the moment - so boss Graeme Whitfield has come up with his own. \nThe 2017 Businessman of the Year, a prize he invented for the purposes of journalism, and it’s a toy shop boss who knows the meaning of Christmas who gets the glory this year. \nGraeme said: \nA late contender for my 2017 Businessman of the Year Award - a prize that I made up 10 or 11 seconds before I started writing this column - has come in the form of Gary Grant, founder of toy shop chain, The Entertainer. \nMr Grant is a committed Christian so never opens any of his stores on a Sunday. And even though that means not opening on Christmas Eve this year, Mr Grant is forgoing the profits he can make on the busiest shopping day of the year to stick to his principles. \n“Staff may well be working six days a week, and long days,” he said. “They need a break.” \nRead the rest of his column here . Santa fun run which took place on the Quayside, Newcastle 8.38 Coreena Ford Warning to last-minute toy shoppers - avoid fakes \nLast-minute Christmas shoppers have been warned to avoid fake and potentially dangerous toys as rogue traders exploit demand for sold-out “must-have” gifts. \nThe Local Government Association (LGA) is also urging shoppers to be wary of turning to “suspect” online sellers offering next-day delivery on toys that are out of stock elsewhere, warning that they may not actually exist. Councils have seized thousands of counterfeit and dangerous toys in the run-up to Christmas, including many which", "external_links": [], "published": "2017-12-22T10:10:00.000+02:00", "crawled": "2017-12-22T10:23:26.011+02:00", "highlightTitle": ""}