{"organizations": [], "uuid": "9a065e243b1f10c962d1d003e3ea0fa37768abc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article947903.ece/ALTERNATES/s1200/Rare_SeaOfThieves_Screenshot.png", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/business/computer-games-company-rare-gears-947376", "country": "GB", "domain_rank": 48128, "title": "Computer games company Rare gears up for spring release of new blockbuster Sea of Thieves", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-20T02:01:00.000+02:00", "replies_count": 0, "uuid": "9a065e243b1f10c962d1d003e3ea0fa37768abc9"}, "author": "leicestermercury", "url": "http://www.leicestermercury.co.uk/news/business/computer-games-company-rare-gears-947376", "ord_in_thread": 0, "title": "Computer games company Rare gears up for spring release of new blockbuster Sea of Thieves", "locations": [], "entities": {"persons": [{"name": "chris stamper", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}], "locations": [{"name": "twycross", "sentiment": "none"}, {"name": "donkey kong country", "sentiment": "none"}, {"name": "west leicestershire", "sentiment": "none"}, {"name": "battletoads", "sentiment": "none"}], "organizations": [{"name": "thieves news computer", "sentiment": "negative"}, {"name": "nintendo", "sentiment": "none"}, {"name": "wizards", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Computer games company Rare gears up for spring release of new blockbuster Sea of Thieves Over the years Rare has produced games such as Wizards and Warriors, GoldenEye 007, Donkey Kong Country and Battletoads Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFor the past 32 years computer games compa ny Rare has been developing some of the world’s most popular games from its headquarters in the west Leicestershire village of Twycross. \nIts latest is Sea of Thieves, a multi-player adventure allowing players to team up with friends in an online world of quests, treasure and adventure. \nAnd the 180-strong team at Rare is all hands on deck to bring Sea of Thieves to market in the New Year. \nRare was founded by brothers Tim and Chris Stamper in 1985, initially to focus on the fast-growing console market. \nIn its early years, Rare was producing games for Nintendo, and created many successful titles including Wizards and Warriors, GoldenEye 007, Donkey Kong Country, Battletoads and Perfect Dark. \nThe company soon gained international recognition and critical acclaim. \nAfter an eight-year partnership with Nintendo the company partnered with Microsoft and has been a wholly-owned subsidiary of Microsoft Corporation since 2002. \nSo why does this globally established company and leader in its field choose to have its international base in the village of Twycross, in a parish that is populated with just 800 people (and a zoo)? \nRare’s studio services director Jim Horth said: \"From the time the Stamper brothers first founded Rare it has been based in the vicinity of Twycross village. \n\"The calmness and natural beauty that the location brings is a deep part of our identity and culture. \n\"That said, I always chuckle to see international media refer to us as ‘Twycross-based’ when many might struggle to find it on a map!\" \nRare’s presence is certainly bringing some exceptional skills to this corner of Leicestershire, with some of the gaming sector’s leading software engineers, digital engineers and design and creative brains working in Rare’s Watery Lane studios. \nThe company works with schools and academia to attract and develop necessary skills. Jim Horth: \"I always chuckle to see international media refer to us as ‘Twycross-based’ when many might struggle to find it on a map!\" \nJim said: \"We rely on a diversity of skills: technical, artistic, design and process. \n\"But we also rely on strong ‘sideways senses’, innovation and the initiative to pull them together effectively. \n\"We do hire in proven experience from inside and outside our direct sector, but we don’t believe that the market will necessarily supply the set of skills we will need on tap so that we can instantly apply them. \n\"As a result, we engage with education and skills developers at many levels, starting with STEM (science, technology, engineering and mathematics) and outreach activity, involvement in further education and higher education course steering, and actively hiring early with internships, apprenticeships and graduate intake to grow the right skills.” \nThose skills combine with a company culture to differentiate Rare from the competition, and this is something which Microsoft, despite being a global giant, has encouraged. Jim said: \"Rare is a company with very British sensibilities, which include a certain sense of humour, but as part of Microsoft we look to serve a global audience. \n\"The ‘first-party’ relationship means that we have a licence to differentiate and innovate in proving out the value of Microsoft platforms, growing the player base and having a hand in shaping where the industry is going. \n\"For us, gaming isn’t just about rinse and repeat. UK gamers are no different to other gamers in that they want high quality entertainment, memorably novel experiences and richer and more meaningful social interactions through gaming. \n\"We look to build the worlds where this can happen.\" \nThe UK gaming sector is in a healthy state, and Jim sees that continuing. He also doesn’t regard Brexit as a particular threat. \n\"The UK’s core game sector strengths are in the generation and production side of game development,\" said Jim. \n\"As a result there is a lot of international focus on publishers and platform owners securing content or even acquitting UK-grown teams, and that’s a great story. \n\"With little clarity on what Brexit means at this stage it’s hard to foresee the impact of Brexit on the sector. \n\"As part of a global company serving a global audience, the balance of UK/Europe trade isn’t a critical factor for us in the same way it would be for an import/export business. \n\"Our ability to attract, retain and grow the best talent and do what we do in globally competitive terms is an important factor. \n\"Whatever Brexit brings we hope that ensuring the UK is an attractive place to live, work and do business in is kept at the forefront.\" \nHowever, he believes that Government could make life easier for the sector by recognising its technological value to the country. \nJim said: \"On a national level, many of the gaming sector’s needs are held in common with other sectors – physical and digital infrastructure and cyber-resilience, skills, supportive business environment, and supportive regulatory and tax environment. \n\"But I’d love to see more forthright championing of the sector as exemplifying the new generation of UK industry – flexible, highly-skilled companies combining knowledge and creative sector strengths to create intellectual property with global reach and value. \n\"This is clearly a national story – there are very few barriers to the knowledge and creative sectors being a strength right across the UK.\" The Rare team \nJim’s background is in mathematics and teaching. He joined Rare 15 years ago as a software engineer. \nHe said: \"It was my first job in gaming, and after three life-changing years in teaching I saw video games in general and Rare in particular as the best fit between my training as a mathematician and coder, my passion for the medium, and my wish to be part of something with a creative, cultural output. \n\"Currently I’m the person in the business responsible for figuring out how we adapt to a continuous always-on business cycle, establishing functions from player support, business intelligence, online engineering and live incident response for when things don’t go smoothly. \n\"It’s no longer enough just to put some good content on a disc and move on to the next thing. \n\"We’ve got to continually monitor, change and adapt our products, deal with live customer sentiment and balance what we think is right with what our audience demands. \n\"And we’re doing that with a global audience who don’t sleep when we do.\" Console classic Kinect Sports was created by Rare, of Twycross \nFor Rare it’s obviously working. The business has a trophy cabinet full of awards, including two Baftas for its multi-million-selling Kinect Sports series. \nMeanwhile, the team has high hopes for Sea of Thieves which is already getting an enthusiastic response from insiders and early fans. \nIf it matches expectations, there’ll be plenty of celebrating in sleepy Twycross. Like us on Facebook ", "external_links": [], "published": "2017-12-20T02:01:00.000+02:00", "crawled": "2017-12-20T02:32:37.008+02:00", "highlightTitle": ""}