{"organizations": [], "uuid": "7241fdafbdf17455b690aec8c82c0c43ee2dea5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13942883.ece/ALTERNATES/s1200/Inside-Sports-Direct.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14034740", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Mike Ashley's Sports Direct sees profits plunge 67%", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-14T10:00:00.000+02:00", "replies_count": 0, "uuid": "7241fdafbdf17455b690aec8c82c0c43ee2dea5a"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14034740", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Mike Ashley's Sports Direct sees profits plunge 67%", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Capita shares sink on 'challenging' markets warning \nOutsourcing giant Capita saw shares tumble after warning that trading conditions remain “challenging” as it faces a number of headwinds in both private and public sector markets.Shares in the group plunged 14% as it said the market for major business process management contacts remains “subdued”, particularly in the public sector, while it also flagged potential problems in its private sector partnerships division.Capita still expects underlying profits to rise “modestly” in the second half of 2017, but it cautioned over a raft of one-charges, as well as restructuring costs under an overhaul.New chief executive Jonathan Lewis - who started on December 1 - will press on with the turnaround plans at pace in 2018, with the group saying it will give more details next year on aims to “broaden the transformation of Capita”.It added: \nThis will include plans to focus the business and allocation of capital and resources on the markets which offer the best growth prospects; improve our cost competitiveness further; recharge our sales performance and, ultimately, demonstrate how we deliver value to all of our employees, customers and shareholders. Capita have an office at Lingfield Point in Darlington 9:00 Jonathon Manning Mediaworks shortlisted for three awards \nNorth East marketing agency Mediaworks is celebrating after being shortlisted for three categories at the Northern Digital Awards. \nThe company has been nominated for Best Digital Marketing Campaign (Finance) for its work with Newcastle’s True Potential, as well as the award for Best App after it worked with Wild in Art to create the Great North Snowdogs trail app. \nMediaworks has also been shortlisted for Large Digital Agency of the Year. \nManaging director, Brett Jacobson, said: \nWith the competition increasing year on year, these nominations are a testament to the whole team. \nWe’ve always been proud of our North East roots, so it’s fantastic to be recognised as one of the leading digital agencies in the North. We wish all those shortlisted the very best of luck. Mediaworks’ managing director, Brett Jacobson 8:53 KEY EVENT Customers in the dark and jobs in doubt at Northumberland furnishers Dickinsons \nAdministrators are to be appointed at Northumberland furniture group Dickinsons, raising questions over around 80 jobs and leaving a number of customers in the dark over their orders. \nThe Northumberland firm’s stores in Hexham, Carlisle and Alnwick closed their doors earlier this week but it had been hoped that an online presence and an interior design shop in Newcastle, would survive. \nBut now administrators at RSM accountants in Newcastle have been brought in, with a number of customers currently left without orders. \nDickinsons had announced in September that it was closing its three stores, with managing director John Spreadbury blaming a decline in the retail sector. \nMr Spreadbury and partner Steve Traviss have set up a separate company to supply national building chains and other commercial properties, and say that administrators will be contacting customers over the fate of unfulfilled orders. \nA statement from Mr Spreadbury and Mr Traviss said: \nThe remaining stock which is held in the warehouse is now being managed by the administrators, who we believe will be contacting customers directly to discuss what options they may have to either collect stock or to obtain refunds from their credit card merchants. \nThe administrators are RSM in Newcastle, who will be dealing with any remaining claims and stock.“The original plan was that the retail stores would successfully complete the delivery and installation of all of their orders by the end of December, but they have unfortunately been unable to do this as the level of sales was adversely affected by the lack of confidence being evidenced in the High Street generally. Unfortunately there have been a number of other high profile business failures in the sector over the last few weeks. \nThe contracting company continues to operate successfully from its Prudhoe premises, and includes supplying most of the national builders along with hotels, clubs and commercial premises. \nThere is a new holding company formed to more accurately reflect the activities of the contract and commercial divisions, called Inside Contracts. This will give the company the opportunity to re-brand in due course so that it does not become confused with the retail division. Dickinsons in Hexham is one of three posed to close as the business leaders seek to take the group in a new direction (Image: -Newcastle Journal) 8:48 Jonathon Manning Dixons Carphone signals store closures after profits collapse \nDixons Carphone has seen half year profits collapse after a difficult mobile phone market hammered the retailer, with the group warning over potential store closures.Headline pre-tax profit for the 26 weeks to October 28 tumbled 60% to £61m, while total sales nudged up 3% to £4.87bn.The high street chain was dragged down by a 3% fall in comparable sales at its troubled mobile phone division as it pledged to reposition the arm to deliver a “simpler, less capital-intensive business”.Speaking to analysts, chief executive Seb James said: \nWe have a high cost base and we need to address that, and we always look at our store estate. \nShares rose over 4% to 174.2p in morning trading following the update.Neil Wilson, senior market analyst at ETX Capital, said: \nFor simpler and less capital intensive, read store closures. \nWith over 700 Carphone stores in a total estate in excess of 1,000 across the group, there is ample opportunity to rationalise the Carphone estate and improve profitability in mobile while still retaining a dominant market position. \nUK profit fell from £130m to £34m in the period and the results come after Dixons Carphone warned in August over a Brexit profit hit as the soaring cost of new mobile phones means people are holding on to older models for longer.The electricals giant has said the pound’s collapse following the country’s decision to quit the European Union has meant an increase in shop prices for mobile devices and bemoaned “challenging conditions”.Mr James added: \nAs we said in August, the UK post-pay mobile phone market is tougher, with a combination of higher handset costs and relatively incremental technology growth continuing to cause customers to hold on to their handsets for longer and some to choose a SIM-only contract in the meantime. \nIn addition, the later launch of the iPhone X pushed some sales into the second half of our financial year. \nThroughout the period, we made a very conscious decision to fight hard to drive sales in our product offering, and this has impacted mobile profitability. Dixons Carphone Plc (Image: PA) 8:43 Jonathon Manning New lodges and bridge to be built at Northumberland leisure park \nA Northumberland holiday park is to get a new set of lodges and a bridge over a local river as part of a £500,000 upgrade. \nRiverside Leisure Park in Wooler, Northumberland, is to get seven new lodges, plus 31 new caravan pitches after the investment by owners Verdant Leisure. \nThe scheme will also see a new pedestrian bridge built over Wooler Water to give better access to facilities in the site. The bridge will be able to accommodate disability scooters and wheelchairs. \nThere will also be a new traffic light system installed on the site, and a new children’s play area is being developed. \nThe construction scheme started in October and is expected to be completed by March next year. \nRiverside Leisure Park is one of seven parks that Verdant owns in the North East and southern Scotland, and until last year was also the company’s registered headquarters. \nThe firm was established in 2010 by chief executive Graham Hodgson to take advantage of the growing trend for staycations in the UK. \nInitial backing came from private equity firm RJD Partners, with a secondary buyout by Palatine Private Equity sparking growth which saw the company acquire the Kingfisher caravan park near Bishop Auckland, and the Heather View site near Stanhope, both in County Durham. CGI of new developments at Riverside Leisure Park, Wooler (Image: Copyright unknown) 8:38 Jonathon Manning Driver shortages knock sales growth at Ocado \nOnline grocer Ocado has revealed a hit to sales growth after a shortage of drivers knocked trading.The group said retail revenue growth slowed to 11.6% in its fourth quarter to December 3, down from 13.1% in the previous three months.It said growth in average orders slowed to 11.1%, with 280,000 deliveries a week in the quarter due to the driver shortage.It comes as the boom in online shopping is causing soaring demand for drivers, with the Freight Transport Association also recently reporting a shortage of drivers and pay rising to attract staff.Ocado boss Tim Steiner said: \nA shortage of capacity, with the lack of drivers in certain locations being the largest factor, restricted our sales growth. \nWhile this driver shortage has now been largely resolved, there was some short term impact on average orders per week over the period. An Ocado home delivery van (Image: Katie Collins/PA Wire) 8:33 How does the North East's unemployment figures compare \nThe North East has the highest rate up unemployment in the country at 5.9%. \nBelow are the unemployment figures for the period from August to October. The name of the region is followed by the total number of unemployed people, the change on the quarter, and then the unemployment rate. North East - 77,000, no change, 5.9% North West - 150,000, plus 5,000, 4.2% Yorkshire and the Humber - 131,000, plus 4,000, 5.0% East Midlands - 98, 000, plus 7,000, 4.2% West Midlands - 150,000, minus 14,000, 5.3% East - 115,000, minus 7,000, 3.6% London - 240,000, minus 13,000, 4.9% South East - 145,000, minus 8,000, 3.0% South West - 105,000, minus 1,000, 3.7% Wales - 71,000, plus 6,000, 4.7% Scotland - 114,000, plus 8,000, 4.1% Northern Ireland - 34,000, minus 12,000, 3.9% 9:30 KEY EVENT UK sees largest drop of people in workt since 2015, but no change in North East \nThe number of people in work in the UK has fallen by 56,000 in recent months, the biggest quarterly drop in more than two years. \nBut the North East was one of the few regions to buck the trend, with the number of people unemployed in the region remaining flat at 77,000. \nDespite the good news the North East still has the highest rate of unemployment in the country, at 5.9%.There are just over 32 million people in employment, but the 56,000 reduction between August and October is the largest since the three months to May 2015, the Office for National Statistics (ONS) said.Unemployment fell by 26,000 to 1.4 million, which is 182,000 lower than a year ago. \nPaul Carbert, policy adviser, North East England Chamber of Commerce said: \nThese statistics reflect the strength of the North East economy which in recent months has demonstrated real resilience and growth. Our employers continue to report strong sales and whilst uncertainty affects future confidence, there is a still very positive outlook for 2018. \nThe figures certainly continue the recent positive trend, particularly on employment where the rate has increased more than in any other region over the past year. It is also good to see that the number of workforce jobs has increased by 34,000 over the past year, with a significant increase in the number of self-employment jobs (up by 16% over the past year). \nThe claimant count, which includes people on Jobseeker’s Allowance and the unemployment element of Universal Credit, increased by 5,900 last month to 817,500.Average earnings increased by 2.5% in the year to October, 0.2% up on the previous month, although pay is still growing at less than the rate of inflation.The number of people classed as economically inactive, including students, those on long-term sick leave, taken early retirement or who have given up looking for work, increased by 115,000 to 8.8 million.The fall in employment was virtually all among full-time men, although the total employment figure of 32 million is 325,000 higher than a year ago.Job vacancies were up by 14,000 to a record 798,000.ONS statistician Matt Hughes said: \nEmployment stayed close to its record high and, while up on a year ago, declined compared with the previous three months. \nUnemployment also fell, but there was a rise in the number of people who were neither working nor looking for a job. Meanwhile the number of vacancies continue to grow, reaching a new record high. \nThere has been a slight pick-up in pay growth in cash terms, which means that, although earnings are still growing less than inflation, the gap has narrowed. Paul Carbert, policy advisor, North East England Chamber of Commerce (Image: handout) 8:20", "external_links": [], "published": "2017-12-14T10:00:00.000+02:00", "crawled": "2017-12-14T12:40:59.015+02:00", "highlightTitle": ""}