{"organizations": [], "uuid": "2320563b09d94f9e21ccbe03fe29595f826e2069", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13643066.ece/ALTERNATES/s1200/Graduations.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/great-university-rip-off-concerns-14011400", "country": "GB", "domain_rank": 21960, "title": "The great university rip-off? Concerns raised over the value - and cost - of higher education", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-10T07:00:00.000+02:00", "replies_count": 0, "uuid": "2320563b09d94f9e21ccbe03fe29595f826e2069"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/great-university-rip-off-concerns-14011400", "ord_in_thread": 0, "title": "The great university rip-off? Concerns raised over the value - and cost - of higher education", "locations": [], "entities": {"persons": [{"name": "ian mearns", "sentiment": "none"}, {"name": "robert halfon", "sentiment": "none"}, {"name": "amyas morse", "sentiment": "none"}, {"name": "paul carbert", "sentiment": "none"}], "locations": [{"name": "north east england", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "national audit office", "sentiment": "none"}, {"name": "teesside university", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "universities alliance", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "institute", "sentiment": "none"}, {"name": "north east chamber of commerce  paul carbert", "sentiment": "none"}, {"name": "commons education committee", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "russell group", "sentiment": "none"}, {"name": "nao", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nIs going to university a waste of money? \nThere are around two million students in higher education at any time. And on average, they each rack up debts of £50,000. \nIn return, they get a degree. And this is meant to allow them to get a better job and earn a higher salary. \nBut the difference a degree makes to your life can vary wildly depending on the university you attended and the course you studied. \nIn some cases, it might have no impact on your future salary at all. \nUniversities are in the spotlight following the publication of a major report by the National Audit Office (NAO), the nation’s official spending watchdog, which warns that some students are getting a poor deal. Newcastle University students celebrate their achievements at the summer graduation ceremonies (Image: UGC TNE) \nAnd MPs are concerned. The Commons Education Committee has launched an inquiry into universities offer value for money - or not. \nGetting a degree certainly can be a good investment, according to the NAO. It reports that graduates earn, on average, 42% more than non-graduates. \nBut the benefits vary dramatically depending on what you study and which university you attend. \nChoose the wrong course and institution and you could find yourself no better off than someone who didn’t go to university. \nAt the same time, students who complete a three-year course have an average debt of £50,000 - though they are likely to pay back only £30,000 of it. \nIn theory, students are meant to make an informed choice about whether it’s worth going to university or not. Newcastle University (Image: Newcastle Chronicle) \nBut the NAO says it’s foolish to expect young people aged 15 to 18 - when decisions about university tend to be made - to make this decision when they receive so little guidance. \nAmyas Morse, head of the NAO, said: “Young people are taking out substantial loans to pay for courses without much effective help and advice, and the institutions concerned are under very little competitive pressure to provide best value.” \nA detailed investigation by the Institute from Fiscal Studies found that if you complete a degree in creative arts, ten years later you’re likely to be earning roughly the same as people who didn’t go to university at all. \nBut men who studied a social science course were earning £4,200 a year more on average, while women were earning £4,900 a year more. \nEconomics graduates earned £13,200 a year more, if they were men, and £17,800 a year more if they were women. \nAnd graduates of medicine earned £24,100 a year more, for men, or £23.200 a year more for women. \nGoing to the right university helps too. \nEven when you take into account other factors - such as the fact that top universities tend to attract richer students, who have all sorts of other advantages - going to a university which requires high A-level grades to get in can boost your earnings by £14,000 a year for men, or £9,000 a year for women, compared to attending a university which requires lower grades. \nThe Commons Education Committee, a cross-party group of MPs which includes Gateshead MP Ian Mearns , has launched an inquiry into whether universities offer value for money. \nCommittee chair, Robert Halfon, said: “Universities should be about education, skills and employability, and addressing social injustice - ensuring that the socially disadvantaged can climb the ladder of the opportunity. \n“We need to be thinking about degrees in terms of employability and the extent to which graduates are in the right jobs to fill the skills gaps in our economy. We need to make better use of data on graduate outcomes and hold universities to account when their graduates do not find jobs.” \nEmployers say they do value workers with degrees - but there are other options. Paul Carbert, policy advisor at the North East Chamber of Commerce \nPaul Carbert, a policy adviser at North East England Chamber of Commerce, said: “Employers and young people in the North East continue to see the value of higher education, as the region’s graduate population is increasing. Read More Brexit chief says Government did NOT study impact of Brexit on sectors of the economy \n“University is not the right choice for everyone though, and reforms to technical education and apprenticeships are creating new routes into jobs that were previously dominated by graduates. \n“It is vital that young people receive good careers advice at school so that they can make an informed choice about their options for study and work.” \nWhile the Commons inquiry is in its early stages, universities have already submitted evidence. They insist they offer a valuable service. \nThe Universities Alliance, a group of 18 universities including Teesside University, says higher education is about more than earning a high salary. \nThey said: “The value of a degree must not solely be based on the measurement of salary outcomes of 25 to 29-year-olds. \n“The social benefits of attending university, such as the benefits associated with the exposure to new ideas, the opportunities for first-generation university students to gain social capital and to have a greater choice of career pathways upon completion of their studies, must be considered as part of any discussion on graduate outcomes.” Read More How the North East could look in years to come: The big projects planned and when they will begin \nThe Russell Group, which represents 24 elite universities including Durham and Newcastle, said: “The vast majority (80%) of Russell Group graduates enter professional employment just six months after graduation and benefit from a higher earnings premium than graduates from other universities. \n“The value of a degree is not restricted to economic advantages; the knowledge, skills and personal qualities (such as empathy, curiosity and confidence to challenge received wisdom) acquired by students means they enjoy a range of benefits including better health, higher levels of civic engagement, and increased likelihood of a fulfilling career.” Like us on Facebook ", "external_links": [], "published": "2017-12-10T07:00:00.000+02:00", "crawled": "2017-12-10T07:24:38.005+02:00", "highlightTitle": ""}