{"organizations": [], "uuid": "d0e2173682cda37b266ede583cb293a8e814b601", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14022388.ece/ALTERNATES/s1200/Bank-of-England-warning.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-party-could-create-regional-14022232", "country": "GB", "domain_rank": 21960, "title": "Labour party could create a regional Bank of England office in Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-11T15:00:00.000+02:00", "replies_count": 0, "uuid": "d0e2173682cda37b266ede583cb293a8e814b601"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-party-could-create-regional-14022232", "ord_in_thread": 0, "title": "Labour party could create a regional Bank of England office in Newcastle", "locations": [], "entities": {"persons": [{"name": "john mcdonnell", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "graham turner", "sentiment": "none"}], "locations": [{"name": "newcastle north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "newcastle news labour", "sentiment": "negative"}, {"name": "bank", "sentiment": "negative"}, {"name": "board", "sentiment": "none"}, {"name": "gfc economics", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour government", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "clearpoint corporation management", "sentiment": "none"}, {"name": "strategic investment board", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour party could create a regional Bank of England office in Newcastle North East office for Bank of England to end dominance of London and ensure decisions are made for the god of the whole country Share Bank of England in London (Image: PA) Share Get daily   Thank you for subscribing!   \nThe Bank of England could open a regional office in Newcastle under a Labour Government, Shadow Chancellor John McDonnell has revealed. \nIt would be part of a major shake-up of the UK’s financial institutions designed to reduce the dominance of London and encourage “faster and more balanced economic growth”. \nRegional offices would be created in Newcastle and Plymouth, as well as in Glasgow, Cardiff and Belfast. \nAnd a new Strategic Investment Board would have offices in the same cities. The Board would include the Chancellor, Secretary of State for Business and the Governor of the Bank of England, and it would co-ordinate the promotion of investment, employment and higher wages. Read More Newcastle seeks assurances about £80 million European Union funding \nUnder the proposals, the Bank of England’s main offices could be moved from London to Birmingham. \nAn interim report by consultants GFC Economics and Clearpoint Corporation Management, commissioned by Mr McDonnell, said: “The regional offices of the Bank of England and the Strategic Investment Board would ensure that \nproductive lending is geared towards the needs of local businesses. \n“Relocating core economic institutions will provide a clear, visible example of a new government’s determination to promote growth and a rebalancing of the economy.” Shadow chancellor John McDonnell (Image: PA) \nThe measures are not yet Labour party policy, but the proposals were welcomed by Mr McDonnell. \nHe said: “This important report drums home the message that our financial system isn’t delivering enough investment across the whole country, and in the high-technology industries and firms of the future where it is needed most. Read More Brexit divorce deal might be sealed but North East employers warn there's much more to do \n“Under the Tories, we’ve seen more and more investment flowing into property speculation whilst high-tech firms have been starved of the money they need, and research spending has lagged far behind. \n“Labour is committed to working with our financial institutions to help deliver the financing that the fourth industrial revolution will need, as part of our ambitious plans to help build a high-tech, high-wage economy that works for the many, not the few.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nGraham Turner, chief economist, GFC Economics, said: “The pace of automation and technological change is accelerating, threatening established business models and creating an economy characterised by frequent ‘disruptive’ episodes. \n“As a central bank sitting at the heart of the UK financial system, the Bank of England needs to be playing an active, leading role, ensuring banks are helping UK companies to innovate. Flow of funds analysis shows that banks are diverting resources away from industries vital to the future of this country.” \nOther proposed changes include reforming the Bank of England’s mandate, which is currently to aim for 2% inflation. A new mandate could include trying to ensure wages increase, the report says. Like us on Facebook", "external_links": [], "published": "2017-12-11T15:00:00.000+02:00", "crawled": "2017-12-11T15:48:31.000+02:00", "highlightTitle": ""}