{"organizations": [], "uuid": "f4bcf1bd7bdb6a81c5899fa22f0dceaa060c4012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article443903.ece/ALTERNATES/s1200/Exeter-city-centre.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/business/exeter-been-named-among-fastest-908825", "country": "GB", "title": "Exeter has been named among fastest growing economies in UK", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-12T02:00:00.000+02:00", "replies_count": 0, "uuid": "f4bcf1bd7bdb6a81c5899fa22f0dceaa060c4012"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/exeter-been-named-among-fastest-908825", "ord_in_thread": 0, "title": "Exeter has been named among fastest growing economies in UK", "locations": [], "entities": {"persons": [{"name": "andrew perkins", "sentiment": "none"}, {"name": "sally basker", "sentiment": "none"}, {"name": "perkins", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "cornwall top", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "uk exeter", "sentiment": "none"}, {"name": "exeter science park", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "southern england", "sentiment": "none"}, {"name": "stoke-on-trent", "sentiment": "none"}, {"name": "reading  manchester", "sentiment": "none"}, {"name": "ey", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "thames valley", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "uk regional economic forecast  employment", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "ict", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "uk regional economic forecast", "sentiment": "none"}, {"name": "luton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter has been named among fastest growing economies in UK It is ranked fifth in the country - and matches Bristol in its strong economic performance Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nExeter is forecast to be one of the UK’s fastest growing cities over the next three years, according to a new economic report. \nStrengths in ICT, professional services and real estate sectors are keeping the city flying high with utilities and renewables key growth drivers over the next three years. \nIt is ranked at number five in the whole of the country with Gross Value Added (GVA) of 2.3%, as cities in Southern England are forecast to outperform those located across the rest of the country. Tech is the region's fastest growing sector: Dr Sally Basker, CEO of Exeter Science Park explains to Sir Vince Cable her future vision and plans for growth during his visit to the centre. \nAccording to EY’s UK Regional Economic Forecast, Exeter is on par with Bristol with both expected to grow faster than London’s 2.2% and the UK average of 1.8%. Exeter’s growth will also outpace the broader South West with its forecast 1.7% growth by 2020. Top 11 cities for GVA growth until 2020 EY’s UK Regional Economic Forecast \nEmployment in the South West shows a strong increase, with 54,000 more jobs in June 2017 than in the previous year. Looking ahead to 2020, total employment in the South West is expected to increase by 0.3% per year – just behind the UK average of 0.4%. Read More Devon and Cornwall Top 75 fastest growing businesses \nAndrew Perkins, Senior Partner at EY in the South West, said: “The South West is forecast to grow at a faster rate than the majority of UK regions, with only London, the South East and Midlands’ economies growing ahead. Previous forecasts have set the region’s growth at 1.3% so it’s positive to see the South West exceeding this – up to 1.7% GVA by 2020. Read More Ten multi-million pound projects that are transforming Devon and Cornwall \n“With Exeter forecast to grow by 2.3% a year until 2020, the city is finally punching above its weight and is expected to be one of the fastest growing UK cities over the next three years, behind Reading and Manchester both growing at 2.4% GVA. This is underpinned by professional and back office services and real estate driving growth across the South West.” Read More The first street at Exeter Science Park is about to take shape \nThe report projects that GVA growth in northern and devolved regions is expected to be relatively slower. The North East is forecast to experience the slowest rate of GVA growth between 2017 and 2020, growing at 1.2% per year. It is also the only region where employment is expected to decline, falling by 0.1% per year between 2017 and 2020, with the largest declines projected in the manufacturing and public administration sectors. The Met office supercomputer has been heralded as a major driver for growth in Exeter \nMr Perkins said: “The UK has made little progress on regional rebalancing over the past three years, and we expect more of the same leading up to 2020. In fact, we expect that some of the fastest growing regions over the next three years will be the four most southerly ones, London, the South East, the South West and the East. This means that the economic gap between North and South could be larger in 2020 than it was in 2010.” Read More This all-glass cafe is about to open in Exeter - creating 12 jobs \nManchester forecast to be UK’s strongest performing city, alongside Reading \nManchester is forecast to be the strongest performing city in terms of both GVA (alongside Reading) and employment growth. Commercial property id a key driver of growth for Exeter. No 2 Enterprise Square at £210million Exeter Skypark development is now complete \nCities in Southern England (outside of London) are forecast to out-perform those located across the rest of the country in the period 2017 – 2020. Luton, Thames Valley, Bristol and Exeter are all forecast to experience GVA growth of 2.3% per year on average and 1.0%, 0.7%, 1.0%, 0.9% in employment growth respectively. In contrast, Stoke-on-Trent, Hull, Liverpool and Leeds are forecast to experience GVA growth of 1.2%, 1.4%, 1.5% and 1.7% and employment growth of -0.1%, 0.1%, 0.3% and 0.9% per year on average respectively. Stoke-on-Trent is the only city in England which is expected to experience a contraction in employment, as a result of falling employment in the manufacturing sector. Read More How 'robots' will transform every business in Devon within 10 years \nAndrew Perkins, said: “The Government’s recently published proposals for the UK’s industrial strategy are a welcome development and demonstrate how sectors will be key drivers of both productivity and the economy as a whole. The focus on manufacturing will help support many regions and cities that are located outside of the South East, including the South West. Read More I think Exeter is the best place to set up a business and here's my top three reasons why \n“The UK has to view geographic rebalancing as a key component to the process of transforming the economy. However the scale of the challenge should not be underestimated. With the requirements to prepare for Brexit, position for technological change and maintain its competitiveness, the UK needs to invest more than it has done for some time – robots will not buy themselves.” Like us on Facebook ", "external_links": [], "published": "2017-12-12T02:00:00.000+02:00", "crawled": "2017-12-12T03:12:37.003+02:00", "highlightTitle": ""}