{"organizations": [], "uuid": "7c36af2a008573c59d80eecf6a7e46890eaa45f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article942820.ece/ALTERNATES/s1200/BNPD20171214A-009_CJPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/cometh-hour-cometh-man-ukip-942773", "country": "GB", "title": "'Cometh the hour, cometh the man' Ukip leader tells DevonLive.com", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-18T16:46:00.000+02:00", "replies_count": 0, "uuid": "7c36af2a008573c59d80eecf6a7e46890eaa45f8"}, "author": "Joe Bulmer", "url": "http://www.devonlive.com/news/devon-news/cometh-hour-cometh-man-ukip-942773", "ord_in_thread": 0, "title": "'Cometh the hour, cometh the man' Ukip leader tells DevonLive.com", "locations": [], "entities": {"persons": [{"name": "henry bolton", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "joe bulmer ukip", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "joe bulmer", "sentiment": "none"}, {"name": "paula davies", "sentiment": "none"}, {"name": "bolton", "sentiment": "none"}, {"name": "ukip henry bolton", "sentiment": "none"}, {"name": "henry", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}], "locations": [{"name": "ukip", "sentiment": "none"}], "organizations": [{"name": "devonlive.com    ukip", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get   \nUkip leader Henry Bolton explained why Nigel Farage is living in his “shadow” and predicts a Ukip “resurgence” after a “quiet year” for the party in an exclusive interview with DevonLive.com. \nIn a 25 minute interview with DevonLive.com reporter Joe Bulmer Ukip leader Henry Bolton spoke about his relationship with Nigel Farage and his belief that Ukip’s job is far from done, “cometh the hour, cometh the man”. \nMr Bolton’s respect for the former Ukip leader Nigel Farage is obvious but he is looking to steer a more “sophisticated” Ukip through a “new phase” in British politics, a phase in which Ukip can “dominate” the political landscape. Leader of Ukip Henry Bolton sits down with DevonLive.com reporter Joe Bulmer (Image: Paula Davies) Read More Independent wins council seat vacated by convicted Conservative councillor \nMr Bolton said: “First of all Nigel is actually living in my shadow, let me explain that, we have offices in the same three storey building, I’m on the top floor and he’s on the floor below me. Nigel is Nigel, Henry is Henry, I am my own guy. \n“I have no doubt that I can do this and indeed, Nigel was one of the most remarkable politicians of this century, I believe. That referendum has changed the course of history for this country and he was instrumental in that, this party was instrumental in that but we’re now in a new phase, we’ve got to make sure that mandate is implemented. \n“We’ve also got to take Britain beyond the European Union and that requires even broader leadership of a different style than that which Nigel was suited to, so cometh the hour cometh the man. \n“I’m an ex-soldier, the referendum was a big battle, it was won, but it’s one battle, it is the first step on delivering our independence and our confidence. \n“We’ve got a long term campaign to fight here and that requires a different form of leadership, it requires stamina, it requires endurance, it requires persistence, it requires planning, this is a more comprehensive and dare I say it a more sophisticated suite of policies we need to have but they need to be effective and they need to be realistic. \n“That requires a different type of leadership, so it’s a different time.” \"I’m an ex-soldier, the referendum was a big battle, it was won, but it’s one battle, it is the first step on delivering our independence and our confidence.\" (Image: Paula Davies) Read More Conservatives lose majority of Devon council after Lib Dems take by-election seat \nMr Bolton is also keen to point out the strange political situation the UK is in at the moment with divisions evident in both the Tory Party and Labour, a situation Mr Bolton feels Ukip can exploit. \n“I think with the motivation we’ve got in the party, the incompetence of the Conservative Party and the divisions in the Labour Party actually that need to get the party professional, get it grown up so we can really dominate British politics, I believe we can do it and that’s what I’m set on doing,” said Mr Bolton. \nUkip have in the last few weeks lost a number of seats in local councils, most recently at a Torridge District Council by-election in Great Torrington. Ukip held the seat before the by-election but came a firm last at the election with a Liberal Democrat candidate taking a landslide win. Despite these losses Mr Bolton believes Ukip councillors’ records on local issues will prevent many further losses. \nHe said: “People voted for Ukip for all manner of reasons and a lot of those we’re centred around the European Union thing and I don’t think people understood the Conservative Party were never going to deliver on the mandate they were given by 17.4million people, we’ve taken a hit as a result of that. In addition, let’s be honest, for the last twelve months the party has been quite quiet, it hasn’t engaged a great deal. \n“The important thing for people to remember is it’s about being confident, optimistic, prosperous and secure going forward and that’s not just about the nation, it’s about everybody living here. Every organisation goes through ups and downs and we went through a big highlight with the referendum and result. \n“I would say morale has been low but after our conference, after the election of a new leader and with some new reorganisation taking place there is a sense of reinvigoration.” Ukip leader henry Bolton talks exclusively to DevonLive.com (Image: Paula Davies) Read More \nMr Bolton claims the party is taking on new members from across the political spectrum and people should expect to see Ukip “come right back, as the political environment is absolutely right for us”. \nThe former British Army officer and police officer was positive about the health of the party. \n“I’d say the party’s position is pretty good, I realise that may sound a little strange,” said the Ukip leader. \n“For the last year, since the referendum, we’ve been quite quiet. A lot of people have said, ‘well isn’t it job done now? Brexit was about leaving the European Union and whatever the chaotic approach is of the Conservative Government aren’t they taking us towards it?’. \n“There are two things about that, one is leaving the European Union in and of itself was never the ultimate goal of Ukip, the name, the United Kingdom Independence Party, tells you all you need to know, it’s independence. \n“We want that independence so we can build a confident, optimistic and prosperous nation. We want to take control of our own destiny without it being dictated to us by a foreign power sitting in a foreign capital.” Leader of Ukip Henry Bolton at Devonlive office, Barnstaple. Interviewed by Joe Bulmer. (Image: Paula Davies) Read More Anti-racist and anti-fascist demo planned outside UKIP annual conference in Torquay \nMr Bolton is unhappy with the Prime Minister’s approach to negotiating the UK’s exit from the EU and according to him Mrs May is “actually integrating us further” in areas like defence and procurement and “there is absolutely no indication whatsoever that the Conservative Government is going to take back our fishing rights”. \nHe said: “First thing we need to do is revoke the communities act, pop smoke and pull out of the European Union. But we do need to prepare and plan for that moment. \n“Unfortunately we’ve got a government which has been entirely negligent in failing to in anyway plan or prepare to leave.” \nThe last question faced by Mr Bolton was what does Ukip look like in five years time? Will it have MPs? More councillors? \nThe Ukip leader said: “I think we’re going to see an increase but I think we’re going to see an increase in our vote share, of our support across the nation. \n“As we know well having a higher proportion of the vote share doesn’t necessarily translate into putting bums on green seats and I’ve appointed a spokesman for electoral reform because we would like to see proportional representation brought in for the elections, it’s got cross-party support. \n“We do need to have PR, we’ve always said we need PR because we do suffer from it, we’re not the only party to suffer from it and the First Past The Post system is actually a way of perpetuating the two party system. Again you can see the Conservative Party putting its interests ahead of the country’s. \n“I see our vote share certainly increasing, we’re slowly going back up in the polls now and my job is to keep that going and speed that up.” Like us on Facebook", "external_links": [], "published": "2017-12-18T16:46:00.000+02:00", "crawled": "2017-12-18T17:41:57.016+02:00", "highlightTitle": ""}