{"organizations": [], "uuid": "c22c1e50f29efb9a5176e3367a2cb34bfefc7a54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article679600.ece/ALTERNATES/s1200/BMEpL63O_400x400.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/news-opinion/not-allow-brexit-side-line-953932", "country": "GB", "title": "I will not allow Brexit to side-line food and farming in this country", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-20T15:44:00.000+02:00", "replies_count": 0, "uuid": "c22c1e50f29efb9a5176e3367a2cb34bfefc7a54"}, "author": "Neil Parish", "url": "http://www.devonlive.com/news/news-opinion/not-allow-brexit-side-line-953932", "ord_in_thread": 0, "title": "I will not allow Brexit to side-line food and farming in this country", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010 \nFor decades, UK farming has been subject to policies set in Brussels. Leaving the EU is a defining moment for British farming and a golden opportunity we should be prepared to grab with both hands. DEFRA must now step up to the plate and deliver. \nAs a former dairy farmer myself, I know we have a great farming industry with high-quality products. But we need to set the right conditions for this great British industry to thrive. \nLeaving the EU means leaving the Common Agricultural Policy. For all my working life, CAP payments have been crucial to farmers’ livelihoods. Indeed, they make up around half of farm incomes. That financial guarantee for our farmers is the reason I voted to remain in the EU. In a spending round with competition from the NHS and Education budgets, I argued DEFRA’s budget would seem like easy pickings. Read More Sheep and farmers play essential role in maintaining the fabric of the UK countryside says MP Neil Parish MP \nDEFRA must stand up and be counted. Some free market thinkers believe Britain’s departure from the CAP is a golden opportunity to drastically scale back — and even end — agricultural subsidies altogether. Read More It’s vital we get design and quality of new homes right - because we won’t get a second chance \nThis would be a mistake. We need to start re-making the case for targeted investment in our farmers and the rural economy. Farm support payments are essential in delivering on climate change targets, on providing jobs, as well as ensuring protection for our precious wildlife and countryside. \nBut support payments also play a crucial role in self-sufficiency and food security. British farming produces 61 per cent of our food. It is also the UK’s largest manufacturing sector, worth 108 billion to our economy. It makes no sense to weaken our farming sector to the extent we have to import more food from abroad. Read More Christmas comes early for Tiverton nursery thanks to Homebase donation \nAnd importing more food means we export jobs in farming and food production, as well as the environmental impact of this production. We will become increasingly reliant on other nations, put ourselves at the mercy of global markets and risk sourcing food produced to lower standards. Over time, this will reduce certainty and transparency in our supply chain, and could increase prices for consumers. Neil Parish MP \nSensibly, the Government has guaranteed support payments until 2020, but the clock is now ticking on reform. \nThat’s why the EFRA Committee, which I chair, has concluded an inquiry into ‘Brexit: Trade in Food’, examining how trade deals could affect farmers, food processors and consumers. This week, we had DEFRA Ministers Michael Gove and George Eustice in front of the Committee, where we were keen to stress the importance of a plan that's good, not only for the environment, but for food and farming as well. Read More \n85 per cent of people think it is important Britain has a productive and resilient farming industry. Count me in. I will not allow Brexit to side-line food and farming in this country. Like us on Facebook", "external_links": [], "published": "2017-12-20T15:44:00.000+02:00", "crawled": "2017-12-20T16:26:46.020+02:00", "highlightTitle": ""}