{"organizations": [], "uuid": "93f16bb64ecfdc099149cc8d85994560a65dda9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article937978.ece/ALTERNATES/s1200/brexit-1491370_1280.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/big-swing-means-more-half-937977", "country": "US", "title": "Big swing means more than half of us would now vote Remain on Brexit - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2017-12-17T09:19:00.000+02:00", "replies_count": 0, "uuid": "93f16bb64ecfdc099149cc8d85994560a65dda9d"}, "author": "Neil Shaw", "url": "http://www.devonlive.com/news/devon-news/big-swing-means-more-half-937977", "ord_in_thread": 0, "title": "Big swing means more than half of us would now vote Remain on Brexit - Devon Live", "locations": [], "entities": {"persons": [{"name": "michael turner", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "bmg research", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Big swing means more than half of us would now vote Remain on Brexit The BMG Research poll found 51% favoured staying in the EU while 41% backed Brexit Share Neil Shaw Head of Digital 07:19, 17 DEC 2017 Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMore than half of Britons back staying in the European Union, with a 10-point lead for people who want to remain over those who still back Brexit, according to a new opinion poll. \nThe BMG Research poll for The Independent found 51% favoured staying in the EU while 41% backed Brexit. \nAfter people who said they did not know were pushed for an answer or excluded, the survey found 55.5% in favour of Remain and 44.5% backed Leave. \nEither measure gives the pollster's biggest margin in favour of remaining since the June 2016 referendum backed Brexit. \nBMG Research head of polling Michael Turner said the shift in favour of Remain had predominantly come from people who did not vote in the referendum, rather than Leavers changing their minds. Read More Councillor jailed for three years \n\"The last time Leave polled ahead of Remain was in February 2017, and since then there has been a slow shift in top-line public opinion in favour of remaining in the EU,\" he said. \n\"However, readers should note that digging deeper into the data reveals that this shift has come predominantly from those who did not actually vote in the 2016 referendum, with around nine in 10 Leave and Remain voters still unchanged in their view. Read More Brexit rebel Sarah Wollaston hits back over 'self-consumed malcontent' headline \n\"Our polling suggests that about a year ago, those who did not vote in the referendum were broadly split, but today's poll shows that they are now overwhelmingly in favour of remaining in the EU, by a margin of more than four to one.\" \nThe poll was carried out before Theresa May secured agreement in Brussels to move on to the next phase of withdrawal talks - and also before she suffered the embarrassment of a Commons defeat over her Brexit legislation. \n:: BMG Research interviewed a representative sample of 1,509 adults living in Great Britain between December 5 and 8. Data are weighted. Like us on Facebook ", "external_links": [], "published": "2017-12-17T09:19:00.000+02:00", "crawled": "2017-12-17T12:00:15.007+02:00", "highlightTitle": ""}