{"organizations": [], "uuid": "91b9108f2fc7b30e8469a36c74b8bc129a4a8039", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article903272.ece/ALTERNATES/s1200/Ben-Bradshaw-and-the-speakerPNG.png", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/watch-house-commons-speaker-mistake-903260", "country": "GB", "title": "Watch House of Commons speaker mistake Exeter for 'Brexeter' - and then apologise to Ben Bradshaw", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-09T19:53:00.000+02:00", "replies_count": 0, "uuid": "91b9108f2fc7b30e8469a36c74b8bc129a4a8039"}, "author": "Richard Booth", "url": "http://www.devonlive.com/news/devon-news/watch-house-commons-speaker-mistake-903260", "ord_in_thread": 0, "title": "Watch House of Commons speaker mistake Exeter for 'Brexeter' - and then apologise to Ben Bradshaw", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ben bradhsaw", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "bercow", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john bercow", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "invalid email  exeter", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "broxtowe", "sentiment": "none"}], "organizations": [{"name": "watch house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nExeter may have voted to remain in the EU referendum but it would appear House of Commons speaker John Bercow may need reminding after renaming the city ‘Brexeter’. \nThe Speaker left the benches in stitches after he accidentally suggested Exeter’s Labour MP, Ben Bradshaw, was a Brexiteer – which couldn’t be further from the truth. \nSpeaking on Wednesday Mr Bercow said: \"No more says the right honourable gentleman the member for Brexeter... Exeter.\" Read More Ben Bradshaw: Judge-led inquiry must probe ‘Russian role’ in EU Referendum and 2017 General Election \nThe comment came after he responded to five points of order, on comments by under-fire Brexit Secretary David Davis. \nHe said: ”If there are no further points of order, 'no, no more' says the right honourable gentleman, the member for Brexeter ... Exeter.\" \nMr Bercow apologised for his error shortly after the slip of the tongue that can be watched above and joked that Mr Bradshaw's views are far from that. Ben Bradhsaw after increasing his majority in May \nHe said: \"I'm very sorry for my discourtesy to the right honourable gentleman.\" \nThe Speaker added: \"He is from Exeter but he is not a Brexeter.\" \n\"If there were such a place he would not wish to live there I realise that.\" \nIn Exeter, 55 per cent voted to remain, by 35,270 votes to 28,533. Read More Ben Bradshaw urges Theresa May to condemn Donald Trump over announcement stating Jerusalem as Israel's capital \nAfter the speaker tripped over his words, another MP joked that the Labour MP \"wouldn't get elected\" in \"Brexeter\" either. \nMr Bercow said: \"No and the right honourable lady from Broxtowe chunters from a sedentary position that she wouldn't want to live in a place called Brexeter either. \n\"I am well aware of that.\" \nEarlier this year Exeter’s MP Ben Bradshaw asked in Parliament whether it was possible, if necessary, to halt the process of the UK leaving to European Union. \nThe Labour MP, who has come up strongly against Brexit, raised the question during a debate in the House of Commons on Monday about the UKs Plans for Leaving the EU. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nBen Bradshaw asked: “Is it the Prime Minister's understanding that, if necessary, it is possible to halt the article 50 process?” \nIn response, the Prime Minister, Theresa May, said: “The position was made clear in a case that went through the Supreme Court in relation to article 50. The Government have made it clear that we have no intention of revoking that. We will be delivering on the vote of the British people.” Read More ", "external_links": [], "published": "2017-12-09T19:53:00.000+02:00", "crawled": "2017-12-09T21:40:29.000+02:00", "highlightTitle": ""}