{"organizations": [], "uuid": "bd9b2502e01996167bbeee536cb8ab5bf40c3c56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12258769.ece/ALTERNATES/s1200/EU-referendum.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-still-firmly-behind-14054538", "country": "GB", "domain_rank": 21960, "title": "North East still firmly behind Brexit as May plans for trade talks", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-18T19:14:00.000+02:00", "replies_count": 0, "uuid": "bd9b2502e01996167bbeee536cb8ab5bf40c3c56"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-still-firmly-behind-14054538", "ord_in_thread": 0, "title": "North East still firmly behind Brexit as May plans for trade talks", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "gmg research for the independent", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East still firmly behind Brexit as May plans for trade talks There's some evidence that support for cancelling Brexit has grown but the North East is still firmly behind leaving Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily     \nThe North East is still firmly behind Brexit, according to a new poll. \nRecent opinion polls have suggested some people are having second thoughts about Brexit, after the nation voted by 52% to 48% to leave the EU in the 2016 referendum. \nAnd a survey by GMG Research for the Independent concluded that 51% now want to remain the EU. \nBut the same survey found the North East still wants to leave, with 59% of people in the region backing Brexit and 37% saying the UK should remain in the EU. \nThe most pro-remain part of the UK was Scotland, where 60% want to stay in. A European Union flag in front of Big Ben (Image: Daniel Leal-Olivas/PA Wire) \nEU officials are set to begin talks with the UK about a trade deal, after the first stage of talks ended with a promise that the UK will make a payment expected to be around £39 billion. \nThe European Council officially signed off on the start of trade negotiations last week. \nBut the Government has not yet decided what it hopes to achieve in the talks. \nThe Cabinet met to discuss possible trade deals on Monday, but concluded without senior ministers agreeing a position. \nCabinet ministers most closely involved with Brexit talks began discussing options for the future UK-EU relationship in a Downing Street meeting which lasted a little more than an hour and a half. \nBrexiteers such as Boris Johnson, Michael Gove and Liam Fox, alongside Gavin Williamson, who backed Remain in the referendum, were understood to be vocal on the need to “diverge” from EU regulations. Foreign Secretary Boris Johnson (Image: Getty Images Europe) \nIt is believed “soft” Brexit backers such as Chancellor Philip Hammond and Home Secretary Amber Rudd leaned further towards “alignment” with Brussels rules to maintain close ties with the EU in the future. \nMinisters did not agree a position but there was discussion of the potential for “gradual divergence” - a step-by-step move away from EU laws after Brexit and the conclusion of a subsequent implementation period in 2021. \nFurther talks on the future relationship are planned for Cabinet European Union Exit and Trade Committee meetings in the new year. Read More Why homelessness is a real problem for Prime Minister Theresa May \nSpeaking in the House of Commons, Mrs May confirmed for the first time that the UK could have to pay up to £39 billion. \nShe said: “This is an important step on the road to delivering the smooth and orderly Brexit that people voted for.” Prime Minister Theresa May (Image: AP) \nAnd referring to the payment, she said: “Based on reasonable assumptions, the settlement is estimated to stand at between £35 billion and £39 billion in current terms. \n“This is the equivalent of around four years of our current budget contribution, around two of which we expect will be covered by the implementation period.” \nThe figure was previously floated by Government sources but this is the first time Mrs May has confirmed it. \nShe also said she hoped to address senior MEPs including leaders of the political groupings in the European Parliament. \nThe Prime Minister hit out at calls for a second referendum on Brexit. \nLabour Deputy Leader Tom Watson said over the weekend that a second referendum was unlikely but told interviewers: “When you’re in complex negotiations on behalf of the nation you shouldn’t rule anything out.” \nMrs May told the House of Commons: “I think it would actually be betraying the British people \nLabour leader Jeremy Corbyn urged Theresa May to “face down” Cabinet ministers who want to scrap EU regulations which limit the working week. Read More \nHe asked the Prime Minister to “categorically” offer assurances over her intent to maintain the standards of the Working Time Directive during any transition period and beyond. \nMrs May reiterated the Government intends to “enhance” workers’ rights. Like us on Facebook", "external_links": [], "published": "2017-12-18T19:14:00.000+02:00", "crawled": "2017-12-18T19:50:04.054+02:00", "highlightTitle": ""}