{"organizations": [], "uuid": "8884f5c97e2a5a0feec4431e2aa875fee6ec7917", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article542006.ece/ALTERNATES/s1200/GettyImages-107429750.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/health/how-avoid-beat-dreaded-sickness-897606", "country": "GB", "domain_rank": 48128, "title": "How to avoid and beat dreaded sickness bug Norovirus", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-08T15:52:00.000+02:00", "replies_count": 0, "uuid": "8884f5c97e2a5a0feec4431e2aa875fee6ec7917"}, "author": "leicestermercury", "url": "http://www.leicestermercury.co.uk/news/health/how-avoid-beat-dreaded-sickness-897606", "ord_in_thread": 0, "title": "How to avoid and beat dreaded sickness bug Norovirus", "locations": [], "entities": {"persons": [{"name": "nicola williams", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "getty", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "none"}, {"name": "west yorks", "sentiment": "none"}, {"name": "castleford", "sentiment": "none"}, {"name": "leicester royal infirmary", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How to avoid and beat dreaded sickness bug Norovirus Stop yourself and others getting ill Share Click to play Tap to play The video will start in 8 Cancel Play now Get   \nCommonly known as the winter vomiting bug, thousands of us catch Norovirus each year. \nSymptoms include sickness and diarrhoea as well as fever, aches and pains. \nWith warnings that another strain is set to spread through schools and workplaces this winter, and Leicester Royal Infirmary introducing restrictions due to an outbreak in early December, here is everything you need to know about the virus, compiled by the Mirror Online . What is it? \nNorovirus is one of our most common stomach bugs and can be very unpleasant. The symptoms are caused by inflammation of the stomach and intestines. \nNicola Williams, a Castleford, West Yorks GP, says: “Although Norovirus is commonly known as the winter vomiting bug, you can catch it any time of the year and it affects all ages. \n\"It can quickly floor you and it will be a few days before you start to feel better.” What are the symptoms? \nDr Williams explains: “Usually, patients will suddenly start to feel sick followed by vomiting, which can be projectile, and watery, loose diarrhoea. \n\"Some people have stomach cramps, aches and pains, headaches and fever. \n\"There is no cure, so let it run its course, which is usually two or three days.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Is it contagious? \nNorovirus is passed on when tiny particle of faeces or vomit from an infected person gets into someone else’s mouth. \nDr Williams says: “It is extremely contagious and outbreaks are more likely to occur in places where people are living more closely together, for example nursing homes and cruise ships. You are most infectious from the time symptoms begin until 48 hours after they pass.” How can I avoid it? \nIt is not always possible to avoid catching Norovirus, says Dr Williams, but the most important thing in prevention is washing your hands well with soap and water. Read More Shocking dashcam footage shows danger of using mobile phone while driving \nShe says: “Don’t rely on hand gels because they don’t kill the virus. Washing your hands properly should take about 20 seconds, as long as singing Happy Birthday twice. If someone in your family has the virus, be extra careful with washing hands.” How is it spread? \nYou can catch the virus by coming into contact with someone who has it, or by eating food or touching surfaces which are contaminated. \nDr Williams says: “Bleach all contaminated surfaces, such as door handles, and use a separate flannel and towel for drying. Wash bedding and towels separately on a hot wash. Avoid eating raw or unwashed foods and oysters as they can carry norovirus.” How long is the incubation period? \nYou are most likely to catch it 12 to 48 hours after coming into contact with the virus. You can get it more than once because it is constantly changing so we cannot build any long-term resistance. How long does it take to recover? \nSymptoms last one to three days and usually clear up on their own. \nDr Williams says: “If you feel like eating, keep it plain with soup, rice pasta and bread. Fizzy drinks can make diarrhoea worse. \nBabies should be given their usual milk feeds to prevent dehydration. Get plenty of rest and you should soon start to feel better.” Read More Hour-by-hour weather forecast for Leicester this weekend Does it only come in winter? \nNorovirus can happen at any time, but outbreaks are more common in colder weather. Germs live longer outside the body in winter, so they spread more easily. \nDr Williams says: “Colder, damp weather forces us inside, which means we’re in closer contact, so the virus can move around quicker.” How do I treat it? \nDr Williams says: “There is no cure, so it’s best to let it run its course, and get plenty of rest. Drink lots of fluids to prevent dehydration. Wee should be light coloured or clear. \n“Take paracetamol for headaches or aching symptoms, but stick to the recommended doses.” Working parents can ask for unpaid leave if their children are sick (Image: Getty) Is it life threatening? \nAlthough norovirus is very unpleasant, it is usually harmless. Be careful not to become severely dehydrated, which can be dangerous to babies, the elderly and those with a weakened immunesystem or kidney disease. Read More What you need to know about the latest Brexit agreements Should I see a doctor? \nIf your symptoms last more than a few days or you already have a serious illness, get advice by phoning your GP. Avoid attending surgery or A&E as you can spread the virus to vulnerable patients. \nDr Williams says: “If you have severe vomiting, bloody stools or dehydration get medical help. Symptoms of severe dehydration include a fast heartbeat, dizziness and passing small amounts of dark urine, or no urine at all, or being drowsy or unresponsive. \n“If a baby or child is less responsive, feverish, or has pale or mottled skin, or if they are not drinking much and have drier nappies than usual, get help.” Read More", "external_links": [], "published": "2017-12-08T15:52:00.000+02:00", "crawled": "2017-12-08T16:19:39.005+02:00", "highlightTitle": ""}