{"organizations": [], "uuid": "2aba272fcfa99e5eff32c8dd424576421f6eb82c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13967635.ece/ALTERNATES/s1200/CFR_NJL_281117palmerharvey_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14050706", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: 1,100 jobs saved at Palmer & Harvey after Bargain Booze owner buys stores", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-18T10:25:00.000+02:00", "replies_count": 0, "uuid": "2aba272fcfa99e5eff32c8dd424576421f6eb82c"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14050706", "ord_in_thread": 0, "title": "Business Breakfast LIVE: 1,100 jobs saved at Palmer & Harvey after Bargain Booze owner buys stores", "locations": [], "entities": {"persons": [{"name": "tyrrels", "sentiment": "negative"}, {"name": "rob smith", "sentiment": "none"}], "locations": [{"name": "tyrrells", "sentiment": "none"}, {"name": "hershey-amplify", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "bargain booze", "sentiment": "negative"}, {"name": "palmer & harvey", "sentiment": "negative"}, {"name": "filtronic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning North East exports continue to grow but remains reliant on the EU \nThe North East economy added an extra £250m to its export figures during the last quarter, with the majority of the increase was derived from trade with the EU. \nBusinesses in the region exported a total of £3.16bn worth of goods and services during the three months ending September 2017, £248m higher than during the same period in the previous year. \nThe figures, which were taken from the HMRC Regional trade statistics, represent an 8.5% increase compared to 2016. Overall UK exports grew by 11.6%. \nJack Simpson, policy adviser at the North East England Chamber of Commerce, said: \nWhile growth has been positive, it has been in the predictable and established markets. To help boost global trade, it is essential that the Government encourages and supports business in their exporting missions. \nThis will help business access new global opportunities, and promote growth and innovation in their sector. \nIt is really positive to see the North East continue to grow in these globally uncertain times, but we believe with the right support, these figures could be even better. \nThe EU remained the North East’s biggest trading partner, with over 60% of total exports being shipped to EU countries. But trade to many regions outside of the EU fell, causing concern that many companies could suffer if the UK does not manage to secure a strong trade deal during Brexit negotiations. \nNorth East exports to Latin America and the Caribbean suffered the most, after falling by 23%. Meanwhile trade to non-EU countries in Western Europe fell by 14%, and exports to North America dipped 6%. A container ship (Image: PA) 9:22 Jonathon Manning Babcock agrees 10-year nuclear deal with Sellafield \nBabcock has been awarded a 10-year contract to supply the Sellafield nuclear site with specialist handling and containment systems.The engineering services group said that the deal has been struck through its subsidiary Cavendish Nuclear, which will design, manufacture and supply “complex bespoke equipment” for the treatment and management of nuclear materials.The contract will be worth up to £95m over the first three years and virtual reality simulation will play a key part in delivering the contract, Babcock added. \nThe group said: \nFull-scale mock-ups with virtual reality headsets will allow the customer to test out the ergonomics and identify any modifications at the earliest possible stage. \nCavendish Nuclear will use Babcock’s Rosyth Dockyard for the project and use a UK supply chain specialising in nuclear.Babcock chief executive Archie Bethel said: \nWe are delighted that Cavendish Nuclear continues to support Sellafield in the delivery of this strategically important programme. \nThe team will provide the significant manufacturing capacity the project needs, as well as opportunities to share best practice across the UK. Sellafield nuclear processing plant in Cumbria 9:17 Jonathon Manning Byron Burger may close more sites after restructuring deal \nTroubled burger chain Byron could make a raft of store closures after securing a restructuring deal that overhauls the ownership of the business. \nThree Hills Capital Partners has bought a slice of Hutton Collins’ stake to become the biggest shareholder in the group, while FPP Asset Management has emerged as a new investor. \nByron is expected to trim its estate as part of the deal, which is designed to firm up its financial position in the face of tough trading conditions and higher costs. \nIt may also consider a company voluntary arrangement (CVA) next year, allowing it to close loss-making stores, it has been reported. It has already exited two restaurants this year, including its site at the Metrocentre in Gateshead. \nThe burger chain had hired KPMG to search for potential buyers of the business, and promoted Simon Cope to chief executive after poaching him from Asian restaurant chain Wagamama in the summer. \nThe move, which came after Andy Manders stepped down in May, also relieved Dalton Philips of his temporary duties and allowed him to return to non-executive chairman. \nByron declined to comment on the potential closures. Byron Burger (Image: Newcastle Chronicle) 9:10 Jonathon Manning easyJet presses ahead with Air Berlin deal \nEasyJet has confirmed the acquisition of part of bankrupt German carrier Air Berlin in a deal worth €40m (£35.2m).The transaction will see the budget airline taking control of Air Berlin’s operations at the capital’s Tegel Airport, with easyJet leasing 25 of its aircraft.The agreement also includes easyJet taking over landing slots and offering employment to the defunct carrier’s flying crew.EasyJet chief executive Johan Lundgren said: \nThis move is consistent with easyJet’s strategy of purposeful investment in strong number one positions in Europe’s leading airports. \nAs a result of our acquisition, easyJet will operate the leading short haul network at Tegel connecting passengers to and from destinations across Germany and the rest of Europe. \nThis is in addition to easyJet’s existing base at Berlin Schonefeld and means that easyJet will be the leading airline to and from Berlin. An easyJet aeroplane (Image: PA) 9:05 KEY EVENT Newcastle business park to give UK firms access to massive Chinese energy market \nA business park in Newcastle is set to play a major role in giving UK firms access to the multimillion Chinese energy market after the signing of a major deal in the Far East. \nTusPark Newcastle - which opened recently in the city centre - is working with Chinese firm Tus-Wind and the UK’s Offshore Renewable Energy Catapult, a Government scheme to drive innovation in the energy sector, to install cutting edge technology into wind farms across China. \nThe business and science park, which is based at Maybrook House on Grainger Street, was launched earlier this year to help the region’s tech firms scale-up and access the Chinese market. \nThrough a collaboration signed in China by the Business Secretary Greg Clark, TusPark will now help develop the Tus Offshore Wind Science Park and 500MW demonstrator in Shandong Province. The UK is set to deliver between 10% and 15% of the technology being used in the demonstrator project, leading to UK firms pocketing around £220m. \nThe agreement has been signed at a ceremony hosted by Mr Clark while on a visit to China with Chancellor Philip Hammond to drum up trade for the UK. \nMr Clark said: \nThe UK is established as a leader in offshore wind which is helping us lead the world in transitioning to a low carbon economy and in meeting our climate commitments, while we grow the economy and create jobs. \nInternational research collaboration and clean growth are key to our modern industrial strategy and the agreement signed today will help to advance co-operation on offshore technologies with one of our largest global trading partners, unlocking further opportunities for projects across the UK and the rest of the world. \nTusPark Newcastle was set up earlier this year by Tus Holdings, the company behind the biggest network of science and technology centres in China. \nThe organisation recently unveiled the world’s first scale-up accelerator programme, which will see it invest £50,000 into 10 UK technology companies. Officials at TusPark say their in", "external_links": [], "published": "2017-12-18T10:25:00.000+02:00", "crawled": "2017-12-18T11:13:27.000+02:00", "highlightTitle": ""}