{"organizations": [], "uuid": "db1aa1e58ad50f695e5182ff5cb59e5c0f7389d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13848214.ece/ALTERNATES/s1200/Bank-of-England-diversity.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13979746", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Soaring Government borrowing is putting UK at risk of Venezuela style crash", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-01T10:25:00.000+02:00", "replies_count": 0, "uuid": "db1aa1e58ad50f695e5182ff5cb59e5c0f7389d8"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13979746", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Soaring Government borrowing is putting UK at risk of Venezuela style crash", "locations": [], "entities": {"persons": [{"name": "jonathon manning nightclub", "sentiment": "negative"}, {"name": "jonathon manning sainsbury", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}, {"name": "andrea coscelli", "sentiment": "none"}, {"name": "visa", "sentiment": "none"}, {"name": "go-ahead", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "david brown", "sentiment": "none"}, {"name": "guy bell", "sentiment": "none"}, {"name": "howarth litchfield", "sentiment": "none"}, {"name": "daniel gibson", "sentiment": "none"}, {"name": "jonathan yates", "sentiment": "none"}, {"name": "sherry coutu", "sentiment": "none"}, {"name": "maitri panchal", "sentiment": "none"}, {"name": "workfinder", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "stonegate", "sentiment": "none"}, {"name": "age uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "revolucion de cuba", "sentiment": "none"}, {"name": "collingwood street", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "durham city", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "scaleup institute", "sentiment": "none"}, {"name": "deltic", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "state for transport", "sentiment": "none"}, {"name": "durham county club", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}, {"name": "mastercard", "sentiment": "none"}, {"name": "southern railway", "sentiment": "none"}, {"name": "thameslink programme", "sentiment": "none"}, {"name": "department of health", "sentiment": "none"}, {"name": "uk high court", "sentiment": "none"}, {"name": "nominet trust", "sentiment": "none"}, {"name": "fiftytwo group", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "aslef", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "go-ahead group", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "rmt", "sentiment": "none"}, {"name": "revolution.deltic", "sentiment": "none"}, {"name": "fergus bell", "sentiment": "none"}, {"name": "warned.the competition & markets authority", "sentiment": "none"}, {"name": "revolution", "sentiment": "none"}, {"name": "newcastle upon tyne", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}, {"name": "boiler shop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Nightclub owner gets back on the dance floor with revolution stake \nDeltic, Britain’s biggest nightclub operator, has reignited its quest to merge with Revolution Bars by snapping up a 3% stake in the firm.In a stock exchange announcement on Thursday Deltic, which has been pursuing a combination for months, said that it has purchased 1.5 million shares in Revolution.Deltic has been attempting to engage with the Revolution board as it seeks an all-paper merger.It has previously tabled a proposal that would see embattled Revolution own 65% of a combined entity and Deltic the remaining 35%, creating a bar giant with annual sales of more than £270m.Its overtures have been continuously rejected as Revolution sought instead to be taken over by Slug And Lettuce owner Stonegate.However, Stonegate’s takeover collapsed in October after Revolution shareholders rejected a £101.5m buyout bid from the group.The botched takeover attempt from Stonegate left the door open for Deltic to resurrect its interest.Deltic has previously said: \nIf the Stonegate offer is withdrawn or lapses and shareholders wish the Revolution board to explore the revised merger proposal, shareholders should encourage the Revolution board to engage with Deltic at that point in time. \nRevolution, which owns more than 60 Revolution and Revolucion de Cuba high street bars, has said of Deltic’s approach that it would not create shareholder value. Revolution bar on Collingwood Street, Newcastle Upon Tyne (Image: Newcastle Chronicle) 9:15 Jonathon Manning This historic building was once fit for The Queen - and a major project is converting it into homes \nA project to convert the historic former Durham County Club into luxury apartments is under way. \nRefurbishment work has started to convert Grade II listed 52 Old Elvet in Durham City into 12 luxury one and two bedroom apartments. \nHowarth Litchfield, a leading architectural and interior design practice in Durham, has been working on proposals for the conversion and refurbishment of the building for the last two years, submitting a planning application in December 2016 for the redevelopment work on behalf of FiftyTwo Group, set up by North East entrepreneurs Fergus Bell and Daniel Gibson. \nHowarth Litchfield was initially commissioned to undertake a feasibility study into the viability of the project submitting a pre-application in July 2016, which later developed into a full planning application. \nSince then Howarth Litchfield has progressed the project through technical design and building control by working as lead consultants, principal designers and conservation architects as well as providing contract administration. \nManaging director Jonathan Yates said: \nWe relish the opportunity to work on projects like this and are really pleased to see the refurbishment work under way. \nThis is a wonderful Grade II listed building, which is more than 200 years old and as you would imagine, the building contains some fine examples of door architraves, ceiling friezes, ceiling roses and a magnificent grand staircase, all of which will be retained. \nThe proposals also seek to retain and protect an original Victorian range within one of the luxury apartments, this is of great historic interest as there are only a handful which are still in their original location in Durham. \nWe have worked closely with Durham County Council’s conservation officers to ensure that the amount of alterations to the building and its fabric are kept to a minimum and those that are required, are sympathetic to its history. 52 Old Elvet in Durham is being turned into 12 luxury apartments 9:10 Jonathon Manning Sainsbury's loses Visa court case \nSainsbury’s is expected to launch an appeal after it lost a High Court case with Visa over a long-running row over processing fees.The supermarket giant was seeking damages for losses it alleged to have been caused by the fixing of so-called interchange fees, which it claims breach UK and EU competition laws.These fees are charged to retailers each time a credit or debit card payment is processed.However, the High Court found that the fees paid are lawful, stating that Sainsbury’s claim “fails in its entirety”.A Sainsbury’s spokeswoman said: \nThis claim concerned the damage Sainsbury’s maintains was caused by Visa’s breach of UK and EU competition laws in its setting of interchange fees. \nSainsbury’s is disappointed by the decision of the High Court in finding that Visa had not infringed competition law. \nSainsbury’s is now considering its position. \nSainsbury’s won a separate court case last summer, with a £68 million award from Mastercard.The ruling comes in the wake of a series of lengthy legal dispute between retailers and card firms after the European Commission investigated interchange fees.The commission voiced concerns over the practice of fixing these costs at Visa and Mastercard and the European Union has since passed legislation to cap interchange fees permanently.Visa said: \nVisa welcomes this week’s decision by the UK High Court, which confirmed that our interchange fees, the fees paid by UK retailers and their payment providers to accept electronic payments, are lawful. \nWe hope the Court’s decision will accelerate the collaboration between retailers and Visa and will allow us to address the greatest disruption, and potentially the greatest opportunity, facing the merchant community in Europe today: the digitisation of commerce. Sainsbury's (Image: PA) Jonathon Manning New scholarship launched to help young women kick-start their careers \nA new scholarship that uses a mobile app to help young women kick-start their careers has launched in Newcastle. \nEducation charity Founders4Schools has launched the £200,000 scheme, which aims to offer girls aged 16 to 18 valuable work experience in the tech sector. \nStudents will be able to find work placements through a new mobile app called Workfinder. The app links the young women with digital firms in the region that are offering work placements. \nThe creation of the unique app was inspired by 16-year-old Maitri Panchal, who helped come up with the idea while on work experience at the charity. \nWorkfinder offers a range of features that allow students to filter preferences, share recommendations and connect with companies in as little as five minutes. \nAt a launch event for the scholarship scheme, which was held at Newcastle’s Boiler Shop, Founders4Schools chair Sherry Coutu explained how she hoped the app would help end the North East’s digital skills gap. \nShe said: \nThe current work experience model is broken. According to the ScaleUp Institute, 90% of UK scale-up businesses are concerned about a lack of skills post-Brexit but existing structures do not allow UK plc to foster home-grown skills. \n93% of teachers say that work experience boosts student attainment and aspirations. Great companies are learning environments and need talent to grow; young people need help to find their passion in life. It’s the challenge of a generation, and I hope Workfinder will give them the power to discover their route to a meaningful career. \nBusiness such as NRG, printed.com, and hedgehog lab have all signed up to the programme and will be offering work placements to students. \nThe scheme has been funded by social tech investor Nominet Trust, who has invested £200,000 into the programme. Sherry Coutu CBE with students (Image: Unknown) 9:00 Jonathon Manning Go-Ahead vows to improve service following end of dispute with train drivers' union \nNorth East travel giant Go-Ahead has vowed to improve the service across its troubled rail division following its dispute with train driver union Aslef. \nGo-Ahead has been in dispute with Aslef since April 2016 over plans to change the roles of train guards and introduce driver-only trains. \nThe plans resulted in strikes being called by Aslef and fellow rail union RMT, which represents Southern’s conductors. The industrial action disrupted many services and brought the rail service to a standstill in December and January last year. \nGo-Ahead has now said it will work to improve the service across its Southern Railway division after its dispute with Aslef came to an end. \nIn a trading update Go-Ahead’s chief executive David Brown said: \nIn rail, trading has been satisfactory in the period. Following the end of Aslef’s longstanding dispute with Southern, we are wholly focused on further improving the service for passengers and supporting the completion of the Thameslink Programme. \nWe welcome the strategic vision for the railways announced yesterday by the Secretary of State for Transport. We are pleased to see proposals to strengthen the partnership between the public and private sector, aimed at further improving services for customers. We look forward to working with the Government to understand the strategy in more detail. \nThe agreement struck between Southern and Aslef will see a second “safety-trained” member of staff on every train, as well as securing a five-year pay deal for drivers. \nMr Brown also added that Go-Ahead’s financial figures for the four months ending November 29 were on track to meet expectations. David Brown, chief executive Go-Ahead Group (Image: Guy Bell) 8:55 KEY EVENT UK care home sector facing £1bn a year funding gap, watchdog warns \nThe UK care home market is grappling with an unsustainable £1 billion a year funding gap that could spark a string of closures across the nation, the competition watchdog has warned.The Competition & Markets Authority (CMA) said resident fees paid by councils failed to meet care home costs, causing a significant shortfall and ramping up prices for those paying for private care.It said fees of private care home residents were 40% higher on average than the amount paid by councils - the equivalent of £12,000 a year.As part of the investigation, the CMA said it may take a number of care homes to court in a clampdown on those charging families for “extended periods” after a resident has died, or demanding unfair upfront fees.CMA chief executive Andrea Coscelli said: \nCare homes provide a vital service to some of the most vulnerable people in society. \nHowever, the simple truth is that the system cannot continue to provide the essential care people need with the current level of funding. \nWithout substantial reform to the way that councils pay and commission care, and greater confidence that the costs of providing care will be covered, the UK also won’t be able to meet the growing needs of its ageing population. \nThe care home sector covers 430,000 residents and stretches across 11,300 homes in the UK.The watchdog said while the sector was just about covering its day-to-day costs, it did not have the money to invest for the future.Around 12,000 extra care home beds are needed each year to keep pace with the demands of an ageing population, the CMA said.As part of its recommendations, it called for an independent body to take charge of care home planning for councils in England and Northern Ireland.Mr Coscelli added: \nIt is essential that residents and their families can make informed choices, understand how these services will be paid for, and be confident they will be fairly treated and able to complain effectively if they have concerns. \nWe are now calling on care homes, councils and government bodies to help people navigate what can be a confusing system. \nThe CMA said care homes must provide better support for families, and pressed for an effective complaints process and more robust consumer protection for residents.Caroline Abrahams, charity director at Age UK, said: \nThis devastating report from the nation’s market experts means we now have it on the highest authority that the care home market, a sector that many hundreds of thousands of older people depend on, is broken and living on borrowed time. \nThe report also substantiates what Age UK has been hearing from concerned members of the public: namely that the business practices of some, but not all, care home operators are unfair and exploitative of older people and their families at an incredibly vulnerable time of their lives. \nA spokesman for the Department of Health said: \nWe know the social care sector is under pressure due to our growing ageing population - that’s why we’ve given £2bn additional funding over the next three years and next summer we will publish plans to reform social care to ensure it is sustainable for the future. \nThe Secretary of State has asked the CQC to report regularly on their assessment of the financial stability of the largest and most difficult to replace providers of adult social care. Elderly woman keeping warm (Image: Getty Images) 8:50 ", "external_links": [], "published": "2017-12-01T10:25:00.000+02:00", "crawled": "2017-12-01T11:29:53.003+02:00", "highlightTitle": ""}