{"organizations": [], "uuid": "00c2a06586eaafe1b6bded1fcb20f3530a83946b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article975634.ece/ALTERNATES/s1200/LEW_2532JPG.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/mp-tells-hunt-supporters-devon-975729", "country": "US", "title": "MP tells hunt supporters in Devon 'the countryside has never been so important'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-26T15:48:00.000+02:00", "replies_count": 0, "uuid": "00c2a06586eaafe1b6bded1fcb20f3530a83946b"}, "author": "Lewis Clarke", "url": "http://www.devonlive.com/news/devon-news/mp-tells-hunt-supporters-devon-975729", "ord_in_thread": 0, "title": "MP tells hunt supporters in Devon 'the countryside has never been so important'", "locations": [], "entities": {"persons": [], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "tiverton foxhounds", "sentiment": "none"}, {"name": "tive", "sentiment": "none"}, {"name": "half moon", "sentiment": "none"}], "organizations": [{"name": "tiverton & honiton", "sentiment": "none"}, {"name": "food and rural affairs committee", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News MP tells hunt supporters in Devon 'the countryside has never been so important' More than 200 mounted packs head out to hunt on the busiest day of the year for hunting Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nThe countryside and hunting has “never been so important” Neil Parish MP told a Boxing Day meet in Devon this morning. The Tiverton & Honiton MP spoke at the annual meet of the Tiverton Foxhounds outside the Half Moon. \nMore than a decade after hunting foxes was made illegal in this country, some activists claim that trail-hunting is a cover for bloodsport. \nThe MP who also chairs the Environment, Food and Rural Affairs Committee said: “It’s lovely to see you all supporting the hunt this morning. The countryside does matter, hunting matters, farming matters and food matters for our future. I spend a lot of time in Parliament chairing what is basically the agricultural committee making sure that rural matters do really matter to this countryside and to the country. Read More View gallery \n“All of you here this morning show how here in Tiverton the hunt and the countryside has never been more supported.” \nSpeaking to the Tiverton Foxhounds he added: “Have a great morning, I think it will be a little bit soft out there, you may get the trail hunting in - within the law - before it empties down with too much rain. \n“You can be assured of my support in the future because Parliament at the moment is an interesting place. I thought I wouldn’t mention the word Brexit this morning, but there, I’ve done it. I shall be jolly glad when it’s done, we’ve got a deal and we move on. \n\"Thank you very much for coming here this morning and supporting it. I shall very much look forward to supporting the hunt in the years to come.” Read More How to stop thieves who know which house to target by looking at your Christmas rubbish \nKelvin Thomas from the Tiverton Foxhounds added: “We do appreciate Neil’s support. There are a few in the House that wouldn’t be that supportive. \n“I’ve been asked to say on behalf of the MFH Countryside Alliance that there will be more than 200 mounted packs out today all over the country. We’ve had to work through the Hunting Bill since 2004 and we continue to do that. \n“We do appreciate the support we get with people coming to see them every year. The crowd gets bigger every year since we started in around 1870 so I think the 2004 Hunting Bill isn’t going to prevent them from being around for a long time yet. \n“I’d like to thank the staff for what they do. It’s seven days a week full time and they don’t have time off that I know of. They are responsible for producing these hounds and I’m sure you’ll agree they’re all looking in pretty good order today. \n“I’d also like to thank Sean from the Half Moon and we’re very grateful to him. \n“We will be hunting today within the law, and we’ll see you all again next year.” \nJokingly he added to the MP: “I am pleased to see he’s got his trainers on today. We will be hunting a trail today and hopefully it might be him, so we will see how we get on.” \nIt comes as anit-hunt activists and saboteurs have raised concerns that trail-hunting is being used as a cover for bloodsport. \nAccording to the International Fund for Animal Welfare, no genuine trail hunting was witnessed at 98% of the hunts observed in 2015, with trails seen being laid at just eight of the 478 hunts monitored. \nLabour MP Chris Williamson, a long-serving trustee of the League Against Cruel Sports who previously served on the board of the Hunt Saboteurs Association, questioned where Gale got his information. \n“I’m told hunts are fragrantly disregarding the law,” he said. “The truth is that if they were genuinely trail hunting they would use an artificial scent rather than fox urine. The pretence of laying a trail is for show.” Like us on Facebook", "external_links": [], "published": "2017-12-26T15:48:00.000+02:00", "crawled": "2017-12-26T16:29:08.012+02:00", "highlightTitle": ""}