{"organizations": [], "uuid": "8c4cefe874cdf36a2e5fea650de063ae6420d44a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14025653.ece/ALTERNATES/s1200/IMG_5860JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-14025655", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-12T08:30:00.000+02:00", "replies_count": 0, "uuid": "8c4cefe874cdf36a2e5fea650de063ae6420d44a"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-14025655", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "claire", "sentiment": "none"}, {"name": "claire holmes", "sentiment": "none"}, {"name": "michael park", "sentiment": "none"}, {"name": "tom eden", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle crown court", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Buses are having a hard time in the city centre: 09:02 Tom Eden Man facing jailing for cycling into couple \nA man who left a couple seriously injured by cycling into them has been warned he will be jailed. (Image: PA) \nPaul Gallon rode at speed into Holly Blake and William Nicholson as they walked through Whitley Bay . \nMs Blake was left with serious head injuries and was described at the time as being in a life-threatening condition. \nMr Nicholson suffered a broken eye socket, a fractured temple and a shattered cheek bone. \nNow 36-year-old Gallon has pleaded guilty to inflicting GBH on Ms Blake and GBH with intent on Mr Nicholson, as his trial was due to begin at Newcastle Crown Court . \nA judge adjourned sentence until next month and Gallon was further released on conditional bail until then. \nJudge Stephen Earl told him: \n“Mr Gallon I’m not going to mislead you in any way, shape or form. \n“Clearly these are very serious matters, clearly you are facing a custodial sentence of some length. \n“You need to put your affairs in order. On that day you need to be prepared to go to custody.” \nGallon rode at the pair as they walked down Esplanade Place, Whitley Bay, North Tyneside , on the afternoon of Monday November 7 last year. \nThe prosecution have not yet opened the facts of exactly what happened. \nWe reported at the time how Ms Blake, 32, and Mr Nicholson, 43, were treated at the RVI in Newcastle afterwards. \nGallon, of Kenton Road, North Shields, was granted conditional bail ahead of his sentencing on January 4. Newcastle KEY EVENT Breakdown on the A1 \nOne lane of the A1 slip road on the northbound side is closed due to broken-down vehicle at the A69 junction. \nLanes one (of two) closed. Newcastle Tom Eden The 'Toon' shirt on sale to help foodbank \nThese new black and white shirts are “selling like hotcakes” and have proven a hit among NUFC fans. Representatives from Toon Aid, including Bill Corcoran (centre) and Newcastle Food bank manager Michael Nixon (far right) with the Toon Aid Newcastle tops, pictured on Glebe Street (Image: newcastle chronicle) \nBut they’re not the Magpies’ latest official strip. \nInstead, the stripped T-shirts, hoodies and jumpers bear the logo ‘Toon Aid’, and are being sold to raise money for Newcastle’s West End foodbank. \nThe largest of its kind in the country, the foodbank is in desperate need of cash to keep running, and its bosses say money is also usually more efficient than donations of food when it comes to keeping their shelves stocked - a particular challenge in the run-up to Christmas. \nToon Aid, a new, Newcastle-based charity , has pledged to help. Among a host of other fundraising activities, they’ve produced the new shirts, with all profits from their sale going directly to the food bank. \nOrganiser Dipu Ahad said: \n“They’re selling like hotcakes. The first ones we ordered sold out really quickly, we just couldn’t keep up with demand. \n“We’ve sold about 220, and we’re going to re-order another 500 because they’ve been so popular. \n“They’ve really connected with Newcastle United fans.” The Toon Aid Newcastle tops (Image: newcastle chronicle) Councils Tom Eden Devolution getting closer \nA North of the Tyne breakaway has moved one step closer, as Tyneside councils vote to move towards leaving the North East Combined Authority . (Image: Newcastle Chronicle) \nNewcastle and North Tyneside’s council cabinets on Monday night approved a withdrawal from the group (NECA), which is currently responsible for some transport and economic issues across the region. \nNorthumberland County Council, also a NECA member, is set to vote on the same decision on Tuesday morning. \nIt follows the signing of a landmark devolution deal with Government in November, which agreed that the three authorities were “minded to” set up their own more independent partnership with an elected mayor and a raft of new powers. \nThe current combined authority contains Gateshead, South Tyneside, Durham and Sunderland councils, who were part of early talks for North East devolution which collapsed. They would continue to make up NECA if the three Northern authorities do indeed leave. \nThe move will trigger a formal public consultation on the move, which will start this week and is set to come to an end at the start of February. \nDepending on the outcome of that consultation, as well as agreement from national Government, Newcastle’s council cabinet were told that the new Northern combined authority would be set up around summer 2018. \nAs part of the devolution deal, the North of the Tyne authorities would be headed up by an elected mayor, who would also have influence on a national level in issues such as Brexit.", "external_links": [], "published": "2017-12-12T08:30:00.000+02:00", "crawled": "2017-12-12T09:23:30.008+02:00", "highlightTitle": ""}