{"organizations": [], "uuid": "3d74db524844a39d7bffa7beb7dabf8a294d8c7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14070821.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/blue-passports-set-return-uk-14070779", "country": "GB", "domain_rank": 21960, "title": "Blue passports set to return for UK travellers after Brexit as burgundy bites the dust", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-22T10:23:00.000+02:00", "replies_count": 0, "uuid": "3d74db524844a39d7bffa7beb7dabf8a294d8c7d"}, "author": "Craig Thompson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/blue-passports-set-return-uk-14070779", "ord_in_thread": 0, "title": "Blue passports set to return for UK travellers after Brexit as burgundy bites the dust", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "brandon lewis", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "news blue", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Blue passports set to return for UK travellers after Brexit as burgundy bites the dust Home Office Minister Brandon Lewis said the new passport will be the 'most high-tech and secure we have ever seen' Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nBritish passports will return to having blue covers after Brexit , it has been officially confirmed. \nThe new design, which will no longer include the European Union insignia, will replace the burgundy cover that has been a feature of the UK passport since the 1980s once Britain leaves the EU in 2019. \nHome Office Minister Brandon Lewis said the new passport will be the “most high-tech and secure we have ever seen”, making it more resistant to fraud and forgery. \nA £490 million contract to redesign and produce a new version of the document was announced earlier this year. \nThe passport is routinely redesigned every five years and Eurosceptics view the new contract as a way to ditch the EU burgundy cover in favour of a return to the colour of the past. poll loading Which colour would you like your passport to be? 0+ VOTES SO FAR Blue Burgundy \nMr Lewis said: “Leaving the EU gives us a unique opportunity to restore our national identity and forge a new path for ourselves in the world. \n“That is why I am delighted to announce that the British passport will be returning to the iconic blue and gold design after we have left the European Union in 2019. \n“It will also be one of the most secure travel documents in the world, with a raft of new security measures to protect against fraud and forgery.” How a British passport will look after Brexit and a burgundy UK passport in the European Union style format (Image: PA) \nThe new passports will be phased in after the UK leaves the EU on March 29, 2019. \nBurgundy passports will continue to be issued, although without the European Union markings, until the current supplier’s contract expires in October 2019. \nThe new blue and gold design will then be issued to people renewing or applying for a new passport. Read More Norovirus hospital outbreak 'caused by visitor bringing MUSSELS for a patient' \nBlue was first used for the cover of the British passport in 1921, but the design changed in 1988 after the UK joined the European Economic Community and burgundy was chosen as the common colour. \nAmong the new design features will be a new picture page made of a “super-strength plastic polycarbonate material that will be more difficult to alter”, the Home Office said. \nBritish passport holders do not need to do anything until their renewal date. Like us on Facebook", "external_links": [], "published": "2017-12-22T10:23:00.000+02:00", "crawled": "2017-12-22T11:06:20.011+02:00", "highlightTitle": ""}