{"organizations": [], "uuid": "e09c5fdbd6995e82f4e8010a441365fbe990df9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article897215.ece/ALTERNATES/s1200/17165725-1.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/business/rise-leicestershire-exports-eu-despite-933263", "country": "GB", "domain_rank": 48128, "title": "Rise in Leicestershire exports to EU - despite Brexit", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-15T17:20:00.000+02:00", "replies_count": 0, "uuid": "e09c5fdbd6995e82f4e8010a441365fbe990df9c"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/rise-leicestershire-exports-eu-despite-933263", "ord_in_thread": 0, "title": "Rise in Leicestershire exports to EU - despite Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "etie", "sentiment": "negative"}, {"name": "jean-claude juncker", "sentiment": "negative"}, {"name": "chris hobson", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "eastern europe", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "australasia", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "middle east & north africa", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "western europe", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "invalid email  more leicestershire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "east midlands chamber", "sentiment": "none"}, {"name": "british chambers of commerce international trade survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit buddies? British Prime Minister Theresa May and EU President Jean-Claude Juncker (Image: Etienne Ansotte/EU/PA Wire) Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMore Leicestershire companies are growing the amount of business they do in Europe than are shrinking it, according to the British Chambers of Commerce International Trade Survey. \nThe survey suggests a quarter of Midlands firms that took part in the survey reported that they’d seen growth in sales to Western Europe - compared to 18 per cent that reported a decline. \nIt also said 19 per cent of firms reported growth in sales to Central and Eastern Europe compared with 12 per cent that said sales had fallen. \nNet export sales growth was also recorded for China (8 per cent), India (5 per cent), Australasia (10 per cent), Middle East & North Africa (3 per cent) and North America (14 cent). \nBut for many of the 388 Midlands firms that completed the survey - including 186 exporters - the outcome of Brexit talks was seen as a potential risk to continuing to trade with the EU, with 43 per cent concerned about tariffs and 36 per cent worrying about customs barriers. \nWork permits and visas were a worry for 11 per cent of respondents and 8 per cent were concerned about having access to foreign workers. \nOver a quarter said they did not foresee any significant barriers to international trade while 38 per cent said they had already started or planned in the future to revise growth strategies. \nHowever, 41 per cent expected costs to slightly increase in the next 12 months after the devaluation in sterling, with 27 per cent expecting \"significant increases\". \nOnly 5 per cent of firms expected their costs to slightly decrease, with 2 per cent expecting a significant decrease. \nChris Hobson, Director of Policy at East Midlands Chamber, which was one of six Midlands chambers included in the survey, said: \"The findings highlight the extent to which the depreciation in sterling is expected to compound the price pressures on firms, underlining the need to ease the domestic cost of doing business. \n\"There is also a clear need for more support and information for exporting businesses on the importance of managing currency risk.” \n\"April marks the start of the financial year in which we are due to formally leave the EU and we know that many businesses have not yet made any provision or plans for trading post-Brexit. \n\"This may be because there has been so little information about what sort of deal we’ll have, but firms shouldn’t just sit back and wait for Brexit to happen to them, they need to have contingency plans and they need to start pulling them together now.\" Like us on Facebook", "external_links": [], "published": "2017-12-15T17:20:00.000+02:00", "crawled": "2017-12-15T19:35:56.021+02:00", "highlightTitle": ""}