{"organizations": [], "uuid": "a838440b8e1792cd78022b4c3585bf17f8d65b9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14038996.ece/ALTERNATES/s1200/JS138950013.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/special-features/year-continued-success-arrival-womble-14038986", "country": "GB", "domain_rank": 21960, "title": "A year of continued success and the arrival of Womble Bond Dickinson", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-20T00:03:00.000+02:00", "replies_count": 0, "uuid": "a838440b8e1792cd78022b4c3585bf17f8d65b9f"}, "author": "Amy Tinmouth", "url": "http://www.chroniclelive.co.uk/special-features/year-continued-success-arrival-womble-14038986", "ord_in_thread": 0, "title": "A year of continued success and the arrival of Womble Bond Dickinson", "locations": [], "entities": {"persons": [{"name": "womble bond dickinson", "sentiment": "positive"}, {"name": "womble carlyle", "sentiment": "none"}, {"name": "womble bond dickinson kevin robertson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "womble bond dickinson partner", "sentiment": "positive"}, {"name": "nesa", "sentiment": "none"}, {"name": "chartered institute of legal executives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertorial A year of continued success and the arrival of Womble Bond Dickinson Partner and head of Womble Bond Dickinson Kevin Robertson looks back over 12 months of success and talks about the merger and what plans are in store for 2018 Share Get daily   \nAs the year comes to an end, I am proud to look back over 12 months of great success for the firm, most notably our transformation to become Womble Bond Dickinson. \nOur combination with US law firm Womble Carlyle in early November transformed us into a top-20 UK law firm, consolidating our national reputation and regional heritage under one powerful transatlantic brand. \nWomble Bond Dickinson’s long-standing connection with the North East enables us to bring richer prospects to the region through a transatlantic lens and offers extended jurisdictional reach for those clients looking to do business in the UK, US and beyond. \nThe launch of our new solicitor apprentice scheme has been a particular highlight. The North East Solicitor Apprenticeship (NESA), which works in collaboration with the Chartered Institute of Legal Executives (CILEx) and City University London, enables us to recognise and develop regional talent. \nWe welcomed three budding legal professionals in to the Newcastle office earlier this year and look forward to growing the programme over the coming years. \nWe are an active member of the region’s business community and have been involved in numerous projects. Earlier this year, we won Deal of the Year at the Insider Dealmaker Awards for our work advising Newcastle City Council on the investment into the Science Central Joint Venture. \nThis will support Newcastle’s £350m flagship regeneration project to create a global centre for urban innovation. \nThe announcement of our role as a legal partner for the Great Exhibition of the North – an 80-day programme in 2018, which will showcase the best of the North – paves the way for the coming year and we’re thrilled to be playing such a significant part. \nThis year has seen commendation and praise through awards and legal rankings. We were delighted that Legal 500 and Chambers recognised us for our outstanding legal advice once again, with the firm obtaining more top-tier rankings than any other firm based here in the region. Some of our team have also celebrated personal success for their ongoing hard work and dedication to support regional clients. \n2018 promises to be another important year with a number of challenges on the horizon. None more so than Brexit, which has continued to cause uncertainty in the marketplace since the UK voted to leave the European Union. \nA number of businesses continue to express caution as the government negotiates our exit and as discussions continue, the direct impact on businesses remains unclear. We will continue to work closely with our clients to ensure they are prepared and best placed to succeed whatever form Brexit takes. \nThe Autumn Budget was encouraging for the region, with a number of key projects approved by the Government, including The North of Tyne Devolution deal, funding a new fleet for the Tyne and Wear Metro and funding to support the transformation of the former SSI steelworks site in Redcar. \nThe regional business community has been calling for this investment for some time and now it’s down to us to make the most of the opportunity and to develop an increasingly resilient and prosperous regional economy for the years to come. Like us on Facebook", "external_links": [], "published": "2017-12-20T00:03:00.000+02:00", "crawled": "2017-12-20T00:27:44.005+02:00", "highlightTitle": ""}