{"organizations": [], "uuid": "5cfb03af816e26c96eabe3c15f8caa1d62c7c0bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13792716.ece/ALTERNATES/s1200/GBR_BPO_081214EEF01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-surveys-point-increasing-confidence-13983057", "country": "GB", "domain_rank": 21960, "title": "Business surveys point to increasing confidence in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-04T02:01:00.000+02:00", "replies_count": 0, "uuid": "5cfb03af816e26c96eabe3c15f8caa1d62c7c0bf"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/business-surveys-point-increasing-confidence-13983057", "ord_in_thread": 0, "title": "Business surveys point to increasing confidence in the North East", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "nigel mills", "sentiment": "none"}, {"name": "richard halstead", "sentiment": "none"}], "locations": [{"name": "north east business", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "entrepreneurs’ forum", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business surveys point to increasing confidence in the North East Surveys by the Entrepreneurs' Forum and by EEF suggest a positive end to 2017 for many companies Share Richard Halstead, Midlands region director of the EEF (Image: Publicity Picture) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTwo separate polls of business owners have pointed to an unexpectedly positive end to 2018 in some sections of the economy. \nA report commissioned by the Entrepreneurs’ Forum, a business support group based in the North East, shows business owners are feeling increasingly optimistic about the future, with two-thirds saying they were more optimistic about the future of their business than they were in the same quarter last year. \nMeanwhile, manufacturers’ organisation EEF said a survey of its members showed increasing demand which would be translated into the recruitment of more staff. \nBusiness confidence has been hit by uncertainty around Brexit and forecasts of lower growth in the UK economy. \nBut the Entrepreneurs’ Forum poll found that just 11% of its members felt that the UK’s departure from the EU would be a major barrier to business growth, with some saying that Brexit could actually be a catalyst for positive change, encouraging them to move in new directions and seek new opportunities. \nThe survey found that 70% of those questioned were reporting sales increases and 64% were recruiting for more staff. \nNigel Mills, chairman of the Entrepreneurs’ Forum, said: “In the latest Business Tracker Survey our members are demonstrating their true entrepreneurial spirit, with a majority showing an increase in profits and feeling positive about the future of their business. \n“Three-quarters of our members are expecting an increase in the number of total sales, actual profit and staff numbers over the next 12 months. It is by creating a platform like the Entrepreneurs’ Forum that businesses can continue to scale up and maintain sustainable operations. \n“However, if this ambition is to be realised more must be done to ensure we have the correct skill mix in the North East, particularly in the engineering sector. Currently our members consider an inability to find quality staff with the right skills to be their biggest barrier to growth, with 5% unable to fill vacancies.” \nEEF’s manufacturing outlook survey for the fourth quarter shows output across the North East increased significantly, with orders picking up significantly both in the UK and abroad. \nThe mood of optimism amongst North East manufacturers has boosted business confidence to its highest ever level and is the second highest of any UK region, EEF said. \nRichard Halstead, the organisation’s director of member engagement in the North, said: “Stronger global growth has cemented the foundations for growth in manufacturing this year, but the sector’s contribution to the UK economy has been greater than most expected. Not only have we seen consistently positive survey responses in each quarter this year, but growth has been evident across all industry segments and UK regions in 2017. \n“There is some confidence that this momentum will carry into 2018, but as we head towards the Brexit end game we need manufacturing to produce the same trick of broad based growth again next year. \n“As we see more companies investing and capitalising on global growth, we’ve become more upbeat in our forecasts for the growth outlook. Government’s industrial strategy is now out of the starting blocks but it needs to maintain a steady pace on delivery of its policy commitments to anchor manufacturers’ growth and investment in the year ahead.” Like us on Facebook", "external_links": [], "published": "2017-12-04T02:01:00.000+02:00", "crawled": "2017-12-04T02:22:30.000+02:00", "highlightTitle": ""}