{"organizations": [], "uuid": "56b189300287a5140d188e128b26398b2c31f34f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article878068.ece/ALTERNATES/s1200/Wollaston5JPG.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/devon-mp-branded-traitor-daily-947738", "country": "GB", "title": "Devon MP branded a 'traitor' by the Daily Mail hits out at abuse that meant her staff had to be sent home", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-19T17:18:00.000+02:00", "replies_count": 0, "uuid": "56b189300287a5140d188e128b26398b2c31f34f"}, "author": "Guy Henderson", "url": "http://www.devonlive.com/news/devon-news/devon-mp-branded-traitor-daily-947738", "ord_in_thread": 0, "title": "Devon MP branded a 'traitor' by the Daily Mail hits out at abuse that meant her staff had to be sent home", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "wollaston", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}], "locations": [{"name": "wollaston", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}], "organizations": [{"name": "daily mail", "sentiment": "none"}, {"name": "news devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Devon MP branded a 'traitor' by the Daily Mail hits out at abuse that meant her staff had to be sent home 'Abuse and intimidation isn't just directed at those in public life, but at their families and those who work alongside them' Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTotnes MP Sarah Wollaston has hit back at callers who subjected her office staff to so much abuse after the Daily Mail called her a traitor that she had to send them home. Dr Wollaston was targeted on the front page of the tabloid newspaper after she joined Tory rebels to defeat the government in a vote on Brexit last week. \nThe newspaper pictured her on its front page and asked if she and the other rebels were 'proud of themselves'. It said the rebels were 'self-consumed malcontents' who had betrayed their leader and pulled the rug from under the EU Brexit negotiators. Sarah Wollaston on the Daily Mail front page today Read More Brexit rebel Sarah Wollaston hits back over 'self-consumed malcontent' headline \nDr Wollaston said the rebellion was about getting the best possible deal for the UK and handing power back to the UK parliament. However, she was on the receiving end of abuse for taking her stand. \nIn a Commons debate on Monday afternoon she paid tribute to her Totnes office staff and took aim at the critics. During the same debate, other MPs outlined some of the abusive messages they received over a wide range of issues. one said he had a fake bomb sent to him \nDr Wollaston said: \"Sadly, abuse and intimidation isn't just directed at those in public life, but at their families and those who work alongside them. Dr Sarah Wollaston Devon MP described as a ‘self-consumed malcontent’ after disagreeing with PM over Brexit \n\"We must pay tribute to out amazing teams in our constituency offices who deal with people with unfailing courtesy and respect. \n\"I think it's a great shame that after I got targeted as a traitor by organisations like the Daily Mail, the extent of the abusive calls was so great that I had to ask them to work from home. \n\"When you listen to this stuff, it is totally shocking and unacceptable.\" Like us on Facebook", "external_links": [], "published": "2017-12-19T17:18:00.000+02:00", "crawled": "2017-12-19T17:45:29.007+02:00", "highlightTitle": ""}