{"organizations": [], "uuid": "cf9cb277afc1f6cd62ee9c4163115e23d8f0cf70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article861732.ece/ALTERNATES/s1200/Neil-Parish-MP-and-EFRA-Chairman-speaks-about-British-Wool.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/sheep-farmers-play-essential-role-861745", "country": "GB", "title": "Sheep and farmers play essential role in maintaining the fabric of the UK countryside says MP", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-01T13:50:00.000+02:00", "replies_count": 0, "uuid": "cf9cb277afc1f6cd62ee9c4163115e23d8f0cf70"}, "author": "Lewis Clarke", "url": "http://www.devonlive.com/news/devon-news/sheep-farmers-play-essential-role-861745", "ord_in_thread": 0, "title": "Sheep and farmers play essential role in maintaining the fabric of the UK countryside says MP", "locations": [], "entities": {"persons": [{"name": "neil p", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}, {"name": "parish", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "zimbabwe", "sentiment": "none"}], "organizations": [{"name": "tiverton & honiton", "sentiment": "none"}, {"name": "food & rural affairs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sheep and farmers play essential role in maintaining the fabric of the UK countryside says MP Neil Parish was keynote speaker at the British Wool's national conference earlier this month Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTiverton MP Neil Parish has spoken about the essential role sheep and farmers play in maintaining the fabric of the UK’s countryside. \nThe Tiverton & Honiton MP and Chairman of the Environment, Food & Rural Affairs (EFRA) committee, was keynote speaker of the British Wool’s national conference earlier this month. \nWell recognised as a strong voice for the countryside, Mr Parish was a farmer in his native Somerset before entering politics, and still lives on the family farm. Addressing the conference, Mr Parish also answered a range of questions about the future of the industry post Brexit. Read More Devon MP urged to monitor 'free and fair' Zimbabwe elections by Boris Johnson \nOn post Brexit support measures, Mr Parish said: “It’s very important for the British public to realise that our landscape is managed by farmers. Sheep do a fantastic job of maintaining grassland, and our farmers must continue to be supported appropriately. \n“This could involve actions which help sheep farming become more competitive, or some form of grassland payment to keep sheep grazing. We must also be determined to ensure support reaches the right people – the farmer rather than the landowner.” \nMr Parish went onto to discuss what the British agricultural policy post-Brexit could look like. \n“It will be a British agricultural policy and then I see parts of that policy being devolved,” He went on to stress the importance of certain parts of the policy such as payments being similar to avoid “creating too much competition on the borders.” Read More How much did your MP claim in expenses for rent, hotels and travel? \nMr Parish concluded by saying: “I’m very impressed with what’s been happening at British Wool, there has been a new management team put in place, its leaner and looking towards the consumer to make sure we can promote British wool carpets, insulation and garments.” Like us on Facebook ", "external_links": [], "published": "2017-12-01T13:50:00.000+02:00", "crawled": "2017-12-01T14:03:02.007+02:00", "highlightTitle": ""}