{"organizations": [], "uuid": "c912e9186c0e9dd9f7da9da17a1487c6b2c2faa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13992027.ece/ALTERNATES/s1200/CFR_NJL_180917innovation_01JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/15bn-construction-planned-north-east-13991945", "country": "GB", "domain_rank": 21960, "title": "£15bn of construction planned for North East - but skills shortage could hamper progress", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-04T18:00:00.000+02:00", "replies_count": 0, "uuid": "c912e9186c0e9dd9f7da9da17a1487c6b2c2faa5"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/15bn-construction-planned-north-east-13991945", "ord_in_thread": 0, "title": "£15bn of construction planned for North East - but skills shortage could hamper progress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An aerial view of Science Central, Newcastle (Image: Newcastle City Council) Share Get business   Thank you for subscribing!   \nAround £15bn worth of regional construction projects could be put in jeopardy by an acute skills shortage, sector leaders have warned. \nResearch reveals a bumper pipeline of projects set to unfold across the North East over the next five years, with new housing an infrastructure schemes leading the way. \nBut the study, by the Construction Industry Training Board (CITB) in conjunction with the North East Local Enterprise Partnership, finds that skills needs could hold back progress. \nThe report is based on a detailed analysis of existing planning application but anticipates that the total volume of work will substantially increase as more applications are submitted over the five year period \nThe greatest activity will be in infrastructure and new housing, with construction totting up to £709m and £574m, respectively. \nAlongside major works such as the Science Central hub in Newcastle and the International Advanced Manufacturing Park (IAMP) in Sunderland, more than 184 new housing projects are scheduled throughout the area up to 2021, one alone which will bring forward in excess of 1,000 new homes at the new Vaux Village on the old brewery site in Sunderland. Work starts on the former Vaux brewery site in Sunderland (Image: Newcastle Chronicle) \nYet crucially, the research identifies current and future skills gaps in the region and examines the scope of construction training on offer in the North East LEP area, with several roles at risk of a shortfall of workers, including carpenters, electricians, plumbers and painters and decorators. \nJeremy Wright, partnerships manager for the North East at CITB, said: “This research clearly shows there’s a great deal of important construction work planned for the area over the next few years. \n“While overall output in the North East is expected to decline, the volume of activity is still impressive but that presents challenges when it comes to getting the right skills in place. \n“This research will be useful for the industry, training providers and local government to work together on a series of interventions to help narrow current and anticipated skills gaps. We want to avoid a situation whereby skills shortages are causing delays to any of these exciting projects.” Read More Multimillion-pound project aims to create 6,000 new jobs in the North East \nMichelle Rainbow, skills director for the North East Local Enterprise Partnership , said: “Construction is a hugely important industry for the North East. There are over 70,000 construction employees in our area alone, many of whom work for small businesses that contribute enormously to the local economy. \n“CITB’s research gives us a good overview of activity for the next few years which will help give confidence to the market. The North East LEP and the region as a whole is doing a lot of work to address skills shortages and ensure our workforce, both young and old, are equipped with the skills employers need. Read More One in four North East exporters are failing to plan for Brexit, report shows \n“We’re improving careers advice and guidance for school children across the region as part of North East Ambition and we’re ensuring our older workforce have the opportunity to learn new skills to adapt to the labour market. \n“By working in partnership with the business community we’re able to support schools, universities and other education providers to match the needs of industry and deliver a skilled workforce.” Like us on Facebook", "external_links": [], "published": "2017-12-04T18:00:00.000+02:00", "crawled": "2017-12-04T18:13:12.004+02:00", "highlightTitle": ""}