{"organizations": [], "uuid": "ea5909d90968725071b72cd4f8080e61370345e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13947240.ece/ALTERNATES/s1200/Sean-Sneddon.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/devolution-one-step-closer-newcastle-14025203", "country": "GB", "domain_rank": 21960, "title": "Devolution one step closer: Newcastle and North Tyneside cabinets give North of Tyne plan go-ahead", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-11T23:00:00.000+02:00", "replies_count": 0, "uuid": "ea5909d90968725071b72cd4f8080e61370345e8"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/devolution-one-step-closer-newcastle-14025203", "ord_in_thread": 0, "title": "Devolution one step closer: Newcastle and North Tyneside cabinets give North of Tyne plan go-ahead", "locations": [], "entities": {"persons": [{"name": "north of tyne", "sentiment": "negative"}, {"name": "peter alan jackson", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "norma redfearn", "sentiment": "none"}], "locations": [{"name": "neca", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "northumberland council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "north east local enterprise partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who could be the first North East Mayor? \nThe move will trigger a formal public consultation on the move, which will start this week and is set to come to an end at the start of February. \nDepending on the outcome of that consultation, as well as agreement from national Government, Newcastle’s council cabinet were told that the new Northern combined authority would be set up around summer 2018. \nAs part of the devolution deal, the North of the Tyne authorities would be headed up by an elected mayor, who would also have influence on a national level in issues such as Brexit. Nick Forbes, leader of Newcastle City Council, Norma Redfearn, directly-elected Mayor of North Tyneside and Councillor Peter Alan Jackson, leader of Northumberland Council (Image: Newcastle Chronicle) \nOn the creation of the new authority, an interim mayor would be appointed, holding some, but not all, of the powers of an elected mayor, with elections likely to be held in May 2019. \nThe deal is set to give the councils direct control of money for housing, improving education, and schemes for business improvement and job creation. \nNick Forbes, leader of Newcastle City Council , told his cabinet: “I think this is an extremely good first deal, I think it represents a very encouraging step forward for the region and I think it’s a great opportunity for us to start shaping our future.” Read More \nAccording to reports seen by the cabinets, the new authority would continue to “collaborate” with the smaller NECA, through a proposed joint transport committee and the North East Local Enterprise Partnership, which will be maintained. \nThe report argues that the new £600m devolution deal will benefit the Southern authorities as well. \nIt’s estimated that 25% of the predicted 10,000 jobs created by the agreement will be taken up by residents of the authorities outside the deal. \nAt the moment, it remains unclear how the remaining members of NECA will respond to the three councils’ attempt to leave the group. Read More North of Tyne devolution: why are we not having a local referendum? \nIn a joint statement, the four southern authorities responded to questions about their position on the deal by saying: “Our ambition to provide the best possible conditions to boost growth across the North East remains. \n“All local authorities across the region will continue to work together to create more jobs, investment and increase living standards, ensuring the North East is an excellent location to do business, live and prosper.” Like us on Facebook", "external_links": [], "published": "2017-12-11T23:00:00.000+02:00", "crawled": "2017-12-11T23:25:49.015+02:00", "highlightTitle": ""}