{"organizations": [], "uuid": "c7a194782e835aa0a2f3e1829caabaef6a4c5ec3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14069416.ece/ALTERNATES/s1200/Equiwatts-Powercapsule.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-firm-says-pay-customers-14069279", "country": "GB", "domain_rank": 21960, "title": "Newcastle firm says it will to pay customers hundreds - for turning off their kettle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-21T18:35:00.000+02:00", "replies_count": 0, "uuid": "c7a194782e835aa0a2f3e1829caabaef6a4c5ec3"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-firm-says-pay-customers-14069279", "ord_in_thread": 0, "title": "Newcastle firm says it will to pay customers hundreds - for turning off their kettle", "locations": [], "entities": {"persons": [{"name": "johnson fernandes", "sentiment": "none"}, {"name": "ravneed kaur", "sentiment": "none"}, {"name": "fernandes", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "national grid", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "equiwatt", "sentiment": "none"}, {"name": "eu jeremie", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business   Thank you for subscribing!   \nA Newcastle tech firm is planning to pay people up to £600 a year simply by cutting down on their electricity usage. \nStart-up company Equiwatt has developed a “smart plug” device that will switch off household appliances for a few minutes, relieving pressure on the National Grid. \nDuring peak periods of electricity consumption the National Grid is forced to activate expensive stand-by power plants to meet the nation’s needs. To avoid having to do this energy providers offer cash incentives to people who reduce their power usage between 6pm and 9pm. Read More £120m boost for North East as EU Jeremie fund set to go live following Brexit delay \nEquiwatt combines a smart plug with its own artificial intelligence software to automatically switch off its customer’s household devices, allowing them to earn cash. \nThe company was founded by entrepreneur Johnson Fernandes and Ravneed Kaur, who came up with the idea while studying post graduate degrees at Newcastle University. \nMr Fernandes said: “Our users could earn anywhere between £100 and £600 a year by participating in our services. So £100 would be the minimum they would earn with the start up kit, and with every appliance that they add they could earn a max of £600 per year. Johnson Fernandes and Ravneed Kaur, co-founders of Equiwatt (Image: Unknown) \n“Currently we are trialling with our customers to find out the best way to make the payments. What we are doing right now is rewarding them with points which they can cash out or they can exchange for vouchers. \n“In the future, depending on the association with their energy suppliers, we will also offer them a reduction in their energy bill as well.” \nThe device can be used to automatically turn off kettles, washing machines and dishwashers. \nEquiwatt’s starter-kit can currently only be connected to one device at a time. However, it can also be linked to smart meters to generate more information about the total energy being used in the customer’s home. \nThe venture has gained support from a number of the region’s top energy experts with Prof Alan Lowdon, the chairman of North East LEP’s innovation board, and Prof Phil Taylor, director of engineering at Newcastle University, both sitting on Equiwatt’s advisory board. Read More Toys R Us latest - deal to save the retailer looks to have been agreed \nThe company is currently trialling its product across 50 households in the North East but is expecting to increase this to 100 over the next three months. Equiwatt is then looking to grow its trial scheme further to receive more accurate results. \nMr Fernandes added: “The trials are going great. We have got fabulous results in that we are able to provide subsecond response in terms of reduction of an energy load. This criteria meets the balancing needs of the National Grid. \n“We are in talks with the industry’s energy networks, as well as energy suppliers, and we are looking to scale this pilot up to 2,00 houses depending on how it works for us.” Like us on Facebook", "external_links": [], "published": "2017-12-21T18:35:00.000+02:00", "crawled": "2017-12-21T19:42:25.018+02:00", "highlightTitle": ""}