{"organizations": [], "uuid": "4ef016a9e306c53d241ea654e8c5200204447d67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13499263.ece/ALTERNATES/s1200/TMP_NEC_310317DurhamBuildings02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/local-news/durham-traffic-police-incident-live-14036183", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Emergency services attending incident at Milburngate building site in Durham", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-14T08:30:00.000+02:00", "replies_count": 0, "uuid": "4ef016a9e306c53d241ea654e8c5200204447d67"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/durham-traffic-police-incident-live-14036183", "ord_in_thread": 0, "title": "North East news LIVE: Emergency services attending incident at Milburngate building site in Durham", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Weekend weather forecast \nLast weekend saw the North East dusted with a coating of snow, and the icy conditions continued through much of the week — but what will this weekend’s weather have in store? \nAs it stands, there is a weather warning for ice in the North East until 11am on Friday morning, when temperatures are set to rise. \nAfter a rainy Friday morning, the Met Office is forecasting a drier afternoon, with temperatures reaching between 5°C. \nSaturday is set to be the sunniest day of the weekend, albeit with temperatures remaining stubbornly low throughout the day. \nDespite the mercury expected to be hovering around the 0°C mark overnight, a mostly-coudy Sunday will feel a lot warmer as the day progresses, reaching highs of 9°C by the evening, \nHere is what the Met Office have forecast, in their own words: \nFriday: \nBrisk northerly winds will bring showers and sunny spells, these showers wintry on hills, but less cold near coasts. Becoming mainly dry later. A widespread frost will form overnight. Maximum temperature 7 °C. \nOutlook for Saturday to Monday: \nEarly frost. Often dry, bright on Saturday, but possible wintry flurries on Pennines. \nOvernight frost, then becoming less cold with rain and strengthening winds on Sunday. Dry, bright on Monday. Durham Video of the building site \nWe have some footage from the Gates building site, where the incident occurred: James Cook Hospital KEY EVENT Man taken to Major Trauma Unit \nParamedics took the injured man to the Major Trauma Unit at the James Cook Hospital in Middlesbrough. \nThe extent of his injuries are not yet known, but Durham Constabulary don’t believe them to be life threatening. \nAn ambulance spokeswoman said: \n“We got a call to say that someone had fallen from scaffolding in the Milburngate area of Durham. \n“We dispatched one ambulance, a hazardous area response team and a rapid response vehicle. \n“The patient was taken to the Major Trauma Unit at James Cook Hospital in Middlesbrough. \n“We requested support from the air ambulance but ended up taking the patient to hospital by regular ambulance.” \nI should note that there is now some conflict arising between what the man is believed to have fallen from. The police statement said it was a ladder, while the report to the North East Ambulance Service said it was scaffolding. 10:45 Where did it happen? \nThe man fell while on a building site in the Gates development. \nThe construction site is where the incident happened is the former Gates shopping centre, off North Road, that is set to be relaunched as Riverwalk. Milburngate KEY EVENT Man in hospital after falling from ladder \nA man has been taken to hospital after falling from a ladder on a Durham building site, police have revealed. \nEmergency services were called to the scene after the accident, which happened shortly before 9am on the construction site at the Gates in the city centre. \nA Durham Police spokeswoman said: \nAt around 8:50am this morning police received reports that a male had fallen from a ladder at The Gates Building Site, Milburngate, Durham. \nThe male was taken to hospital, however it is believed he does not have life threatening injuries. Durham Incident at a Durham building site \nEmergency services have been at a building site in Durham city centre. \nWe will have more information very shortly. Newcastle Tom Eden Christmas at the Cathedral \nBrassed Off star Stephen Tompkinson delighted audiences with a Geordie take on the Nativity as part of the sixth annual Christmas in the Cathedral concert. \nThe Teesside-born actor was part of a packed lineup for the event in Newcastle’s St Nicholas’ Cathedral , held in aid of The Sir Bobby Robson Foundation. \nA sell-out crowd filled the historic building on Wednesday for an evening of festive songs, readings and comedy sketches, produced by Lindisfarne drummer Ray Laidlaw and hosted by fellow band member Billy Mitchell. \nThis year they were treated to performances from the Swing Bridge Singers, the Shoe Shop Quartet and. The Voice contestant, Melissa Cavanagh, who performed a rendition of Christmas classic Fairytale of New York with The Caffreys. \nThe audience was also shown a film about the work of the Foundation, and given a reading by Professor Ruth Plummer, who treated Sir Bobby as he faced cancer for the fifth and final time. \nStephen Tompkinson took part in the Geordie Nativity production alongside a host of North East actors and performers including Joe Caffrey, Gavin Webster, Viktoria Kay, Harriett Ghost, Micky McGregor and Scott Tyrell. Mike Ashley KEY EVENT Sports Direct's profits plunge \nMike Ashley’s Sports Direct has seen half year profits dented as the retailer flagged that sales in the UK fell following store closures, reduced online promotions and as a result of the Brexit hit pound. (Image: PA) \nThe retailer said that statutory pre-tax profits plunged 67.3% to £45.8 million in the 26 weeks to October 29, which Mr Ashley put down to “fair value adjustments and transitional factors such as the disposal of assets”. \nLast year’s profits were also flattered by the sale of a chunk of shares in rival JD Sports. \nUK retail sales fell by 1.4%, mainly due to reduced online promotional activity, store closures and the weak pound pushing costs up. \nThe tycoon, who also owns Newcastle United, is attempting to reposition the store estate, which he claimed is delivering “spectacular” results. \nHe said: \n“Our high street elevation strategy is currently delivering spectacular trading performance within our flagship stores. We intend to open between 10 and 20 new flagship stores next year. \n“Whilst our reported profit before tax has been impacted by fair value adjustments and transitional factors such as the disposal of assets in 2017; our underlying profit before tax remains healthy.” \nOn an underlying basis, pre-tax profit rose 22.9% to £88 million and sales were up 4.7% to £1.7 billion. \nThe firm said that it expects underlying earnings growth for the full year to come within its forecast range of 5% to 15%. \nShares fell nearly 8% in morning trading to 353.3p following the update. \nLast year the retailer was hit after failing to hedge against the fall in the value of the pound in the immediate aftermath of the EU referendum, leading to a collapse in profits. \nIt said in its latest trading update that it signed long-term forward hedging contracts in October.", "external_links": [], "published": "2017-12-14T08:30:00.000+02:00", "crawled": "2017-12-14T12:41:00.000+02:00", "highlightTitle": ""}