{"organizations": [], "uuid": "5aba50c13ab40f813e5617d5da1950e93cf7f064", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14056890.ece/ALTERNATES/s1200/JS87537814.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-could-cost-north-east-14056622", "country": "GB", "domain_rank": 21960, "title": "Brexit could cost North East economy £600m, new study reveals", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-19T13:39:00.000+02:00", "replies_count": 0, "uuid": "5aba50c13ab40f813e5617d5da1950e93cf7f064"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-could-cost-north-east-14056622", "ord_in_thread": 0, "title": "Brexit could cost North East economy £600m, new study reveals", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "birmingham university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Brexit could cost North East economy £600m, new study reveals Areas that voted for Brexit most likely to be economically hit by leaving the EU, research by Birmingham University says Share Supporters react as Boris Johnson delivers a speech at a 'Vote Leave' rally at the Centre for Life during the referendum campaign Share Get business   Thank you for subscribing!   \nMore than £600m of the North East’s economy is at risk from Brexit , a new study has found. \nThe research from Birmingham University found that the UK is almost five times more exposed than the rest of the EU to negative economic impacts from disruptions to trade caused by Brexit, putting Britain in “a very weak bargaining position” as talks on the future relationship get under way. \nAnd regions like the North East which voted Leave in last year’s referendum are among the most vulnerable to an economic hit to their incomes and growth rates. \nThe study found that 12% of the North East’s GDP - around £607m - is at risk from Brexit, with the region’s manufacturing sector particularly vulnerable, with 35.5% exposed to economic harm. \nThe researchers said their findings show it is “not correct” to argue, as many Brexit-backers do, that Britain’s trade deficit with the rest of the EU gives it an advantage in negotiations. \nTheir analysis of trade relationships found a “very different” picture, under which the loss of access to the single market and customs union is “far more damaging” to the UK than the EU27 . Read More Tottenham Hotspur call in Tyneside bed specialists Mammoth Mattresses to help players \nThe report says: “The UK and its regions are far more vulnerable to trade-related risks of Brexit than other EU member states and their regions. As such, the UK is far more dependent on a relatively seamless and comprehensive free trade deal than the other EU member states. \n“Mercantilist arguments popular in the UK media, which posit that the UK trade deficit with the rest of Europe implies that on economic grounds other EU member states will be eager to agree a free trade deal with the UK, are not correct. \n“The UK’s exposure to Brexit is some 4.6 times greater than that of the rest of other EU as a whole, and the UK regions are far more exposed to Brexit risks than regions in other EU countries, except for those in Ireland. \n“As such, in all likelihood the potential impacts of either no deal between the UK and the EU or a bad deal, whereby the UK’s access to the single market and the customs union is heavily curtailed, are far more damaging for the UK than for the rest of the EU.” \nOverall, the results show that 2.64% of EU GDP is at risk because of Brexit trade-related consequences. In the UK, Brexit trade-related risks account for 12.2% of UK GDP, said the report. Read More Blyth businesses called on to set up group to improve the town's economy \nAnd the researchers warned that their analysis “may not represent an upper bound, and that the actual Brexit-related exposure risks facing the UK and its regions are even greater”. \nIreland is the only one of the EU27 facing similar risks to the least-affected UK regions, with exposure in the order of 10% of GDP due to its long-standing trade integration with the UK. \nBut elsewhere in Europe, Germany has the highest exposure level at 5.5% of GDP, followed by the Netherlands (4.4%), Belgium (3.5%) and France (2.2%). Other EU nations - with the exception of tiny Malta (5.1%) - face “almost no exposure at all”, with southern European states like Italy, Spain and Greece barely affected. \nThe report by the university’s city region economic and development institute (City-Redi) was published in academic journal Papers in Regional Science. Like us on Facebook", "external_links": [], "published": "2017-12-19T13:39:00.000+02:00", "crawled": "2017-12-19T15:08:23.000+02:00", "highlightTitle": ""}