{"organizations": [], "uuid": "460e8ce964a7f35958d1e12495f543d2a1c4624c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13117760.ece/ALTERNATES/s1200/SMR_NEC_200117BiggMarket_02.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/new-dawn-newcastle-see-how-14096988", "country": "GB", "domain_rank": 21960, "title": "A new dawn for Newcastle? See how the city centre will be transformed in the coming year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-31T15:00:00.000+02:00", "replies_count": 0, "uuid": "460e8ce964a7f35958d1e12495f543d2a1c4624c"}, "author": "Kathryn Riddell", "url": "http://www.chroniclelive.co.uk/news/north-east-news/new-dawn-newcastle-see-how-14096988", "ord_in_thread": 0, "title": "A new dawn for Newcastle? See how the city centre will be transformed in the coming year", "locations": [], "entities": {"persons": [{"name": "stephen patterson", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "neutral"}, {"name": "ne1 ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News A new dawn for Newcastle? See how the city centre will be transformed in the coming year What can we look forward to opening to the public over the course of the New Year? Take a look here at our guide Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA new year brings a new look to the city centre in Newcastle . \nSeveral projects and building works have been under way for months but are now nearing completion. \nSome of the schemes will be ready a matter of weeks into the new year and others will be ready to open to the public in the following months. \nThey range from a massive city centre regeneration to the reopening of old favourites. \nStephen Patterson, director of communications at NE1 Ltd, said: “2018 is going to be a pivotal and an exciting year for Newcastle – not only with the Great Exhibition of the North – but with substantial property and commercial developments happening across the city. \n“It is reassuring to see that the regeneration continues across the whole city, not just in isolated pockets. \n“Newcastle is an ambitious city with a bright future and it is hugely encouraging in the post-Brexit world in which we live, to see the city continuing to attract investment and developments which will create jobs across the city in a wide range of sectors.” \nHere, we took a look at the exciting projects which are due to be completed in 2018. Transformation of Northumberland Street and Blackett Street Newcastle city centre improvements: artists' impressions (Image: Newcastle City Council) \nAmbitious plans to transform the heart of Newcastle city centre could begin in the coming year. \nNewcastle City Council plans to spend an initial £3m to improve the area around Northumberland Street, which attracts 13 million visitors a year and supports hundreds of jobs. \nBlackett Street, currently a route for buses and taxis near the Monument, would also be closed to traffic. \nThe council’s cabinet has already backed the proposals with further consultation due to take place. \nIf approved, it is hoped the first of the changes will be completed in time for this summer’s Great Exhibition of the North. Read More Bigg Market revamp NE1's vision for the Bigg Market (Image: NE1) \nThe street which is synonymous with a cheap night out is set to be redesigned into a four-level terrace with space made suitable for market stalls and street furniture. \nThe Heritage Lottery Fund backed ambitious plans to transform the site, which includes 31 listed buildings, back in 2015. \nWork is due to start early in the New Year with the changes to the street to be completed by summer. Newcastle Turkish Baths How the new Newcastle City Pool and Turkish Baths will look on reopening in 2018 \nNewcastle City Pool and Turkish Baths closed in 2013 after first opening in 1928. \nThe grade II-listed building is due to reopen to the public in spring after Fusion Lifestyle was granted a lease by Newcastle City Council to redevelop the site. \nThe company has been busy restoring and updating the leisure facility to make it fit for 21st century use. \nThe redevelopment will bring the pool and Turkish Baths back into operation, as well as seeing the introduction of a new spa, treatment rooms, fitness suite, exercise studios and café. City centre garden How the park around the Stephenson Monument will look (Image: Newcastle City Council) \nWork to create a city centre garden outside the Union Rooms pub got under way in October. \nThe area around the Stephenson Monument, near to Central Station, is set to be transformed into a ‘pocket garden’ with greenery and benches. \nThe road has been paved outside the pub and flower beds and benches are expected to be installed in January. Newgate Court student accommodation A CGI of how the Maldron Hotel will look in Newcastle \nThe old Newgate shopping centre has been demolished to make way for a £100m development including 575 students flats, a hotel and 20,000 square foot retail space. \nThe city centre site, bounded by Grainger Street, Clayton Street and Falconer’s Court, is being redeveloped by McAleer and Rushe. \nDemolition of the Newgate began in May 2015 and now the shape of the four-star Maldron hotel is rising in its place. Read More Then and now: Newcastle's Newgate Street - one of the city's oldest main routes \nNewgate Court, a 575-bed student accommodation block, will be ready for students to move in for the new academic year in September. \nHowever we will have a little longer to wait for the new hotel which is now set to open in 2019. Like us on Facebook ", "external_links": [], "published": "2017-12-31T15:00:00.000+02:00", "crawled": "2017-12-31T15:28:59.009+02:00", "highlightTitle": ""}