{"organizations": [], "uuid": "512ff167ab8245a3e35801725e1e005a710b1d5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13594201.ece/ALTERNATES/s1200/Theresa-May-Holds-First-PMQs-Since-The-Summer-Recess.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-chief-says-government-not-14006714", "country": "GB", "domain_rank": 21960, "title": "Brexit chief says Government did NOT study impact of Brexit on sectors of the economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-08T07:00:00.000+02:00", "replies_count": 0, "uuid": "512ff167ab8245a3e35801725e1e005a710b1d5e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-chief-says-government-not-14006714", "ord_in_thread": 0, "title": "Brexit chief says Government did NOT study impact of Brexit on sectors of the economy", "locations": [], "entities": {"persons": [{"name": "hilary benn", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "news brexit", "sentiment": "negative"}, {"name": "commons treasury committee", "sentiment": "none"}, {"name": "treasury committee", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union committee", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "the treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Brexit chief says Government did NOT study impact of Brexit on sectors of the economy Brexit Secretary David Davis says there are no 'impact assessments' showing what Brexit could do to the economy Share British Chancellor of the Exchequer Philip Hammond (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBrexit Secretary David Davis has told MPs that the Government has NOT studied the impact of Brexit on different sectors of the economy. \nAnd it came as a shock - because he’d previously given the impression the work had been carried out. \nBut he wasn’t the only one. \nChancellor Philip Hammond has also told MPs that Brexit studies exist. \nHe said the Treasury had looked at the “sectoral impacts” of Brexit to examine how it would affect different parts of the economy. And this included looking at what would happen under “a wide range of scenarios”, such as different customs arrangements. \nAnd that raises some awkward questions. \nDid they both somehow get it wrong? Or is it possible that the Department for Exiting the European Union, led by Mr Davis, does not possess the findings of these studies - but the Treasury does? What did Mr Davis say originally? \nOn September 5 2016, Mr Davis told the House of Commons: “My officials, supported by officials across Government, are carrying out programme of sectoral analysis and regulatory analysis, which will identify the key factors for some 50 sectors of British business. It is extremely important that the House understands that. \n“We are building a detailed understanding of how the withdrawal from the EU will affect domestic policies, to seize opportunities and ensure a smooth process of exit.” \nAnd on 2 February 2017 he said: “We continue to analyse the impact of our exit across the breadth of the UK economy, covering more than 50 sectors - I think it was 58 at the last count - to shape our negotiating position.” \nThe Brexit Secretary made similar statements on a number of other occasions. Read More Victim of Operation Sanctuary sex abuse ring is denied compensation due to conviction What does Mr Davis say now? \nOn Wednesday 7 December 2017, Mr Davis told the Commons Exiting the European Union Committee: “There’s nothing ... there’s no such systematic impact assessments that I’m aware of.” \nCommittee chairman Hilary Benn asked him: “So, there isn’t one on the automotive sector?” \nThe Brexit Secretary said: “Not that I’m aware of.” \nAnd asked whether there was an assessment for aerospace or financial services, he said: “The answer is going to be ‘no’ for all of them.” What did Mr Hammond say? \nMr Hammond told the Commons Treasury Committee on 11 October 2017 that the Treasury had a “model” which looked at the impact of “different scenarios” on “different parts of the economy”. \nWhat he described sounded very similar to the work Mr Davis now claims doesn’t exist. \nHe said: “The Treasury is working with DExEU [Department for Exiting the European Union], DIT [Department for International Trade] and the Home Office on a cross-departmental model to look to model different scenarios. \n“It is a wholly new model that has been built to do that. It is ongoing work that is continually being refined.” \nHe added: “The model has the capability to look at countries and sectors.” \nAnd he told MPs: “This is a model that looks at impacts on different parts of our economy, on different economies of the EU 27, and on sectors of economies in the EU 27.” \nMr Hammond later confirmed that this included looking at the impact of Brexit on different sectors of the economy. \nHe said: “As I said earlier, we have a model that can look at sectoral impacts, as well as impacts on bilateral trade pairings with different countries.” Read More Could strike action be on the cards? Fury over pay cuts that have led to staff shortages \nAnd he added: “We are constantly using this model. It is not a single assessment; the model is a working tool. \n“We constantly use it to test different ideas and potential solutions. For example, output from that model will have informed some of the thinking that has gone into preparing the 14 papers that have been published.” \nMr Hammond also said the Treasury model considered the impact of different types of Brexit. This seemed to include considering what would happen if the UK retained some sort of customs union with the EU or not. \nHe said: “We look at a wide range of scenarios, but obviously, again, you have to make an assumption about what the regime at the border would be before you can weigh up costs and benefits.” \nThis doesn’t necessarily mean the Treasury has produced distinct reports setting out the impact on different sectors of the economy. There may not be a report about the automotive sector, a separate report about aerospace and so on. \nBut it has done the work and produced what Mr Hammond called “outputs”. That’s if the Chancellor got his facts right when he gave evidence to Treasury Committee, which of course we must assume he did. \nSo the Treasury has the information in some form. And presumably is capable of sharing this information, if it wishes. Like us on Facebook", "external_links": [], "published": "2017-12-08T07:00:00.000+02:00", "crawled": "2017-12-08T07:21:55.002+02:00", "highlightTitle": ""}