{"organizations": [], "uuid": "d1396bc5d29f29c618b73d8ea75ad5ade61294a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.lincolnshirelive.co.uk/incoming/article593237.ece/ALTERNATES/s1200/124759469.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/whats-on/food-drink/cheese-could-cause-sickness-diarrhoea-964210", "country": "GB", "domain_rank": 48128, "title": "Cheese which could cause sickness and diarrhoea pulled from sale", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-22T11:32:00.000+02:00", "replies_count": 0, "uuid": "d1396bc5d29f29c618b73d8ea75ad5ade61294a6"}, "author": "Isaac Ashe", "url": "http://www.leicestermercury.co.uk/whats-on/food-drink/cheese-could-cause-sickness-diarrhoea-964210", "ord_in_thread": 0, "title": "Cheese which could cause sickness and diarrhoea pulled from sale", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [], "organizations": [{"name": "food standards agency", "sentiment": "none"}, {"name": "fsa", "sentiment": "none"}, {"name": "dunsyre blue", "sentiment": "none"}, {"name": "tastyart ltd rob white/ getty images", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cheese which could cause sickness and diarrhoea pulled from sale In some cases it could cause much more serious illness too Share A cheese board (Image: Tastyart Ltd Rob White/ Getty Images) Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTime to check your Christmas cheese selection - an urgent recall has been made over a blue cheese which could cause serious illness. \nThe Food Standards Agency is urging people not to eat Dunsyre Blue cheese, as it has been found to contain listeria. \nIssuing an urgent recall, the FSA said: \"Symptoms caused by this organism can be similar to flu and include high temperature, muscle ache or pain, chills, feeling or being sick and diarrhoea. Read More Blue British passports to be brought in after Brexit \n\"However, in rare cases, the infection can be more severe, causing serious complications, such as meningitis. \n\"Some people are more vulnerable to listeria infections, including those over 65 years of age, pregnant women and their unborn babies, babies less than one month old and people with weakened immune systems.\" \nThe affected product is the Dunsure Blue range produced by Errington Cheese Ltd with a batch code of J9. All sizes and use by dates are potentially dangerous. (Image: Errington Cheese Ltd) \nA spokesman for Errington Cheese said: \"Routine customer testing has identified Listeria Monocytogenes in a sample of pasteurised Dunsyre Blue. \n\"We have therefore taken the decision to recall this batch on a precautionary basis, please do not consume it. Read More The tell-tale signs police use to spot drink drivers \n\"As a precautionary measure if you have purchased Dunsyre Blue with a batch code of J9 on the label on the base of the cheese please dispose of it and contact us on enquiries@erringtoncheese.co.uk or telephone 01899 810 257 and we will arrange a refund. \n\"We are very sorry for the inconvenience caused.\" Like us on Facebook ", "external_links": [], "published": "2017-12-22T11:32:00.000+02:00", "crawled": "2017-12-22T11:36:48.006+02:00", "highlightTitle": ""}