{"organizations": [], "uuid": "12f56da444caff01f1438332fc26491b1b7e9608", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13853835.ece/ALTERNATES/s1200/Farming-subsidies.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/farming/british-farming-2017-how-year-14092165", "country": "GB", "domain_rank": 21960, "title": "British farming 2017: How did the year shape up in your sector?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-29T15:56:00.000+02:00", "replies_count": 0, "uuid": "12f56da444caff01f1438332fc26491b1b7e9608"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/farming/british-farming-2017-how-year-14092165", "ord_in_thread": 0, "title": "British farming 2017: How did the year shape up in your sector?", "locations": [], "entities": {"persons": [{"name": "charles sercombe", "sentiment": "none"}], "locations": [{"name": "cumbria", "sentiment": "none"}, {"name": "langwathby", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}], "organizations": [{"name": "nfu", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Combine harvester in a field near Langwathby in Cumbria (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSupport from supermarkets has helped British farming enjoy a strong year, but the NFU has warned that more work needs to be done in the run up to Brexit. \nAfter suffering a turbulent 2016 the British farming sector has made a number of positive moves over the last 12 months, including winning the support of supermarkets and retailers. \nThe Co-op and Morrisons both made the decision to support the agricultural sector by only stocking British fresh lamb all year round. \nWhile the decision was hailed as a major success for the industry, officials from the NFU have reiterated concerns that a bad Brexit deal could have a devastating impact on sheep farmers. \nCharles Sercombe, livestock board chairman, said: “A failure to secure unfettered access to the European market would have huge implications for the red meat sector, lamb especially. \n“We will work with trade officials in the UK, Brussels and Geneva to articulate the importance of our closest market and ensure imports complement our domestic production. \n“The livestock board is clear that our sector needs a Domestic Agricultural Policy that recognises the benefits livestock farming delivers for the environment and rural communities, as well as being a great product.” \nHe added: “As we continue through Brexit negotiations, the future of our trading relationships and Domestic Agricultural Policy will be a key focus. \n“Alongside this, improving the market transparency of our deadweight outlets through greater levels of information, clearer market signals supported by more effective regulation, can all improve our returns and foster greater collaboration in the red meat supply chain.” \nBack at home, Mr Sercombe hailed the extension of the batch-reporting exemption for sheep movements within keepership as a “huge win”. NFU livestock board chairman Charles Sercombe \nHe added that the changes would support the development of a livestock traceability service and could create a range of benefits to livestock producers and the supply chain. \nThe horticultural sector also benefitted from support from retailers after Tesco made a public commitment to uphold the principles of the NFU’s Fruit and Veg Pledge. \nThe organisation is now calling for Tesco to extend its sustainability farming groups across all fresh produce crops. \nNFU horticulture and potatoes board chair Ali Capper said that her focus during 2018 will be on convincing more retailers to make a public commitment to better business practice for their fresh produce suppliers. Read More Livestock feed company Herban UK Ltd eyes international growth \nLabour will continue to be a major issued for the horticultural sector throughout 2018, with Ms Capper adding that the Government needs to take action now to prevent low numbers of seasonal workers. \nShe said: “Labour is at the forefront of everyone’s mind. In 2017, the NFU reported labour shortages of almost 30% at their peak. Growers reported increased wage bills, higher turnover rates, crop wastage and inefficiencies in their business as a result. \n“The supply chain could face significant disruption in 2018 unless the UK Government takes action to prevent a shortfall of workers for agriculture. \n“The simplest measure would be a tried-and-tested seasonal agricultural workers scheme open to non-EU workers to top-up the access we have now to EU nationals. This message has been delivered loud and clear to government, and the industry is speaking with one voice.” NFU horticulture and potatoes vice chair, Ali Capper (Image: Publicity Pic) \nDairy farmers also saw business improve during 2017 after milk prices ended their slump and began to move steadily upwards. \nFarmers also benefited from the introduction of futures and forwards contracts, which help minimise risks. However, labour again continues to be a growing problem for dairy farmers. \nMichael Oakes, dairy board chairman at the NFU, said: “Alongside the day job, we’ve been raising the issues on dairy labour with MPs and the industry. I’ve never seen such a dearth of herdsmen in this country, and the story is the same across the EU. This is something government must act on immediately.” \nIn the poultry sector, the NFU prioritised helping its members that were caught up in the 13 AI (avian influenza) outbreaks. \nIt also worked to press Defra to lobby the EU to change the Free Range Egg Marketing Regulations, so producers can carry on marketing eggs as free range for 16 weeks after a compulsory housing order. \nGoing into 2018 the NFU is warning that oversupply in the egg sector is a “great concern”, and is encouraging sensible expansion. \nThe NFU is also urging crop growers to introduce new technology that can lower costs and make UK farms more competitive overseas. \nCrops board chairman Mike Hambly is also working with Defra to make the case for UK arable farming when it comes to future regulation, trade and domestic policy. \nMr Hambly added: “In the next year, the NFU combinable crops board will continue to focus on areas that we believe can make a real difference to members’ profit margins. Read More Vintage tractor sells in Northumberland for nearly £10,000 \n“We will continue our work for more competition in the fertiliser market, ensuring market access for UK crops in EU biofuel markets and other alternative uses. \n“We will also increase our engagement and work with the supply chain to ensure you, our members, are getting a fair deal.” \nThe sugar sector is also preparing for increased trade after the sugar quotas ended in September this year. Michael Sly, NFU sugar board chair, said the industry should now look to export competitively across the globe. \nHe said: “It is too early to say what the end of quotas will mean in the long term, but the industry definitely has a feeling of quiet optimism. \n“We are seeing record acreages being harvested this campaign, and this may be the first year that we have a 200-day campaign if the factories run as predicted until March 31. \n“The market is there for our home-grown sugars: we currently only supply 60% of the domestic market and are now in a position to compete in export markets across the world. Another vote of confidence came from Northern Sugar, which is looking at the feasibility of building a new sugar factory in the North of England.” Like us on Facebook", "external_links": [], "published": "2017-12-29T15:56:00.000+02:00", "crawled": "2017-12-29T16:03:38.004+02:00", "highlightTitle": ""}