{"organizations": [], "uuid": "9a0f35569fc61d41d6633ca0a8eb0897a99cbf34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article566817.ece/ALTERNATES/s1200/Nicky-Morgan.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/local-news/nicky-morgan-again-among-tory-924233", "country": "GB", "domain_rank": 48128, "title": "Nicky Morgan again among Tory rebels as Government loses Brexit vote", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-14T11:06:00.000+02:00", "replies_count": 0, "uuid": "9a0f35569fc61d41d6633ca0a8eb0897a99cbf34"}, "author": "Dan Martin", "url": "http://www.leicestermercury.co.uk/news/local-news/nicky-morgan-again-among-tory-924233", "ord_in_thread": 0, "title": "Nicky Morgan again among Tory rebels as Government loses Brexit vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nicky Morgan again among Tory rebels as Government loses Brexit vote The Government lost by 309 votes to 305 Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May will travel to a critical European Union summit with her authority diminished after Tory rebels inflicted a humiliating House of Commons defeat on the Government in a major Brexit vote. \nSome MPs proclaimed Parliament had \"taken back control\" of the Brexit process after they defeated the Government last night to ensure a \"meaningful vote\" on the withdrawal deal. Read More \nBackers of a \"soft\" Brexit, including Loughborough MP Nicky Morgan and Anna Soubry, have hailed the result. \nMs Morgan said: \"Tonight Parliament took control of the EU Withdrawal process\". Nicky Morgan \nThe Prime Minister will hope it does not damage the confidence of EU leaders in her authority to conduct Brexit negotiations as they prepare to rubber-stamp a move forward to trade talks. \nIn a night of high drama, rebel ringleader Dominic Grieve told the Government it was \"too late\" as ministers made last-minute concessions in an attempt to head off the revolt. \nHe saw his amendment to the EU (Withdrawal) Bill squeezed through the Commons on a majority of four amid tense scenes. Read More Pensioner killed in Leicester house fire described as 'Good Samaritan' \nIt means MPs and peers will be given more control over the Government's implementation of the withdrawal agreement, as ministers will have to pass a statute, which can be amended, before it takes effect. \nMrs May who attempted to reassert authority by sacking Tory vice chair and Brexit rebel Stephen Hammond, could face questions about the vote's implications at a dinner with the other 27 EU leaders on Thursday, who she will urge to begin trade talks as quickly as possible. EU Commission handout picture showing British Prime Minister Theresa May and EU President Jean-Claude Juncker at a press conference (Image: Etienne Ansotte/EU/PA Wire) \nThe European Commission's assessment that \"sufficient progress\" has been made on divorce issues to move Brexit negotiations on to their second phase gave the PM a huge boost just last week. Read More Rutland couple's warning after Christmas decorations spark huge fire \nAnd the EU27 are expected to green-light phase two when they meet in Mrs May's absence on the second day of their two-day summit in Brussels on Friday. \nBut the political capital she has built up was dealt a damaging blow by Thursday's vote, which led to bitter recriminations in the Conservative Party, with 11 MPs joining opposition parties in backing the amendment, and a handful of others abstaining. EU President Jean-Claude Juncker standing with British Prime Minister Theresa May at the EU Commission in Brussels (Image: Etienne Ansotte/EU/PA Wire) \nThe European Parliament's chief Brexit co-ordinator Guy Verhofstadt tweeted: \"British Parliament takes back control. European and British Parliament together will decide on the final agreement. Interests of the citizens will prevail over narrow party politics. A good day for democracy.\" \nLabour leader Jeremy Corbyn, who will be cheered by the fact that only two of his own Brexiteer MPs rebelled to back the Government, said: \"This defeat is a humiliating loss of authority for the Government on the eve of the European Council meeting. Read More Filthy chippy ordered to close after food poisoning allegations \n\"Theresa May has resisted democratic accountability. Her refusal to listen means she will now have to accept Parliament taking back control.\" \nMr Grieve said he had no option but to push his amendment to a vote because the Bill gave \"intransigent\" ministers \"the biggest Henry VIII power ever conferred on Government\" with no justification. \nThe former attorney general evoked Winston Churchill during the debate, telling the Commons: \"There's a time for everybody to stand up and be counted\" and stressing he put \"the country before the party\". \nHe said his amendment would not stop Brexit but the vote provoked a furious backlash from Leavers. Read More \nTory Nadine Dorries called for the deselection of rebel Tories for \"undermining the PM\", while accusing Mr Grieve of \"treachery\". \nBut rebel Tory Sarah Wollaston hit back on Twitter, saying: \"Get over yourself Nadine.\" \nIn dramatic scenes in the Commons, Tory rebels shouted \"too late\" as justice minister Dominic Raab outlined his concession and Government whips buzzed around the chamber in an attempt to win over rebel MPs. Read More ", "external_links": [], "published": "2017-12-14T11:06:00.000+02:00", "crawled": "2017-12-14T12:28:30.019+02:00", "highlightTitle": ""}