{"organizations": [], "uuid": "860caa44db97069fdae917defbf9f1a3c36621a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.birminghammail.co.uk/incoming/article14043947.ece/ALTERNATES/s1200/theresa-brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-labour-conservative-rebels-could-14047108", "country": "GB", "domain_rank": 21960, "title": "How some Labour and Conservative rebels could defeat Theresa May and delay Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-17T10:00:00.000+02:00", "replies_count": 0, "uuid": "860caa44db97069fdae917defbf9f1a3c36621a4"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-labour-conservative-rebels-could-14047108", "ord_in_thread": 0, "title": "How some Labour and Conservative rebels could defeat Theresa May and delay Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "brexit news", "sentiment": "negative"}, {"name": "labour and conservative", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion How some Labour and Conservative rebels could defeat Theresa May and delay Brexit Theresa May wants to set an official leaving day of March 29 2019, but MPs may prevent her Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIt was a dramatic moment when Theresa May lost a vote about Brexit in the Commons last week. \nLabour MPs cheered, but they couldn’t have defeated the Government without the help of Conservative rebels - some of whom went for a celebratory drink afterwards. \nBut it was just the dress rehearsal. \nBecause there’s another vote planned for this week which could see the Government face real humiliation - and raise serious questions about Brexit. \nLast week, MPs said that the final terms of withdrawal from the European Union must be approved in “a statute by Parliament”. \nThat means there must be a law approving any final deal drawn up by the UK and the EU. \nAnd it’s significant because it makes absolutely certain that no deal can be agreed unless Parliament gives its approval. \nHowever, there’s a catch. Theresa May in Brussels for Brexit talks \nBecause it’s still Prime Minister Theresa May and Brexit Secretary David Davis who have to go to Brussels and negotiate with the EU. \nRealistically, they can’t involve 650 MPs in the talks. \nSo at some point next year, or early in 2019, Parliament will be presented with a deal agreed by Mrs May and the EU. And MPs will face a stark choice between agreeing to it, or rejecting it. \nBut we’ve already agreed to leave the EU on March 29, 2019. \nSo if MPs reject the deal, it just means that we’ll leave without one. And employers in the UK are adamant that this would be the worst possible outcome. \nMost MPs seem to agree. Read More State pension age campaigners storm out of debate as Hexham MP defends changes \nThat’s where this week’s vote comes in. \nMrs May had planned to amend the law being debated by MPs, the EU Withdrawal Bill, so that it named March 29, 2019 as the day we definitely leave the EU. \nAnd a vote on this was due on Wednesday. \nBut it now seems likely that Labour and Tory rebels could defeat Mrs May a second time, and stop the date being included \nThere’s talk that the Prime Minister could even change her mind about including the date, to avoid the humiliation of losing another vote. \nIf either of these things happen, it would mean that Parliament wants the right to reject a Brexit deal - and also says we should be willing to stay in the EU for a bit longer if needed, in order to negotiate a new deal. Read More \nTo put it another way, it opens up the prospect of Brexit being delayed. \nThere’s one snag. \nThe EU itself might not let us delay Brexit. They hate the uncertainty and delays as much as we do. And they might tell us we have to leave on March 29 2019, whether our MPs like it or not. Like us on Facebook", "external_links": [], "published": "2017-12-17T10:00:00.000+02:00", "crawled": "2017-12-17T10:11:37.007+02:00", "highlightTitle": ""}