{"organizations": [], "uuid": "c08fa7301500c6bc5cb59519d71183423380234d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article901164.ece/ALTERNATES/s1200/3146337_ce56b1b9.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/royal-devon--exeter-hospital-901165", "country": "GB", "title": "Royal Devon & Exeter Hospital say they're ready for the winter rush after councillor's concerns", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-09T16:40:00.000+02:00", "replies_count": 0, "uuid": "c08fa7301500c6bc5cb59519d71183423380234d"}, "author": "Lewis Clarke", "url": "http://www.devonlive.com/news/devon-news/royal-devon--exeter-hospital-901165", "ord_in_thread": 0, "title": "Royal Devon & Exeter Hospital say they're ready for the winter rush after councillor's concerns", "locations": [], "entities": {"persons": [{"name": "lewis clarke", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "jenny roach", "sentiment": "none"}, {"name": "boniface", "sentiment": "none"}, {"name": "silverton", "sentiment": "none"}, {"name": "jenny road", "sentiment": "none"}, {"name": "nick way", "sentiment": "none"}], "locations": [{"name": "cranbrook", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "cullompton", "sentiment": "none"}], "organizations": [{"name": "news royal devon & exeter hospital", "sentiment": "none"}, {"name": "royal devon & exeter hospital", "sentiment": "none"}, {"name": "scrutiny committee", "sentiment": "none"}, {"name": "mid devon district council", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "devon county council’s health & wellbeing scrutiny committee", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "geograph", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Royal Devon & Exeter Hospital say they're ready for the winter rush after councillor's concerns RD&E have worked to combat Brexit and additional doctors and nurses, more care available to people in their homes Share The Royal Devon & Exeter Hospital (Image: Lewis Clarke / Geograph) Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Royal Devon & Exeter Hospital has said it’s ready for a busy winter period after councillors questioned how the centre would cope with a rise in population. \nCouncillors on Mid Devon District Council expressed fears over the provision of healthcare at the RD&E during the coming months. \nSpeaking at a recent Scrutiny Committee meeting of Mid Devon District Council, Councillor Jenny Road (Silverton, Liberal) said: “Every time I go into Exeter via the Cullompton way, I’m shocked at the number of houses being built. \n“Last year, the Royal Devon & Exeter Hospital couldn’t cope with the population at that point. I’m really worried now that our health service won’t be able to cope with this influx of population. There is a massive influx going on. Mid Devon District Councillor Jenny Roach (Image: Mid Devon District Council) \n“What arrangements have been made by anybody? I can see that if we have a really bad flu break, we’re going to have tremendous problems in this county. I don’t know what the population has increased to, but when you look at Cranbrook and when you go to Newton Abbot, and on the other side of Exeter there are new houses which weren’t there six months ago. It’s a tremendous influx. \n“I’d like to know what influx of people that the RD&E is expecting to serve, who is going to help provide the extra money? \n“The doctors and nurses have got to cope this winter, and they’re already struggling.” \nCouncillor Nick Way (Boniface, Liberal Democrat), who is also the vice chair of Devon County Council’s Health & Wellbeing Scrutiny Committee said it was a real problem for this area. \nHe said: We’re hearing nationally there are 10,000 NHS workers leaving because of the Brexit situation. \n“I have had informal talks with some in the health service, who informed me that some of the Spanish nurses have left or are leaving the RD&E. It is a real problem, and it’s something which we should seriously consider.” \nAn RD&E spokesperson said: “The winter period is always challenging but we have worked hard with partner organisations and have detailed contingency plans in place to cope with expected increases in patient numbers this winter. These include additional doctors and nurses, more care available to people in their homes and more specialist staff working at weekends. \n“As ever, we would ask people to think carefully about whether they need to access busy Emergency Departments or whether they can receive the help they require from their local GP, minor injury unit, pharmacist or the NHS 111 helpline. We would also encourage people to get a free flu jab now if they are eligible so they have protection over the winter. \n“We expected turnover of some overseas recruited registered nurses following the Brexit outcome and have proactively invested in further overseas recruitment to make sure we have enough staff to care for our patients safely over the winter period.” Like us on Facebook", "external_links": [], "published": "2017-12-09T16:40:00.000+02:00", "crawled": "2017-12-09T16:59:42.030+02:00", "highlightTitle": ""}