{"organizations": [], "uuid": "9ed91b1d3de9df7f501c67ad473dccb34f59b108", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/what-learned-jd-wetherspoon-founder-896434", "country": "GB", "title": "What we learned about JD Wetherspoon founder Tim Martin from his Desert Island Discs show", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-08T13:40:00.000+02:00", "replies_count": 0, "uuid": "9ed91b1d3de9df7f501c67ad473dccb34f59b108"}, "author": "Patrick Phelvin", "url": "http://www.devonlive.com/news/devon-news/what-learned-jd-wetherspoon-founder-896434", "ord_in_thread": 0, "title": "What we learned about JD Wetherspoon founder Tim Martin from his Desert Island Discs show", "locations": [], "entities": {"persons": [{"name": "tim martin", "sentiment": "none"}, {"name": "jd wetherspoon", "sentiment": "none"}, {"name": "bob dylan", "sentiment": "none"}, {"name": "david dimbleby", "sentiment": "none"}, {"name": "beefheart", "sentiment": "none"}, {"name": "anthony powell", "sentiment": "none"}, {"name": "kirsty young", "sentiment": "none"}, {"name": "van morrison", "sentiment": "none"}, {"name": "richard burton", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "bob marley", "sentiment": "none"}, {"name": "felicity", "sentiment": "none"}, {"name": "loudon wainwright iii", "sentiment": "none"}, {"name": "johnny cash", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}, {"name": "dylan thomas", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "nottingham university", "sentiment": "none"}, {"name": "desert island discs", "sentiment": "none"}, {"name": "nottinghamshire", "sentiment": "none"}, {"name": "jd wetherspoon", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What we learned about JD Wetherspoon founder Tim Martin from his Desert Island Discs show He's an out-and-out Brexiteer and boss of Britain's biggest pub chain - but would he advise others to go into business? Not unless they're a maniac Share Tim Martin is interviewed for Desert Island Discs (Image: BBC) Share   Thank you for subscribing!   \nAt 6ft 6ins the founder of the JD Wetherspoon pub chain is literally a giant of the industry. The Exeter resident’s company is a soaraway success, posting healthy profits this year while others have struggled. But it wasn’t always so. His first pub didn’t make a profit for four years and he worried constantly about losing his car and his home. \nA passionate and controversial campaigner for Brexit, he appeared on BBC Radio 4’s Desert Island Discs this week. Here’s what we learned: Tim Martin pictured at the Imperial in his home town of Exeter Although he campaigned for Brexit – even printing thousands of beer mats which made the case for Britain to leave the EU – he didn’t think the Leave campaign had won, even pulling out of a television show with David Dimbleby which was due to be held on the day of the result because he thought the campaign had lost. He doesn’t want to put other pubs out of business, saying that they work best when there are other thriving pubs and restaurants nearby. A ‘natural rebel’ whose family had emigrated to New Zealand, Martin hitch-hiked 250 miles back from boarding school to his home town of Auckland because he was in love with a girl. He could have been serving at the Bar rather than behind one – after going to 11 different schools Martin studied law at Nottingham University, worked in a pork pie factory and then qualified as a barrister ‘by the skin of his teeth’. But his fear of public speaking put him off serving in court, and he launched his first pub, Martin’s Free House. Tim Martin on the Leave campaign trail with Boris Johnson He met his wife Felicity while they were students in Nottingham and plucked up courage to speak to her because he was fortified by Nottinghamshire bitter. They married soon after and have four children and four grandchildren. He had the ‘insane idea’ that he could become a great squash player. He realised that he wasn’t going to make it when he realised at the British championship that he was heavier than both competitors put together. Read More Devon's award winning fish and chip shop to star in American cookery show with celebrity chef He was ‘just so bad’ at being a publican to begin with. It was four years before he made a profit, despite his pub being busy. He credits his success with not being tied to a brewery but coming up with the concept of buying shops and converting them into pubs. He exercises because it keeps his anxiety in check. Martin said that unlike Felicity he’s a natural worrier and found that sport was the solution and if you avoid SOYA – sitting on your ass – you will be healthier and might even live longer. He pays surprise visits to up to 14 pubs a week, parking half a mile away to walk in so he can observe their location and taking notes on the experience. “Nice breakfast wrap but poor cutlery” is a typical observation. Tim expands his pub empire in 1996 He has two to three ‘days off’ drink – when he only has one pint – but otherwise has three or four pints in an evening but never more. On launching your own business he is wary of advising young people to go for it. “A lot of people tell young people it’s a great thing to do but it isn’t unless you have the right personality – you’re a bit of a maniac – it’s not the right thing to do,” he said. He tells his staff they don’t have to smile while on duty. “We don’t go out of our way to tell people to be nice. Their natural personality will come out if they’re not put under pressure,” he told Kirsty Young. If you are going to launch a business you will need “persistence and the ability to listen” Martin advises. The senior management team at JD Wetherspoon has less knowledge than the company’s combined workforce, he thinks. So a frank conversation with them is always on the agenda. Bar staff also attend board meetings. Read More Is this the best winter pub in Devon? He’s changed his lifestyle, taking months off, to become a part-time physio to one of his grandchildren, who has a serious physical disability. “We’re lucky because we have time and money and I take my hat off to the single mums who don’t have either,” he said. The 62-year-old has no plans to retire, imagining that he has 40 to 50 years more work in him and a then a long retirement ahead. Whatever he does in the future Felicity says he’s not allowed in the house during office hours. He had a 38-year break from surfing, which he loved as a youngster, and he’s just taken up again, “terrifying others as his 18 stones hurtles towards them”. Bob Marley \nTim’s Desert Island Discs: \nLoudon Wainwright III, Down Drinking At The Bar \nVan Morrison, Cleaning Windows \nThe Beach Boys, Do it Again \nBob Dylan, Girl from the North Country (featuring Johnny Cash) \nCaptain Beefheart and his Magic Band, Yellow Brick Road \nDire Straights, Sultans of Swing \nBob Marley, Natural Mystic \nExtract from Poem in October by Dylan Thomas read by Richard Burton \nBook choice: \nDance to the Music of Time by Anthony Powell \nLuxury item: \nListen to the full episode here . Like us on Facebook", "external_links": [], "published": "2017-12-08T13:40:00.000+02:00", "crawled": "2017-12-08T13:48:23.052+02:00", "highlightTitle": ""}