{"organizations": [], "uuid": "f9380a816320e0d6888acb018f23b2185153f802", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14090642.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/meet-north-easts-top-10-14090044", "country": "GB", "domain_rank": 21960, "title": "Meet the North East's top 10 companies of 2017 - as chosen by our business team", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-31T15:00:00.000+02:00", "replies_count": 0, "uuid": "f9380a816320e0d6888acb018f23b2185153f802"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/meet-north-easts-top-10-14090044", "ord_in_thread": 0, "title": "Meet the North East's top 10 companies of 2017 - as chosen by our business team", "locations": [], "entities": {"persons": [{"name": "dave crone", "sentiment": "negative"}, {"name": "ju", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "st nicholas building", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "omega plastics group", "sentiment": "negative"}, {"name": "frank recruitment frank recruitment group", "sentiment": "none"}, {"name": "omega plastics", "sentiment": "none"}, {"name": "frank recruitment group", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "british chambers of commerce awards", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Winner Comapny of the Year Omega Plastics Group, pictured Dave Crone Share Get business   Thank you for subscribing! Could   \n2017 has been a great year for North East business, but here the 10 companies we feel have had the best year Omega Plastics \nThe firm with bases in Blyth, Washington and Hartlepool was named North East Company of the Year in April. Since then it has been shortlisted at the British Chambers of Commerce Awards and won a number of orders on the back of its raised profile. Frank Recruitment Frank Recruitment Group's new office at St Nicholas Building in Newcastle (Image: Frank Recruitment Group) \nThe Newcastle firm added 300 new jobs, a new office in Dallas a new home in its home city during 2017. It was one of the highest climbers on the North East’s Top 200 list of largest companies, and also a regular feature of national growth tables. Sevcon Sevcon engineers at work (Image: Sevcon) \nA busy year for the Gateshead electric vehicle component manufacturer began in March with the announcement of a move to new premises that will eventually create 200 new jobs. In July the firm was sold to US giant Borg Warner in a move that has now seen its name disappear. Performance Horizon The offices of Performance Horizon in Newcastle \nTipped to be the North East’s tech ‘unicorn’ - companies with a value of $1bn - Performance Horizon maintained its reputation as one of UK’s most exciting technology firms with its third consecutive listing on the Tech City UK Future Fifty list. In January it announced 50 new jobs and the opening of two more overseas offices. \nHere are the 10 developments that will change the North East in 2018 Puregas Solutions Tony Hales and Steven Scott of Puregas Solutions celebrate at the Ward Hadaway Fastest 50 Awards 2017 (Image: handout from client) \nThe Sunderland renewable energy firm was officially ranked as the region’s fastest growing company after winning the main prize at the the Ward Hadaway Fastest 50 event in October. The firm specialises in delivering efficient and reliable biogas upgrading solutions using its own CApture process. Realsafe Technologies Zoe Farrington of Realsafe Technologies at the Northern Design Centre, Gateshead (Image: Newcastle Chronicle) \nIt was a year of trophies for the motorcycle safety app firm, which triumphed in the Pitch@Palace event in April and also picked up (along with fellow Tyneside firm Gospelware) a global Webby award. Away from the awards circuit, the firm also picked up lucrative new business both at home and abroad. True Potential True Potential managing director David Harrison (Image: Unknown) \nFintech firm True Potential was another company adding to its trophy cabinet when it won the Business of the Year (€26m-€150m turnover) category at the European Business Awards. Managing partner David Harrison was also named Tyneside and Northumberland Business Executive of the Year, while the firm saw profits rise to almost £15m. Atom Bank Atom Bank founder and chairman Anthony Thomson with strategic advisor and music superstar Will.i.am (Image: Coreena Ford) \nThe Durham challenger bank raised £83m in equity funding in March and another £30m in June. In November it was named by social media site LinkedIn as one of the country’s 25 most disruptive companies but the year will be probably remembered for the unusual recruitment which saw rapper will.i.am signing up as a strategic advisor. Nissan The Nissan factory in Sunderland has manufactured the first of its new Leaf model electric cars (Image: Unknown) \nThe spectre of Brexit was never far from the Sunderland car maker and senior executives have sounded warnings about how the UK’s future trading relationship with Europe could affect its future. But the plant also received the Freedom of the City of Sunderland, production started on the new model Leaf and accounts published in December saw turnover top £6bn for the first time. Parkdean Resorts A Parkdean Resort \nFresh from a £1.35bn takeover at the start of the year, Parkdean made the Grant Thornton Top Track 250 league table of Britain’s private mid-market growth companies with the biggest sales. It also signalled that a major growth spurt was on the horizon with the appointment of a new head of mergers and acquisitions. Like us on Facebook", "external_links": [], "published": "2017-12-31T15:00:00.000+02:00", "crawled": "2017-12-31T15:29:05.023+02:00", "highlightTitle": ""}