{"organizations": [], "uuid": "911720220062c1c5b77ae240cf345379f0b3578e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14080291.ece/ALTERNATES/s1200/JS139569987.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/queens-speech-2017-manchester-london-14080250", "country": "GB", "domain_rank": 21960, "title": "Queen's speech 2017: Manchester and London terror attacks on the agenda", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-25T13:10:00.000+02:00", "replies_count": 0, "uuid": "911720220062c1c5b77ae240cf345379f0b3578e"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/news/north-east-news/queens-speech-2017-manchester-london-14080250", "ord_in_thread": 0, "title": "Queen's speech 2017: Manchester and London terror attacks on the agenda", "locations": [], "entities": {"persons": [{"name": "elizabeth ii", "sentiment": "none"}], "locations": [{"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "buckingham palace", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "westminster bridge", "sentiment": "none"}], "organizations": [{"name": "commonwealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Queen will use her Christmas message to praise the “powerful identities” of London and Manchester that have “shone through” in the face of terrorist attacks this year. \nDuring her televised address to the nation, the Queen will also pay tribute to the Duke of Edinburgh, who has retired from solo public duties, praising his “support and unique sense of humour”. \nThe Queen’s message to the nation and the Commonwealth will look back over the previous 12 months and take “home” as its theme. \nIn her pre-recorded address, filmed at Buckingham Palace, the Queen will say: “This Christmas, I think of London and Manchester, whose powerful identities shone through over the past twelve months in the face of appalling attacks.” \nThe nation endured a series of devastating terrorist atrocities during the year, beginning with the Westminster Bridge attack in March that saw four pedestrians die when an attacker, later shot dead by police, drove at them before fatally stabbing a police officer. Queen Elizabeth II sits at a desk in the 1844 Room at Buckingham Palace, London, after recording her Christmas Day broadcast to the Commonwealth. (Image: Sky News/PA Wire) \nIn Manchester a few months later 22 people - including children and four people from the North East - were killed when a lone suicide attacker detonated an explosive device as crowds of music fans left Manchester Arena following a performance by US singer Ariana Grande. \nThere were more deaths in June when three terrorists in a van ploughed into pedestrians on London Bridge then went on a knife rampage in Borough Market, killing eight in total. They were shot dead by police. \nThe address traditionally has a strong religious framework reflecting the Queen’s faith, and is written by the monarch who draws on current issues and her own experiences over the past year. Courtney Boyle, Chloe Rutherford, Liam Curry and Philip Tron were killed in the Manchester terror attack (Image: PA) \nHeadline-making events during 2017 include June’s General Election, the devastating Grenfell Tower fire, Prince Harry and Meghan Markle’s engagement and the ongoing Brexit negotiations. \nPhilip, famed for his quips, inquisitive mind and “no-fuss” attitude, stood down from his solo public role in August, although he has made the occasional appearance at events involving the Queen. \nSpeaking about the Christmas message’s theme the Queen will say: “We think of our homes as places of warmth, familiarity and love... there is a timeless simplicity to the pull of home.” Emergency personnel on Westminster Bridge, close to the Palace of Westminster, London (Image: PA) \nThis year’s annual address has been produced by Sky News and was recorded in the palace’s 1844 room which is decorated with a large tree and features family photos. Read More Families of Manchester Arena bombing victims offered Disneyland trip \nPictures of the Queen’s great grandchildren, Prince George and Princess Charlotte, can be seen, along with two wedding related images of the Queen and Philip - but taken 70 years apart. \nThe royal couple are featured in a black and white image from their 1947 wedding, and in a colour photo released to mark their 70th wedding anniversary celebrated in November. \nIn the broadcast the Queen is wearing an ivory white dress by Angela Kelly, an outfit she first wore with a matching coat and hat for the Diamond Jubilee Thames River Pageant in 2012. She is also wearing a star-shaped diamond brooch. Like us on Facebook ", "external_links": [], "published": "2017-12-25T13:10:00.000+02:00", "crawled": "2017-12-25T13:31:34.013+02:00", "highlightTitle": ""}