{"organizations": [], "uuid": "edfe2c59669eb213d64bd5445076c62b955ea930", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13544493.ece/ALTERNATES/s1200/HCR_NEC_290817charitynews_06.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/metrocentre-eldon-square-owners-34bn-14002809", "country": "GB", "domain_rank": 21960, "title": "Metrocentre and Eldon Square owners' £3.4bn takeover deal welcomed by Newcastle BID firm", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-06T17:47:00.000+02:00", "replies_count": 0, "uuid": "edfe2c59669eb213d64bd5445076c62b955ea930"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/metrocentre-eldon-square-owners-34bn-14002809", "ord_in_thread": 0, "title": "Metrocentre and Eldon Square owners' £3.4bn takeover deal welcomed by Newcastle BID firm", "locations": [], "entities": {"persons": [{"name": "david atkins", "sentiment": "none"}, {"name": "david tyler", "sentiment": "none"}, {"name": "intu", "sentiment": "none"}, {"name": "john strachan", "sentiment": "none"}, {"name": "stephen patterson", "sentiment": "none"}], "locations": [{"name": "eldon square", "sentiment": "none"}, {"name": "intu", "sentiment": "none"}, {"name": "hammersons", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "eldon square", "sentiment": "negative"}, {"name": "business metrocentre", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "ne1 ltd", "sentiment": "none"}, {"name": "ne1 ltd - business improvement district company for newcastle city centre", "sentiment": "none"}, {"name": "hammerson", "sentiment": "none"}, {"name": "intu", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "intu properties", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Metrocentre and Eldon Square owners' £3.4bn takeover deal welcomed by Newcastle BID firm Hammerson has offered £3.4bn for Intu Properties, and the centres' distinctive intu orange and black bird branding will stay Share intu Eldon Square (Image: UGC TNE) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLeading regional BID company NE1 Ltd has welcomed news of a merger between Eldon Square and Metrocentre owner Intu Properties and rival shopping centre operator Hammerson. \nShares in Intu Properties soared by as much as 18% in early trading yesterday following the announcement of the takeover deal by Hammerson on the stock market. \nHammerson has agreed an all share takeover of rival Intu in a £3.4bn deal set to create Britain’s biggest property company, bringing all their centres under one roof. \nThe acquisition will result in Hammerson shareholders owning 55% of the combined firm and Intu investors the remainder. \nThe deal, which would create a £21bn shopping centre giant, is set to be voted upon by shareholders next year and Intu has apparently already secured 50% of investor support for the all-paper deal. \nThe deal represents a value of approximately 253.9p per Intu share, equivalent to £3.4bn. \nStephen Patterson, Director of Communications at NE1 Ltd - Business Improvement District Company for Newcastle City Centre . \n“It is fantastic news about the merger of Hammersons and intu and specifically about what this will mean for retail and investment here in Newcastle. \n“Both companies have an outstanding pedigree for investment and development in the city with intu’s Eldon Square and Hammerson’s landmark development of Monument Mall. \nNewcastle's newest bar opens this weekend - and it's something different for the city \n“We’re excited to see their plans for the future. Both are at the top of their game and at NE1 we look forward to working with them and supporting them with future development plans.” \nTogether, the groups plan to slash costs and offload at least £2bn worth of its assets - and target high growth markets such as Spain and Ireland. \nThe deal comes at a time when consumer confidence has taken a pounding following the Brexit vote , resulting in a sharp decline in retail sales. \nHowever, shopping centres in city locations have tended to fare better than high streets during economic downturns. \nDespite Hammerson owning the lion’s share of the merged firm, there will be no rebranding exercise at the intu centres, which spent a significant sum on a brand implementation exercise resulting in the distinctive branding, featuring a bird icon in orange and black colours. \nThe combined group will be led by Hammerson boss David Atkins and chaired by David Tyler. \nDavid Tyler, chairman of Hammerson, said: “This transaction will deliver real value for shareholders. The financial strength of the enlarged group and its strong leadership team will make it well-placed to take advantage of higher growth opportunities on a pan-European scale.” \nDavid Atkins, chief executive of Hammerson, said: “The acquisition creates a leading pan-European platform of desirable retail and leisure destinations which are better positioned to serve the needs of our retailers, excite our customers and support our partners and communities.” \nJohn Strachan, chairman of Intu, said: “A combination of both Intu and Hammerson will create a more resilient, diversified and stronger group that we believe will benefit all our stakeholders. “Intu offers high-quality retail and leisure destinations in the UK and Spain, which when merged with Hammerson’s own top-quality assets in the UK, in France and in Ireland, present a highly attractive proposition for retailers and shoppers in Europe’s leading cities.” Like us on Facebook", "external_links": [], "published": "2017-12-06T17:47:00.000+02:00", "crawled": "2017-12-06T18:25:02.005+02:00", "highlightTitle": ""}