{"organizations": [], "uuid": "d5b03278e2db577fd1003ad838ff24c9272fe408", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article7133776.ece/ALTERNATES/s1200/JS32950460.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14003598", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Ladbrokes Coral in talks over £3.9bn takeover by GVC", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-07T10:30:00.000+02:00", "replies_count": 0, "uuid": "d5b03278e2db577fd1003ad838ff24c9272fe408"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14003598", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Ladbrokes Coral in talks over £3.9bn takeover by GVC", "locations": [], "entities": {"persons": [{"name": "jay of ewelme", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "sportingbet", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "ladbrokes coral", "sentiment": "negative"}, {"name": "gvc", "sentiment": "negative"}, {"name": "gvc ladbrokes coral", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "house of lords eu committee", "sentiment": "none"}, {"name": "ladbrokes", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Banks Mining invests six-figure sum into massive shovel at Shotton mine \nBanks Mining has doubled down on its commitment to the Shotton surface mine in Northumberland , after investing a six-figure sum in new earth moving equipment. \nThe County Durham family-owned mining company has spent its cash on its first Komatsu PC3000-6 mining shovel, which is being used to expose coal at the Shotton site. \nBanks Mining said that the purchase in the 265-tonne shovel showed its commitment to investing in the site and its teams. \nRobbie Bentham, plant director at Banks Mining, said: \nEnhancing our plant fleet with the required equipment is essential for helping our teams working our surface mining sites in the safest, most responsible and most efficient, low emission, way possible, and this is the latest investment that we’ve made in recognition of the skills and expertise that they bring to the job. \nWe have a good relationship with the Komatsu team, and the reliability and quality of the product made it the right choice for this task. \nAlong with being used to expose coal, the new shovel will also be put to use restoring the site over the next four years. \nThe purchase of the equipment is the latest investment by Banks Mining in Komatsu machinery. Earlier this year the firm purchased in three 27.5 tonne Komatsu WA470-8 loading shovels. The first Komatsu PC3000-6 mining shovel being delivered to Banks Mining's Shotton site 9:25 Jonathon Manning No deal Bexit threatens UK's £4.8bn architecture industry, says report \nBritain’s £4.8bn architecture industry is under threat if the Government fails to strike a Brexit deal and could see its EU exports slump by nearly a third, a report has warned.Research from the Royal Institute of British Architects (Riba) has cautioned that a disorderly withdrawal from the EU could cut off vital access to talent and put the UK’s position as a global hub for the industry at risk.It said a “no deal” scenario could decimate the sector’s mammoth contribution to the UK economy, estimating that exports to the EU alone would collapse by 29%.The impact of lost export earnings from around the world could be £73 million a year, the report claimed.The study comes as the latest warning over the implications of a no deal Brexit, with sectors including the car industry sounding the alarm over the impact of a hard border and tariffs.Britain’s architectural sector has already been hit by Brexit, with the largest player, Foster + Partners, whose projects include London’s Gherkin tower, axing nearly 100 jobs earlier this year as a result of uncertainty around major builds.Riba is calling on the Government to take steps to protect Britain’s architecture industry during negotiations.Ben Derbyshire, president of Riba, said: \nWithout a Brexit deal that works for UK architecture we risk losing more of our global talent due to increased costs and economic uncertainty. \nA no deal Brexit is not an option; it would be a disaster for UK architecture and our built environment, and the Government must take this option off the table. \nThe UK’s architecture sector is particularly exposed to the impact of trade and border changes due to its position as an exporter and its reliance on international talent, according to the report.Riba is urging the Government to ensure there is a post-Brexit immigration system to allow access to talent worldwide, continued mutual recognition of qualifications across the EU and market access without non-tariff barriers.It also wants the Department for International Trade to expand its scope to support medium and small sized businesses to expand internationally.But the research, called Global Talent, Global Reach, said there is potential for growth from new trade agreements outside the EU, with deals struck with the likes of China, the US, India and the United Arab Emirates estimated to be worth at least £54m in its first year.Alan Vallance, chief executive of Riba, said: \nBritish architects are the most respected and admired in the world, but we can’t take this success and our £4.8bn contribution to UK economy for granted. The Gherkin KEY EVENT Stable conditions in 2018 will help exporters thrive, says economist \nEconomists are expecting the performance of North East exporters to return to form in 2018 following a tumultuous year in which unpredictable exchange rates impacted profits. \nThe weak value of the pound has become a double-edged sword for the region’s businesses, with many firms seeing their products come up against competition on the international market, while others have faced rising costs from overseas. \nThe issues have caused a number of the region’s businesses to make a loss over the last year. \nBut experts at financial services firm UBS met at the company’s Newcastle office to outline how they expect the value of the pound to remain stable next year, leading to improved performances for North East businesses. \nDean Turner, UK Economist at UBS Wealth Management, believes that the stable economic conditions will benefit exporters in particular – but that a smooth EU deal is needed. \nMr Turner said: \nOver the short term, this is a region that has a very strong export feature to the economy. \nAssuming that the pound can remain around where it is and that we can get a smooth transition deal with the EU, there is no reason to be to pessimistic. \nThe UBS experts said they are not expecting sterling to soar in value, but that they believe it will remain the same or increase slightly. \nThis will allow businesses to stay competitive while being able to make consistent, strategic plans. Dean Turner, director and economist at UBS (Image: Headland Consultancy) 9:10 Jonathon Manning Metrocentre and Eldon Square owners' £3.4bn takeover deal welcomed by Newcastle BID firm \nLeading regional BID company NE1 Ltd has welcomed news of a merger between Eldon Square and Metrocentre owner Intu Properties and rival shopping centre operator Hammerson . \nShares in Intu Properties soared by as much as 18% in early trading yesterday following the announcement of the takeover deal by Hammerson on the stock market. \nHammerson has agreed an all share takeover of rival Intu in a £3.4bn deal set to create Britain’s biggest property company, bringing all their centres under one roof. \nThe acquisition will result in Hammerson shareholders owning 55% of the combined firm and Intu investors the remainder. \nThe deal, which would create a £21bn shopping centre giant, is set to be voted upon by shareholders next year and Intu has apparently already secured 50% of investor support for the all-paper deal. \nThe deal represents a value of approximately 253.9p per Intu share, equivalent to £3.4bn. \nStephen Patterson, Director of Communications at NE1 Ltd, said: \nIt is fantastic news about the merger of Hammersons and intu and specifically about what this will mean for retail and investment here in Newcastle. \nBoth companies have an outstanding pedigree for investment and development in the city with intu’s Eldon Square and Hammerson’s landmark development of Monument Mall. \nWe’re excited to see their plans for the future. Both are at the top of their game and at NE1 we look forward to working with them and supporting them with future development plans. intu Eldon Square (Image: UGC TNE) 9:05 Jonathon Manning Royal Mail and union 'on course' for agreement to end industrial action threat \nHopes have been raised that an agreement can be made between Royal Mail and the postal workers union to head off the threat of industrial action.A planned strike by the Communication Workers Union (CWU) was called off after the company took legal action, leading to a process of mediation.During the talks, mediators recommended a two-year pay rise worth 4.6% and a one-hour cut in the working week.The union’s deputy general secretary Terry Pullinger said: \nWe believe we are on course for achieving an agreement. \nHe said there had been a “fundamental change” in the attitude of the Royal Mail to issues such as pensions during the talks.The pay offer is for an increase of 2.6% from last April, followed by a 2% rise from April 2018.During 2018-19, there would be a one-hour reduction to the working week - currently 39 hours - on the condition that Royal Mail and the CWU work together on a range of initiatives, including delivery methods trials, automated hours data capture and later delivery times.It was recommended that last delivery times should move back by 30 minutes to 3.30pm in urban areas and 4.30pm in rural areas. Royal Mail said in a statement: \nThe mediation process was helpful in bringing Royal Mail and the CWU together to advance the discussions. \nMediation has helped both parties to better understand their respective positions. \nThe mediator’s report made a number of recommendations. These are not legally binding on either side but have been useful in framing further discussions. \nRoyal Mail and the CWU are continuing talks with the aim of reaching agreement on the full range of issues under discussion. \nAgreement on certain issues is more advanced than on others but all issues remain open for negotiation and final agreement. Further announcements will be made in due course. Royal Mail (Image: SUNDAY MERCURY) 9:00 KEY EVENT Documents submitted by Brexit secretary 'don't include impact assessment' \nThe documents handed over to Parliament by Brexit Secretary David Davis last month are “underwhelming” and do not amount to an assessment of the likely impact on the UK economy of withdrawal from the EU, a senior peer has said.Lord Jay of Ewelme, the acting chair of the House of Lords EU Committee and former senior civil servant, said that he would have expected a “proper” impact assessment to be conducted to inform the Government of the likely effect of Brexit on different sectors of industry. \nThere were calls from opposition MPs for Mr Davis to be sacked after he admitted to the Commons Exiting the EU Committee on Wednesday that his department had carried out no formal impact assessments for the Government’s Brexit plans.But Mr Davis appeared to have dodged threats of an investigation for alleged contempt of Parliament, after the committee ruled that he had adequately fulfilled the terms of a Commons motion requiring him to hand over 58 sectoral impact assessments believed to have been drawn up by the Department for Exiting the EU.The committee split on party lines, with 10 Conservatives and one Democratic Unionist agreeing that Mr Davis had complied with Parliament’s requirements by handing over 850 pages of analysis of sectors of the UK economy, given that no impact assessments of the kind described in the motion existed. Eight opposition MPs voted that the Brexit Secretary had not complied with the motion.The 850-page cache of documents, handed to cross-party committees in the Commons and Lords but not yet published, are understood to describe existing conditions in various sectors of the economy, but not to forecast how they will be affected by Brexit.Lord Jay told BBC Radio 4’s Today programme that his committee was “going through them pretty systematically now”. \nLord Jay said: \nThey are quite interesting but they are pretty underwhelming. \nThey don’t really include an impact assessment, as far as I can tell. \nI would have thought there would have been a proper impact assessment, a proper assessment of what the impact of leaving the EU is going to be on different sectors of the economy. \nWhat we’ve got is interesting, and there’s a lot of good information there, but I can’t really say it’s a real impact assessment. It’s a fairly underwhelming report. The EU chief Brexit negotiator Michel Barnier, right, and British Secretary of State David Davis (Image: AP) 8:55 Jonathon Manning Property Backed Lending Trust raises almost £100,000 \nTOC Property Backed Lending Trust PLC has raised nearly £100,000 after carrying out a share sales yesterday. \nThe trust, which was launched by Newcastle wealth management company Tier One Capital, sees investors lend money to residential and commercial property projects across the region. \nPBLT successfully placed 958,257 shares at a price of 1p each. The sales raised gross proceeds of £958,257. The team with TOC Property Backed Lending Trust PLC at the London Stock Exchange (Image: London Stock Exchange) 8:50 Jonathon Manning Newcastle garage price comparison site set to roll out revolutionary AI tech \nA Newcastle website that allows drivers to compare prices at local garages is preparing to launch its own artificial technology (AI) software . \nThe AI technology is set to be rolled out by price comparison site whocanfixmycar.com during the beginning of 2018, allowing the firm to accurately issue quotes based on data gleaned from thousands of similar jobs by local garages. \nBy immediately issuing quotes to drivers the website is aiming to make its local garages more attractive to customers. \nGeorge Brown, whocanfixmycar.com’s content marketing manager, said: \nWe serve customers with estimates and then the driver is free to choose which one is better for them. In terms of the technology side of things it is there to drive engagement between drivers and garages. \nGetting a quote quickly is going to give the best experience possible. \nIf you are using an online platform you want it to be quick. \nOn the garage side, we use machine learning to analyse the quotes that they send out. \nIf they send out a quote for a clutch repair job for a car of a certain age, then we have a pretty good idea of how much that is going to be. We have it running in the background continuously. \nThe system also means that individual garages do not need to take time away from fixing cars to work out a quote for each job that comes to them. Ian Griffiths is CEO of Newcastle-based www.whocanfixmycar.com (Image: HANDOUT) 8:45", "external_links": [], "published": "2017-12-07T10:30:00.000+02:00", "crawled": "2017-12-07T10:42:39.153+02:00", "highlightTitle": ""}