{"organizations": [], "uuid": "55173d74657ca2eb327b537a19a42515f1f1bb67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article962598.ece/ALTERNATES/s1200/aftereights.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/five-hacks-make-festive-season-962460", "country": "GB", "title": "Five hacks to make the festive season (almost) bearable", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-21T19:03:00.000+02:00", "replies_count": 0, "uuid": "55173d74657ca2eb327b537a19a42515f1f1bb67"}, "author": "devonlive", "url": "http://www.devonlive.com/news/devon-news/five-hacks-make-festive-season-962460", "ord_in_thread": 0, "title": "Five hacks to make the festive season (almost) bearable", "locations": [], "entities": {"persons": [{"name": "chris mcguire", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "jack frost", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  \nDevon writer Chris McGuire has come up with five simple rules which will help you get through the festive period with as little grief as possible. \nWhether it's dealing with After Eight etiquette or handling a tricky relative, Chris's advice has been hard won. 1: HAVE NOT SO GREAT EXPECTATIONS \n“Chestnuts roasting on an open first, Jack Frost nipping at your toes…” It's not really like this \nAdmit it, that’s what’s in your head when you think about Christmas, isn’t it? Or, at least, something very similar. For me it’s the celebration at the end of It’s A Wonderful Life; a heartwarming scene filled with happy people enjoying each other’s company. \nHere’s my advice, forget all of that. \nIt won’t help you. \nNobody (outside of the movies) has ever experienced a Christmas like that. Compared to the Hollywood glitter, your festivities are always going to pale. Instead, why not set yourself some realistic (achievable) yuletide goals? Here are some suggestions: \ni: Limit yourself to just one argument on Christmas day. Your row could be about anything: Brexit, doing the washing up or even who’s better Ant or Dec , it really doesn’t matter. Expect the argument, enjoy it and move on. \nii: Don’t get After Eight angry. Some people will always put empty sleeves back into the box of mints, life’s like that. Don’t get annoyed, simply tip the empty wrappers down the back of the couch and make a mental note to fashion a voodoo doll of the culprit as soon as you can in the new year. \niii: Create a game that reflects the (less than perfect) realities of life in your family. Turn the negatives of Christmas into a positive by inventing a game that nobody but your family could play. Perhaps a festive cousin of Buckeroo – where you try to hang baubles from your (loudly snoring) grandma’s whiskers without waking her up? \nFun for all the family, I’m sure you’ll agree. 2: DEVELOP A COUGH Sneeze can spread the flu virus (Image: File pic) \nChristmas, like anything else, benefits from planning. \nIf you’ve got the in-laws coming over, take my advice and greet them at your front-door with a coughing fit. Planting the seed that you might be (a little) unwell will leave you with the perfect (and plausible) excuse to bail if things get intense. Going to bed ‘sick’, when your house is full of rowing relatives, becomes a shortcut to the perfect solitary Christmas – with time to gorge on Quality Street and avoid the inevitable post-pudding rant about ‘how the country has gone to the dogs’. \nNB: This hack comes with a warning. Don’t appear too sick – otherwise you’ll be denied access to alcohol or (even worse) sent to visit the out of hours doctor. 3: HIDE THE REMOTE CONTROL Rear view of young man watching television \nThe lights go out, a match is struck and the Christmas pudding you spent hours crafting (with more than a little sweat and blood) bursts into a life with a halo of blue flame. There’s an intake of breath as you parade it into the room towards your guests and then a little voice says: \n“This is lovely, but I must nip into the lounge, Coronation Street is on.” \nThe moment has gone, your hard work turns to dust and the strains of the nation’s favourite trumpet solo bring your long planned meal to an abrupt end. \nWhat to watch on the TV and when to turn the gogglebox on are a perennial source of arguments over the festive period. \nSo, why not hide the remote? \nTelling your beloved family members (who will happily put communing with fictional characters above the needs of real people who’ve just spent an arm and a leg hosting them) that unfortunately they can’t watch their beloved soap because the remote control has gone for a Burton will be one of the most gratifying conversations you’ll have over the festive period. \nTry it, you’ll enjoy it far more than you ever expected. \nIt’s fun to watch grown adults sulk. Read More", "external_links": [], "published": "2017-12-21T19:03:00.000+02:00", "crawled": "2017-12-21T19:39:55.005+02:00", "highlightTitle": ""}