{"organizations": [], "uuid": "7bc86ba99d63b487d0242656cdf5311ec38c43be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article878068.ece/ALTERNATES/s1200/Wollaston5JPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/how-family-gp-sarah-wollaston-878006", "country": "GB", "title": "How family GP Sarah Wollaston became Devon's most influential MP", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-05T12:56:00.000+02:00", "replies_count": 0, "uuid": "7bc86ba99d63b487d0242656cdf5311ec38c43be"}, "author": "Guy Henderson", "url": "http://www.devonlive.com/news/devon-news/how-family-gp-sarah-wollaston-878006", "ord_in_thread": 0, "title": "How family GP Sarah Wollaston became Devon's most influential MP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News How family GP Sarah Wollaston became Devon's most influential MP She has become an outspoken opponent of her own party leadership when the party line goes against the best interests of her constituents. Share Click to play Tap to play The video will start in 8 Cancel Play now Get   Thank you for subscribing!   \nFrom the moment she was chosen as the Conservative candidate for the Totnes constituency, Dr Sarah Wollaston was on course to become Devon's most influential MP. In a little over seven years she has become an outspoken opponent of her own party leadership when the party line goes against what she believes are the best interests of her constituents. \nOn the Devon hospital closure programme, she has come out in favour of keeping some of the community hospitals open. Dr Sarah Wollaston \nShe was born in Woking and studied medicine at Guy's Hospital in London. She qualified in 1986 and worked as a junior hospital doctor and then as a GP. After more than 20 years in clinical practice, she decided to run for political office. Read More \nShe joined the Conservative Party in 2006, having been motivated by the threatened closure of Moretonhampstead Community Hospital. Sarah Wollaston is re-elected as MP for Totnes \nHer selection for the Totnes constituency was the first of its kind. She was the first person to be selected through a postal open primary, in which voters of all parties were invited to have their say on the candidacy. \nDuring the campaign she emphasised that she was not a career politician and had actually had a real job. At the 2010 General Election, at which she succeeded the colourful Anthony Steen as the Tories' choice, she increased the Conservative majority. She did it again in 2015. Read More Hundreds take to streets to protest at Devon hospital and bed closures \nShe defied the Cameron/Clegg alliance on a number of key issues, voting in favour of a referendum on British membership of the European Union in 2011, for a cut in the EU budget in 2011, and against military intervention in Syria in 2013. Sarah Wollaston, and Kevin Foster present the Save Our Trains petition to trains minister Paul Maynard LARGE VERSION \nShe has been a vocal proponent of minimum unit pricing for alcohol and has spoken out against political patronage in Westminster. In June 2016, she announced that she was no longer supporting the Vote Leave campaign and would vote to remain in the EU. Rockfish Brixham VIP night Mitch Tonks and Sarah Wollaston MP \nIn a House of Commons debate on the rollout of Universal Credit in October, she said she would defy the Conservative Party whip during the debate and side with Labour in their call for the suspension of Universal Credit. Read More Devon MP says campaign of intimidation by Brexit extremists is “misleading and very toxic” \nDr Wollaston turned down an offer to become a Parliamentary Private Secretary to one of the health ministers because it would have prevented hear speaking out against party policy. 20/10/2016 Chris Grayling Secretary of State visiting cliffs and seawall near to smugglers lane, Dawlish, Director Route Asset Management (Western) at Network Rail Mike Gallop (left) Chris Grayling, and MP Sarah Wollaston. - Photo mandatory by-line: Andy Styles - Tel: 01626 872731 - Mobile: 07834214253 TQAS20161020C-008_C \nShe spoke out against David Cameron's NHS reforms, warning that they would result in the NHS 'going belly-up'. She joined and then chaired the Health Select Committee and in 2015 was named in the Top 20 most influential people in the NHS. \nDr Wollaston and her husband Adrian live in South Devon and have two daughters and a son. They are keen cyclists. Like us on Facebook", "external_links": [], "published": "2017-12-05T12:56:00.000+02:00", "crawled": "2017-12-05T13:48:16.288+02:00", "highlightTitle": ""}