{"organizations": [], "uuid": "c6c2e36e73269d083265b49785b22ac2cf8be6a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12194713.ece/ALTERNATES/s1200/TMP_NEC_171116BrianMarshall_02JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/local-news/south-shields-cliffs-police-live-14040905", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Ongoing rescue at Marsden cliffs in South Shields", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-15T08:30:00.000+02:00", "replies_count": 0, "uuid": "c6c2e36e73269d083265b49785b22ac2cf8be6a3"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/south-shields-cliffs-police-live-14040905", "ord_in_thread": 0, "title": "North East news LIVE: Ongoing rescue at Marsden cliffs in South Shields", "locations": [], "entities": {"persons": [{"name": "marsden", "sentiment": "negative"}, {"name": "tom eden", "sentiment": "negative"}, {"name": "cridland", "sentiment": "none"}, {"name": "davision", "sentiment": "none"}, {"name": "grayling", "sentiment": "none"}, {"name": "bradley", "sentiment": "none"}, {"name": "anthony william davison", "sentiment": "none"}, {"name": "bradley lowery", "sentiment": "none"}, {"name": "john cridland", "sentiment": "none"}, {"name": "sunderland tom eden burgla", "sentiment": "none"}, {"name": "tom eden bradley lowery", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "isla caton", "sentiment": "none"}, {"name": "gemma", "sentiment": "none"}, {"name": "davison", "sentiment": "none"}, {"name": "isla", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "st marks road", "sentiment": "none"}, {"name": "memorial sloan kettering", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "pennines", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}, {"name": "leamington street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "virgin east coast", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "east", "sentiment": "none"}], "organizations": [{"name": "national audit office", "sentiment": "none"}, {"name": "northumbria police", "sentiment": "none"}, {"name": "travel tom eden transport", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "local enterprise partnerships", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "bradley lowery foundation", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "commons public accounts committee", "sentiment": "none"}, {"name": "hs2 ltd", "sentiment": "none"}, {"name": "confederation of british industry", "sentiment": "none"}, {"name": "king", "sentiment": "none"}, {"name": "newcastle crown court", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nNorthumbria Police say they were called to the cliffs shortly after 11am this morning. \nA spokeswoman added: \n“We have received calls of concern for a man on Marsden cliffs near Frenchman’s Bay. \n“The incident is ongoing.” KEY EVENT Concern for man on Marsden cliffs \nEmergency services are at the scene of an attempted rescue operation after reports of concern for a man on a cliff at Marsden in South Shields. \nWe will have more information shortly. 12:41 Dog found at Metro station \nA dog, found near Longbenton, is being looked after at South Gosforth Metro Station. \n**Update** The owner has been located! ICYMI Alice Ruggles' friends plan 'perfect tribute' \nFriends of murdered Alice Ruggles have planned the perfect tribute to their fun-loving pal. \nThe 24-year-old, who was killed by her ex at her Gateshead home, had been a keen fencer throughout her teenage years. \nAnd this weekend a fencing competition, organised by her friends, will be held in Alice’s memory. \nThe Alice Ruggles Memorial Open Epee Competition will be hosted by the University of Leicester Fencing Club, in Alice’s home city. \nAll proceeds from the event will be donated to the Alice Ruggles Trust , a fund started by the tragic victim’s family to raise awareness of stalking. \nAlice’s mum, Sue Hills, said she was delighted her daughter’s friends had thought of such a positive fundraising idea. \nThe 56-year-old said: \n“It was her fencing friends that decided they were going to do it and I thought it was brilliant. She would have loved it. \n“Fencing was her life for a number of years. It is definitely nice to remember that she had a really lovely life and she loved life.” \nNorthumbria University graduate Alice was killed by her stalking ex Lance Corporal Trimaan Dhillon in October last year. \nNewcastle Crown Court heard how the soldier’s controlling behaviour left her terrified, after she attempted to end their relationship. \nThen Dhillon climbed through a window of her Bensham flat and slit her throat, in what was describe as “one final act of dominance and control”. \nThe 26-year-old soldier denied murder, claiming Alice had fallen on a carving knife during an argument. \nBut he was convicted and jailed for life with a minimum of 22 years. Brexit Tom Eden UK will have to accept freedom of movement during transition \nBritain will remain under the jurisdiction of the European Court of Justice and be required to permit freedom of movement during a transition period expected to last two years after Brexit, under guidelines released by the European Council. (Image: AP) \nThe guidelines were agreed by the leaders of the 27 remaining EU member states as they gave the green light for Brexit talks to move on to their second phase, dealing with the transition to a new relationship after the UK’s withdrawal. \nThe momentous decision was announced by European Council president Donald Tusk after discussions lasting less than half an hour in Brussels. \nPrime Minister Theresa May was not present, because she left the two-day summit early after assuring leaders of the remaining 27 EU nations on Thursday evening of her determination to see Brexit through despite this week’s defeat in the House of Commons. \nMr Tusk said on Twitter: \n“EU leaders agree to move on to the second phase of #Brexit talks. Congratulations PM @theresa-may.” NUFC takeover Tom Eden Rafa remaining tight lipped \nRafa Benitez headed into a crunch transfer meeting on Thursday having offered little in the way of fresh news on Newcastle United’s protracted takeover saga . (Image: PA) \nAs reported by the Chronicle yesterday, a key transfer summit on Thursday should set a budget for the Magpies boss – who is desperate to find out the precise size of his transfer budget with the long-running takeover saga continuing to play out on Tyneside. \nA figure of around £30million – which would include wage budgets – has been talked about previously and that would allow the targeted replacements Benitez feels will lift his squad out of the danger zone. \nHe has targets ready to move quickly but needs to know for certain that the club will give the green light to the deals he has lined up. \nThat depends largely on Mike Ashley , who is understood to be minded to accept new terms after a positive few days of talks between the two parties. But with the takeover still some way from being completed, the notoriously difficult to predict owner will need to spell it out for Benitez and the Newcastle hierarchy that he is prepared to sanction funds for the New Year. \nGiven previous experiences, Benitez is understandably cagey on that as well as the more positive prognosis on a takeover which – despite the more optimistic burst of information on Wednesday – still needs to be formally agreed. \nAsked last night about the takeover and budget, Benitez said: \n“I don’t have any information. As I said the other day, I need to know how much money we will have for January as soon as possible, that’s it. But I don’t have information about the takeover.” \nNewcastle were not commenting on the takeover last night but there is still some work to be done on any deal, which is reportedly edging closer. News ", "external_links": [], "published": "2017-12-15T08:30:00.000+02:00", "crawled": "2017-12-15T15:37:29.022+02:00", "highlightTitle": ""}