{"organizations": [], "uuid": "d48c092dc997fdd48e8ce71e0a760f44454be23e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13156724.ece/ALTERNATES/s1200/MAYCORBS.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/year-ahead-politics-heres-what-14085264", "country": "GB", "domain_rank": 21960, "title": "The year ahead in politics: Here's what we can expect in 2018", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-30T07:00:00.000+02:00", "replies_count": 0, "uuid": "d48c092dc997fdd48e8ce71e0a760f44454be23e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/year-ahead-politics-heres-what-14085264", "ord_in_thread": 0, "title": "The year ahead in politics: Here's what we can expect in 2018", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "eu parliament", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get     \nPoliticians should make the most of their Christmas break. \nThey’ve had a frantic few years, and could probably use a holiday. \nWe had the Scottish referendum in 2014 and a general election in 2015, followed by a Labour leadership contest. \nThe EU referendum in 2016 was followed by a second Labour leadership contest and a Conservative leadership contest, as well as the election of Donald Trump as US President. \nThen we had a general election in 2017. And of course, Brexit talks have dominated politics all year - along with the Prime Minister Theresa May’s efforts to govern without a majority in the House of Commons. \nWill the next year be any quieter? \nPerhaps not. Here are some of the things we can expect in 2018: Brexit \nThe UK Government and the EU will begin talks about a trade deal in earnest. \nAnd Michel Barnier, the EU’s chief negotiator, has said he hopes to get something agreed by October. This would provide time for the EU Parliament and other bodies to approve the deal by the time the UK leaves the EU, probably on March 29, 2019. \nIt remains to be seen whether a comprehensive trade deal can be signed in this time. It may be that only basic principles are agreed, with further talks continuing during the “implementation period” after the UK quits the EU. \nEven so, the biggest issue facing the Government next year will be making progress in talks with the EU. \nThe question of what exactly happens after Brexit may also become increasingly fraught. \nSome people think the UK should remain part of the single market and the customs union during an implementation period which might last around two years. The UK could also be subject to rulings from the European Court of Justice during this period. \nBut some supporters of Brexit say this is almost the same as staying in the EU, and will oppose the idea. Read More Campaigners take case for new services from Washington to Parliament Theresa May \nAs we get closer to Brexit Day, there will be increasing speculation about Theresa May’s future - and which Conservative MP could replace her as party leader and Prime Minister. \nMost Tories assume she’s not going to lead them into the next election. That mean’s she’ll resign at some point between Brexit taking place - March 2019 - and the election, which doesn’t need to be held until 2022 but could take place sooner. \nIf ambitious Tories think she might resign in the middle of 2019, they’ll be quietly campaigning to replace her by the end of 2018. \nHaving said that, nobody knows how long Mrs May will last. If there does turn out to be a lengthy implementation period, then she could continue as Prime Minister until it’s over. \nShe may even surprise people and remain as Tory leader all the way to the next election. But her future will be in the spotlight next year. Local elections \nEvery seat on Newcastle City Council will be contested. \nAnd a third of seats will be contested in other councils such as Gateshead, Sunderland, North Tyneside and South Tyneside. \nIt won’t be a big surprise if Labour do well in the North East. \nHowever, Conservatives are worried about the prospect of a bloodbath in London. They think they might lose seats to Jeremy Corbyn’s Labour Party. \nIf that happened, it would have an impact on politics across the country. It would increase speculation about Mrs May’s future, and further strengthen the position of Mr Corbyn and the Labour left. Read More Warning that homeless people are being left to suffer on North East streets Labour \nAfter doing better in the 2017 General Election than many predicted, Jeremy Corbyn’s position as Labour leader was secure. \nBut that doesn’t mean that Labour’s internal battles are over. \nMr Corbyn won’t be there forever, but Labour left-wingers want to ensure the party is transformed into one that represents their ideas. \nLabour is holding a Democracy Review, designed to give members more control and to overhaul decision-making structures at every level. \nThis may lead to MPs having less say in the party is run. \nAnd MPs tend to come from the “moderate” or non-Corbynite tradition within the party, while most party members appear to favour Mr Corbyn’s approach. \nExpect some battles over this - though it’s unclear whether the moderates have any stomach for a fight, or any strategy for reclaiming the Labour Party. Read More Trump \nUS President Donald Trump is to visit the UK in February, according to reports. \nIt will be a “working visit” rather than a full state visit, so he won’t meet the Queen. \nBut there may be huge protests in London when he visits the capital open a new US Embassy. \nThe visit will include talks with the Prime Minister in Downing Street. Devolution \nWork on creating a North of Tyne Combined Authority will progress in 2018. \nNorthumberland, North Tyneside and Newcastle will be part of the new body. \nAt some point, it will need to be given legal status through a Statutory Instrument, a type of legislation. \nHowever, the councils can set up a Combined Authority and begin working together on a voluntary basis before that happens. \nElections for a North of Tyne Mayor will be held in 2019 but the parties may choose their candidates in 2018. \nAnd an interim mayor (possibly known as a shadow mayor) will be appointed in 2018. Transport Part of the proposed route for the HS2 high speed rail scheme \nOne of the biggest announcements for the North East will be the publication of Transport for the North’s strategy, early in the New Year. \nIt will include an “outline” of what Transport for the North calls its “emerging vision” for a new rail network, linking the North West and the North East. \nThis sounds a bit vague, but it will be a first glimpse of what the new Northern Powerhouse Rail line will look like. Further details could be published as the year goes on. \nThe Government has not yet committed any money to building the new rail network, but Ministers give the impression that they’re just waiting for Transport for the North to publish the details before they give the green light. \nThat’s not to say that the final rail network will look exactly the same as Transport for the North proposals. They will be subject to lengthy debates and consultation. \nBut it could eventually mean that there’s a new rail network, probably high speed, which connects the North East to Manchester and Liverpool. It may also mean that the North East effectively becomes part of the HS2 high speed rail network, which is currently planned to end just south of York. Anything could happen \nJeremy Corbyn reportedly said that he would become Prime Minister in 2017, in a conversation with Glastonbury Festival founder Michael Eavis. \nIt hasn’t happened. But he’s now told magazine Grazia that “there will probably be another election in the next 12 months”, adding: “I will probably win. I’m ready to be prime minister tomorrow.” \nWho knows? Politics has been so unpredictable lately that anything’s possible. \nBut some voters are probably hoping we can go at least a year without a referendum or general election. Like us on Facebook", "external_links": [], "published": "2017-12-30T07:00:00.000+02:00", "crawled": "2017-12-30T08:13:24.000+02:00", "highlightTitle": ""}