{"organizations": [], "uuid": "8e29c19ce12291a2a2df46d3d5845be5c0bdb0c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14072764.ece/ALTERNATES/s1200/politics.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/metro-cash-article-50-memorable-14072699", "country": "GB", "domain_rank": 21960, "title": "Metro cash, Article 50 and a memorable election: The key moments in British politics in 2017", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-24T10:00:00.000+02:00", "replies_count": 0, "uuid": "8e29c19ce12291a2a2df46d3d5845be5c0bdb0c0"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/metro-cash-article-50-memorable-14072699", "ord_in_thread": 0, "title": "Metro cash, Article 50 and a memorable election: The key moments in British politics in 2017", "locations": [], "entities": {"persons": [{"name": "sedg", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}], "organizations": [{"name": "daily mirror", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nWe’re coming to the end of an historic year in British politics . \nSome of the events of the past 12 months will have a long-lasting impact on the United Kingdom, on the political parties at Westminster and on the North East . \nHighlights include funding for new Metro trains and a North of the Tyne devolution deal. \nOn the other hand there were stark warnings about Brexit as Article 50 was triggered by MPs. \nHere, political editor Jonathan Walker takes a look back at the key moments of 2017. Theresa May says “nothing has changed” An eventful speech by Theresa May to conference (Image: Daily Mirror) \nThe big political event of 2017 was the General Election on June 8. \nTheresa May didn’t need to call an election. But she thought it would be a chance to win a landslide majority. \nConservatives thought they could make a major breakthrough in the North East, thanks to Theresa May’s personal popularity and because she was seen as the champion of Brexit, which the region overwhelmingly backed in the referendum. \nThere was talk of seats such as Tynemouth, Bishop Auckland, Sedgefield and Darlington turning blue. \nIt didn’t happen. The election proved to be a massive misjudgment on the part of Mrs May. \nShe lost her majority in the House of Commons and the person who benefitted was Jeremy Corbyn . \nMany Labour MPs expected the party to lose seats and Mr Corbyn to stand down as party leader. But when Labour gained 30 seats, it meant Mr Corbyn’s position was safe. \nOf course, we still have a Conservative Government. It’s easy to forget that Labour lost. \nThe election result means Mrs May is almost certain to stand down as Conservative leader some time before the next election. \nAnd the most memorable moment of the campaign came on May 22, when she announced a partial u-turn over reforms to social care funding popularly known as the “dementia tax”. \nMrs May insisted: “Nothing has changed”. We all knew that it had. \nIt was the moment when her claim to provide “strong and stable” leadership no longer appeared credible. The media described her as “weaky and wobbly” instead. A new North of Tyne mayor Nick Forbes, leader of Newcastle City Council, Norma Redfearn, directly-elected Mayor of North Tyneside and Councillor Peter Alan Jackson, leader of Northumberland Council (Image: Newcastle Chronicle) \nThere was a huge development in the long-running saga of North East devolution in November, when Chancellor Philip Hammond announced he was backing plans for a new ‘North of Tyne’ combined authority and mayor. \nElections for the mayor will take place in 2019, with an interim mayor - probably a council leader - appointed in the meantime. \nNewcastle City Council, North Tyneside Council and Northumberland County Council will all be included in the new authority. \nIt will get funding of £600m over 30 years but the final sum could be a lot more, according to the Treasury. It says the deal will boost the local economy by £1.1bn and attract £2.1bn in private investment. \nSo is the debate about devolution over? \nNot really, because it raises questions about South Tyneside, Sunderland, Gateshead and Durham, the councils that are not involved. \nThey will have a combined authority and mayor to the north as well as the Tees Valley authority and mayor to the south. \nThe North of Tyne councils have decided to go off and do their own thing - but they don’t deny that they’d be delighted if other North East councils chose to join them eventually. \nWhether that will ever happen remains to be seen. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now New trains for the Tyne and Wear Metro ... at last \nThe Government was keen to sow how much it is investing in the North East, as part of a concerted effort to show it was committed to the Northern Powerhouse - and that this “Powerhouse” included more than Manchester and the North West. \nAnnouncements included £42m for the International Advanced Manufacturing Park, close to the A19 and north of Nissan’s carmaking plant, designed to create more than 5,000 jobs. \nTransport Secretary Chris Grayling also pledged that the A1 will be dualled from Northumberland to Scotland. Read More MP fighting South Tyneside hospital cuts says she won't be bullied into silence \nBut the biggest single announcement came in November’s Budget - when Chancellor Philip Hammond said £337m would be made available to replace ageing trains on the Tyne and Wear Metro. \nThe carriages have bene in use since the 1980s and well past their sell by date. Transport authority Nexus, councils and MPs had been lobbying the Government for cash to replace the unreliable stock. \nNew trains could now be in use by 2021. \nThe Treasury had been in talks with Nexus about whether to provide the money directly or to impose a complex private finance initiative deal. But in a major win for the region, the Chancellor announced the funding would take the form of a direct grant. Triggering Article 50 to take us out of the European Union (Image: AP) \nOnly one MP voted against - Newcastle North Labour MP Catherine McKinnell . \nIt meant that Prime Minister Theresa May had the authority to tell the EU officially that we planned to leave. \nAnd she did just that, in March. \nAs a result, the UK will officially leave the EU on March 29 2019. \nBut it didn’t end the debate about Brexit and there have been a series of House of Commons votes since then. \nMPs who refused to go along with the Government’s line have been called “traitors” and “mutineers” by some newspapers. \nThey’re not. Their job is to use their judgment in the House of Commons and do what they believe is in the best interests of their constituents, not to blindly do what the Government wants. \nMrs May suffered her first Commons defeat over Brexit in December. But that won’t stop it happening. \nThe Labour leadership, and most Labour MPs, have supported Brexit. In some cases, they might have done it reluctantly, saying they feel obliged to respect the result of the 2016 referendum. \nAs long as this continues, Brexit is certain to happen. Nissan warns the wrong type of Brexit will be a disaster Staff working at Nissan's car plant in Sunderland. About 80% of the cars produced at Sunderland are exported, primarily to Europe, which has created thousands of jobs. (Image: Newcastle Chronicle) \nWhat’s not clear is what sort of Brexit we’re going to get. \nThe Government seems to be divided about how close it thinks the UK should remain to the EU after Brexit. \nLabour is even more unclear, with members of the Shadow Cabinet contradicting each other over whether there should be a second referendum. Labour says it wants a “jobs first” Brexit, but also insists on ending freedom of movement which will threaten jobs by making it harder for the UK to retain single market access. \nThe potential dangers of getting it wrong were highlighted in February when carmaker Nissan said leaving the European Union without a trade deal could cost its Sunderland operation half a billion pounds every year - and put its future in doubt. Read More Why homelessness is a real problem for Prime M", "external_links": [], "published": "2017-12-24T10:00:00.000+02:00", "crawled": "2017-12-24T11:11:12.031+02:00", "highlightTitle": ""}