{"organizations": [], "uuid": "b0845cbf92d45ae66f0d04d91876ff052e420807", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article817921.ece/ALTERNATES/s1200/Train-at-Dawlish.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/business/lets-tackle-road-rail-digital-954185", "country": "GB", "title": "Let's tackle our road, rail and digital not-spots in 2018", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-28T02:00:00.000+02:00", "replies_count": 0, "uuid": "b0845cbf92d45ae66f0d04d91876ff052e420807"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/lets-tackle-road-rail-digital-954185", "ord_in_thread": 0, "title": "Let's tackle our road, rail and digital not-spots in 2018", "locations": [], "entities": {"persons": [{"name": "melanie squires", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "south west nfu", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "templeton bonfire night", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It vows to present a strong unified case for investment while pledging to take the lead for regional prosperity. \nAmong its priorities is 5G and digital connectivity to boost rural enterprise. Read More More than 1,000 jobs created in Devon, Cornwall and the South West with £8million regional funding \nMelanie Squires, regional director South West NFU, a partner in the #BackTheSouthWest campaign, said: \n“One infrastructure improvement that will help unlock the potential of farm businesses over the next twelve months is making sure they can access superfast broadband in an affordable way and use mobile technology across the farm. Templeton Bonfire Night has a theme each year – and in 2017 they decided to choose BT Openreach in protest over slow broadband speeds (Image: CameraFirm) \nThe NFU has called on the government to make the digital economy universal and lay the foundations for fifth generation (5G) technology, to allow the full delivery of the Government’s agri-tech and industrial strategies. This will benefit rural communities and businesses by attracting more investment, which will improve job prospects, and minimising rural isolation, which will improve mental health and well-being. Read More \n“We are much stronger together than we are apart and we must pull together to maintain these wider businesses, safeguard all the jobs they support and help get the outcome our industry deserves.” How the inside of the Oceansgate industrial units will look \nThe region’s science parks, nuclear skills at Hinkley Point C, Plymouth’s Oceansgate marine hub, aerospace sector at Goonhilly and Newquay and healthcare sectors are big growth areas for the region. What a spaceport could look like \nIn Cornwall, Newquay’s bid for the spaceport and the resurgence of the mining industry are among the year’s highlights. \nKim Conchie, Chief Executive of Cornwall Chamber of Commerce said the spaceport could unlock huge potential for the region. \nHe said: “We need to lead the 21st Century employment agenda on flexible working, men and women being equal in the workplace, mental and physical wellbeing in the workplace, the inclusivity agenda and digitally enabled businesses ruling the world. \n“To help us lead, we need the UK’s leading horizontal take off Spaceport for a mere fraction of Government spending that HS2 is costing. I’m sensing that Cornwall’s values as a modern digitally-driven economy are beginning to align to attract people to work in Cornwall, start a business in Cornwall, study in Cornwall, holiday in Cornwall, invest in Cornwall and live in Cornwall.” Read More This is how the Westcountry has been left hanging in the Chancellor's Budget \nMichael Beadel, chairman of Stephens Scown LLP, one of the partners in the #BackTheSouthWest campaign said major players like Canadian company Strongbow Exploration are poised to bring tin mining back to the region, alongside the prospect of a new industry in lithium exploration means there is much to be optimistic about in 2018, with the right backing. Cornish Lithium and Tregothnan Estates have signed a deal to exploit any lithium found in the ground underneath the estate outside Truro - L to R: Darran Goldby (Tregothnan), Simon Gregory (Foot Anstey), A Boscawen, Hon EAH Boscawen, Jeremy Wrathall (Cornish Lithium), Derek Linfield (Cornish Lithium), Andrew Jarvis (Tregothnan) \nHe said: “This potential new dawn for mining must be supported by local and central government, to ensure it brings the jobs Cornwall needs.” \nHowever, he highlighted that uncertainty over funding for committed projects after Brexit will continue to trouble businesses. \nHe said: “ Whatever the funding arrangements end up being after Brexit, the South West needs to speak with one voice to ensure that our region does not lose out. \nGeorge Cowcher, Chief Executive of Devon Chamber of Commerce agreed. \nHe said: “The big wish for 2018 is that there are no sudden shocks or surprises to throw the economy off course. In particular local companies want to see trading conditions with a stable pound, supportive employment laws, very gradually rising interest rates if they have to rise and a local unity of purpose to take forward the economy together. \n“That unity of purpose with involve sustained lobbying for infrastructure improvements, particularly in respect of broadband, road and rail; a Brexit settlement that will ensure business has access to necessary European labour and has as tariff and barrier free access to the European Market, and assistance to improve productivity and innovation to improve wages and living standards.” A train coming into Barnstaple Train Station (Image: Rob Tibbles) \nRichard Walford, Real Estate Partner and Head of Property, Infrastructure and Construction at Foot Anstey, a partner in the #BackTheSouthWest campaign, said that untapped potential in North Devon could be reached by a dual rail line between Exeter and Barnstaple – cutting journey times to 30 minutes and creating a direct route to London. \nHe said: “ It has great natural beauty and is also home to some really thriving businesses in advanced technology and engineering sectors. \n“This upgrade would open the North Devon region to huge business and commuting opportunities bringing it closer to the rest of the South West as well as boost its accessibility as a preferred tourist destination.” \nMeanwhile, Pennon Group said a need to take care of the environment, support the regional economy and safeguard investments were among its business proposals for 2020-25. \nIn March, it is taking the consultation to customers. Inside SWW Mayflower Treatment Works, scheduled to become operational in September 2018 (Image: Penny Cross) \nDr Stephen Bird, Managing Director, South West Water, said: “Our big hope for the new year is that as many people as possible will get involved and help us make some important decisions about the future by providing feedback. \n“The proposals will cover everything from how we plan to continue delivering high quality drinking water through to investments designed to help make sewer flooding and pollution a thing of the past. \n“We must also ensure we can cope with future challenges such as climate change and population growth. In some areas this means acting sooner rather than later in order to prevent a dramatic impact on water bills in the future. This includes making the most of new and innovative technologies and ways of working, and also building even stronger relationships with regional partners in both the public and private sectors, including our universities.” Like us on Facebook", "external_links": [], "published": "2017-12-28T02:00:00.000+02:00", "crawled": "2017-12-28T02:41:41.016+02:00", "highlightTitle": ""}