{"organizations": [], "uuid": "eae336f5e98a53b1a4f7e4c0a2eb840de5dfdbf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article924382.ece/ALTERNATES/s1200/sarahPNG.png", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/brexit-rebel-sarah-wollaston-hits-924607", "country": "US", "title": "Brexit rebel Sarah Wollaston hits back over 'self-consumed malcontent' headline - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.036, "site_type": "news", "published": "2017-12-14T13:04:00.000+02:00", "replies_count": 0, "uuid": "eae336f5e98a53b1a4f7e4c0a2eb840de5dfdbf8"}, "author": "Guy Henderson", "url": "http://www.devonlive.com/news/devon-news/brexit-rebel-sarah-wollaston-hits-924607", "ord_in_thread": 0, "title": "Brexit rebel Sarah Wollaston hits back over 'self-consumed malcontent' headline - Devon Live", "locations": [], "entities": {"persons": [{"name": "sarah wollaston", "sentiment": "none"}, {"name": "dr wollaston", "sentiment": "none"}, {"name": "wollaston", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "tory brexit", "sentiment": "none"}], "locations": [{"name": "wollaston", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "invalid email  totnes", "sentiment": "none"}, {"name": "bbc radio devon", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sometimes parliament", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTotnes MP Sarah Wollaston has hit back over today's Daily Mail front page headline which brands her a 'self-consumed malcontent' for joining a Tory rebellion over Brexit in the Commons last night. The Brexit-supporting newspaper asks if the rebels are proud of themselves for what they did. \nSpeaking on BBC Radio Devon, Dr Wollaston said: \"Sometimes Parliament just has to put its foot down and say no, and that is what happened last night. Read More Devon MP described as a ‘self-consumed malcontent’ after disagreeing with PM over Brexit \n\"It's easy to look at a headline screaming from the Daily Mail and not look at what is behind it. I hope my constituents will look behind it and see what is genuinely going on here. \n\"I'm not going to obstruct Brexit. There is a responsibility to get the very best possible deal, and it's the job of MPs to make sure we get it. \n\"I have to respect the result of the referendum but I've got to do my job in making sure that we get the best possible deal.\" \nThere were calls for Dr Wollaston to be deselected as the Conservative MP for Totnes after she joined the rebellion of a dozen Tory rebels who inflicted a humiliating defeat on the Prime Minister as they voted to give MPs a 'meaningful vote' on leaving the EU. Read More Devon MP among Tory Brexit rebels inflicting major defeat on Theresa May Sarah Wollaston on the Daily Mail front page today \nDr Wollaston found herself on the front pages today, with the Mail picturing her in a rogues gallery and asking if she and the others were proud of themselves for being 'self-consumed malcontents' to 'pull the rug from under our EU negotiators, betray their leader, party and 17.4m Brexit voters and - most damning of all - increase the possibility of a Marxist in No.10' \nDr Wollaston told the BBC local radio station said the vote was about giving the Brexit bill proper scrutiny. She said: \"This wasn't a vote to stop Brexit, it was just to put in place the thing we all voted for, which was to bring back control to Parliament. \n\"We didn't vote to bring back control to a government minister to make a decision without Parliament being able to look at it. It was about genuinely making sure that we do have a meaningful vote. Read More ", "external_links": [], "published": "2017-12-14T13:04:00.000+02:00", "crawled": "2017-12-14T20:15:48.002+02:00", "highlightTitle": ""}