{"organizations": [], "uuid": "ec78ab5f07fecc9b1e291555bd7722fc506db336", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article871627.ece/ALTERNATES/s1200/17125685-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/ex-royal-marine-fears-wife-871625", "country": "GB", "title": "Ex Royal Marine fears wife of 24 years could be sent home after Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-04T10:35:00.000+02:00", "replies_count": 0, "uuid": "ec78ab5f07fecc9b1e291555bd7722fc506db336"}, "author": "Neil Shaw", "url": "http://www.devonlive.com/news/devon-news/ex-royal-marine-fears-wife-871625", "ord_in_thread": 0, "title": "Ex Royal Marine fears wife of 24 years could be sent home after Brexit", "locations": [], "entities": {"persons": [{"name": "brexit francoise milne", "sentiment": "none"}, {"name": "olivia", "sentiment": "none"}, {"name": "brock", "sentiment": "none"}, {"name": "francoise", "sentiment": "none"}, {"name": "francoise milne", "sentiment": "none"}, {"name": "milne", "sentiment": "none"}, {"name": "louis  ms milne", "sentiment": "none"}, {"name": "simon milne", "sentiment": "none"}], "locations": [{"name": "bosnia", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "brexit ex royal marine", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "dec", "sentiment": "none"}, {"name": "royal marines", "sentiment": "none"}, {"name": "royal marine", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ex Royal Marine fears wife of 24 years could be sent home after Brexit Francoise Milne applied for permanent residency after the Brexit vote but that has been rejected Share Neil Shaw Head of Digital 08:35, 4 DEC 2017 Click to play Tap to play The video will start in 8 Cancel Play now   \nAn former Royal Marine and serving bodyguard to the Queen has been left \"angry and frustrated\" after his French wife of 24 years was left fearing for her future right to stay in the UK. \nSimon Milne MBE, 58, has served in Northern Ireland and Bosnia and is one of 27 Gentlemen at Arms who guard the Queen on royal occasions. \nHis wife Francoise, 50, applied for a permanent residency card after the Government \"failed to clarify\" the future rights of EU nationals living in the UK. \nMs Milne, who has three children with her husband, said her application was refused in October as she could not prove she was \"self-sufficient\", adding she has been left \"scared and confused\" about the future. \nThe couple's MP has written to ministers and raised their case in a Commons debate last week. Francoise Milne and Simon Milne after receiving his MBE and just before he was leaving for Bosnia in 1995 \nMr Milne said he finds the decision \"extraordinary\". \nHe said: \"With the uncertainty around Brexit at the moment my wife decided to apply for permanent residency. \n\"She has supported me through my career with the Royal Marines and now in my current role. \n\"I am flabbergasted with this decision, I am angry and frustrated. I can only hope that it is an unintended oversight.\" \nMs Milne told the Press Association that her \"world has been shattered\" by the Brexit vote. \nShe said: \"It felt like I had been cut in half when the vote came back yes, my children were crying. \n\"I never felt I needed to claim dual nationality before, I could move about freely and work freely, now it feels like a lot of freedom has gone.\" Francoise Milne (2nd right) and Simon Milne (2nd left), with children Charlotte, Olivia and Louis \nMs Milne said she was refused a residency card because she could not prove she was \"self-sufficient\". \nShe said: \"I do a little bit of upholstery, I never make enough to support myself and rely on my husband. \n\"They will not take into account that I am married to a British man, that is irrelevant, it's hard to believe. \n\"I don't know what will happen after 2019, I don't know if there will be time limits on how long I can stay in the country, if I want to leave to see my parents in France I don't know what the rules will be on coming back. \n\"I have participated in British society, I have raised three intelligent lovely children, I have voted, I have worked, I am, I have been a citizen.\" \nMs Brock said: \"The Government says EU nationals shouldn't worry, then refuses residency to long-term citizens like Francoise. Read More", "external_links": [], "published": "2017-12-04T10:35:00.000+02:00", "crawled": "2017-12-04T10:44:36.001+02:00", "highlightTitle": ""}