{"organizations": [], "uuid": "15b946c5bdc76c4bf33927877ff66885009fe7d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14009371.ece/ALTERNATES/s1200/to-come.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-north-east-could-look-14008098", "country": "GB", "domain_rank": 21960, "title": "How the North East could look in years to come: The big projects planned and when they will begin", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-10T13:00:00.000+02:00", "replies_count": 0, "uuid": "15b946c5bdc76c4bf33927877ff66885009fe7d9"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-north-east-could-look-14008098", "ord_in_thread": 0, "title": "How the North East could look in years to come: The big projects planned and when they will begin", "locations": [], "entities": {"persons": [{"name": "andrew jones", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "allerdene bridge", "sentiment": "none"}, {"name": "low carbon enterprise zone", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northern spire bridge", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ellingham", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "birtley", "sentiment": "none"}, {"name": "new wear crossing", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "central station", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "coal house", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "wear metro", "sentiment": "none"}, {"name": "sunderland strategic corridor", "sentiment": "none"}, {"name": "northern spire", "sentiment": "none"}, {"name": "ageing science and innovation", "sentiment": "none"}, {"name": "tyne & wear metro", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "national infrastructure and construction pipeline", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "There's big transport projects planned for the North East Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North East could change dramatically in the years to come when a number of big spending projects get off the ground. \nThey include major road and rail improvements, as well as a major university scheme and flood prevention measures. \nThe Treasury published details in what it calls the National Infrastructure and Construction Pipeline. It’s a list of infrastructure projects which have been confirmed, with the money allocated. \nAndrew Jones MP, Exchequer Secretary to the Treasury, said: “We are backing Britain with a record amount of infrastructure investment as we build an economy fit for the future. That’s why we’re working with the industry to skill up and scale up for the challenges ahead.” \nTransport Secretary Chris Grayling said: “We’re undertaking the most ambitious improvements in our transport network this country has seen for decades. But we must also drive forward plans to ensure these infrastructure projects are completed on time and on budget.” \nHere we run through a list of the major schemes planned. Already under way \n• There’s £94.40m for the Sunderland Strategic Corridor , a 2km link between the New Wear Crossing and the city centre, which among other things will improve connectivity to the city from the Nissan plant, the Low Carbon Enterprise Zone and International Advanced Manufacturing Park. Work began in 2015 and will continue until 2021. Naming of the new Sunderland bridge, Northern Spire (Image: Newcastle Chronicle) \n• Funding for improvements to the New Wear Crossing (now named Northern Spire Bridge). Work began in 2015 and will be completed in 2018. The total spend of £117.6m includes £82.5m from central Government. \n• A National Centre for Ageing Science and Innovation, based at Newcastle University , to lead the UK’s efforts to improve the health and well-being of older people by developing new technologies and services. \nWork began this year and it is due to be up and running in 2019. The total spend is £40m, with £20m directly from the Government. \n• Funding of £32.8m for maintenance and street lighting in the North East, from the Government’s ‘Challenge Fund’. Work began in 2015 and will be completed in 2018. \n• Extra funding for local authorities and schools to create new places and improve buildings. The North East gets £476.8m between 2015-16 and 2021-22. Read More Could strike action be on the cards? Fury over pay cuts that have led to staff shortages \n• Mine water treatment schemes in Northumbria. There’s £4.14m between 2015-16 and 2027-28 \n• Flood protection to reduce the risk to 3,850 homes, at a cost of £161.2m including £107.1m in public funding. Work began in April 2015 and is expected to end in March 2021. There’s also a separate flood protection scheme to reduce the risk to 1,135 homes, costing £85.5m including £44.4m in public funding. \n• A programme of improvements to the East Coast Main Line began in 2014 and is continuing. This is paid for through a £171m ‘East Coast Connectivity Fund’. \nSeparately, work began this year on a £210m project to improve the power supply on the East Coast Main Line, to allow faster, quieter and cleaner trains to run. No competition date has been confirmed. \n• And the Treasury document highlights improvements at Newcastle Airport, even though these are privately funded. The airport is extending its terminal as part of a multimillion-pound investment to boost passenger facilities including an expanded immigration hall. Other improvements include a new radar system. Work began this year and it will cost £53.6m. Beginning 2018 \n• There’s £12m for road maintenance and flood mitigation in the North East as part of the Government’s ‘Challenge Fund’. Work is due to begin in 2018 and continue to 2020. \n• Improving the junction between the A19 and A184, providing free-flowing access to the southern end of the Tyne Tunnel. Work begins in 2018-19 and is due to be completed in 2020-21, at a cost of £75m to £100m. \nReplacement of the junction between the A19 and the A1058, allowing free-flowing movement for traffic along both the A19 and A1058. Work has already begun, at a cost of £101.6m, and will be completed in 2018-19. Beginning 2019 \n• Improvements to the A1 and A19 across Tyne and Wear by adding new technology including vehicle detection loops, CCTV cameras and driver information signs. The aims is to allow better information to drivers and active management of traffic. \nWork is due to begin in 2019-2020 and the completion date has not yet been confirmed. It will cost between £100m and £150m. \n• Widening the A1 south of Gateshead , from Birtley to Coal House, to three lanes. This also includes replacing and improving the Allerdene Bridge, which carries the A1 over the East Coast Main Line. \nWork is due to begin in 2019-20 and no end date has been confirmed. The cost will be £250m to £300m. Read More Brexit chief says Government did NOT study impact of Brexit on sectors of the economy \n• Measures to enhance the A1 north of Ellingham, including three stretches of climbing lanes totalling 2.5 miles; five junctions enhanced with dedicated right-turn facilities, and better crossings for pedestrians and cyclists. Work is due to begin in 2019-20 with no completion date set, and the cost is £200m to £300m. \n• Upgrades to the A1 around Newcastle. This involves 4.5 miles of narrow lane widening to allow three lanes of traffic through the junctions 74 and 79, with 4 lanes between some junctions. Work begins in 2019-20 with no end date set. The cost is £100m to £150m. Expected in 2021 Tyne and Wear Metro at Central Station \n• Replacing the Tyne & Wear Metro’s nearly 40-year-old rolling stock with modern energy-efficient trains. The new feet will cut running costs while boosting performance and reliability for the 38 million passengers that use the system annually. The Treasury documents do not confirm a date for this work, but set the cost at £274.14m. The Treasury has said elsewhere that it will provide £337 million in total, and the trains are expected to be in place by 2021. What’s not included \n•What’s not included is future schemes which haven’t been confirmed. For example, the Government says it wants to build a new rail line from the North East to the North West, but it’s waiting for Transport for the North to publish firm proposals. \nIt hasn’t yet confirmed any funding for the proposed rail line, so the project isn’t on this list. \nAlso excluded are national schemes which may benefit the North East if no money has been allocated to the region yet. For example, regions have been invited to bid for a share of £1.7bn “Transforming Cities Fund” to improve transport services to big cities. But it’s not all good news \nThe Treasury document shows that central and local Government investment in the North East is £1,347 per person between 2017-18 and 2020-21. \nThis is lower than in most other parts of the country. In London, the figure is £2,520 per person, and in the North West it is £2,283 per person. Per Capita Regional Investment by funding source 2017/18 to 2020/21 \nRegion Central and local government Private Total \nEast of England £1,578 £1,635 £3,213 \nEast Midlands £1,445 £1,782 £3,227 \nLondon £2,520 £1,513 £4,033 \nNorth East £1,347 £1,847 £3,194 \nNorth West £2,283 £1,403 £3,686 \nSouth East £1,815 £1,536 £3,351 \nSouth West £1,498 £2,274 £3,772 \nWest Midlands £1,777 £1,320 £3,097 \nYorkshire and the Humber £1,266 £1,695 £2,962 Like us on Facebook ", "external_links": [], "published": "2017-12-10T13:00:00.000+02:00", "crawled": "2017-12-10T16:23:27.003+02:00", "highlightTitle": ""}