{"organizations": [], "uuid": "15d86217591d8a484b4571b8cee56785fa08c20e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.nottinghampost.com/incoming/article963912.ece/ALTERNATES/s1200/JS114718599.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/blue-british-passports-brought-after-963927", "country": "GB", "domain_rank": 48128, "title": "Blue British passports to be brought in after Brexit", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-22T09:22:00.000+02:00", "replies_count": 0, "uuid": "15d86217591d8a484b4571b8cee56785fa08c20e"}, "author": "Isaac Ashe", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/blue-british-passports-brought-after-963927", "ord_in_thread": 0, "title": "Blue British passports to be brought in after Brexit", "locations": [], "entities": {"persons": [{"name": "brandon lewis", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nBritish blue passports are set to return after we leave the European Union. \nThe burgundy EU versions, with the European Union insignia, which are tucked safely away in many of our homes will be replaced with new blue ones after Brexit means Britain leaves the EU in 2019. \nHome Office Minister Brandon Lewis has said the new passport will be the \"most high-tech and secure we have ever seen,\" making it more resistant to fraud and forgery. \nA £490 million contract to redesign and produce a new version of the document was announced earlier this year. Read More These 2p coins could be worth at least £100 \nThe passport is routinely redesigned every five years and Eurosceptics view the new contract as a way to ditch the EU burgundy cover in favour of a return to the colour of the past. \nMr Lewis said: \"Leaving the EU gives us a unique opportunity to restore our national identity and forge a new path for ourselves in the world. (Image: Home Office/PA Wire) \n\"That is why I am delighted to announce that the British passport will be returning to the iconic blue and gold design after we have left the European Union in 2019. \n\"It will also be one of the most secure travel documents in the world, with a raft of new security measures to protect against fraud and forgery.\" \nThe new passports will be phased in after the UK leaves the EU on March 29, 2019. \nBurgundy passports will continue to be issued, although without the European Union markings, until the current supplier's contract expires in October 2019. \nThe new blue and gold design will then be issued to people renewing or applying for a new passport. \nBlue was first used for the cover of the British passport in 1921, but the design changed in 1988 after the UK joined the European Economic Community and burgundy was chosen as the common colour. \nAmong the new design features will be a new picture page made of a \"super-strength plastic polycarbonate material that will be more difficult to alter\", the Home Office said. \nBritish passport holders do not need to do anything until their renewal date. Like us on Facebook ", "external_links": [], "published": "2017-12-22T09:22:00.000+02:00", "crawled": "2017-12-22T11:23:17.005+02:00", "highlightTitle": ""}