{"organizations": [], "uuid": "d02d48068ed592c7ec3f5f7c5cb574528f71895b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13663825.ece/ALTERNATES/s1200/SGP_NEC_200617NEWGATE03JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-economy-growing-faster-14027379", "country": "GB", "domain_rank": 21960, "title": "North East economy growing faster - but it's still being left behind rest of UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-13T07:00:00.000+02:00", "replies_count": 0, "uuid": "d02d48068ed592c7ec3f5f7c5cb574528f71895b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-economy-growing-faster-14027379", "ord_in_thread": 0, "title": "North East economy growing faster - but it's still being left behind rest of UK", "locations": [], "entities": {"persons": [{"name": "sandra thompson", "sentiment": "none"}, {"name": "henri murison", "sentiment": "none"}, {"name": "thompson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "newgate", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "gva", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "ernst & young", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "wear metro", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cancel play", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "northern powerhouse partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Construction work underway on the site of the old Newgate street shopping centre, Newcastle (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North East is being left behind as the UK economy grows, analysis from a leading accountancy firm has revealed. \nEconomic growth in the North East will be slower than in any other region or nation of the UK, according to chartered accountants EY. \nAnd there has been no progress on rebalancing the UK economy geographically over the last three years, while the economic divide between the North and South of the UK will continue to expand. \nThe analysis from EY, previously known as Ernst & Young, will be seen as evidence that the Government has so far failed in its goal of improving the economic prospects of the North of England. \nHowever, the North East economy will grow faster between 2017 and 2020 than it did from 2014 to 2017. \nAnd some parts of the North East, including Newcastle , are performing better than the region as a whole. \nSandra Thompson, North East Senior Partner at EY, said: “These figures only tell part of the North East’s story. What the statistics don’t show is that there are lots of hubs for exciting, dynamic activity coming online across this region and particularly in Newcastle – from the development of Science Central, which is to also be home to a new £50m National Innovation Centre, to the many start-up and entrepreneurial businesses setting up and investing in the region.” Read More Labour party could create a regional Bank of England office in Newcastle \nThe region is predicted to see average annual “gross value added” or GVA growth, a measure of economic output, of 1.2% between 2017 and 2020. This is the lowest growth in the country and below the UK average of 1.8%, but it is a considerable increase on the 0.9% expected for 2014 to 2017. \nCities in the North East are performing better individually than the regional statistics suggest. In terms of GVA, Newcastle can expect to see a very strong 2014 to 2017 performance of 2.9% growth, but this is expected to slow in the years to 2020 to around 1.7%. \nTeesside and Sunderland , however, are forecast to see an uplift - from 0.9% to 1.1% and -0.02% to 1.6% respectively. \nThey will also see improvements in their employment statistics, having both been the worst performers between 2014 and 2017. \nTeesside’s employment figures will continue to decline but at a reduced rate of -0.2% in to 2020 compared with -0.7% in 2014 to 2017. Sunderland, meanwhile will move from -0.6% between 2014 and 2017 to positive employment growth of 0.02% to 2020. \nMs Thompson said the planned “North of Tyne” devolution deal , creating a new combined authority and elected mayor for Newcastle, North Tyneside and Northumberland, would help the economy to grow. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAnd she also highlighted funding for new trains for the Tyne and Wear Metro. \nShe said: “The North of Tyne devolution deal means that important decisions about what is best for the region, being made by those who live here, will help create a momentum that will lead to economic development, business growth and job creation in the North East. \n“That could be the driver of some of the social changes we need to see happen in this region if the productivity figures are really going to change – but even the Metro feeds in to that – helping people get to their place of work.” Read More Theresa May urges EU nationals to stay in the UK after agreeing Brexit deal \nBut EY warned there haf been no progress on rebalancing the UK economy geographically over the last three years and the economic divide between the North and South of the UK will continue to expand, albeit at a slower rate than previously, the report reveals. \nLondon and the South East will continue to outperform all other UK regions through to 2020 with Gross Value Added (GVA) growth per year averaging 2.2% and 2.0% respectively compared with 1.79% for the wider UK. \nHenri Murison, Director of the Northern Powerhouse Partnership , said: “The findings from EY that the north – south divide needs more focus from government and business, along with our civic leaders here in the Northern Powerhouse, is one we recognise and as such identified a route map to address the productivity divide on in our Powerhouse 2050 report published earlier this year. \n“The North of England has prime capabilities in energy, advanced manufacturing and materials, health innovation and digital – unlocking innovation, investment and exports from these areas will drive knowledge in enabling capabilities like financial and professionals services.” Like us on Facebook", "external_links": [], "published": "2017-12-13T07:00:00.000+02:00", "crawled": "2017-12-13T08:23:19.007+02:00", "highlightTitle": ""}