{"organizations": [], "uuid": "a4ddf9a37254859fe995d2b357c37b9fee34d3c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11257385.ece/ALTERNATES/s1200/JS86337785.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-seeks-assurances-80-million-14012106", "country": "GB", "domain_rank": 21960, "title": "Newcastle seeks assurances about £80 million European Union funding", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-08T18:00:00.000+02:00", "replies_count": 0, "uuid": "a4ddf9a37254859fe995d2b357c37b9fee34d3c7"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-seeks-assurances-80-million-14012106", "ord_in_thread": 0, "title": "Newcastle seeks assurances about £80 million European Union funding", "locations": [], "entities": {"persons": [{"name": "helen dickinson", "sentiment": "none"}, {"name": "dickinson", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "arlene foster", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "european union", "sentiment": "negative"}, {"name": "commons treasury committee", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "universal credit studies  earlier", "sentiment": "none"}, {"name": "the cabinet", "sentiment": "none"}, {"name": "shared uk prosperity fund", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "local government committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle seeks assurances about £80 million European Union funding Impact on economy and jobs market 'should not be underestimated' if money is not replaced, says Newcastle Share Get daily   Thank you for subscribing!   \nNewcastle City Council has asked for reassurances about whether the Government will replace £80 million in funding currently provided by the European Union. \nThe city is due to receive at least £80m of the £420m earmarked for the North East between 2014 and 2020. \nEU money has been used to provide loans to employers, allowing them to expand, fund university research and help pay for major building projects. \nBut it’s unclear whether the funding will continue after Brexit takes place. \nHelen Dickinson, speaking to an inquiry in the House of Commons, Newcastle City Council’s assistant chief executive, said: “That funding is really critical to our ability to support our local economies.” \nThe Government has announced plans to set up a new scheme, called the Shared UK Prosperity Fund, which will replace EU money. EU and Union flags (Image: PA) \nBut Newcastle City Council said it was not clear whether the same level of funding would come to the North East under the new system. \nIt pointed out that EU funding goes directly to the regions, while Government funding schemes tend to be controlled by Whitehall. \nAnd EU funding is allocated based on “need”, which means it goes to areas such as the North East with relatively poorly-performing economies, based on economic output per person. \nIn a written submission to the Communities and Local Government Committee, which is holding an inquiry into the impact of Brexit on local authorities, Newcastle said: “We are concerned about the timeline, implications, and attractiveness of local institutions as investment partners if a future fund is not in place by March 2019. Prime Minister Theresa May (Image: AP) \n“If the momentum created by continuous EU, regional and local investment is lost, growth rates and the pace of development may be affected. The risk of a cliff edge effect on the economy and labour market should not be underestimated.” \nThe paper, and evidence given in person by Ms Dickinson, will be used by MPs to produce a report early next year which will be published and submitted to the Government . Read More Online fraud victims are too embarrassed to report their loss - experts reveal \nIt came as the Government’s handling of Brexit came under the spotlight as never before. \nBrexit Secretary David Davis insisted the UK government had produced no economic forecasts on the impact of Brexit on various sectors of the economy - apparently contradicting his previous claims. Brexit secretary David Davis (Image: PA) \nLast year he said that his department was “in the midst of carrying out about 57 sets of analyses” on different parts of the economy. And in October this year, he told the Brexit committee that Prime Minister Theresa May had read “summary outcomes” of impact assessments, which he said went into “excruciating detail”. \nBut on Wednesday he told the committee that “no systematic impact assessments” had in fact been carried out. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nChancellor Philip Hammond revealed that the Cabinet has not yet had a full discussion of what should be the Government’s preferred “end state position” for the UK after Brexit. It suggests the Government doesn’t know what sort of deal it wants to agree with the EU. \nMr Hammond told the Commons Treasury Committee: “The Cabinet has had general discussions about our Brexit negotiations, but we haven’t had a specific mandating of an end-state position. \n“That is something that will be done first in the sub-committee constituted to deal with this issue, and logically that will happen once we have confirmation that we have reached ‘sufficient progress’ and are going to begin the phase two process with the European Union.” Read More Labour has just forced the Government into a climbdown over Universal Credit studies \nEarlier this week, the Democratic Unionist Party, which is propping up Theresa May’s government, scuppered a deal which could have enable talks between the EU and UK to move the second phase, saying they could not accept the Government’s proposal that there should be continued “regulatory alignment” between the Northern Ireland and Ireland. \nDUP leader Arlene Foster said it amounted to imposing a “border in the Irish Sea” between Northern Ireland and the rest of the UK. Like us on Facebook", "external_links": [], "published": "2017-12-08T18:00:00.000+02:00", "crawled": "2017-12-08T19:53:42.003+02:00", "highlightTitle": ""}