{"organizations": [], "uuid": "e692de1898c90d126ba8ba85bb0ffeeeb27b1c20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14094238.ece/ALTERNATES/s1200/Bottom-Bay.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/20-essential-tips-before-you-14092717", "country": "GB", "domain_rank": 21960, "title": "These are the 20 essential tips before you book your 2018 summer holiday", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-31T10:00:00.000+02:00", "replies_count": 0, "uuid": "e692de1898c90d126ba8ba85bb0ffeeeb27b1c20"}, "author": "Mr Justice", "url": "http://www.chroniclelive.co.uk/news/north-east-news/20-essential-tips-before-you-14092717", "ord_in_thread": 0, "title": "These are the 20 essential tips before you book your 2018 summer holiday", "locations": [], "entities": {"persons": [{"name": "revolut", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News These are the 20 essential tips before you book your 2018 summer holiday From flying by night to how to avoid losing your fee if you cancel your plans - the tips everyone should read before booking holidays Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nin the bleak mid-winter everyone’s thoughts turn to...sunshine holidays abroad. \nJanuary is a time to think about booking that summer trip you’ve always wanted, long lazy days on the beach, and dancing the night away. \nHere are 20 ways you could save money by being canny or just knowing your rights. 1. Ever heard someone claim it’s cheaper to fly at night. It’s true. \nThe internet bank Revolut says night flights can work out better value. \nThey say: “The downside of flying in the evening is that you can arrive at your destination in the small hours, but if you are willing to put up with that inconvenience, evening flights typically cost 30% less than afternoon flights. \n“Another added bonus is that there are usually less passengers therefore you spend less time battling to get off the plane and queuing for your luggage.” Bottom Bay is one of the most beautiful beaches on the Caribbean island of Barbados. It is a tropical paradise with palms hanging over turquoise sea (Image: iStockphoto) 2. Booking flights in foreign currency can save you money. \nRevolut say: “So long as you’re not encountering any additional fees and charges from your bank, booking flights using a different currency can save you hundreds of pounds. \n“Although this is more common for journeys around Asia, it is possible to save some money by paying using a different currency. \n“For example, you can save around £15 on a journey between London and New York, if you pay using Danish Krone.” 3. You get the best deals on Tuesday - true or false? \nFalse. “This used to be true back in the day, as airlines would release new fares to travel agents every Tuesday,” says Revolut. \n“But now with the internet, new deals and sales are released every single day. \n“It’s doesn’t matter when you buy, it’s about when you choose fly. Flying off-peak, or in the evening, is more likely to lower your fare than booking on a Tuesday.” Newcastle airport baggage system (Image: Newcastle Chronicle) 4. This is one for people who book online. \nRevolut say: “Ever wondered why prices on comparison sites and marketplace can suddenly surge when you click to the checkout? \n“Airlines and booking sites have come up with a sneaky way to charge you more. \n“They can record your browser history by installing cookies on browsers, meaning they can compare their price with what you have viewed previously and bump up the price as they see fit. \n“To avoid this, clear your browser cache and cookies and turn on private browsing before you go window shopping on airlines or booking sites.” 5. Planning to travel with your dog? \nYou will need a pet passport, says Lintbells, manufacturers of premium pet supplements. \nThey say: “A passport for your pooch is one of the most important things you will need to organise before your trip. \n“To go in and out of the UK you will need an EU Pet Passport, this needs to be sourced from a government-authorised vet known as a Local Veterinary Inspector (LVI). \n“Sections I-V of the passport needs to be filled in by your vet detailing your pet’s vaccination records and evidence of their microchip.” Scores of people enjoy the sunshine and warm weather (Image: Daily Mirror) 6. Planning ahead is even more important when you have a dog. \n“Although you can now take your dog to many countries with ease it is still important to check out the country you’re visiting as rules and requirements can vary from place to place, “ say Lintbells. \n“Don’t leave it until the last minute to pick your destination, do your research within plenty of time and consult your vet to make sure you and your pooch have everything required to safely enter the country. \n“It’s also important to research your accommodation to make sure they will accept dogs, whether it be a hotel, apartment or caravan.” 7. Prepaid currency cards have given UK holidaymakers heading overseas a ray of hope in securing better exchange rates following the volatility of the pound in the aftermath of Brexit. \nYourMoney.com says they are a more convenient and safer alternative to carrying cash and as you can load them up before you go abroad. \nTravellers can lock in lock in exchange rates when factors which could adversely impact the value of the pound are due to come into play. \nBut watch out for fees which some companies impose for not using the cards often enough. 8. Considering self-catering? \nThe insurance company MORE TH&N says the popularity of sites such as Airbnb has led to an increase in the number of people holidaying this way - but there’s a catch. \nThey say: “A new study from MORE TH&N Insurance reveals the trend of choosing self-catered accommodation is attributing to an increase in injuries being suffered while on holiday – including burns and breaks. \n“With self-catered accommodation requiring tenants to cook for themselves using provided kitchen equipment, it is no surprise that a quarter (26%) have suffered from food poisoning or stomach related problems as a result of underprepared food and 24% from cuts or burns whilst using unfamiliar kitchen utensils.” 9. Beware of holiday scams - including fake online sites. \nFraudsters are creating websites to advertise flights, accommodation and even timeshare offers, says KIS Finance. \n“Sometimes payment via the website is not possible and has to be done by bank transfer,” they say. \n“In some cases customers are informed that payment has to be made this way otherwise they will not be covered by their insurance scheme.” 10. Booking at the last minute works for some but not everyone. \n“This only applies if you are completely flexible on dates, location and airports. Most us will be bound to specific dates and have a preferred destination in mind,” says Revolut. \n“Instead, book your holiday three months in advance and go away in the months of May, September or October where you can save up to a whopping 50% and the weather is still hot.” 11. Revolut say its a myth that it’s cheaper to eat at the hotel. \n“Unless you are all inclusive, eating inside your resort can actually be more expensive than surrounding restaurants, especially if they are family-run.” they say. \n“For the pure convenience, many hotel restaurants can charge up to 20% more for breakfast, lunch and dinner - and especially drinks! \n“As a handy tip, find out where the locals dine out as those restaurants will be less expensive, run by locals and have less tourists.” 12. Look for the best currency exchange deals \nPromotionalCodes say: “Shopping around for the best rates is an easy and effective way to stock up on extra money before you’ve even departed. \n“Always look out for happy hours as well from online exchangers, who offer better rates for a brief amount of time. \n“Never exchange your money at an airport.” 13. Cheers - here’s another tip from Promotional Codes to say a bit of money on wine. \nThey say: “Locally produced wine doesn’t have to go through the same expensive shipping process that foreign imports do, meaning that you will be paying less whilst enjoying the fruits of your local vine", "external_links": [], "published": "2017-12-31T10:00:00.000+02:00", "crawled": "2017-12-31T11:20:11.008+02:00", "highlightTitle": ""}