{"organizations": [], "uuid": "46052e69d5809dc75f823f41ac73fb7d4b53604a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article920116.ece/ALTERNATES/s1200/carolbabbage1.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/woman-turned-down-devon-cleaning-919593", "country": "US", "title": "Woman turned down for Devon cleaning job because she's a migrant - despite living in UK for 50 years and serving in British Army - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.19, "site_type": "news", "published": "2017-12-13T14:12:00.000+02:00", "replies_count": 0, "uuid": "46052e69d5809dc75f823f41ac73fb7d4b53604a"}, "author": "Max Channon", "url": "http://www.devonlive.com/news/devon-news/woman-turned-down-devon-cleaning-919593", "ord_in_thread": 0, "title": "Woman turned down for Devon cleaning job because she's a migrant - despite living in UK for 50 years and serving in British Army - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "carol babbage", "sentiment": "none"}, {"name": "babbage", "sentiment": "none"}, {"name": "satbir singh", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "mid devon", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "invalid email  a plymouth", "sentiment": "none"}, {"name": "british army", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "ms babbage", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "joint council for the welfare of immigrants", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Plymouth company turned away a woman who has lived in UK for 50 years and served in the British Army as she is still classed as a migrant and therefore not entitled to work in this country. \nCarol Babbage, 62, was 12-years-old when she came to the UK from New Zealand with her mother and British stepfather, has indefinite leave to remain in the UK. Read More Eight arrested in crackdown on people trafficking \nHowever, despite having raised three children in the UK and served in the Army in Northern Ireland in the 1970s, the Home Office has told Ms Babbage she still has migrant status, reports the BBC. \nThis effectively means she is not entitled to work in the UK - despite having had a number of jobs in care industry after leaving the British Army. Carol Babbage (Image: BBC) \nMs Babbage has also been told that she will not get a state pension - and now fears access to NHS treatment may also be withdrawn. \nMs Babbage, who married but later divorced a British serviceman, said that she had never applied for a British passport because her New Zealand passport states that she has \"indefinite leave\" to remain in the UK. Read More Man ordered not to put Brexit numberplate on his car - so it's for sale \nThe Home Office told the BBC it was \"considering\" options available to Ms Babbage and she had not been asked to leave. \nShe first realised there was a problem with her citizenship in 2016 when she applied for a cleaning job in Plymouth and was told by the unnamed firm she could not get the work because of her migrant status. Carol Babbage's passport (Image: BBC) \n\"It's impacted me to the core,\" Ms Babbage told the BBC. \n\"If I don't find employment I don't know what is going to happen to me.\" Read More Living in remote areas \"does not mean you just put up what you like\" warn Mid Devon planners \nSatbir Singh from the Joint Council for the Welfare of Immigrants, which campaigns for justice in immigration, said a \"hostile environment\" for immigrants had made things harder for many people who had arrived in the UK as children. \nHe added ordinary people \"who have every right to be here, who have entered legally\" can end up in a similar situation. Like us on Facebook ", "external_links": [], "published": "2017-12-13T14:12:00.000+02:00", "crawled": "2017-12-13T18:32:37.019+02:00", "highlightTitle": ""}