{"organizations": [], "uuid": "e8aa09e4025c15b9df1329776d12dae1b9b75b7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14019937.ece/ALTERNATES/s1200/25189953_10101692095105254_1958104149_o.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-14020620", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Delays across the Metro network due to four withdrawn trains", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-11T08:30:00.000+02:00", "replies_count": 0, "uuid": "e8aa09e4025c15b9df1329776d12dae1b9b75b7b"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-14020620", "ord_in_thread": 0, "title": "North East news LIVE: Delays across the Metro network due to four withdrawn trains", "locations": [], "entities": {"persons": [{"name": "tom eden", "sentiment": "none"}], "locations": [{"name": "metro", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Update on the New York explosion \nOne person has been arrested after an explosion in New York: \nNew York police have reported that the one male suspect - who is now in custody - was injured by the explosion in Manhattan, but no other people are currently reported hurt. Brexit Tom Eden Labour would try to stay in a “reformed single market” \nLabour would try to stay in a “reformed single market” if it was conducting Brexit negotiations, John McDonnell has said, in a fresh signal of the party’s support for a “soft” withdrawal from the European Union. (Image: PA) \nThe shadow chancellor said he stood by his assertion that remaining inside the single market under current rules, which include accepting free movement of EU citizens, would not respect the Brexit referendum result. \nBut he said Labour in government would seek a “negotiated relationship” to ensure “tariff-free access” to “a single market” and “a customs union”. \nDiscussing shadow Brexit secretary Sir Keir Starmer’s comments that Labour would seek to remain “ aligned” with EU rules to ensure the UK can retain the benefits of single market membership, Mr McDonnell said: \n“What I said is that remaining within the single market would not respect the referendum result. \n“What we’ve been using as the phraseology, a single market, not the single market, and a customs union not the customs union, so therefore a reformed single market or a new negotiated relationship with the single market - and (Sir) Keir was actually putting our position yesterday.” \nAnswering questions at an economic report launch in the City of London, he went on: \n“We want to be as close as we possibly can to ensure tariff-free access. \n“It isn’t just about semantics, it’s about choosing the objectives that we want overall which is protecting the economy and protecting jobs. \n“That for us means as close a relationship with the single market as we can and possibly a customs union. \n“The point Keir was making yesterday and which we have reiterated time and time again is we want to keep all the options on the table and that way we think we can protect the economy and at the same time get a negotiated settlement with Europe itself.” Stockton Tom Eden A19 diversion \nFollowing on from my post at 12.53pm, Cleveland Police have tweeted this graphic of the diversion to avoid the A19 closure near Stockton: Jesmond Noise concerns could halt micropub \nFears of noisy and anti-social patrons could halt plans for a micropub in Jesmond. \nPopular corner shop and off-licence Rehill’s of Jesmond has submitted plans to extends its business by converting part of the store into a micropub. Rehill's of Jesmond, which has applied for permission to create a micropub in part of the shop (Image: tark archive) \nThe owners of the Jesmond Road shop have now asked for a licence to sell alcohol on the premises between 11am and 11pm each day. \nThe proposed licence would also enable the pub to show films between 11am and midnight. \nIf approved, the small pub could cater to up to 50 drinkers, but council licensing bosses have raised concerns about the potential noise levels. \nCouncil officer Angela Wallis said she was “concerned that noise transmission from the premises together with noise breakout will be an issue”. \nThe impact on student tenants living above Rehill’s was also raised as part of the objection, due to the lack of sound insulation. \nMs Wallis added: \n“Given the ages of the building, at the time of construction no sound insulation will have been installed between the ground and first floors and there are residents above the site.” USA Tom Eden 'Mystery' explosion in New York \nThe New York Police Department has said it is responding to reports of an “explosion of unknown origin” in Manhattan: 12:53 Tom Eden A19 closed in Stockton \nIf you’re heading a lobg way down the A19 to Stockton, beware that the road is closed southbound following a crash. \nYou’ll be diverted, but frobably after long tailbacks... 12:43", "external_links": [], "published": "2017-12-11T08:30:00.000+02:00", "crawled": "2017-12-11T09:07:48.031+02:00", "highlightTitle": ""}