{"organizations": [], "uuid": "0ddde9affd9c7774bae4ad320342dfc3d8f8a211", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article944381.ece/ALTERNATES/s1200/westwardJPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/devon-unemployment-charity-closes-resulting-944301", "country": "GB", "title": "Devon unemployment charity closes resulting in job losses and unpaid earnings", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-18T19:51:00.000+02:00", "replies_count": 0, "uuid": "0ddde9affd9c7774bae4ad320342dfc3d8f8a211"}, "author": "Anita Merritt", "url": "http://www.devonlive.com/news/devon-news/devon-unemployment-charity-closes-resulting-944301", "ord_in_thread": 0, "title": "Devon unemployment charity closes resulting in job losses and unpaid earnings", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "westward pathfind", "sentiment": "none"}, {"name": "bideford", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}], "organizations": [{"name": "westward pathfinder", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Devon unemployment charity closes resulting in job losses and unpaid earnings Westward Pathfinder says it's not just a blow to its staff but the 3,000 people a year it supports Share   Thank you for subscribing!   \nA charity which helps support the unemployed has closed resulting in nearly 40 job losses with staff not getting paid wages owed or their redundancy. \nDevon-based Westward Pathfinder, which has offices in North Devon, Exeter and Torbay, has blamed funding delays and Brexit for its demise. \nIt says it has not just impacted on its employees but the 3,000 people a year it supports into work or to develop new skills. Westward Pathfinder in Barnstaple \nTwo years ago, when it had 70 employees, redundancies were announced when it was confirmed there would be a gap of six months between receiving new funding. \nLast month the Westward Pathfinder board met with staff from Barnstaple, Bideford, Torbay and Exeter, at its Exeter offices, to announce its doors would be closed for services as three days later on Monday, November 27. \nThe company employed 38 people, of which 20 were based in North Devon, 11 in Exeter and seven in Torbay. \nSteve Keable, former chairman of Westward Pathfinder Board, said half of staff have either been offered jobs or have already started with a new employer. Read More Oxfam shop blames 'ever-growing overheads' as it closes after more than 30 years \nHe said: “During November there had been intense discussions with two other major South West training providers, but there was not enough time for these to be brought to a conclusion. \n“In the interests of everyone - service users, staff and creditors - the board reluctantly took the decision to shut the doors and to close down in an orderly manner. \n“Both training providers have been interviewing and recruiting redundant staff to fill the gap by the loss of Westward Pathfinder.” Read More Lorry drivers begin to see money owed - but not all have been paid \nExplaining why the charity was up against, Mr Keable said the major challenge was the ending of its six European Social Fund programmes in July 2015, and delays due to ongoing disputes between the UK government and the EU. \nHe also blamed replacement funding not being received until 2017, and further delays due to Brexit in the decision and roll out of the ESF Building Better Opportunities programmes and further government changes on eligibility of funding after contracts had been signed. \nMr Keable said: “This resulted in a cash flow shortfall that in spite of contracts to the value of £2.4m it was not possible to continue.” \nHe acknowledged staff have not been paid and explained why Westward Pathfinder had not been able to find the funds. Read More I'm A Celebrity winner Georgia Toffolo had \"unfair advantage\" coming from reality TV background says former winner and Geordie Shore star Vicky Pattison \n“Staff pay and redundancy unfortunately will in the short term be picked up by government as a large public fund payment due in November was not received,” said Mr Keable. \n“An earlier rule change also meant that we could not recover £30k of premises costs. This was crazy because we need to have somewhere to train people. \n“This was caused by red tape and a rule change since the contract was signed. It meant that we could not use our own premises and pay for them from the contract. We made repeated representation but this fell on deaf ears or any action was too slow.” Read More Missing Daniel Manley found safe and well \nHowever, Mr Keable added that there has been some positivity that has come out of the situation. \nHe said: “If there is any good news then over the next couple of years some £300k of income will be received for work already done on government funded contracts. This should mean that in the voluntary liquidation process everyone should get paid what is due. \n“It’s the 3,000 people a year that are supported into work or to develop new skills that will be most affected. In the last 23 years we shall have supported some 50,000 people improve their work prospects, the loss is to them and local employers. \n“As a charity working in the voluntary sector for local communities, Westward Pathfinder in not alone to the impact of austerity.” Read More", "external_links": [], "published": "2017-12-18T19:51:00.000+02:00", "crawled": "2017-12-18T20:36:23.000+02:00", "highlightTitle": ""}