{"organizations": [], "uuid": "93e606aca4c5255a077a42d17a1d68eab61cf923", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article916381.ece/ALTERNATES/s1200/121217-Business-Awards-PF-1042.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/business/gallery-annual-leicester-mercury-business-915234", "country": "GB", "domain_rank": 48128, "title": "GALLERY: Annual Leicester Mercury Business Awards sponsors breakfast", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-12T17:09:00.000+02:00", "replies_count": 0, "uuid": "93e606aca4c5255a077a42d17a1d68eab61cf923"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/gallery-annual-leicester-mercury-business-915234", "ord_in_thread": 0, "title": "GALLERY: Annual Leicester Mercury Business Awards sponsors breakfast", "locations": [], "entities": {"persons": [{"name": "kirsty west", "sentiment": "none"}, {"name": "dominic shaw", "sentiment": "none"}, {"name": "oliver", "sentiment": "none"}, {"name": "peter fothergill", "sentiment": "none"}, {"name": "steve crawford", "sentiment": "none"}, {"name": "george oliver", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "university of leicester’s college court", "sentiment": "none"}, {"name": "college court", "sentiment": "none"}, {"name": "mne accounting", "sentiment": "none"}, {"name": "university of leicester", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "View gallery \nSupporters of the Leicester Mercury Business Awards came together for a working breakfast to hear about preparations for the 2018 event. \nThe University of Leicester’s College Court hosted the informal get-together for the companies sponsoring the annual event. \nLeicester Mercury editor George Oliver explained the nomination process and deadlines, along with the judging process – with each sponsor judging the category they support. \nNominations for the 2018 awards close on January 12 and businesses can nominate themselves in three of the 14 categories. \nThe sixth annual awards – hosted in collaboration with Champions (UK) Plc – will be held on April 12 at the Maher Centre, in Leicester, and will recognise the most successful companies in the city, Leicestershire and Rutland. \nCategories include SME Business of the Year, Employer of the Year and Start-Up Business of the Year. (Image: Peter Fothergill) \nMr Oliver said: “We are proud of the quality of the events staged by the Leicester Mercury and the positive engagement of our community in them. \n“The purpose of this event is twofold – firstly it’s an opportunity for our sponsors to meet each other. \n“Secondly, and this is more relevant for our newer sponsors, it’s a chance to explain how the business awards are judged. \n“They are judged by leaders of our business community who do so through a process that is robust and transparent. \n“The judging panel for each category can be an individual, an internal team or an external team – whichever each sponsor prefers. \n“All we ask is that sponsors declare any conflict of interest.” College Court hosts the annual sponsors breakfast \nSteve Crawford is centre director at College Court, the University of Leicester conferencing venue which hosted the awards sponsors’ breakfast. \nHe said: “College Court has the wonderful mix of providing a unique business to business environment. \n“With 16 dedicated meeting rooms that can look after groups from two to 160, our venue ensures delegates gain the maximum benefit from their time away from the office. \n“Our state-of-the-art facilities are supported by our award winning 123 bedroomed hotel and our inspirational catering with a dedicated and professional team to ensure a successful event. \n“Since opening four years ago we have been proud to host the breakfast launch of the Leicester Mercury Business Awards and has been a great platform for us to bring the wonderful facilities of College Court to the attention of the business community. \n“We believe we share in the Business Awards ethos, that of bringing excellent achievements to the forefront of people’s minds and offering a platform to encourage, inspire and grow excellence in business. \n“It is great to see the year-on-year growth of the awards and is a great opportunity for businesses to engage and develop relationships. \n“In the somewhat uncharted waters of Brexit it helps to maintain confidence in the business community and is wonderful to see the diverse range and depth of businesses in our region. \n“We doubled sales in year two and have worked hard to earn annual growth in the region of 20 per cent every year since. \n“We are proud to have brought in excess of £1.5 million of business into the city, which then has a very positive impact on many other businesses in the region. \n“Owned by the University of Leicester the profits generated are reinvested further benefiting the teaching and research for our students which over time has a positive global impact.” \nAmong the guests was Dominic Shaw, marketing manager at MNE Accounting in Leicester, which sponsors the Start-Up Business of the Year. \nHe said: \"What makes the Business Awards so interesting is that it can tell the stories of local businesses you had no idea were doing great things in Leicestershire. \n\"These could be relatively new start ups, but often it's established businesses who have somehow slipped under the radar. \n\"It was only this morning that someone was saying to me that they hadn't realised how strong the business community in Leicestershire was until sponsoring these awards. \n\"Leicester is fortunate to have great businesses across most sectors - I'd urge them to come forward with an application so their achievements can be acknowledged.\" \nNominating your business is a fantastic opportunity to highlight its achievements and the serious contribution its staff make to the success of the region. \nThe black tie awards night is expected to attract around 800 people. \nFor more information on the awards, contact Kirsty West at Champions (UK) plc on 08453 31 30 31 or e-mail: kwest@championsukplc.com \nTo fill in a nomination form, visit the awards website here . Like us on Facebook ", "external_links": [], "published": "2017-12-12T17:09:00.000+02:00", "crawled": "2017-12-12T19:20:07.026+02:00", "highlightTitle": ""}