{"organizations": [], "uuid": "5f0f4463b22da1edc0f2bed8f663bf8475d30769", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article991385.ece/ALTERNATES/s1200/foxhuntJPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/devon-supports-plan-abandon-fox-991379", "country": "GB", "title": "Devon supports plan to abandon fox hunting ban vote, survey finds", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-30T15:17:00.000+02:00", "replies_count": 0, "uuid": "5f0f4463b22da1edc0f2bed8f663bf8475d30769"}, "author": "Keith Rossiter", "url": "http://www.devonlive.com/news/devon-news/devon-supports-plan-abandon-fox-991379", "ord_in_thread": 0, "title": "Devon supports plan to abandon fox hunting ban vote, survey finds", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "tim bonner", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "dec", "sentiment": "none"}, {"name": "countryside alliance", "sentiment": "none"}, {"name": "somerset wildlife crime", "sentiment": "none"}, {"name": "sunday times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon supports plan to abandon fox hunting ban vote, survey finds See the full results Richard Booth Head of content 13:17, 30 DEC 2017 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA majority of people in the South West would support the Prime Minister if she abandons her general election manifesto pledge to give MPs a free vote on whether to overturn the fox hunting ban, a new poll for the Western Morning News shows. \nThe Sunday Times claimed this week that the Prime Minister will announce plans in early 2018 to permanently drop the commitment. \nA Downing Street source was said to have described the report as “pure speculation”, but added that “there is no vote that could change the current policy on fox hunting scheduled in this session of parliament”. Minehead Harriers on Boxing Day (Image: Somerset Wildlife Crime) \nTim Bonner, chief executive of the Countryside Alliance, said: “It is a statement of the obvious to say that there will be no vote on the Hunting Act in this parliament. \n“Even without the pressing rural priorities of Brexit and the development of the first British agricultural policy for over 40 years, it has always been clear that resolving the hunting issue would require a significant parliamentary majority. \n“No minority government could sensibly restart the debate. That does not mean that the hunting community and the Countryside Alliance will not continue to point out the many failings of the Act and campaign for hunting to be made legal again by a future parliament.” \nChris Pitt, deputy director of campaigns at the League Against Cruel Sports, said: “This polling shows clearly that only a minority of people want fox hunting to be made legal again, and that’s the bottom line. \n“Most of us can see that killing a fox, or any animal, for fun, is abhorrent and has no place in today’s society. \n“The polling also highlights the confusion that people feel about this subject. Some 20% don’t know if they support fox hunting coming back, and 10% aren’t even sure if they’ve actually witnessed a hunt. Read More Missing Taz \n“Many will assume that the hunting taking place now – called trail hunting – must be legal hunting. Unfortunately, that’s often not the case. Before the Hunting Act came in, there were two types of hunting – non-lethal and lethal. The non-lethal version involved following a ‘drag’ which contained an artificial scent, such as aniseed. The hounds were trained to follow that scent and the chances of an animal being killed were minimal. When those involved in lethal hunting were stopped by the Hunting Act, they invented ‘trail’ hunting, which was intended to look similar to drag hunting, but with crucial differences – a key one being that the hounds are trained to follow an animal scent, such as fox urine. \n“This means that when the hunt goes out, the hounds often pick up the scent of a real fox, chase it and kill it – but then the hunt claims this was an accident. \n“These ‘accidents’ have happened time and time again – too many times for it to be credible. A judge once described trail hunting as a ‘cynical subterfuge’, and we agree. \n“Traditions should only continue if they fit with modern society, and animal cruelty is no longer acceptable in Great Britain. \n“Dog fighting has been banned, so has bull baiting and cock fighting, and no one is trying to bring those back.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nRecent Ipsos Mori polling shows that eight out of ten people who live in rural areas want fox hunting to remain illegal – showing that fox hunting is not a countryside tradition they want to see continue.” \nTHE RESULTS \nWe polled 2,000 people using Google Consumer Surveys \nWhen asked whether they would support a decision to cancel plans for a fresh vote on fox hunting, 39.2% said ‘Yes’, against 32% ‘No’ and 28.8% don’t knows. \nA large majority of 47% to 32.8% said how their MP voted on fox hunting would influence their vote for the MP. \nMany hunts have adopted trail hunting as a stop-gap in anticipation that the 2004 Hunting Act will be repealed. Opponents are concerned that it is being used as a pretext for illegal live quarry hunting. \nIn our survey, 12.9% “strongly agreed” that it was a suitable substitute and 23.1% “tended to agree.” More (14.9%) “strongly disagreed” and 11.9% said they “tend to disagree”. However, 37.3% had no view. \nHow you responded \nIt has been reported that PM Theresa May will cancel plans for a fresh vote on fox hunting. If she did so, would you support her decision? \nYes:: 39.2%, No: 32%; Don’t know: 28.8% \nWere the Conservatives right to make fox hunting a general election issue in 2017? \nYes: 21.3%, No: 55.6%, Don’t know 23.1% \nWould you support the overturning of the 2004 Hunting Act to allow the full reintroduction of fox hunting? \nYes: 18%, No: 61.7%, Don’t know: 20.3 % \nWould how your MP voted on fox hunting influence your vote for them? \nYes: 47%, No: 32.8%, Don’t know: 26.5% \nHave you ever attended or witnessed all or a part of a fox hunt? \nYes: 31.7%, No: 58%, Don’t know: 10.4% \nTo what extent do you agree with this statement: Trail (Simulated) Hunting is a suitable substitute to fox hunting which ensures rural traditions are preserved. \nStrongly agree: 12.9% \nNeither agree nor disagree: 37.3% \nTend to disagree: 11.9%", "external_links": [], "published": "2017-12-30T15:17:00.000+02:00", "crawled": "2017-12-30T15:56:49.002+02:00", "highlightTitle": ""}