{"organizations": [], "uuid": "1c2061b3f18bef5f26d69856b68f1e0d5458a6cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13976441.ece/ALTERNATES/s1200/Donald-Trump-on-Twitter.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trumps-spat-theresa-could-13979296", "country": "GB", "domain_rank": 21960, "title": "Why Donald Trump's spat with Theresa May could be a cunning plan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-03T10:00:00.000+02:00", "replies_count": 0, "uuid": "1c2061b3f18bef5f26d69856b68f1e0d5458a6cf"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trumps-spat-theresa-could-13979296", "ord_in_thread": 0, "title": "Why Donald Trump's spat with Theresa May could be a cunning plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Why Donald Trump's spat with Theresa May could be a cunning plan Was the US president acting cheesed off with the Prime Minister in order to make her look statesperson-like? Share Prime Minister Theresa May meeting US President Donald Trump (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPerhaps the ‘spat’ between the greatest US President ever called Donald Trump and Theresa May is a cunning plan cooked up between the two less than popular leaders. \nTrump, being the chivalrous type, obviously knows his pal May is getting a bit of a kicking over the £50bn Brexit divorce bill. \nBefore that it was a kicking regarding the ongoing benefits freeze which is saving enough money to pay the DUP to keep her government in power. \nAnd before that it was Universal Credit, Grenfell Tower....and on and on. What’s a man to do? \nA distraction was needed to make May look like she had a backbone and was even remotely aware of how a PM is supposed to act. It would be a big ask but a bust up with Trump surely fitted the bill. \nTo pull it off, he had to set aside his previous attempts to unite all ethnic and religious communities in the US behind his rainbow banner and retweet three posts by deputy leader Jayda Fransen of the far right group Britain First to his followers. \nIt includes unverified footage purporting to show Muslims committing crimes. (That must have hurt because we all know how much he hates fake news). Prime Minister Theresa May holding talks with US President Donald Trump (Image: PA) \nResponding to Trump’s actions, May’s official spokesman said: “It is wrong for the president to have done this. \n“Britain First seeks to divide communities through their use of hateful narratives which peddles lies and stokes tensions. \n“The British people overwhelmingly reject the prejudice of Britain First that is the antithesis of the values of our country.” \nFirst came this amusingly ecstatic response from Britain First itself - in capital letters no less - on its twitter page, followed no doubt by much underwear washing. \n‘THE PRESIDENT OF THE UNITED STATES, DONALD TRUMP, HAS RETWEETED THREE OF DEPUTY LEADER JAYDA FRANSEN’S TWITTER VIDEOS! DONALD TRUMP HIMSELF HAS RETWEETED THESE VIDEOS AND HAS AROUND 44 MILLION FOLLOWERS! GOD BLESS YOU TRUMP! GOD BLESS AMERICA!’ \nThen came Trump’s - on the face of it - less than ecstatic response to being criticised. \nIn a tweet, the US President told the Prime Minister: “Don’t focus on me, focus on the destructive Radical Islamic Terrorism that is taking place within the United Kingdom. We are doing just fine!” Read More MPs from all parties accuse Donald Trump of spreading hatred \nTo make the subterfuge as believable as possible Trump had to remain in plausible character by sending the message twice because he got May’s twitter account confused with someone else’s. \nIt can be argued it’s a big result to both sides. Trump not only helps May, but cements his place in the 24/7 news cycle and tops Google Trends yet again. \nMeanwhile May appears statesperson-like in standing up to Trump at a time when people are wondering what on earth he is being invited to the UK by the government for. \nMaybe she should call another general election to see if her plan has worked. Like us on Facebook", "external_links": [], "published": "2017-12-03T10:00:00.000+02:00", "crawled": "2017-12-03T11:21:28.029+02:00", "highlightTitle": ""}