{"organizations": [], "uuid": "5ec430a10f24359444c586e57732d062e814e565", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12589380.ece/ALTERNATES/s1200/Thomas-Mair-trial.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/shadow-jo-cox-murder-looms-14046164", "country": "GB", "domain_rank": 21960, "title": "Shadow of the Jo Cox murder looms large in the hysteria of the right wing Brexit coverage", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-16T18:00:00.000+02:00", "replies_count": 0, "uuid": "5ec430a10f24359444c586e57732d062e814e565"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/shadow-jo-cox-murder-looms-14046164", "ord_in_thread": 0, "title": "Shadow of the Jo Cox murder looms large in the hysteria of the right wing Brexit coverage", "locations": [], "entities": {"persons": [{"name": "shadow of the jo cox", "sentiment": "negative"}, {"name": "jo cox", "sentiment": "negative"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "thomas mair", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "daily mail", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Shadow of the Jo Cox murder looms large in the hysteria of the right wing Brexit coverage Vilification of the 11 'treacherous' Tories who voted against the government could put their lives at risk Share Murdered Labour MP Jo Cox   increasingly demented Brexit coverage of the Daily Mail and others last week hit new heights of hysteria after 11 Tory MPs voted in Parliament . \nThe problem for the Mail was they did not cast the vote as the paper saw fit. \nEssentially the 11 Tory politicians sided with Labour to ensure the final Brexit deal would have to have the backing of Parliament before it went through. \nIf they had voted with the government it would have meant carte blanche be given to the government’s EU negotiators fronted by the risible David Davis to do as they pleased. Not a reassuring thought judging by their attempts so far. Read More UK 'will be paying for years to come' if it agrees £50bn Brexit bill \nFor ensuring that democracy had its say, they were branded ‘Diehard Tory Remainers’ and accused of ‘Treachery’. \nNot by me - I hold my hand up and admit to being one of the 16.1m who voted Remain which in Mail-land means my thoughts on Brexit are completely irrelevant as are those of the 12m who didn’t vote. If you added these two groups together they make up over 60% of the total electorate, all of whose interests are supposed to be represented by Parliament, not to mention those not old enough to vote yet. Read More Brexit divorce deal might be sealed but North East employers warn there's much more to do \nJust to be certain of who was being accused of treachery, the Mail printed the picture of all the MPs. It’s done this sort of thing before as have other right wing papers like the Telegraph. \nIn November it printed a picture of 15 ‘Brexit Mutineers’ after a previous ‘rebellion’ including that of ex Tory Minister Anna Soubry who subsequently received 13 death threats. She was on the latest Mail front page too. \nWorse was to come. Leave.EU then tweeted a picture of the 11 MPs in front of a wall. The only thing lacking was a firing squad. \nKnockabout fun, some would say. A bit of banter. Really? How quickly we have forgotten about the fate of Labour MP Jo Cox who was shot and knifed to death by far right supporter Thomas Mair who reportedly shouted Britain First as he struck. Thomas Mair (Image: West Yorkshire Police/PA Wire) \nIt turns out that Anna Soubry has received many more messages saying she should be hanged for treason. \nThe newspaper coverage is about fear and bullying to scare people into toeing the line. If it means running the risk of harm coming to those who don’t, so be it seems to be the thinking. \nWhat the 11 Tories who voted alongside Labour, Lib Dem, Green, Independent, Plaid Cymru and SNP MPs was to ensure democratic oversight over the final EU withdrawal Bill. \nInterestingly, at the end of the Mail’s splenetic comment on its front page was what it described as the “most damning of all” aspect of the actions of the ‘treacherous’ Tory MPs - to increase the possibility of a Marxist in number 10. \nThe Mail of course would prefer the UK to be a right wing totalitarian state to preserve its democratic ideals. Like us on Facebook", "external_links": [], "published": "2017-12-16T18:00:00.000+02:00", "crawled": "2017-12-16T18:26:58.004+02:00", "highlightTitle": ""}