{"organizations": [], "uuid": "bf3113dc7fd16f1ef62be6f86ba93cb40f2640ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14085840.ece/ALTERNATES/s1200/DE-Group-GV.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/northumberland-pharmaceutical-firm-adds-nearly-14086180", "country": "GB", "domain_rank": 21960, "title": "Northumberland pharmaceutical firm adds nearly 200 new staff", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-27T18:31:00.000+02:00", "replies_count": 0, "uuid": "bf3113dc7fd16f1ef62be6f86ba93cb40f2640ea"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/northumberland-pharmaceutical-firm-adds-nearly-14086180", "ord_in_thread": 0, "title": "Northumberland pharmaceutical firm adds nearly 200 new staff", "locations": [], "entities": {"persons": [{"name": "prudhoe", "sentiment": "negative"}, {"name": "testerworld", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "prudhoe", "sentiment": "none"}], "organizations": [{"name": "de pharmaceuticals", "sentiment": "none"}, {"name": "de group", "sentiment": "none"}, {"name": "testerworld", "sentiment": "none"}, {"name": "low prudhoe industrial estate", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northumberland pharmaceutical firm adds nearly 200 new staff Prudhoe's Testerworld, also known as DE Pharmaceuticals, saw its turnover rise to £148m but profits fell Share General view of DE Group, 7 Regents Drive, Low Prudhoe Industrial Estate in Prudhoe (Image: Newcastle Chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorthumberland pharmaceutical firm Testerworld added nearly 200 new members of staff as it moved into new sales areas and recorded a big leap in turnover. \nThe Prudhoe firm , also known as DE Pharmaceuticals, has published accounts showing a 9.2% increase in turnover in the year to March 31, with revenue coming in at £148.5m. \nThe company said gross profit effectively stood still at £19.9m while operating profit more than halved to £1.6m, as the fall in value of the pound combined with a competitive market for generic drugs saw its margins fall. \nTesterworld also noted a “significant” increase in costs, with investment in its distribution infrastructure, back office and IT functions, while staff costs rose by more than £3m as its headcount went up from 332 a year earlier to 513. Most of that increase came in sales and distribution staff. \nIn a note on the company accounts, director David Horry sounded a note of caution on Brexit, saying that securing continuity for the pharamaceutical industry should be a “high priority for the Government”. But he said the company would not suffer any more than its competitors and believed it was able to respond to whatever happens in the Brexit negotiations. \nHe said: “The company experienced an increase in turnover of £12.5m (9.2%) compared with the preceding year, taking full-year sales up to £148.5m. The directors are particularly pleased with this result and believe it is illustrative of the ongoing positive customer response to the company’s trading philosophy and business model. \n“The continued growth has been partially driven by planned geographical expansion, combined with an increase in customer numbers, and spend per customer across the core independent community pharmacy customer base. \n“The gross margin on trading activity was down in the year from 14.7% to 13.4%. The devaluation of the pound in the latter half of the year, combined with a highly competitive generic market, put some pressure on the gross margin. \n“However, the continued growth in market share and subsequent sales value, delivered a gross profit result of £19.9m broadly in line with the previous year.” \nTesterworld, which distributes prescription drugs to pharmacies, was founded in 1986 and is one of the North East’s largest 50 firms. Like us on Facebook", "external_links": [], "published": "2017-12-27T18:31:00.000+02:00", "crawled": "2017-12-27T19:10:20.038+02:00", "highlightTitle": ""}