{"organizations": [], "uuid": "6b9b748139ac73ab8070fbc0a4d55da58da2ff94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article944371.ece/ALTERNATES/s1200/35077989.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/business/leicester-house-prices-rocketing-75-944285", "country": "GB", "domain_rank": 48128, "title": "Leicester house prices have rocketed by 7.5% - with increase 'fuelled by London investors'", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-19T02:01:00.000+02:00", "replies_count": 0, "uuid": "6b9b748139ac73ab8070fbc0a4d55da58da2ff94"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/leicester-house-prices-rocketing-75-944285", "ord_in_thread": 0, "title": "Leicester house prices have rocketed by 7.5% - with increase 'fuelled by London investors'", "locations": [], "entities": {"persons": [{"name": "hometrack", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "invalid email  house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHouse prices across Leicester are rocketing by 7.5 per cent a year – the third highest rise of any UK city. \nLatest figures suggest the average price of a home in the city hit £167,400 last month – higher than cities such as Birmingham, Manchester, Nottingham, Liverpool and Leeds. \nFigures from property market specialist Hometrack showed prices in Leicester are now also 18 per cent up on the 2007 peak. \nOne estate agent said the rise is being fuelled by a lack of supply and London investors looking for cheap homes to rent out – with young families being priced out of the market. \nHometrack – sister company to sites such as Zoopla and uSwitch – said Leicester was the third highest riser on its monthly city list. \nGlasgow, it said, had the biggest annual rise at 7.9 per cent, with an average price of £122,800. \nEdinburgh was second with a 7.6 per cent rise, and an average November sale price of £220,200. \nBirmingham was fourth and Manchester fifth, both with average prices around £157,000. A typical street scene of a David Wilson Homes development in Leicestershire \nBy comparison, London was 17th on the list with an annual rise of just 2.7 per cent, but an average price of £491,700. \nPrices in the capital – where there has been a big inflow of foreign investment into property – were 58 per cent up on 2007. \nThe average UK price was £213,600 – 4.7 per cent up on the same time last year – with a further 5 per cent rise predicted next year. \nThe Leicester price rise is bad news for young families keen to get on the housing ladder. Read More This is probably the most stunning property on sale in Leicestershire right now \nSchemes such as Help to Buy – where the Government lends up to 20 per cent of the cost of a newly built home – have helped some, but have not stopped the sharp rise in prices. \nKam Johal is chief executive of IPS Estate Agents, which has an office in London Road, Leicester, and specialises in sales, lettings and mortgages. \nHe said soaring prices were being caused by a rise in Londoners buying properties here to rent out. \nHe said: “For the last 18 months or so supply has been extremely short so availability is probably at an all time low, which means the number of buyers chasing each property is higher than ever. \n“And over the last couple of years we’ve also seen an increase in investors from London – some 20-25 per cent of all sales are now from investors outside the county. Read More \n“We constantly see local people being outbid. First-time buyers might be struggling with deposits while someone from down south will see an extra £5,000 to £10,000 as chickenfeed. \n“And then all of those properties are added to our rental stock.” \nHe said the only beneficiaries from rising prices were housebuilders and the banks. \"Not enough houses are being built\" \nHometrack spokesman Richard Donnell said prices were going up in the north – while stabilising in the south – because of better affordability for first time buyers and low mortgage rates. \nHe said: “Add to this the impact of lower mortgage rates and the clouds of uncertainty around Brexit seeming set to lift in 2018 and we expect regional cities to continue above average house price growth next year and overall city house price growth to hit 5 per cent.” \nHousebuilders say while their average prices have risen, they are offering incentives to entice buyers. Read More Revealed: This is what revamped Fenwick building could look like \nBarratt Group, which has its UK headquarters at Bardon, near Coalville, sold 17,395 homes in the year to June 2017, making it the biggest housebuilder by volume in Britain. \nDuring the year it generated £4.65 billion of sales – almost 10 per cent up on the previous year – and pre-tax profits were up 12 per cent. \nThe lion’s share of its sales were in London and the South East, while the average price of one of its new homes was 6 per cent up on last year at £275,200. \nIts David Wilson Homes subsidiary is working on a number of sites locally, including Abbots View, on the edge of Coalville, which is 50 per cent sold. \nIt said those two to five bedroom homes are perfect for first-time buyers and families looking to settle down, and prices start at just shy of £160,000. Like us on Facebook ", "external_links": [], "published": "2017-12-19T02:01:00.000+02:00", "crawled": "2017-12-19T02:40:06.002+02:00", "highlightTitle": ""}