{"organizations": [], "uuid": "906ac661dc8711fa4e75cb4d8ac266c56ecdbd34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13992000.ece/ALTERNATES/s1200/CFR_NJL_041217torro_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-torro-co-founder-13991762", "country": "GB", "domain_rank": 21960, "title": "A Meeting With: Torro co-founder and director William Johnson", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-05T07:00:00.000+02:00", "replies_count": 0, "uuid": "906ac661dc8711fa4e75cb4d8ac266c56ecdbd34"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-torro-co-founder-13991762", "ord_in_thread": 0, "title": "A Meeting With: Torro co-founder and director William Johnson", "locations": [], "entities": {"persons": [{"name": "william johnson torro", "sentiment": "negative"}, {"name": "william johnson", "sentiment": "negative"}, {"name": "steve jobs", "sentiment": "none"}, {"name": "torro", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "torro", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "torro", "sentiment": "negative"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Torro co-founder William Johnson (Image: Torro) Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nName: William Johnson \nJob title: Co-founder of Torro \nWhat is the best thing about your job? \nThe best thing for us is being able to create products that we ourselves would want to use. Torro was created with like-minded people in mind. We predominantly cater to style conscious men, who want good quality products that are affordable. Being able to design new products with that ethos in mind can be a challenge but it is extremely rewarding. \nWhat is your proudest achievement? \nTaking the plunge to set up Torro in the first place is a huge achievement in itself. We both had stable jobs in the police force so it was a big risk for us to hand in our notices to concentrate on Torro full time. To see the company grow from a £500 investment to multimillion turnover in four years is overwhelming. \nWe are proud that we have always stayed true to our vision for the brand. Torro may have grown as a business but our spirit will always remain the same. \nWhat advice would you give to someone starting in your career? \nHave vision and passion for what you are doing. You need to have a real belief in what you’re doing otherwise no one is going to buy into it. \nWhich individual has inspired you most and why? \nIt’s cliche to mention him these days but it has to be Steve Jobs, it’s an intense determination to make products the best they can possibly be and compromise at nothing. Why get out of bed if you’re going to settle for mediocre. At Torro we believe in what we are doing and only want to make the very best. Too many manufacturers now churn out products, compromising on quality and Jobs was different. His ethos that it had to be great or not at all is the attitude that made us start our business. Read More One in four North East exporters are failing to plan for Brexit, report shows \nWhat’s the best piece of advice you’ve been given? \nChallenge everything. Take nothing for granted. I truly believe this is where innovation and great new opportunities are born. \nWhat was the biggest challenge you’ve faced in your career so far? \nRunning your own business can be tough; it’s 24/7. There is a lot of pressure to deliver. It was hard to go from jobs with a secure wage to a start-up with no guarantees. When you’re running your own business you’re only as good as next month’s sales. \nHow is your business going to change in the next 10 years? \nWe hope to see our business steadily grow and there are huge opportunities for us in the e-commerce market. We hope to bring Torro to the high street by partnering with selected retailers who would fit in with our brand. We also aim to take a further foothold within EU countries and the USA. In ten years time we expect our workforce to have grown and to move into a larger premises. It’s all part of our ambition to become a one-stop shop for stylish gents. Read More \nWhat do you like to do out of work? \nWe both have two children each so we enjoy spending time with our families. \nWhat do you always carry with you? \nMy smartphone (well protected in it’s Torro case). I’m always making notes on my phone with new inspiration. \nWhat would you do if you had to change career? \nI love what I do and wouldn’t consider anything else, I settled for too long in a job that was not my calling and now I love the game that is my life. I love the fact I am able to be me everyday and do not have to pretend to be anything other than who I am to fit into organisational cultures. Even if I didn’t need to work I would choose to do this anyway. It’s an amazing way to live your life. Like us on Facebook ", "external_links": [], "published": "2017-12-05T07:00:00.000+02:00", "crawled": "2017-12-05T07:30:10.025+02:00", "highlightTitle": ""}