{"organizations": [], "uuid": "f36c67b07bf163927d4455a6ab197e4b602b8153", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14055961.ece/ALTERNATES/s1200/TMP_NEC_131217BishopDurhamButler01JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bishop-durham-christmas-brexit-devolution-14055846", "country": "GB", "domain_rank": 21960, "title": "Bishop of Durham delivers Christmas message and talks Brexit and devolution", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-24T10:00:00.000+02:00", "replies_count": 0, "uuid": "f36c67b07bf163927d4455a6ab197e4b602b8153"}, "author": "Chris Knight", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bishop-durham-christmas-brexit-devolution-14055846", "ord_in_thread": 0, "title": "Bishop of Durham delivers Christmas message and talks Brexit and devolution", "locations": [], "entities": {"persons": [{"name": "durha", "sentiment": "positive"}, {"name": "rt rev paul butler", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "paul butler", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "auckland castle", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "news bishop of durham", "sentiment": "positive"}, {"name": "bishop of durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Bishop of Durham delivers Christmas message and talks Brexit and devolution The Bishop of Durham Paul Butler has urged the North East to take time to find 'peace' in his Christmas message Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSpeaking on the eve of Christmas, the Bishop of Durham has delivered a special message calling for people to take the time to find ‘peace’ in their lives. \nRt Rev Paul Butler also discussed the issues facing North East families this festive season, as well as the next stages of Brexit and the need for unity in the midst of the region’s devolution deal. \nThe Bishop’s message from Auckland Castle in County Durham included: A need for people to take time out of their hectic lives to find ‘peace for all of us, and peace for each of us.’ Concerns over welfare benefits, job security, and the impact of Brexit on the North East. The view Brexit will bring ‘good days and bad days’, and no-one knows what shape it will ultimately have on the country. The need for authorities on the north and south of the River Tyne to work on a ‘united front’ no matter what form the upcoming devolution deal takes. \nRt Rev Butler said: “Christmas is meant to be a time of great joy and festivities, but often it can be a time for real anxiety and concerns. \n“People worry about if they’ve got enough money to spend, if they’ve got the right present, and they worry about how people think of them. \n“This Christmas, I want to suggest to people that they need to have lives of peace and contentment. In the midst of the hurly-burly, the rush and the bustle, take time to stop. Read More Your cute Christmas pets in Newcastle & the North East \n“Take time to be with people in some stillness and some quiet, and reflect on life and what makes you happy, on where you find love and rejoice in the really good things. \n“And in that process, find some peace and contentment. Remember the story of Christmas, and remember that God sent Jesus into the world to bring true peace - peace for all of us, and peace for each of us.” The Bishop of Durham Rev Paul Butler (Image: newcastle chronicle) \nFor the North East, the Bishop of Durham believes North East families hold fears over welfare benefits and their job security. \nRt Rev Butler also outlined his view that support from families in positions of financial security for those in need had increased. \nHe added: “One of the questions going forward is how do we ensure life is better for all, that there is some sense of greater equality, and that I think inevitably will mean those of us who have are often more willing to say ‘actually we can have a little less’ in order that others may have more.” \nSpeaking on Brexit and the prospect of devolution, the Bishop of Durham admitted the road ahead and the shape both will end up taking looks uncertain. Read More Pantomimes in and around Newcastle over Christmas 2017 - an all you need to know guide \nBut Rt Rev Butler stressed the need for calm and unity from people in the North East throughout the processes. \nHe said: “There’s an awful long way to go with Brexit and there will be lots of ups and downs along the way. \n“I suppose one of the things is people have to get used to the fact that we will have days of good news and days of bad news. \n“We will have days of uncertainty but I’m sure we will get there, but what it will look like I think honestly none of us know. \n“In terms of local government whatever format emerges for North of the Tyne, all the authorities across the North East need to continue to communicate and work well together because the issues that concern us are much more common than different. \n“Let’s make sure we all keep talking together and that we work for the best of the whole of the North East. Like us on Facebook", "external_links": [], "published": "2017-12-24T10:00:00.000+02:00", "crawled": "2017-12-24T11:11:13.023+02:00", "highlightTitle": ""}