{"organizations": [], "uuid": "2ba76f1fa52a33b3ce0bae4b8d1563f61e8563fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13987642.ece/ALTERNATES/s1200/SMR_NEC_031217Milburn-2.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/alan-milburn-resign-social-mobility-13987548", "country": "GB", "domain_rank": 21960, "title": "Alan Milburn quits Social Mobility Commission saying this Government can't deliver fairer society", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-03T12:48:00.000+02:00", "replies_count": 0, "uuid": "2ba76f1fa52a33b3ce0bae4b8d1563f61e8563fb"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/alan-milburn-resign-social-mobility-13987548", "ord_in_thread": 0, "title": "Alan Milburn quits Social Mobility Commission saying this Government can't deliver fairer society", "locations": [], "entities": {"persons": [{"name": "alan milburn", "sentiment": "negative"}, {"name": "jon trickett", "sentiment": "none"}, {"name": "milburn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "tow law", "sentiment": "none"}], "organizations": [{"name": "social mobility commission", "sentiment": "negative"}, {"name": "invalid email  former labour", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Alan Milburn quits Social Mobility Commission saying this Government can't deliver fairer society Former MP says Government is too busy with Brexit to fix gap between London and England's poorest regions like the North East Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFormer Labour minister Alan Milburn has quit his role as chair of the Social Mobility Commission as he says the Government is unable to bringer greater equality to Britain’s poorest regions. \nMr Milburn, a former health secretary and Darlington MP, resigned alongside the commission’s board as there is “little hope” of the Government bringing in changes to create a “fairer Britain”. \nEarlier this week, the same commission published a report saying people born poor in the North East are among the most likely to die poor in Britain . \nThe damning State of the Nation style report ranked the North East as the second worst area in England for chances of social progression from education to finding work. \nMr Milburn and his three fellow commissioners have walked out on the commission, which is tasked with monitoring the Government’s progress in delivering social mobility. \nIn his resignation letter, Mr Milburn, who grew up in Tow Law, County Durham, said the Government is too busy dealing with Brexit to “have the necessary bandwidth to ensure the rhetoric of healing social division is matched with the reality”. \nMr Milburn, 59, added: “I have little hope of the current Government making the progress I believe is necessary to bring about a fairer Britain. \n“It seems unable to commit to the future of the commission as an independent body or to give due priority to the social mobility challenge facing our nation.” Read More London 3 - Newcastle 0: How the capital is getting three times as much money for public transport \nThe commission’s report published three days ago warns that far right and hard left politics could rise unless economic, social and geographical divisions are addressed. \nIt says London and its commuter belt resemble a “different country” to coastal, rural and former industrial areas, where young people have little chance of finding better paid jobs, and can not afford to travel further to look for better work. \nMr Milburn told The Observer: “The worst position in politics is to set out a proposition that you’re going to heal social divisions and then do nothing about it. It’s almost better never to say you’ll do anything about it. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“It’s disappointing at least that the Government hasn’t got its shoulder to the wheel in the way it should to deal with these structural issues that lead to social division and political alienation in the country. \n“In America for 30 years real average earnings have remained flat. Now here the Chancellor is predicting that will last for 20 years. \n“That has a consequence for people, but a political consequence as well. It means more anger, more resentment and creates a breeding ground for populism.” \nLabour’s shadow cabinet office minister Jon Trickett says the resignations came as “no surprise”. Read More Born poor, die poor: This damning report lays bare the state of social mobility in the region \n“As inequality has grown under the Tories, social mobility has totally stalled. Theresa May has rewarded the rich whilst holding everyone else back,” he said. \n“It is no surprise the whole Social Mobility Commission has resigned in frustration. Under the Tories, how well people do in life is still based on class background rather than on talent or effort.” \nA Government spokesman said it is “committed to fighting injustice and ensuring everyone has the opportunity to go as far as their talents will take them”. \n“We are making good progress with social mobility - we have increased the national living wage, cut income tax for the lowest paid and doubled free childcare,” the spokesman said. \n“We accept there is more to do and that is why we are focusing our efforts in disadvantaged areas where we can make the biggest difference.” Like us on Facebook", "external_links": [], "published": "2017-12-03T12:48:00.000+02:00", "crawled": "2017-12-03T13:00:49.028+02:00", "highlightTitle": ""}