{"organizations": [], "uuid": "59bd7fec6df44cc2fd429e51d3420e16ddad1f79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14058538.ece/ALTERNATES/s1200/Chief-executive-of-Kromek-Arnab-Basu.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/kromek-close-breaking-even-after-14058158", "country": "GB", "domain_rank": 21960, "title": "Kromek close to breaking even after winning raft of high profile contracts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-19T17:25:00.000+02:00", "replies_count": 0, "uuid": "59bd7fec6df44cc2fd429e51d3420e16ddad1f79"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/kromek-close-breaking-even-after-14058158", "ord_in_thread": 0, "title": "Kromek close to breaking even after winning raft of high profile contracts", "locations": [], "entities": {"persons": [{"name": "kromek", "sentiment": "negative"}, {"name": "arnab basu", "sentiment": "none"}], "locations": [{"name": "kromek", "sentiment": "none"}], "organizations": [{"name": "kromek", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Kromek close to breaking even after winning raft of high profile contracts The radiation detection firm sells its products to the medical and nuclear sectors and is now targeting military markets Share Chief executive of Kromek, Arnab Basu (Image: Publicity Pic) Share Get business   \nRadiation detection company Kromek says it is on track to break even for the first time after winning a number of high profile contracts and entering new markets. \nThe company, which manufactures radiation detection kits that can be used to locate dirty bombs, said it achieved its growth after winning contracts in the nuclear and healthcare sector. \nDr Arnab Basu, Kromek’s CEO, said: “This half year has been categorised by strong revenue growth primarily through product sales, nearly 90% of the revenue is generated through product sales rather than R&D contracts. That is because of the type of contracts we have secured over the last few years, which are multi-year, are now flowing through as revenue. \n“We are seeing traction for our products particularly in the medical and nuclear market, where we are starting to see real adoption of our products starting to happen.” Read More Toys R Us' Metrocentre store could close over pension woes \nOne of the firm’s major growth areas was its line of SPECT products, which are used to diagnose cancer and those suffering from dementia. \nThe group also won a number of high profile contracts throughout the year, including using its DS3 radiation detectors to protect President Trump during his visit to Brussels. The DS3 was field tested in the US by the Defense Advanced Research Projects Agency (DARPA). \nBut the company has also revealed that it is expanding into new markets after striking a deal with the US military. \nDr Arnab said: “We announced another new contract from the US Department of Defense (DoD) today. These are framework contracts that the US government gives out when it wants to have a long term plan in particular areas. Read More Brexit could cost North East economy £600m, new study reveals \n“This contract is for buying and developing chemical, biological, radiation, and nuclear detectors over the next 10 year period, and they have allocated about $8.2bn to this particular contract. We are one of contract holders with the US DoD. \n“The important message is that the product we have developed was mainly for the homeland security market, but this particular contract is entry into the military market.” \nKromek’s revenue increased by 27% to £4.8m for the six months ending October 2017, compared with £3.8m during the first half of 2016. The company also narrowed its EBITDA loss to £0.3m and aid it is on track to break even by the end of the year. \nThe company added that it intends to become fully profitable over the next three years. Like us on Facebook", "external_links": [], "published": "2017-12-19T17:25:00.000+02:00", "crawled": "2017-12-19T17:50:36.000+02:00", "highlightTitle": ""}