{"organizations": [], "uuid": "79eed2259b373cf9852a5d8c830a987df40f8aa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14024589.ece/ALTERNATES/s1200/CFR_NJL_111217john_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/wallsend-building-services-firm-john-14024533", "country": "GB", "domain_rank": 21960, "title": "Wallsend building services firm John N Dunn reports big increase in profits", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-11T19:11:00.000+02:00", "replies_count": 0, "uuid": "79eed2259b373cf9852a5d8c830a987df40f8aa3"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/wallsend-building-services-firm-john-14024533", "ord_in_thread": 0, "title": "Wallsend building services firm John N Dunn reports big increase in profits", "locations": [], "entities": {"persons": [{"name": "john n dunn", "sentiment": "none"}], "locations": [{"name": "wallsend", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "john n dunn", "sentiment": "negative"}, {"name": "ministry of defence", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "hadrian border brewery", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wallsend building services firm John N Dunn reports big increase in profits The firm's accounts outline a strong performance in what it describes as a challenging market Share John N Dunn is growing profits and sales amid challenging times for the construction sector Share Get business   Thank you for subscribing!   \nBuilding services business John N Dunn is toasting a strong year after posting an 11% lift in sales amid challenging trading conditions. \nEstablished in 1892, John N Dunn started out providing plumbing, heating services to the construction sector before later adding electrics and renewable energy services. \nThe business works within a range of sectors – mainly in the North East, Yorkshire and Scotland – including social housing, in which it provides property refurbishment and maintenance services for local authorities and housing associations, and commercial and public sectors, working within schools, prisons and with the Ministry of Defence. \nThe Wallsend firm, which also has bases in Scotland and Leeds, has now published accounts for the year ended March 31, revealing rising revenues and profits, despite difficult headwinds within the UK construction sector as a whole. \nTurnover increased 11% from £28.568m to £31.740m, while gross profit margins also improved during the year, increasing from 7.3% to 8.9%. \nEbitda for the year was £680,113 - up on last year’s £383,162 – while operating profit was more than double the previous year’s on £584,286. \nIn a strategic review, directors said they considered the company’s key performance indicators to be satisfactory “in light of the prevailing economic and industry conditions.” \nThe report said: “Whilst trading conditions continue to be challenging, there are clear indications of improvement over the last 12 months, and this is forecast to continue into the next financial year. The directors are pleased with the results of the company for the financial year with turnover increasing by 11.1%. Read More Scheme offering coffee in exchange for business ideas heads to Newcastle \n“The business has continued to develop opportunities and win contracts since the year end and the directors are therefore confident that the business will experience further growth in both revenue and profitability. \n“The directors recognise that the economic climate remains challenging and the construction industry is highly susceptible to liquidity and credit default risk. \n“Conditions within the sector have improved, aided by such government initiatives as the ‘help to buy’ scheme and, as such, confidence within the industry is continuing to improve. However, this is tempered by the uncertainty surrounding Brexit and what impact that will have on the industry going forward.” \nThe accounts also detail how the company has carried out cost-cutting exercises to ‘futureproof’ its position within the industry. Read More New North East pubs on the way as Hadrian Border Brewery searches for new venues \nThe firm suffered during the 2008 credit crisis, when it had an average of 542 employees, leading to the workforce being reduced the following year to around 400. \nIn 2016 the firm had average of 302 monthly employees but this too was reduced further in latest accounts, to 283. \nThe report added: “During the last three financial years the company has put in place measures to safeguard the future of the business. The company has undergone rigorous cost cutting and organisational restructuring exercises, and negotiated funding facilities sufficient to meet its working capital requirements.” Like us on Facebook", "external_links": [], "published": "2017-12-11T19:11:00.000+02:00", "crawled": "2017-12-11T19:26:55.013+02:00", "highlightTitle": ""}