{"organizations": [], "uuid": "4b6e2d52ee1a8fd8e51c141287bc425da4e0d4f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13381546.ece/ALTERNATES/s1200/Richard-Branson.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14023873", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Richard Branson calls on British Airways boss to settle £1m bet", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-12T10:00:00.000+02:00", "replies_count": 0, "uuid": "4b6e2d52ee1a8fd8e51c141287bc425da4e0d4f7"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14023873", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Richard Branson calls on British Airways boss to settle £1m bet", "locations": [], "entities": {"persons": [{"name": "richard branson", "sentiment": "negative"}, {"name": "walsh", "sentiment": "none"}, {"name": "willie", "sentiment": "none"}, {"name": "virgin atlantic", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "willie walsh", "sentiment": "none"}, {"name": "mr walsh", "sentiment": "none"}], "locations": [{"name": "virgin atlantic", "sentiment": "none"}], "organizations": [{"name": "british airways", "sentiment": "negative"}, {"name": "air france-klm", "sentiment": "none"}, {"name": "virgin group", "sentiment": "none"}, {"name": "virgin atlantic", "sentiment": "none"}, {"name": "delta", "sentiment": "none"}, {"name": "airline.virgin group", "sentiment": "none"}, {"name": "air france", "sentiment": "none"}, {"name": "iag", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Rail jobs coming to North East with opening of new production plant \nThe North East’s growing reputation in the rail industry will see 30 skilled jobs created with a train company opening a large production site in County Durham. \nVivarail has been attracted by the region’s highly-skilled labour pool and is investing up to £100,000 in its new plant on the Spectrum Business Park, near Seaham, where it will assemble components to power refurbished trains previously run on the London Underground network. \nThe company, which buys old Underground trains and transforms the disused carriages into local commuter trains, has taken an 11,000 sq ft site at Spectrum. \nThe firm upcycles D-Trains, retaining the bodyshell and bogies of the original vehicles, while fitting them with modern engines and cutting-edge technology to create eco-friendly trains that have lower fuel consumption and low emissions. It is expected to open in January. \nChief executive Adrian Shooter, former chairman of Chiltern Railways, said the production facility would further strengthen the region’s rail industry and benefit its wider supply chain. \nHe said: \nAs Vivarail looked to expand and open a new site, the North East was a very attractive location for us, most notably because of its highly skilled pool of engineering and manufacturing workers. \nThe region already has a strong rail industry and we want to tap into this and look to buy locally where we can. Plus, we also have the opportunity to expand further here, depending on the speed and scale of future orders. Rob Mason (centre) and Steve Rowell of Viva Rail with Business Durham's Peter Rippingale at the firms new premises on Spectrum Business Park in Seaham, County Durha (Image: Stuart Boulton) 9:06 Jonathon Manning Brexit Britain will be worse off outside the EU, says Think Tank \nBrexit Britain will be economically worse off outside the European Union, and crashing out without a deal would see the economy take a £100bn hit, an influential US think tank has claimed.An economic analysis carried out by the Rand Corporation shows that a “cliff-edge” no-deal Brexit, where Britain fails to strike a trade deal with the EU, will reduce GDP by 4.9%, or £105bn, over 10 years.The study implies that Theresa May’s Conservative Government is merely undertaking a damage limitation exercise as it presses ahead with Brexit. \nThe report said: \nThe economic analysis shows that the UK will be economically worse off outside of the EU under most plausible scenarios. \nThe key question for the UK is how much worse off it will be post-Brexit. EU and Union flags (Image: PA) 9:00 KEY EVENT North East set for jobs joy as region bucks national trend \nEmployers in the North East are bucking a gloomy national trend and forecasting job creation in the New Year , a new survey suggests. \nThe poll by recruitment group Manpower asked whether more than 2,000 employers intend to hire additional workers or reduce the size of their workforce in the coming quarter. \nThe regular survey has pegged employer confidence in the North East at its highest level since the start of the year, with the surge in companies in this region looking to recruit new staff coming at the same time that job creation has fallen to a five-year low at a national level. \nManpower’s report found that pessimism was particularly acute in London, a state of mind blamed on the capital’s expected prospects after the UK leaves the European Union. \nBut the North East was one of the region’s with a more positive outlook. \nAmanda White, head of specialist markets for Manpower, said: \nThe North East is proving to be a green shoot of optimism against the downbeat national outlook for employment intentions, with the region reporting a four point increase in its Manpower Employment Outlook Survey score. \nFew employers are talking about or planning for Brexit yet, perhaps because we have seen little impact on the number of EU workers in the region. In Newcastle there is a need for more employees in the public sector, particularly in education and the NHS. \nThe other side of this upbeat hiring intentions picture is a mismatch between the roles and the number of candidates that are suitably skilled to fill them, particularly in niche technical roles such as moulding. This means employees with the right skills hold all the power and appear confident to move between employers to secure the best deal. Employment figures are set to increase in the North East next year 8:55 Jonathon Manning Westfield to be taken over in £18.5bn deal \nShopping centre giant Westfield is to be taken over by Unibail Rodamco in a£18.5bn deal.The combination of the two firms will see the creation of a property titan worth £54b spanning countries including Australia, Britain, France, Spain and the United States.The deal will see Paris-based Unibail pay shareholders in Australia’s Westfield Corporation - which has giant malls in London’s White City and Stratford - 7.55 a share at a 17.8% premium.Unibail chief executive Christophe Cuvillier said: \nThe acquisition of Westfield is a natural extension of Unibail-Rodamco’s strategy of concentration, differentiation and innovation. \nIt adds a number of new attractive retail markets in London and the wealthiest catchment areas in the United States. It provides a unique platform of superior quality shopping destinations supported by experienced professionals of both Unibail-Rodamco and Westfield. \nThe acquisition is expected to result in 100 million in cost savings per year across the 104-property group, and the firms have committed to expanding the Westfield brand “flagship shopping destinations”.It comes amid consolidation in the sector.Last week shopping centre owner Hammerson agreed an all share takeover of rival Intu in a £3.4bn deal that will create Britain’s biggest property company. The deal includes the Metrocentre in Gateshead and Eldon Square in Newcastle.The likes of Intu-owned Lakeside and the Bullring in Birmingham, controlled by Hammerson, will come under one roof, forming a £21bn giant.Frank Lowy, Westfield chairman, said: \nThe transaction announced today is the culmination of the strategic journey Westfield has been on since its 2014 restructure. \nWe see this transaction as highly compelling for Westfield’s securityholders and Unibail-Rodamco’s shareholders alike. Unibail-Rodamco’s track record makes it the natural home for the legacy of Westfield’s brand and business. Westfield shopping centre in London 8:45 How does RealRider's crash detection tech work? 8:39 Jonathon Manning RealRider boosts customer base after striking deal with motor finance firm \nRealRider has struck a major deal with Close Brothers Motor Finance that will see the loan company’s customers offered free access to the motorcycle safety app . \nUnder the deal, customers that take out finance on a motorbike or accessories with Close Brothers will receive free access to the app for three months. \nThe relationship will allow RealRider’s parent company Realsafe Technologies to boost its market presence by tapping into Close Brothers’ customer base. \nRealRider’s technology allows it to detect whether a motorcyclist has been involved in a accident. Once its crash detection software has been activated the app then send the rider’s location, along with relevant medical information, to the 999 emergency services. \nThe groundbreaking product gained national attention earlier in the year after co-founder Andrew Richardson successfully pitched the idea to Prince Andrew. Since then the firm has used its connections to strike a number of partnership deals. \nMr Richardson, chief commercial officer of Realsafe Technologies, said: \nThe opportunity to collaborate with Close Brothers began earlier in the year at the Sunderland Software City round of HRH’s Pitch@Palace program. \nAs sponsors of the event, Close Brothers Technology Services’ relationship director Craig Smith saw the potential for us to work together following a presentation of our technology to protect motorcyclists. \nAfter months of discussions, I’m delighted to be working in partnership with Close Brothers, which already counts tens of thousands of bikers among its customers. \nIt is a great opportunity for riders to check out a technology which could potentially save their lives and demonstrates Close Brothers’ own commitment to helping its policyholders stay safe on the road, particularly at this time of year. Andrew Richardson and Zoe Farrington of REALsafe Technologies (Image: Publicity Pic) 8:37 KEY EVENT Zytronic's turnover grows to £22.9m \nSales of large touch screens to the gaming industry has helped Gateshead’s Zytronic boost its turnover by 8.5%. \nThe touch screen manufacturer saw its sales rise from £21.1m to £22.9m for the year ending September 30 2017. \nOver the year the company made a number of changes to its international distribution network but also increased its marketing activity. \nCEO Mark Cambridge said: \nOur 2017 marketing strategy in support of sales activities focused on increasing our profile in European, American and Asian trade publications and key vertical markets. In addition, we have expanded our digital and social media presence, releasing online a new “factory tour” video to highlight our unique capabilities in the touch ecosystem and the competitive benefits we bring to customers. \nWe also participated in several application specific global trade events, including Electronica (the large German electronics fair in November 2016), C-Touch in Shenzhen, China, in the same month, the Integrated Systems Europe (“ISE”) expo in February 2017 in Amsterdam and the USA-focused Digital Signage Expo (“DSE”) in March 2017. \nThe strategy also helped Zytronic increase its profit before tax from £4.3m to £5.4m. Zytronic CEO Mark Cambridge (Image: Chris White) 8:30 Jonathon Manning North East artist's dream to create hub for Lego architects nears funding goal \nA North East artist’s dream to create a hub where people can build Lego is two-thirds of the way to its crowdfunding goal. \nLego architect Steve Mayes is attempting to raise £3,000 to help launch a studio where members of the public can visit to design and build their own Lego projects. \nSo far members of the public have donated £2,065 towards the Brick This Studio. With five days of the campaign remaining the projects needs to raise a further £935 to reach its full target. \nMr Mayes is best known for using the miniature blocks to create replicas of famous North East landmarks such as St James’ Park, the Baltic art gallery and the Angel of the North. \nThe 40-year-old architectural photgrapher is moving into the North Shields studio as he needs more space to carry out his Lego work. However, the crowdfunding support will enable him to improve the office and turn it into a space that the local community can enjoy. \nHe said: \nI already have the place lined up as I need somewhere to do my work. I wanted to make the place more than some where I just work, it will be somewhere for people to do their own projects. But it means making it a but nicer. \nIt is about making it a bit of a hub. That was the idea of the crowdfunding campaign, to make it more of a venue and a destination. \nThere is a lot of people who are keen on it, as Lego is so popular. I would love to hit the target. \nThose who donate larger sums of money to the project will receive a custom made model of a building of their choice. Backers who pledge £300 will get a 5x5 inch model, while those who donate £750 will receive a 10x10 inch model. \nFive people have already donated over £300, but Mr Mayes is yet to discover what buildings they wish him to replicate. \nWith the full £3,000 at his disposal Mr Mayes plans to equip the studio with a number of features that will turn it into a hub for Lego enthusiasts. This includes setting up running workshops and launching a Lego club. Lego architect Steve Mayes at his home in North Shields (Image: Newcastle Chronicle) 8:25 Jonathon Manning Carpetright lowers full-year forecast amid 'fragile'consumer confidence \nRetailer Carpetright has revealed half-year profits crashed by 92.7% and warned full-year earnings will be towards the bottom end of expectations in a “volatile and unpredictable” consumer market.The group cautioned over a “fragile” consumer outlook and intense competition as it posted bottom line pre-tax profits of £300,000 for the six months to October 28, down from £4.1m a year earlier.On an underlying basis, profits more than halved to £2.1m from £5.1m a year ago.Carpetright said a challenging first half saw profits impacted by a clearance sale to shift discontinued bed lines as it overhauled the entire range, as well as “unsuccessful” discounting in the Netherlands and Belgium.UK like-for-like sales rose 0.7% in the first half, but UK earnings fell 27% and profit margins dropped heavily in its European arm.The chain said sales had picked up in the first six weeks of the second half - rising by 1.4% on a like-for-like basis in the UK - but cautioned over the second half as it said consumers were being hit by an income squeeze.Wilf Walsh, chief executive of Carpetright, said: \nWhen wage inflation fails to keep pace with RPI (inflation) there has, at some stage, to be a tipping point when customers tighten their belts. \nAs the Brexit divorce terms remain unclear, the consumer market has remained volatile and unpredictable, but whatever happens we believe we can maintain and indeed grow our share in the core flooring market. \nHe added: \nIn light of the consumer outlook we are taking a more cautious view of the second half and now expect underlying profit before tax for the full year will be towards the bottom end of the current range of market expectations. A Carpetright store", "external_links": [], "published": "2017-12-12T10:00:00.000+02:00", "crawled": "2017-12-12T10:21:16.034+02:00", "highlightTitle": ""}