{"organizations": [], "uuid": "90fcc421a509b291a6a0af1e193a812c8d73370e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14039595.ece/ALTERNATES/s1200/Liz-Truss-MP-shakes-hands-with-True-Potentials-managing-partner-David-Harrison.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/treasury-minister-liz-truss-praises-14039583", "country": "GB", "domain_rank": 21960, "title": "Treasury minister Liz Truss praises North East's growing fintech sector", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-14T18:01:00.000+02:00", "replies_count": 0, "uuid": "90fcc421a509b291a6a0af1e193a812c8d73370e"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/treasury-minister-liz-truss-praises-14039583", "ord_in_thread": 0, "title": "Treasury minister Liz Truss praises North East's growing fintech sector", "locations": [], "entities": {"persons": [{"name": "liz truss", "sentiment": "negative"}, {"name": "david harrison", "sentiment": "none"}, {"name": "newburn", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "liz", "sentiment": "none"}, {"name": "liz truss mp", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "south west norfolk", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "fintech", "sentiment": "none"}, {"name": "dulux academy", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "share liz truss", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Treasury minister Liz Truss praises North East's growing fintech sector Chief Secretary of the Treasury Liz Truss visited Newcastle's True Potential to mark the company's 10th anniversary Share Liz Truss MP shakes hands with True Potential's managing partner David Harrison, after unveiling a plaque marking the company's 10th anniversary (Image: True Potential) Share Get business   \nTreasury minister Liz Truss MP praised the North East’s growing fintech industry as she visited a number of businesses across the region yesterday. \nMs Truss, who is Chief Secretary of the Treasury, visited Newcastle fintech business True Potential to meet employees and unveil a plaque marking the company’s 10th anniversary. \nDuring her visit, the MP for South West Norfolk praised the North East for contributing to the country’s growing fintech industry. \nSpeaking to The Journal, Ms Truss said: “Fintech is the future of financial services. It’s incredibly important for all of our lives that we have got saving pots, that we are able to retire comfortably, and that we are able to manage our money effectively. But we can do it in a much more modern way. \n“It is a huge growth industry for the UK. We have just seen a record level of investment in fintech firms last year and we are world leaders in this. It is brilliant to see it happening here in Newcastle to such a great extent.” (Image: True Potential) \nMs Truss added that the Government was continuing to support fintech industry and reiterated plans to open up £20bn of funds for new firms starting up. \nCommenting on True Potential’s growth, the MP said: “I am hugely impressed by True Potential and what they are doing. It’s really cutting edge financial technology and it has expanded over 10 years. \n“I’ve been around talking to staff about how they have developed in their jobs how they are bringing on people from local universities and schools and training them up.” \nTrue Potential specialises in using technology to allow people to invest their money easily through platforms such as its impulseSave app. The app allows people to invest as little or as much as they like in a portfolio. Read More Mike Ashley's Sports Direct see profits fall by £95m - but he says results are a success \nOver the last year True Potential has invested £3m in expanding its office space and growing its workforce at its Newburn head office. The purchase and renovation of the 11,000sq ft office was the company’s largest investment. \nIt has also increased its headcount during the year after hiring an additional 59 members of staff, which included 10 technology developers and 11 apprentices. The company now employs more than 300 people. \nManaging partner David Harrison said: “It was a great pleasure to welcome Liz to True Potential today. We are an example of the vibrant, growing fintech sector outside of London and we feel very optimistic about the future. That is why we took the decision to invest heavily in our office space and also to grow our team. Read More Mike Ashley's Sports Direct see profits fall by £95m - but he says results are a success \n“We have seen the value of our investment funds increase since Brexit as well as the appetite to invest in them. I can say that our 10th year in business has been our best yet and we look forward to many more.” \nFollowing her visit to True Potential, Ms Truss travelled to AkzoNobel’s new paint production plant in Ashington, Northumberland, where she opened the Dulux Academy, which trains painters and decorators. \nAkzoNobel recently opened the new facility, which is the most advanced paint manufacturing plant in the world. The factory cost more than £100m to build and helped to secure 150 jobs. Like us on Facebook", "external_links": [], "published": "2017-12-14T18:01:00.000+02:00", "crawled": "2017-12-14T18:29:37.000+02:00", "highlightTitle": ""}