{"organizations": [], "uuid": "95be6ef07ab9d60112cd8a4cb2c8064e17d4dead", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article948240.ece/ALTERNATES/s1200/34901188.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/business/big-hitters-audit-tax-consulting-948136", "country": "GB", "domain_rank": 48128, "title": "Big hitters at audit, tax and consulting specialists RSM on why they feel optimistic about 2018", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-20T07:00:00.000+02:00", "replies_count": 0, "uuid": "95be6ef07ab9d60112cd8a4cb2c8064e17d4dead"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/big-hitters-audit-tax-consulting-948136", "ord_in_thread": 0, "title": "Big hitters at audit, tax and consulting specialists RSM on why they feel optimistic about 2018", "locations": [], "entities": {"persons": [{"name": "kevin harris", "sentiment": "none"}, {"name": "tom pegden", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}], "organizations": [{"name": "pkf cooper parry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Big hitters at audit, tax and consulting specialists RSM on why they feel optimistic about 2018 \"This region is a really good area to invest in and the city is upbeat\" Share RSM Grove Park office managing partners Kevin Harris (left) and Ben Lawrance (Image: Peter Fothergill) Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIt’s been an interesting year for UK industry, writes Leicester Mercury Business Editor Tom Pegden. \nBrexiteers might say an exciting one, with more to come. \nRemainers might say a worrying one... with more to come. \nOne thing remains the same though, that business – and for that matter life – goes on. \nDespite the overall uncertainty looming over 2018, the team at audit, tax and consulting specialists RSM in Grove Park, Enderby, is looking forward to big things in the coming year. \nFollowing a couple of key appointments in 2017, the office is gearing up for a bit of a marketing push to get its – still relatively new – brand out there. \nSome of the new push comes on the back of the recent appointment of audit partner Kevin Harris. \nHe was previously a partner at independent accountancy firm PKF Cooper Parry, helping it expand and relocate to Castle Donington a few years back. \nHe quit that firm – followed by an extended period of gardening leave – to look for a new challenge back in Leicester . \nHis number one reason for joining RSM, he said, was to be at a company that had “ambitions to grow”. Grove Park - RSM are happy with their out-of-town office \nMr Harris said: “The thing about RSM is the infrastructure and size, and you are able to use those tools in the market. \n“I will be working with the SME market – broadly speaking businesses with turnovers in the region of £10-100 million – and predominantly my role will be in building the RSM brand and its market position in Leicestershire.” \nHe is a prominent member of the county business community and vice-chairman of the Leicester and Leicestershire Enterprise Partnership which, he said, helped him keep a finger on the local economic pulse. \nHe is also a non-executive director of the East Midlands Chamber. \nHe and office managing partner Ben Lawrance are now planning to get their name out there, whether that’s for small firms planning big things or established firms worrying about Brexit. \nMr Harris said: “When I left Cooper Parry I took stock of what to do next and decided there were a number of things I really wanted to do. \n“One was to get back into Leicester, because I think when you are regionalised you do lose out on the ground. \n“I also wanted somewhere with a clear desire to grow market share in Leicestershire. \n“RSM had gone through the rebranding [from Baker Tilly in the UK a couple of years ago] and the time was right to push forward the RSM brand locally – which is what I had done, I think successfully, with Cooper Parry. \n“This had all the right ingredients – the people, the desire, the service range, client base and the investment. “I did speak with a number of firms and this was the one with the desire to grow in Leicester and was prepared to put the money and investment behind that. \n“This is a really important stage for this business in terms of growth and development. \n“The key message is that RSM very much sees the regions and the East Midlands as really good areas to invest in. \n“By contrast, a lot of firms in our profession are focusing on centralised strategies. \n“A lot of them think the East Midlands might not warrant offices in, say, Nottingham and Leicester, but RSM doesn’t believe in that. \n“Given that the market in Leicester has seen significant growth among mid-market SMEs, there’s a real desire from a lot of business owners to have local support. So the plan is to grow the current offices. \n“I also think somewhere like Grove Park, or Meridian Business Park , is almost an extension of the city.” \nMr Lawrance said: “Grove Park is ideal for us. It’s not that tricky to get to Leicester from here and there’s also a real office cluster here – we’re close to lots of people like HSBC and Santander.” Read More Profits rocket at Hinckley-based Triumph Motorbikes \nAt present the office has almost 100 staff, but has room for up to 150, and takes on graduates on a regular basis. \nRecent senior appointments at the office have included David Graham, who came from Cooper Parry as business development director, Helen Robinson as associate director, and Sheetal Sanghvi as an associate tax director focusing on R&D. \nMr Lawrance said the team was planning to work more with the regional Chamber of Commerce as a “Brexit partner”, to be the “go-to” firm on the impact of the coming negotiations and deals in key areas such as duty. \nMr Harris said, even with constant reminders of Brexit in the news, businesses remained positive. Read More \nHe said: “Leicester really is a big success story – the Government recognises that and the LLEP has been commended. \n“There’s a good link between Leicester and surrounding areas, and the city is upbeat. \n“There’s been investment here and a second Enterprise Zone has been created and I get the general feeling a lot of Leicestershire business owners are resilient and robust and see opportunities where others may not. \n“The key thing for a firm like ours is to be close to our clients and to be there as and when it becomes clearer – but I can’t see why Leicestershire should be in a worse position post-Brexit than anywhere else.” Read More \nMr Lawrance said: “If you ask people what the challenges are that keep them awake at night, the two things many of them are talking about are staffing and duty. \n“They are the two big areas, but no-one can tell you what the end results will be. \n“As soon as we know about anything like duty we will help them. \n“But right now they have got to get on with it.” \nWith all the opportunities ahead, Mr Harris said there was no reason why the Leicester office couldn’t double the number of clients in the next five years. \nHe said: “If you monitor our activity in 2018/19 in terms of people recruitment, client recruitment, branding, you are going to see a lot more from RSM.” Like us on Facebook ", "external_links": [], "published": "2017-12-20T07:00:00.000+02:00", "crawled": "2017-12-20T10:35:54.032+02:00", "highlightTitle": ""}