{"organizations": [], "uuid": "93697ff98ef2c0b49a13ee4d5355c1a385be98cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13910000.ece/ALTERNATES/s1200/HCR_NEC_161117events_03.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13999906", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Eldon Square and Metrocentre to be acquired amid £3.4bn Intu deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-06T10:30:00.000+02:00", "replies_count": 0, "uuid": "93697ff98ef2c0b49a13ee4d5355c1a385be98cb"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13999906", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Eldon Square and Metrocentre to be acquired amid £3.4bn Intu deal", "locations": [], "entities": {"persons": [{"name": "tony hall", "sentiment": "none"}, {"name": "david atkins", "sentiment": "none"}, {"name": "mccarthy", "sentiment": "none"}, {"name": "andretta", "sentiment": "none"}, {"name": "david tyler", "sentiment": "none"}, {"name": "intu", "sentiment": "none"}, {"name": "hakim yadi", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "john strachan", "sentiment": "none"}, {"name": "thierry andretta", "sentiment": "none"}, {"name": "hakim yadi obe", "sentiment": "none"}], "locations": [{"name": "eldon square", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "gosforth high street", "sentiment": "none"}, {"name": "bicester village", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "gosforth synagogue", "sentiment": "none"}, {"name": "graham park road", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "graham park", "sentiment": "none"}, {"name": "intu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "trafford centre", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "northgate", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}], "organizations": [{"name": "coreena ford developers", "sentiment": "negative"}, {"name": "trinity church", "sentiment": "none"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "united hebrew congregation", "sentiment": "none"}, {"name": "coreena ford mulberry", "sentiment": "none"}, {"name": "intu", "sentiment": "none"}, {"name": "brent cross", "sentiment": "none"}, {"name": "hammerson  shares", "sentiment": "none"}, {"name": "the northern health science alliance", "sentiment": "none"}, {"name": "tyne hospitals nhs trust", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "procter &gamble", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "nhsa", "sentiment": "none"}, {"name": "hebrew congregation", "sentiment": "none"}, {"name": "intu properties", "sentiment": "none"}, {"name": "hammerson", "sentiment": "none"}, {"name": "northgate plc", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "northern health science alliance", "sentiment": "none"}, {"name": "onward global fashion", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "key event northern health science alliance", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Toys R Us North East stores survive plan to axe 26 stores \nFears of regional job losses at retail giant Toys R Us have been allayed after the firm said all three North East stores will stay open. \nThe company yesterday announced plans to close 26 shops in the new year as part of a company voluntary agreement (CVA), which would allow it to jettison loss-making stores. \nThe firm said the transformation plan is needed to “meet the evolving needs of customers in today’s UK retail market” and it is understood that 500 to 800 jobs could be lost as part of the CVA process – but that all efforts will be made to redeploy team members where possible. \nHowever, Toys R US has confirmed the Gateshead Metrocentre , Sunderland and Stockton shops will not close. \nA Toys R Us spokeswoman said: “It is our intention to keep the Toys R Us store in Teesside open. We are reviewing options including downsizing the store or a rent reduction. “The Toys R Us stores in Metrocentre and Sunderland will not be closing.” Toys R Us shop (Image: PA) 9.20 Coreena Ford New jobs coming to Washington's Cenergist amid £515,000 investment \nA growing North East energy consultancy’s plans to create new jobs have been backed with a £515,000 investment . \nCenergist is a specialist energy and water efficiency company, working across the UK and Europe with public and private clients looking to make energy and financial savings. \nFW Capital has now backed its mission to create new jobs and open up new revenue opportunities with a six-figure investment from the Northern Powerhouse Investment Fund (NPIF). \nWashington-based Cenergist is aiming to grow its work with the major energy companies around the government’s ‘affordable warmth’ obligation, which requires them to help vulnerable and low-income households to reduce their heating costs. \nCenergist has created four new jobs in setting up a new office in Billingham which will carry out this work, and expects to create a further four in the near future as it builds towards substantially increasing its revenues from affordable warmth work. \nA £515,000 investment from NPIF – FW Capital Debt Finance, managed by Newcastle’s FW Capital has enabled Cenergist to set up the new Tees Valley office and bring in the skilled personnel required to run it. (From left) James Waring of Cenergist, Keith Charlton of FW Capital, and Dan Ludgate and Sarah Howells of Cenergist (Image: Crest Photography) 9.15 Coreena Ford Saga shares fall following profit warning \nOver 50s travel and insurance firm Saga saw shares plummet by as much as 25% this morning after it warned the collapse of airline Monarch had hit earnings and said efforts to attract new customers will see next year’s profits fall. \nThe group said Monarch’s demise in October, which saw holidays cancelled for around 860,000 people, had knocked its tour operations business, leaving it with a £2 million one-off hit. \nSaga said this would now slow growth in underlying pre-tax profits to between 1% and 2% for the year to January 31, down from more than 5% in the first half. \nThere was further gloom for the new financial year as the group added that a plan to invest an extra £10m a year into attracting new customers, alongside other “headwinds”, would see underlying profits fall by around 5%. \nShares tanked on the news, falling as much as a quarter at one stage to hit their lowest level since its stock market flotation in May 2014. \nLance Batchelor, chief executive of Saga, insisted the group was right to maintain investment plans, despite recent “challenging trading conditions”. \nThe share price currently sits at 139p, down 23.33%. Summer holidays Coreena Ford Domino's warns over Brexit recruitment crisis \nDomino’s Pizza is urging the Government to put politics to one side and pursue a Brexit immigration policy guided by economic considerations to help avoid a recruitment crisis in the hospitality industry. \nSimon Wallis, the group’s chief operating officer, said that half of Domino’s staff in leadership roles come from countries such as Estonia, Portugal and Romania. \nHowever, the future pipeline of managers is being threatened by Conservative plans to sever Britain from the single market in a bid to slash immigration to the “tens of thousands” following Brexit. \nHe said: \nNot only have the people of Britain turned to migrants to make their lattes, build their kitchens and take care of their elderly, they’ve also relied on them to provide leadership. \nWe need to properly consider how we’re going to supply our economy with the legions of team leaders who keep the tills ringing, the wheels turning and the pizzas coming. \nDomino’s is embarking on an expansion drive, with plans to open 600 more stores over the next few years which will require more than 21,000 staff, but a fall in net migration means it will become increasingly difficult to find people to take up the roles. \nIt is also planning to recruit 5,000 over the busy Christmas period, when it expects to serve up over nine million pizzas. \nEarlier this year Domino’s, which employs around 35,000 staff across 1,000 stores, issued a call for young British staff to help plug the gap. \nMr Wallis said that thus far, the debate on Britain’s looming labour shortage following Brexit has tended to focus on seasonal and casual workers, tradesman and, professionals. \nHe added: \nBut there is a fourth group which I believe is where the biggest hazard lies after Brexit. Many of these team leaders started out delivering pizzas, labouring or cleaning, but through ambition and hard work they’ve turned casual work into a career. A Domino's Pizza venue (Image: publicity picture) 9.05 Coreena Ford Developers' plans for part of Gosforth synagogue site are unveiled to the public \nProposals to build retirement on the site of Newcastle’s largest synagogue have been unveiled to the public. \nThe city’s United Hebrew Congregation struck a deal earlier this year with developers McCarthy and Stone to sell the majority of its site on the corner of Graham Park Road and Gosforth High Street. \nBuilt in 1986, the synagogue was built to hold congregations of around 300 but is now attracting only around 50 worshippers to typical services. \nThis has led the Hebrew Congregation to plan converting an old house on the site into a new synagogue, and McCarthy and Stone, the UK’s leading developer of retirement homes, has acquired an interest in the rest of the site. \nNow seeking feedback from local residents on its proposals for the site, the company has held a public exhibition at Trinity Church, Gosforth, to release early details of their proposals. The Gosforth Synagogue on Graham Park road, Newcastle (Image: Newcastle Chronicle) 9.00 Coreena Ford Van Monster openings provide a boost for North East car rental firm \nCar rental firm Northgate Plc saw its profits take a hit amid investment in a host of new Van Monster branch openings . \nProfits at the firm fell by £6m over the six months leading up to October, but the business said it hoped figures would improve during the second half of the year. \nThe Darlington-based firm has focused its efforts on cutting costs while also expanding the number of locations of its Van Monster rental brand. \nSince the start of the year five new sites have been opened while a further five rental sites have been converted to Van Monster locations. \nThe openings are revealed as Northgate unveils interim results for the six months ending October 2017, in which operating profit fell by 13%, £45m in 2016 to £39.1m. \nMeanwhile, the business experienced a major boost to its total revenue, which grew by 10.4% from £316.7m to £349.7m. Northgate Plc's vans KEY EVENT Northern Health Science Alliance named as Government partner in life sciences deal \nTHE Northern Health Science Alliance (NHSA) has been named as the Government’s delivery partner for the Life Sciences Industrial Strategy Sector Deal that’s set to bring £1bn of investment into the North. \nThe NHSA, a partnership of leading universities, NHS hospital Trusts and four Academic Health Science Networks across the region, has identified the investments to be made into the region’s economy over next five to seven years. \nThe next stage of the deal will see the alliance – which includes Newcastle University, Durham University and The Newcastle upon Tyne Hospitals NHS Trust – begin working with Government early in the new year, to make sure the Industrial Strategy in life sciences is place-based and that deals are made in the right areas. \nThe sector deal is likely to have a huge impact on the North East, which has the largest life sciences sector in the UK, with global players like Procter & Gamble and GlaxoSmithKline having bases in the region, alongside a number of emerging pharmaceutical firms. \nIt is expected that key life science clusters and the Devolved Administrations will work with the NHSA, which has identified a strong commercial pipeline of investment for future waves of the sector deal. \nDr Hakim Yadi OBE, CEO of the NHSA said: “We are thrilled to be working with the Government to deliver a life sciences sector deal that delivers for the North. Dr Hakim Yadi, chief executive of the Northern Health Science Alliance 8.48 Coreena Ford Mulberry looks overseas as UK demand slows \nLuxury handbag maker Mulberry has revealed widening half-year losses but said strong international demand and tourist spend is helping offset a slowing UK market. \nThe group posted pre-tax losses of £609,000 for the six months to September 30 against £515,000 a year earlier after like-for-like sales fell 1%. \nChief executive Thierry Andretta said the UK market remains “uncertain”, with domestic sales falling 1% despite a boost from overseas shoppers taking advantage of the Brexit-hit pound, while overseas sales dropped 3%. \nBut the group has returned to sales growth since the half-year, with a 12% surge in international sales helping overall sales lift 1% in the 10 weeks to December 2. \nMr Andretta said: “We continue to see strong demand from tourists in London and whilst the UK remains uncertain, the group remains in a strong position to invest in further developing the customer experience in key international markets and enhancing its unique UK design and manufacturing base.” \nThe group is focusing efforts on expanding overseas, in particular to Asian markets as a growth area. It recently announced a tie-up with Japanese firm Onward Global Fashion and Mr Andretta said the firm had seen a “successful” start to trading in the Japanese market since the deal was struck in July. The Mulberry store in Edinburgh 8.42 Coreena Ford What's the FTSE latest? \nThe FTSE-100 index at 8.15am was down 27.76 at 7299.74.The pound at 8am was 1.3407 dollars compared to 1.3449 dollars at the previous close. The euro at 8am was 0.8821 pounds compared to 0.8782 pounds at the previous close. 8.40 KEY EVENT Intu and Hammerson deal - what the directors say \nDavid Tyler, chairman of Hammerson, said: “This transaction will deliver real value for shareholders. The financial strength of the enlarged group and its strong leadership team will make it well-placed to take advantage of higher growth opportunities on a pan-European scale.” \nDavid Atkins, chief executive of Hammerson, said: “The acquisition creates a leading pan-European platform of desirable retail and leisure destinations which are better positioned to serve the needs of our retailers, excite our customers and support our partners and communities.” \nJohn Strachan, chairman of Intu, said: “A combination of both Intu and Hammerson will create a more resilient, diversified and stronger group that we believe will benefit all our stakeholders. “Intu offers high-quality retail and leisure destinations in the UK and Spain, which when merged with Hammerson’s own top-quality assets in the UK, in France and in Ireland, present a highly attractive proposition for retailers and shoppers in Europe’s leading cities.” \nHammerson shares are currently 516p, down 3.46% while Intu Properties shares sit at 235.1p up 18.14%. Inside intu Metrocentre in Gateshead 8.30 KEY EVENT Eldon Square owner Intu set to be snapped up in £3.4bn deal with Hammerson \nShares in Metrocentre and Eldon Square owner Intu Properties have soared 18% in early trading following an announcement of a takeover deal by Hammerson. \nHammerson has agreed an all share takeover of rival Intu in a £3.4bn deal set to create Britain’s biggest property company. \nIt will see the two North East-based centres and all other UK centres, owned by Intu, and the Bullring in Birmingham, controlled by Hammerson, come under one roof. \nThe acquisition will result in Hammerson shareholders owning 55% of the combined firm and Intu investors the remainder \nThe deal, which would create a £21bn shopping centre giant, is set to be voted upon by shareholders next year. \nThe deal represents a value of approximately 253.9p per Intu share, equivalent to £3.4bn. \nThe combined group will be led by Hammerson boss David Atkins and chaired by David Tyler. \nIntu has apparently aready secured 50% of investor support for the all-paper deal. \nTogether, the groups plan to slash costs and offload at least £2bn worth of its assets - and target high growth markets such as Spain and Ireland. \nIntu also operates the Trafford Centre in Manchester while Hammerson owns Bicester Village and Brent Cross shopping centre. \nThe deal comes at a time when consumer confidence has taken a pounding following the Brexit vote, resulting in a sharp decline in retail sales. However, shopping centres in city locations have tended to fare better than high streets during economic downturns. Countdown to Christmas begins and shoppers across the north east can look expectantly up at intu Eldon Square's giant Christmas clock, in their Northumberland Street entrance, which displays the number of sleeps until the big day. Credit: Tony Hall (Image: Tony Hall Photography) More On", "external_links": [], "published": "2017-12-06T10:30:00.000+02:00", "crawled": "2017-12-06T11:17:00.011+02:00", "highlightTitle": ""}