{"organizations": [], "uuid": "34d6cc7cfe3dbc05aefa8fbdb2406429fd992c46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12381042.ece/ALTERNATES/s1200/SGP_NEC_291216SUNRISE02JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-updates-14062571", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-21T09:00:00.000+02:00", "replies_count": 0, "uuid": "34d6cc7cfe3dbc05aefa8fbdb2406429fd992c46"}, "author": "Kali Lindsay", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-updates-14062571", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}], "locations": [{"name": "great north road", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "gosforth park", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "tyne tunnel", "sentiment": "none"}], "organizations": [{"name": "tyne tunnel  traffic", "sentiment": "none"}, {"name": "sunderland high", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "All's well on the Metro \nNo problems to report on the Metro: 16:06 Tom Eden See the Farne Islands as you've never seen them before \nRangers on the Farne Islands used a drone to help them record the second ever highest number of seal pups on the archipelago. (Image: PA) \nThis year’s tally had looked set to break the previous record of 2,295 pups, until bad weather stopped the team from finishing the count, meaning it came in at 2,010. \nThe group of National Trust rangers live on the islands off the Northumberland Coast between April and December, with the annual seal count taking place over several months from October. (Image: PA) \nUsing the drone enabled them to map the locations of newly born seals and their parents without intruding on the pups. \nGwen Potter, countryside manager, National Trust , said: \n“The team have battled the elements once again to conduct this year’s count, which would have been record breaking if we’d had better luck with the weather. \n“The drone was effective, helping us to be more flexible and accurate. We’re in the hands of nature out here, and our plans for the day are always shaped by the weather.” (Image: PA) Tom Eden Snow 'unlikely' this Christmas \nIt’s more likely to be a windy Christmas than a white one, with forecasters warning of blustery conditions and rain for many parts of the country. \nLow-pressure conditions are likely to dominate from around Christmas Eve onwards which means spells of heavy rain and strong winds between Christmas and New Year. \nThose living in the far north of Scotland may be the only ones to experience snow on Christmas Day. \nMet Office meteorologist Helen Chivers said: \n“For the big day itself, parts of Scotland and Northern Ireland are likely to see some heavy and prolonged rain and there is still a possibility of a white Christmas for some northern areas of Scotland. \n“But, for most of us, it’s largely going to be dry and breezy Christmas Day.” \nFriday is expected to be mostly dry, cloudy and mild, with brighter spells in the east and light rain in western Scotland and the far west of England and Wales. \nEngland and Wales are forecast to be mild, cloudy and “increasingly breezy” over the Christmas weekend. Business Tom Eden £120m boost for North East following Brexit day \nA £120m fund with the potential to support 600 firms and create 3,500 jobs is back on track after stalling following the Brexit vot e. (Image: AP) \nThe release of the North East Fund – also known as Jeremie – was put on pause as the financial organisations involved in the scheme waited for movement on Brexit talks. \nBut following the recent breakthrough in talks, it has now been announced that the fund is hoped to go live early in the new year. \nThe fund will offer a range of equity investments and loans to firms, to drive growth and job creation in the North East Local Enterprise Partnership (LEP) area. Gateshead Tom Eden Shop loses licence for selling booze to 15-year-old \nA Gateshead shop has been stripped of its licence after selling alcohol to an undercover teenager. (Image: Newcastle Chronicle) \nRavensworth Food Market on Ravensworth Road, Birtley, sold four cans of Foster’s to a 15-year-old volunteer on October 24. \nThe teenager was asked ‘you are 18 aren’t you?’ by a shop employee, but was served without ID when they replied ‘yes’. \nThe sale was part of a test purchase operation from Gateshead Council’s Trading Standards team, and on Tuesday the shop’s licence was revoked in a review hearing at the Civic Centre. \nGateshead Local Safeguarding Children Board, Northumbria Police , Public Health, and the Licensing Authority raised concerns over the sale, as well as the shop’s history and management structure. \nRavensworth Food Market was previously caught selling alcohol to a teenager in another test operation back in October 2015, and conditions such as the installation of a CCTV system and the introduction of a ‘Challenge 25’ were put on the shop. Jesmond Tom Eden Former offices to be turned into apartment block \nPlans to turn a former office building in Newcastle into an apartment block have been given the green light. (Image: Jomast Developments Ltd) \nThe scheme, by Jomast Developments Ltd, involves adding four storeys to the vacant Sandyford House, in Jesmond , to create a building with 15 floors. \nOnce complete, the tower will have 91 apartments, and the ground and lower ground floor could include retail space, a restaurant or bar. \nThe project is set to create 65 jobs during construction and 55 through commercial uses once the work is complete. \nThe proposals have now been approved by a Newcastle City Council planning committee. \nThe panel was told that Sandyford House was designed as an 11-storey office block around 40 years ago but is no longer considered suitable for modern office needs. It was described as an ‘eyesore’. Plans to turn Sandyford House in Jesmond into an apartment block have been approved (Image: Jomast Developments Ltd) 13:48 Would-be robbers leave Asda empty handed \nTwo would-be thieves attempted to rob a security van outside an Asda supermarket before fleeing the scene on push bikes. \nNorthumbria Police were called to the scene on Adelaide Terrace in Benwell , Newcastle, at 8.25am on Thursday. The Asda store off Adelaide Terrace in the Benwell area of Newcastle where an attempted armed-robbery took place this morning (Image: Newcastle Chronicle) \nTwo hooded men approached a security guard and tried to grab a case containing the store’s takings. \nThe guard was able to keep hold of the case, and the two men fled empty-handed on bikes in the direction of Denton Burn. 13:26 Heavy traffic around Metrocentre \nRiverside Way is busy in both directions at Scotswood View/ Gibside Way due to people heading to the Metrocentre for Christmas shopping. 13:15 Thieves steal trees from cemetery \nThieves have stolen Christmas trees from a Tyneside cemetery recently renovated by the community. \nThoughtless vandals trashed graves at Hebburn Cemetery on Victoria Road West in February, prompting the creation of the Friends of Hebburn Cemetery group. \nThe community rallied together and invested more than £10,000 on a CCTV system, as well as organising monthly clean-ups and local events. The small Christmas trees stolen from Hebburn Cemetery (Image: John Stewart) \nNearby business Superior Interiors on Station Road donated two small Christmas trees to show a little festive spirit for visitors to the cemetery. \nBut the community has now been left stunned after these gifts went missing at some point overnight between Sunday and Monday. ", "external_links": [], "published": "2017-12-21T09:00:00.000+02:00", "crawled": "2017-12-21T10:16:58.031+02:00", "highlightTitle": ""}