{"organizations": [], "uuid": "8671cfcca28a7519fbfad5b74eff5435e52d73b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article949638.ece/ALTERNATES/s1200/35401067.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/accountancy-firm-mne-becomes-category-949619", "country": "US", "domain_rank": 48128, "title": "Accountancy firm MNE becomes category sponsor at Leicester Mercury Business Awards 2018 - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.55, "site_type": "news", "published": "2017-12-28T07:00:00.000+02:00", "replies_count": 0, "uuid": "8671cfcca28a7519fbfad5b74eff5435e52d73b0"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/accountancy-firm-mne-becomes-category-949619", "ord_in_thread": 0, "title": "Accountancy firm MNE becomes category sponsor at Leicester Mercury Business Awards 2018 - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "tim emmony", "sentiment": "none"}, {"name": "alex hannam", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "upper brown street", "sentiment": "none"}], "organizations": [{"name": "mne", "sentiment": "negative"}, {"name": "mne accounting", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Accountancy firm MNE becomes category sponsor at Leicester Mercury Business Awards 2018 MNE Accounting has chosen to sponsor the Start-Up Business of the Year Award Share Tim Emmony, managing director at MNE Accounting (Image: Alex Hannam) Share Get Business   Thank you for subscribing! Could   A Leicester accountancy firm is supporting regional businesses by becoming a category sponsor at the 2018 Leicester Mercury Business Awards. MNE is based in Upper Brown Street, and offers financial guidance, book-keeping support and accountancy services to businesses, including many in the capital. It has chosen to sponsor the Start-Up Business of the Year award. The Leicester Mercury Business Awards 2018 are a standout event on the region’s business calendar, honouring the success of businesses across a wide range of sectors. As well as acknowledging Leicestershire’s leading companies, the awards provide a chance for small to medium businesses to be acknowledged for their contribution to the business community. This year, the Start-Up Business of the Year award will reward the company who has been in operation for the last three years, and who are already seeing success in their sector. MNE will be tasked with deciding the shortlist of finalists and the eventual winner. Cheers! Last year's Leicester Mercury Business Awards were a great success Managing director Tim Emmony, explained why he chose to sponsor this particular category. He said: “As a relatively new business ourselves, this is an award that is very close to our hearts and we can fully appreciate the challenges facing business owners at this early stage. \"These awards prove to be a great platform for start-ups to tell their stories. Our vision for the firm is to continue to grow, but to do so with the same quality we’ve achieved to date. \"We had always envisaged having between 10-15 staff. However, we now have a larger team in place which proves that with the right people, we can still offer the same level of service. \"The focus for us is about hiring the right people to let the growth happen in the right way.” Understanding the ever-changing and unpredictable nature of the financial industry, Tim discussed how MNE contribute to Leicester’s business community. (Image: Will Johnston) He said: “Our role, as it should be, is to properly embrace the ever-changing marketplace so that businesses in Leicestershire continue to thrive as if nothing really happened. \"The role of the accountant is changing quickly, but it’s more than just making sure businesses have their financial information in the cloud. \"This isn’t just a gentle shift in a new direction, more a violent shove with making tax digital, GDPR, not to mention Brexit. \"With this amount of regulatory change, small businesses will look to accountants like ourselves for advice more than ever.” Read More Aspirational magazine: Leicester Mercury Business Awards are place to acknowledge business success Nominations for the awards are now open, with the black-tie ceremony taking place on April 12, 2018 at the Maher Centre, Leicester. This year there are 14 awards on offer including a number of new categories – Employer of the Year, Customer Service Excellence, Sustainability and Excellence in Innovation. All finalists will be welcomed with a Champagne reception upon arrival before enjoying a delicious three-course meal. Then the award giving will begin with category sponsors taking to the stage to hand the coveted awards over to the deserving winners. For more information on the awards, get in touch with Kirsty West at event organisers Champions (UK) plc. Call 08453 31 30 31 or email To fill in a nomination form click on the business awards website here. Like us on Facebook", "external_links": [], "published": "2017-12-28T07:00:00.000+02:00", "crawled": "2017-12-28T08:47:58.010+02:00", "highlightTitle": ""}