{"organizations": [], "uuid": "072f25cef5e907c8c159433f40857e6e167c83e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article924382.ece/ALTERNATES/s1200/sarahPNG.png", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/devon-mp-sarah-wollaston-should-924314", "country": "US", "title": "Devon MP described as a ‘self-consumed malcontent’ after disagreeing with PM over Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-14T11:19:00.000+02:00", "replies_count": 0, "uuid": "072f25cef5e907c8c159433f40857e6e167c83e0"}, "author": "Guy Henderson", "url": "http://www.devonlive.com/news/devon-news/devon-mp-sarah-wollaston-should-924314", "ord_in_thread": 0, "title": "Devon MP described as a ‘self-consumed malcontent’ after disagreeing with PM over Brexit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThere have been calls for Totnes MP Sarah Wollaston to be deselected as the town's Conservative MP after she joined a rebellion to defeat Prime Minister Theresa May over Brexit in the Commons last night. A dozen Tory rebels inflicted a humiliating defeat on the Prime Minister as they voted to give MPs a 'meaningful vote' on leaving the EU. \nDr Wollaston was among the rebels and found herself on the front pages today, with the Mail picturing her in a rogues gallery and asking if she and the others were proud of themselves for being 'self-consumed malcontents' to 'pull the rug from under our EU negotiators, betray their leader, party and 17.4m Brexit voters and - most damning of all - increase the possibility of a Marxist in No.10' Sarah Wollaston on the Daily Mail front page today Read More Health campaigners say coffin left outside MP's door carried 'legitimate political message' \nNadine Dorries, Conservative MP for Mid-Bedfordshire, told the Mail Online: \"The Tory rebels have put a spring in Labour's step, given them a taste of winning. They have guaranteed the party a weekend of bad press, undermined the PM and devalued her impact in Brussels. \n\"They should be deselected and never allowed to stand as a Tory MP, ever again.\" Read More How family GP Sarah Wollaston became Devon's most influential MP \nThe rebels rallied around ringleader Dominic Grieve to back his attempt to ensure MPs have a \"meaningful vote\" on the withdrawal deal. Dr Wollaston was one of the 12 to rebel against the PM. \nAfter the result she tweeted: \"This is not about a Govt defeat but about a Parliamentary victory Proud to have supported a # MeaningfulVote \" Dr Sarah Wollaston \nHere are some of the other Tweets which have followed last night's rebellion: \nThis morning Dr Wollaston told BBC Radio Devon: \"It's not about stopping Brexit, it's about giving control back to Parliament to get the right deal. Sometimes Parliament has to put its foot down and say No.\" Like us on Facebook ", "external_links": [], "published": "2017-12-14T11:19:00.000+02:00", "crawled": "2017-12-14T12:24:14.002+02:00", "highlightTitle": ""}