{"organizations": [], "uuid": "3dd4d18bf7496a28a65e4bfda7cdd93ea9dbc5cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13497626.ece/ALTERNATES/s1200/Donald-Trump.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14063948", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Trump tax reforms to give hotel group major boost", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-21T10:05:00.000+02:00", "replies_count": 0, "uuid": "3dd4d18bf7496a28a65e4bfda7cdd93ea9dbc5cd"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14063948", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Trump tax reforms to give hotel group major boost", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "ppf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford The Herb Garden Harbour restaurant closes in North Shields \nNorth Shields restaurant The Herb Garden Harbour has closed its doors less than a year after opening. \nThe restaurant launched in spring 2017 following the success of its sister branch in Newcastle city centre. \nThe North Shields eatery was located at the Royal Quays Marina, after managing to secure the premises despite coming up against a number of chain restaurants that also wanted to move into the space. \nThe business announced its closure to customers on Facebook, and thanked staff and customers for supporting the business during its short lifespan. \nThe announcement read: “It’s been an incredibly difficult decision and it’s with a very heavy heart that today we officially announce we are closing our doors for good. \n“We want to say a huge thank you to all of you beautiful people who have given us your custom over this past year.” The Herb Garden Harbour on the Royal Quays Marina in North Shields (Image: Newcastle Chronicle) 9.05 Coreena Ford Judge to rule on entrepreneur's claim against Candy brothers \nA businessman is due to find out the result of his multimillion-pound High Court action against luxury property developers Nick and Christian Candy. \nA judge in London will announce his decision on entrepreneur Mark Holyoake’s claim for £132m damages against the brothers. \nMr Holyoake brought the case over losses he says he suffered after borrowing £12m from the property tycoons, accusing them of using threats against him and his family to recover the money. \nBest known for creating the luxury One Hyde Park apartment complex in Knightsbridge, central London, the Candys fiercely denied the “disgusting allegations” made against them during a high-profile courtroom battle earlier this year. \nMr Holyoake was Nick Candy’s long-time friend from university until things turned sour over the £12m loan borrowed from Christian Candy’s company CPC in October 2011. \nThe court heard the money was to help him buy Grosvenor Gardens House in London’s Belgravia to convert into a luxury property for a substantial profit. Mr Holyoake gave evidence that he eventually paid back more than £37 million on the two-year loan and had to sell up at a loss of £100 million in potential profits after incurring millions of pounds in legal fees and other costs. \nHe claimed he was forced to hand over the money after a campaign of intimidation, including threats against his then pregnant wife Emma, which put “the fear of God” into him. \nIn the witness box Nick Candy, who is married to actress Holly Valance, described Mr Holyoake as a “fraudster and pathological liar”, and said: “I regret the day I ever met the man.” \nAt the close of the lengthy civil trial, the lawyer representing Mr Holyoake accused the brothers of being “dishonest” witnesses. \nRoger Stewart QC argued that the businessman’s action “should succeed”, and he was entitled to damages. \nTim Lord QC, for the Candys, described Mr Holyoake as a dishonest witness, and said he had “made the most wide-ranging and scandalous allegations of fraud, blackmail, conspiracy and threat of physical violence without any basis at all”. Brothers Nick (left) and Christian Candy, as Mark Holyoake is due to find out the results of his multimillion-pound High Court action against the property tycoons. 8.56 KEY EVENT Toys R Us latest - last-gasp rescue effort made in bid to halt collapse \nToys R Us UK has made concessions over its pension deficit in an attempt to push through a deal that would save the embattled retailer from collapse, according to reports . \nThe firm has tabled a fresh proposal to eliminate the pension shortfall during a meeting with the Pension Protection Fund (PPF), it has been reported. \nThe reported deal would shift its deficit recovery plan to 10 years from 15 years and offer a larger payment than the £1.6m planned for its pension scheme in January and March. \nAround 3,200 jobs at Toys R Us currently hang in the balance because the PPF refuses to back the retailer’s rescue plans unless it agrees to pay £9m upfront into its pension fund. \nThe PPF is demanding that Toys R Us makes the payment to secure three years’ worth of funding upfront for its defined salary staff pension scheme, which has a shortfall of between £25m and £30m. \nBut it is believed Toys R Us does not have enough cash to meet the PPF demands. \nThe PPF’s proxy vote intentions mean the planned company voluntary agreement (CVA) may not go ahead, as Toys R Us needs the backing of 75% of creditors, including landlords. Toys R Us shop (Image: PA) 8.50 Coreena Ford Retailers hoping for a £1.6bn boost on 'Super Saturday' \nRetailers are hoping for a big surge in spending on Saturday as the recent run of cold weather forces hordes of last-minute shoppers out for Christmas gifts and groceries. \nSome 17.4 million shoppers are expected to spend £1.6bn on last-minute festive purchases on “Super Saturday”, according to predictions from Voucher Codes and the Centre for Retail Research. \nDecember 22 is the first time in 11 years that the last full shopping day before Christmas has landed on a Saturday, and coincides with many workers receiving their pay slips the day before. \nLast year, the same date fell on ‘Frenzied Friday’ when 15.6 million shoppers splurged £1.1bn on the high street and online. \nAlmost half of Britons (43%) plan to leave their Christmas gift shopping to the last minute, a separate survey by VoucherCodes and Opinium found. Who's embarking on a Christmas shopping frenzy on Super Saturday? (Image: PA) 8.45 KEY EVENT ...but Nissan's Sunderland plant has marked a record year \nNissan’s Sunderland plant is celebrating a record-breaking year after generating £6.4bn in turnover and making over half a million cars. \nThe huge growth, which was up 22% on 2016’s £5.2bn revenues, was fuelled by Nissan upping the number of cars it manufactured to 519,000 over the year. \nHigh demand for the company’s Qashqai model was the main reason for the increased output, with the Sunderland site producing 324,000 of the cars compared with 296,000 in 2016. \nIn the firm’s accounts for the year ending March 31, company secretary Steven Tiffin said: “Nissan Sunderland Plant celebrated the 30th year of manufacturing in Sunderland during FY2016, with production volumes that cemented Nissan’s position as the largest British single site car plants in history. \n“This year not only resulted in a record production year but saw production of the 50,000th Leaf in the UK. This is the first time a European carmaker has built 50,000 electric vehicles; further confirmation of Nissan’s innovation and leadership in electric vehicle technology.” 8.39 Coreena Ford UK car production falls.... \nThe number of cars built in the UK fell in November compared to a year ago amid a continuing reduction in production for the home market, new figures show. \nJust under 161,500 cars left UK factories, down by 4.6% on the same month in 2016 after a huge 28% drop in domestic demand, the biggest decline of the year. \nExports rose by 1.3%, reported the Society of Motor Manufacturers and Traders (SMMT), which revealed that almost four out of five of the 1.5 million cars built this year have gone to one of 160 global markets. \nMike Hawes, SMMT Chief Executive, said: “Brexit uncertainty, coupled with confusion over diesel taxation and air quality plans, continues to", "external_links": [], "published": "2017-12-21T10:05:00.000+02:00", "crawled": "2017-12-21T11:05:19.002+02:00", "highlightTitle": ""}