{"organizations": [], "uuid": "b3915c0b12070e0fabf69a132e16bbc9df9de064", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14034142.ece/ALTERNATES/s1200/Music-man-Jim-Mawdsley.jpg", "site_section": "http://www.chroniclelive.co.uk/whats-on/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/whats-on/music-nightlife-news/celebrating-30-years-newcastles-music-14034097", "country": "GB", "domain_rank": 21960, "title": "Celebrating 30 years of Newcastle's music man - the face behind Shindig and Evolution", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-13T17:55:00.000+02:00", "replies_count": 0, "uuid": "b3915c0b12070e0fabf69a132e16bbc9df9de064"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/whats-on/music-nightlife-news/celebrating-30-years-newcastles-music-14034097", "ord_in_thread": 0, "title": "Celebrating 30 years of Newcastle's music man - the face behind Shindig and Evolution", "locations": [], "entities": {"persons": [{"name": "jim mawdsley", "sentiment": "negative"}, {"name": "dave stone", "sentiment": "none"}, {"name": "steve davis", "sentiment": "none"}, {"name": "steve forster", "sentiment": "none"}, {"name": "calvin harris", "sentiment": "none"}, {"name": "shaun", "sentiment": "none"}, {"name": "rob cameron", "sentiment": "none"}, {"name": "lee melrose", "sentiment": "none"}, {"name": "scooby", "sentiment": "none"}, {"name": "mike hesketh", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}, {"name": "joey ramone", "sentiment": "none"}, {"name": "adam collerton", "sentiment": "none"}, {"name": "scott bradford", "sentiment": "none"}, {"name": "mel", "sentiment": "none"}, {"name": "bez", "sentiment": "none"}, {"name": "shaun ryder", "sentiment": "none"}, {"name": "aaron mellor", "sentiment": "none"}, {"name": "jake houlsby", "sentiment": "none"}, {"name": "sue wilkinson", "sentiment": "none"}, {"name": "jim mawsdley", "sentiment": "none"}, {"name": "graham anderson", "sentiment": "none"}, {"name": "hucknall", "sentiment": "none"}, {"name": "ellie goulding", "sentiment": "none"}], "locations": [{"name": "liverpool", "sentiment": "none"}, {"name": "baltic square", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east tourist", "sentiment": "none"}, {"name": "times square", "sentiment": "none"}, {"name": "newcastle poly", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "city hall", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "riverside", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "liverpool fc", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "radio one", "sentiment": "none"}, {"name": "rvi", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}, {"name": "city council", "sentiment": "none"}, {"name": "bbc radio one love parade", "sentiment": "none"}, {"name": "creative digital sector", "sentiment": "none"}, {"name": "muzik magazine", "sentiment": "none"}, {"name": "newcastle polytechnic", "sentiment": "none"}, {"name": "foundation", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}, {"name": "leps", "sentiment": "none"}, {"name": "outside of generator", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "nme", "sentiment": "none"}, {"name": "northern lights", "sentiment": "none"}, {"name": "student union", "sentiment": "none"}, {"name": "cancel play", "sentiment": "none"}, {"name": "academy group", "sentiment": "none"}, {"name": "ramones", "sentiment": "none"}, {"name": "digital union", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Music man Jim Mawdsley (Image: Publicity Picture) Share Get what's on updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nJim Mawdsley promoted his first gig in Newcastle way back in October 1987. \nAnd, since hosting The Ramones at Newcastle Polytechnic as a 21-year-old, he has gone onto to promote thousands of shows in the North East and established some of the region’s pioneering live music gatherings including the legendary club night Shindig and the region’s largest ever music festival, Evolution . \nNowadays, in his role as CEO of Generator – the UK’s only national music development agency – Jim continues to support and nurture the artists of tomorrow and has helped hundreds of the region’s music businesses perform on a global scale. \nToday we take a look at some of his finest achievements, career lows and why the Liverpool born Jim can never leave the region he is now proud to call home. \n* Tell me about your memories of your first official show that you promoted featuring The Ramones. \nI was running the stage crew at Newcastle Poly in the mid-80s and doing work like standing on doors at other new venues at the time like Riverside. As I was a student, I was able to stand for election as the Entertainments officer at the Student Union. It was already earning a reputation as a live music venue on the circuit and a lot of the people I worked with reckoned I could take the step up and be a promoter which effectively is what the job entailed. I threw my hat into the ring and the rest as they say…. I had great help from Steve Forster who had held the post the previous two years and he gave me great guidance. No wonder he went on to grow the Academy Group and open venues all over the country. The Ramones \nI’d always wanted to promote, an ambition that used to draw laughs from my mates until they twigged that I could get them free gig tickets to impress their girlfriends with and I wanted to use the two-year stint as an apprenticeship, really find my feet and aim as high as possible. So I went about booking high profile acts. The first real gig and first career milestone came about when I put The Ramones on at the Poly on the 16th October 1987, I was 21 at the time, finding my feet and I’m putting on one of the most revered bands of the era on in Newcastle. \nIt’s funny as I don’t remember a lot about the actual gig but I walked through the bar in the afternoon before sound check and Joey Ramone was playing Space Invaders. He asked his tour manager for 10 pence to play but he didn’t have change so I said I’d pay if I could play with him...he probably won, I’ve always been pretty useless at computer games. Read More Huge new music festival set to take over Newcastle Quayside next year \n* It would be great to learn a little more about your background at that time and why / how you became a promoter. \nI’d got into the band scene in Liverpool mainly through the crowd that I would go with to watch Liverpool FC play. It was all part of the same culture but I’d always been a massive music fan and had been going to gigs since I was 11. I always wanted to get into promoting, following the realisation that I wasn’t a very good singer and thought behind the scenes is where I need to be. You could see from reading NME at the time that Newcastle had a growing live scene and appetite for live music so I thought I might get a chance if I go and study there. I originally came to study Government and Public Policy but I pretty much ended up studying live music promotion. Generator CEO Jim Mawdsley \n* Since that first show, in your estimation, how many shows have you gone on to promote and if you had to estimate how many thousands of people have attended? \nWow, I couldn’t put a figure on that but throughout my career, I have done weekly club nights (Shindig for 12 years), a few arena shows and of course Evolution, which peaked at 30,000 people in 2010. I honestly reckon I’ve promoted a couple of thousand shows which have no doubt entertained getting on for a million-plus people. It’s amazing when you think about it. \n* Can you talk me through some of your promotional career highlights, your memories of them, when they happened and how they make you feel looking back? \nApparently, I was the first Entertainment officer to make money. It wasn’t just the live shows we did but the student club nights we put on that were packed every week. I was very proud of that at the time. Shindig night at Foundation, 7th December 2000. (Image: NCJ Archive) \nWith the Shindig club event, it was amazing to take that from a Thursday night event predominantly student crowd and alongside Scott Bradford, Lee Melrose (Scooby) and Rob Cameron to one of the leading club nights in the UK. It was with Shindig that I did my first outdoor event in 2001. We were looking to do something different, something special and Baltic Square had just been completed in Gateshead. The Baltic wasn’t even open and I persuaded the council to let us put a dance event on for 3,000 people. The thrill of it selling out and the buzz around the event was unbelievable. The event itself was great but everyone turned up as if they were going to a club and to be honest, it got a bit cold. Shindig on Baltic Square (Image: Publicity Picture) \nWith Shindig we won the Underground Club of The Year at the Muzik Magazine awards in the same year (2001). At the time it was like the Oscars of Dance music and this was the really cool accolade of all the prizes. I got so drunk I broke the award! \nOne of the most amazing things we did with Shindig was when we were invited to co-present a show on Radio One on a Friday night. We were a bit naughty because we sneaked a lot of drink into the studio and got a tad tiddly when doing a live show. How we didn’t swear and get kicked off was beyond me. \nI went on to found Evolution with Adam Collerton, Graham Anderson, and Sue Wilkinson but it was the introduction of Dave Stone to the festival and his marketing and booking nouse that really took a free outdoor quayside event into a major festival. In the late noughties we narrowly missed out on best Metropolitan Festival at the UK Festival awards but we won best event at the North East Tourist awards in 2008. It was a proud moment to be recognised as producing the best event in the North East and it still remains the biggest regular music event the North East has seen. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nI’m immensely proud of the work we did to build Evolution into the event it was and looking back at the artists who played it and have gone on to global stardom including Calvin Harris, Ellie Goulding and I will never forget the monumental efforts we had to go to put Deadmau5 on the quayside. We had to build a stage twice the size of anything we had done before just to get his stage set cubes on stage but they were stunning and easily one of the biggest spectacles ever seen on the waterfront. Deadmau5 at Evolution (Image: Publicity Picture) \nSince Evolution ended in 2013, more recently I’ve been working with promoters such as Mike Hesketh (Northern Lights) and Steve Davis (Live from Times Square) in developing Times Square into an inner city outdoor venue that can be used every summer. This is something that I’ve wanted to do for years following Shindig doing the first inner-city dance event in Newcastle there in 2004. \n* What about some career lows or maybe some events that you tried to make happen and didn’t quite come off? \nThe big one has to be the 2001 BBC Radio One Love Parade. It’s a tale often forgotten now but after Leeds did it in 2000 I literally went to the event producers at Radio One armed with plans of the city and said ‘Why not do it in Newcastle?’. The whole event, parade, the after parties at the arena and every club in the city were sorted and then due to politics and wider interference the whole event was pulled. It would have put Newcastle on the global map as a city that was renowned for its dance music scene as this was to be broadcast globally. Instead, it meant that until the rise of Evolution it became the city that couldn’t deliver. \n*There’s that famous story of a certain Bez and Shaun Ryder from the legendary Manchester band arriving at the wrong venue when you had booked them. What can you tell me about that? \nI booked Happy Mondays very early in their career in the late 1980s (I also booked Stone Roses on the same call but that didn’t come off). When they turned up to do the gig the first thing the tour manager said was that Shaun and Bez weren’t with them and would be coming later on the train. He thought it was funny, I went ballistic. When they eventually got off the train they didn’t know where they were going, no mobile phones then. Happy Mondays dancer Bez (Image: Sean Hansford/Manchester Evening News) \nThey jumped into a cab and said they were playing in Newcastle that night but didn’t know where. The cab dropped them off at the City Hall and they ran down to the dressing rooms, burst through the door and Shaun shouts, ‘What you doin’ ‘ere Hucknall?’. Simply Red were playing there that night. \nLater on, I’m in the corridor outside the dressing room and this lad was jerking around outside. I asked him, ‘what you doin’ mate?’ and Bez replies, ‘Warming Up!’ Totally off it. It was 1988, there were 200 people at that gig! \n* Are there any other outrageous or humorous stories you can tell me from your promotional career? \nWe had some pretty big after parties in hotel bars each week after Shindig for a number of years which lead to us getting barred from one hotel after the other. We used to bribe the night porter at one leading Newcastle hotel to serve us drink after they shut the bar. The hotel found out, he got sacked and we were out on the street again. One of the lads decided to get our own back by taking his boxer shorts off, climbing onto the roof and flying them from the flagpole. You could see them from Gateshead. \n* Tell me about your professional life outside of music promotion and how did this lead to the work you’ve done with Generator? \nI got involved with Generator after I’d worked on an event with them, the City Council and BBC Radio One ‘Radio One Sound City’ in 1998. It was in the days before One Big Weekend and Radio One would do a week of gigs, seminars, and workshops in one city a year. We finished it off with a big arena gig with Shindig as one of the partners. Generator CEO, Jim Mawdsley \nAt the time I was only doing Shindig and while it was doing really well it wasn’t filling my week. I’ve always worked on multiple projects and Generator had just got their first chunk of real funding and we were looking to assemble a team of part-time people to essentially help develop the music scene in the North East. This seemed like an interesting organisation to work with and it had a pretty blank canvas. \nOver the first few years, the programme centred around helping musicians and bands navigate the music industry and promote the region’s music to the London industry. \nOver the years we built more business acumen into both Generator and music businesses in the region. We learned so much in the transition to digital but didn’t realise this until businesses in other adjacent digital sectors started asking us for help and only then did we realise how much we knew that would apply to business growth outside of our music bubble. Read More Simple Minds and The Pretenders announce huge outdoor concert in the North East \n* Please summarise some of your career milestones and achievements with the organisation. \nThrough being the only music development agency in the UK that had a dual focus on talent and business we became the benchmark organisation in our field in the UK which lead to people tagging us as the leading music development agency in the country. \nWe’ve built a solid following for both The Gen and Tipping Point Music blogs and whenever we do showcase events at major music industry conferences we get an amazingly high calibre of artists wanting to play for us leading to lengthy queues outside the shows. \nI suppose the biggest compliment we’ve had is when someone remarked that bands don’t feel the need to move to London anymore because they can get all the support they need here and that is down to Generator. \nWe are now trying to do the same with the Creative Digital Sector, not that they ever want to move to London but that they feel that they can get all the support they need through Generator and the Digital Union that we operate for them. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n* What does your current day to day look like Jim and what are you currently up to in Generator / DU and music promo world? \nOne of the great things about working at Generator is that every day is different. We are currently building our capability and capacity to take some of the effective programmes out to a wider audience and talking to other Northern growth hubs and LEPS about the work we are doing and how we can take it to other regions. Digital Union is growing rapidly as businesses are seeing the amount of effect we are having and how we are genuinely working in the interests of growing the sector. On the music side, we recently secured a £100k sync licensing deal from Ford for Jake Houlsby which was a great result and we are working on a new series of music business master classes. Before we know it, Evolution Emerging will be here and we are starting to look at who will be playing and whether we can add more venues as it will be its 10th Anniversary. \nOutside of Generator, I’m working with SSD Promotions on concerts next year. \nAll in all busy, busy! Jim Mawsdley speaks at a Digital Union event (Image: handout from Digital Union) \n* You love this city and region, Jim, what are your personal and professional aspirations going forward and will you ever leave us? \nI don’t think I’ll ever leave Newcastle, it’s my home and my family’s home. All three of my kids were born in the RVI and Mel my gorgeous and very patient wife is from Gateshead. It’s bizarre to think I’ve been here for 33 years now and I certainly feel like part of the furniture. The city has been hugely kind to me and I still feel that I have much to give back. \nNext year, I’ll have been at Generator for 20 years and it has changed and evolved so much. I feel that we are only at the start of the next journey. There has been a lot of change for us recently, especially post Brexit but we are ready for the future and we’ve made some great additions to the team who I believe will help cement our reputation in the Creative Digital Sector UK wide in the same way we established ourselves in music. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n* Looking back, just how much has the live promotion scene changed and just how proud are you of your achievements? \nThe funny thing about the live music scene in terms of the process of putting a gig or club night on hasn’t changed that much. Clearly, the methods of how you promote the gig and sell the tickets has shifted immensely with digital transformation of social media and retail ticketing platforms but in terms of booking talent, arranging venues and production its still pretty much the same process. \nWhen I first moved to Newcastle it was getting better but there was no Riverside (the original one), no Arena, no Digital and certainly no outdoor gigs at all. Its changed massively and I think I’ve contributed to that. Believe me promoting shows is all about taking risks. Shindig has been around for 26 years and they are still pushing boundaries, Dave Stone and Rob Cameron along with Aaron Mellor pushed on the work begun by Shindig and made Digital into one of the top ten dance clubs in the world and we now have promoters like Steve Davis who have a deserved UK wide reputation and are taking risks by programming multiple shows in one-off locations that are costly to produce. \nI’m just very proud I’m still in the mix after 30 years Like us on Facebook", "external_links": [], "published": "2017-12-13T17:55:00.000+02:00", "crawled": "2017-12-13T18:46:21.026+02:00", "highlightTitle": ""}