{"organizations": [], "uuid": "27b4b84d55a6a4ae4ea165ea66edb20a8f73292e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14435339.ece/ALTERNATES/s1200/PNP_NEC_260215glasshouse_004JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/luxury-newcastle-champagne-bar-closes-14435297", "country": "GB", "domain_rank": 21960, "title": "Luxury Newcastle champagne bar closes its doors amid claims staff aren't being paid", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-20T15:04:00.000+02:00", "replies_count": 0, "uuid": "27b4b84d55a6a4ae4ea165ea66edb20a8f73292e"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/luxury-newcastle-champagne-bar-closes-14435297", "ord_in_thread": 0, "title": "Luxury Newcastle champagne bar closes its doors amid claims staff aren't being paid", "locations": [], "entities": {"persons": [{"name": "mark nigrelli", "sentiment": "none"}], "locations": [{"name": "cramlington", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "dean street", "sentiment": "none"}], "organizations": [{"name": "news luxury newcastle", "sentiment": "negative"}, {"name": "luxury newcastle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "glass house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Luxury Newcastle champagne bar closes its doors amid claims staff aren't being paid The Glass House owner Mark Nigrelli blames 'tough trading' conditions and comes after a Sunday protest outside its sister bar in Cramlington Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA luxury Newcastle champagne bar has closed its doors after the company behind it went into administration, we can reveal. \nFormer cruise singer Mark Nigrelli reportedly spent more than £250,000 on The Glass House on Newcastle’s Dean Street which opened three years ago. \nHowever it and its sister bar and restaurant in Cramlington , Northumberland , which opened just last summer in the Manor Walks shopping centre, have now closed. \nIt became apparent on Sunday the company could be in trouble when disgruntled staff working in Cramlington posted angry signs and held a “silent protest” outside the bar accusing the owner of failing to pay their wages. The Glass House Bar, on Dean Street, on its opening night (Image: Newcastle Journal) \nAccording to a chef at the Cramlington restaurant, staff who arrived for their shift on Sunday found the doors closed and locks changed without warning. \nHe said: “We waited six hours in a silent protest waiting for answers.” \nHe claimed staff were owed “at least two weeks wages” with some waiting for more. \nA part-time worker, who asked not to be named, said he had been working at the Glass House Cramlington for seven weeks, and had to “keep asking and asking” for pay. \nHe claims he’s still owed £90 for 22 hours work and doesn’t know how he will get it. \nHe added: “I came down on Sunday to find the place shut and no-one in, the manager and owners had just abandoned us. I was lucky enough to take all my belongings on the Saturday if not I wouldn’t have been able to get it, but others have lost stuff from it.” \nThe closure comes amid claims of pay issues from a number former staff members at the Cramlington branch. The Glass House at Manor Walks, Cramlington (Image: Newcastle Chronicle) \nSpeaking before the closure, one former employee told ChronicleLive she had worked for the company for just over a month, but was paid in cash for just over half the time she worked. \nShe said: “I received two pay slips the whole time I worked there - both times it was cash from the till.” \nAnother said there had been issues with being paid on time since she started, and that she had received around £120 for two months of work. \nShe said: “I drive to work and I’m having to beg to get £20 to fill up my car.” \nA third employee claimed staff were paid in cash out of the tills when there was money available. \nHe said: “There are a lot of people here who can’t afford to pay their bills - one of my colleagues is being evicted.” Read More Lanchester Group aiming for record year after 11% dip in turnover \nIn a post seen by ChronicleLive from a Facebook group used by Glass House Cramlington employees, a man who was reportedly the manager wrote in January: “I am going to pay everyone cash to catch up with the back log, if I could pay it now I would.” \nMr Nigrelli, who also used to run the Union Rooms pub, in Newcastle, told us his company had gone into administration. \nIn a statement he then emailed to us, he wrote: “As a small independent company there has [sic] been many factors as to why we decided to close our doors. \n“Amongst many other national companies in financial trouble we are small and do not have huge financial backing with the combination of rising Brexit costs pressures and tough trading with lower footfall and spenditure [sic], we have had bad weather recently which hasn’t helped the cause. Read More Meet the mum helping to cut the cost of prom by handing out £500 dresses - for FREE \n“Sustaining rent, service change and business rates all increasing along with staff costs and supplies has put a very difficult trading period in the leisure market at the moment. \n“We wish the new owners all the luck in the future and that the trade picks up for them to make it a huge success. We would like to thank all our staff for their hard work trying to help over come this difficult time and thank them for their words of support.” \nStaff members’ claims about missing pay were put to Mr Nigrelli, but he did not respond directly. Like us on Facebook", "external_links": [], "published": "2018-03-20T15:04:00.000+02:00", "crawled": "2018-03-20T18:57:44.011+02:00", "highlightTitle": ""}