{"organizations": [], "uuid": "6467ad5ec33b4f1110902a1bc3e92494691e0d23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1071178.ece/ALTERNATES/s1200/I161018_141317_858745oTextTRMRMMGLPICT000079811548o.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/ryanair-cheap-flights-to-end-1307984", "country": "GB", "domain_rank": 48128, "title": "'No more cheap holidays' warns Ryanair chief in Brexit tirade - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.325, "site_type": "news", "published": "2018-03-07T12:47:00.000+02:00", "replies_count": 0, "uuid": "6467ad5ec33b4f1110902a1bc3e92494691e0d23"}, "author": "Mikey Smith", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/ryanair-cheap-flights-to-end-1307984", "ord_in_thread": 0, "title": "'No more cheap holidays' warns Ryanair chief in Brexit tirade - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "o'leary", "sentiment": "none"}, {"name": "michael o'leary", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "melton mowbray", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "negative"}, {"name": "lufthansa", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'No more cheap holidays' warns Ryanair chief in Brexit tirade He fears expensive disruption to flights for the UK outside the European Union Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLeaving the European Union could end cheap holidays in the UK, the boss of a leading budget airline has warned. \nRyanair chief executive Michael O'Leary has threatened to ground planes if Brexit causes disruption and said that it could trigger a crisis for UK holidaymakers, reports The Mirror . \nSpeaking to an audience of other airline bosses, he said that people have to understand that they are \"no longer going to have cheap holidays\". \nAlso present at the event in Brussels were the bosses of EasyJet and German carrier Lufthansa . The latter, like Ryanair, operates out of East Midlands Airport. \nMr O'Leary said: \"I think it's in our interests - not for a long period of time - that the aircraft are grounded. Read More Melton Mowbray pork pies, Leicestershire cheese and Rutland beer under threat if US gets its way post-Brexit \n\"It's only when you get to that stage where you're going to persuade the average British voter that you were lied to. \n\"You were promised you could leave the EU and everything would stay the same. The reality is you can leave the EU, yes that's your choice, but everything will fundamentally change. (Image: Getty Images) \n\"When you begin to realise that you're no longer going to have cheap holidays in Portugal or Spain or Italy, you've got to drive to Scotland or get a ferry to Ireland as your only holiday options, maybe we'll begin to rethink the whole Brexit debate. \nThe single market for aviation, created in the 1990s, means there are no commercial restrictions for airlines flying within the EU. Read More \nMr O'Leary has repeatedly warned that airlines will be forced to cancel post-Brexit services from March 2019 if no agreement is reached in the Brexit negotiations by September, because schedules are planned about six months in advance. \nStorm looming over Atlantic could become The Pest From The West \nEasyJet chief executive Johan Lundgren, who was on stage alongside Mr O'Leary, interrupted him to say: \"If you start grounding your planes, I'm flying.\" Read More Forget the Beast From The East - the Pest From The West storm front is heading our way \nCarsten Spohr, the boss of German carrier Lufthansa, added: \"In theory, if we could use this industry to prove to the British how wrong the decision was, that might be a good thing.\" \nTransport Secretary Chris Grayling said in January that he is confident flights will not be grounded because \"it's in the interests of everyone\" to maintain the open market for aviation. Like us on Facebook ", "external_links": [], "published": "2018-03-07T12:47:00.000+02:00", "crawled": "2018-03-07T15:57:53.000+02:00", "highlightTitle": ""}