{"organizations": [], "uuid": "f9cc1f9d6c8b74962c5dc9b7a959853e1de6d4fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1280951.ece/ALTERNATES/s1200/Kitsons-Jonathan-Dickson-James-Cross-Corri-Pedrick.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/future-opportunities-benefit-whole-torbay-1280947", "country": "US", "title": "Future opportunities will benefit whole Torbay community - Kitsons - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.175, "site_type": "news", "published": "2018-03-01T18:20:00.000+02:00", "replies_count": 0, "uuid": "f9cc1f9d6c8b74962c5dc9b7a959853e1de6d4fb"}, "author": "Tina Crowson", "url": "https://www.devonlive.com/news/devon-news/future-opportunities-benefit-whole-torbay-1280947", "ord_in_thread": 0, "title": "Future opportunities will benefit whole Torbay community - Kitsons - Devon Live", "locations": [], "entities": {"persons": [{"name": "kitsons jonathan dickson", "sentiment": "none"}, {"name": "corri pedrick", "sentiment": "none"}, {"name": "william kitson", "sentiment": "none"}, {"name": "ernest hutchings", "sentiment": "none"}, {"name": "kitsons", "sentiment": "none"}, {"name": "kitsons hutchings", "sentiment": "none"}], "locations": [{"name": "vaughan parade", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "james cross", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "chambers and partners", "sentiment": "none"}, {"name": "invalid email  kitsons solicitors", "sentiment": "none"}, {"name": "hutchings & plum", "sentiment": "none"}, {"name": "edginswell business park", "sentiment": "none"}, {"name": "‘kitsons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "At Kitsons Jonathan Dickson, James Cross, Corri Pedrick Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nKITSONS Solicitors has come a long way since being established in 1826 at Vaughan Parade in Torquay by William Kitson who became known as the ‘maker of Torquay’. \nIn April 2001, Kitsons merged with the long established Torquay firm Hutchings & Plum founded by Ernest Hutchings, who first practised in Torquay, in 1899. \nThe merged firms practised as Kitsons Hutchings until April 2010 when, to coincide with the relocation of the firm’s head office to Edginswell Business Park, the firm rebranded to become ‘Kitsons’ with the strap line ‘The Way Solicitors Should Be’. \nKitsons today has 118 staff members spread across its offices in Torquay, Exeter and Plymouth. \nWe are recognised in the Legal 500 and Chambers and Partners legal publications as one of the South West’s leading law firms providing outstanding legal advice and support to both commercial and private clients. Kitsons (Image: Kitsons) \nWHY WE SUPPORT NOW IS THE TIME: \nKitsons’ roots are firmly and deeply in Torbay. Many of our solicitors and staff have given their time over the years to the chamber of commerce, the Business Forum, South Devon College, to schools within the Bay, and to other committees and organisations making Torbay the place it is and the place it wants to become. \nWe as a firm are supporting ‘Now is the Time’ because we believe in Torbay. We believe that we have future opportunities which will benefit the whole community including business. \nWith the possible headwinds of Brexit, what better time to support a project within the Bay that will benefit us all? We have excellent education centres, businesses and a community that cares. \nNow certainly is the time. Kitsons Marjorie Creek Solicitor and Lynn Smith, Partner \nNOTABLE SUCCESSES: \nKitsons’ success is that we have grown strategically and in personnel in the face of the changes and challenges to the legal market. We embrace investing in our people. \nIn Torbay, tourism is being transformed, education has been modernised, and we have hospital and medical services to be proud of. Our strategic view is to grow through being dynamic and progressive, trusted and respected, and being a great place to work. \nTorbay can be exactly the same. \nWHAT WE HOPE THE CAMPAIGN WILL ACHIEVE: \nThe Now is the Time campaign, if it creates the momentum that we would hope, and we can see no reason why it shouldn’t, can assist in supporting the delivery of university status for South Devon College and obtaining Coastal Enterprise Zone status for the Bay. \nOne of the results will be the generation of growth and jobs. \nWhat is not to support? Now Is The Time the sponsors Like us on Facebook", "external_links": [], "published": "2018-03-01T18:20:00.000+02:00", "crawled": "2018-03-01T19:00:30.029+02:00", "highlightTitle": ""}