{"organizations": [], "uuid": "e7a60d29b237b327f1823cf802ef0b5a2f0d26b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14376073.ece/ALTERNATES/s1200/Geneva-Auto-Show-Press-Days-2017.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-major-threat-uk-automotive-14375766", "country": "GB", "domain_rank": 21960, "title": "Brexit is major threat to UK automotive industry, Vauxhall boss says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-06T19:32:00.000+02:00", "replies_count": 0, "uuid": "e7a60d29b237b327f1823cf802ef0b5a2f0d26b4"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-major-threat-uk-automotive-14375766", "ord_in_thread": 0, "title": "Brexit is major threat to UK automotive industry, Vauxhall boss says", "locations": [], "entities": {"persons": [{"name": "carlos tavares", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ellesmere port", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "vauxhall", "sentiment": "negative"}, {"name": "citroen", "sentiment": "none"}, {"name": "peugeot", "sentiment": "none"}, {"name": "psa", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit is major threat to UK automotive industry, Vauxhall boss says Carlos Tavares says firms will not make big investment decisions while there is uncertainty over Brexit Share PSA CEO Carlos Tavares (Image: Getty Images Europe) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe head of the company that owns car maker Vauxhall has warned that Brexit poses a major threat to the future of its Ellesmere Port factory - and the whole of the UK automotive industry. \nCarlos Tavares - chief executive of Vauxhall, Citroen and Peugeot owner PSA - said lack of clarity over the UK’s exit from the EU was affecting future investment decisions. \nHis words come less than a week after a hard-hitting report by an influential committee of MPs warned of potentially huge job losses in the automotive sector if the Brexit negotiations did not provide protection for the industry. \nThe automotive sector is a particularly important employer in the North East, with around 7,000 people working at the Nissan plant i n Sunderland, thousands more in the supply chain and hopes to create even more jobs with an automotive park being planned at Sunderland and South Tyneside. \nSpeaking at the Geneva Motor Show, Mr Tavares said: “Nobody is going to make huge investments without knowing what is going to be the final competitiveness of the Brexit outcome.” Vauxhall Astra production line (Image: PA) \nHe added: “We can’t make investment decisions on business plans that would go from black to red if the tariff conditions were to change. So as long as we don’t have this clarity it is going to be very difficult to make huge investments and therefore it is better to come to a conclusion as fast as we can.” \nPSA bought Vauxhall, which employs around 4,500 people in the UK, last year. It announced 400 jobs cuts at Ellesmere Port in October and another 250 earlier this year. Read More Japanese firms could leave the North East after Brexit, top ambassador warns \nLast week the cross-party House of Commons Business Committee said that keeping access to the EU single market is far more important to car manufacturers in the UK than signing new trade deals with other countries. \nThe committee also warned that the introduction of “non-tariff” barriers, which would mean delays and bureaucracy as car parts and vehicles are transported across borders, would be particularly damaging for the car industry. \nLen McCluskey, from the Unite union, said: “Of course, the Government position on Brexit is creating uncertainty for major manufacturing companies but this should not be used by Mr Tavares to raise the fear of closure of Ellesmere Port. \n“The UK market is vitally important to Peugeot and if he wants to protect that market share he should openly commit to new models in both Ellesmere Port and Luton.” Like us on Facebook", "external_links": [], "published": "2018-03-06T19:32:00.000+02:00", "crawled": "2018-03-07T00:35:12.000+02:00", "highlightTitle": ""}