{"organizations": [], "uuid": "9c7764d82335da4974c2d10be66f3c1302173be4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14442920.ece/ALTERNATES/s1200/ruemain.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/de-la-rue-gateshead-shock-14442919", "country": "GB", "domain_rank": 21960, "title": "Gateshead jobs at risk as blue passport to be printed abroad", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-22T11:11:00.000+02:00", "replies_count": 0, "uuid": "9c7764d82335da4974c2d10be66f3c1302173be4"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/de-la-rue-gateshead-shock-14442919", "ord_in_thread": 0, "title": "Gateshead jobs at risk as blue passport to be printed abroad", "locations": [], "entities": {"persons": [{"name": "martin sutherland", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}, {"name": "brexiteers", "sentiment": "none"}, {"name": "sutherland", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "team valley share de la rue on team valley", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "gemalto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Gateshead jobs at risk as blue passport to be printed abroad Prime Minister is challenged to explain decision to workers at the De La Rue plant on the Team Valley Share De La Rue on Team Valley in Gateshead (main pic) and how the new British passport will look (inset) (Image: Google/PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May has been urged to explain to workers on Tyneside why the new post-Brexit blue passport will be made in France. \nThe contract to manufacture the document, which Brexiteers see as a symbol of the UK’s regained independence, is set to be awarded to Franco-Dutch firm Gemalto rather than De La Rue’s Gateshead plant . \nDe La Rue boss Martin Sutherland said it was “disappointing and surprising” that “this icon of British identity is going to be manufactured in France”. \nThe move has been condemned by Brexiteers and Mr Sutherland called on the Prime Minister or Home Secretary Amber Rudd to explain their decision to his workers. How a British passport will look after Brexit (Image: PA) \nMr Sutherland said the Home Office had confirmed the move to him, although ministers denied the process was complete. \nMr Sutherland said: “I think we have heard over the last few weeks and months ministers more than happy to come on the media and talk about the blue passports and the fact that the blue passport is an icon of British identity. \n“Now this icon of British identity is going to be manufactured in France.” \nDe La Rue is the largest commercial passport manufacturer in the world and supplies passports to more than 40 countries around the world. It has been producing British passports from its Gateshead factory for the last 10 years and last year produced its 40 millionth document. \nAround 600 people work at the Gateshead plant, around 100 of them in the passport division. Mr Sutherland refused to say whether losing the contract would put jobs at risk but did say the company would have to find new work. Prime Minister Theresa May (Image: PA) \nDe La Rue is now looking to appeal the tender decision and has invited Prime Minister Theresa May to the factory to explain why the Government decided to hand the contract to a European firm in the run up to Brexit. \nMr Sutherland said: “We have a very skilled, proud workforce in Gateshead and I am going to have face those workers, look at them in the whites of the eyes and try to explain to them why the British Government thinks it’s a sensible decision to buy French passports not British Passports. \n“I would like to invite Theresa May or Amber Rudd to come to my factory and explain to my dedicated workforce why they think this is a sensible decision to offshore the manufacture of a British icon.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIt has been reported that Gemalto undercut other bids by around £50m. \nTory MP Sir Bill Cash, chairman of the Commons European Scrutiny Committee, branded the decision “completely wrong and unnecessary”. \nThe tender to produce the passport was put out across the EU under single market rules. \nSpeaking on the BBC’s Today programme, Culture Secretary Matt Hancock said the procurement process had not been finalised. Read More Take a look inside the Gateshead factory where 50 million banknotes are produced each week \n“As I understand it, this procurement is not fully complete,” he told Today. \nA Home Office spokeswoman said: “We are running a fair and open competition to ensure that the new contract delivers a high quality and secure product and offers the best value for money for customers. Read More North East news LIVE: Van passenger dies after A69 crash at Throckley \n“All passports will continue to be personalised with the holder’s details in the United Kingdom, meaning that no personal data will leave the UK. \n“We do not require passports to be manufactured in the UK. A proportion of blank passport books are currently manufactured overseas, and there are no security or operational reasons why this would not continue.” \nThe news has been described as \"devastating\" by Blaydon MP Liz Twist, who is demanding a meeting with Home Secretary Amber Rudd. \nShe said: \"This is devastating news for my constituents who work at De La Rue and a massive blow to the reputation of British business. At such a defining moment in our history, this sends out completely the wrong message and will reduce our standing in Europe and the world. \n\"At a time of heightened international security concerns, it is downright ludicrous to think that our new passports will be produced abroad. After months of talk about the return to blue British passports, the irony of this decision isn’t lost on me or my constituents. \n\"I have been in communication with De La Rue overnight and will be holding meetings with them in the coming days. I urge the Home Secretary to meet with me and to review this terrible decision as a matter of urgency.” \nUnite national officer Louisa Bull said: \"Theresa May and Amber Rudd need to explain to De La Rue workers why 'taking back control' means their jobs could be put at risk while the production of Britain's new iconic passport is shipped overseas to France. \n\"It wouldn't happen in France because of national security and it shouldn't happen in the UK. De La Rue is the UK's leading security printer making banknotes as well as passports sustaining thousands of decent jobs in the UK. \n\"Ministers need to reverse this decision and start supporting British business and UK workers through public procurement and an industrial strategy which is more than just soundbites.\" Like us on Facebook", "external_links": [], "published": "2018-03-22T11:11:00.000+02:00", "crawled": "2018-03-22T13:07:26.027+02:00", "highlightTitle": ""}