{"organizations": [], "uuid": "040bcbba5b6dd568760326b8bc6259b761e44852", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12073268.ece/ALTERNATES/s1200/JS61762182.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14352400", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Carpetright in talks with lenders amid warning over annual loss", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-01T10:30:00.000+02:00", "replies_count": 0, "uuid": "040bcbba5b6dd568760326b8bc6259b761e44852"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14352400", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Carpetright in talks with lenders amid warning over annual loss", "locations": [], "entities": {"persons": [{"name": "andrew haigh", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}], "organizations": [{"name": "carpetright", "sentiment": "negative"}, {"name": "jonathon manning newcastle building society", "sentiment": "negative"}, {"name": "newcastle building society", "sentiment": "none"}, {"name": "newcastle’s cobalt business park", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Newcastle Building Society boosts profits by £5m as it boosts North East lending \nThe acquisition of Newcastle Building Society’s head office and a reduction in costs allowed the organisation to add almost £5m to its bottom line last year. \nThe building society - which operates 27 branches across the North East and Cumbria - saw its profit after tax grow from £6.1m to £10.9m for the year ending December 31 2017. \nOperating profit also increased marginally from £11.9m to £12.1m, largely due to £6.2m reduction in its interest charges. \nA large proportion of the increased profits came after the company bought its offices at Newcastle’s Cobalt Business Park, which it has occupied for the last nine years. Following the acquisition the company was repaid £2.2m, which it was owed due to overpayments. \nChief executive Andrew Haigh said: \nIf you look at the numbers there’s a few things going on there. We have seen a slight increase in operating profit, which is always good to see. We have seen a reduction in charges, and a single one-off gain that we had for the acquisition of our building in Cobalt. \nThere was a couple of exceptional items in there, but overall I think it has been very good. \nThe building we bought in Cobalt is a building we have occupied for a long time, so it really secured our commitment there. By moving from being a tenant to being the owner we were able to release the provision we had for paying future rent. \nNewcastle Building Society has also continued its focus on the residential mortgage market, which led to its gross mortgage lending increasing by 8% to £535m. \nMr Haigh said: \nWe had over 1,000 first time buyers coming to us for a mortgage, and 25% of them came from this region. \nWe see our role as helping people, encouraging them to save, and helping them to own their own home. Andrew Haigh, chief executive of Newcastle Building Society (Image: Unknown) 9:20 Car job losses threatened by no-deal Brexit, MPs warn \nA no-deal Brexit threatens hundreds of thousands of job losses in the UK car industry and hundreds of millions of pounds in inward investment, the Government is being warned.MPs said if volume car manufacturing had a realistic chance of survival post-Brexit, it would be essential to keep a close relationship with the existing EU regulatory and trading framework. \nIf true, it would mean that a no-deal Brexit would have a major impact on the North East economy, which is fuelled by the automotive sector due to it housing the Nissan car plant in Sunderland.The Business Select Committee called on ministers to place a high premium on securing frictionless trade for the automotive sector.Its report said it was unrealistic to expect an expansion of trade overseas to outweigh the loss of business to Europe from a hard Brexit.Retaining good access to the single market is more important than having the freedom to make new trade deals with other countries, said the report.Rachel Reeves, who chairs the committee, said: \nThe car industry is one of the UK’s great manufacturing successes. Innovative and efficient car plants across the country provide thousands of jobs and the automotive sector is a major contributor to our economic growth. \nThere is no credible argument to suggest there are advantages to be gained from Brexit for the UK car industry. \nRegulatory consistency and friction-free trade benefits car companies, consumers and car-workers. \nThe Prime Minister now needs to ensure common-sense pragmatism prevails and spell out the Government’s intention to seek continued regulatory and trading alignment with the EU in the automotive sector. \nThe report said: \nLeaving the EU without a deal would undoubtedly be hugely damaging to the UK automotive sector, more so than to other European countries. \nIt would involve the introduction of a 10% tariff on cars and, because of the competitive nature of the business, the shift of volume manufacturing to countries remaining in the EU. \nThere are no advantages to be gained from Brexit for the automotive industry for the foreseeable future. The negotiations are an exercise in damage limitation. \nThe Government should acknowledge this and be pragmatic in seeking for the sector as close as possible a relationship with the existing EU regulatory and trading framework to provide volume car making - one of our great manufacturing success stories - a hopeful future. \nA Business Department spokesman said: \nThe Government is seeking a partnership that delivers the maximum possible benefits for both the UK and EU economies, and maintains the strength of our world-leading automotive sector. \nFrom production to distribution, numerous companies in this sector around the UK and Europe are highly dependent on each other which is why we must ensure cross-border trade is as free and frictionless as possible post-Brexit. Workers at Nissan's plant in Sunderland (Image: PA) 9:15 Madame Tussauds owner suffers after London terror attacks \nMerlin Entertainments, the owner of Madame Tussauds and Alton Towers, has laid bare the impact of last summer’s terror attacks in London.In a trading update covering 2017, the group said it saw a 17% plunge in visitors to its London attractions - which include the London Eye and the London Dungeons - after attacks took place during its critical trading period.This led to a 5% fall in operating profit at Merlin’s Midway division last year to £152m, with like-for-like revenue dipping 1.2%.The group said: \nAfter a strong start to the year, Midway like-for-like revenue growth slowed following the spate of terror attacks in the UK which particularly impacted trading in London. \nThe attacks led to a significant and immediate decline in domestic visitation, with international visitation falling from the summer onwards. \nThis resulted in an estimated 17% drop in the London visitor attraction market over the key trading period. \nMerlin confirmed that it will now shift investment from Midway, which includes Madame Tussauds and Sea Life.It will redirect £100m of investment away from its attractions between 2018 and 2021, putting the cash into developing new hotels instead.On a group level, the company saw profits rise 4.8% to £271m in 2017, helped by a record 66 million visits to its attractions around the world.Revenue grew 11.6% to £1.59bn, like-for-like sales rose 0.7% and comparable sales at Merlin’s Legoland parks grew 4.7%.Shares were up 8% in morning trading to 368p.Boss Nick Varney said: \nA year that started well with positive momentum in almost every part of the group was ultimately defined by the unprecedented spate of terror attacks in the UK and poor to extreme weather throughout the summer season in Europe. \nDespite this, thanks to the efforts of our extraordinary team, we have reported overall growth in revenue, profit and cash flow, welcoming 66 million visitors - our highest on record. \nMerlin continues to evolve and, with attractive market fundamentals and the right strategy in place, we remain highly confident in the long-term prospects for the business. TV royalty Ant and Dec have been immortalised in wax at Madame Tussauds Blackpool as the country's most famous pair unveiled their brand new wax figures 9:10 KEY EVENT 500 jobs to created as Iceland power scheme targets North East \nAround 500 jobs are to be created in the North East with a company that is aiming to create a massive underwater cable to carry electricity from Iceland to the UK. \nAtlantic SuperConnection wants to lay a 930-mile cable under the sea to make electricity generated from Iceland’s clean hydroelectric and geothermal energy sources to be used by homes and businesses in the UK. \nIt is hoped the £3bn scheme could provide 1.2GW of power for the UK - enough to heat thousands of homes around the country. \nThe company has now appointed North East LEP chair Andrew Hodgson as its chief executive and is looking for a site in the region where it will create a cable manufacturing facility that will employ 500 people and put around £200m into the North East economy. \nMr Hodgson, who stepped down from his job leading the award-winning Wallsend subsea firm SMD at the end of last year, said: \nDelivery of the SuperConnection and cable factory represents a unique opportunity to create a high-tech manufacturing hub in the North East and with it the delivery of hundreds of high value jobs for the region. \nIt is a privilege to be leading a team of such high calibre individuals for an organisation that is ready in terms of both the technology know-how and the financing to see this nationally significant project delivered by the mid-2020s. \nThe link to Iceland would not be the first such scheme in the North East, with the North Sea Link being built between Norway and Blyth, Northumberland, to bring electricity from Scandinavia to the UK. \nThe British and Icelandic governments agreed a memorandum of understanding in 2012 to explore the possibility of an electricity interconnection, with Iceland’s unique geography - with volcanoes and hot springs providing natural sources of energy - meaning the country has more electricity than it needs for its 340,000 population. Andrew Hodgson (Image: Newcastle Chronicle) 9:05 KEY EVENT Trinity Mirror completes acquisition of Express owner \nPublishing giant Trinity Mirror has completed its acquisition of Northern & Shell, which owns the Daily Express, the Star, and OK magazine. \nTrinity Mirror, which owns The Chronicle and The Journal newspapers, bought Northern & Shell in a deal valued at £121.7m. \nThe deal will also see the company purchase 50% equity interesting in Independent Star Limited - which runs the Irish Daily Star - for £4.5m, and 100% of International Distribution 2018 Ltd for £500,000. These acquisitions are subject to clearance by the competition authorities in the Republic of Ireland. \nWhen the deal was originally announced Trinity Mirror chief executive Simon Fox said: \nBy bringing our two organisations together we can be stronger, so by pooling our editorial teams instead of duplicating and sending the same reporters to the same football matches we can be much more efficient and cover more matches, more breadth of coverage. \nSo it’s good for readers, it’s good for advertisers, it’s good for our shareholders, good for our pension funds. \nIf you are employed by a financially stronger organisation that’s good for everyone. \nThere will over time be job cuts because we are going to remove duplication, mainly in back office functions. We are bringing two very similar businesses together and when you do that there’s a certain amount of duplication so there will be some changes. We will be talking to those teams in due course but broadly this is very good. Simon Fox, Chief Executive of Trinity Mirror (Image: PA) 9:00 KEY EVENT Streaming giant Spotify pursues public share listing \nMusic streaming pioneer Spotify is hoping to attract a new crowd of fans on Wall Street as its competition with Apple heats up.Spotify is pursuing an unusual initial public offering that will sell some of its existing stock instead of issuing more shares to raise money.The strategy will make it easier for Spotify’s existing stockholders to cash out of their investments while creating a potential new financial channel for the company.Spotify took its first steps toward the IPO in a confidential filing a few weeks ago, but the documents were not released until Wednesday.The numbers revealed Spotify’s music-streaming service boasts 71 million subscribers, nearly twice as many as Apple’s rival service.But Spotify is still not profitable. The Luxembourg-based company lost €1.2bn (£1.06bn) last year. Spotify Jonathon Manning Toys R Us and Maplin collapses raise questions for future of high street \nThe collapse of two major retail chains - both with a significant presence in the North East - has raised fresh questions about the future of the high street. \nToys R Us and electronics company Maplins both went into administration this morning, putting more than 5,000 jobs at risk. \nThe collapse of the two firms was followed by an announcement that restaurant chain Prezzo would be shutting a third of its 300 sites, marking a black day for the UK and the North East high street. \nRetail experts warned that more closures were likely to follow as high costs, the growth of online and a squeeze on consumer spending take their toll on shopping businesses. \nRichard Lim, chief executive of Retail Economics said: \nAll is not well on UK high streets. \nThe perfect storm of spiralling operating costs, softer consumer demand, and seismic structural changes has claimed another victim. \nPut simply, the retailer was too slow to embrace omnichannel, were burdened with too many stores and failed to deliver a retail ‘experience’ good enough to stand out from their competitors. \nRichard Hyman, who has analysed the retail sector for more than 30 years and predicted last year that 2018 would be “the year of retail distress”, said the latest developments came as “no surprise”. \nHe said: \nAs the pressure mounts, the weakest will fall. Brexit is an exacerbating factor but the principal cause is structural. We’ve got too many shops, the shops are too big, and there are too many websites. \nThere are too many mouths to feed and the consumer economy is in a very weak condition and has been for a very long time, and there is no evidence of that changing. \nEconomists are expecting some relief for high street shoppers as inflation eases and wage growth picks up pace, but political uncertainty is likely to mean that the retail sector remains under intense pressure. A Toys R Us store 8:50 Jonathon Manning Bovis profits hit by compensation payouts and takeover defence costs \nProfits at Bovis Homes tumbled last year after the house-builder was stung by a string of costs that included compensation payouts for poor- quality homes.The group posted a 26% fall in pre-tax profit to £114m in 2017 as it booked exceptional items totalling £10.3m.This took in £3.5m in customer care provision, £4m in restructuring costs and £2.8m advisory fees linked to defending itself from two aborted takeover attempts from rivals Galliford Try and Redrow.Bovis was last year dogged by complaints over unfinished homes with electrical and plumbing faults and has had to make provision for compensation payouts.However, the firm said that, since the debacle, it has presided over a “step change” in quality and service, with customer satisfaction levels now trending above 80%.Bovis completed 3,645 homes in 2017, 8% lower than the previous year, confirming a building slowdown as it focuses on quality.Revenue dropped 3% to £1bn, while the average selling price on completion increasing 7% to £272,400.Stripping out exceptional items, operating profit was down 19% to £128m.Boss Greg Fitzgerald said: \nI am very pleased with the level of operational progress the group has made during the year. \nWe have significantly improved our customer satisfaction through a series of initiatives and controlled period ends. \nBovis also shrugged off economic uncertainty and a weak housing market by pointing to a hefty rise in profit in 2018.The company said strong customer demand, attractive mortgage rates and government initiatives, in particular Help to Buy, are helping drive sales.Mr Fitzgerald said: \nThe group fundamentals are strong, and, with the business turning around, I am excited about future years. \nIn 2018, we will deliver a controlled increase in volume, continue to build upon our high level of customer service, drive profitability, and complete our balance sheet optimisation. Bovis Homes development (Image: PA) 8:45", "external_links": [], "published": "2018-03-01T10:30:00.000+02:00", "crawled": "2018-03-01T16:13:45.003+02:00", "highlightTitle": ""}