{"organizations": [], "uuid": "36662cde2115125afbc80a429b6a7eef2e6ceb65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14473495.ece/ALTERNATES/s1200/JS34404098.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/ringtons-tea-biscuits-delivered-your-14473210", "country": "GB", "domain_rank": 21960, "title": "Ringtons tea and biscuits delivered to your desk? A drop off service could be on its way", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-29T18:22:00.000+03:00", "replies_count": 0, "uuid": "36662cde2115125afbc80a429b6a7eef2e6ceb65"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/ringtons-tea-biscuits-delivered-your-14473210", "ord_in_thread": 0, "title": "Ringtons tea and biscuits delivered to your desk? A drop off service could be on its way", "locations": [], "entities": {"persons": [{"name": "ringtons", "sentiment": "none"}, {"name": "byker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ringtons tea and biscuits delivered to your desk? A drop off service could be on its way The 111-year-old Newcastle firm said it is adapting its traditional doorstep delivery service for a modern audience Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCity office workers could soon have Ringtons treats delivered to their desks following a trial run of a new drop-off service. \nThe Byker business, now in it’s 111th year, last year announced it was exploring options to bring in a new generation of customers. \nThe tea manufacturer’s doorstep delivery vans are a familiar sight across the North East and beyond, but it recognises that modern lifestyles might not suit existing delivery patterns, prompting the launch of a modern drop-off service in which customers can arrange for their goods to be left in a safe place if they aren’t in or delivered to their workplace. \nThe service has been trialled for the last two months in the Cramlington and nearby coastal area and Ringtons hopes to roll out the service, opening up the opportunity for thousands of office workers to sign up for the drop-off service. \nSarah Melling, marketing director, said: “We’ve got a unique, successful delivery service which is very convenient for its customers but there’s a huge proportion of people that it’s not convenient for because you have to be in when the Ringtons man comes, so we are trying to make that service more compatible for modern life. Left to right, Ringtons directors Simon, Nigel and Colin Smith \n“Drop off is a subscription service where you run your account online but it’s still the Ringtons man coming to your door - you just don’t have to be in. It can be dropped at home or at your workplace. With the rise of Amazon, Asos and food services, people are used to having things left until they get in from work. \n“Currently our sales people do drop off at some work addresses but you can imagine that takes up a lot of time, so this is a way of speeding that process up. \n“We’ve only been doing the trial for two months and we’ve got enough people to look at possibly increasing the trial area. \n“We’ve got to get the mechanics right. The current doorstep service has been the same more or less for 100 years so to modernise it, to make it work for people living and working in the city centre, we’ve got to get it right before we increase it.” \nThe announcement comes as Ringtons Ltd announces it financial results for the year ended June 30 2017, in which turnover rose 7% from £54.47m to £58.3m. An old-style Ringtons horse and cart, 1971 (Image: Newcastle Chronicle) \nAs forecast last year, Ringtons profits were 5% down at £4.2m, while retained profits after dividends and tax available for reinvestment continued at the same level of £2.5m. \nEmployee numbers were 520 compared to 521. \nResults next year are expected to decline a little further due to the business absorbing higher teas prices because of crop shortages last year, plus the decline in sterling. \nChairman Nigel Smith said the business remains in a strong position for solid performance in the years to come. \nHe said: “The financial year has been as expected. The tea markets throughout the last 12 months have been a little bit volatile but generally higher, partly to do with Brexit and the currency decline but also drought conditions in tea growing areas, particularly Kenya, so prices have been higher. \n“We tend to absorb margin before eventually having to pass prices onto consumers and that’s led to lower profits this year and more than likely lower profits next year. \n“But we are comfortable where we are and are working hard to give people a great quality product for good value for money. The business remains very strong.” \nDuring the year the firm entered into a 50/50 joint venture with a company called Infusions GB to amalgamate both firms’ “tag and envelope” packing capabilities. \nNo staff were made redundant and the JV means the Balliol Business Park factory has now been freed up to focus on growing other areas of the business. Turnover from the JV will be recognised in the Ringtons Holdings Company and not Ringtons Ltd. \nMr Smith said that the number of different products produced by Ringtons for its brand and other customers has now grown to 684 lines, driven primarily by growth in the variety of infusion products, including fruit, herb and flavoured teas. \nThis means that the firm has a much more complicated factory, with more types of packing and packaging required compared to previous years - and expansion is planned. \nMr Smith added: “We are doing a minor extension next year. We are moving our infusions blending area to a small new build on the side of the factory to separate it from black tea and to give it much more soace to we can cope with it as it expands. \n“I imagine we will be taking on new staff because the infusions tend to be smaller lines with complicated formulas and tends to be intensive in terms of labour.” Like us on Facebook", "external_links": [], "published": "2018-03-29T18:22:00.000+03:00", "crawled": "2018-03-29T19:55:47.107+03:00", "highlightTitle": ""}