{"organizations": [], "uuid": "d5697b630c31dfda1ffe1d7c5843517f6770ff25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14378437.ece/ALTERNATES/s1200/JS145497465-1.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/pmqs-theresa-may-live-updates-14378364", "country": "GB", "domain_rank": 21960, "title": "PMQs LIVE: Watch as Theresa May faces potential questions on Saudi Arabia crown prince visit and Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-07T13:17:00.000+02:00", "replies_count": 0, "uuid": "d5697b630c31dfda1ffe1d7c5843517f6770ff25"}, "author": "Jonathan Walker-NEC", "url": "https://www.chroniclelive.co.uk/news/north-east-news/pmqs-theresa-may-live-updates-14378364", "ord_in_thread": 0, "title": "PMQs LIVE: Watch as Theresa May faces potential questions on Saudi Arabia crown prince visit and Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jon walker", "sentiment": "none"}, {"name": "mohammed bin salman", "sentiment": "none"}, {"name": "sergei skripal", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "buckingham palace", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "So what did we learn? \nPMQs is over. Here are some of the main points: Jeremy Corbyn thinks we shouldn’t have such close links with Saudi Arabia But Theresa May is unapologetic. She sees Saudi Arabia as an ally, and argues the UK is helping it change for the better The Prime Minister is keen to push her housing plan International Women’s Day provided a chance for Tory MPs to boast about having not one but two female leaders so far. Labour hasn’t had any 12:50 \nAnd now it’s over:) 12:48 \nPMQs is meant to finish 1t 12.30. The Speaker likes to let it run! 12:48 Jonathan Walker \nConservative Leo Docherty says Suadi Arabia is an important force for stability in a turbulent region. \nTheresa May says that Saudi Arabia is reforming, changing and giving greater rights to women, and the UK will work with him. 12:45 Jonathan Walker \nNigel Dodds of the DUP says EU negotiater Michel Barnier has united the Government and the opposition by producing proposals for a Brexit deal that everyone in the UK opposes. \nTheresa May says it’s time for EU negotiators to “get on with the job”. 12:37 Jonathan Walker \nConservative Maria Miller says women are still forced out of their jobs just for having a baby. \nTheresa May says discrimination in the workplace is unlawful but the Government will review the legislation to ensure pregnant women are protected. 12:37 Jonathan Walker \nWolverhampton Labour MP Emma Reynolds asks the Prime Minister to explain why the number of people taking apprenticeships has fallen. \nTheresa May says the Government will increase the number of apprenticeships to three million. 12:35 Jonathan Walker \nConservative MP Justin Tomlinson, MP for North Swindon, asks Theresa May to pay tribute to his constituent, six-year-old Maisie Sly, star of film The Silent Girl which won an Oscar for Best Live Action Short. 12:31 Jonathan Walker \nLabour MP Lilian Greenwood urges the Government to provide more funding for social care funding in next week’s financial statement. \nTheresa May says next week’s statement by the Chancellor is not a Budget statement - a bit of expectation management perhaps. 12:29 Jonathan Walker \nSNP MP Stewart Malcolm McDonald says the Saudi Crown Prince “sweeps across” Westminster and Whitehall. He seems to think this is another storm 12:23 \nMore response to PMQs so far: 12:21 Jonathan Walker \nCorbyn says: “We are the fifth richest country in the world. The growing number of people on our streets is a mark of national shame” \nTheresa May says more council houses have been built under this Conservative government that were built under Labour. And the Government will build more homes. \nShe says that Mr Corbyn once said the housing policy of the last Labour government delivered “misery and despair”. 12:18 \nBut Theresa May insists you don’t deal with these issues by holding meetings. \nShe says the Government is also making sure the UK builds more homes. 12:16 \nSome response to Theresa May’s comment: 12:14 \nJeremy Corbyn claims a Government taskforce designed to cut rough sleeping still hasn’t met. \nTheresa May says that’s just not true - the taskforce met today. \nShe also says the Government aims to eliminate rough sleeping by 2027. 12:13 Jonathan Walker \nJeremy Corbyn asks why rough sleeping has risen. \nMrs May says “this is a government that is putting millions of pounds extra into dealing with rough sleeping”. 12:12 Jonathan Walker \nTheresa May insists the UK is delivering “life-saving aid” to Yemen, and the UK has also pressed Saudi Arabia to allow humanitarian aid into the country. \nShe says the Saudis agreed to do this, which shows that it helps to have good relations with Saudi Arabia. \nShe also points out that the Saudi action in Yemen comes at the request of the Yemeni government and is backed by the United Nations, and therefore the UK supports it. 12:10 Jonathan Walker \nJeremy Corbyn begins by criticising the UK’s close relationship with Saudi Arabia. \nHe says there is evidence of Saudi funding going to terrorist groups here in the UK. \nAnd he says the Saudi-led bombing campaign in Yemen is killing children. \nBut Mrs May says the UK’s link with Saudi Arabia is important and has saved lives. \nShe also says that UK terror groups actually get most of their funding from UK sources, not from overseas countries. \nShe is today meeting the Crown Prince of Saudi Arabia, Mohammed bin Salman. 12:07 Jonathan Walker \nTheresa May tells of Labour leader Jeremy Corbyn for telling her that it’s International Women’s Day. She accuses him of “mansplaining”. 12:06 Jonathan Walker \nQuestions to the Prime Minister kicks off with a friendly question from Conservative MP Simon Hoare welcoming the Government’s housing plans. 12:03 Jonathan Walker \nHere are the MPs lined up to question the Prime Minister. Others might also get a chance - if the Speaker chooses to call them. \nQ1 Simon Hoare (North Dorset) \nQ2 Andrew Bridgen (North West Leicestershire) \nQ3 Mrs Louise Ellman (Liverpool, Riverside) \nQ4 Stewart Malcolm McDonald (Glasgow South) \nQ5 Kirstene Hair (Angus) \nQ6 Lilian Greenwood (Nottingham South) \nQ7 Rachael Maskell (York Central) \nQ8 Mr Alistair Carmichael (Orkney and Shetland) \nQ9 Neil Parish (Tiverton and Honiton) \nQ10 Emma Reynolds (Wolverhampton North East) \nQ11 Mhairi Black (Paisley and Renfrewshire South) \nQ12 Colin Clark (Gordon) \nQ13 Marsha De Cordova (Battersea) \nQ14 Dr Philippa Whitford (Central Ayrshire) \nQ15 Glyn Davies (Montgomeryshire) 12:01 Jonathan Walker \nLater this afternoon, MPs will debate proposals to allow British people to keep EU citizenship after Brexit. \nThis isn’t actually going to happen - or at least, it doesn’t look likely. \nBut the debate will give MPs who support the idea a chance to have their say. 12:00 What's happening in Parliament today? \nQuestions to the Prime Minister are due to begin at 12 noon. \nAfter that, Liberal Democrat leader Vince Cable will ask the Government an “urgent question” about the UK’s relationship with Saudi Arabia. \nAnd after that, Labour Shadow Culture Secretary Tom Watson has an urgent question about press regulation. More On", "external_links": [], "published": "2018-03-07T13:17:00.000+02:00", "crawled": "2018-03-07T14:18:46.021+02:00", "highlightTitle": ""}