{"organizations": [], "uuid": "7af33fa55482958a3b9bf5a8816ad06c5cea13b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14459392.ece/ALTERNATES/s1200/CFR_NJL_260318dulux_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/akzonobel-opens-skills-academy-northumberland-14459234", "country": "GB", "domain_rank": 21960, "title": "AkzoNobel opens skills academy in Northumberland to tackle construction skills shortages", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-26T18:20:00.000+03:00", "replies_count": 0, "uuid": "7af33fa55482958a3b9bf5a8816ad06c5cea13b7"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/akzonobel-opens-skills-academy-northumberland-14459234", "ord_in_thread": 0, "title": "AkzoNobel opens skills academy in Northumberland to tackle construction skills shortages", "locations": [], "entities": {"persons": [{"name": "jeff hope", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "felling", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}], "organizations": [{"name": "dulux academy", "sentiment": "none"}, {"name": "akzonobel", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "akzonobel ashington", "sentiment": "none"}, {"name": "slough", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AkzoNobel opens skills academy in Northumberland to tackle construction skills shortages The Dulux owner is on a mission to train and upskill 10,000 decorators by 2020 Share A training course in session at the new Dulux Academy at AkzoNobel Ashington (Image: AkzoNobel) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMajor North East employer AkzoNobel has opened a new training centre as part of its mission to tackle skills shortages in the construction sector. \nThe Dutch paint manufacturer has opened its second Dulux Academy at its new facility in Ashington, which aims to build on the success of its first academy in Slough, Berkshire, which trained 1,600 decorators in its first year. \nThe firm, which also has a plant in Felling, Gateshead, plans to train and upskill 10,000 UK decorators by 2020 and the new facility will offer courses in disciplines including decorating prep, basic painting and decorating, wallpapering, woodcare and advanced painting techniques. \nJeff Hope, head of manufacturing unit at AkzoNobel Ashington, said: “We’re incredibly proud to have the second Dulux Academy housed in Ashington. The Dulux Academy provides a unique teaching and learning environment for those in the decorating trade. \n“With up to 12 spaces available per programme, each course follows its own teaching format. The new, state-of-the-art academy features a dedicated workshop where learners can get hands-on with practical-based assignments, as well as a classroom area for theoretical based learning. AkzoNobel plant in Ashington where they make paint (Image: Newcastle Chronicle) \n“The academy also has its own kitchen and dining space, meeting rooms and a breakout room, which contains all of AkzoNobel’s latest virtual reality technologies. \n“The courses on offer to practiced painters and decorators, as well as those just starting out in the industry, are designed to provide attendees with all of the expertise and know-how they need for business success.” \nAkzoNobel Ashington opened last September and is the company’s flagship UK production centre and home to the market leading paint brand, Dulux. \nMr Hope said: “It’s fitting that the company’s newest Dulux Academy has been placed in Ashington. AkzoNobel has made a significant investment in the North East through the construction of the plant i n Ashington. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“The opening of the new academy is just further reinforcement of the company’s belief in the region as a great place to do business and in the talent of its people.” \nLast year AkzoNobel, which wmploys around 1,000 people in the North East, saw off a takeover bid by US chemicals giant PPG Industries. Read More North East manufacturing should be 'at the heart' of Brexit talks, says Northern Powerhouse minister \nAkzoNobel is currently creating a £10m Akzo Nobel’s new £10m research facility at the global paint firm’s Gateshead base. \nWork is set to start this month on research centre in Gateshead, which will result in a new cryogenic facility, warehouse and protective coatings applications and testing laboratory. Like us on Facebook", "external_links": [], "published": "2018-03-26T18:20:00.000+03:00", "crawled": "2018-03-26T22:08:49.013+03:00", "highlightTitle": ""}