{"organizations": [], "uuid": "9add24b86fe7e0d94735949fe787eae3e6e9910a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12804140.ece/ALTERNATES/s1200/BRITAIN_Bexit_162747.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-shields-brexit-campaigner-cheated-14454853", "country": "GB", "domain_rank": 21960, "title": "North Shields Brexit campaigner 'cheated to bend referendum spending rules'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-25T15:04:00.000+03:00", "replies_count": 0, "uuid": "9add24b86fe7e0d94735949fe787eae3e6e9910a"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-shields-brexit-campaigner-cheated-14454853", "ord_in_thread": 0, "title": "North Shields Brexit campaigner 'cheated to bend referendum spending rules'", "locations": [], "entities": {"persons": [{"name": "sanni", "sentiment": "none"}, {"name": "shahmir sanni", "sentiment": "none"}, {"name": "whistleblower shahmir sanni", "sentiment": "none"}, {"name": "beleave", "sentiment": "none"}, {"name": "stephen parkinson", "sentiment": "none"}, {"name": "parkinson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "newcastle north", "sentiment": "negative"}, {"name": "north shields brexit", "sentiment": "negative"}, {"name": "electoral commission", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North Shields Brexit campaigner 'cheated to bend referendum spending rules' Former Newcastle North parliamentary candidate Stephen Parkinson was a leading figure in the Vote Leave campaign Share EU and Union Flags fly outside Parliament (Image: AP Photo/Kirsty Wigglesworth) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA North Shields-born political advisor has denied claims his Vote Leave campaign “cheated” during the run up to the Brexit referendum. \nWhistleblower Shahmir Sanni, who worked on the Vote Leave campaign, claims its links to another pro-Brexit group - BeLeave - were manipulated to dodge strict spending rules set by the Electoral Commission. \nMr Sanni was in a relationship with senior Vote Leave figure Stephen Parkinson at the time of the June 2016 vote. Mr Sanni has also claimed through his lawyers that North Shields-born Mr Parkinson “outed” him as gay ahead of a Channel 4 story where the allegations were aired. Shahmir Sanni (Image: Channel 4) \nMr Sanni claims BeLeave was controlled by Vote Leave, rather than an independent campaign. Vote Leave says it legally donated £650,000 to BeLeave. \nMr Parkinson is a former Conservative parliamentary candidate, who ran for the Newcastle North seat in the 2010 General Election. He now works as a special advisor to Prime Minister Theresa May. Mr Parkinson says Mr Sanni’s statements are “factually incorrect and misleading”. \nMr Sanni said: “In effect they used BeLeave to over-spend, and not just by a small amount... Almost two-thirds of a million pounds makes all the difference and it wasn’t legal.” \nBut Mr Parkinson said: “At the relevant time during the referendum period, the commission advised Vote Leave that it was permissible to make a donation in the way it proposed to do to BeLeave. Stephen Parkinson (Image: NCJ Media) \n“Twice since the referendum the commission has investigated this matter, and twice it has found no evidence of wrongdoing. A third investigation into the same issue is currently taking place. \n“The Electoral Commission has not contacted me in relation to any of these inquiries, but I will of course be happy to assist in them if they wish me to do so. \n“I firmly deny the allegations in the programme. \n“I had no responsibility for digital campaigning or donations on the Vote Leave campaign, and am confident that I stayed within the law and strict spending rules at all times.” \nLiberal Democrat spokesman Tom Brake has called for the police to take action. \nHe said: “These allegations must be examined by the police. \n“If they represent what happened it is outrageous and shameful. \n“The referendum had a very narrow outcome. One of the biggest exercises in democracy must not turn out to be one of Britain’s biggest electoral frauds.” Read More The Brexit EU referendum promises that came true - and the ones that didn't \nBut Vote Leave says it has twice been cleared of any wrongdoing. \nA spokesman added: “As has been the case throughout, Vote Leave is obligated to review - to the extent it can after this long elapsed period since the referendum - all such allegations, and is doing so. \n“We will as appropriate share any relevant findings with the Electoral Commission, again as we have always done.” \nAn Electoral Commission spokeswoman said: “The commission has a number of investigations open in relation to campaigners at the EU Referendum; it does not comment on live investigations.” Like us on Facebook", "external_links": [], "published": "2018-03-25T15:04:00.000+03:00", "crawled": "2018-03-25T21:55:52.007+03:00", "highlightTitle": ""}