{"organizations": [], "uuid": "4333477ceecb170a77a9dea889beb4d86f5a7a67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14436831.ece/ALTERNATES/s1200/JS118396345.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mps-air-concerns-over-facebook-14436764", "country": "GB", "domain_rank": 21960, "title": "MPs air concerns over Facebook and Cambridge Analytica data scandal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-20T20:00:00.000+02:00", "replies_count": 0, "uuid": "4333477ceecb170a77a9dea889beb4d86f5a7a67"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mps-air-concerns-over-facebook-14436764", "ord_in_thread": 0, "title": "MPs air concerns over Facebook and Cambridge Analytica data scandal", "locations": [], "entities": {"persons": [{"name": "julie elliott", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "mark zuc", "sentiment": "none"}, {"name": "damian collins", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "facebook and cambridge analytica", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "cambridge analytica", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "share facebook", "sentiment": "none"}, {"name": "house of commons digital", "sentiment": "none"}, {"name": "sort committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MPs air concerns over Facebook and Cambridge Analytica data scandal Pressure is growing on Facebook boss Mark Zuckerberg to give evidence over the Cambridge Analytica scandal Share Facebook CEO Mark Zuckerberg and Sunderland Central MP Julie Elliott (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe House of Commons has been told “a lot of half-truths and mistruths” about the use of private data, an MP has claimed. \nSunderland Central MP Julie Elliott, a member of the House of Commons Digital, Culture, Media and Sort Committee, spoke as MPs discussed reports that a firm called Cambridge Analytica used data gathere d from Facebook to target voters during elections. \nShe said “data companies” had failed to “come clean” about how they use personal information. \nAnd the chair of the committee, MP Damian Collins, has now written to Facebook founder Mark Zuckerberg asking him to give evidence - and accused Facebook of “misleading” the committee in a previous hearing. Facebook CEO Mark Zuckerberg \nThe Digital, Culture, Media and Sort Committee is a committee of the House of Commons. \nIt recently questioned managers from Facebook, along with other internet giants including Google and Twitter, as part of an inquiry into so-called fake news. \nMs Elliott said: “In recent months, having listened to evidence in this area that has been given to us on the select committee, it is becoming clear that we have had a lot of half-truths and mistruths, to give the most positive description. \n“The impact on elections and referendums is, to my mind, becoming clearer. Sunderland Central MP Julie Elliott (Image: handout) \n“We cannot prove it yet, but it is becoming clearer in that the data companies are not giving us evidence on what they do with the information and they are not coming clean on how they use it.” \nNewcastle Central MP Chi Onwurah, a Labour shadow business minister, said current legislation failed to ensure personal data was kept secure. \nShe said: “I have long called for a comprehensive forward-looking review of data sharing and abuse, so that our citizens can have the data rights they deserve. The Data Protection Bill does not achieve that.” Read More Education Secretary denies cutting funding for North East schools \nAn inquiry by the Observer has revealed that Cambridge Analytica used data collected from hundreds of thousands of users were paid to take a personality test and agreed to have their data collected for academic use. The users downloaded an app, which was able to gather data from their friends as well. \nCambridge Analytica is said to have worked with the Leave.EU campaign during the 2016 EU referendum. This was an unofficial pro-Brexit campaign involving Nigel Farage. A person holds a phone displaying the Facebook logo (Image: Carl Court/Getty Images) \nThe firm’s chief executive, Alexander Nix, and the leaders of the Leave.EU campaign boasted about working together on the Brexit campaign but have since retracted their claims, saying no contract was signed and no work was completed. It is also said to have worked on Donald Trump’s campaign to become US president. \nIn his letter to Mr Zuckerberg, Mr Collins said Facebook had given answers “misleading to the committee” at a previous hearing which asked whether information had been taken without users’ consent. \n“It is now time to hear from a senior Facebook executive with the sufficient authority to give an accurate account of this catastrophic failure of process,” Mr Collins wrote. \n“Given your commitment at the start of the New Year to ‘fixing’ Facebook, I hope that this representative will be you,” he added. \nCambridge Analytica was suspended from Facebook last week after it emerged that data on millions of users had not been destroyed as agreed. \nWhistleblower Chris Wylie, a former research director at the UK-based company, told Channel 4 News a so-called data grab had been carried out on more than 50 million profiles in 2014. Read More \nAsked about the reports, Prime Minister Theresa May’s spokesman said: “It is absolutely right that the Information Commissioner is investigating this matter. \n“We expect Facebook, Cambridge Analytica and all the organisations involved to co-operate fully.” Like us on Facebook", "external_links": [], "published": "2018-03-20T20:00:00.000+02:00", "crawled": "2018-03-20T20:52:32.031+02:00", "highlightTitle": ""}