{"organizations": [], "uuid": "f57ff2c7858c9d48d545fa9303986e1afe7891a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1102850.ece/ALTERNATES/s1200/IMG_1810JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/toys-r-shut-100-uk-1337659", "country": "GB", "domain_rank": 48128, "title": "Toys R Us to shut all 100 UK stores - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.407, "site_type": "news", "published": "2018-03-14T14:20:00.000+02:00", "replies_count": 0, "uuid": "f57ff2c7858c9d48d545fa9303986e1afe7891a9"}, "author": "Ravender Sembhy", "url": "https://www.leicestermercury.co.uk/news/business/toys-r-shut-100-uk-1337659", "ord_in_thread": 0, "title": "Toys R Us to shut all 100 UK stores - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "moorfields", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicester mercury toys r us", "sentiment": "negative"}, {"name": "moorfields advisory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Toys R Us to shut all 100 UK stores No buyer has been found Share Click to play Tap to play The video will start in 8 Cancel Play now Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCollapsed toy retailer Toys R Us is to shut all 100 of its UK stores after administrators failed to find a buyer. \nStaff have today been told of the decision, which will result in the loss of 3,000 jobs. \nThe toy chain appointed Moorfields Advisory to oversee an administration at the end of February but today it was revealed that all stores will close. \nIt is thought that Moorfields will now begin a six-week \"wind down\" of the store estate. Read More \nMoorfields will begin with the closure of at least 26 loss-making stores earmarked late last year, when Toys R Us pushed through a restructuring before its demise. \nAn official announcement is expected later on Wednesday. \nToys R Us is one of the nation's biggest toy retailers, employing more than 3,000 across 100 stores in the UK. \nMoorfields said at the time of the chain's collapse that it is making \"every effort\" to secure a buyer for all or part of the business, but no suitor materialised in what is proving to be a dire time for high street retailers. Read More Wagamama, TGI Friday's and Shoe Zone named, shamed and forced to pay up \nThe retail sector has had a dismal start to 2018, with the collapse of Toys R Us and Maplin and a host of firms undergoing painful restructurings, including New Look and eateries run by celebrity chef Jamie Oliver, as well as Byron and Prezzo. \nHigh street chains across the board have been hit hard by falling consumer spending, soaring Brexit-fuelled inflation and competition from online rivals. Like us on Facebook", "external_links": [], "published": "2018-03-14T14:20:00.000+02:00", "crawled": "2018-03-14T16:16:07.068+02:00", "highlightTitle": ""}