{"organizations": [], "uuid": "7732f596d4bfdeda6aee8f0cf8578cbd6bce5563", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1340465.ece/ALTERNATES/s1200/Brexit-Ralley.png", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/local-news/brexiteers-march-nicky-morgans-loughborough-1340445", "country": "GB", "domain_rank": 48128, "title": "Brexiteers march on Nicky Morgan's Loughborough office calling for her resignation - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.08, "site_type": "news", "published": "2018-03-16T10:12:00.000+02:00", "replies_count": 0, "uuid": "7732f596d4bfdeda6aee8f0cf8578cbd6bce5563"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/local-news/brexiteers-march-nicky-morgans-loughborough-1340445", "ord_in_thread": 0, "title": "Brexiteers march on Nicky Morgan's Loughborough office calling for her resignation - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "nicky morgan", "sentiment": "negative"}, {"name": "mrs morgan", "sentiment": "none"}], "locations": [{"name": "pinfold gate", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "charnwood", "sentiment": "none"}], "organizations": [{"name": "loughborough", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexiteers march on Nicky Morgan's Loughborough office calling for her resignation But she's staying put Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBrexit supporters have called for Loughborough MP Nicky Morgan to resign during a protest rally outside her constituency office. \nCampaigners bearing Vote(d) Leave and ‘You Work for Us’ banners gathered in the town on Saturday before marching on the MP’s premises in Pinfold Gate, although it was closed at the time. The rally outside Mrs Morgan's office \nThe group included Tory, UKIP and Labour members, who said they wanted to give Conservative remain supporter Mrs Morgan some ‘visual assistance’ to remind her the majority (53.8 per cent) of people in the Charnwood area voted for the UK to quit the European Union. Read More \nMrs Morgan, who campaigned to remain in the EU, has been a vocal critic of pursuing a hard Brexit. She has angered some Brexiteers by saying she would support keeping Britain in a customs union after we leave. \nHowever, the rally organiser, UKIP’s Dr Andy McWilliam, said: “It cannot be hard or soft. \n“It is either Brexit, for which we voted, or stay in the undemocratic, power grabbing, warmongering and hugely divisive EU. \n“David Cameron and Nicky lost. \n“He is gone. Nicky does not like it.” Nicky Morgan \nUKIP East Midlands MEP Jonathan Bullock said: “More than 70 per cent of people in Loughborough I spoke to just want to get on with Brexit and that includes leaving the customs union. \"Nicky Morgan MP has hoodwinked the electorate by being elected on a platform of a clean Brexit but now she wants to remain in a customs union which Liam Fox MP calls a \"betrayal of the referendum\". \n\"She should stand down and hold a by-election so local people can give their verdict. Read More Leicester City want to know what fans think of £80m training complex plan, here's how you can get involved \n“We had support from local Conservatives, Labour and UKIP on Saturday, all calling for a clean Brexit.\" \nMrs Morgan, the former education secretary, told the Mercury: “My priorities are and always will be my constituents who rely on a stable and growing economy for their jobs, being able to pay their household bills and being able to achieve their hopes and dreams. \n“It’s ironic that as a handful of placard-waving activists from all over the country were gathering in Loughborough Market Place to call for their own brand of destructive hard Brexit, I spent hours just a few hundred feet up the road speaking with constituents and exhibitors at an event aimed at helping people plan for and live through long, healthy and happy retirements. \n“That’s what being an MP is really about, serving people.” Like us on Facebook ", "external_links": [], "published": "2018-03-16T10:12:00.000+02:00", "crawled": "2018-03-16T10:20:50.021+02:00", "highlightTitle": ""}