{"organizations": [], "uuid": "1978f577e4c45dc13825429250fed1c033c2799f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1312394.ece/ALTERNATES/s1200/CaptureJPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/exmoors-ambition-becomethe-test-bed-1312397", "country": "GB", "title": "Exmoor’s ambition to become the test-bed for national policy post-Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-08T18:58:00.000+02:00", "replies_count": 0, "uuid": "1978f577e4c45dc13825429250fed1c033c2799f"}, "author": "Lewis Clarke", "url": "https://www.devonlive.com/news/devon-news/exmoors-ambition-becomethe-test-bed-1312397", "ord_in_thread": 0, "title": "Exmoor’s ambition to become the test-bed for national policy post-Brexit", "locations": [], "entities": {"persons": [{"name": "michael gove", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "exmoor hill farming network", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "hill farmers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prototype farm sign: Exmoor’s ambition signals the future for post-Brexit farming policy. All Exmoor Hill Farmers will be offered a farm sign that highlights their role in farming the landscape. Share Get     \nExmoor’s farmers have received the backing of Cabinet minister Michael Gove MP. \nBacked by the Exmoor Hill Farming Network, conservationists and local public bodies – Exmoor’s Ambition – aims to sustain and enhance Exmoor’s farmed landscapes and communities following the UK’s exit from the EU. \nThe proposed ‘funding and branding’ model shows a clean break with the traditional EU models and refocuses Exmoor position as a brand of the future to maximise revenues. Sharing the goals laid out in the Government’s recent 25-Year Environment Plan to pass on the world class landscape to the next generation in a better state than we received it, this proposal provides a once-in-a-generation opportunity to forge more effective ways of protecting Exmoor’s landscapes, while revitalising its communities and economies. Read More First phase of multi-million pound rail link given green light \nThe proposal outlines a simpler, more integrated and local policy, incentivising all the public benefits provided by the countryside. This would be delivered through a scheme delivered locally that; \n• Harnesses the concept of ‘Natural Capital’ (what nature gives us) to draw value out of Exmoor’s unique features \n• Uses trust and cooperation to replace regulation and form-filling \n• Encourages new thinking, especially from the next generation \n• And is co-designed and delivered by farmers and land managers The Exmoor Horn \nExmoor’s Ambition – which is described in a costed plan - is a structure of two integrated measures that would replace the current EU farm and environmental schemes. The first measure – ‘Good Farming’ - would be available to all farmers and reward them for managing their land in ways that are good for nature and people. \nThe second measure - ‘Enhanced Benefits’ - would target specific objectives, such as enhancing heather moorland for wildlife, improving coastal access for walkers, planting and managing woodland, reducing flooding and encouraging entrepreneurial businesses. \nA funded programme would improve Exmoor produce itself, with a new product strategy and improved supply chain strategy in place for the area. The Exmoor Ambition paper outlines the intention to create a newly defined geographical descriptor for Exmoor, by way of achieving a stronger brand identity and premium for Exmoor products and provenance. \nAll Exmoor Hill Farmers will be offered a farm sign that signals their role in farming the landscape. NFU South West Regional Director Mel Squires said: “It is very positive to see farmers at the heart of the approach developed for Exmoor and this is a reflection of the local industry partnerships and collaboration, which the NFU wholly supports, in putting ideas and solutions on the table to ensure our members’ businesses are both resilient and successful. Read More One of the most photographed pubs in the South West has just been sold \n“The system proposed puts forward a way to provide a fair reward for delivering a range of Public Goods and services, with competitive food production being at the centre of these. A locally-led approach for Exmoor, sitting within an overall national policy, can be part of better rewarding and recognising farmers for the work they do and helping them deliver more for society, the economy, tourism, and the environment.” \nThe Rt Hon Michael Gove MP, Defra Secretary of State gave his support to the scheme. He said: “The voices of farmers, their hopes and concerns, expectations and ambitions, and indeed obligations and duties, are now more central to Government thinking than at any time for fifty years. It is crucial that we, together, make the most of this historic opportunity as we leave the EU and I am encouraged by the way the farming industry has risen to the challenge. I am particularly looking forward to visiting Exmoor to hear about their proposals for an Exmoor Ambition Programme, a partnership between farmers providing new ideas for the industry in the post Brexit world.” \nRobin Milton, Chair, Exmoor National Park Authority added: “This is a farmer-based approach designed to enhance the local landscape and generate optimum return for Exmoor. It offers a better way of using public resources more efficiently, providing the Government with a testbed to develop land management support that delivers what the nation expects. \n“We’ve united the local community in this ambition for Exmoor and based our plans on what the landscape and our local business networks have to offer. I feel this should be part of developing a blueprint for the future.” Like us on Facebook", "external_links": [], "published": "2018-03-08T18:58:00.000+02:00", "crawled": "2018-03-08T19:12:14.000+02:00", "highlightTitle": ""}