{"organizations": [], "uuid": "cf6b1b35e849bfed3e9757741b1f549b27ad30d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1302637.ece/ALTERNATES/s1200/SpearingWaiteDeals.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/leicester-law-firm-spearing-waite-1302681", "country": "GB", "domain_rank": 48128, "title": "Leicester law firm Spearing Waite oversaw record £300m of corporate transactions last year", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-06T12:24:00.000+02:00", "replies_count": 0, "uuid": "cf6b1b35e849bfed3e9757741b1f549b27ad30d8"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/leicester-law-firm-spearing-waite-1302681", "ord_in_thread": 0, "title": "Leicester law firm Spearing Waite oversaw record £300m of corporate transactions last year", "locations": [], "entities": {"persons": [{"name": "waite", "sentiment": "negative"}, {"name": "freudenberg", "sentiment": "none"}, {"name": "oliver brookshaw", "sentiment": "none"}, {"name": "jahid ali", "sentiment": "none"}, {"name": "martin smith", "sentiment": "none"}, {"name": "steve mcelhone", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "lancashire", "sentiment": "none"}, {"name": "melton road", "sentiment": "none"}, {"name": "pocklingtons walk", "sentiment": "none"}], "organizations": [{"name": "ensek", "sentiment": "none"}, {"name": "dominos", "sentiment": "none"}, {"name": "magma chartered accountants", "sentiment": "none"}, {"name": "spearing waite", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicester law firm Spearing Waite oversaw record £300m of corporate transactions last year Senior team said revenues for its corporate practice were up a fifth in 2017 Share Left to right: Oliver Brookshaw, Jahid Ali, Steve McElhone, Martin Smith – all of Spearing Waite Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Leicester law firm has announced that it oversaw a record £300 million worth of corporate transactions last year. \nThe team at Spearing Waite, in Pocklingtons Walk, said revenues for its corporate practice were up a fifth in 2017. \nThe firm advised on more than 30 transactions during 2017 including a £24 million acquisition for pizza delivery giant Dominos, a management buyout for Nottingham-based energy technology firm ENSEK and an initiative to raise £75 million of venture capital funding. \nThe Its corporate team also advised global technology group Freudenberg on its acquisition of a precision moulding company in Lancashire. \nOther transactions included the sale of Clear & Lane accountants, in Leicester’s Melton Road, to Warwickshire-based Magma Chartered Accountants. \nJahid Ali, head of corporate at Spearing Waite, said: “2017 was a record year for our corporate team and the quantity and quality of the deals completed in those 12 months are testament to our growing reputation. Spearing Waite moved to Pocklingtons Walk in 2015 \n“The majority of the deals were acquisitions or investments – we are delighted that so many of our clients continue to enjoy strong growth despite the often-cited uncertainty around Brexit. \n“The ENSEK management buy-out and Magma’s acquisition of Clear & Lane are great examples of successful businesses investing further in the East Midlands.” \nMartin Smith, a member of the management board at Spearing Waite, said: “Our move to Pocklingtons Walk in 2015 has been instrumental to our growth strategy which has enabled us to keep on providing top quality legal advice to existing and new clients. Read More Spearing Waite advises on multi-million MBO \n“Spearing Waite continues to benefit from the recruitment of experienced associates and partners, many of whom joined us from large national and international practices where they felt stifled and unable to provide the kind of personal, bespoke service their clients deserved. Read More \n“We also see organic growth as fundamental to development and through attracting high quality candidates as a result of our “hands on” training, have seen many of our trainee solicitors qualify into the practice and for some to become partners.” Like us on Facebook ", "external_links": [], "published": "2018-03-06T12:24:00.000+02:00", "crawled": "2018-03-06T12:45:48.008+02:00", "highlightTitle": ""}