{"organizations": [], "uuid": "66b233a88dfe923db95df8920538f9a114a195ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13974225.ece/ALTERNATES/s1200/JS69569546.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14465194", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Aviva faces city watchdog probe over preference shares saga", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-28T10:35:00.000+03:00", "replies_count": 0, "uuid": "66b233a88dfe923db95df8920538f9a114a195ba"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14465194", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Aviva faces city watchdog probe over preference shares saga", "locations": [], "entities": {"persons": [{"name": "aviva", "sentiment": "negative"}, {"name": "andrew bailey", "sentiment": "none"}], "locations": [], "organizations": [{"name": "treasury select committee", "sentiment": "none"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Time Out losses widen as New York market plans gather pace \nPublisher and food market firm Time Out has reported pre-tax losses widening to £26.3 million in 2017, against losses of £18.8 million the previous year. \nTime Out said it had signed a conditional lease agreement for a food market in New York. \nExpected to open in the fourth quarter, the new market will cover 21,000 square feet and will include 20 food offerings, three bars, a stage for cultural activities and an exhibition space. The Manhattan skyline - a Time Out food market is set to open in New York (Image: iStockphoto) 8.50 Coreena Ford Gateshead's Tolent notches up £94m order book as construction sector stabilises \nNorth East building company Tolent has racked up an ‘encouraging’£94m order book following another successful trading year. \nThe Gateshead firm, which has around 500 staff in bases in Tyneside, Thornaby, Leeds, Manchester and London, saw revenues rise by 3% to £178m while total comprehensive profit for the year came in at £2.87m, more than double the previous year’s £1.17m. The firm operates across the construction sector, providing everything from commercial building and civil engineering to property development services in the industrial, commercial, petro-chemical, residential, civil, public and health sectors. \nIn his review of the year, non executive chairman Peter Hems said the property and construction sectors of the economy continued to be stable throughout 2017, and that the final consequences of the Brexit decision are as yet uncertain. \nHe said: “As a result of this developers and contractors are being more selective in work taken on in terms of design information requirements, project timescales, overall risk and margin. \n“The directors consider the current level of enquiries and tenders to be encouraging, with the potential to select and negotiate more profitable contracts. We went into 2018 with an encouraging order book of £94m.” \nThe year saw the business complete a raft of big projects including a £14.7m student housing scheme in Liverpool, work at the Arnison Retail Park in Durham, two Travelodges in London and York in contracts worth £34m between them. It is also working on the Beacon of Light building in Sunderland. The development of the Beacon of Light building in Sunderland - one of Tolent's contracts (Image: Newcastle Chronicle) 8.35 Coreena Ford Sofology acquisition drags on retailer DFS's profits \nDFS has blamed acquisition costs for dragging down profits, but said its takeover of Sofology was already boosting revenues and that trading was starting to improve. \nThe furniture company said pre-tax profits tumbled 58% to £7m in the six months to January 27, down from £16.7m a year earlier, having taken a hit from acquisitions including its £25m deal to buy Sofology last year. \nThe company instead highlighted the 4.3% rise in revenues to £396.1m logged over the half-year, which it said reflected increasing scale and “relative market leadership” thanks to the takeover. \nWithout the boost from its acquisitions - including its £1.2m deal for Multiyork’s assets, brand and stores - DFS revenues were down 3.5% at £366.5m. \nThe retailer’s chief executive, Ian Filby, said he was pleased with the performance, which was in line with company expectations despite challenging conditions across the furniture market. DFS store at a Teesside Park shopping centre - the firm acquired rival Sofology last year 8.30 KEY EVENT Aviva facing city watchdog probe over shares sage \nInsurance giant Aviva is facing a possible probe by the City watchdog over its abandoned and heavily-criticised move to cancel £450m worth of preference shares. \nThe Financial Conduct Authority (FCA) said it is considering whether to launch a formal investigation after Aviva’s original announcement earlier this month “raised serious issues”. \nIn a letter responding to concerns aired by the Treasury Select Committee, FCA chief executive Andrew Bailey said the regulator was reviewing Aviva’s compliance with market abuse rules and whether preference shareholders had lost out financially. \nAviva said last week it was rowing back on its controversial proposal to cancel the preference shares, which pay high fixed dividends. \nThe original proposal - made as part of a plan to return £500m to shareholders - had drawn criticism from investors and the FCA, although Aviva said it had received legal advice that it could cancel its preference shares at par value. \nThe FCA said its inquiries would examine if Aviva was right to say it could cancel the shares, and if the announcement was in line with market regulations. \nMr Bailey said: “Our immediate concern had been to understand the basis upon which Aviva was acting, including the clarity of the information available to securities holders ... along with the market integrity concerns that the proposals raised.” \nHe added: “The FCA welcomes the fact that the company has since clarified the position in its announcement on the 23 March 2018 and (Aviva chief executive) Mark Wilson’s statement that ‘preference shareholders can rest secure in their holdings’. \n“However, the FCA’s inquiries continue and, in particular, we are focusing on the treatment of those holders (and potentially now former holders) of the company’s irredeemable preference shares that may have lost out financially as a result of these events.” Aviva", "external_links": [], "published": "2018-03-28T10:35:00.000+03:00", "crawled": "2018-03-28T10:44:45.003+03:00", "highlightTitle": ""}