{"organizations": [], "uuid": "45def63341f186cc32d8117dd97694df11355aca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1137883.ece/ALTERNATES/s1200/2041050.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/uk-inflation-down-impact-big-1361203", "country": "GB", "domain_rank": 48128, "title": "UK inflation down as impact of big drop in value of sterling eases", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-20T12:48:00.000+02:00", "replies_count": 0, "uuid": "45def63341f186cc32d8117dd97694df11355aca"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/uk-inflation-down-impact-big-1361203", "ord_in_thread": 0, "title": "UK inflation down as impact of big drop in value of sterling eases", "locations": [], "entities": {"persons": [{"name": "phil gooding", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "invalid email  inflation", "sentiment": "none"}, {"name": "cpi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UK inflation down as impact of big drop in value of sterling eases Average house prices also dipped by 0.3% in January, down to £226,000, according to latest figures Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nInflation dropped to 2.7 per cent in February – down from 3 per cent in January – as the impact of the devalued pound following the 2016 Brexit vote worked its way through the system. \nThe Consumer Prices Index (CPI) update from the Office for National Statistics (ONS) was down on the 2.8 per cent predicted by some economists. \nIt marked the first fall in inflation since December. \nMeanwhile average house prices dipped by 0.3 per cent in January, down to £226,000, according to the figures released jointly by the ONS, Land Registry and other bodies. \nThey were still 4.9 per cent up on a year earlier. \nSlower growth from CPI eases the pressure on the Bank of England, which is widely expected to hike interest rates beyond 0.5 per cent in May. \nPhil Gooding, ONS head of CPI, said: “A small fall in petrol prices alongside food prices rising more slowly than last year helped pull down inflation, as many of the early 2017 price increases due to the previous depreciation of the pound have started to work through the system. \n“Hotel prices also fell and the cost of ferry tickets rose more slowly than last year, when prices were collected on Valentine’s Day when many people could have been taking mini-breaks.” \nTransport prices dragged on the cost of living in February, securing a smaller month-on-month rise of 0.5 per cent in contrast to 1.2 per cent last year. \nPetrol prices dropped by 0.2p per litre to 120.8 per litre on the month, while diesel slipped by 0.1p per litre to 124.4p per litre. \nFood prices were also applying downward pressure, lifting 0.1 per cent between January and February in contrast to a 0.8 per cent rise the year before. \nThe fall in food prices was partly down to a shortage of salad and vegetables last year when bad weather hit crops in southern Mediterranean countries, the ONS said. (Image: Getty) \nThe main upward pressure on the cost of living came from clothing and footwear prices, which rose by 1.7 per cent on the month – compared to 1.2 pert cent in 2017 – as women’s shoes became more expensive. \nEconomists and the Bank believe inflation’s upward march has run its course and will start to unwind over the coming months. \nThe Bank is expected to keep interest rates on hold at 0.5 per cent on Thursday, but the meeting will be watched closely amid expectations over another hike in May. Read More \nGovernor Mark Carney has already warned borrowers that rates will need to rise “somewhat earlier and by a somewhat greater degree” to get inflation back to the Bank’s 2 per cent target after stronger-than-expected economic growth. Read More \nIt comes after the Office for Budget Responsibility (OBR) hiked its outlook for economic growth this year to 1.5 per cent from 1.4 per cent in its Spring Statement forecasts. \nIt also said it believed inflation would fall back to target this year. Like us on Facebook ", "external_links": [], "published": "2018-03-20T12:48:00.000+02:00", "crawled": "2018-03-20T13:44:43.024+02:00", "highlightTitle": ""}