{"organizations": [], "uuid": "dbf57f4828a430dcee02f6707bbba3eb8e71c66a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14435271.ece/ALTERNATES/s1200/Brexit-shopping-basket-figures.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/uk-news/think-tank-says-slashing-import-14435178", "country": "GB", "domain_rank": 21960, "title": "Think tank says slashing import tariffs after Brexit won't make much difference to shoppers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-20T15:02:00.000+02:00", "replies_count": 0, "uuid": "dbf57f4828a430dcee02f6707bbba3eb8e71c66a"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/uk-news/think-tank-says-slashing-import-14435178", "ord_in_thread": 0, "title": "Think tank says slashing import tariffs after Brexit won't make much difference to shoppers", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "institute for fiscal studies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Think tank says slashing import tariffs after Brexit won't make much difference to shoppers The Institute for Fiscal Studies' report warns cheaper import costs will not offset the pound's drop in valuation Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSlashing import tariffs after Brexit will make little difference to the prices British shoppers pay in stores because their money will be worth less, an economic think tank has warned. \nThe Institute for Fiscal Studies (IFS) says Brits will not feel much benefit to cut tariffs, as they won’t offset the pound’s drop in value. \nBrexit backers have argued that the Government should set lower import charges after Britain leaves the EU which, some say, could bring down the cost of living. Read More Northern business leaders want certainty on Brexit transition, survey says \nBut the IFS report said EU import tariffs are “not particularly high” anyway, at an average of around 2.8%. The think tank said the “optimistic assumptions” would only lead to a reduction of between 0.7% and 1.2%, compared to an estimated 2% increase in prices due to the pound’s depreciation since the Brexit referendum of 2016. \nThe IFS said that while getting rid of tariffs could bring economic benefits in the long run, it could be “very damaging” for UK businesses in the short term. Read More Northern business leaders want certainty on Brexit transition, survey says \nHowever if tariffs were only removed from goods which the UK does not produce itself - in order to protect such businesses - the fall in prices would be 0.4% at most. \nAt the same time, the report said that any benefits to consumers from abolishing tariffs had to be set against the “inevitable costs” to UK trade that would result from leaving the EU customs union. Read More Brexit could help narrow the North-South divide says survey \n“Firms will likely be affected by customs delays and storage costs that would result from the erection of customs barriers on trade with the EU,” the report said. \n“New regulatory differences between the EU and the UK are also likely to create various non-tariff barriers to trade. \n“Such changes would, other things equal, be expected to increase costs for consumers and work to offset the (already rather limited) gains from tariff reductions.” Like us on Facebook", "external_links": [], "published": "2018-03-20T15:02:00.000+02:00", "crawled": "2018-03-20T18:57:44.005+02:00", "highlightTitle": ""}