{"organizations": [], "uuid": "8344a8cf621fa48a7d0cc78ba84284f34d7b34d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14444706.ece/ALTERNATES/s1200/image1.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ministers-forced-explain-decision-produce-14460344", "country": "GB", "domain_rank": 21960, "title": "Ministers forced to explain decision to produce blue post-Brexit passports in France", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-26T22:59:00.000+03:00", "replies_count": 0, "uuid": "8344a8cf621fa48a7d0cc78ba84284f34d7b34d7"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ministers-forced-explain-decision-produce-14460344", "ord_in_thread": 0, "title": "Ministers forced to explain decision to produce blue post-Brexit passports in France", "locations": [], "entities": {"persons": [{"name": "caroline nokes", "sentiment": "none"}, {"name": "liz twist", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}, {"name": "nokes", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "invalid email", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "gemalto", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA decision to manufacture post-Brexit blue passport passports in France could end in disaster, Ministers have been warned. \nNorth East MPs challenged Ministers to explain how Franco-Dutch firm Gemalto could manufacture passports £100 million cheaper than Gateshead business De La Rue, and still provide a reliable service. \nThey spoke after forcing Immigration Minister Caroline Nokes to come to the House of Commons to explain why the Government had rejected De La Rue’s bid to produce the passports - a decision that could put jobs at risk. \nFranco-Dutch firm Gemalto is said to have won the contract to produce the blue passport, which will replace the burgundy design used while the UK was an EU member. Blaydon MP Liz Twist at the De La Rue business in the Team Valley Trading Estate (Image: Newcastle Chronicle) \nBlaydon MP Liz Twist suggested that Gemalto’s cheaper bid raised questions about the reliability of their work. \nShe asked Ms Nokes: “What assessment has she made of the deliverability and reliability of Gemalto’s bid, which I understand was over £100 million less than other bids?” \nAnd she added: “Does the Minister agree that best value is about more than money? It is about having a secure and reliable passport system that works for the UK. \n“There must be questions about how Gemalto can make a contract worth £390 million work.” \nEasington MP Grahame Morris raised similar concerns, saying: “I have constituents whose jobs are at risk as a result of this decision. The Minister says that this is a question of value for money, but my understanding is that the new contract represents a considerable reduction compared with the present arrangements, and I believe that De La Rue has been aggressively undercut by what might turn out to be an unviable bid.” Read More Fury over decision to manufacture post-Brexit blue passports in France - what our MPs are saying \nGateshead MP Ian Mearns said that losing the contract could damage not just De La Rue but the North East economy generally. \nHe asked: “Has the Home Office carried out any assessment of the loss of revenue from national insurance, corporation tax and income tax to the Exchequer when this contract goes to a French Government-owned company?” \nBut Ms Nokes insisted that the contract would go to whichever firm offered the best value for money. \nShe pointed out that no official announcement had been made about the contract. \nBut she did say there was nothing wrong with producing passports overseas. De La Rue in Gateshead, which has lost the contract to make British passports (Image: Daily Mirror) \nShe said: “HM Passport Office has undertaken a rigorous, fair and open competition in accordance with UK law, and in line with EU and World Trade Organisation rules. This process began in March 2017, at which point HM Passport Office clearly set out the requirements under which potential suppliers should table their bids.” Read More Gateshead Council boss demands answers as De La Rue loses UK passport contract \nThe process of adding personal information to blank passports always took place in the UK, “which ensures that no personal data will leave the UK,” she said. \n“Under the current contract, up to 20% of blank passports are produced in Europe. There is no reason why overseas production should not continue in the future and, as such, a national security waiver could not apply.” \nLabour Shadow Home Secretary Diane Abbott, setting out the official position of the Labour leadership , backed De La Rue. \nShe said other countries manufactured their passports at home, saying: “Far from taking back control, it seems we cannot control where our passports are printed. \n“We understand that passports may be manufactured partially in the UK, but it is telling that for security reasons - security reasons that the Minister does not appear concerned about - in countries such as France state-run companies make the passports.” Like us on Facebook", "external_links": [], "published": "2018-03-26T22:59:00.000+03:00", "crawled": "2018-03-27T00:08:13.000+03:00", "highlightTitle": ""}