{"organizations": [], "uuid": "c9d449d6f1412a5d9f37cdc05bb1689a8541a518", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14444706.ece/ALTERNATES/s1200/image1.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fury-over-decision-manufacture-post-14444684", "country": "GB", "domain_rank": 21960, "title": "Fury over decision to manufacture post-Brexit blue passports in France - what our MPs are saying", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-22T15:51:00.000+02:00", "replies_count": 0, "uuid": "c9d449d6f1412a5d9f37cdc05bb1689a8541a518"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fury-over-decision-manufacture-post-14444684", "ord_in_thread": 0, "title": "Fury over decision to manufacture post-Brexit blue passports in France - what our MPs are saying", "locations": [], "entities": {"persons": [{"name": "liz twist", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "gemalto", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Thank you for subscribing!   \nThe decision to manufacture new post-Brexit passports in France has been condemned as a “massive blow to the reputation of British business”. \nBlaydon MP Liz Twist spoke out after it emerged the contract to manufacture passports is to be awarded to Franco-Dutch firm Gemalto - rather than a plant in her North East constituency. \nThe UK is to move back to traditional navy blue passports once we quit the EU in March 2019. They will replace the Burgundy passports currently used in line with other EU countries. \nIt’s been seen by some supporters of Brexit as an important symbol of British independence. But there is anger at reports that the new passports will be manufactured in France. \nGateshead firm De La Rue currently holds the contract for producing UK passports, worth £490m over ten years, but says it missed out in the battle to win the contract to produce the new designs. De La Rue on Team Valley in Gateshead (main pic) and how the new UK passport will look (inset) (Image: Google/PA) \nMs Twist said: “This is devastating news for my constituents who work at De La Rue and a massive blow to the reputation of British business. At such a defining moment in our history, this sends out completely the wrong message and will reduce our standing in Europe and the world.” \nShe added: “At a time of heightened international security, it is downright ludicrous to think that our new passports will be produced abroad. After months of talk about the return to blue British passports, the irony of this decision isn’t lost on me or my constituents.” \nThe Labour MP also spoke in the House of Commons to demand Home Secretary Amber Rudd give a statement explaining the decision. Gateshead MP Ian Mearns \nAnd Gateshead MP Ian Mearns also condemned the decision, telling the Commons: “It’s interesting that the French Government circumvent the procurement rules for manufacturing of passports, stating security as a reason to keep production in France. \nDe La Rue boss Martin Sutherland said it was “disappointing and surprising” that “this icon of British identity is going to be manufactured in France”. \nHe said: “I think we have heard over the last few weeks and months ministers more than happy to come on the media and talk about the blue passports and the fact that the blue passport is an icon of British identity. \n“Now this icon of British identity is going to be manufactured in France.” \nMr Sutherland said his firm had been producing passports for the UK for the last ten years “without a single hiccup” but had been “undercut on price” and would appeal against the decision. Read More Gateshead jobs at risk as blue passport to be printed abroad \nReferring to the Gateshead staff, he said: “I’m going to have to go and face those workers, look at them in the whites of the eyes and try and explain to them why the British Government thinks it’s a sensible decision to buy French passports not British passports.” \nConservative pro-Brexit MPs are also angry. They include Tory MP Sir Bill Cash, who said the decision was “completely wrong and unnecessary”. \nA Home Office spokeswoman said: “We are running a fair and open competition to ensure that the new contract delivers a high quality and secure product and offers the best value for money for customers. Read More Theresa May rapped by Government body over claims police funding is on the rise \n“All passports will continue to be personalised with the holder’s details in the United Kingdom, meaning that no personal data will leave the UK. \n“We do not require passports to be manufactured in the UK. A proportion of blank passport books are currently manufactured overseas, and there are no security or operational reasons why this would not continue.” \nGovernment sources say awarding the contract to Gemalto will save taxpayers £120m, according to reports. Like us on Facebook", "external_links": [], "published": "2018-03-22T15:51:00.000+02:00", "crawled": "2018-03-23T01:50:48.051+02:00", "highlightTitle": ""}