{"organizations": [], "uuid": "06f67b7e3a0263443649c1d07e3cafca38a56a77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14468674.ece/ALTERNATES/s1200/JS91100384.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nhs-needs-find-22m-savings-14468597", "country": "GB", "domain_rank": 21960, "title": "NHS needs to find £22m of savings in Newcastle and Gateshead next year, health bosses warn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-29T10:00:00.000+03:00", "replies_count": 0, "uuid": "06f67b7e3a0263443649c1d07e3cafca38a56a77"}, "author": "Daniel Holland", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nhs-needs-find-22m-savings-14468597", "ord_in_thread": 0, "title": "NHS needs to find £22m of savings in Newcastle and Gateshead next year, health bosses warn", "locations": [], "entities": {"persons": [{"name": "daniel holland", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "ccg", "sentiment": "none"}, {"name": "nhs newcastle gateshead clinical commissioning group", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "invalid email  health", "sentiment": "none"}, {"name": "freeman hospital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NHS needs to find £22m of savings in Newcastle and Gateshead next year, health bosses warn The demands of an ageing population is putting the area's health services under increasing strain Share Daniel Holland Local Democracy Reporter 08:00, 29 MAR 2018 Newcastle's Freeman Hospital (Image: Send in) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHealth bosses in Newcastle and Gateshead have warned that they need to find more than £22 million in savings over the next year. \nThe demands of an ageing population and growing numbers of patients with complex and long-term conditions is putting the area’s health services under increasing strain. \nA report presented to the NHS Newcastle Gateshead Clinical Commissioning Group’s (CCG) governing body this week outlined the need for £22.2 million of efficiency savings in 2018/19 - which comes on top of £28.3 million forecast to be saved in this financial year. \nDespite the fact that the organisation’s overall budget is increasing by £22.3 million for next year, rising costs mean that major savings are still needed to balance its budget. \nThe CCG, which commissions most of the hospital and community NHS services in the area, says it has a ‘detailed’ plan for the savings. \nDr Guy Pilkington, chair the CCG, said: “This year will see a £22.3 million increase in our overall budget for healthcare services in Newcastle and Gateshead. With an ageing population and more patients living with complex and long-term health conditions, demand for services continues to increase. \n“Like every part of the NHS, we continually review what we do in the light of changing patient needs, with the aim of ensuring we make best use of NHS resources in serving our patients and public. \n“For example, over the past year we have saved £26 million with a series of improvements including more efficient prescribing of drugs, and helping patients to access more primary care services rather than relying on more expensive hospital services. Read More North East still has the highest teen pregnancy rate in England, but it's also a record low \n“We have also worked more closely with our care homes and as a result many of our patients have avoided the need for hospitalisation for urinary tract and chest infections, saving the NHS over £3 million, but more importantly, allowing safe care for patients at home.” \nThe report states that improvements in quality, innovation, productivity and prevention (QIPP) could reduce costs by £8.4 million at Newcastle’s hospitals and £4 million at Gateshead’s. \nThe overall plan represents a significant increase from the £14.4 million of savings that was originally targeted for 2018/19. Read More Immigration, passports and the NHS: Key Brexit issues as the 12-month countdown begins \nThe report also warns that it is ‘becoming more challenging’ to save the level of money required, given the high level of efficiency measures already introduced. \nLast week, Newcastle City Council said that the city’s ageing population meant that it will need to attract between 85 and 169 new social care workers by 2022 to meet additional demand among older people alone. Like us on Facebook", "external_links": [], "published": "2018-03-29T10:00:00.000+03:00", "crawled": "2018-03-29T11:15:30.013+03:00", "highlightTitle": ""}