{"organizations": [], "uuid": "7fd2dce454fa49f6dcd8b2d99815e6320b8187ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14385194.ece/ALTERNATES/s1200/EPO-president-Benot-Battistelli.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-sees-number-patent-14385138", "country": "GB", "domain_rank": 21960, "title": "North East sees number of patent applications soar as region looks to innovate", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-08T16:49:00.000+02:00", "replies_count": 0, "uuid": "7fd2dce454fa49f6dcd8b2d99815e6320b8187ea"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-sees-number-patent-14385138", "ord_in_thread": 0, "title": "North East sees number of patent applications soar as region looks to innovate", "locations": [], "entities": {"persons": [{"name": "benoît battistelli", "sentiment": "none"}, {"name": "francois lenoir", "sentiment": "none"}, {"name": "matt hale", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "greater london", "sentiment": "none"}, {"name": "tyne bridge", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "european patent office", "sentiment": "none"}, {"name": "european patent office share epo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East sees number of patent applications soar as region looks to innovate North East sees biggest percentage increase in number of patents applications filed with the European Patent Office Share EPO president Benoît Battistelli (Image: FRANCOIS LENOIR) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe number of patent applications filed in the North East soared last year, with the region achieving a higher growth rate than anywhere else in the UK. \nOfficial figures collected by the European Patent Office (EPO) found that the number of applications originating from the North East rose by 15.8% last year, after 66 applications were filed. \nThe growth rate was the highest in the UK coming in above Greater London, which increased by 10.6%, and Scotland, which grew by 9.7%. The Tyne Bridge by Matt Hale (Image: UGC TNE) \nThe figure suggests that innovation is on the rise in the region, with more businesses producing never-before-seen products and technology. \nOverall the UK saw the number of success patents increase from 2,931 to 3,116. Read More Brexit is major threat to UK automotive industry, Vauxhall boss says \nEPO president Benoît Battistelli said: “In terms of patents, 2017 was a positive year for Europe. The growing demand for European patents confirms Europe’s attractiveness as a leading technology market. \n“European companies, too, filed for more patents than ever before – evidence of their strength in innovation, and of their confidence in the EPO’s services.” Medical technician filling test tubes in a laboratory Read More Durham's Atom Bank raises £149m to support further growth \nRolls-Royce, which has a plant in Washington, was the UK’s most active patent applicant in 2017 for the third year in a row after submitting 327 applications. Unilever came in second with 222 applications while GlaxoSmithKline, which has a facility in Barnard Castle, County Durham, was the third most active, with 110 filings. \nHowever, despite the North East topping the UK table in terms of growth of patent applications, the region filed the second lowest number of patents overall. The North East’s 66 patent applications was equivalent to 1.3% of the total number filed in the UK. Read More Gateshead to become virtual reality hub with launch of 'cutting edge' R&D centre \nNorthern Ireland was the only region to file less patent applications, with 63. The East Midlands also filed a low number with 95. \nGreater London produced nearly a third of all of the country’s patent applications and after filing 1,716. It also filed the eighth highest number rof patents across all of Europe. The East of England filed the next highest number with 623. Like us on Facebook", "external_links": [], "published": "2018-03-08T16:49:00.000+02:00", "crawled": "2018-03-09T04:40:52.009+02:00", "highlightTitle": ""}