{"organizations": [], "uuid": "a92e36bb4702ad072902dc1fc73ed2f91e778ce1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1400606.ece/ALTERNATES/s1200/1-2.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/task-group-report-says-farmers-1400603", "country": "GB", "title": "Task group report says farmers need to have greater clarity about what will happen post Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-29T18:33:00.000+03:00", "replies_count": 0, "uuid": "a92e36bb4702ad072902dc1fc73ed2f91e778ce1"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/task-group-report-says-farmers-1400603", "ord_in_thread": 0, "title": "Task group report says farmers need to have greater clarity about what will happen post Brexit", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "cllr brian greenslade", "sentiment": "none"}, {"name": "daniel clark", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}], "organizations": [{"name": "task group", "sentiment": "none"}, {"name": "devon county council’s corporate infrastructure & regulatory services scrutiny committee", "sentiment": "none"}, {"name": "agriculture task group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Task group report says farmers need to have greater clarity about what will happen post Brexit The group wants clarity so farmers can plan for the future of their business Share Daniel Clark Local Democracy Reporter for Devon 16:33, 29 MAR 2018 Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAn Agriculture Task Group has said that farmers need to have greater clarity over what will happen to farm subsidies post Brexit, so that they can plan for the future of their business. \nA report, produced by the group, was discussed at Devon County Council’s Corporate Infrastructure & Regulatory Services Scrutiny Committee on Tuesday afternoon. \nPresenting the report at the meeting, chairman of the Task Group, Cllr Brian Greenslade outlining that the work highlighting the key challenges facing the agriculture industry in Devon and the recommendations asking Government to stand up for agriculture and to support Devon’s rural communities and farmers into a sustainable future had begun back in January but that the snap General Election that had been called had stopped the ball rolling. \nHe added: “It is all about recognising that life in rural community isn’t what it used to be.” Read More Katie Hopkins and Exeter MP Ben Bradshaw in Twitter spat over Brexit marches \nHe said that the task group report had been presented to MPs at the end of 2017, who had welcomed the cross-party approach and the report’s findings and recommendations, and Cllr Greenslade said that the upshot of the meeting was that Neil Parish, chairman of the Environment Food and Rural Affairs Select Committee indicated that the task group might be able to come and speak to a select committee meeting soon about the issues. \nCllr Stuart Barker, the Cabinet Member for Economy and Skills, added: “Agriculture is one of our most important sectors and provides the bedrock for our economy, and arguably will be the industry most affected by Brexit, and for the first time in a generation, policy will be decided in the UK, not Europe, so we welcome the focus on this issue.” \nThe report notes farming’s stewardship and land management role, the need to drive up agricultural productivity, improve food security, trade, as well as challenges around housing, financing and succession were all recognised as key issues for the future of farming in the South West and nationally. Read More Devon MPs calls for UK to ditch plan for French passports \nSeven recommendations were brought forward by the Task Group, being: Farmers need to have greater clarity over what will happen to farm subsidies post Brexit, so that they can plan for the future of their business. Farmers need to get a fair and consistent price for their produce, so that they can plan for the future, invest in their business and grow their industry. Post Brexit, the Government needs to support and promote positive farming practices, which will push the industry to innovate and thrive, increasing food security and selfsufficiency Agri-environment schemes need to be fit for purpose, practical and attractive to farmers, balancing farming needs alongside environmental outcomes. Young farmers and new entrants need support to fund the necessary upfront capital investment in stock, machinery and other expenses needed to begin their farm business. Affordable and flexible rural housing must be made available, to make living and working in the countryside viable for young people, and to support agricultural succession and retirement A greater public understanding of farming, food production and the contribution of agriculture to the economy, tourism and the wider public benefit needs to be established in Devon \nCllr Alistair Dewhirst, chairman of the committee, said that hopefully a lot more information and whether the recommendations could be better answered by the time the committee next meets in September when the future of farming would again be discussed. Like us on Facebook", "external_links": [], "published": "2018-03-29T18:33:00.000+03:00", "crawled": "2018-03-29T18:48:04.004+03:00", "highlightTitle": ""}