{"organizations": [], "uuid": "1c7869d8dc74af0c2db37c6063f4e284f36447e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14389936.ece/ALTERNATES/s1200/Toys-R-Us.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/toys-r-start-closing-next-14389873", "country": "GB", "domain_rank": 21960, "title": "Toys R Us to start closing next week as time runs out for shoppers to grab bargains", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-09T16:30:00.000+02:00", "replies_count": 0, "uuid": "1c7869d8dc74af0c2db37c6063f4e284f36447e5"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/toys-r-start-closing-next-14389873", "ord_in_thread": 0, "title": "Toys R Us to start closing next week as time runs out for shoppers to grab bargains", "locations": [], "entities": {"persons": [{"name": "moorfields", "sentiment": "none"}], "locations": [], "organizations": [{"name": "moorfields advisory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Toys R Us to start closing next week as time runs out for shoppers to grab bargains Administrators are winding down the toy store chain and are believed to looking at closures from next week Share A Toys R Us store (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe administrator to collapsed retailer Toys R Us is expected to begin closing stores and making staff redundant as early as next week as hopes for finding a buyer for the stricken business fade. \nThe toy chain appointed Moorfields Advisory to oversee an administration at the end of February after the firm failed to find a last-minute rescuer. \nMoorfields said it would begin an “orderly wind-down” of stores and it is now understood that the insolvency specialist is poised to close the first batch as it runs down stock, with hundreds of jobs set to be lost. \nIt is thought Moorfields will begin with the closure of at least 26 loss-making stores earmarked late last year, when Toys R Us pushed through a restructuring before its demise. \nToys R Us is one of the nation’s biggest toy retailers, employing more than 3,000 across 100 stores in the UK. \nMoorfields said at the time of the chain’s collapse that it is making “every effort” to secure a buyer for all or part of the business, but sources indicated that this was unlikely in what is proving to be a dire time for high street retailers. \nIf no buyer emerges for the business, then stores will be sold off piecemeal or closed down. \nThe retail sector has had a dismal start to 2018, with the collapse of Toys R Us and Maplin and a host of firms undergoing painful restructurings, including New Look and eateries run by celebrity chef Jamie Oliver, as well as Byron and Prezzo. \nHigh street chains across the board have been hit hard by falling consumer spending, soaring Brexit-fuelled inflation and competition from online rivals. \nToys R Us has stores in the North East at the Metrocentre, Sunderland and Stockton. Like us on Facebook", "external_links": [], "published": "2018-03-09T16:30:00.000+02:00", "crawled": "2018-03-09T17:53:58.007+02:00", "highlightTitle": ""}