{"organizations": [], "uuid": "7e46ea8845e3b17e195a9612c43a290972534060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11448538.ece/ALTERNATES/s1200/JS29893562.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14432156", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Bellway profits boosted by 'robust' housing market", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-20T10:30:00.000+02:00", "replies_count": 0, "uuid": "7e46ea8845e3b17e195a9612c43a290972534060"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14432156", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Bellway profits boosted by 'robust' housing market", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "none"}, {"name": "ocado", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "bellway homes", "sentiment": "negative"}, {"name": "bellway", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:30 Government must deliver 'proper Brexit', Rees-Mogg tells May \nTheresa May has been warned that her concessions to Brussels will only be acceptable to Tory Eurosceptics if she delivers a “proper Brexit”.Jacob Rees-Mogg, leader of the influential European Research Group of Tories, said the Government had given away too much in a “very unsatisfactory” agreement.Britain and the European Commission reached agreement on a transition deal which will allow talks on the future trade relationship to be triggered later this week.Brexit Secretary David Davis hailed the agreement as a “significant step” following talks with EU chief negotiator Michel Barnier in Brussels.But there was fury in Tory ranks amid claims that there had been a betrayal of the UK’s fishing industry and the transitional deal would leave Britain bound by rules from Brussels it no longer had a say in.Mr Rees-Mogg told BBC’s Newsnight: \nI make no bones about it, I think this transition agreement is a very unsatisfactory agreement - not just on fish. \nThe only thing that makes it acceptable is the hope that it is leading to a proper Brexit at the end of 2020. \nThis agreement gives away almost everything and it is very hard to see what the Government has got in return. \nHe added: \nSomebody said to me the Government had rolled over but had not even had its tummy tickled. Jacob Rees-Mogg (Image: PA) KEY EVENT North East firm could help haulage companies stop using diesel \nA North East firm has designed a new technology that will allow haulage companies to stop using diesel to fuel their lorries. \nWashington’s Statebourne Cryogenics has developed a mobile refuelling station that could play a major part helping the UK’s infrastructure develop an alternative fuel for large vehicles. \nThe mobile refuelling station allows haulage drivers to refuel their vehicles with liquefied natural gas (LNG), and is the only such station that can do so without releasing greenhouse gases. \nRichard Wilson, financial director at Statebourne Cryogenics, said: \nLNG is the only option for big tanks to refuel if they don’t want to use diesel. \nThe main cost of LNG is infrastructure costs, but our option is a mobile refuelling station. You don’t need planning permission for it and it has a zero release of methane gas. \nHaulage companies are searching for an alternative fuel that can be used in the UK, following the Government’s announcement that no new diesel vehicles will be sold after 2030. In the past diesel has been the only fuel source suitable for large haulage vehicles. \nAlternatives such as electric vehicles are yet to be able to power lorries for a long enough period, while liquid hydrogen fuel is considered too expensive. \nLNG is a cheaper alternative but has faced problems because storing the fuel often requires the release of methane gas, which is harmful to the environment. Two of the fuel tanks used in Statebourne Cryogenics' mobile refuelling stations (Image: NCJ Media) 9:20 Jackson Hogg Recruitment signs exclusivity deal \nJackson Hogg Recruitment has signed an exclusivity deal with a national manufacturing firm. \nThe Newcastle recruitment consultancy has signed the deal with Pryme Group, to support all of the firm’s future appointments. \nPryme Group offers a range of integrated contract and sub-contract manufacturing capabilities across the oil and gas, defence and aerospace industries. \nOn the launch of this agreement, Richard Hogg, Managing Director of Jackson Hogg Recruitment, said: \nThere is no better and more effective way to understand a company’s ethos and culture than to work in a strong exclusive relationship built on trust. \nThis approach works for companies that are looking for a recruitment partner that thoroughly understands both the technical and wider business fit for each appointment. (L to R) Jackson Hogg Director, Anthony Broadhead, Lorna Madden and Pryme Group Strategic Commercial Director, Murray Kerr 9:13 GKN claims Melrose comments about its pension schemes were 'misleading' \nGKN has said statements made on Monday by hostile suitor Melrose over its pension schemes were “misleading”. \nGKN lashed out at Melrose’s comments, claiming that its plans to inject £1 billion into the bid target’s pension scheme represented almost twice the amount under GKN’s plans to reduce the deficit in the scheme. \nJos Sclater, GKN group finance director, said: \nGKN has a clear and comprehensive plan to reduce its pension liabilities and eliminate the deficit in its UK pension schemes. \nWe have a binding agreement with the trustees which works for all stakeholders: the scheme members, the trustees and the company and its shareholders. \nA month ago, Melrose appeared to suggest that its plan to pay £150m into the pension scheme was sufficient. \nNow it appears to have unveiled a £1bn plan that would achieve less than GKN’s own agreement with the trustees, at a greater cash cost which would erode shareholder value. I think our shareholders deserve better. The GKN headquarters 9:08 Can fish and chips be a healthy choice? One North East firm believes so \nA North East company is attempting to tackle the country’s obesity crisis with an initiative to market fish-and-chips as a healthier option. \nHenry Colbeck - which supplies fish-and-chip shops with food, cleaning products, and packaging - has produced Lite-Bite boxes, which allow takeaways to offer a smaller sized portion of food to its customers. \nThe initiative also includes information to promote the nutritional benefits of fish-and-chips, such as mushy peas counting as one of people’s recommended five-a-day vegetables. \nThe company came up with the idea after it was approached by Newcastle University’s food science department, which was looking at a way to reduce obesity levels in the UK. \nJackie Pearson, head of marketing at Henry Colbeck, said: \nWe supply 2,500 fish shops and one of the issues we have is the size of portions they give away. Fish-and-chip shops are very successful at what they do, so they don’t want us to say they are doing something wrong. \nWe thought: ‘We need to tackle this a different way’. So, we looked at offering a different portion size to customers. \nThe introduction of the Lite-Bite boxes allows chip shops to offer meals that come close to 600 calories, which fits within Government nutritional guidelines for meal sizes. \nA meal consisting of a 5oz fish and 5oz of chips - fried in vegetable oil - is 654 calories. \nThe Government also recommends eating two portions of fish per week as part of a healthy diet. Fish from a fish-and-chip shop is included in this recommendation, although the NHS warns that fried and battered fish contains a higher fat content. A portion of fish and chips in a chip shop (Image: PA) 9:03 KEY EVENT North Sea production forecast to rise 5% in 2018 \nOil and gas production in the North Sea is forecast to grow by 5% in 2018, however low levels of drilling mean the outlook for future years is “much more uncertain”.The industry body Oil and Gas UK published its latest Business Outlook report, showing production in 2018 could rise to the equivalent of 620 million to 640 million barrels of oil, up from 517 million in 2014.Rising oil prices meant revenues from the sector increased from £16bn to £21bn last year, making this the first year since 2013 that the UK Continental Shelf (UKCS) generated enough cash from sales to cover expenditure.But the report highlighted a “serious concern” about the lack of drilling in the North Sea , with 94 wells started in 2017, the lowest number since 1973.“Development drilling has fallen by around 45% in just two years, which is a particularly worrying trend for the future health of the basin,” the report warned.While Oil and Gas UK said a 5% increase in production was expected in 2018, it stressed the future outlook for the sector was “heavily dependent on new fields coming onstream as planned and continued effective management of production efficiency on existing assets”.The report went on: \nThe production outlook for the basin is much more uncertain post-2019. The lack of new project approvals and the recent low level of development drilling in the last few years, means it is likely that the UKCS will return to a position of production decline during the early 2020s. An oil rig in the North Sea (Image: PA) 8:58 Michelin to buy Fenner in £1.2bn deal \nFrench tyre maker Michelin has struck a deal to acquire British manufacturer Fenner in a £1.2bn deal.The groups announced the deal after market close on Monday, with Michelin to shell out 610p per Fenner share, a 31% premium to the FTSE 250 firm’s closing price on March 16.Fenner, based in Hessle in East Yorkshire, manufactures conveyor belts and reinforced polymer products for mining and industrial markets.It raked in £655 million in revenue last year and Michelin said the deal could unlock £30 million in annual cost savings through processing efficiencies and leveraging R&D skills.Michelin boss Jean-Dominique Senard said: \nMastering high-technology materials is key to creating value in the coming years. \nThe acquisition will enable Michelin to accelerate its growth in this area, and to strengthen its position as a key player in the recovering mining markets with a comprehensive offering. \nFenner’s directors said they believe the offer to be fair and reasonable and unanimously recommend shareholders accept the deal.The company’s chairman Vanda Murray said: \nFenner has successfully established itself as a world leader in reinforced polymer technology and the board remains confident that Fenner’s existing strategy would deliver significant value for Fenner shareholders as an independent company. \nHowever, we also believe that the terms of the acquisition acknowledge the quality of Fenner’s businesses and the strength of its future prospects, and as such the board intends to recommend unanimously the acquisition to Fenner shareholder Tyres in the snow 8:50 Carpetright and Claire's Accessories hit by crisis on the High Street \nThe US company behind Claire’s Accessories has filed for bankruptcy protection as part of a move to reduce its debt by $1.9bn. \nClaire’s Stores said on Monday its shops, including 378 in the UK, will remain open as it presses ahead with a financial restructure. \nIt will see lenders including Elliott Management and Monarch Alternative Capital inject $575m of fresh cash into the group. \nClaire’s is owned by private equity firm Apollo Global Management, which paid $3.1bn for the company in 2007. \nRon Marshall, Claire’s chief executive, said: \nThis transaction substantially reduces the debt on our balance sheet and will enhance our efforts to provide the best possible experience for our customers. \nWe will complete this process as a healthier, more profitable company, which will position us to be an even stronger business partner for our suppliers, concessions partners, and franchisees. \nClaire’s is the latest US retailer to run into trouble. Toys R Us announced last week that it would close its stores in the UK after going bust. \nBut Claire’s expects to emerge from bankruptcy in September and the retailer’s international subsidiaries are not part of the US filing. \nAlso in the retail sector, shares in Carpetright have plunged on reports the struggling retailer may close stores and axe jobs as it pieces together a rescue plan. \nIt is understood the group could go down the route of a company voluntary arrangement, which would allow to it to shut loss-making stores and secure deep discounts on rental costs. Claire's Accessories (Image: Collect Unknown) 8:45 \nThe FTSE-100 index at 8:15am was up 27.26 at 7070.19. \nThe pound at 8am was 1.4051 dollars compared to 1.4039 dollars at the previous close. \nThe euro at 8am was 0.8785 pounds compared to 0.8783 pounds at the previous close. 8:40 KEY EVENT Bellway profits boosted by 'robust' housing market \nHousebuilder Bellway has cheered a double-digit rise in profits as Britain’s “robust” housing market helped it sell more homes at a higher price.Pre-tax profits jumped 17% to £288.7m for the half-year, as the number of homes sold ticked 6% higher to 4,741.Revenues were also bright, climbing 15% to £1.3bn for the six months ending in January thanks to 7% growth in the average selling price at £275,945.Bellway, which employs around 2,000 people across the UK, hiked its interim dividend by 28% to 48p per share.The FTSE 250 firm said it expected volumes to pick up by around 600 homes at year-end, helping it reach an all-time high of 10,000 new homes per year.The update comes after Berkeley Group saw its share price take a hammering on Friday after the FTSE 100 rival spooked investors by failing to ramp up production.Berkeley, one of Britain’s biggest housebuilders, said “prevailing economic uncertainty” were factors that meant it was “unable to increase production beyond the business plan levels”.Prime Minister Theresa May moved to tackle Britain’s housing crisis in major speech earlier this month when she laid blame on some housebuilders for sitting on land that is ripe for development.John Watson, Bellway executive chairman, said it was a “strong” half-year performance for the Newcastle-based group.He said: \nThe group has invested significantly in land to achieve future growth, in a market place in which customer demand is robust and mortgage availability remains good. \nThis positive trading environment, together with a substantial order book, bodes well for the full year and should enable the group to complete in excess of 10,000 new homes. \nThe firm said operating margins improved to 22.2% for the six-month period, with forward order books up 7% to £1.5bn.Bellway said the Government’s Help to Buy scheme, coupled with stamp duty relief for first-time buyers, was keeping the housing market active.It also shrugged off Brexit, saying customer confidence was “seemingly unaffected by the ongoing uncertainty surrounding the forthcoming exit from the EU”.While the London housing market has proved a sticking point for some developers, Bellway sold 259 more homes at 560 for the half-year.It said: \nDemand in the capital is most pronounced at and around this affordable price point, where Bellway focuses its operations. Bellway Homes development - Five Mile Park in Wideopen More On", "external_links": [], "published": "2018-03-20T10:30:00.000+02:00", "crawled": "2018-03-20T10:37:07.000+02:00", "highlightTitle": ""}