{"organizations": [], "uuid": "c70fd255260151c2e7d79665e06bf4dc5d4d151f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article459274.ece/ALTERNATES/s1200/Ben-Bradshaw-2PNG.png", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/news-opinion/facebook-cambridge-analytica-scandal-raises-1393967", "country": "GB", "title": "Facebook and Cambridge Analytica scandal raises awkward questions about legitimacy of the Brexit Referendum", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-28T14:48:00.000+03:00", "replies_count": 0, "uuid": "c70fd255260151c2e7d79665e06bf4dc5d4d151f"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/news-opinion/facebook-cambridge-analytica-scandal-raises-1393967", "ord_in_thread": 0, "title": "Facebook and Cambridge Analytica scandal raises awkward questions about legitimacy of the Brexit Referendum", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "brexit referendum facebook and cambridge analytica", "sentiment": "none"}, {"name": "facebook and cambridge analytica", "sentiment": "none"}, {"name": "erendum facebook and cambridge analytica", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook and Cambridge Analytica scandal raises awkward questions about legitimacy of the Brexit Referendum Facebook and Cambridge Analytica scandal raises awkward questions about legitimacy of the Brexit Referendum Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nBEN BRADSHAW IS THE LABOUR MP FOR EXETER AND HAS BEEN SINCE 1997 \nConstituents occasionally contact me via Facebook to ask for my help with a problem. I can understand why. It’s quick, easy and Facebook messenger is the communication of choice for millions. \nFor several years now, I’ve had a policy of writing back to ask them to put the details of their problem – often very personal – in an email or letter or to phone my office instead. The reason, I explain, is because I’m not confident Facebook is private or secure. \nThis was more an instinct on my part, than an informed suspicion, combined with a more general concern I have about people’s willingness to share some of their most intimate personal details or those of their family on social media. Ben Bradshaw after increasing his majority in May \nI have also had concerns for some time, which I have repeatedly raised in Parliament – about the use, or rather misuse, of people’s personal data for covert political campaigning and the impact that could have on our democracy. Read More After the Cambridge Analytica Facebook data grab: how to stop the conspiracy to undermine our democracy \nSo, shocking as the revelations about Facebook and Cambridge Analytica have been, I am not surprised. \nBecause I believe this issue is so important to the security and integrity of our electoral system and our democracy I sat through the nearly four hours of evidence before Parliament this week from the Vote Leave and Cambridge Analytica whistle blower, Christopher Wylie. \nOne veteran BBC parliamentary journalist described it as the most astounding evidence session he had ever witnessed. Read More The advantages of a Exeter city centre site for pool and bus station are obvious \nMr Wylie alleges that Aggregate IQ, a sister company in Canada of Cambridge Analytica, which stands accused of unlawfully harvesting Facebook data from tens of millions of users, micro-targeted millions of selected voters in Britain during the Referendum campaign. Vote Leave spent 40% of its total budget on this data company. Cambridge Analytica whistleblower Christopher Wylie gives evidence to the House of Commons Digital, Culture, Media and Sport Committee's inquiry into fake news (Image: PA Wire) \nFurthermore, Mr Wylie, who is and was a Leave supporter, accuses the Leave campaign of setting up several shadow campaigning organisations to get round legal spending limits and that these organisations also paid for Aggregate IQ’s services. Mr Wylie told the Commons Digital and Media Select Committee that Aggregate IQs targeting campaigns generally succeeded in shifting the opinions of between 7% and 10% of those targeted. You don’t need to be a mathematician to work out this could have affected what was a very close result. \nIndeed, Dominic Cummings, the man who ran the Leave campaign, boasted after the result that Leave would not have won without the help of Aggregate IQ. Read More Politics in Britain today is a cracked tea-cup \nThis poses serious questions for our elections regulator, the Electoral Commission, our data regulator, the Information Commissioner and, potentially, the police. People who have already checked have been alarmed at the amount of information that has been logged by Facebook \nIt is already clear to me that our regulators have neither the power nor the resources they need to protect our democracy from manipulation. Just look at the farce of the Information Commissioner spending a week before finally getting a warrant to search Cambridge Analytica’s office, when Facebook themselves had been to their offices within hours of the scandal breaking. Read More \nBut Ministers too need to take this problem more seriously than they have. Indeed, everyone who cares about our democracy should, however awkward that might be in terms of raising questions about the legitimacy of the Brexit Referendum result. Like us on Facebook ", "external_links": [], "published": "2018-03-28T14:48:00.000+03:00", "crawled": "2018-03-28T15:15:36.020+03:00", "highlightTitle": ""}