{"organizations": [], "uuid": "c793669195feb0e6fef2084597688b3700d07560", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1333003.ece/ALTERNATES/s1200/the-flagpole-2877540_1280.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/britain-under-attack-russia-says-1333017", "country": "GB", "title": "Britain is 'under attack' by Russia, says Devon MP", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-13T14:07:00.000+02:00", "replies_count": 0, "uuid": "c793669195feb0e6fef2084597688b3700d07560"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/britain-under-attack-russia-says-1333017", "ord_in_thread": 0, "title": "Britain is 'under attack' by Russia, says Devon MP", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "sammy wilson", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "neil shaw", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "sergei skripal", "sentiment": "none"}], "locations": [{"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "salisbury", "sentiment": "none"}, {"name": "east antrim", "sentiment": "none"}], "organizations": [{"name": "plymouth moor view", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Britain is 'under attack' by Russia, says Devon MP \"It's clear this sovereign United Kingdom has come under attack from another state.\" Share Neil Shaw Head of Digital 12:07, 13 MAR 2018   Thank you for subscribing!   \nA Devon MP says the United Kingdom is 'under attack' by another state and has described 'political point-scoring' over the current crisis as 'shameful'. \nJeremy Corbyn's policy to seek \"robust dialogue\" with Russia will encourage Vladimir Putin to \"engage in further acts of state-sponsored terror\", MPs have heard. \nThe DUP's Sammy Wilson (East Antrim) made the claim after the Labour leader was heckled and criticised for his response to the Prime Minister's statement on the attack on Sergei Skripal and his daughter in Salisbury. \nMr Corbyn faced shouts of \"shame\" and \"disgrace\" from Tory MPs after raising questions about donations from Russian oligarchs to the Conservative Party. \nConservative MP Johnny Mercer (Plymouth Moor View) said: \"I think I've just seen - and I look at my honourable friend opposite as I say this - the most shameful moment in this House of Commons in my time to date. \n\"It's clear this sovereign United Kingdom has come under attack from another state.\" Read More Russian spy critically ill after 'being poisoned' in Westcountry \nMr Corbyn also faced implicit criticism from some of his backbench MPs for appearing to make party political points. \nSpeaking in the Commons, Mr Corbyn condemned the \"deeply alarming attack\" and said the events in Salisbury had \"appalled the country and need thorough investigation\". \nHe also said: \"We need to continue seeking a robust dialogue with Russia on all the issues dividing our countries, both domestic and international - rather than simply cutting off contact and simply letting tensions and divisions get worse, and potentially even more dangerous.\" \nMr Corbyn was heckled by angry Tory MPs as he told the Commons: \"We're all familiar with the way huge fortunes, often acquired in the most dubious circumstances in Russia, sometimes connected with criminal elements, have ended up sheltering in London and trying to buy political influence in British party politics. Read More George Galloway in bizarre rant against 'Blair babe' Ben Bradshaw \n\"Meddling in elections, as the Prime Minister put it, and there has been over £800,000 worth of donations to the Conservative Party from Russian oligarchs and their associates.\" \nMr Wilson later said there needed to be \"robust action\" against those using the UK as a battleground. \nHe asked: \"Does the Prime Minister agree that in the face of yet further aggression from the Russian Mafia state, that the policy of the Leader of the Opposition to engage in robust dialogue will only encourage Putin to engage in further acts of state-sponsored terror?\" \nMrs May said she agreed \"we need to ensure we do, in fact, respond robustly to this matter\". \nShe added: \"We need to do so with careful consideration of the assessments that have been made and the information that is available to us, and that is exactly what the Government is doing. \n\"I think nobody in this House should be in any doubt that there can be no suggestion of business as usual in relation to our interaction with Russia.\" \nConservative Tom Tugendhat, chairman of the Foreign Affairs committee, said: \"This, if not an act of war, was certainly a warlike act by the Russian Federation and this is not the first we've seen. Read More Ann Widdecombe on Brexit, Boris, Mogg, Trump, the NHS and why Anton should have replaced Bruce Forsyth on Strictly Come Dancing \n\"While some in this House have stayed silent and decided to join the information warfare that that state is conducting against us and our allies, we have seen them invade countries in the east, attack allies, attempt to kill prime ministers and even now they are backing the murderous Assad regime which (thinks) nothing in gassing its own people. \n\"And (Mr Corbyn) stays silent.\" \nLabour former minister Chris Leslie also told MPs: \"There are certain circumstances, as (Mrs May) knows, that we take party political differences of opinion. \n\"But when our country is potentially under attack, that is just not appropriate.\" \nMrs May, in her reply, said of matters involving what another state may have done on British soil: \"That should be a matter that would concern all of us and should be above party politics.\" \nFellow Labour MP John Woodcock (Barrow and Furness) drew cheers from the Tory benches after praising Mrs May's response. \nHe said: \"The level of resilience voiced by the Prime Minister in the chamber today has been many years in coming but it is hugely welcome. \n\"Indeed it would put our national security at significant risk if we were led by anyone who did not understand the gravity of the threat which Russia poses to this nation.\" Like us on Facebook", "external_links": [], "published": "2018-03-13T14:07:00.000+02:00", "crawled": "2018-03-13T14:32:00.001+02:00", "highlightTitle": ""}