{"organizations": [], "uuid": "9685dbe0c517b8573a82f965f158f2621d3be99f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1304438.ece/ALTERNATES/s1200/own-brand.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/whats-on/shopping/lidl-save-money-tips-shopping-1304796", "country": "GB", "domain_rank": 48128, "title": "Lidl shoppers can save money by following these 15 tips - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.235, "site_type": "news", "published": "2018-03-17T07:00:00.000+02:00", "replies_count": 0, "uuid": "9685dbe0c517b8573a82f965f158f2621d3be99f"}, "author": "David Bentley", "url": "https://www.leicestermercury.co.uk/whats-on/shopping/lidl-save-money-tips-shopping-1304796", "ord_in_thread": 0, "title": "Lidl shoppers can save money by following these 15 tips - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "lidl", "sentiment": "negative"}, {"name": "birminghamlive", "sentiment": "none"}, {"name": "david bentley", "sentiment": "none"}], "locations": [{"name": "lidl", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "leicester mercury lidl", "sentiment": "negative"}, {"name": "lidl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lidl shoppers can save money by following these 15 tips These could help you save a few quid Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nIf money is too tight to mention then forgive us. \nBut if you want to know how to shop at Lidl and take full advantage of the money-saving offers then read on. \nThe German budget-busting chain is winning over more and more fans and goes from success to success. \nLatest figures - for the three months up to the end of January 2018 - show Lidl has retained its title of the UK's fastest growing retailer. \nIn 2017, it was named Britain's seventh biggest supermarket by market share, overtaking Waitrose. \nThere are now more than 690 Lidl stores in the UK since the first one opened here in 1994. \nSo what does it offer and why is it growing in popularity so much? \nBirminghamLive decided to investigate and do a weekly shop there - and this is what we discovered. \n1) Stores are relatively small (Image: David Bentley) \nMany of the big supermarket retailers have vast superstores where you need a huge trolley as you traipse up and down the aisles looking for what you want - and being tempted by things you didn't really need. \nBut not Lidl. Their stores are relatively small - between 14,000 and 26,500 sq ft whereas Tesco has dozens of sites larger than 80,000 sq ft. \nThis has the advantage of cutting the time you spend in there as well as the amount you spend. Double win! \nAfter all, who wants to spend hours on a major expedition in a supermarket? On the downside, smaller stores tends to mean smaller car parks, but we've never heard complaints about parking problems. \n2) Each store has a bakery \nIn January 2012, Lidl launched in-store bakeries at its supermarkets across Europe. The breads and pastries are displayed at the front in baskets for you to pick up (use the tongs!) and put in a bag. \nThere's no bakery in an Aldi store and so this move by Lidl is a welcome distraction from the preconceived notion of budget stores being little more than warehouses shipping in crates of cheap goods. \nWe saw croissants for 35p, rolls for 15p, apple turnovers for 59p, scones for 29p and white bloomer loaves for £1. \n3) Prices can be amazingly cheap \nAround 90 per cent of the products at Lidl are own-label brands specifically made for the company. \nThat means Lidl can control manufacturing costs and cut out supply costs, so it can charge less and still make more profit than it does on big-name brands. \nFor instance, we found W5 dishwasher tablets priced at just £2.95 for a pack of 60 - and they had been reduced to just £1.99 in one recent weekend discount event. That compares to £7 for 60 tablets in Tesco's own brand and £7 for 60 tablets made by Finish. Read More Melton Mowbray pork pies, Leicestershire cheese and Rutland beer under threat if US gets its way post-Brexit \nBut you will still find some well-known makes on the shelves and Lidl has actually seen the fastest growth in sales of these branded goods - thanks in part to special deals such as January's first ever Big 99p event that saw major brands like Walkers, Cadbury, Uncle Bens, Heinz and HP on offer at that price. It looks like Lidl is shifting its focus a little to appear more upmarket, while still keeping its original aim to be a discount store. \n4) The own-label brands have won awards (Image: David Bentley) \nAnnual taste test awards organised by The Grocer compare big makes with own-brand products from Lidl and other supermarkets. \nThe 2017 awards for Lidl brands went to such items as pulled pork, slow-cooked lamb, piri piri chicken, cheeses, fishcakes, truffles, cookies, apple juice, smoked salmon and popcorn. \nSo food labels with brands you’ve never heard of doesn’t necessarily mean inedible rubbish destined for your bin. \nAwards also went to products from The Co-Op, Aldi, M&S, Morrisons, Asda , Iceland and Tesco and it's clear that all the supermarkets are upping their game with own-label products, which are no longer just inferior imitations. \nIf the taste is good and the price is less, it's got to be worth a try. \n5) Products are displayed in the original boxes (Image: David Bentley) \nMost of the goods at Lidl are displayed in the boxes they arrived in. That means it's easier to restock and doesn't need as much manpower to transfer items on to shelving. \nOkay, so the downside is that this does make stores look pretty basic and a bit like a warehouse at times. Depends if you want your weekly shop to be a visually dazzling experience or are happy to grab what you want and move on to the next item on to your list. \n6) But beware the labelling (Image: David Bentley) \nJust like Aldi, some Lidl price labels are on the shelf above, not directly beneath the product as in most supermarkets. \nSo don’t get caught out. It’s not always immediately obvious what price is for what item, especially in a section where the same kind of product is being displayed. \nIn the picture here, you can see wholemeal bread but it is not priced at 45p despite the price label next to it. The price for this bread is actually 79p and that is displayed high above. \n7) It's top for fresh flowers (Image: David Bentley) \nLidl was named Fresh Flower Retailer of the Year in the Retail Industry Awards 2017. \nWhile the selection will depend on the size of the store, there are great-value flowers to be found here. The Valentine’s Day roses are a good example. And there are lots of pot plants too. \nLike the in-store bakery, this is another indication of Lidl providing something a little more upmarket to rival the offerings of the big grocery firms. \n8) There are loads of limited offers (Image: David Bentley) \nAldi has its infamously tempting Special Buys aisles and at Lidl there are lots of equivalent sections marked While Stocks Last, usually with an orange label. Read More Lidl sells tasty Easter treat with new twist on traditional favourite \nYou'll find clothes, shoes, kitchen gadgets, fitness equipment, and tons more, all with limited availability and in many ways similar to the Aldi offering. The Vileda robotic duster (£19.99) caught our eye and would appeal to those who want to slouch on the couch while a machine goes up and down the room doing the housework. \n9) And they include deals on food too (Image: David Bentley) \nAldi's Special Buys does include a few food items - we've occasionally spotted jars of cooking sauces - but it's mostly clothes and homeware. \nLidl, however, has loads of food items in its While Stocks Last sections, including cheese, gammon, smoked salmon, fruit juice, pasta and sausages when we were last there. \nThese offers tend to be mostly on aisles at the far end of the store but it might be worth looking there first to see if anything on your list can be found at a knockdown price. \nFor instance, we had picked up some cleaning products from the regular displays only to find even cheaper versions in these special offer sections, so we had to go and put the others back. \n10) You can get more luxury items (Image: David Bentley) \nIf you want to pretend you're in M&S or Waitrose for a second and add some fancier foods to your trolley, then treat yourself to something from the Deluxe range like these chicken, wild mushroom and tarragon pies. \nThe regular chicken pies sound just as nice and it would be interesting to see how different the Deluxe products really tasted. Hopefully it's not just posh packaging you're paying for. Have you done a comparison? If so, let us know. \n11) And there are health foods too (Image: David Bentley) \nAlternative/health foods do exist in Lidl stores but they are not plentiful or obvious. There's no dedicated 'Free From' section so you have to hunt around as you shop. \nWe found a small display of soya drink. The cartons are priced 59p, the same as the version at Aldi (who also offer almond drinks too). \nAt one time, budget-priced soya milks were watery and horrible but these days they are perfectly okay and even Tesco does an Everyday Value soya at the same price of 59p. \nFor the vegetarians, there's an exclusive meat-free range including cauliflower burgers. (Image: David Bentley) \nWe also found some smoothie kits in the freezers, packed with portions of superfoods such as goji berries and flax seeds to give you energy and vitality. \nAnd if Greek yoghurt is one of your favourites, there's a coconut version at Lidl that is excellent for using in curry. \n12) Breakfast is cheap as well (Image: David Bentley) \nThe hectic pace of modern life often means grabbing a quick breakfast - or at least one that can be made easily. \nPorridge pots are one great option - just add hot water and you're good to go. Aldi has the Harvest Morn pots for just 35p in original and golden syrup versions, while at Lidl we found the Oatlicious brand at 39p in the same flavours PLUS an apple and blueberry variety costing a bit more at 45p. Read More Toilet charges at major UK train stations to be removed \nTo save more money get the boxes containing packets of oats in handy meal portions (89p for Lidl's box of 8 sachets in apple and blueberry flavour, compared with Tesco's box of 10 sachets for £1), though you'll also need milk and a microwave. \nBest value of all (but not as convenient as pots or sachets) is a box of loose oats, costing £1.49 for 750g. You just need to pour out your own measures each day. For comparison, a box of oat sachets from Lidl weighs 288g. \nWhichever you go for, it's very good value. Quaker's Oat So Simple porridge pots at other supermarkets cost £1, and the M&S variation is about the same price or a bit more. So you're making a big saving. \n13) Toiletries might seem limited (Image: David Bentley) \nAnother similarity to Aldi is the small section of toiletries, at the end of one side of an aisle. Don't expect anything special here. \nBut it seems perfectly adequate for everyday needs, with toothpaste, toothbrushes, shower gel, deodorant and other bathroom requirements. \n14) But there's some amazing bargains to be found (Image: David Bentley) \nWe did spot some real bargains in the toiletries section. Replacement razor blades can be pricey but we saw packs by Cien (a Lidl own-brand) containing a razor and 25 blades for just £3.69. \nSupplements are also pretty cheap if you are a vitamin enthusiast. Made by Minavit, most were 99p, with some at 75p and a few (omega 3, chewable vitamin C) at £1.29, along with glucosamine at £1.99. Aldi has a comparable range made by Activ-Max. These can be a far cheaper option than at dedicated health shops. \n15) There's even an online photo service \nLidl didn't just branch out into having its own bakery. It launched Lidl Movies in 2009 and it became the cheapest online DVD rental service but sadly that went into liquidation two years later. \nAnother sideline is the online photo service launched in August 2013. Lidl Photos offers prints, photo albums and can even put your pictures on to mugs, cushions, T-shirts and shower curtains. Like us on Facebook ", "external_links": [], "published": "2018-03-17T07:00:00.000+02:00", "crawled": "2018-03-17T08:26:23.007+02:00", "highlightTitle": ""}