{"organizations": [], "uuid": "032f9fa7f35b8610411404254adcb98b4f52ea82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14462228.ece/ALTERNATES/s1200/image1.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-anti-semitism-row-asked-14462085", "country": "GB", "domain_rank": 21960, "title": "Labour anti-Semitism row: We asked MPs if the party has an issue with Jews and this is what they said", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-27T14:44:00.000+03:00", "replies_count": 0, "uuid": "032f9fa7f35b8610411404254adcb98b4f52ea82"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-anti-semitism-row-asked-14462085", "ord_in_thread": 0, "title": "Labour anti-Semitism row: We asked MPs if the party has an issue with Jews and this is what they said", "locations": [], "entities": {"persons": [{"name": "wansbeck", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "lavery", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle north", "sentiment": "none"}, {"name": "invalid email  labour", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour must take “decisive, unambiguous and swift action” to fight anti-Semitism within the party, according to a Newcastle MP. \nCatherine McKinnell, Labour MP for Newcastle North, said: “It is also completely wrong to try and dismiss genuine and deeply held concerns on this issue as some sort of smokescreen or plot.” \nShe was one of a number of North East MPs to concede that there had been cases of prejudice against Jews within the party. \nNewcastle East MP Nick Brown, Labour’s Chief Whip, said there was “clearly an issue to be dealt with” but stressed that Labour was firmly committed to stamping it out. \nAnd Labour Chair Ian Lavery, MP for Wansbeck, said anti-Semitism “is a problem within the party” but said he was “absolutely confident” that the party was dealing with the issue. \nMr Lavery said Labour leader Jeremy Corbyn hoped to meet Jewish community leaders “in the next few weeks” to discuss their concerns. \nBut another MP suggested some people within the Labour Party were exaggerating the problem. A demonstrator holding a painting saying \"For the many not the Jew\", as people protest against anti-Semitism in the Labour party (Image: PA) \nIan Mearns, Labour MP for Gateshead, said: “There are people in our party who for their own political reasons are deliberately conflating people who are opposed to the current Israeli state regime as being anti-Semitic.” \nMr Corbyn has promised that Labour will carry out “a programme of political education to increase awareness and understanding of all forms of anti-Semitism”. \nIn a letter to Jewish community leaders, he said: “The Labour Party has always opposed anti-Semitism, old and new, and always will. We are proud of our deep historical links with Jewish communities, and to have fought alongside generations of Jewish men and women against fascism, prejudice and discrimination. \n“This is a part of our common heritage from which we will never be separated. But I acknowledge that anti-Semitic attitudes have surfaced more often in our ranks in recent years, and that the Party has been too slow in processing some of the cases that have emerged. \n“Early action has nevertheless been taken, and we will work to speed up procedures, to deal with cases of anti-Semitic abuse or attitudes. \n“I am committed to making our Party a welcoming and secure place for Jewish people. Zero tolerance for anti-Semites means what it says, and the Party will proceed in that spirit.” A protester blows through a shofar during a demonstration in Parliament Square against anti-Semitism in the Labour Party (Image: Getty Images Europe) \nBut some critics say he has been too slow to act. \nNick Lowles, chief executive of anti-fascist organisation Hope not Hate, said in a blog post there had been “a series of blunders concerning anti-Semitism and Holocaust deniers that have dogged his leadership”. \nThe latest row comes after it emerged Mr Corbyn questioned the decision to remove an anti-Semitic mural which showed Jewish bankers playing monopoly on the backs of the poor. The claim that Jews secretly control the world through control of banks is a common anti-Semitic theme. \nMr Corbyn has said that he did not realise the mural was anti-Semitic when he made the statement. \nHe said this weekend: “I sincerely regret that I did not look more closely at the image I was commenting on, the contents of which are deeply disturbing and anti-Semitic.” What North East Labour MPs say \nMP Catherine McKinnell said: “It is absolutely right that Jeremy has apologised for the pain that anti-Semitism within the Labour Party has caused. \n“But words are not enough, we need to see decisive, unambiguous and swift action taken by Labour against any form of anti-Semitism. \n“It is also completely wrong to try and dismiss genuine and deeply held concerns on this issue as some sort of smokescreen or plot. If people don't see the problem, that is even more reason to listen to those raising the concerns, rather than seeking to undermine them. \n“The Labour Party is nothing if it cannot stand up against discrimination and racism, in all of its ugly forms.” Catherine McKinnell (Image: newcastle chronicle) \nIan Lavery said: “Anti-Semitism obviously is a problem within the party, however I’m absolutely confident that the party are robustly tackling the issue.” \nMr Lavery highlighted statements issued by Mr Corbyn in which Mr Corbyn had said there were “pockets of anti-Semitism in the party which we must stamp out”. \nAnd the Leader’s Office hoped that a meeting with the Board of Deputies of British Jews and Jewish Leadership Council, which represent much of the UK’s Jewish community, ”will take place in the next few weeks”. \nMr Lavery said: “The Leader’s Office including Jeremy himself has regular dialogue and indeed meetings with the Jewish Labour Movement, Hannukah reception.” \nHe said the party was committed to implementing the findings of a report by Shadow Attorney General Shami Chakrabarti into anti-Semitism. \n“The Labour Party remains committed to full implementation of the Chakrabarti Report which has not yet been fully implemented.” \nJennie Formby, Labour’s new General Secretary, was committed to dealing with anti-Semitism, said Mr Lavery. \n“The new General Secretary has made clear she fully supports Jeremy Corbyn’s statement and looks forward to working with him, with Jewish organisations and with the National Executive Committee [of the Labour Party] to ensure our complaints and disciplinary procedures are robust, transparent and fair. There is no place for anti-Semitism within our Party.” Read More Should we pay more tax to fund our collapsing NHS? MPs issue warning to Theresa May \nNick Brown:“We have a large number of policies about anti-Semitism. \n“There is clearly an issue to be dealt with. Our position is clear. We do not tolerate anti-Semitism. \n“There is a procedure in place to deal with anti-Semitism. There is no place for it in the Labour Party.” \nIan Mearns said that he had a large Jewish community in his constituency, and had not received complaints about anti-Semitism. \nGateshead is home to an Haredi community who practice what is sometimes described as orthodox form of Judaism. \nMr Mearns said: “I have a very big Haredi Jewish community, and some are members of the party. \n“None of them have said to me that it is happening here. Read More The Brexit EU referendum promises that came true - and the ones that didn't \n“One thing I would say, which I think is important - there are people in our party who for their own political reasons are deliberately conflating people who are opposed to the current Israeli state regime as being anti-Semitic. \n“My answer to that is that I am a Labour party member and MP. I oppose Theresa May, as I oppose David Cameron and George Osborne. But that doesn’t mean I am anti-British, and opposing [Israei Prime Minister] Benjamin Netanyahu does not mean I am anti-Israeli or anti-Semitic.” \nHe stressed he was firmly opposed to anti-Semitism. “If we get any real evidence of people who are carrying out and espousing anti-Semitic views, then they need to be dealt with.” Like us on Facebook", "external_links": [], "published": "2018-03-27T14:44:00.000+03:00", "crawled": "2018-03-27T18:07:08.015+03:00", "highlightTitle": ""}