{"organizations": [], "uuid": "ecdc1c34ea664942fc6c63780661dd9b5ad33310", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14442920.ece/ALTERNATES/s1200/ruemain.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/de-la-rue-workers-bring-14468461", "country": "GB", "domain_rank": 21960, "title": "De La Rue workers bring the fight to save their jobs to Westminster", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-28T18:00:00.000+03:00", "replies_count": 0, "uuid": "ecdc1c34ea664942fc6c63780661dd9b5ad33310"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/de-la-rue-workers-bring-14468461", "ord_in_thread": 0, "title": "De La Rue workers bring the fight to save their jobs to Westminster", "locations": [], "entities": {"persons": [{"name": "westminster de la rue", "sentiment": "negative"}, {"name": "de la rue", "sentiment": "negative"}, {"name": "westminster", "sentiment": "none"}, {"name": "liz twist", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "dutch-french", "sentiment": "none"}, {"name": "uk share de la rue", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "westminster gateshead", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "gemalto", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "De La Rue workers bring the fight to save their jobs to Westminster Gateshead workers, MPs and union leaders insist passport production must stay in the UK Share De La Rue in Gateshead, which has lost the contract to make British passports (Image: Daily Mirror) Share Get daily   Thank you for subscribing! Could   \nDe La Rue workers have taken the fight to save their jobs to Westminster as Prime Minister Theresa May was urged to ensure passport production remained in Gateshead. \nStaff from the site joined representatives of trade union Unite at a protest outside the House of Commons. \nDe La Rue is a firm specialising in official paper products such as stamps, banknotes and passports. It currently produces UK passports at its Gateshead site, but the Government looks set to award the 11-and-a-half year contract to Dutch-French firm Gemalto. \nIt’s likely to mean the new post-Brexit blue British passports are manufactured in France. How a British passport will look after Brexit (Image: PA) \nA number of North East MPs joined the workers while Blaydon MP Liz Twist took up their case inside the House of Commons. \nShe asked Prime Minister Theresa May to guarantee MPs would have a chance to discuss the issue before any firm decision was made. \nMrs May told her: “I understand that the final decision has not been taken, but a preferred bider has been announced. \n“There is then a proper process which gives a length of time for challenges to that to be bought forward by others in the process, and the Home Office is following exactly the right process to ensure we have secure passports that are produced on a basis that gives good value to the taxpayer.” \nMs Twist then met workers and union leaders outside, where she was joined by a number of North East MPs including North Durham MP Kevan Jones, North Tyneside MP Mary Glindon, Bishop Auckland MP Helen Goodman, Sedgefield MP Phil Wilson, Easington MP Grahame Morris, Newcastle Central MP Chi Onwurah and others. Blaydon MP Liz Twist at De La Rue on Team Valley Trading Estate (Image: Newcastle Chronicle) \nThere are 200 staff employed in passport production at Gateshead but Louisa Bill, National Officer for trade union Unite, said losing the contract could mean the entire site was no longer viable, potentially putting 600 jobs at risk. \nShe said: “We are asking the Government to change their minds and award the bid to De La Rue.” \nSome MPs have insisted that De La Rue should simply accept it lost the contract to produce the passports. Read More Northumberland MP urges parents at troubled Berwick Academy to talk to her in confidence \nSpeaking earlier in the week, Conservative former cabinet minister Ken Clarke earlier urged the Government to ignore “nationalist nonsense” over the passport decision, adding there has been a “slightly childlike, jingoistic element” to the debate over passports from the moment it began, including on the colour. \nHe described De La Rue as a “very successful British company which wins fair, international, tendered contracts” and said: “When we negotiate trade agreements, we will be pressing other countries to open up their public procurement processes to genuine, fair, international competition. Read More Homes and businesses in Northumberland to be protected from flooding thanks to £6.5m cash injection \n“And it’d be totally ridiculous to abandon that principle now in order to give in to constituency pressures, which I understand, and otherwise nationalist nonsense which ought to be ignored.” \nBut union leaders point out that countries such as France never allow their passports to be produced elsewhere. Like us on Facebook", "external_links": [], "published": "2018-03-28T18:00:00.000+03:00", "crawled": "2018-03-28T21:22:45.027+03:00", "highlightTitle": ""}