{"organizations": [], "uuid": "58bde1eef0e97f85a4485456debc3334031d0093", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14455901.ece/ALTERNATES/s1200/image1.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/lord-adonis-brexit-would-calamitous-14455833", "country": "GB", "domain_rank": 21960, "title": "Lord Adonis: 'Brexit would be calamitous for Tyneside - but young people CAN stop it'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-25T19:39:00.000+03:00", "replies_count": 0, "uuid": "58bde1eef0e97f85a4485456debc3334031d0093"}, "author": "Ian Johnson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/lord-adonis-brexit-would-calamitous-14455833", "ord_in_thread": 0, "title": "Lord Adonis: 'Brexit would be calamitous for Tyneside - but young people CAN stop it'", "locations": [], "entities": {"persons": [{"name": "adonis", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew adonis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jacob rees-mogg", "sentiment": "none"}], "locations": [{"name": "tyneside", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \n‘It is the youth that will stop Brexit’. \nThat was the message from Labour’s Lord Andrew Adonis, who spoke on Sunday to a crowd of ‘remainers’ in the centre of Newcastle. \nThe ex-Government minister, a key figurer in the pro-EU movement, claimed Brexit would be “calamitous” for the North East’s economy. \nIn the shadow of a float lampooning top Tories, the ex-Minister was cheered as he told how he had offered to give Jacob Rees-Mogg to France. 'Brexit is a monstrosity' float in Newcastle (Image: ncjMedia) \nAround 300 people turned out for the Grey’s Monument event, where Lord Adonis told the Chronicle: “I think there is every prospect we can stay in Europe. \n“There will be a parliamentary crisis when Theresa May returns with her treaty from Brussels. \n“She won’t have a majority for her treaty because the Labour Party will be bound to vote against it as there is no way the Labour Party can support Conservative terms for Brexit which involves less trade and cuts to living standards.” Anti-Brexit protesters in Newcastle city centre \nLabour leader Jeremy Corbyn has dismissed calls for a second referendum. He sacked shadow minister Owen Smith this week for doing just that. \nBut Lord Adonis said a new vote wouldn’t be a referendum on leaving, but on the terms of Britain’s departure. \nAnd he added: “If there is a referendum next year there will be two million new voters who didn’t have a chance to vote due to the turnover in electorate. \n“What will also make a big difference is votes for 16 and 17-year-olds. \n“That means there would be four millions new voters - that is a substantially new electorate. Protesters at anti-Brexit rally \n“It could make a fundamental difference - the young are overwhelmingly against leaving Europe as they don’t want to be shut out behind borders.” \nHis words came during a rally which contained anti-Brexit sing-a-longs, stage invasions and the float featuring images of Boris Johnson and Theresa May. \nNewcastle voted to remain, although other pockets of the North-East voted overwhelmingly to leave the EU. Read More Anti-Brexit rally in Newcastle RECAP: Updates as around 200 protest against leaving EU \nA recent poll suggested however that Sunderland - a former hotbed of leave voters - would now likely want to stay in Europe. \nOrganisers Louise Brown said she believed people felt they had been lied to about the facts, adding; “Public opinion will decide if there will be a chance we will remain - and public opinion is shifting.” \nBut watching from the sidelines, Jarrow’s Trevor Upton said while he wanted another vote, the turnout to Sunday’s event - which had been billed as Tyneside’s biggest ever Brexit rally - told a different story. \n“The small crowd here shows people’s apathy,” he said. Like us on Facebook", "external_links": [], "published": "2018-03-25T19:39:00.000+03:00", "crawled": "2018-03-25T21:55:45.002+03:00", "highlightTitle": ""}