{"organizations": [], "uuid": "620c8fa65d4dfb9a3f878aaa6e25ef3ee076bf35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14381902.ece/ALTERNATES/s1200/Council-leader-Nick-Forbes.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/job-losses-133m-spending-cuts-14381889", "country": "GB", "domain_rank": 21960, "title": "Job losses and £13.3m spending cuts: What Newcastle City Council's budget means", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-08T07:00:00.000+02:00", "replies_count": 0, "uuid": "620c8fa65d4dfb9a3f878aaa6e25ef3ee076bf35"}, "author": "Evening Chronicle", "url": "https://www.chroniclelive.co.uk/news/north-east-news/job-losses-133m-spending-cuts-14381889", "ord_in_thread": 0, "title": "Job losses and £13.3m spending cuts: What Newcastle City Council's budget means", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "negative"}, {"name": "coun david faulkner", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "council", "sentiment": "negative"}, {"name": "newcastle chron", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Council leader Nick Forbes said that using reserves would be 'irresponsible' (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJob losses, a council tax rise and £13.3m of spending cuts have all been agreed by Newcastle City Council . \nCouncillors voted in favour of the budget for 2018/19 which will see council tax bills rise by 5%. \nThe Lib Dem opposition called for the council to spend cash on more litter bins, school crossing patrols and street cleaning at the meeting on Wednesday night. Read More \n“The cuts in public spending have gone too far and the cracks are showing,” Coun David Faulkner said. \n“Use your reserves, that’s what they are there for,” he added. \nHowever, council leader Nick Forbes said that using reserves would be “irresponsible” as the council is likely to face worse challenges in the coming years when the impact of Brexit hits the city. \nHe said: “We are trying to be a council that shields residents from the full impact of austerity whilst also preparing for the Brexit shock to come. \n“Each year we hope the worst is finally upon us. But each year the financial situation gets worse, and we see another sign that the Government’s addiction to austerity simply isn’t going away.” \nCoun Forbes, who is also vice-chair of the Local Government Association, said that virtually every single council in the country is struggling with funding cuts and austerity. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nHe said: “We have not and we will not bury our heads in the sand or pretend there are easy solutions or give people false hope, but neither do we simply give up and despair. \n“Council tax will have to go up. Chargers for services such as garden waste will increase, and more than £2m will have to be cut from care services. \n“ We will lose another 40 of our dedicated staff , although once again we promise that we will avoid compulsory redundancies wherever possible.” \nFor the second year in a row, council tax is set to be increased by 4.95%. \nCouncil tax will rise by 1.95% with an additional 3% rise in the social care precept which is used to pay for social care. \nThe rise would add £74.55 a year to an annual bill for a band D property or £49.70 for a band A property. \nThe council said it will have lost £283m since 2010 by the end of the current budget cycle in 2020 and 2018/19 is the second year of a three-year cycle which will see £60m saved. Read More \nIn order to meet savings of £13.3m for the year, the council has agreed to: \n- Cut its contribution to Tyne and Wear Archives & Museums by £150,000 \n- Increase garden waste charges from £1 to £2 per collection \n- Reduce its contribution to Newcastle Gateshead Initiative by £40,000 \n- Save £2.6m by developing new ways of caring for adults with complex needs. Like us on Facebook", "external_links": [], "published": "2018-03-08T07:00:00.000+02:00", "crawled": "2018-03-08T08:00:33.008+02:00", "highlightTitle": ""}