{"organizations": [], "uuid": "f0685ad1ce7548215e133c8dd6d0e538ed91ac2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13792761.ece/ALTERNATES/s1200/BELGIUM_EU_115488.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/theresa-may-brexit-speech-live-14359677", "country": "GB", "domain_rank": 21960, "title": "Theresa May Brexit speech LIVE: Updates as Prime Minister sets out strategy to guide UK negotiations", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-02T14:41:00.000+02:00", "replies_count": 0, "uuid": "f0685ad1ce7548215e133c8dd6d0e538ed91ac2a"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/theresa-may-brexit-speech-live-14359677", "ord_in_thread": 0, "title": "Theresa May Brexit speech LIVE: Updates as Prime Minister sets out strategy to guide UK negotiations", "locations": [], "entities": {"persons": [{"name": "jonathan walker", "sentiment": "negative"}, {"name": "theresa may brexit", "sentiment": "negative"}, {"name": "brexit  mrs may", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jonathan walker theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "“The UK has been clear it is leaving the customs union” \nBut it wants “a frictionless border”. \nOne option is a customs “partnership”, in which the UK charges EU duties on goods which come in to the UK *if they are then going to be exported to the EU*. This would mean there don’t need to be any customs checks between the EU and UK itself. \nWhatever happens, the UK must be free to agree it’s own trade deals, she says. And that means the UK cannot be in a Customs Union with the EU, according to Mrs May. 14:07 Jonathan Walker \nTheresa May says the UK wants to avoid having any tariffs or quotas on the export of UK goods to the EU. \nThis will mean the UK largely continues to obey EU rules on standards, such as safety standards, she says. \nBut she says that many of these standards are actually global standards anyway, and already apply to many countries not in the EU. \n(This seems to me to be an attempt to reassure people who say Brexit must mean the UK makes its own laws. She’s saying that even if we don’t make our own laws it still doesn’tmean we’re taking orders from the EU). 14:05 Theresa May arrives for her Brexit speech \nTheresa May arriving for her speech 14:03 Immigration controls are coming \nTheresa May says: \nFree movement of people will come to an end and we will control the number of people that come into our country 14:02 Jonathan Walker Downing Street press office sets out key points on Twitter \nThe Prime Minister’s public relations team is Tweeting to highlight key points in the speech 14:00 Jonathan Walker \nThe Prime Minister said the UK wanted freedom to negotiate trade deals around the world, control of laws and “as frictionless a border as possible” with the EU. \nShe said there were “some tensions in the EU’s position too - and some hard facts for them to face as well”. \n“The commission has suggested that the only option available to the UK is an ‘off the shelf’ model,” she said. “But, at the same time, they have also said that in certain areas none of the EU’s third country agreements would be appropriate. “ 13:59 Jonathan Walker I am confident that we can reach agreement \nTheresa May says she is confident the EU and UK and reach agreement. But she is asking the EU to agree a new type of deal with the UK - not simply to offer a copy of existing deals, such as the ones between the EU and Norway or Canada. \nShe says “I believe this is achievable”. 13:57 Jonathan Walker Theresa May sets out \"hard facts\" about Brexit \nMrs May is attempting to warn both the EU and UK supporters of Brexit that everyone is going to have to compromise. She sets out what she calls “hard facts”. \nShe says that leaving the single market would mean “life is going to be different”, adding: “In certain ways, our access to each other’s markets will be less than it is now.” 13:54 Jonathan Walker Theresa May asks the EU to help her with Northern Ireland \nTheresa May says successive British governments have worked tirelessly, along with the Irish government and Northern Irish political parties, to bring peace to Northern Ireland. \nShe says the UK has a responsibity to protect the peace process, and to ensure there is no hard border between Ireland and Northern Ireland. \nBut she say Ireland, and the European Commission, also have a responsibility to ensure this. \nAnd she rules out the EU proposal for a customs union between Ireland and Northern Ireland, which would mean creating a border between Northern Ireland and the rest of the UK. 13:50 Jonathan Walker \nTheresa May moves quickly on to setting out her five “tests” for a Brexit deal with the EU. \nWe know what she’s saying here, because it was briefed to the press last night by Downing Street. \nAnd here are the tests: \n‘First, the agreement we reach with the EU must respect the result of the referendum. It was a vote to take control of our borders, laws and money. And a vote for wider change, so that no community in Britain would ever be left behind again. But it was not a vote for a distant relationship with our neighbours. \n‘Second, the new agreement we reach with the EU must endure. After Brexit both the UK and the EU want to forge ahead with building a better future for our people, not find ourselves back at the negotiating table because things have broken down. \n‘Third, it must protect people’s jobs and security. People in the UK voted for our country to have a new and different relationship with Europe, but while the means may change our shared goals surely have not – to work together to grow our economies and keep our people safe. \n‘Fourth, it must be consistent with the kind of country we want to be as we leave: a modern, open, outward-looking, tolerant, European democracy. A nation of pioneers, innovators, explorers and creators. A country that celebrates our history and diversity, confident of our place in the world; that meets its obligations to our near neighbours and far off friends, and is proud to stand up for its values. \n‘And fifth, in doing all of these things, it must strengthen our union of nations and our union of people. 13:45 Jonathan Walker Theresa May begins her speech \nTheresa May begins her speech by thanking the emergency services and others helping the nation to cope with the snow. \nMoving on to Brexit, she says she has “listened carefully” to the debate about how to handle Brexit. \nShe reminds her audience that she pledged, back when she first became Prime Minister, that the Government she leads will be driven not by the interests of the privileged few but by the interests of working people. 13:43 Jonathan Walker \nSpeaking on BBC Two, Northumberland Conservative MP Anne-Marie Trevelyan, a supporter of Brexit, says there is an “upbeat feel” in the Conservative Party about the way Brexit is developing. Conservative MP for Berwick Anne-Marie Trevelyan 13:37 Jonathan Walker Jeremy Corbyn set out Labour's plans for Brexit earlier in the week \nAs we wait for Theresa May to speak, here’s a reminder of what Labour leader Jeremy Corbyn said earlier this week. \nHe said Labour wanted the UK to remain in “a” customs union - not the existing EU Customs Union. \nHe said: \nA new customs arrangement would depend on Britain being able to negotiate agreement of new trade deals in our national interest. \nLabour would not countenance a deal that left Britain as a passive recipient of rules decided elsewhere by others. That would mean ending up as mere rule takers. \nHe also made it clear that Labour would take the UK out of the single market, saying: \nLabour would negotiate a new and strong relationship with the single market that includes full tariff-free access and a floor under existing rights, standards and protections. 13:31 KEY EVENT Theresa May's five tests for Brexit \nHere are the “five tests” we expect Theresa May to set out. These will guide the UK’s negotiations with the EU. \n- The agreement must respect the outcome of the referendum vote to “take control of our borders, laws and money”. \n- The agreement must endure, without the need to return to the negotiating table “because things have broken down”. \n- It must protect jobs and security, with Britain and the EU continuing to pursue the “shared goals” of growing their economies while keeping their people safe. \n- It must be consistent with Britain remaining “a modern, open, outward-looking, tolerant, European democracy” that stands by its international obligations. - It must strengthen “our union of nations and our union of people”. 13:28 Jonathan Walker Boris no-show \nApparently Foreign Secretary Boris Johnson can’t make it. He’s been kept away by the snow. 13:24", "external_links": [], "published": "2018-03-02T14:41:00.000+02:00", "crawled": "2018-03-02T16:02:27.002+02:00", "highlightTitle": ""}