{"organizations": [], "uuid": "a0484dc4c3489d2ff3bcdcc94ae41b67f73dbfce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14464021.ece/ALTERNATES/s1200/Tolent-offices-on-5th-Avenue-at-Team-Valley-Trading-Estate.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/gatesheads-tolent-notch-up-94m-14463729", "country": "GB", "domain_rank": 21960, "title": "Gateshead's Tolent notch up £94m order book as construction sector stabilises", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-27T18:45:00.000+03:00", "replies_count": 0, "uuid": "a0484dc4c3489d2ff3bcdcc94ae41b67f73dbfce"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/gatesheads-tolent-notch-up-94m-14463729", "ord_in_thread": 0, "title": "Gateshead's Tolent notch up £94m order book as construction sector stabilises", "locations": [], "entities": {"persons": [], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "5th avenue", "sentiment": "none"}, {"name": "invalid email  north east", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "thornaby", "sentiment": "none"}], "organizations": [{"name": "leeds", "sentiment": "none"}, {"name": "tolent", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Gateshead's Tolent notch up £94m order book as construction sector stabilises The firm, which employs around 500 people, saw revenues rise in another strong year for the business across all sectors Share Tolent offices on 5th Avenue at Team Valley Trading Estate (Image: Publicity Pic) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East building company Tolent has racked up an ‘encouraging’ £94m order book following another successful trading year. \nThe Gateshead firm, which has around 500 staff in bases in Tyneside, Thornaby, Leeds, Manchester and London, saw revenues rise by 3% to £178m while total comprehensive profit for the year came in at £2.87m, more than double the previous year’s £1.17m. \nThe firm operates across the construction sector, providing everything from commercial building and civil engineering to property development services in the industrial, commercial, petro-chemical, residential, civil, public and health sectors. \nIn his review of the year, non executive chairman Peter Hems said the property and construction sectors of the economy continued to be stable throughout 2017, and that the final consequences of the Brexit decision are as yet uncertain. The current development of the Beacon of Light building in Sunderland near to the football stadium (Image: Newcastle Chronicle) \nHe said: “As a result of this developers and contractors are being more selective in work taken on in terms of design information requirements, project timescales, overall risk and margin. \n“The directors consider the current level of enquiries and tenders to be encouraging, with the potential to select and negotiate more profitable contracts. We went into 2018 with an encouraging order book of £94m.” \nThe year saw the business complete a raft of big projects including a £14.7m student housing scheme in Liverpool, work at the Arnison Retail Park in Durham , two Travelodges in London and York in contracts worth £34m between them. It also performed civils work at an energy plant on Teesside and two residential schemes in London. Read More Game Digital turns to Mike Ashley to bounce back from profits slump \nCloser to home the firm is working on the £16.6m project to create sports and teaching facilities at the Beacon of Light in Sunderland, adjacent to the Stadium of Light, and last July it emerged that Tolent will build the £42m Hadrian’s Tower skyscraper in Newcastle’s Rutherford Street. \nThe firm’s Tolent Living Ltd and Tolent Solutions Ltd subsidiaries were involved in a range of residential schemes with clients including social housing providers, local councils and private residential developers, with projects including 17 dwellings at the Malings in Ouseburn. The firm said it expects the residential market to improve over the coming years as Governments continue to prioritise housing. Read More \nDirectors added that an interim dividend of 2p per share had been paid during the year and that a proposal for a final dividend will be made ahead of the group’s AGM in May. Like us on Facebook", "external_links": [], "published": "2018-03-27T18:45:00.000+03:00", "crawled": "2018-03-27T21:26:01.017+03:00", "highlightTitle": ""}