{"organizations": [], "uuid": "5d7697e49a817e3aa30ca0c9e2baf17cf4e6e523", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14420249.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/northern-business-leaders-want-certainty-14420206", "country": "GB", "domain_rank": 21960, "title": "Northern business leaders want certainty on Brexit transition, survey says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-16T14:58:00.000+02:00", "replies_count": 0, "uuid": "5d7697e49a817e3aa30ca0c9e2baf17cf4e6e523"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/northern-business-leaders-want-certainty-14420206", "ord_in_thread": 0, "title": "Northern business leaders want certainty on Brexit transition, survey says", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "business northern", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Northern business leaders want certainty on Brexit transition, survey says Some business chiefs say they will take advantage of Brexit uncertainty to steal a march on their rivals Share Prime Minister Theresa May (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusiness leaders in the North believe certainty on a Brexit transition deal is more important than a comprehensive future trade deal at the end of the process, new research suggests. \nAccountancy firm KPMG surveyed CEOs and CFOs from medium and large size companies across the North, and found that two-thirds of those questioned would prefer legal certainty on Brexit transition arrangements by April with a less ambitious future deal, rather than waiting for a more comprehensive future deal to be agreed much closer to the date of exiting the EU. \nThe survey also found that the number of business leaders who expect their companies to be negatively impacted by Brexit outweighed those who thought they would benefit. \nBut KPMG said that some businesses were also hoping to take advantage of any Brexit-related uncertainty by stealing on a march on rivals if they are negatively impacted by Britain leaving the EU. \nAnnette Barker, head of Brexit at KPMG in the North, said: “Whether businesses in the North see Brexit as a burden or a great opportunity, most regard certainty around transition as one of the fundamental building blocks for growth. \n“Whilst the public is more fixated on the final deal, the CEOs we’re speaking to are often willing to accept a more modest deal in exchange for certainty so they can make investment decisions now.” \nElsewhere in the survey one in five (21%) CEOs and CFOs in the North said their firms would not be able to operate as usual by next March 2019 if there is no transition deal. \nWhen asked what their business’ situation will be if the UK and EU do not reach a ‘steady state’ transition agreement by April, two in five (42%) expect a negative impact on their business, but just under a third (31%) expect their business to see some competitive advantage. \nMs Barker added: “Many people talk about Brexit as if it’s exclusively a negative force to be mitigated. Read More Jobs worry in North East as employers get more cautious on hiring \n“But a number of our clients see it differently. Whilst more than two-fifths expect some negative impact - including job losses - if a transition period isn’t agreed by April, many companies, particularly medium-sized challenger brands, see disruption as an opportunity. \n“For them, Brexit is a chance to unleash their entrepreneurial spirit, to open up new export opportunities or realise a competitive advantage on their larger rivals. \n“The fact that businesses, even in the same sector, will be affected in different ways often gets lost in today’s polarised Brexit debate. Some organisations need to quickly work to mitigate the downsides of Brexit, while others are looking to be on the front foot to exploit the upsides – but the smartest are doing a combination of both.” \nA Government impact report on Brexit has revealed that the North East would be worst affected by leaving the EU, regardless of whatever deal was negotiated by the Government . \nThe North East has also called for “the best possible terms of access to other markets” to be maintained as the Government negotiates the Brexit deal. Like us on Facebook", "external_links": [], "published": "2018-03-16T14:58:00.000+02:00", "crawled": "2018-03-16T15:08:33.000+02:00", "highlightTitle": ""}