{"organizations": [], "uuid": "48ca280461ec9b60f71ab7c4aa65f48b5942c1f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14364140.ece/ALTERNATES/s1200/GBR_BPO_081214EEF01.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/strong-start-year-north-east-14362091", "country": "GB", "domain_rank": 21960, "title": "Strong start to year for North East manufacturing businesses as exports soar", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-05T02:01:00.000+02:00", "replies_count": 0, "uuid": "48ca280461ec9b60f71ab7c4aa65f48b5942c1f8"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/strong-start-year-north-east-14362091", "ord_in_thread": 0, "title": "Strong start to year for North East manufacturing businesses as exports soar", "locations": [], "entities": {"persons": [{"name": "richard halstead", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "eef/bdo manufacturing outlook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Strong start to year for North East manufacturing businesses as exports soar EEF has upgraded its forecasts for the next two years after positive sales in the UK and abroad Share Richard Halstead, Midlands region director of the EEF (Image: Publicity Picture) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East manufacturers have begun 2018 in a positive manner with increased global demand accompanying a pick-up in the UK market, according to a survey being published today. \nThe EEF/BDO Manufacturing Outlook Q1 survey shows growth in most areas of the manufacturing sector, and has led EEF to upgrade growth forecasts for manufacturing for this year and next. \nAccording to the survey, both output and total orders remained in positive territory, with the North East seeing the joint highest export orders of any region in the UK. \nThis positive picture is reflected in healthy recruitment intentions by North East companies, and while investment dipped slightly from the previous quarter, it remains strong by historic standards. \nRichard Halstead, director of member engagement for EEF in the North, said: “Manufacturing activity stepped up a gear through 2017 providing industry with some decent momentum coming into this year. \n“The importance of a buoyant global economy to export-focused manufacturing sectors is again reinforced, with growing overseas demand encouraging international manufacturers to ramp up their investment which in turn is spurring particularly strong activity in UK capital goods sectors. \n“While this will help top line growth in UK industry and the wider economy it’s also important that the global race to increase investment and adopt new technology is not one in which the UK is left behind. \n“As the Chancellor sets out some thinking about longer term economic priorities in his Spring statement next week, manufacturers will want to see a focus on how the new industrial strategy can help cut through Brexit uncertainty and turbo-charge investment ambitions right across manufacturing supply chains.” Like us on Facebook", "external_links": [], "published": "2018-03-05T02:01:00.000+02:00", "crawled": "2018-03-05T02:34:05.000+02:00", "highlightTitle": ""}