{"organizations": [], "uuid": "5ee6e0f75944857a782798bbd17c8d9af1b9d30c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13479779.ece/ALTERNATES/s1200/SGP_NEC_260617STATION05JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/transport-secretary-chris-grayling-makes-14370084", "country": "GB", "domain_rank": 21960, "title": "Transport Secretary Chris Grayling makes pledge to worried East Coast Main Line staff", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-05T18:00:00.000+02:00", "replies_count": 0, "uuid": "5ee6e0f75944857a782798bbd17c8d9af1b9d30c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/transport-secretary-chris-grayling-makes-14370084", "ord_in_thread": 0, "title": "Transport Secretary Chris Grayling makes pledge to worried East Coast Main Line staff", "locations": [], "entities": {"persons": [{"name": "chris grayling", "sentiment": "negative"}, {"name": "ian mearns", "sentiment": "none"}, {"name": "mearns", "sentiment": "none"}], "locations": [{"name": "east coast", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "transport", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "invalid email  transport ministers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Transport Secretary Chris Grayling makes pledge to worried East Coast Main Line staff Employees and passengers face upheaval as rail franchise Virgin-Stagecoach is set to change hands yet again Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTransport Ministers are to meet staff working on troubled East Coast Main Line services as they prepare to switch to their sixth employer since 2005. \nChris Grayling, the Transport Secretary , told the House of Commons he would meet with workers after Gateshead MP Ian Mearns warned staff are concerned about the way the franchise is being managed. \nWhile it’s common for new operators to take over rail lines every ten years or so, inter-city East Coast Main Line services have changed hands repeatedly as a result of rail operators walking away before their contract has come to an end. \nMr Mearns told the Commons: “I am afraid to say that service standards have deteriorated on the East Coast line since Virgin-Stagecoach took the franchise - I am a regular customer on that line - despite the best efforts of the excellent staff on board trains and at stations. A train departs from Newcastle Central Station (Image: Newcastle Chronicle) \n“Those staff face having their sixth employer in a decade-and-a-half. Will the Secretary of State meet me and some of those staff, so that they can express their concerns about the way in which the franchise has been conducted?” \nMr Grayling confirmed: “My ministerial colleagues and I are happy to talk to staff“. \nInter-city services, which run between London, Newcastle and Scotland, were operated by Great North Eastern Railway (GNER) until 2007. The franchise was due to run to 2012, but ended early due to financial problems at GNER. \nServices transferred to National Express East Coast - but this franchise ended in 2009 because the operator also faced financial problems. \nEast Coast, a subsidiary of a business owned by the Government called Directly Operated Railways, took over. It meant the franchise was run by a publicly-owned business. Transport Secretary Chris Grayling (Image: PA) \nBut the Government put it out to tender again, and Virgin Trains East Coast took over in 2015. \nNow, another operator is due to take over, after Virgin East Coast - 90% owned by transport giant Stagecoach - also ran into difficulties. \nMr Grayling defended the use of the private sector to run train services, telling the House of Commons: “The reality is that the independent assessments have shown a higher level of passenger satisfaction on that route since the change of franchise, not a lower one.” Read More North politicians form 'Convention of the North' to speak with one voice \nThis appears to be a reference to the National Rail Passenger Survey, carried out by Passenger Focus, the official passenger watchdog. \nThe most recent survey found that 92% of Virgin East Coast passengers said they were satisfied with the service, a higher figure than for most other rail operators. \nBut this is roughly the same as the figures when the service was run by a state-owned business. Read More Here's what the North East needs to hear from Theresa May on Brexit \nBlaydon MP Liz Twist urged the Government to return the fail service to public ownership. \nShe said: “After three failed franchises and the experiences of a directly operated railway my constituents would much prefer a directly operated railway. Will he commit to providing a directly operated railway service, in the public interest?” \nThe Government says it will decide what to do about the franchise based on “what is best for the passenger and for the taxpayer”. Like us on Facebook", "external_links": [], "published": "2018-03-05T18:00:00.000+02:00", "crawled": "2018-03-05T20:52:31.000+02:00", "highlightTitle": ""}