{"organizations": [], "uuid": "b1df2abd29a09c5c0e0e72842aad9bab5128afea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14447123.ece/ALTERNATES/s1200/TMP_NEC_220318DeLaRue05JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/gateshead-council-boss-demands-answers-14447102", "country": "GB", "domain_rank": 21960, "title": "Gateshead Council boss demands answers as De La Rue loses UK passport contract", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-23T10:55:00.000+03:00", "replies_count": 0, "uuid": "b1df2abd29a09c5c0e0e72842aad9bab5128afea"}, "author": "Laura Hill", "url": "https://www.chroniclelive.co.uk/news/north-east-news/gateshead-council-boss-demands-answers-14447102", "ord_in_thread": 0, "title": "Gateshead Council boss demands answers as De La Rue loses UK passport contract", "locations": [], "entities": {"persons": [{"name": "de la rue", "sentiment": "negative"}, {"name": "martin gannon", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "gateshead council", "sentiment": "negative"}, {"name": "de la rue", "sentiment": "none"}, {"name": "gemalto", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "gemalto share laura hill local democracy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gateshead Council boss demands answers as De La Rue loses UK passport contract The contract to manufacture the new blue passport is set to be awarded to Franco-Dutch firm Gemalto Share Laura Hill Local Democracy Reporter 07:55, 23 MAR 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe leader of Gateshead Council has demanded answers from the Prime Minister on the decision to award the printing of the new UK passport to a foreign firm, rather than Gateshead-based De La Rue. \nThe contract to manufacture the new blue passport is set to be awarded to Franco-Dutch firm Gemalto, it was announced on Thursday. \nThe move has been condemned by Brexiteers who saw the blue passports as a symbol of their independence from the European Union. Read More \nSpeaking at a council meeting, council leader Martin Gannon said he was shocked by the news. \n“If people made this sort of thing up they wouldn’t believe it,” he said. \n“The gorgeous burgundy British passports have been made there for years, as have the passports of 40 other countries. The De la Rue plant in the Team Valley. The company has lost out on a big contract to a french company to produce the blue passports after Brexit (Image: newcastle chronicle) \n“I would echo the demands of the De La Rue boss that the Prime Minister and home secretary Amber Rudd should come to Gateshead and explain to the staff there. \n“They must give some sort of rational explanation for this completely incredulous decision.” Read More \nAround 600 people work at the Gateshead plant and around 100 of them in the passport division. \nIt is believed that losing the contract will put jobs at risk. \nCoun Gannon added: “To award a £490m 10-year contract to a European firm at a time when we are in the process of leaving Europe is beyond belief, when it could potentially jeopardise UK jobs which are here in Gateshead. \n“We will be working hard to meet with ministers to understand why this has happened. “ Like us on Facebook", "external_links": [], "published": "2018-03-23T10:55:00.000+03:00", "crawled": "2018-03-23T11:21:09.010+03:00", "highlightTitle": ""}