{"organizations": [], "uuid": "368a1524f6b22c176c3a7674546938e3380af97e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14440569.ece/ALTERNATES/s1200/Begin-work.jpg", "site_section": "http://www.thejournal.co.uk/culture/?service=rss", "section_title": "nechronicle - What's On", "url": "https://www.chroniclelive.co.uk/whats-on/arts-culture-news/emphasis-stem-subjects-school-artsmark-14440402", "country": "GB", "domain_rank": 21960, "title": "With the emphasis on STEM subjects in school, Artsmark offers hope for budding creatives", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-25T20:00:00.000+03:00", "replies_count": 0, "uuid": "368a1524f6b22c176c3a7674546938e3380af97e"}, "author": "David Whetstone", "url": "https://www.chroniclelive.co.uk/whats-on/arts-culture-news/emphasis-stem-subjects-school-artsmark-14440402", "ord_in_thread": 0, "title": "With the emphasis on STEM subjects in school, Artsmark offers hope for budding creatives", "locations": [], "entities": {"persons": [{"name": "gina bond", "sentiment": "none"}, {"name": "tom carr", "sentiment": "none"}, {"name": "kane wigham", "sentiment": "none"}, {"name": "molly", "sentiment": "none"}, {"name": "molly henderson", "sentiment": "none"}, {"name": "gemma lynas", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}], "organizations": [{"name": "durham sixth form centre", "sentiment": "none"}, {"name": "consett", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "university of the arts", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On With the emphasis on STEM subjects in school, Artsmark offers hope for budding creatives Durham Sixth Form Centre is the latest in the North East to have achieved Artsmark platinum in recognition of its arts offer Share Budding photographers and filmmakers at Durham Sixth Form Centre (Image: Newcastle Journal) Share   Thank you for subscribing!   \nMolly Henderson is focusing on photography at the moment but she knows exactly where her ambitions lie. \n“I want to work in the fashion industry and when I go to university in September I’m hoping they’ll help me to get there,” says the radiant 19-year-old. \nMolly, from Consett , has a place at University of the Arts London where they specialise in art, design, fashion and the performing arts. \nShe’s due to move to the capital to join the ranks of budding creatives in September. London’s not cheap. “I’m saving now,” says Molly, looking as if nothing will stand in her way. Gina Bond, left, Molly Henderson and Tom Carr, students at Durham Sixth Form Centre (Image: Gemma Lynas for Artsmark) \nKane Wigham, also 19 and from Peterlee, is working towards an exhibition exploring human motivation. Absorbed in data on his computer screen, he is currently in the research phase. \n“At the moment I’m thinking of doing a BA in graphic design and hopefully I’ll move further down south,” he says. “I’ve always been in the north.” \nFor Molly and Kane and others in the Foundation Studio at Durham Sixth Form Centre, the world is their oyster. \nThey are between A levels and the leap into higher education, finding out what they’re good at and really enjoy. \nHere I also meet a pair of 18-year-olds, Tom Carr, also from Peterlee, studying graphic design, and Gina Bond, from Esh Winning, specialising in fine art. \nI’m at Durham Sixth Form Centre because recently it became the latest to attain Artsmark platinum status, the pinnacle of a scheme run by Arts Council England . \nAccording to its website, Artsmark recognises schools that “are making the arts come alive”. It is described as “a practical and valuable tool for enriching a school’s arts provision whatever the starting point”. Creativity in action at Durham Sixth Form Centre (Image: Anna Miller for Artsmark) \nArts provision in schools has been a matter of concern for some time. \nThe national curriculum does not include the performing arts – theatre and dance – and schools are not obliged to teach music or art and design after key stage 3 (children aged 11-14) although physical education is compulsory until the age of 16, as are English, maths, science, citizenship and computing. \nIn January a BBC survey, to which more than 40% of the country’s secondary schools responded, suggested extra emphasis on core academic subjects (English, maths and science) and funding pressures meant resources for creative subjects had been cut back. \nJust this month Lenny Henry helped to launch a National Theatre scheme called Let’s Play, aimed at transforming creativity and theatre making in schools. A dance session at Durham Sixth Form Centre (Image: Tom Banks for Artsmark) \nLisa Burger, the National Theatre’s executive director, said: “At the National Theatre we believe that all young people, wherever they are in the UK, should have the chance to see, hear and explore theatre as a core part of their education.” \nThrough Artsmark, it is possible to gauge how seriously schools take the creative subjects supposedly under threat. \nAttaining an Artsmark level of silver, gold or platinum involves a five-stage process. \nA school must first register with the scheme, then send a teacher and senior staff member to a development day and then submit a so-called ‘statement of commitment’. \nThe promised arts-related work must then be delivered in school within two years of the development day and written up as a case study. Monster pots, made by Durham Sixth Form Centre for a wedding (Image: Gemma Lynas for Artsmark) \nThe first school in the region to achieve Artsmark platinum was Rockcliffe First School, North Tyneside, in 2015. Then in 2016 came the first secondary school, Sacred Heart Catholic High School in Newcastle. \nDurham Sixth Form Centre becomes the first in 2018, and only the fifth secondary school in the region, to achieve Artsmark platinum. \nAnd you don’t have to be on the premises for long to understand why they went for it and subsequently achieved it. \nOne of the first buildings you see on the site, in the heart of Durham, is the Visual Arts Centre – opened, according to the plaque, on January 30, 2006. \nA new Media Centre was to have opened in September but it has been delayed by constructor Carillion’s financial woes. \nDurham Sixth Form Centre has 1,300 students drawn from more than 60 of the region’s secondary schools. \nIts faculty of arts, business and English is led by Ruth Robinson, an arts teacher with an infectious enthusiasm for her subject. She it was who set the Artsmark ball rolling two years ago. \n“I approached the head and said, ‘Do you want me to go for this Artsmark award?’ \n“She said, ‘Have you got time?’ I said, ‘No, not really, but I think it’s important’. \n“I’m really passionate and a strong advocate of the arts and the headteacher (Ellen Beveridge) is a previous head of art.” \nRuth attended an Artsmark development day with a member of the school’s senior leadership team and then devised a project that would tie in with improvement plans for the school as a whole. An arts session at Durham Sixth Form Centre (Image: Tom Banks for Artsmark) \nThe statement of commitment explained how staff intended to increase participation in the arts, work more closely with partner organisations and strengthen links with feeder schools. \nRuth says she has done a lot of networking with other art teachers and was invited to become part of County Durham Cultural Education Partnership, a group of educators and arts professionals who share and disseminate best practice. \nIts next big event is a Creative Learning Week, from April 11-17, aimed at raising the profile of the arts offer in schools across the county. \nIn many respects, she says, the wider picture is bleak \nSince the Government embraced the EBacc (English Baccalaureate), putting the emphasis at GCSE on English, maths, science, geography or history and a language, creativity in schools has been “under attack”, in her estimation. Teacher Ruth Robinson (centre) with students at Durham Sixth Form Centre (Image: Gemma Lynas for Artsmark) \n“Heads are under such a lot of pressure for results in core subjects – English, maths and science – that in some schools students are lucky if they get an art class every two weeks. \n“Drama departments have been disappearing across the country. \n“But one of the wonderful things is that students find their place when they come here. \n“We have students who come and say, ‘Can we do art because we couldn’t pick it at GCSE?’ And of course they can. \n“We are a bit unique and in quite a privileged position in that we do have a really broad curriculum offer.” \nA level options include art, craft and design, dance, drama and theatre, film studies, fine art, graphic design, media studies, music, photography and textile design. At BTEC students can choose games development, performing arts and TV studio and film. Sophie Nimmins at Durham Sixth Form Centre (Image: Gemma Lynas for Artsmark) \nIn purely economic terms, Ruth says, it doesn’t make sense to marginalise creativity in schools. \n“The creative industries are a massive growth area (worth £92 billion in 2016, according to Government figures released in November, showing growth at twice the rate of the economy as a whole). \n“In a post-Brexit world where we’re reliant on our exports the arts can play a huge part. Our theatre, music and film are admired around the world. \n“But while jobs in this area might not all be well paid, people don’t necessarily go into it for the money. They may have a passion for it. \n“And in the arts there’s also the idea of wellbeing.” \nAs a result of the Artsmark journey, Ruth’s students worked on the Lumiere festival in Durham and contributed to a project culminating in a memorable concert at Durham Cathedral, Defiant Requiem: Verdi at Terezin, remembering Holocaust victims. \nA whirlwind tour of the Centre’s cultural facilities takes in the well-equipped media studios and art rooms. Artsmark Facts \nArtsmark is the creative quality standard for schools, accredited by Arts Council England and a framework for teachers to plan, develop and evaluate arts, culture and creativity across the curriculum. \nSchools are supported on their Artsmark journey by 10 ‘Bridge’ organisations around the country. \nCulture Bridge North East is managed by Tyne and Wear Archives and Museums and works with arts organisation The Forge, based in Stanley, to deliver Artsmark in the region. \nCurrently 273 North East schools are registered for Artsmark, of which 37 have applied for and been awarded an Artsmark level (silver, gold or platinum). \nThe latest Artsmark Celebration was on March 19 at The Alnwick Garden when trophies were presented. \nClive Maddison, head of Ravenswood Primary School, Newcastle (Artsmark silver) said: “Our Artsmark was based on the development of music at Ravenswood but the most exciting thing to come out of our Artsmark application is the springboard effect into the teaching of the arts across all curriculum areas.” \nKirsty Worth, from Benedict Biscop Academy, Sunderland (gold), said: “We worked with Birmingham Royal Ballet who came into school to help us explore the story of The Tempest. Children from across all year groups came together to learn ballet skills from professional ballerinas. We then went to Sunderland Empire and watched the company warming up and even went backstage and got to meet the head of costumes for the ballet.” \nSarah Jackson, from Lanchester EP Primary School (silver), said: “We offer a wide range of arts activities and projects in our school and the Artsmark process has allowed us to celebrate these. It has also allowed us to develop new ideas, including art passports for every child.” \nThe next Artsmark development day is April 27 (10am to 3pm) at Stanley Education Centre, County Durham. Schools can find out more at www.Artsmark.org.uk \nI see the nicely appointed theatre and the dance studio with its sprung floor and big mirrors. \nI meet art teacher Donna Grant whose students have just completed a commission to make monster-themed clay pots for what sounds like a rather off-beat North East wedding (Who says there’s no money in the arts?). \nI also get to hear about media student Emily Taylor’s popular and already profitable YouTube channel. \nAnd finally I’m introduced to Sophie Nimmins, from Durham, who is doing A levels in photography, sociology and fine art. \n“I fell in love with this place,” she says. “It was the opportunity to be creative... I never even applied anywhere else. \n“I live in the art department. I really enjoy the work because it doesn’t feel like work.” Read More North East first-time author makes the shortlist for £30,000 book prize \nSophie, who was part of a curatorial team putting up an exhibition, says she hopes to go to Glasgow School of Art. \nFinally Ruth shares her “ridiculous vision” of opening an art gallery that would benefit students and the public. \nIt doesn’t sound ridiculous. Since the Durham Art Gallery at Aykley Heads closed, there is a gap in cultural provision – and where better to position a gallery than at an educational institution boasting Artsmark platinum? Like us on Facebook", "external_links": [], "published": "2018-03-25T20:00:00.000+03:00", "crawled": "2018-03-25T22:09:37.001+03:00", "highlightTitle": ""}