{"organizations": [], "uuid": "edddcb44fd99906c4a9fb84ebaf0552dfac16c0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14164042.ece/ALTERNATES/s1200/IBP_NEC_150118carillion_site_02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14447130", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Engineers behind Vaux Brewery development faces closure after Carillion collapse", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-23T11:30:00.000+03:00", "replies_count": 0, "uuid": "edddcb44fd99906c4a9fb84ebaf0552dfac16c0e"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14447130", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Engineers behind Vaux Brewery development faces closure after Carillion collapse", "locations": [], "entities": {"persons": [{"name": "brendan flattery", "sentiment": "none"}], "locations": [{"name": "vaux brewery", "sentiment": "none"}, {"name": "utilitywise", "sentiment": "none"}], "organizations": [{"name": "utilitywise", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Utilitywise finally publishes results and reveals a £31.4m loss for 2017 \nEnergy consultancy firm Utilitywise has revealed a £31.4m operating loss after the company was forced to drastically change its accounting policy and delay its results by five months. \nNorth Tyneside-headquartered Utilitywise was originally due to publish its full-year results in November but was forced to push them back after the firm’s auditor requested an independent review be carried out concerning its accounting policy. \nTrading of shares in the AIM-listed firm were put on hold while the review took place. Trading has now reopened following this morning’s announcement. \nThe new conservative accounting policy has caused the company to post a £31.4m operating loss on its balance sheet for the year ending July 2017. In comparison the firm made a profit of £1.4m in 2016. Revenue remained flat at £67.8m. \nCommenting on the changes Brendan Flattery, chief executive officer at Utilitywise, said: \nWe have been working with our auditors for an extended period of time on how we account our revenues and have come up with a more conservative way of doing so. What that means is the value we are getting from the contracts doesn’t change one penny. What changes is the accounting period those revenues fall in. \nOne of the things we have been talking to investors about is building a pipeline of revenue and profit for the future. \nHe added: \nWe have seen a reduction in the attrition of our sales consultants, an improvement to our customers experiences, and we continue to invest in our business. \nThe firm’s bottom line was hit by a number of exceptional costs totalling £20.9m. Of this figure £12.9m was caused by an impairment loss caused by Utilitywise writing off two businesses it previously acquired. \nOverall the firm made an EBITDA loss of £8.6m over the year. \nDespite claiming that the changes made to the business are purely focused on its accounting procedures, Mr Flatterly admitted that the delay in completion of its audit has had a “destabalising” effect on staff. Utilitywise CEO, Brendan Flattery Jonathon Manning Aviva sraps plan to cancel preference shares \nInsurance giant Aviva has succumbed to shareholder pressure and rowed back on its controversial proposal to cancel £450m worth of preference shares.Earlier this month, Aviva said it would cancel the shares at par value as part of a plan to return £500m to shareholders.But on Friday the company said it has spoken to a large number of investors and received “strong feedback and criticism”.It added: \nAs a result, Aviva has listened. Aviva announces that it has decided to take no action to cancel its preference shares. \nThe initial plan to cancel the shares, which pay high fixed dividends, received criticism from investors and the Financial Conduct Authority.Aviva boss Mark Wilson said: \nI am very aware that Aviva is in a position of trust with our customers and investors. \nTo maintain that trust it is critical that we listen to and act on feedback. The reputation of Aviva, and the trust people have in us, is paramount. Our announcement today means that preference shareholders can rest secure in their holdings. \nThe board and I have a duty to consider not just the financial implications of our actions; we must consider the impact to Aviva’s wider reputation. I hope our decision today goes some way to restoring that trust. A piggy bank on a pile of coins (Image: PA) 9:17 Jonathon Manning More than 11,000 restaurants in trouble as 'perfect storm' hits dining sector \nMore than 11,000 UK restaurants are suffering financial distress amid a “perfect storm” hitting the £5.9bn sector, according to new research. \nThe latest Begbies Traynor Red Flag Alert, which monitors the financial health of UK companies, has revealed that the number of restaurants experiencing “significant” financial distress surged to 11,091 in March - up 8% on a year earlier. \nIt follows a raft of rescue deals being struck to save chains across the industry, with a number of high-profile company voluntary arrangements (CVAs) including celebrity chef Jamie Oliver’s Jamie’s Italian, upmarket burger bar Byron and another being voted on this week for Prezzo. \nBegbies warned that, with thousands of restaurants teetering on the brink ahead of quarterly rent bills due this week, many could be tipped into the red as they also face soaring costs and weaker consumer spending. \nJulie Palmer, a partner at Begbies Traynor, said: \nThe UK restaurant sector is facing a perfect storm of pressures ahead of this week’s quarterly rent day, with growing labour costs from the National Living Wage, subdued consumer spending and fierce competition from established high street chains, coming together to cause a spike in financial distress across the industry. \nUnfortunately for those restaurateurs experiencing both declining sales and rising costs, the upcoming quarterly rents payment this weekend could be too big a financial hit for many to swallow. \nRestaurant chains and retailers are among firms that have been hit hardest following the Brexit vote, with surging inflation and weak consumer confidence adding to higher wage costs and eye-watering business rate rises since last year’s revaluation. Italian beefburger - the Handmade Burger Co 9:12 KEY EVENT Theresa May welcomes EU exemption from US steel tariffs \nPrime Minister Theresa May has welcomed the 11th-hour suspension of threatened US tariffs on British steel imports and said work must start now on making it permanent.Mrs May dropped plans to fly home from the European Council summit in Brussels overnight in order to stay on for discussions on the development with fellow EU leaders.The White House announced a temporary exemption for the EU and six other countries - Canada, Mexico, Australia, Argentina, Brazil, South Korea - from tariffs of 25% on steel and 10% on aluminium which came into effect on Friday.Mrs May said: \nWe have been working very hard to secure an EU-wide exemption to the steel tariffs that the Americans have announced. \nI am pleased that they have announced a temporary exemption for the EU. What I will be working with my fellow EU leaders today on is to see how we can secure a permanent exemption for the EU from these steel tariffs. \nWe will be talking about what the next steps might be. I have stayed on to talk about these next steps because the steel industry is hugely important to the UK and the British Government and I want to ensure that steel workers and their jobs are properly safeguarded. Prime Minister Theresa May (Image: AP) 9:07 Jonathon Manning Fever-Tree founder banks £82.5m in shares sales Charles Rolls, left, and Tim Warrillow of Fever Tree mixer company. Mr Rolls has sold a 3.9% stake in the firm. 9:02 Take a look around NETPark form the air 9:00 Jonathon Manning NETPark opens £7.4m Explorer facility to attract high tech firms to region \nA new £7.4m development designed to be a home for high tech businesses has opened in County Durham. \nThe new Explorer facilities were officially opened by Stuart Martin, chief executive of the Satellite Applications Catapult, who visit the centre at its base at the North East Technology Park (NETPark). \nThe Explorer building has already proven to be a success after winning two new tenants, X-ray imaging specialist Ibex and electronics firm PragmatIC, before its official opening. \nCoun Simon Henig, leader of Durham County Council, said: \nNETPark is already home to some of the world’s most innovative businesses and the Explorer development will open up even greater opportunities for companies to grow and flourish here. \nThis expansion demonstrates our commitment to creating a bright future for people who live, work and study in County Durham and we are confident these new facilities will attract further investment to our region. \nNETPark is the only science park in the UK to boast two catapult centres – High Value Manufacturing, the catalyst for the future growth and success of manufacturing, and Satellite Applications, which supports companies by opening up opportunities using satellite data and technology. \nThe building was opened after Business Durham received a £3.2m investment from the North East Local Enterprise Partnership’s Local Growth Fund. \nBrian Archer, managing director of Business Durham said: \nNETPark offers a dynamic environment for high-tech companies wanting to make a big impact in global markets. The exceptional facilities at the Explorer development only strengthens its offering to companies wanting to grow and locate here going forward. (L-R) IBEX CEO Neil Loxley, Business Durham MD Brian Archer, Satellite Applications Catapult CEO Stuart Martin, Coun Bill Kellett, and PragmatIC COO Ken Williamson (Image: Stuart Boulton) 8:55 Jonathon Manning Next profits slide after high street sales slump \nRetail giant Next has posted falling profits for the second consecutive year, and warned that 2018 will remain challenging as the sector faces intense pressure.In further signs of pain on Britain’s high streets, Next reported an 8.1% fall in annual pre-tax profits to £726.1m, while total sales slid 0.5% to £4.1bn.Sales were dragged lower by a 7.9% slump in revenue at its shops to £2.1bn, while online revenue grew 9.2% to £1.88bn, helping to soften the blow.Next pointed to “product ranging errors and omissions” as contributing to the poor showing, as well as the shift away from consumer spending on clothing.Chief executive Lord Simon Wolfson said: \nIn many ways 2017 was the most challenging year we have faced for 25 years. \nA difficult clothing market coincided with self-inflicted product ranging errors and omissions. \nAt the same time, the business has had to manage the costs, systems requirements and opportunities of an accelerating structural shift in spending from retail stores to online. Next's new flagship store at intu Metrocentre (Image: intu Metrocentre) 8:50", "external_links": [], "published": "2018-03-23T11:30:00.000+03:00", "crawled": "2018-03-24T06:05:44.003+03:00", "highlightTitle": ""}