{"organizations": [], "uuid": "bbb82fb3d11dde012000fc0aea13a43f701bb967", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14424085.ece/ALTERNATES/s1200/CFR_NJL_160318lanchester_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/lanchester-group-aiming-record-year-14422524", "country": "GB", "domain_rank": 21960, "title": "Lanchester Group aiming for record year after 11% dip in turnover", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-18T10:00:00.000+02:00", "replies_count": 0, "uuid": "bbb82fb3d11dde012000fc0aea13a43f701bb967"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/lanchester-group-aiming-record-year-14422524", "ord_in_thread": 0, "title": "Lanchester Group aiming for record year after 11% dip in turnover", "locations": [], "entities": {"persons": [{"name": "tony cleary", "sentiment": "none"}, {"name": "tony", "sentiment": "none"}, {"name": "veronica cleary", "sentiment": "none"}], "locations": [{"name": "lanchester wines", "sentiment": "none"}], "organizations": [{"name": "lanchester group", "sentiment": "neutral"}, {"name": "business lanchester group", "sentiment": "neutral"}, {"name": "county durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Lanchester Group aiming for record year after 11% dip in turnover Heavy investments and a poor global harvest are among the factors which affected the County Durham group last year Share Tony Cleary with some of the products from Lanchester Gifts (Image: Lanchester Group) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Lanchester Group is optimistic for a record year after heavy investments and a poor global wine harvest knocked its annual sales and profits. \nThe County Durham group – which includes Lanchester Wines and Greencroft Bottling – has announced turnover of £65.5m for the year ending June 30 2017, an 11% drop on the previous year, resulting in depleted profits. \nThe firm, originally established as a wine merchant business by Tony and Veronica Cleary, said profitability was largely reduced by ongoing investment in property, personnel and infrastructure. \nWhile sales and profit was impacted last year, bringing to an end five years of growth, the firm said the investments are driving better sales this year and the forward planning has resulted in group-wide half year results, to December 31 2017, coming in at £50m. The bottling lines inside Lanchester Group (Image: handout from OPR) \nThe firm also splashed out on acquisitions in the accounts period, with the Lanchester group of companies now comprising Lanchester Wine Cellars Ltd, which includes Lanchester Gifts, Greencroft Bottling Company Ltd, Lanchester Energy Ltd, Lanchester Properties Ltd, Spicers of Hythe Ltd, The Wine Fusion Ltd and luxury hand-packed confectionery business Bon Bon’s (Wholesale) Ltd. \nMr Cleary said: “This was certainly a year of mixed fortunes with factors out of our control affecting our business, namely Brexit, the smallest global wine harvest since 1961 and a consolidation of suppliers. \n“However, we’re a long established group of businesses with a highly skilled team and so we’ve braced these uncontrollable elements, instead focusing on what we can influence - our future. “We’ve previously enjoyed five years’ solid growth which will which will prove hugely advantageous in our next financial year, both in turnover and profit. \n“Greencroft Bottling has seen four of its busiest months ever over the last six and is tracking to fill close to 100m litres this calendar year – a record for our business. Read More Gender pay gap in North being fuelled by male dominated boardrooms \n“Due to circumstances outside of our control, some customer volumes dropped through the financial year 2016/17 and the board made the conscious decision to retain all staff through this period at a cost of over £1m. We’re a family business and see our team as part of our family. \n“While this £1m is a significant figure, we balanced it against the wider impact it would have had on our team and the local economy. This decision is already showing a return as the business is tracking towards a record year in 2017/18. \n“We’ve also added two new businesses to our group in The Wine Fusion - the majority share was acquired December 2016 – and Bon Bon’s, further extending our expertise in different areas.” Read More Newcastle's bar and restaurant scene is booming, with bars opening faster than London \nOngoing investment in property has seen the value of the group’s asset base increase to £65m, including its three Tyneside warehouses revalued to almost £30m. The properties have benefitted from a substantial modernisation programme and further ongoing investment into renewable heat generation. \nFurther development of the Lanchester-owned Greencroft Estate is nearing completion, which will provide the company’s headquarters with a new secure entrance road, truck stop with capacity for 50 trucks and 280 vehicle staff car park. Read More How the Newcastle Film Festival hopes to create a whole new North East industry \nMr Clearly added: “At Greencroft Bottling, two new production lines are fully commissioned and the new ERP system is delivering greater flexibility and efficiencies. We continue to invest in training and new machinery to keep us ‘the most modern wine bottling facility in the world’. \n“Presently, we expect a record year in the financial year 2017/18 and are well on track to achieve this goal.” Like us on Facebook", "external_links": [], "published": "2018-03-18T10:00:00.000+02:00", "crawled": "2018-03-18T10:10:17.005+02:00", "highlightTitle": ""}