{"organizations": [], "uuid": "610522baf04a5992e23806090dd12e17e707d31b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1365132.ece/ALTERNATES/s1200/4227874_e3d95fdd.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/spring-conference-focus-beef-birds-1365133", "country": "US", "title": "Spring conference to focus on beef, birds and beauty", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-21T14:42:00.000+02:00", "replies_count": 0, "uuid": "610522baf04a5992e23806090dd12e17e707d31b"}, "author": "Lewis Clarke", "url": "https://www.devonlive.com/news/devon-news/spring-conference-focus-beef-birds-1365133", "ord_in_thread": 0, "title": "Spring conference to focus on beef, birds and beauty", "locations": [], "entities": {"persons": [{"name": "rachel thomas", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}], "locations": [{"name": "dulverton town hall", "sentiment": "none"}], "organizations": [{"name": "21st century hobhouse review", "sentiment": "none"}, {"name": "exmoor society", "sentiment": "none"}, {"name": "exmoor national park authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Spring conference to focus on beef, birds and beauty The event takes place on Friday April 20 at Dulverton Town Hall Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBeef, Birds & Beauty – A New Future for National Parks? That is the theme for the 2018 Spring Conference, organised by The Exmoor Society. \nThe conference in partnership with Exmoor National Park Authority, takes place on Friday April 20 at Dulverton Town Hall. \nThe Government’s 25-year Environment Plan states that the creation of designated landscapes has been among the most outstanding environmental achievements of the past 100 years. At the same time, it has set up a 21st Century Hobhouse Review of the English National Parks and ANOBs. Michael Gove, Secretary of State for the Environment, has described the present period as ‘a moment unfrozen in time’ because of the ability to shape a post-Brexit world. Read More Snowed-in nurse told to 'make up lost hours or take it as holiday' by 'unfair' Devon hospital trust \nRachel Thomas from the Exmoor Society said: “National Parks are special places where nature and people over time have produced areas of distinct character with significant ecological, biological, cultural and scenic values. \n“The conference will explore how they can remain special, what changes are needed in delivering their purposes and enhancing their environments, landscapes and communities.” An image from Exmoor \nLord Gardiner of Kimble, Defra Minister for National Parks, will address the conference and launch the Exmoor National Park Partnership Plan 2018-23. Merrick Denton-Thompson, President of the Landscape Institute, will discuss the importance of a landscape-led approach in managing National Parks and Sarah Howes of Plymouth University will illustrate the health and wellbeing benefits of National Parks. There will be opportunities for delegates to contribute their views, as well. \nRachel Thomas added: “Exmoor itself has taken the lead by producing a post-Brexit agri-environmental scheme. Called the Exmoor’s Ambition, the National Park Authority and Exmoor Hill Farming Network have brought out a detailed transformative proposal for sustaining and enhancing Exmoor’s farmed landscape and communities after Brexit. Read More Discover the magic of Peter Pan with Dulverton Players \n“Following on from last year’s conference exploring Natural Capital and addressed by Dieter Helm, chairman of the Government’s Natural Capital Committee, The Exmoor Society has commissioned an Exmoor Register of Natural/Cultural Capital Assets, trialled on three Exmoor farms. The Register will be revealed for the first time at the Conference by Robert Deane of Rural Focus Ltd.“ \nPlaces are limited and fill quickly, so early booking is advised and at least before April 13, cost £20. Street, Dulverton TA22 9DJ. 01398 323335 Like us on Facebook ", "external_links": [], "published": "2018-03-21T14:42:00.000+02:00", "crawled": "2018-03-21T15:17:19.011+02:00", "highlightTitle": ""}