{"organizations": [], "uuid": "afd90261517884d8df9f6a8e232565a102b308ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14339000.ece/ALTERNATES/s1200/invest-in-the-north-east-3.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14429160", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Invest in the North East launched to make region a better place", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-19T10:30:00.000+02:00", "replies_count": 0, "uuid": "afd90261517884d8df9f6a8e232565a102b308ac"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14429160", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Invest in the North East launched to make region a better place", "locations": [], "entities": {"persons": [{"name": "zafar khan", "sentiment": "none"}, {"name": "richard adam", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "enforcement division", "sentiment": "none"}, {"name": "financial reporting council", "sentiment": "none"}, {"name": "frc", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "French shopping centre giant makes takeover approach for Hammerson The Bullring shopping centre in Birmingham 9:10 Jonathon Manning Jules B founders launch new fashion firm - and open two new North East stores \nThe founders of popular fashion retailers Jules B have launched a new designer clothing company and opened two new stores. \nJulian and Rhona Blades launched the Newcastle-based upmarket clothing company Jules B in 1985 and have since grown it into an £9.8m turnover business with stores in Newcastle, Yarm and Kendal, as well as websites bringing in sales from around the globe. \nNow the pair have launched Zen Warbrobe, a sister clothing company which aims to serve women looking for unique fashions, rather than well-known designer labels. \nTwo new stores have opened in Acorn Road, Jesmond, Newcastle, and Yarm High Street – close to the firm’s existing Jules B stores – creating a raft of jobs. \nMrs Blades said: \nOur Jules B stores have been dressing the stylish women of the North of England for over 30 years and we’re delighted to open the doors to the two new stores in Jesmond and Yarm. \nWe wanted to offer our customers something different and each Zen Wardrobe store has been designed to reflect the sense of luxury that comes with each of our handpicked brands. \nMrs Blades said Zen Wardrobe offers a new customer shopping experience that focuses on shape, texture, colour and accessories, rather than designer brands. \nAlongside the designer clothing, the new business is home to Zen Wardrobe Jewellery, which has been designed to complement each label sold in Zen Wardrobe. Jules B owners Julian Blades and wife Rhona (Image: Handout) 9:05 KEY EVENT Carillion's finance bosses to be investigated by watchdog \nBritain’s accountancy watchdog has launched an investigation into two finance bosses of collapsed construction giant Carillion. \nThe Financial Reporting Council (FRC) has embarked on a probe into former group finance directors Richard Adam and Zafar Khan over financial statements made during their tenures. \nThe investigation will cover statements for the year ending December 31 2014, 2015 and 2016, the six-month period to June 30, 2017, and the preparation and reporting of other financial information between 2014-2017. \nIn a statement the FRC said: \nThe investigation will be conducted by the FRC’s Enforcement Division, and will consider whether the auditor has breached any relevant requirements, in particular the ethical and technical standards for auditors. \nSeveral areas of KPMG’s work will be examined including the audit of the company’s use and disclosure of the going concern basis of accounting, estimates and recognition of revenue on significant contracts, and accounting for pensions. A Carillion worker (Image: PA) 9:20 Jonathon Manning Lanchester Group aiming for record year after 11% dip in turnover \nThe Lanchester Group is optimistic for a record year after heavy investments and a poor global wine harvest knocked its annual sales and profits. \nThe County Durham group – which includes Lanchester Wines and Greencroft Bottling – has announced turnover of £65.5m for the year ending June 30 2017, an 11% drop on the previous year, resulting in depleted profits. \nThe firm, originally established as a wine merchant business by Tony and Veronica Cleary, said profitability was largely reduced by ongoing investment in property, personnel and infrastructure. \nWhile sales and profit was impacted last year, bringing to an end five years of growth, the firm said the investments are driving better sales this year and the forward planning has resulted in group-wide half year results, to December 31 2017, coming in at £50m. \nThe firm also splashed out on acquisitions in the accounts period, with the Lanchester group of companies now comprising Lanchester Wine Cellars Ltd, which includes Lanchester Gifts, Greencroft Bottling Company Ltd, Lanchester Energy Ltd, Lanchester Properties Ltd, Spicers of Hythe Ltd, The Wine Fusion Ltd and luxury hand-packed confectionery business Bon Bon’s (Wholesale) Ltd. \nMr Cleary said: \nThis was certainly a year of mixed fortunes with factors out of our control affecting our business, namely Brexit, the smallest global wine harvest since 1961 and a consolidation of suppliers. \nHowever, we’re a long established group of businesses with a highly skilled team and so we’ve braced these uncontrollable elements, instead focusing on what we can influence - our future. \nWe’ve previously enjoyed five years’ solid growth which will which will prove hugely advantageous in our next financial year, both in turnover and profit. \nGreencroft Bottling has seen four of its busiest months ever over the last six and is tracking to fill close to 100m litres this calendar year – a record for our business. Tony Cleary with some of the products from Lanchester Gifts (Image: Lanchester Group) 9:00 Jonathon Manning Newcastle's bar and restaurant scene is booming, with bars opening faster than London \nThe number of bars, restaurants and other licensed premises opening in Newcastle have outpaced those opening their doors in London, new research has revealed. \nNewcastle was home to 397 licensed premises in 2017 after the number of bars and restaurants grew by 15.7% over the last five years, according to data analysed by consultancy firm CGA on behalf of the Northern Restaurant & Bar trade show. \nThe analysis also shows that Newcastle has more licenced premises than a number of larger cities, including Leeds (which has 341), Cardiff (220) and Bradford (107). \nJamie Campbell, retail business unit director at CGA, said: \nOf course London is a much bigger restaurant and bar scene in absolute terms, but percentages don’t lie, the change in the cities in the North is more pronounced and has a proportionally greater impact on diners, whether residents or tourists. \nMoreover we are working on additional data which shows that growth in the region is indeed being driven by independents, with the featured Northern cities showing an increase in independent outlets at over twice the national rate. \nThe wider Tyne Tees area was one of the few regions in the country not to see its bar and restaurant numbers fall over the last five years, with the number remaining flat. \nAll other regions of the UK saw more bars and restaurants close than open, though the “M62 corridor” - which spans Liverpool, Manchester and Leeds - was seen as a particular hotspot for restaurant and bar openings. Barrio Comida on Newcastle's Quayside (Image: Newcastle Journal) 8:55 KEY EVENT Hays Travel boosts profits as expansion plans take off \nNorth East travel agent Hays Travel boosted its operating profit by nearly £3m last year after the company’s expansion strategy began to take shape. \nHays Travel saw its operating profit grow from £6.4m to £9.3m for the year ending October 2017. Turnover also grew by £4.3m to £337.8m. \nThe grow was achieved after Hays Travel opened new branches, acquired firms, and struck a partnership deal with WHSmith. \nJohn Hays, managing director at Hays Travel, said: \nDuring the year we opened six new retail branches and this expansion is scheduled to continue during 2018/18. As part of this strategy, we signed an exclusive deal to open concessions in WHSmith shops. We have opened four outlets after the financial year-end, and one more is expected to open across the country in the next few weeks. \nWe acquired four companies during the financial year. One Christine Nugent Business Travel, is a corporate travel business based in Gateshead, and I am excited with the opportunity this acquisition will bring for developing business travel sales throughout the group. \nProspects for the forthcoming year are encouraging with strong like-for-like trading in the first quarter. John Hays of Hays Travel 8:50 Jonathon Manning Government too 'distracted' by Brexit to kick-start UK growth, says Chamber \nThe Government has become “distracted” by Brexit and failed to stimulate economic growth in the UK, the head of the British Chamber of Commerce (BCC) has said.The business group raised its GDP forecast for 2018 from 1.1% to 1.4%, and 1.3% to 1.5% for 2019, saying this was a result of stronger than expected consumer spending.Its first forecast for 2020 predicts growth of 1.6%.But despite the upgrades, UK growth is set to remain well below the historical average throughout the forecast period.The latest forecast also implies the country will remain among the worst performing economies in the G7 until 2020 at the earliest.Dr Adam Marshall, director general of the BCC, said: \nPolitical uncertainty aside, the biggest brake on higher UK growth is a lack of concerted action to ‘fix the fundamentals’ here at home, with Government attention distracted by Brexit. \nThe power to kick-start the UK economy, and raise the trend rate of growth above the current sluggish levels, lies in Westminster, not in Brussels - and businesses will respond to action by delivering investment, higher productivity, and the increased wages we all want to see. \nThe business group also said it expects public sector net borrowing over the next three years to be £13.4 billion higher than predicted by the Office for Budget Responsibility in last week’s Spring Statement.In 2017/18, the BCC predict that public sector net borrowing will total £49.7bn, falling to £45.8bn in 2018/19 and £34bn in 2019/20.Further positive change is expected in the growth of average earnings, which the BCC upgraded from 2.5% to 2.7% in 2018 and forecast rises of 2.9% in 2019 and 3.0% in 2020.And inflation is expected to decrease, with 2.9% forecast for this year, 2.6% in 2019 and 2.2% in 2020.The UK’s export performance is expected to remain robust on the back of strong global growth, particularly in key markets such as the Eurozone and US.Imports are also likely to continue to grow, meaning the contribution of net trade to UK GDP growth over the near term is to be limited.Dr Marshall said: \nWhile many individual businesses are doing well, the inescapable conclusion from our forecast is that the UK economy as a whole should be performing better than it is, given robust and sustained global growth. \nAlthough strong global conditions have given the UK a bit of a boost through higher export demand in recent months, we have serious concerns about the potential for further growth here at home when the performance of key trading partners slows. \nSustained skills and labour shortages are also a real issue, with businesses reporting significant difficulties recruiting and retaining the people they need. \nSuren Thiru, the BCC’s head of economics, added: \nOur forecast implicitly assumes a relatively smooth Brexit with a transitional arrangement where trading conditions will be largely unchanged. \nFailure to achieve such an outcome would likely weigh on UK economic activity over the near term. Prime Minister Theresa May (Image: PA) 8:45", "external_links": [], "published": "2018-03-19T10:30:00.000+02:00", "crawled": "2018-03-19T11:11:18.039+02:00", "highlightTitle": ""}