{"organizations": [], "uuid": "be305a6319ccb123f220f9793059c30150b56965", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14396339.ece/ALTERNATES/s1200/rkr_njl_290616sally.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-mean-less-money-more-14396227", "country": "GB", "domain_rank": 21960, "title": "Brexit will mean less money and more work for North East charities as they fight against hatred", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-11T15:06:00.000+02:00", "replies_count": 0, "uuid": "be305a6319ccb123f220f9793059c30150b56965"}, "author": "Laura Hill", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-mean-less-money-more-14396227", "ord_in_thread": 0, "title": "Brexit will mean less money and more work for North East charities as they fight against hatred", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "young", "sentiment": "none"}, {"name": "sally young share laura hill", "sentiment": "none"}, {"name": "sally young", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "ncvs", "sentiment": "none"}, {"name": "newcastle council for voluntary service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit will mean less money and more work for North East charities as they fight against hatred That's the warning from the head of the Newcastle Council for Voluntary Service, Sally Young Share Laura Hill Local Democracy Reporter 13:06, 11 MAR 2018 Sally Young, Newcastle Council for Voluntary Service chief executive Share Get daily   Thank you for subscribing!   \nMore problems and less money - that’s the impact Brexit is likely to have on charities in the North East, a report has revealed. \nUncertainty surrounds the sector, especially for the long term, Sally Young, chief executive of the Newcastle Council for Voluntary Service (NCVS) has told the city council. \nAn estimated £400m of funding from the EU could be lost once the UK has left the EU, a report to the voluntary sector liaison group said. \nMs Young said the region will be disproportionately affected by the loss of EU charitable funds as the area has benefitted from schemes. \nShe said: “Several tens of millions of pounds of that money will have been spent in the North East. \n“A lot of money was spent in the region, especially in relation to worklessness and jobs and training and that will be lost.” \nAnd it is difficult for charities to plan for the future as they struggle to understand how the economy will be impacted, Ms Young claims. \nMs Young says in the report: “Given the high levels of feeling and political divisions, it is hard to get an objective analysis.” \nShe described the leaked Government Brexit analysis which revealed the North East’s economy would shrink by 11% with a trade deal or 16% without as “depressing”. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAnd charities across the region will be impacted in a similar way to many small and medium businesses, the report predicts. \nIt may be more difficult to employ EU staff, it is feared, and the impact on EU nationals who want to volunteer hasn’t even been considered yet. \nAll the while many charities will be dealing with more work. EU and Union flags (Image: PA) \nA recession caused by a hard brexit could lead to job losses and more people looking for charity support as they face economic crisis. \nAnd many charities are increasing the work they do to target hate crime and community divisions after a spike in the number of hate crimes reported since the Brexit vote. Read More", "external_links": [], "published": "2018-03-11T15:06:00.000+02:00", "crawled": "2018-03-11T15:42:43.024+02:00", "highlightTitle": ""}