{"organizations": [], "uuid": "dfa8f0b517abd6d1509e97c417be74b048e9b95f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.nottinghampost.com/incoming/article1308865.ece/ALTERNATES/s1200/BUCK_Mums_Lanes-1.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/whats-on/shopping/mums-should-go-morrisons-sunday-1308502", "country": "GB", "domain_rank": 48128, "title": "Why mums should go to Morrisons this Sunday - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.615, "site_type": "news", "published": "2018-03-07T13:40:00.000+02:00", "replies_count": 0, "uuid": "dfa8f0b517abd6d1509e97c417be74b048e9b95f"}, "author": "Isaac Ashe", "url": "https://www.leicestermercury.co.uk/whats-on/shopping/mums-should-go-morrisons-sunday-1308502", "ord_in_thread": 0, "title": "Why mums should go to Morrisons this Sunday - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "morrisons", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "morrisons", "sentiment": "negative"}, {"name": "ryanair", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why mums should go to Morrisons this Sunday Free flowers and express lanes too Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSupermarket giant Morrisons is planning to make Mother's Day extra special for shopping mums this Sunday. \nThe chain's Leicestershire stores will be laying on free flowers and opening up 'mum-only' tills to help make the trip as enjoyable as possible before mums get home and put their feet up for Mothering Sunday. \nMorrisons say 37 percent of mums will visit a supermarket on Mother's Day to do the weekly shop, so they've laid on a few treats to make it as nice as possible. Read More 'No more cheap holidays' warns Ryanair chief in Brexit tirade \nEach lane will be staffed by checkout assistants specially selected for their friendliness. Assistants will offer to scan items at a speed to suit each individual mum - whether they want a relaxed pace and a chat, or a quick checkout as they are in a rush. They will also will help pack the shopping, should mums wish. Morrisons is opening special checkout lanes this Mother’s Day to ease mums through their shopping trip (Image: Mikael Buck / Morrisons) \nIn addition, Morrisons staff will help entertain the children - by asking them to identify different sorts of supermarket products and by inviting them to see how they operate the tills. The aim is to make the shopping experience as easy and enjoyable as possible for mums and their families. \nAnd more than 30,000 pink Gerbera flowers from Morrisons Flowerworld will be given to mums as they pass through the checkout on the day. Read More Ever wanted to delete a message? WhatsApp making it even easier to do \nMorrisons stores in Leicester, Loughborough, Melton Mowbray, Coalville, Lutterworth and Hinckley will be among those participating. \nA spokesman for Morrisons said: \"The reality of Mother’s Day is that some mums end up doing lots of chores! \n\"So, for mums who shop with us on this special day we want to serve them better by creating a ‘Mum’s Lane’ checkout.” Like us on Facebook ", "external_links": [], "published": "2018-03-07T13:40:00.000+02:00", "crawled": "2018-03-07T15:57:52.063+02:00", "highlightTitle": ""}