{"organizations": [], "uuid": "02a497da5161c97dc54260e9fc6900f613403849", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14463802.ece/ALTERNATES/s1200/COR_MGA_150517mgaseahouses__01.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/homes-businesses-northumberland-protected-flooding-14463041", "country": "GB", "domain_rank": 21960, "title": "Homes and businesses in Northumberland to be protected from flooding thanks to £6.5m cash injection", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-28T07:00:00.000+03:00", "replies_count": 0, "uuid": "02a497da5161c97dc54260e9fc6900f613403849"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/homes-businesses-northumberland-protected-flooding-14463041", "ord_in_thread": 0, "title": "Homes and businesses in Northumberland to be protected from flooding thanks to £6.5m cash injection", "locations": [], "entities": {"persons": [], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "seahouses", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}], "organizations": [{"name": "tyne mills", "sentiment": "none"}, {"name": "environment agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Homes and businesses in Northumberland to be protected from flooding thanks to £6.5m cash injection The main pier at Seahouses, protecting 140 properties and the town’s picturesque harbour, will be regenerated with the Government money Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North East is set to benefit from a £6.5m cash boost to protect homes and businesses from flooding, enhance the environment and boost economic growth. \nIn Northumberland, the main pier at Seahouses, protecting 140 properties and the town’s picturesque harbour, will be regenerated in a Northumberland County Council project thanks to an extra £2.9m. \nAnd in Hexham, £3.7m has been allocated towards a £5m flood alleviation scheme which will be delivered by the Environment Agency at Tyne Mills and Bridge End Industrial Estates. A sunny day in Seahouses (Image: jane laurie) \nWork is ongoing to secure the remainder of the funding to progress this scheme. \nThe funding was announced by Environment Minister Thérèse Coffey, who said 25 new schemes around the country will receive a share £36m announced in the Autumn Statement to improve flood protection. \nLeila Huntington, flood risk manager for the Environment Agency in the North East, said the funding would allow a planned major overhaul of Seahouses pier to go ahead. \nShe said: “This funding is fantastic news for the North East which ensures Northumberland County Council’s vital work at Seahouses can go ahead imminently and we are one step closer to bringing our project to protect industry in Hexham to fruition. \n“The council’s plan to refurbish the iconic Seahouses pier – an important coastal defence – will start in April, ensuring it will continue to protect the community into the future A women is carried through the rising water near Hexham (Image: Daily Mirror) \n“And we are delighted to have secured £3.7m towards a flood alleviation scheme delivered by the Environment Agency that will significantly reduce the risk of flooding to two important industrial estates at Bridge End and Tyne Mills in Hexham.” \nShe added: “We understand how devastating it is to be flooded and this investment in two key areas of Northumberland ensures we are able to take great strides in providing flood alleviation schemes. \n“We’ll continue to work with our partners and look for opportunities to reduce the risk of flooding and provide support for our at risk communities.” Read More Ministers forced to explain decision to produce blue post-Brexit passports in France \nCouncillor Glen Sanderson, cabinet member for environment and local services at Northumberland County Council, added: “This is excellent news for two major schemes in the county. \n“Both these projects will help to safeguard key economic and employment sites, give existing businesses greater security and confidence to grow and hopefully will encourage others to relocate here. \n“We know only too well the devastating effects flooding can have - our Tyne Mills Depot in Hexham was badly damaged by water in 2015. Read More Labour anti-Semitism row: We asked MPs if the party has an issue with Jews and this is what they said \n“The scheme to improve the flood protection at Tyne Mills, which is our key base for delivering key public services across the Tyne Valley and where many of our staff work from when responding to flooding incidents, is therefore very much welcomed.” \nOne of the biggest beneficiaries is Hull, where £12m will improve the defences along the River Hull. Like us on Facebook", "external_links": [], "published": "2018-03-28T07:00:00.000+03:00", "crawled": "2018-03-28T08:21:55.030+03:00", "highlightTitle": ""}