{"organizations": [], "uuid": "c97ff15037330de893caf46cafe7f4a6890adf10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1361450.ece/ALTERNATES/s1200/Kevin-Harris-Leicester-OMP.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/top-leicester-accountant-kevin-harris-1361469", "country": "GB", "domain_rank": 48128, "title": "Top Leicester accountant Kevin Harris promoted to managing partner of RSM in Grove Park", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-20T13:24:00.000+02:00", "replies_count": 0, "uuid": "c97ff15037330de893caf46cafe7f4a6890adf10"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/top-leicester-accountant-kevin-harris-1361469", "ord_in_thread": 0, "title": "Top Leicester accountant Kevin Harris promoted to managing partner of RSM in Grove Park", "locations": [], "entities": {"persons": [{"name": "kevin harris", "sentiment": "negative"}, {"name": "top leicester", "sentiment": "negative"}, {"name": "grov", "sentiment": "none"}, {"name": "ben lawrance", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}], "locations": [{"name": "castle donington", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}], "organizations": [{"name": "grove park top leicester", "sentiment": "negative"}, {"name": "invalid email", "sentiment": "none"}, {"name": "leicestershire economic partnership", "sentiment": "none"}, {"name": "pkf cooper parry", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top Leicester accountant Kevin Harris promoted to managing partner of RSM in Grove Park He replaces Ben Lawrance who has led the city office for several years Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nKevin Harris has been promoted to managing partner of the Grove Park, Leicester, office of audit, tax and consulting firm RSM. \nMr Harris, a member of the Leicester and Leicestershire Economic Partnership (LLEP) board, joined the firm last summer after quitting his position as partner at Castle Donington independent PKF Cooper Parry . \nHe has replaced Ben Lawrance who has stepped down to focus on his role as regional audit managing partner. \nThe office has around 100 staff, with room for up to 150 . \nMr Harris has 23 years experience as an auditor and adviser to local SMEs and has been a partner in the Leicester area for 17 years. \nHe founded and managed PKF Cooper Parry’s Leicester office and helped with its move to Castle Donington. Kevin Harris moved from PKF Cooper Parry to RSM in Grove Park, last year \nHe said: “ RSM has a great team here in Leicester and I am very proud to have been asked to lead it. \n“Given the current uncertainty around the economic impact of Brexit, the next few years could be quite challenging for local businesses as they adapt to the new environment. \n“I am determined that RSM will support all of our clients throughout this period to be agile and to take advantage of new opportunities.” \nMark Taylor, RSM’s regional managing partner, said: “I’m delighted that Kevin has agreed to take on this role. \n“He is a natural leader, an expert business adviser and he is well-known across the region. \n“His leadership will, I am sure, be appreciated by all of RSM’s clients across the East Midlands. \n“I’d also like to thank Ben for his hard work over the last four years. \n“He has played a key role in developing our Leicester office and helping to raise the profile of the RSM name in the local market since our rebrand in 2015, and I’m delighted that he will continue to lead and grow our regional audit team.” \nAs well as being vice-chairman of the LLEP, Mr Harris is vice-president of the East Midlands Chamber of Commerce, which recently announced RSM as a strategic partner. \nHe is a past chairman of the former Leicestershire Chamber of Commerce. Kevin Harris (left) has replaced Ben Lawrance as office managing partner (Image: Peter Fothergill) \nWhen he joined RSM as an audit partner he said he was looking forward to being based closer to Leicester and working with a firm that was expanding its work with local and regional businesses. \nLast year he said his number one reason for joining RSM was to be at a company that had “ambitions to grow”, saying there was no reason why the Leicester office couldn’t double the number of clients within five years. \nHe said at the time: “The thing about RSM is the infrastructure and size, and you are able to use those tools in the market. \n“I will be working with the SME market – broadly speaking businesses with turnovers in the region of £10-100 million – and predominantly my role will be in building the RSM brand and its market position in Leicestershire. \n“When I left Cooper Parry I took stock of what to do next and decided there were a number of things I really wanted to do. Read More \n“One was to get back into Leicester, because I think when you are regionalised you do lose out on the ground. \n“I also wanted somewhere with a clear desire to grow market share in Leicestershire. \n“RSM had gone through the rebranding [from Baker Tilly in the UK a couple of years ago] and the time was right to push forward the RSM brand locally – which is what I had done, I think successfully, with Cooper Parry. \n“This had all the right ingredients – the people, the desire, the service range, client base and the investment. \n“I did speak with a number of firms and this was the one with the desire to grow in Leicester and was prepared to put the money and investment behind that. \n“The key message is that RSM very much sees the regions and the East Midlands as really good areas to invest in. Read More \n“By contrast, a lot of firms in our profession are focusing on centralised strategies. Read More \n“Given that the market in Leicester has seen significant growth among mid-market SMEs, there’s a real desire from a lot of business owners to have local support.” Like us on Facebook ", "external_links": [], "published": "2018-03-20T13:24:00.000+02:00", "crawled": "2018-03-20T13:44:41.001+02:00", "highlightTitle": ""}