{"organizations": [], "uuid": "61440b8ab69c2501ca80784673b77ad5e25e5eb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14466954.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-brexit-means-what-people-14466802", "country": "GB", "domain_rank": 21960, "title": "What Brexit means to me - what the people of the North East think about it", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-29T13:00:00.000+03:00", "replies_count": 0, "uuid": "61440b8ab69c2501ca80784673b77ad5e25e5eb9"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-brexit-means-what-people-14466802", "ord_in_thread": 0, "title": "What Brexit means to me - what the people of the North East think about it", "locations": [], "entities": {"persons": [{"name": "julie underwood", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "chamber of commerce video loading click", "sentiment": "none"}, {"name": "bcc trade outlook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 Seconds \nHere the people of the North East, in their own words, talk about their hopes and fears as the historic event looms ever larger. Julie Underwood - International trade director at North East England Chamber of Commerce Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nCurrent confidence amongst North East business remains high, but Brexit has emerged as a pressing concern. \nA recent Chamber survey indicated that changes to the EU-UK relationship was the second most influential factor, behind increased demand, for their future trading strategy. \nPost-Brexit tariffs and changes to custom procedures were the top two fears listed in the BCC Trade Outlook. \nTariffs would make businesses less globally competitive, increase base costs and the price for the consumer. Changes to customs would severely alter the border and could see initial time delays of hours, even days, if the process is not streamlined. Such a fallout would devastate regional supply chains, particularly those reliant on Just-in-Time models. \nThere’s a perception that Government has done little to alleviate these genuine concerns, instead re-hashing the same rhetoric of the last two years, further increasing business frustration. This lack of Brexit clarity, has deterred business from properly investing in Brexit preparations, as with limited time and resources, it would be impossible to prepare for every possible Brexit outcome. \nHowever, regional businesses have expressed that, with the right Government support, they can make a success of Brexit in the long term. Striking a trade deal is beneficial to both the EU & UK, so confidence is high that common negotiating ground will be found on this front, and a No Deal scenario will be avoided (Though it would be useful to know which direction we’re headed). \nBut what members really want to see is increased support and investment to help reach and develop new markets outside of the EU. If the Government-backed regional exporters, they could act as global pioneers to new markets, benefitting from increased growth, raising their brand and increasing innovation in their sector. \nNorth East businesses want to be globally competitive, and have consistently found success when they’ve begun to expand their global markets. There’s a feeling that, despite Brexit, North East exporters have done their best to promote the Britain globally, it’s about time Government repaid the favour. Beth Farhat - Regional secretary of the Northern TUC Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nI’m worried about where we are in the Brexit negotiations. \nWith only 12 months to go, the Government still hasn’t offered anything like a plan that will protect jobs, rights and livelihoods. \nLast week, the Government was claiming to have passed an important milestone by agreeing a 21-month transition period with the EU. But given how unprepared they are at this stage, it’s hard to believe that 21 months will be long enough to get the job done. \nIt doesn’t give us time to negotiate an incredibly complex trade deal with the EU, to build effective customs processes or to develop a new system for managing migration. \nSo we are facing a real risk of Britain crashing out of the EU without a deal. And if that happens, working people will bear the cost. The Government’s own analysis shows that the North East’s economy will be harder hit than any other region of the UK – shrinking by 16% if we crash out of the EU without a deal. \nIt is expected to shrink by 11% even if there is a comprehensive trade deal. This means job losses, potentially in the thousands. \nAnd then there’s the Irish border. All sides agree that there should be no return to the borders of the past, but the UK Government’s current red lines will inevitably lead to a hardening of the border. \nBoris Johnson’s big talk about technology isn’t fooling anyone – this is a circle they can’t square. \nAs for workers’ rights, Theresa May has promised they’ll be protected and enhanced. But it’s hard to believe her when her own ministers want to scrap the laws that guarantee your paid holiday, rest breaks and lunch hours, as well as ensuring that bad bosses can’t force you to work incredibly long shifts. \nThe TUC is calling for any deal with the UK to include a guarantee that British workers’ rights will keep pace with those in the rest of Europe. \nRight now, the best way we can see to achieve that –and to protect jobs and the Good Friday Agreement – is staying in the single market and customs union. Jonathan Arnott - Former UKIP, and now Independent, MEP for the North East Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nSome 17.4 million people, including 58% in the North East, voted for Brexit - more than for anything else in history. They did so despite dire warnings of World War 3 (tripe), the end of Western political civilisation (nonsense, though the establishment does require an occasional shake-up), and 500,000+ job losses (more people are in work than ever before). \nWe were assured there’d be no European Army (it’s happening). Every Remain prediction has proven not just wrong, but catastrophically wrong. \n“But Brexit hasn’t happened yet”, Remainers bleat, seeking to rewrite history; their dire predictions were from Referendum Day. The previous set of Treasury predictions having proven as wrong as only civil servants can be, the new Treasury predictions suffer precisely the same structural failings as the old, wildly-inaccurate ones. Who could be fooled now? \nBritain must regain her confidence. We’re permanent members of the UN Security Council, part of the Five Eyes network, global leaders in education and research, and one of the world’s largest economies (the whole EU27 together is only the world’s second-largest). Post-Brexit, we’ll regain our World Trade Organisation vote. Countries around the world want free trade deals with us. \nIf Brexit were abandoned, we’d never again have power to do something as normal as sign a trade deal (even Iceland does that), our courts would never be supreme (unlike every non-EU country in the world), nor would we ever control our own immigration policy (Liechtenstein currently has more power than us). Fishermen, rightly, scream blue murder at Government betrayal allowing EU vessels to plunder our waters till the end of 2020; imagine them doing so in perpetuity. \nReversing the Brexit decision would be a national embarrassment, suggesting a feeble mindset, fit only for subservience to foreign bureaucracy. \nNever again could we be taken seriously. It’d be the ultimate betrayal - the ultimate establishment two-fingered salute to voters. Brexit should be successful. \nThe only real threat is those who try to re-fight the referendum and talk Britain down, taking the EU’s side over ours on every negotiation point - seeking to sabotage Brexit in order to blame it. Read More Brexit takes place in 12 months - what has already been decided and what do we know for definite? Greg Stone - of the North East For Europe (NE4EU) campaign group \nA year to go until Brexit – or rather, until the twilight zone of the transitional period where the UK will be paying into the EU budget and subject to EU rules without any say on them. We‘ll still be paying the EU until 2064. \nAs every week passes it becomes clearer how much the UK loses by Brexit, whether on NHS staffing levels, scientific research, manufacturing jobs, or our public finances. What is less clear is how Brexit will benefit us. Freedom of movement, EU citizen rights, trade and tariffs, and the Irish border remain unresolved. The PM has bought time but few are buying her answers. \nMany in our region and across the UK are not confident that the Government – and the Opposition – really know what they are doing and where we are going. An ever growing proportion of the public admit to doubts. It is dawning even on hardcore Leave supporters that what they voted for on immigration, fisheries, and “British” passports is unlikely to happen. \nInvolvement in the Single Market now seems impossible. Some take comfort in the possibility the UK can remain in some sort of Customs Union. Others see this as something akin to believing in the existence of unicorns. The truth is the current direction of travel takes us over a cliff edge and there is no sign our leaders are taking heed. \nThe lack of clarity and lack of conviction that the Government can avoid self-created pitfalls should not detract from the brutal reality. Brexit is going to cost this country and our region. It is going to damage our standing in the world and the lives and livelihoods of many in the North East. \nWith a year to go, there are no sunlit uplands ahead. It is likely there never will be. The best course for our country is retaining our EU membership. Some seem set on finding this out the hard way – and our political system, our nation, and especially the North East will be the poorer for it. Elizabeth Temple - 20-year-old politics and history student at Newcastle University Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAlthough I value the freedom of democracy, I can’t help but feel a bit disempowered by Brexit proceedings and I get a similar impression from many of my friends. I know the ‘young-versus-old’ dichotomous split over Brexit is a bit of a cliché, but I do feel frustrated that my future may be dictated by Brexit and a Government both of which a majority of young people didn’t vote for. \nI feel anxious about job prospects as there is potential that many businesses, which have international outreach may choose to relocate abroad, which I see as completely logical financially. \nIt’s already a difficult and competitive task of finding a job out of university, and I think Brexit will enhance this. Particularly in the North East job prospects, both graduate and non-graduate, are already much lower than big metropolitan cities like London and Manchester and unemployment is higher. \nI’m conscious that in the future I might have to move away from the area; this uncertainty is disconcerting. \nAgain, its a cliché but I feel North/South divide may leave the North East even less prosperous economically. It’s no secret Westminster public expenditure per head in the North East is much lower than other parts of England, especially the South. \nLots of charities, educational institutions and businesses depend on EU funding, which many people often forget. I’m worried what Brexit will do to this area where myself and my family have always lived as I’m not convinced Westminster will replace this vital funding. \nWith 12 months to go till Britain exits the European Union, I don’t feel any clearer or more at ease about the issue of Brexit that I did when it was confirmed that we would be leaving the EU in 2016. \nI’m worried about rising intolerance and racism. Undoubtedly some people who voted for Brexit were influenced by these factors, encouraged by shameless fearmongering by Vote Leave and various media outlets. \nI celebrate diversity and multiculturalism in Britain and don’t want this to change. Xenophobic attitudes are extremely damaging and backward; particularly studying History I am reminded of how these intolerant attitudes can drastically escalate. Read More", "external_links": [], "published": "2018-03-29T13:00:00.000+03:00", "crawled": "2018-03-29T14:19:26.058+03:00", "highlightTitle": ""}