{"organizations": [], "uuid": "d3216f9881c9bb4c5f0026e20ba0a3ff13e6a476", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/music-nightlife/article1333378.ece/ALTERNATES/s1200/field2.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/whats-on/music-nightlife/its-far-rock-n-roll-1333372", "country": "GB", "title": "It's far from a rock 'n' roll lifestyle in Exeter for Field Music", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-13T14:59:00.000+02:00", "replies_count": 0, "uuid": "d3216f9881c9bb4c5f0026e20ba0a3ff13e6a476"}, "author": "devonlive", "url": "https://www.devonlive.com/whats-on/music-nightlife/its-far-rock-n-roll-1333372", "ord_in_thread": 0, "title": "It's far from a rock 'n' roll lifestyle in Exeter for Field Music", "locations": [], "entities": {"persons": [{"name": "david", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "david brewis", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "exeter phoe", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's far from a rock 'n' roll lifestyle in Exeter for Field Music Review: Field Music at Exeter Phoenix Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEntering the Phoenix, we see David Brewis, singer, guitarist and drummer of Field Music selling merchandise. Just before the gig, he is on stage setting up and tuning up. After the gig he was selling merchandise again. \nThis is a band that work hard. I’m not sure where his brother was. Perhaps it was his night off doing the admin? Then again, Peter was seen fixing the keyboard malfunction halfway through their set so he is obviously prepared to roll his sleeves up too. \nWhen the band last visited Exeter two years ago, David was struggling with a sore throat but tonight he is fighting fit and, bolstered by three additional band members, they deliver another stunning set of songs. Field Music \nNew album Open Here was released in February and the album opener, Time in Joy, was the first song of the night and the addition of a flutist for this song was a thing of joy, setting of her flute riffs against those of Peter’s guitar. \nThem that do Nothing was an early crowd favourite, coming from their 2010 album Field Music (Measure), but it is hardly a lyric that could be used to describe the Brewis brothers. \nRecent single Count it Up sees David replace Peter on lead vocals. The song is full of rage about the UK’s position in the world post Brexit. “It is my version of Material Girl,” says Brewis. Read More Tom Jones will be performing a huge concert in Devon this summer - this is how you can get tickets \nThe song Disappointed was not disappointing, especially after the extended ending they have bolted on since the last time we heard it live. The crowd get into the spirit and are commended by David for “best audience participation” of the tour so far. The Noisy Days are Over came mid set and it gave their saxophonist an opportunity to earn his money, helping make this one of the stand out songs of the night. \nNo King No Princess also stood out, being helped along in the chorus by the consistently excellent backing vocals of Liz Corney, the bands keyboard player. Stay Awake, the last song from their last album Commontime brings the set to a close before the band return for a two song encore including (I Keep Thinking About) A New Thing, and It’s Not The Only Way to Feel Happy. Read More A drive-in screening of The Rocky Horror Show is being held in Devon \nThe band are not done for the night. They have merchandise to sell. They have no roadies so will be up late packing their gear away before jumping in the van and driving to the next venue. David drives the bus too. Like us on Facebook ", "external_links": [], "published": "2018-03-13T14:59:00.000+02:00", "crawled": "2018-03-13T15:20:04.027+02:00", "highlightTitle": ""}