{"organizations": [], "uuid": "1856f0d37087016a3557134b6d4f2faf8b6320b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14041373.ece/ALTERNATES/s1200/BELGIUM_EU_151968.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/here-70-countries-uk-could-14376734", "country": "GB", "domain_rank": 21960, "title": "Here are the 70 countries the UK could LOSE trade deals with as a result of Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-07T07:00:00.000+02:00", "replies_count": 0, "uuid": "1856f0d37087016a3557134b6d4f2faf8b6320b4"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/here-70-countries-uk-could-14376734", "ord_in_thread": 0, "title": "Here are the 70 countries the UK could LOSE trade deals with as a result of Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "brexit news here", "sentiment": "negative"}, {"name": "invalid email  brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons international trade committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Here are the 70 countries the UK could LOSE trade deals with as a result of Brexit Inquiry warns trade with countries that the EU already has deals with could fall off a 'cliff edge' after Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBrexit could lead to the UK losing trade agreements with 70 countries, it has been claimed. \nSupporters of Brexit say quitting the EU will allow the UK to sign new trade deals. \nBut an inquiry by MPs warned the UK suddenly find itself excluded from more than 40 trade deals that the EU has already signed with 70 nations across the world. Read More Here's how Theresa May plans to provide more affordable homes \nIn theory, the UK can simply agree new deals which match the existing ones. \nHowever, time is running out to get new agreements in place, with Brexit due to happen on March 29 2019. \nThe House of Commons International Trade Committee, which conducted the inquiry, warned trade with the countries concerned could face a “cliff edge”. \nDeals in place do not necessarily provide complete access to foreign markets and a total end to tariffs, but they do allow trade to take place more easily than if there was no deal at all. (Image: AP) \nThe Government still needs to work out a number of important details before continuity can be achieved – and businesses, consumers, investors need certainty on what will happen to the trade deals as a matter of urgency, the MPs said. \nThe MPs said: “There is a disturbing lack of precision and clarity about the legal mechanism whereby the Government envisages EU trade agreements with some 70 countries being rolled over.” \nThey said the Government must show it has “a legally watertight and practically viable strategy for achieving ‘transitional adoption’ at the point when it will need to take effect, so that UK trade with around 70 countries does not face a ‘cliff edge’, even if no withdrawal or transition arrangements with the EU should have been agreed or ratified.” Read More Communities Secretary says councils like Northumberland are contributing to housing shortage \nCommittee chair Angus Brendan MacNeil said: “The Government is making much of the trade agreements it plans to make after Brexit, but first it needs to give us confidence that the existing agreements, on which businesses, consumers and trading partners alike rely, can be rolled over so the UK can benefit in its own right. Unless an agreement is reached with our trading partners in the coming months, a significant economic price will have to be paid.” \nHere are the countries and groups of countries the UK already has deals with as part of EU membership: Albania", "external_links": [], "published": "2018-03-07T07:00:00.000+02:00", "crawled": "2018-03-07T07:15:55.016+02:00", "highlightTitle": ""}