{"organizations": [], "uuid": "4edfaf69b29c43f1e8626278570985d7d07c34d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/news/business/article183789.ece/ALTERNATES/s1200/poundstretcher_02JPG.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/poundstretcher-chain-definitely-not-going-1364553", "country": "GB", "domain_rank": 48128, "title": "Poundstretcher chain 'definitely not in same boat as Toys R Us' says senior director", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-20T20:16:00.000+02:00", "replies_count": 0, "uuid": "4edfaf69b29c43f1e8626278570985d7d07c34d8"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/poundstretcher-chain-definitely-not-going-1364553", "ord_in_thread": 0, "title": "Poundstretcher chain 'definitely not in same boat as Toys R Us' says senior director", "locations": [], "entities": {"persons": [{"name": "poundstretcher", "sentiment": "negative"}, {"name": "hemant patel", "sentiment": "none"}, {"name": "patel", "sentiment": "none"}], "locations": [{"name": "kirby muxloe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "poundstretcher", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Poundstretcher chain 'definitely not in same boat as Toys R Us' says senior director Leicestershire discount chain is 'financially secure', despite reports Share Poundstretcher finance director Hemant Patel Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA senior director at Leicestershire company Poundstretcher has moved to quash rumours that the business could go under. \nFinance director Hemant Patel said the discount chain was financially secure - despite the parent company making a loss last year – and was continuing to open new stores. \nMr Patel said it was not going the way of chains such as Toys R Us, which is closing all 100 of its UK stores with 6,000 job losses as a consequence of online competition. \nPoundstretcher employs around 6,000 people in 400 stores nationwide, with around 100 staff at its UK headquarters in Kirby Muxloe. \nMr Patel said: “It is tough, but we are financially in a very good position and the banks are really happy with us. \n“We work well within our overdraft facilities at all times and every supplier and creditor is paid on the due date. \n“We are definitely not in the same boat as Toys R Us. Poundstretcher continues to open new stores \n“We are in the discount sector for fast-moving goods and homewares. The chains that are trouble, like Toys R Us, are American owned with huge stores and high rents. \n“A lot of what they sell can be bought cheaper online now. \n“Our staff do not have any concerns and none of the senior staff are worried. \n“I would say to them we are financially sound, with nothing stopping us opening new stores or buying stock in.” \nMr Patel refuted national reports which claimed Poundstretcher’s parent company, Crown Crest, had been subject to concerns about credit insurance, designed to protect suppliers that are owed money from losing out if the company they supply stops trading. Read More Poundstretcher rules out takeover claims \nMr Patel said the overall Crown Crest Group, which includes a wholesale business that has been steadily shrinking in recent years, saw turnover drop around £37 million to £412 million in the year to March 31, 2107. \nHe said they had taken a £12-£13 million currency hit following the big drop in the value of sterling after the Brexit vote. \nMr Patel said turnover would drop to around £405 million this current trading year. \nA new Syston Poundstretcher store opens on Thursday. \nAnd while the overall business, which is owned by the Leicestershire Tayub family, made a loss last year, Poundstretcher made a profit of £2.5 million. \nMr Patel said Poundstretcher will have invested £9.5 million in 44 new stores and 40 refits in the year to the end of this month. \nHe said: “There is a big pipeline of store openings in the next 12 months, with between 40-50 planned, or an average of one a week. \n“If we were struggling financially we would not be opening new stores. Read More “Chink of light” in Leicester retail sector with new lettings \n“Yesterday I had three credit insurers ringing me and I was able to put them completely at ease and reassure them there were not any issues. \n“In fact they would be the first to see if their customers were not being paid on time.” Like us on Facebook ", "external_links": [], "published": "2018-03-20T20:16:00.000+02:00", "crawled": "2018-03-20T21:04:22.003+02:00", "highlightTitle": ""}