{"organizations": [], "uuid": "803cb4d2d2f86ca09ee20a5a9eff10bb8b9783bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14452539.ece/ALTERNATES/s1200/Untitled-design-2.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-eu-referendum-promises-came-14452368", "country": "GB", "domain_rank": 21960, "title": "The Brexit EU referendum promises that came true - and the ones that didn't", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-25T07:00:00.000+03:00", "replies_count": 0, "uuid": "803cb4d2d2f86ca09ee20a5a9eff10bb8b9783bc"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-eu-referendum-promises-came-14452368", "ord_in_thread": 0, "title": "The Brexit EU referendum promises that came true - and the ones that didn't", "locations": [], "entities": {"persons": [], "locations": [{"name": "getty images europe", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThere’s only a year to go until we finally leave the European Union. \nBrexit day is March 29 2019. So on Thursday, we have 12 months of EU membership left. \nIt looks like things won’t change overnight. There will be a transition period until the end of 2020. \nBut we already know that some of the claims made about Brexit are unlikely to come true. \nAnd that goes for people on both sides of the argument. £350m a week for the NHS A 'Vote LEAVE' battle bus (Image: Getty Images Europe) \nThis was one of the most famous claims of the 2016 referendum campaign. \nOf course, it was written on the side of a bus. The claim read: “We send the EU £350m a week to the EU. Let’s fund our NHS instead”. \nSupporters of Brexit insist they never promised every penny would go to the NHS. After all, they don’t control the Government (or they didn’t when the referendum took place, at least). \nThey merely meant that the UK would now have control of the money, and could make it’s own choices about how to spend it, they say. \nBut it now seems there won’t be any Brexit windfall for a while. \nPapers published by the Office for Budget Responsibility, a Treasury watchdog, predict the United Kingdom will have to pay a £37.1bn financial settlement to leave the EU - and the payments will continue until 2064. We’ll take control of the UK’s borders UK Border at Terminal 2 of Heathrow Airport (Image: PA) \nThis is a tricky one. Some Brexit supporters say they want to cut immigration. \nBut there are other supporters of Brexit who say it was never about that. \nIn any case, there was never any chance that Brexit could lead to an end to immigration. \nLatest figures show that 285,000 people come to the UK each year - from countries outside the EU. And 80,000 leave each year, but that still means far more arrive than leave. \nMost immigrants have always come from countries outside the EU, and that hasn’t changed. \nIn theory, the UK Government could stop them coming in, but that has nothing to do with Brexit. We’ll get a trade deal with the EU British Prime Minster Theresa May arrives at the Council of the European Union (Image: Getty Images Europe) \nThe one bit of the EU which almost everyone likes is the ability to trade with European countries. \nAnd during the referendum campaign, some supporters of Brexit said we’d stay in the single market. For example, Conservative MEP Daniel Hannan, a Brexit supporter, said: “Absolutely nobody is talking about threatening our place in the Single Market.” \nBut at the same time, supporters of the Leave campaign told us we’d have to quit the single market if we quit the EU. \nAnd what do you know? It turns out that’s what’s going to happen. \nHowever, this is a choice made by the Government (and backed by the Labour opposition). \nIt is possible to be in the single market even though you’ve left the EU - if you’re willing to accept that the EU makes the rules. \nWe COULD have stayed in the single market. We just decided not to. \nAnd the Brexiteers were definitely right about one thing. They said the EU would still want to trade with us after Brexit. \nJust last week, the EU agreed to talks on a trade deal. Read More Gateshead Council boss demands answers as De La Rue loses UK passport contract Northern Ireland \nSupporters of Brexit promised there will be “no change to the border between Northern Ireland and the Republic”. \nBut how is that possible? At the moment, there is freedom of movement between Northern Ireland and Ireland. \nThe UK says it wants to end freedom of movement with the EU when Brexit takes place. \nAnd given that Northern Ireland is in the UK and Ireland is in the EU, that means ending freedom of movement between Northern Ireland and Ireland - doesn’t it? \nThis is a problem nobody’s managed to find an answer to. Read More Anti-Brexit protest this weekend will be biggest Newcastle has seen, say organisers The economy will suffer because of Brexit \nDuring the referendum campaign, the ‘remain’ side predicted huge damage to the economy if we left the EU. \nGeorge Osborne , a leading remainer and the Chancellor at the time, said that 15 years after Brexit the economy would be smaller by 4% if we stayed in the single market; 6% if we signed a new trade deal, and 7.5% if we failed to sign a deal, which means using rules set out by the World Trade Organisation instead. \nObviously, we don’t know if any of this will come true. We haven’t left the EU yet. \nBut the Government’s latest economic forecasts - which they tried to keep secret - suggest the economy will be smaller by 2% if we stay in the single market, 5% if we sign a trade deal and 8% if we fall back on WTO rules. \nThis tells us that the Government’s experts still agree, more or less, with the predictions made during the referendum campaign. \nBut do note that all these figures refer to the economy being smaller than it would be if we stayed in the EU - not actually getting smaller than it is today. Read More", "external_links": [], "published": "2018-03-25T07:00:00.000+03:00", "crawled": "2018-03-25T08:20:37.056+03:00", "highlightTitle": ""}