{"organizations": [], "uuid": "a52d97b5ccb4a45679b8156c676f47ba5c6d5b11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14473827.ece/ALTERNATES/s1200/JS146890067.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/fish-flinging-blue-passports-brexit-14473816", "country": "GB", "domain_rank": 21960, "title": "Fish flinging and blue passports: Brexit Britain is a land of metaphors (and they're all rubbish)", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-29T19:01:00.000+03:00", "replies_count": 0, "uuid": "a52d97b5ccb4a45679b8156c676f47ba5c6d5b11"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/fish-flinging-blue-passports-brexit-14473816", "ord_in_thread": 0, "title": "Fish flinging and blue passports: Brexit Britain is a land of metaphors (and they're all rubbish)", "locations": [], "entities": {"persons": [{"name": "craig mackinlay", "sentiment": "negative"}, {"name": "jacob rees-mog", "sentiment": "negative"}, {"name": "anne-marie-trevelyan", "sentiment": "negative"}, {"name": "kirsty o'connor", "sentiment": "none"}], "locations": [{"name": "brexit britain", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "river thames", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "de la rue", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business opinion Conservative MPs Craig Mackinlay and Anne-Marie-Trevelyan stand with Jacob Rees-Mogg (centre) as they speak at a press conference on Embankment Pier (Image: Kirsty O'Connor/PA Wire) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFor a small period last week, a bunch of halfwits chucking some haddock into the River Thames seemed like the perfect metaphor for Brexit Britain. \nBut hang around long enough these days and something else will come along. You might think the country has hit rock bottom and there are no depths left to plumb, but give it a while and new basements of rubbishness and humiliation will soon hove into view. \nSo it was, less than 24 hours after the haddock fling, that an even more perfect image of what we have done presented itself: the news that our lovely blue passports - the symbol of all that is good about Britain taking back control of its affairs - is to be printed in France. \nCurrently the British passport is printed at the De La Rue factory in Gateshead and supports around 200 jobs. So to sum up Brexit Britain : blue passports: yay! Jobs on Tyneside: erm... \nIf there is one positive to come from these two episodes it might be the realisation that the time for metaphors and rhetorical flourishes from ex-Etonians is over. What we need instead is some facts and maybe a bit of hard thinking. How a British passport will look after Brexit and a burgundy UK passport in the European Union style format (Image: PA) \nSo when it comes to fishing, it might be worth pointing out that the industry contributes around 0.05% of our GDP. I wish the industry no ill and our coastal communities have suffered more than any in recent years, but if Brexit helps us “get back control” of our fishing waters but knackers manufacturing, that won’t have been a great deal. \nAnd here’s a hard fact on passports. De La Rue makes passports for around 40 countries, and at Gateshead prints currency for even more countries than that. I don’t want to see a single job lost on Tyneside, but a protectionist attitude to the economy is never a good option. \nIf there’s anything to be learned from the passport and fish nonsense, it is that the economy is complicated and complicated situations don’t lend themselves to metaphors, symbols or three-word slogans. \n“Taking back control” means about as much as “Making America great again” or “strong and stable”. \nThe people working at De La Rue, people who have worked in the fishing industry, and all the rest of us whose livelihoods are becoming more precarious by the day, deserve much better. \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2018-03-29T19:01:00.000+03:00", "crawled": "2018-03-29T19:55:47.082+03:00", "highlightTitle": ""}