{"organizations": [], "uuid": "5db1d61fd5a354bb3dda9d14e828c9658e4461f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14466434.ece/ALTERNATES/s1200/image1.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/immigration-passports-nhs-key-brexit-14466320", "country": "GB", "domain_rank": 21960, "title": "Immigration, passports and the NHS: Key Brexit issues as the 12-month countdown begins", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-29T07:00:00.000+03:00", "replies_count": 0, "uuid": "5db1d61fd5a354bb3dda9d14e828c9658e4461f0"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/immigration-passports-nhs-key-brexit-14466320", "ord_in_thread": 0, "title": "Immigration, passports and the NHS: Key Brexit issues as the 12-month countdown begins", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What is Article 50? Immigration \nImmigration and concerns about it - real, imagined or made up - was at the core of the Vote Leave campaign. \nAnd yet ministers have been noticeably quiet about how immigration will be controlled after the UK leaves the EU. They have not yet come up with the answer to a fundamental question - who should we let in? \nWe still await a long-promised Home Office plan which is to come in the autumn now, according to recent reports. The NHS A hospital ward (Image: PA) \nHow will the already-stretched NHS cope after Brexit ? \nThere has already been an exodus of health staff returning to their native EU country. \nAnd, if the gloomy economic predictions are accurate resulting in lower growth and productivity, how much money will the Government be prepared to put into the NHS? \nAnd could it mean more ‘privatisation by stealth’ with US companies particularly interested in the prospect? The Government has said the NHS is not for sale - but not everybody is convinced. Passports How a British passport will look after Brexit (Image: PA) \nThey’re going to be a new colour, not EU burgundy but British blue and they’re going to be made in ... France. Which is a pity for De la Rue in Gateshead which previously had the contract. Will the Government change its mind and give the contract back to De la Rue? Jobs and wages A Jobcentre Plus (Image: PA) \nTheoretically there could be a lot more jobs out there - if UK workers want them. \nAs well as in health, there are shortages at fruit and vegetable farms across the UK as a result of thousands of migrant workers leaving the UK. \nWages could, some think, shoot up. Global demand for UK exports in places such as the US or Gulf- again irrespective of Brexit – could increase the demand for labour and bid wages up to get people it the workplace. \nHowever others say slow economic growth could put the brake on wage increases. Charity funding \nMore problems and less money - that’s the impact Brexit is likely to have on charities, a report said. \nAn estimated £400m of funding from the EU could be lost once the UK has left the EU, according to a report. \nIt’s one of those issues that flew underneath the radar pre-Brexit. Workers’ rights \nMany UK workers’ rights are bound up in EU law and the unions have expressed concern the Government might let them slide. \nHowever Brits are strongly in favour of retaining these laws and regulations, according to a poll. \nThe survey, conducted on behalf of the Institute for Public Policy Research (IPPR), highlighted the current preference for retaining and even strengthening EU-derived working standards, including the Working Time Regulations and agency workers’ rights. \nWill the Government take note? Read More EU funding to the regions \nBetween 2014 and 2020, a huge £420m in EU finding was earmarked for the North East alone. \nEU money has been used to provide loans to employers, allowing them to expand, fund university research and help pay for major building projects. \nAmong the buildings and structure to benefit from EU cash is SageGateshead, the Millennium Bridge and the Toffee Factory in Newcastle. \nBut it’s unclear whether the funding will continue after Brexit takes place. \nThe Government announced plans to set up a new scheme, called the Shared UK Prosperity Fund, which will replace EU money, but it’s all gone a bit quiet. Read More Holidays A plane takes off at sunset (Image: PA) \nWill a visa - or at least a new form of travel document - be needed post-Brexit? The Government hopes not, but nothing is decided yet. \nRemember the times looking smugly at the non-EU passport queue at passport control while on a holiday in Europe? You could be the one being grinned at smugly in a couple of years time. \nAnother worry is one flagged up by consumer group Which? that holidaymakers are not being adequately informed of the risks that Brexit could pose to their plans when booking. \nWith several of the UK’s biggest tour operators selling holidays for 2019, Which? said customers should be told of the possibility of flight disruption and what compensation could be paid. \nNo legal framework yet exists to manage flights to Europe once Britain leaves the EU in March 2019, and Ryanair and Lufthansa have cautioned that planes could be temporarily grounded without an aviation deal. Like us on Facebook", "external_links": [], "published": "2018-03-29T07:00:00.000+03:00", "crawled": "2018-03-29T07:20:24.011+03:00", "highlightTitle": ""}