{"organizations": [], "uuid": "48795683989767095a925fac28e8e25bbddbecc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1375505.ece/ALTERNATES/s1200/Kate-Edginton.jpg", "site_section": "http://www.middevongazette.co.uk/farming.rss", "section_title": "devonlive - Devon News", "url": "https://www.devonlive.com/news/devon-news/young-farmers-qa-kate-edginton-1375476", "country": "GB", "title": "Young Farmers' Q&A with Kate Edginton: Championship accolade is 'dream come true' for dedicated member", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-23T14:15:00.000+03:00", "replies_count": 0, "uuid": "48795683989767095a925fac28e8e25bbddbecc8"}, "author": "Athwenna Irons", "url": "https://www.devonlive.com/news/devon-news/young-farmers-qa-kate-edginton-1375476", "ord_in_thread": 0, "title": "Young Farmers' Q&A with Kate Edginton: Championship accolade is 'dream come true' for dedicated member", "locations": [], "entities": {"persons": [{"name": "kate edginton", "sentiment": "none"}], "locations": [{"name": "gloucestershire", "sentiment": "none"}], "organizations": [{"name": "young farmers", "sentiment": "none"}, {"name": "newent young farmers", "sentiment": "none"}, {"name": "invalid email  gloucestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Kate Edginton with her certificate Share   Thank you for subscribing!   \nGloucestershire young farmer, Kate Edginton, enjoys getting stuck into all aspects of the broad YFC programme. Here she tells us a little bit more about herself and her achievements within the organisation. \nQ: Tell us a bit about yourself – what is your background / interests? \nA: I am a member of Newent Young Farmers in Gloucestershire, currently holding the position of county treasurer. I come from a farming family and whilst not directly involved with the farm, I loved growing up in the countryside. Kate Edginton with her certificate \nI enjoy getting stuck into all aspects of the YFC programme, from carcase judging to cake decorating – there’s not much I haven’t tried and that’s what I love about YFC. Read More Exmoor Farmers receive funding for landscape scale environmental improvements \nSaying that, my favourite competition has got to be performing arts, specifically pantomime. I just love playing the baddie! \nOutside of YFC I am an avid supporter of my local sports teams and you’ll often find me sitting behind a cricket scorebook with my coloured pens! \nQ: Tell us about your day-to-day work: \nA: I work for a firm of accountants and business advisers in Gloucestershire as part of the farms & estates team, working with family-owned businesses of a variety of sizes covering farmers, landowners and agriculturally related businesses. \nHaving worked in business services for a number of years, I recently moved to the farms & estates team. Coming from a farming background, this seemed like the natural progression. Read More Meet the new foals born in the freezing snow on Dartmoor \nQ: What skills have you gained from YFC that you have then been able to use within your job? \nA: One of the key skills I’ve learnt through YFC which has helped in every area of my life, including work, is public speaking – whether that be delivering a presentation on the latest developments in cloud accounting or simply leading discussions in client meetings. \nBeing a committee chairman in YFC has also enhanced my leadership and delegation skills which are essential in a busy office environment. Read More Fake footpaths: what are landowner’s rights and remedies? \nQ: You have recently been crowned South West area YFC senior member of the year. What have you achieved in the last 12 months that has made you stand out from the other members: \nA: I was over the moon to have won the Gloucestershire round of senior member of the year, so to be crowned South West area champion is a dream come true. It still hasn’t quite sunk in. \nI’d say there are two main achievements I would pin point that I believe made me stand out. One is the work I have been involved with on the rules and by-laws of the National Federation of Young Farmers’ Clubs (NFYFC), working with other keen members across the country to shape the future of YFC. Read More Dartmoor farmers asked to share knowledge on sheep scab \nThe second big achievement was coming third in the pantomime competition. Whilst you may think third doesn’t sound like much of an achievement, for me this was huge. Members from across Gloucestershire all gathered together to put on the performance, rehearsing tirelessly for months. Leading this team was such an honour for me and I was incredibly proud of what we achieved. \nQ: With Brexit a hot topic of conversation, what would you like to see for the UK with regard to trading with Europe and other countries? \nA: I’d like to see the trade relationship between the UK and Europe continue to work in a way that is fair for British farmers. \nI believe it is important that we maintain high food quality standards which should not be jeopardised by any new trade deal we make. Like us on Facebook", "external_links": [], "published": "2018-03-23T14:15:00.000+03:00", "crawled": "2018-03-23T16:51:19.025+03:00", "highlightTitle": ""}