{"organizations": [], "uuid": "ef2d565baf54f088f68a1b318f0c37faefe6cd21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article157754.ece/ALTERNATES/s1200/Sky-television-remote-control.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/celebs-tv/sky-sports-live-special-offers-1308403", "country": "GB", "domain_rank": 48128, "title": "Here's how to bag all 10 live Sky Sports channels at a MASSIVE discount - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.652, "site_type": "news", "published": "2018-03-07T13:36:00.000+02:00", "replies_count": 0, "uuid": "ef2d565baf54f088f68a1b318f0c37faefe6cd21"}, "author": "Neil Bennett", "url": "https://www.leicestermercury.co.uk/news/celebs-tv/sky-sports-live-special-offers-1308403", "ord_in_thread": 0, "title": "Here's how to bag all 10 live Sky Sports channels at a MASSIVE discount - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "hotukdeals", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "manchester evening news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Here's how to bag all 10 live Sky Sports channels at a MASSIVE discount We have details of the offer Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThere is a way to get the full package of live Sky Sports channels for less than half the recommended retail price. \nA deal on the Now TV website contains unlimited access to all 10 Sky Sports Channels. \nBargain hunter 'NeoTrix' on HotUKDeals has twigged out that it is possible to make a big saving. \nEven though the offer in question is branded a Formula 1 Season Pass, it includes a whole lot more than people bargain for, reports the Manchester Evening News . \nIt costs £150 and payment has to be made immediately but over the course of the nine months it will save you £155.91. \nThat represents more than 50% of the recommended retail price. Read More 'No more cheap holidays' warns Ryanair chief in Brexit tirade \nBe careful, though. If you do not wish to remain a Sky customer beyond the nine months, make sure to cancel as the bill will automatically revert to a non-offer rate. \nOther, shorter term Now TV Sports alternatives are also available. Respectively, day, Week and Monthly Passes cost £7.99, £12.99 and £20 for a limited time only. (Image: Getty Images) \nThe £20 monthly pass saves you 40% off the regular price of £33.99 and is available here . What do you get? \nSky Sports broadcasts coverage of all major sports including football, rugby, cricket and golf. Read More Engaged? We tell you how to get TV company to pay for YOUR £13,000 wedding \nContained within this package are the following 10 channels: \nSky Sports Main Event, Sky Sports, Sky Sports Football, Sky Sports Cricket, Sky Sports Golf, Sky Sports F1, Sky Sports Action, Sky Sports Arena, Sky Sports Mix and Sky Sports News. \nTo take advantage of this limited time offer, click through to the promotion here . Like us on Facebook ", "external_links": [], "published": "2018-03-07T13:36:00.000+02:00", "crawled": "2018-03-07T15:57:58.000+02:00", "highlightTitle": ""}