{"organizations": [], "uuid": "69bba6a28d38470fcc8046bd834c717800872f9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14383064.ece/ALTERNATES/s1200/GWR_-NJL_090317johnlewis_01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/john-lewis-staff-see-bonuses-14383055", "country": "GB", "domain_rank": 21960, "title": "John Lewis staff see bonuses fall again after profits slump by 77%", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-08T12:51:00.000+02:00", "replies_count": 0, "uuid": "69bba6a28d38470fcc8046bd834c717800872f9b"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/john-lewis-staff-see-bonuses-14383055", "ord_in_thread": 0, "title": "John Lewis staff see bonuses fall again after profits slump by 77%", "locations": [], "entities": {"persons": [{"name": "john lewis", "sentiment": "negative"}], "locations": [{"name": "eldon square", "sentiment": "none"}], "organizations": [{"name": "tony hall photography", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "John Lewis staff see bonuses fall again after profits slump by 77% Employee-owned business sees bonus fall to 5% of salary after tough time for retail sector Share John Lewis store in Eldon Square, Newcastle (Image: Tony Hall Photography) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nStaff at the John Lewis Partnership will see their bonuses cut for the fifth year in a row after the retail giant revealed a slump in profits and warned earnings will remain under pressure in 2018. \nThe group said it will reduce the renowned bonus to 5% of annual salary, with 85,500 partners sharing out a pot worth £74m, down from £89.4m the previous year. \nIt has cut the bonus for five years running now, down from 6% last year and as much as 17% in 2013. \nIt comes as the partnership - which owns the eponymous department store and upmarket supermarket Waitrose - posted a 77% plunge in bottom line pre-tax annual profits to £103.9m after one-off charges. \nUnderlying pre-tax profits were 21.9% down at £289.2m for the year to January 27. \nSir Charlie Mayfield, chairman of the John Lewis Partnership, said it had been a “challenging year”. \nHe also cautioned that the group expects “further pressure on profits” over the year ahead amid volatile trading. \nSir Charlie added: “We said in January 2017 that we were preparing for tougher trading conditions, with weakness in sterling feeding through into cost prices. \n“This was why we chose to reduce the proportion of profits paid as partnership bonus last year so as to absorb these impacts while continuing to invest in the future and in strengthening our balance sheet.” \nJohn Lewis Partnership, which is owned by the employees of the two retail chains, had already warned in January that annual profits would be hit amid attempts to remain competitive despite facing cost pressures from the weak pound. \nIt added that the new financial year had got off to a disappointing start for its John Lewis chain, with like-for-like sales for the first five weeks down 3.4% after disruption from last week’s heavy snow. \nWaitrose has seen like-for-like sales rise 2.4% since the year-end. \n“We expect trading to be volatile in 2018/19, with continuing economic uncertainty and no let-up in competitive intensity,” Sir Charlie said. \nHe admitted that changes made across the group had affected “many” of its employees, with 1,400 redundancies in the past year. \nRedundancy and restructuring costs were part of the £111.3m hit that contributed to the hefty fall in bottom-line profits. \nAnnual results showed that gross sales across the partnership rose 2% to £11.6bn. \nJohn Lewis saw like-for-like sales edged 0.4% higher, while operating profits lifted 4.5% to £254.2m, but Waitrose saw profits collapse. \nThe supermarket posted a 32.1% decline in operating profit to £172m. \nWaitrose said the profit fall was down to a decision “not to pass on all cost price inflation” to customers and investments in “customer experience”. \nLike-for-like sales at Waitrose grew by a paltry 0.9% as the sector continued to reel from soaring Brexit-fuelled inflation and fierce competition. \nThe grocery chain responded by lowering the prices of hundreds of products, helping comparable sales growth pick up to 1.1% in the final six months, although this hurt profits. Like us on Facebook", "external_links": [], "published": "2018-03-08T12:51:00.000+02:00", "crawled": "2018-03-08T14:33:27.011+02:00", "highlightTitle": ""}