{"organizations": [], "uuid": "1d13dcd864cc3e092a25cde77c504a42f7ed3a66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14413431.ece/ALTERNATES/s1200/JS146335462.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14411853", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Unilever picks Rotterdam over London for new HQ in bitter Brexit blow", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-15T10:30:00.000+02:00", "replies_count": 0, "uuid": "1d13dcd864cc3e092a25cde77c504a42f7ed3a66"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14411853", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Unilever picks Rotterdam over London for new HQ in bitter Brexit blow", "locations": [], "entities": {"persons": [{"name": "steven blair", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "bethany watkins", "sentiment": "none"}], "locations": [{"name": "rotterdam", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "unilever", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "wc newcastle ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Toys R Us to close all stores in the US \nToys R Us are to close or sell all its 885 stores in the US after failing to find a buyer,it has been reported. \nThe retailer’s announcement puts around 30,000 jobs under threat and the firm’s chief executive said the news marked a “profoundly sad day” for the retailer. \nToys R Us will also close all its UK stores by the end of April. The toy chain has stores in the North East at Gateshead, Sunderland and Stockton but they will close in six weeks. Toys r Us at the Metrocentre (Image: Newcastle Chronicle) 9.10 Coreena Ford How a Facebook snap sparked a big business for a Sunderland mum.... \nPosting a photo on Facebook has sparked success for young entrepreneur April Brignall, who has built up a healthy eating business from a single upload . \nMs Brignall posted a picture on Facebook 18 months ago of six culinary creations she devised following the birth of her daughter. \nShe was inundated with requests from friends asking her to cook for them, triggering the creation of Prep & Deliver, a company which provides meals and snacks for hundreds of customers every week. \nMs Brignall, who honed her cooking skills while working in the French Alps and on the Greek island of Karpathos, began cooking for a few friends but that quickly escalated to delivering meals to 50 customers, then 100, as operations moved from her kitchen to a commercial unit in Houghton Business Park, Houghton-le-Spring. \nThe company was officially launched in January last year and now employs five people, and has around 700 customers and the capacity to produce 3,000 meals per week. Coun Harry Trueman, Sunderland City Council and April Brignall of Prep & Deliver (Image: Prep & Deliver) 9.05 Coreena Ford Re-mortgaging surges to nine-year high \nRemortgaging levels surged to a nine-year high in January as homeowners anticipating further possible interest rate rises locked into attractive deals, a body representing lenders has reported. \nThere were 49,800 new homeowner remortgages completed in January - nearly a fifth (19.1%) more than in the same month a year earlier, UK Finance said. It was the highest monthly number of re-mortgages since November 2008, when the figure stood at 51,300. \nJackie Bennett, director of mortgages at UK Finance said: “While an increase in remortgaging is expected in the New Year as people put their household finances in order, this strong growth is above the seasonal fluctuations we tend to see at this time of year.” UK Finance’s figures also show there were 24,500 new first-time buyer mortgages handed out in January, 7% more than in the same month a year earlier. And 25,000 new home mover mortgages were completed in January, 6.4% more than in the same month a year earlier. (Image: Tim McGuinness) Coreena Ford Cineworld profits up as blockbusters boost sales \nCineworld has reported rising annual sales and profits following a year in which it splashed out £2.7bn to acquire US chain Regal. \nThe group reported an 11.6% rise in revenue to £890.7m in the year to December 31, with pre-tax profit growing 22.7% to £120.5m. \nBlockbuster films Beauty And The Beast, Star Wars: The Last Jedi, and Dunkirk together grossed a £197.4m, helping drive Cineworld’s performance. \nBox office sales were up 6.4% to £553.7m and retail sales jumped 11.1% to £220.4m as the chain was boosted by the opening of a further five Starbucks. Looking ahead, Cineworld - which took over the multiplex in The Gate in Newcastle last year - said it is encouraged by the film slate in 2018, which includes Solo: A Star Wars Story, Deadpool 2 and Fifty Shades Freed. \nLast month the company completed a deal to buy Regal, creating the second-biggest cinema group in the world. \nThe combined group will have more than 9,500 screens across 10 countries and will see Cineworld enter the lucrative US market. \nIt will give Cineworld access to the US market, which has the largest box office market in the world, worth more than $10bn (£7.5bn) a year. \nBoss Mooky Greidinger said: “The US is the biggest cinema market in the world and we are confident that this transformative acquisition will be a great success.” Star Wars: The Last Jedi - one of the big movies that has boosted Cineworld sales 8.58 Coreena Ford Persimmon appoints city heavyweight as new chairman \nHousebuilder Persimmon has named Roger Devlin as its new chairman following the resignation of Nicholas Wrigley amid a furore over excessive pay for top bosses. \nMr Devlin - currently chairman at pub group and brewer Marston’s and recently appointed chairman-designate at betting giant William Hill - will take on the post from June 1. \nHis appointment comes after Mr Wrigley and remuneration committee chair Jonathan Davie stepped down following an outcry over bonus plans that could have seen management share out up to £600 million - including a potential £100 million payout for chief executive Jeff Fairburn. \nBosses at the group agreed to hand back around £50 million in bonuses last month to calm mounting anger, with Mr Fairburn’s award cut by £25 million. There had been mounting pressure from politicians and some shareholders over the long-term incentive plan introduced by the company six years ago, with the firm having been boosted by the Government’s Help to Buy scheme. Persimmon flags (Image: PA) Coreena Ford Around 40 engineering jobs created as Openreach hits the accelerator on ultrafast fibre roll-out \nNew North East engineering jobs have been created by BT Group’s Openreach as part of its plans to speed up the roll-out of ultrafast fibre connectivity. \nAround 40 trainee engineers are set be hired across the North East as part of the recruitment drive by Openreach, the UK’s leading digital network business. \nThe drive follows Openreach’s announcement that it will accelerate plans to build more ultrafast Fibre to the Premises (FTTP) broadband across the country. \nThe trainees – who will be based across the region in locations including Northumberland, Newcastle, North Tyneside, Sunderland and Durham – will join the UK’s largest team of telecoms engineers working to expand, upgrade, maintain and install new services over Openreach’s national broadband network. \nOpenreach has committed to making FTTP available in three million British homes and business by the end of 2020 and, if the conditions are right, intends to go significantly further, bringing the benefits of FTTP technology to the majority of homes and businesses in the UK. As part of its plans, Openrach is building 12 regional centres – including one on Teesside – to support the fibre roll-out. \nThe company expects to invest around £200,000 over the next 12 months in the North East centre, based at Teesside Industrial Estate in Thornaby, to equip it with the latest fibre engineering training facilities. Around 40 trainee engineers will be hired across the North East as part of a recruitment drive by Openreach (Image: BILLYPIX) 8.46 KEY EVENT Wine bar plans revealed for Newcastle's Bigg Market underground toilets \nWant to spend a penny and have a pint? That’s what you could soon do in the famous Bigg Market underground toilets . \nHaving provided relief to Geordie gents since 1898, the subterranean loo sanctuary was closed to the public six years ago over fears around access to the site. \nBut now, six years after being put up for sale by Newcastle City Council, which could no longer afford to keep them open, a newly-formed company has applied for a licence to transform the loos into a wine bar and cafe. \nWC Newcastle Ltd wants to take on the 60 sq m building – toilet cubicles and all – and become a big attraction as part of the Bigg Market regeneration. \nThe Newcastle-based company, run by Steven Blair and Bethany Watkins, wants to open from 11am to 11pm Monday to Wednesday, with a 2am closing time on Fridays and Saturdays and midnight on Thursdays and Sundays. The public toilets in Newcastle's Bigg Market 8.38 FTSE 100 and pound latest \nThe FTSE-100 index at 8.15am was up 14.35 at 7147.04. \nThe pound at 8am was 1.3977 dollars compared to 1.3959 dollars at the previous close. The euro at 8am was 0.8848 pounds compared to 0.8862 pounds at the previous close. 8.37 Coreena Ford PZ Cussons issues profit warning \nImperial Leather owner PZ Cussons has warned over profits as consumer confidence dives in the UK and the firm faces tough trading in Nigeria. \nEarlier this year the group said that Brexit-fuelled inflation was encouraging shoppers to swap brand name soaps for discounted rivals. \nThis morning PZ Cussons warned that this will result in full-year profit falling “short of expectations”, with the board pencilling in a range between £80 million to £85 million. \n“The UK washing and bathing division has continued to experience lower levels of purchases, reflecting consumer caution across all retail channels caused by economic uncertainty and inflation outstripping wage growth,” the firm said. \n“Whilst new product launches have been well received, they have not had the desired uplift in sales to compensate for the wider volume and margin shortfall.” \nPZ Cussons shares took a hammering following the announcement, falling 25% to 207.6p. PZ Cussons - St Tropez Kate Moss. The company has issued a profit warning 8.32 Reaction to Unilever move \nRajesh Agrawal, London’s deputy mayor for business, said: \nUnilever’s decision to move its headquarters to the Netherlands is clearly disappointing news for the capital. It brings into sharp focus the need for the Government to secure a Brexit deal that secures London as Europe’s leading business centre. \nThe best way to do this is for London and the UK to remain part of the Single Market and Customs Union. \nBut a Government spokesperson said: \nUnilever has today shown its long-term commitment to the UK by choosing to locate its two fastest-growing global business divisions in this country, safeguarding 7,300 jobs and £1bn a year of investment. \nAs the company itself has made clear, its decision to transfer a small number of jobs to a corporate HQ in the Netherlands is part of a long-term restructuring of the company and is not connected to the UK’s departure from the EU. Unilever products (Image: PA) KEY EVENT Unilever picks Rotterdam over London for new HQ \nUnilever has confirmed that it has chosen Rotterdam over London as its new legal headquarters, dealing a major blow to the UK Government as it tries to uphold Britain’s status as a centre for business after Brexit. \nFollowing yesterday’s board meeting, the consumer goods giant - which owns brands including Dove, Marmite and Ben&Jerry’s ice cream - said that it intends to “simplify” from two legal entities into a single one incorporated in the Netherlands. \n“The proposed simplification will provide greater flexibility for strategic portfolio change and help drive long-term performance,” the group said. \nUnilever insisted that its 7,300 workers in the UK and 3,100 in the Netherlands will be unaffected by the changes. \nIt added that Unilever will continue to be listed in London, Amsterdam and New York. \nThe announcement comes after a review of Unilever’s dual-headed legal structure in the UK and Netherlands, which was part of a rethink of the business following a hostile takeover attempt by Kraft Heinz last year. \nThe decision is likely to cause further embarrassment for the Conservatives and Prime Minister Theresa May, who is struggling to contain a flow of businesses and their staff to the EU. \nBritish Government officials reportedly met with Unilever to express their concerns that the London headquarters would be axed in favour of the Netherlands, but failed to convince them over the benefits of basing its main offices in the UK. A Unilever sign ", "external_links": [], "published": "2018-03-15T10:30:00.000+02:00", "crawled": "2018-03-15T10:52:44.003+02:00", "highlightTitle": ""}