{"organizations": [], "uuid": "144e7a18629c92e9cee00e0b07dcc7abc9f56f77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article682615.ece/ALTERNATES/s1200/atrisk1JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/how-create-better-happier-healthier-1276997", "country": "US", "title": "How we create a better, happier and healthier place for everybody - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.535, "site_type": "news", "published": "2018-03-01T18:52:00.000+02:00", "replies_count": 0, "uuid": "144e7a18629c92e9cee00e0b07dcc7abc9f56f77"}, "author": "Tina Crowson", "url": "https://www.devonlive.com/news/devon-news/how-create-better-happier-healthier-1276997", "ord_in_thread": 0, "title": "How we create a better, happier and healthier place for everybody - Devon Live", "locations": [], "entities": {"persons": [{"name": "jim parker", "sentiment": "none"}], "locations": [{"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "herald express", "sentiment": "none"}, {"name": "herald express business awards", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How we create a better, happier and healthier place for everybody Why we need to deliver an area fit for the 21st century Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTORBAY and South Devon is such a beautiful place to live and work and we all take it for granted. \nBut it could be even better, writes Herald Express editor Jim Parker . \nSuccess is all around us, in our local communities, our economy and market place, on our industrial estates, in our business parks, in education and health and in our tourism industry. Everywhere. \nBut rarely do we celebrate and recognise that success. The Herald Express Business Awards help by doing just that. \nBut there is so much more we can do utilising that success, shouting about our success stories and delivering an area for fit for the 21st century where people not only love living and working but a place where people want to invest to create jobs, new homes, growth and prosperity. \nIt’s about creating a better, happier, healthier and prosperous place for everybody. \nWe tend to focus on life’s challenges and finding reasons why we can’t do rather that how we can do. Babbacombe - part of the Bay's natural beauty \nDoomers and gloomers reign supreme, all we seem to hear is fears about Brexit and for some, who appear intent on living in the past, progress is to be avoided at all costs. \nNobody wants to see South Devon’s natural beauty destroyed but what good is a stunning environment if poverty levels continue to rise, our town centres die, landmark sites fall into ruin and our economy takes a nose dive? Why can’ we mix old with new? \nThe South Devon Link Road is now more than a year old. After more that six decades of campaigning, it was meant to be the catalyst for change, a route into the area for investors and their money. A new beginning. \nYes, there have been some notable successes and, yes, the new bypass has partly delivered. But there is so much more we can achieve, so much more we can do to show we are truly open for business and actually want and desire that new beginning ourselves. \nLet’s end the moaning and groaning. Let’s celebrate success and drive forward for the sake of our children and their children. \nNOW IS THE TIME \nThis new and prosperous future can only be achieved with a united front with residents and the public and private sectors all pulling in the same direction with the same, common goals and tangible and achievable outcomes and targets. \nThat’s why the Herald Express and the DevonLive website teamed up with some of the most influential companies and organisations in the area to help make this work. \nTorbay Council, its regeneration company TDA, and the office of the Police and Crime Commissioner are all on board as headline partners from the public sector for our new campaign. \nThey want to see a Torbay and South Devon which is not only transformed for the better but which is also an area which continues to be one of the safest to live. \nThe Torbay and South Devon NHS Foundation is also there as it tries to deliver healthier lifestyles and looks to improve facilities at Torbay Hospital. \nSouth Devon College, with further exciting plans to grow, is also backing the campaign. \nSo, too, is the Torbay Culture Board so make sure the campaign reaches and champions people and causes from all walks of life. \nFrom the private sector, we have leading accountants and financial experts Francis Clark and well-established law firm Kitsons on board. And Torbay Taxis are lending their support as well. \nThese campaign supporters will be talking about their success stories over the coming weeks and months of the year-long campaign. South Devon College \nThey will also be talking up Torbay and South Devon and supporting and saluting other success stories or projects that may deliver success. \nIt will all be about encouraging others to come on down and join the Torbay and South Devon party, using success as the magnet. \nIt will be about trying to see redevelopment projects like the Pavilion (whatever the outcome) Torwood Street, Oldway Mansion, the Crossways shopping centre in Paignton and Oxen Cove in Brixham finally across the line. \nAnd it will be about championing regeneration projects for our town centres. \nIt will also be about recognising the success in Teignbridge and especially Newton Abbot – where big redevelopment schemes are already set to go ahead – and working more closely with our neighbours. \nThe main focus of the campaign will be on: \nIt will not just about talking the talk. We want to achieve with our campaign. \nAs part of the campaign: MPs will be lobbied, government departments and doors knocked on to fight the Torbay and South Devon cause. We will be making the Heart of the South West Local Enterprise Partnership aware of our campaign to show how it fits their aspirations and bids for government funding. \nAfter a recent Peer Review, the Local Government Association urged Torbay Council to find a way of working with the private and voluntary sector and deliver schemes for the benefit of the Bay and deliver them more quickly. \nIt led to the formation of Torbay Together. The strategic partnership brings together representatives of groups and bodies from across the Bay, including health, fire, police, council, TDA, business, voluntary sector, culture, coast and countryside trust, geopark and tourism all with one aim – making the Bay fit for purpose, fit for the future. \nThose who make up Torbay Together have already supported and ‘adopted’ Now Is The Time as many of its targets and objectives will be the same. Working together is working for a more prosperous, better and brighter future because... Now Is The Time. Now Is The Time the sponsors Like us on Facebook", "external_links": [], "published": "2018-03-01T18:52:00.000+02:00", "crawled": "2018-03-01T19:00:40.003+02:00", "highlightTitle": ""}