{"organizations": [], "uuid": "ac17c9024d23f33bd0c6e173bfafaa1961e7eabb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1358403.ece/ALTERNATES/s1200/poundstretcherPNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/whats-on/whats-on-news/poundstretcher-latest-retailer-face-problems-1358209", "country": "GB", "title": "Poundstretcher is the latest retailer to face problems", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-19T17:21:00.000+02:00", "replies_count": 0, "uuid": "ac17c9024d23f33bd0c6e173bfafaa1961e7eabb"}, "author": "Abbie Bray", "url": "https://www.devonlive.com/whats-on/whats-on-news/poundstretcher-latest-retailer-face-problems-1358209", "ord_in_thread": 0, "title": "Poundstretcher is the latest retailer to face problems", "locations": [], "entities": {"persons": [{"name": "poundstretcher", "sentiment": "none"}, {"name": "poundland", "sentiment": "none"}, {"name": "william telford", "sentiment": "none"}, {"name": "devon share abbie bray", "sentiment": "none"}], "locations": [{"name": "paignton", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "plymouth herald", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Poundstretcher is the latest retailer to face problems There are four branches of Poundstretcher in Devon Share Abbie Bray What's On Reporter William Telford Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPoundstretcher has become the latest chain to face problems as the discount retailers are hit by rising inflation and declining consumer spending. \nCredit insurers are now tightening terms for suppliers to Poundstretcher – a move which is generally seen as an indicator of concerns a retailer is about to go bust, reports the Plymouth Herald . \nPoundstretcher, owned by two low-profile brothers based in Leicestershire, has branches in Plymouth, Barnstaple, Paignton and Tiverton. Read More Bargain Booze in trouble after owner admits HUGE profit collapse \nSome discount stores are now struggling, having been been hit by sterling’s fall since the Brexit vote and a slowdown in consumer spending, even at the discount end of the retail food chain. \nRival Poundland had problems with credit insurance before Christmas 2017 — although some of the concerns related to its South African parent company. \nAnd another competitor, Poundworld is believed to be in the process of calling in restructuring troubleshooters. \nNow Poundstretcher is in difficulties. Euler Hermes, one of the UK’s leading insurers, is understood to have reduced cover for Crown Crest Group, Poundstretcher’s parent firm. \nCrown Crest is used as the counterparty by many of Poundstretcher’s suppliers because it has a stronger balance sheet than the on-street retailer. \nCrown Crest, a holding company for Aziz and Rashid Tayub, saw a £3.4million profit turn into a £3.5million loss in 2017. \nThe same year the brothers tried to sell Poundstretcher to turn-around specialist Endless, but no deal was struck. Read More Exeter's Maplin store is closing down - and there's a HUGE clearance sale \nIn February 2018 Poundworld said it was weighing up “options” amid dismal sales figures. \nPrivate equity-owned Poundworld, which has a huge Plymouth store in New George Street, said it was facing “brutal” trading conditions. \nPoundworld, which has more than 350 stores, is owned by American buyout giant TPG Capital, but competes fiercely with Poundland and Poundstretcher. \nPoundworld is understood to have invited troubleshooters from firms including Deloitte and Alvarez & Marsal to meet bosses. \nThe discount retailer, founded in 1974 as a market stall, revealed losses of £17.1million in the year to the end of March 2017. \nThe numbers were inflated by almost £6million of provisions for leases on loss-making stores. \nThe pound store chains are among a diverse raft of retailers facing an up-hill struggle as consumer confidence dips and cost head upwards. \nToys R Us has gone out of business and shut its city outlet, electrical retailer Maplin has gone into administration but is still trading from its Exeter branch, and womenswear and home furnishings retailer Laura Ashley, which has a large outlet in Plymouth and Exeter, posted its third profit warning in just a year. Read More ", "external_links": [], "published": "2018-03-19T17:21:00.000+02:00", "crawled": "2018-03-19T17:37:54.000+02:00", "highlightTitle": ""}