{"organizations": [], "uuid": "5b776bf531bb4d93aa6914956b1c95d5d452ce66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1304731.ece/ALTERNATES/s1200/GB-23-01-18-V0255-1.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/ibstock-profits-up-12-88m-1304694", "country": "GB", "domain_rank": 48128, "title": "Ibstock profits up 12% to £88m, helped by new £55m brick factory", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-06T16:45:00.000+02:00", "replies_count": 0, "uuid": "5b776bf531bb4d93aa6914956b1c95d5d452ce66"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/ibstock-profits-up-12-88m-1304694", "ord_in_thread": 0, "title": "Ibstock profits up 12% to £88m, helped by new £55m brick factory", "locations": [], "entities": {"persons": [{"name": "leicesters", "sentiment": "negative"}, {"name": "wayne sheppard", "sentiment": "none"}, {"name": "joe hudson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "ellistown", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "ibstock", "sentiment": "negative"}, {"name": "ibstock plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ibstock profits up 12% to £88m, helped by new £55m brick factory Housebuilders also boost Leicestershire brick maker, with turnover up almost 4 per cent to more than £450m Share Ibstock chief executive Wayne Sheppard (left) is retiring, to be replaced by Joe Hudson this year Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBritain’s biggest brick maker has reported a 12 per cent rise in profits thanks to growing demand from housebuilders and increased capacity from a new £55 million factory. \nIbstock PLC said pre-tax profits went up from £79 million to more than £88 million last year. \nTotal turnover was also up almost 4 per cent to £451.6 million. \nThe business makes two in every five bricks used in the UK – equal top around 780 million bricks a year. \nIt makes 85 million bricks a year in Ibstock and 55 million in nearby Ellistown, while the new Ibstock plant has the capacity to make 100 million more bricks a year. \nThe new factory is currently at half capacity, but expects to be in full flow by 2019. \nIbstock employs a total of 2,700 around the world, with 2,000 in the UK. Ibstock's new £55m factory can make 100m bricks a year \nChief executive Wayne Sheppard said the new plant has created 40-50 jobs, taking the number of staff in Leicestershire, including the head office, to around 300. \nHe said they were pleased with the results which were in line with expectations and the new factory and investment in roof tile capacity had also been well timed to support growth in new housing. \nThe business expected another busy year ahead. \nHe said: “We began 2018 with new capacity in place at a time when it is clearly much needed to support strong market demand. \n“In addition, recognising our robust balance sheet and strong cash generation we are pleased to provide further detail on our capital allocation strategy to shareholders with the introduction of a supplementary dividend policy, with the first such payment currently expected to be confirmed at the interim results in August.” \nMr Sheppard said it would be good to see more new homes going up in the UK, although customers ranging from Barratt, Persimmon and Redrow Homes, were all expected to increase output. \nThe business also supplies to trade counters such as Travis Perkins. \nHe said although US performance down year-on-year, the company had benefited from Donald Trump’s corporate tax cuts. \nLikewise Brexit had helped somewhat by making brick imports from competitors in Belgium and the Netherlands more expensive. \nThe business, he added, was trying to preempt a possible loss of skilled labour from the continent by promoting its apprenticeship programme. \nMr Sheppard will retire this year after 22 years with the business and more than two years as chief executive. \nHe will be succeeded by Joe Hudson, formerly managing director for cement and concrete products at Aggregate Industries UK – which also has its national headquarters in Leicestershire – who joined the group as chief executive designate in January. \nMr Sheppard will step down after a handover period, but will still help the group until the end of 2018. \nIbstock started out as a mining business in 1825 and branched out into bricks to support the mines, and which were later used in housebuilding. \nThe pit shut in 1935 and by the 1990s the business had bought out competitors such as Redland Brick and Tarmac Brick. Read More \nIn 1999, Ibstock acquired the assets of the adjoining Ellistown brickworks to consolidate its position of one third of the brick capacity in the UK. Read More \nIt now has 19 factories and in October 2015, returned to the London Stock Exchange after a gap of 16 years in private ownership. Like us on Facebook ", "external_links": [], "published": "2018-03-06T16:45:00.000+02:00", "crawled": "2018-03-06T17:10:02.007+02:00", "highlightTitle": ""}