{"organizations": [], "uuid": "1d7bb3ab1d50356797ca69f12f7a644626a9b180", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13836130.ece/ALTERNATES/s1200/Richard-Pennycook-chief-executive-at-The-Co-operative-Group.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/fenwick-boss-lead-government-taskforce-14389348", "country": "GB", "domain_rank": 21960, "title": "Fenwick boss to lead Government taskforce aiming to save retail sector", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-09T15:22:00.000+02:00", "replies_count": 0, "uuid": "1d7bb3ab1d50356797ca69f12f7a644626a9b180"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/fenwick-boss-lead-government-taskforce-14389348", "ord_in_thread": 0, "title": "Fenwick boss to lead Government taskforce aiming to save retail sector", "locations": [], "entities": {"persons": [{"name": "richard pennycook", "sentiment": "negative"}, {"name": "fenwick", "sentiment": "negative"}, {"name": "john lewis", "sentiment": "none"}, {"name": "andrew griffiths", "sentiment": "none"}, {"name": "pennycook", "sentiment": "none"}], "locations": [{"name": "maplin", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}], "organizations": [{"name": "business fenwick", "sentiment": "negative"}, {"name": "asos", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "retail sector council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Fenwick boss to lead Government taskforce aiming to save retail sector Richard Pennycook has insisted the high street has a great future, despite a crisis week of closures and job losses Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe head of Newcastle department store chain Fenwick has been asked to lead a Government taskforce looking to rescue the ailing retail sector. \nFenwick chairman Richard Pennycook is to chair the Retail Sector Council, which aims to help shops better adapt to changing consumer habits that have led to a crisis on the high street. \nThis week saw job losses announced at Maplin and New Look, while John Lewis said it would be losing staff after announcing a 77% drop in profits. \nMr Pennycook - who took over at Fenwick last year after a career that saw him credited as the man who rescued the Co-op - will be joined on the new body by Retail Minister Andrew Griffiths plus executives from Boots, John Lewis and Asos. \nThey body has been set up to find ways of tackling some of the issues faced by the ailing retail sector, which include the growth of online shopping allied to rising wages, inflation and high rates. \nIn-store sales fell 1.6% in February, the fifth consecutive year that retailers have seen sales slide in February and a further blow to the struggling high street which has just seen the collapse of Toys R Us and Maplin. Sale signs outside a Toys R Us store (Image: PA) \nDespite those problems, Mr Pennycook has insisted there is a positive future for the retail sector. \nHe said: “I’m delighted that Government has wanted to set this up, it’s a sign that they are engaging with business and wanting to think ahead. \n“In our first year we’re going to be very grounded and make sure we don’t become a talking shop. \n“We’re first of all going to be very responsive in relation to the Brexit negotiations to make sure we have the opportunity to make the case for consumers as those negotiations roll through. Read More John Lewis staff see bonuses fall again after profits slump by 77% \n“Retail is the biggest employer in the private sector, with three million people, and we have a great opportunity to use retail for training for life skills and for really developing our young people.” \nMr Pennycook said he also wanted retail companies to be do more to embrace the agenda of responsible business, saying it had been “slow” to do the right thing in the past and had to be forced by the Government to introduce the plastic bag levy. Shoppers on Northumberland Street (Image: Newcastle Chronicle) \nBusiness Minister Andrew Griffiths said: “The UK’s retail sector is undergoing rapid structural changes with consumers increasingly favouring online shopping and rising operating costs for retailers. \n“Our new collaborative Retail Sector Council will bring Government and industry together to look at how best to ensure the industry adapts to meet the changing demands of consumers.” \nMr Pennycook became chairman of Fenwick last year when the family owners of the business stepped away from the board to allow new management to tackle problems that included the company’s lack of a ecommerce website. \nLast year he told how he wanted to make going to Fenwick’s more of an experience, announcing big investment plans that would see the opening of a spa and fitness department. Like us on Facebook", "external_links": [], "published": "2018-03-09T15:22:00.000+02:00", "crawled": "2018-03-09T17:54:15.052+02:00", "highlightTitle": ""}