{"organizations": [], "uuid": "680dc7e66bc5e3995d6973bbd2182ecc6eca09b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1316533.ece/ALTERNATES/s1200/Michael-ForsterJPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/neglected-leicester-prisoner-hangs-himself-1316525", "country": "GB", "domain_rank": 48128, "title": "'Neglected' Leicester prisoner hangs himself after leaving goodbye letters for family - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.264, "site_type": "news", "published": "2018-03-08T21:00:00.000+02:00", "replies_count": 0, "uuid": "680dc7e66bc5e3995d6973bbd2182ecc6eca09b6"}, "author": "Tom Mack", "url": "https://www.leicestermercury.co.uk/news/leicester-news/neglected-leicester-prisoner-hangs-himself-1316525", "ord_in_thread": 0, "title": "'Neglected' Leicester prisoner hangs himself after leaving goodbye letters for family - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "michael forster", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "forster", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "hmp leicester", "sentiment": "none"}, {"name": "mountsorrel", "sentiment": "none"}, {"name": "leicester town hall", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Neglected' Leicester prisoner hangs himself after leaving goodbye letters for family He had a history of depression brought on in part by the death of his daughter Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily   Thank you for subscribing!   \nA prisoner at HMP Leicester hanged himself in his cell after his mental health needs were neglected by staff. \nA nine-day inquest at Leicester Town Hall concluded today with a jury returning a conclusion that Michael Forster, of Mountsorrel , took his own life. \nBut in their conclusion they listed failings by the mental health staff based at the prison. \nReading out the narrative conclusion, the jury foreman said: “Had Michael Forster received adequate care, observation, support and medication, it’s more likely than not his life would have been prolonged. \n“Neglect by the mental health team contributed to Michael’s death.” \nThe jurors had heard how Mr Forster, who worked as a meat-packer, had died in November 2016, the day before his 27th birthday, after suffering a fatal brain injury when he hanged himself in his cell at the jail in Welford Road . Michael Forster \nHe had a history of depression, partly due the death of his infant daughter, leading to him being prescribed anti-depressives before his time in prison. \nHe had begun to think he was receiving messages from the television and once demanded his then-girlfriend get into a bath full of water to prove she was not wearing a microphone. \nWhen he first arrived at HMP Leicester on October 4, 2016 – after an alleged assault on his ex-girlfriend – he had never been in prison before and his assessors put his “bewildered” state down to that and recorded that there were “no suicidal thoughts or intentions,” the jury was told. \nBut on October 12, Mr Forster’s lawyer informed the prison that Mr Forster’s father had received a disturbing letter that suggested his client was going to take his own life. HMP Leicester (Image: Mike Sewell) \nHis own cellmate also reported a change in Mr Forster’s condition. \nThe symptoms included Mr Forster saying the Brexit vote had been held to decide whether or not to send him to the electric chair. \nHe also spoke of his family wanting him to be “chopped up”. \nSummarising the evidence, coroner Diane Hocking described Mr Forster “smiling while he spoke about being ‘chopped up tonight’ and thoughts of harming himself to avoid what others would do to him”. \nIn the second week of his time on remand, prison medical staff agreed there was a risk of suicide and his solicitors began pushing for him to be sent to a secure hospital instead. \nAt the time he hanged himself the prison was checking on him twice an hour during each night. Download the Leicester Mercury app \nWe've just launched our very own app for Android and Apple devices which can be tailored to deliver the news and sport that you're interested in. To download the IOS app click here . To download the Android app click here . \nWe’ve also got Facebook groups for traffic and travel , breaking news and parenting . Join by clicking the links \nBut at about 4am on November 19 he was found hanged in his cell, having left an envelope labelled “goodbye letters”. \nHe was pronounced dead two days later at Leicester Royal Infirmary. \nThe medical health professionals at HMP Leicester all worked for the Leicestershire Partnership NHS Trust . \nHowever, the inquest heard their contract was coming to an end and would be taken over by Nottinghamshire Healthcare Trust from next month onwards. \nA spokeswoman for the Leicestershire Partnership NHS Trust said: “We offer our deepest sympathy to Michael’s family on their tragic loss. \n“The safety of our patients is our paramount priority. We take every opportunity to make improvements and carried out our own investigation into Michael’s care to identify any lessons we could learn from. \n“Since 2016 we have worked closely with the prison to strengthen joint working on ACCT reviews. We have also ensured our staff in the prison have undertaken additional training. \n“We will be reviewing the inquest findings in detail to identify whether there are any further actions we need to take.” Like us on Facebook", "external_links": [], "published": "2018-03-08T21:00:00.000+02:00", "crawled": "2018-03-08T21:58:34.000+02:00", "highlightTitle": ""}