{"organizations": [], "uuid": "fa38ad234bd68565086c39fdbf199cf5ac5dcf36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12600355.ece/ALTERNATES/s1200/JS109334833.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14377406", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Rolls-Royce signals more job cuts despite £4.9bn profit haul", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-07T10:30:00.000+02:00", "replies_count": 0, "uuid": "fa38ad234bd68565086c39fdbf199cf5ac5dcf36"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14377406", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Rolls-Royce signals more job cuts despite £4.9bn profit haul", "locations": [], "entities": {"persons": [{"name": "carlos tavares", "sentiment": "none"}, {"name": "tavares", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ellesmere port", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}], "organizations": [{"name": "rolls-royce", "sentiment": "negative"}, {"name": "vauxhall", "sentiment": "negative"}, {"name": "citroen", "sentiment": "none"}, {"name": "geneva motor show", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "peugeot", "sentiment": "none"}, {"name": "psa", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Brexit is major threat to UK automotive industry, Vauxhall boss says \nThe head of the company that owns car maker Vauxhall has warned that Brexit poses a major threat to the future of its Ellesmere Port factory - and the whole of the UK automotive industry. \nCarlos Tavares - chief executive of Vauxhall, Citroen and Peugeot owner PSA - said lack of clarity over the UK’s exit from the EU was affecting future investment decisions. \nHis words come less than a week after a hard-hitting report by an influential committee of MPs warned of potentially huge job losses in the automotive sector if the Brexit negotiations did not provide protection for the industry. \nThe automotive sector is a particularly important employer in the North East, with around 7,000 people working at the Nissan plant in Sunderland, thousands more in the supply chain and hopes to create even more jobs with an automotive park being planned at Sunderland and South Tyneside. \nSpeaking at the Geneva Motor Show, Mr Tavares said: \nNobody is going to make huge investments without knowing what is going to be the final competitiveness of the Brexit outcome. \nHe added: \nWe can’t make investment decisions on business plans that would go from black to red if the tariff conditions were to change. So as long as we don’t have this clarity it is going to be very difficult to make huge investments and therefore it is better to come to a conclusion as fast as we can. \nPSA bought Vauxhall, which employs around 4,500 people in the UK, last year. It announced 400 jobs cuts at Ellesmere Port in October and another 250 earlier this year. PSA CEO Carlos Tavares (Image: Getty Images Europe) 9:15 Jonathon Manning John Lewis named best retail employer \nStore giant John Lewis has been named the best retailer in the UK to work for.Cosmetics firm Lush was second, Ikea third, Marks & Spencer fourth, followed by shoe firm Clarks.Good rates of pay were a common theme in the most favoured companies, according to research among thousands of employees by jobs site Indeed.Kevin Walker, of Indeed, said: \nThe jobs market is tight and there’s stiff competition for the best talent - that’s why good brands all offer their employees a range of benefits and flexible working. \nOur research shows great brands are the ones whose staff feel valued, well managed - and part of a positive company culture. \nHaving fun, feeling like you’re having an impact and seeing that impact extend beyond the company to the world - those are the things that make a workplace really special. \nJohn Lewis director of personnel Libby Jones said: \nAttracting top talent to join us is integral to our success. John Lewis (Image: PA) Jonathon Manning Hammond tells EU 'deal on the city is in your interest too' \nPhilip Hammond will tell European leaders that including Britain’s lucrative financial services sector in a Brexit deal is in the “mutual interest” of the UK and the EU.In a keynote speech in London on Wednesday, the Chancellor will reject the arguments of “sceptics” who claim there has never been a free trade agreement which includes financial services.He will say the “deeply interconnected” nature of the EU and UK economies means businesses and individuals have come to depend on cross-border financial services in their day-to-day lives.His appeal comes as French economy minister Bruno Le Maire became the latest senior EU figure to reject the idea that financial services could be part of a final Brexit deal, saying the best the UK could hope for was an “equivalence regime”.Meanwhile, Brussels will set out its position for the next phase of Brexit talks.European Council president Donald Tusk is holding a press conference in Luxembourg on the draft guidelines for the future relationship with the UK.A document drawn up by the council of the EU general secretariat, seen by the Guardian, dismissed Theresa May’s speech setting out her Brexit vision as “a change in tone, but not in substance” and accused her of “double cherry-picking”.Mr Hammond will build on the Prime Minister’s Mansion House address, in which she accepted so-called “passporting” rights for banks could not continue after Brexit as Britain was leaving the single market.Instead, she argued for an agreement that allows Britain and the EU to access each other’s financial markets based on a commitment to maintaining the same “regulatory outcomes”.In his speech, the Chancellor will point out the EU had previously sought “ambitious financial services co-operation” in trade negotiations with Canada and the United States.Mr Hammond will say: \nOur markets are already deeply interconnected and we have demonstrated how we can work together over the past decade as we have repaired and defended the financial stability of our continent. \nIf it could be done with Canada or the USA, it could be done with the UK - the EU’s closest financial services partner by far. \nSo I am clear not only that it is possible to include financial services within a trade deal but that it is very much in our mutual interest to do so. Chancellor of the Exchequer Philip Hammond (Image: PA) 9:05 KEY EVENT Newcastle tea-infused gin gets special recognition from John Lewis \nA tea-infused gin created by two North East entrepreneurs is being showcased across the country after being named as John Lewis’ gin of the month . \nNewcastle ’s drinks company NovelTea will see bottles of its The Tale of Earl Grey gin displayed at every John Lewis department store in the UK, after it was selected as the retailer’s gin of the month for March. \nThe spirit is infused with Earl Grey Tea, and was created by Newcastle Universitygraduates turned entrepreneurs Vincent Efferoth and Lukas Passia. \nNovelTea’s gin has previously been stocked in Fenwick department stores as well as 18 branches of John Lewis. However, after being named gin of the month The Tale of Earl Grey will now be sold in all of John Lewis’ UK stores. \nRadu Firanescu, digital marketing associate at NovelTea, said: \nIt’s very important for us as it means in terms of logistics we will be displayed and stored in all John Lewis branches not just the 18 we were already stocked in. From March 1 to the beginning of April customers can find us anywhere. \nWhat makes us very happy is that John Lewis launched a new strategy and wanted to offer clients new experiences, and we are glad they consider The Tale of Earl Grey to be strong and interesting enough to be its prime beverage for March. \nAs part of the promotion NovelTea will be holding a number of tasting sessions at John Lewis stores up and down the country. Tasting sessions will be held in major cities such as Newcastle, Liverpool, York, London, Glasgow, and Edinburgh. Lukas Passia and Vincent Efferoth, co-founders of Tea Venture, toast their success (Image: Radu Firanescu) 9:00 Jonathon Manning Vanilla Solutions software used in SMD's china launch \nNewcastle software firm Vanilla Solutions has designed specialist software that has been used in the Chinese office of a major subsea vehicle manufacturer. \nTyneside’s Soil Machine Dynamics (SMD) recently opened a new design and manufacturing facility near Shanghai, China. The company, which develops subsea vehicles for the oil and gas industry, hired Vanilla Solutions to create software to help run the plant. \nPaolo Zaino, IFS Support Manager at SMD, said: \nVanilla have been helping us to set up an IFS ERP system which is the software the Shanghai plant will use to run their operations. This has involved setting up a new database for the China office and migrating data from our UK database to our new one. \nSMD Shanghai will initially employ around 40 employees but we expect this to grow as the China market matures. \nWe’ve been working with Vanilla on the SMD Shanghai project since the beginning of 2017, so approximately a year, but have worked with Vanilla in a number of different areas for three or four years. \nThey were chosen because they could provide the range of skills that SMD were looking for in a consultancy to complete this task. The SMD Shanghai Project required robust project management, good technical expertise and also a comprehensive functional knowledge in order to successfully complete the project. Vanilla Solutions were enthusiastic about being involved from the start. \nThe software was used to simplify SMd’s manufacturing process. The tech incorporates asset and profect management, business analytics, finance and HR, as well as contract, document and work order management. \nClaire Valentine, Support Manager at Vanilla Solution’s TaSC, said: \nThree of us have been working with SMD on the project and it’s getting busier now we’re nearing the go live date. \nSMD needed a comprehensive ERP solution to support its business processes and simplify its manufacturing processes and we’ve moved the Shanghai operation on to IFS. What we’re implementing will be an over-reaching solution incorporating asset and project management, business analytics, finance and HR as well as contract, document and work order management. \nWe also have about 30 million records to migrate from one database to another, and then we need to detach the new database from the source, so there will be no communications between the two. One of SMD's subsea vehicles 8:55 KEY EVENT Healthy eating on the menu for Frankie & Benny's owner after profits fall \nFrankie & Benny’s owner The Restaurant Group has unveiled falling sales and profits, but is banking on healthier vegan and vegetarian dishes to boost its performance this year.The company - which also owns brands including Garfunkel’s, Joe’s Kitchen and Chiquito - reported an adjusted pre-tax profit of £56.7m in 2017, down from £77.1m.Sales fell 4.4% to £679.3m and dropped 3% on a like-for-like basis.Chief executive Andy McCue is overseeing a turnaround which has seen a revamp of pricing, food quality and marketing.The group is now planning to launch an “extended range of healthy dishes”, upgrading vegetarian and vegan options and introducing a new desserts range as it looks to better compete with rivals.Mr McCue said: \nAs expected, 2017 was a transitional year for the group, with significant investments made in price and proposition within our leisure business, which is driving improving volume momentum. \nWe start 2018 with a significantly more competitive offering in our leisure business, a strengthened pipeline of growth opportunities in both our pubs and concessions businesses, and a leaner, faster and more focused organisation. Frankie and Benny's in Trinity Square, Gateshead 8:50", "external_links": [], "published": "2018-03-07T10:30:00.000+02:00", "crawled": "2018-03-07T12:18:13.006+02:00", "highlightTitle": ""}