{"organizations": [], "uuid": "24db54a3300df54df2687a9ff3b3af2ad76e1c28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14424109.ece/ALTERNATES/s1200/CFR_NJL_150318filmfest_02.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/how-newcastle-film-festival-hopes-14422926", "country": "GB", "domain_rank": 21960, "title": "How the Newcastle Film Festival hopes to create a whole new North East industry", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-18T10:00:00.000+02:00", "replies_count": 0, "uuid": "24db54a3300df54df2687a9ff3b3af2ad76e1c28"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/how-newcastle-film-festival-hopes-14422926", "ord_in_thread": 0, "title": "How the Newcastle Film Festival hopes to create a whole new North East industry", "locations": [], "entities": {"persons": [{"name": "jacqui miller charlton", "sentiment": "none"}, {"name": "harry potter", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "get carter", "sentiment": "none"}, {"name": "billy elliott", "sentiment": "none"}, {"name": "craig conway", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle film festival", "sentiment": "positive"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How the Newcastle Film Festival hopes to create a whole new North East industry The city's inaugural Newcastle International Film Festival will bring a multitude of benefits to business, organisers say Share Two of the board members leading the Newcastle International Film Festival - Jacqui Miller Charlton and Craig Conway (Image: NIFF) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Newcastle International Film Festival launches in a few weeks’ time, pledging to showcase more than 250 films over four days. Festival president Jacqui Miller Charlton tells Coreena Ford of her hopes that the event could provide a springboard for a new industry in the North East. \nHaving provided the backdrop for films ranging from Billy Elliott and Get Carter to Harry Potter and Transformers, Newcastle and the North East is used to being in the movie spotlight. \nBut until now, the city has never hosted its own film international film festival. \nAll that will change next month when action is called on the inaugural Newcastle International Film Festival, a four-day event that organisers hope will also shine a light on everything that the region has to offer. \nIt’s hoped more than 60,000 visitors will descend upon the city when the festival starts on March 29, and it’s not just film fans who stand to benefit from the programme of premieres. The business eco wheel which Jacqui Miller Charlton has been showing businesses (Image: NIFF) \nThe event is being spearheaded by business pioneer Jacqui Miller-Charlton alongside actor and producer Craig Conway, who has uprooted from London to his native North East to work on the festival. \nJacqui may not have had any involvement in the film business before taking up the mantle of festival president – but thanks to her experience at Northumberland construction firm Miller, which she and her brothers grew into a world leader in its sector, she knows how to take an opportunity and make it work. \nAs tickets go on sale for a host of events – with directors Neil Marshall and Mike Hodges returning to the region especially for the event – Jacqui is issuing a rallying call to the North East business community to get involved. \nIt won’t just be the screening venues who will benefit, she says, but a whole raft of other companies, from the bars, restaurants and hotels poised to welcome the festival delegates over the Easter Weekend, to the taxi operators transporting them. \nLonger term, she and Craig hope to build up a new company with a mission to make waves in the feature film and TV industry, working with national and international filmmakers to create a new, sustainable industry in the North East. Read More Lanchester Group aiming for record year after 11% dip in turnover \nShe explained: “Clearly, when I first got involved, I’m not from the film industry – I’m from industry but not from a film background, so I have been on a very steep learning curve. \n“But what occurred to me is how many businesses could be included, and why haven’t we done this before? \n“I remember talking to one businessman when I first started on this, and he asked me ‘How are you going to pull this off?’ but we’ve built up a great team of passionate believers keen to see this work. \n“We’ve got a whole team of incredible people who have come together and who are really going to make a difference to this region. \n“But what would really make a difference is the coming together of businesses. This provides an opportunity for the coming together of business and artists. Everyone stands to benefit and it’s a very powerful recipe. Read More Gender pay gap in North being fuelled by male dominated boardrooms \n“My and the team’s whole purpose is to use this as a springboard to create a new company within the creative film industry. \n“There are so many the length and breadth of the UK and beyond who are involved in film and we need to show we can join them up in a collaborative way and make it a win-win for all concerned.” \nAs part of the plans for the new film company, Jacqui intends to open discussion with the Government on the potential of creating tax breaks for companies keen to become involved with movies being made in the region, specifically firms who don’t want to dip into their coffers but offer up their expertise. \n“We are looking at talking to national Government on how to involve businesses more in the film industry, even if they can’t provide money. For example, there might be construction companies who can help to build sets or provide materials and machinery for films. \n“If that equates to around £50,000 of services, why not put that into a line budget and allow businesses to claim tax credits? It’s a simple step and the Government wouldn’t necessarily have to give anything to be able to assist us.” \nThis inaugural year is important to put a stamp on the event, and Jacqui has high hopes for success that carry through into the new company. Read More Newcastle's bar and restaurant scene is booming, with bars opening faster than London \n“It’s important that we engage the whole region – it’s important everyone gets behind the festival. Who knows how far we can take it?” she said. \n“Everyone is watching us and looking at us to see how we do, and hopefully we will have created something really significant in terms of growing and creating a sustainable industry. \n“The reality is that whichever way we go with this tiger that is Brexit, we need sustainable business, that looks outward and not inward. And there’s no greater example than making films. \n“If you are looking at working with other countries that fall outside the EU, I can’t think of a more potentially lucrative business than independent film making – we will be able to work with and connect with people right across the world. \n“My quest is to ask the businesses of the region to please support and get involved and help this to grow. Just look at the Great North Run - it’s now the world’s biggest and best-loved half marathon. Why can’t the Newcastle International Film Festival become as great?” Read More Remember Rat Boy? There's a play of that name in Live Theatre's festival of new talent \nStephen Patterson, director of communications at Newcastle’s business improvement district NE1, said the inaugural festival provides an opportunity for the whole region. \nHe said: “We are delighted to welcome the international Film Festival to Newcastle this spring. It is fantastic that the city will be hosting such a prestigious event and that people from all over the world will be convening in our great city. \n“We have a long and illustrious history of film and cinema here in the North East from the obvious Ridley Scott connection to spawning a whole host of world class actors, directors, film and TV producers. Newcastle and the North East have also provided a tremendous backdrop for many films and TV productions, which makes the city an ideal location for a festival celebrating the industry in its entirety. \n“As a modern European regional capital city – the city is well placed to host an international event of this scale and we are confident that it will provide a welcome boost to the local economy through the hotel and leisure sector as well as turning the spotlight on the city as an international conference venue. I’m sure that the inaugural Newcastle Film Festival will be a huge success and hope that it is something that the city can build on in the years to come.” James Ramsbotham (Image: tark pic) \nJames Ramsbotham, chief executive of the North East England Chamber of Commerce, is also encouraging firms to get involved in the festival. \nHe added: “The film festival is a tremendous North East cultural asset for businesses to get behind and support. It brings visitors to our area from far and wide and, as well as showcasing the Region, it will provide a real boost for the local economy. \n“The benefits of festivals of this calibre are huge not just for visitors but also for our own film enthusiasts who can be inspired by the diverse range which will be shown. I urge companies to see what is on offer and grab the potential of this truly unique film showcase.” Like us on Facebook ", "external_links": [], "published": "2018-03-18T10:00:00.000+02:00", "crawled": "2018-03-18T10:10:20.022+02:00", "highlightTitle": ""}