{"organizations": [], "uuid": "291c8a1f414baf810bcbf0d25faa0bae2f88e72e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14469246.ece/ALTERNATES/s1200/GWR_-NJL_280318harrison_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-businessman-teams-up-former-14469138", "country": "GB", "domain_rank": 21960, "title": "Newcastle businessman teams up with former Cabinet Minister to push social mobility", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-28T19:39:00.000+03:00", "replies_count": 0, "uuid": "291c8a1f414baf810bcbf0d25faa0bae2f88e72e"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-businessman-teams-up-former-14469138", "ord_in_thread": 0, "title": "Newcastle businessman teams up with former Cabinet Minister to push social mobility", "locations": [], "entities": {"persons": [{"name": "david h", "sentiment": "negative"}, {"name": "david harrison", "sentiment": "none"}, {"name": "harrison centre", "sentiment": "none"}, {"name": "justine greening", "sentiment": "none"}], "locations": [{"name": "harrison centre", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "cabinet", "sentiment": "negative"}, {"name": "business newcastle", "sentiment": "negative"}, {"name": "true potential", "sentiment": "none"}, {"name": "social mobility pledge", "sentiment": "none"}, {"name": "harrison centre for social mobility", "sentiment": "none"}, {"name": "gaelic memories photography", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle businessman teams up with former Cabinet Minister to push social mobility David Harrison of True Potential is working with Justine Greening on pushing businesses to adopt a \"Social Mobility Pledge\" Share David Harrison, from the Harrison Centre for Social Mobility (Image: Gaelic Memories Photography) Share Get business   Thank you for subscribing! Could   \nA North East business leader has teamed up with a former Cabinet Minister to launch a national campaign that aims to get the business community involved in driving social mobility. \nThe Harrison Centre for Social Mobility, set up by David Harrison of Newcastle fintech firm True Potential, is working with former Education Secretary Justine Greening on a campaign that has been launched today with a debate in Parliament . \nMs Greening - who left the Government in January saying that “social mobility matters to me and our country more than my ministerial career” - has used the work of the Harrison Centre to launch her Social Mobility Pledge, which aims to get businesses involved in providing more opportunities for young people. \nLaunching the initiative with a debate in Westminster Hall, Ms Greening said that “most people in Britain” are held back by their backgrounds and their lack of connections can hinder them when applying for jobs. \n“Because of all of that, far too much of our nation’s talent goes to waste, which to me is totally unacceptable and has to change,” she said. Education Secretary Justine Greening (Image: PA) \nThe Social Mobility Pledge asks businesses to make three commitments: partnering with schools, giving access to apprenticeships or work experience opportunities to disadvantaged young people, and opening recruitment practices that promote a level playing field for candidates, such as name-blind or contextual recruitment. \nThe British Chambers of Commerce is encouraging its member companies to sign the pledge, as is the Federation of Small Businesses. Major businesses such as BT, Aviva, Adidas, ITV, Clifford Chance and KPMG are also backing the pledge. \nMr Harrison said: “Social mobility is not just about what the state can do. It exists in businesses throughout the country. Growing those opportunities and connecting them with local communities is key and that’s why the Social Mobility Pledge is so important. \n“We need to step up our approach to social mobility in this country, by replacing limited prospects with training towards better paying and more skilled jobs as well as encouraging entrepreneurialism.” Read More Grainger Games closes 21 stores and shuts down website as financial crisis worsens \nThe Harrison Centre says it aims to bring a “business-like” approach to the charity sector, taking a long-term view on how to tackle the problem of low social mobility in the UK. \nIts work has been picked up by Ms Greening, who said that the time was “rapidly approaching when we will need to come together behind some sort of a common vision of what kind of country we want Britain to be post-Brexit. \n“I believe that common vision should be a mission of finally creating Britain, for the first time, that has equality of opportunity. Brexit must be a moment for change when we can smash that class ceiling on opportunity once and for all.” Read More 750 Newcastle jobs safe as British Airways keeps call centre in-house \nResponding for the Government, Financial Secretary to the Treasury Mel Stride said the Government had made progress in education and skills, with 1.9m more children in good and outstanding schools than in 2010 and a “record” number of young people in education and training. \nHe said: “There is no doubt that if we provide a strong economy and we provide employment, that is the best way of moving up within society and particularly avoiding poverty.” Like us on Facebook", "external_links": [], "published": "2018-03-28T19:39:00.000+03:00", "crawled": "2018-03-28T21:22:30.018+03:00", "highlightTitle": ""}