{"organizations": [], "uuid": "29f9ba95007e73959b067b2cb131b3255849de26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13869880.ece/ALTERNATES/s1200/Pension-scams-on-the-rise.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fraudsters-targeting-people-nine-new-14452320", "country": "GB", "domain_rank": 21960, "title": "Fraudsters are targeting people with these nine new scams of 2018", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-24T12:29:00.000+03:00", "replies_count": 0, "uuid": "29f9ba95007e73959b067b2cb131b3255849de26"}, "author": "Cathrina Hulse", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fraudsters-targeting-people-nine-new-14452320", "ord_in_thread": 0, "title": "Fraudsters are targeting people with these nine new scams of 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "natwest", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Fraudsters are targeting people with these nine new scams of 2018 From cashpoint scams, to people preying on those heading to the World Cup this summer, here are the scams to look out for Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA surge of new scams in 2018 are trying to swindle cash from the unsuspecting public. \nA report from NatWest has identified the ways fraudsters are expected to con people out of their hard-earned dosh this year. \nAlongside research agency, The Future Laboratory, data from the last 18 months has been used to predict the super scams on the horizon. \nHere’s the list to watch out for: Social media spying \nWithout realising, we often give away too much information on our social media accounts . These posts make it simple for a crook to set up a scam. (Image: PA) Malicious software on smartphones. \nWhere would we be without our mobile phones? \nWe can check our bank balance, order shopping and even make a call but malware or malicious software threats will grow among mobile devices. Bogus Brexit investments \nFraudsters will try and con customers into fake investment opportunities. An example is where a con man will email customers warning Brexit will affect their savings and suggesting they should move them into a fake investment product. World cup fever \nWatch out for sites that sell either fake tickets and those that promise delivery but never arrive. Martin Dubravka of Slovakia makes as save during the FIFA 2018 World Cup Group F Qualifier between Scotland and Slovakia at Hampden Park on October 5, 2017 in Glasgow, Scotland (Image: Getty Images Europe) \nExperts say there will also be a surge in ‘package trips’ offered by fake travel companies. The advice is to always buy tickets from a reputable source. Money mules \nSocial media is often trawled by ‘mule recruiters’ who target the vulnerable, particularly cash-strapped students in university towns and use them to inadvertently launder money. \nThe unwitting targets receive the stolen funds into their account, withdraw it and send the cash to a different account, often overseas. They will be allowed to keep some of the money for their trouble. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Wedding excitement \nExperts fear couples could be easy prey for fraudsters who tempt victims with extravagant offers at bargain prices. Fraudsters can set up fake websites for elements of the big day like venue hire, catering, or wedding dresses that appear very realistic. Fake wedding planners will take people’s money and then disappear. Romance scams \nCruel criminals create fake profiles to form a relationship with their victims. They use messaging to mine for personal details to use for identity fraud. \nOften the fraudsters will play the perfect partner and then ask the smitten victim for money. Scams aimed at first-time buyers \nWho wouldn’t trust an email from a solicitor? Hackers monitor emails sent by a legal professional to a first-time buyer, pose as said solicitor and inform the unsuspecting buyer that the firm’s bank account details have changed in order to steal cash. A woman looking at houses for sale (Image: David Cheskin/PA Wire) \nJulie McArdle, NatWest security manager said: “Scammers are dogged in their attempts to get their hands on people’s money and are always looking for new ways to get ahead. This means banks and customers need to evolve alongside scammers too. \n“By being aware and staying ahead of scammers, we can stop them winning and keep the country’s money safe and secure.” Courier fraud \nThe con works by scammers calling and pretending to be police officers reporting suspicious activity on a bank account, the Birmingham Mail report . \nThey will often claim to have arrested someone with a cloned bank card or say cash has been withdrawn from the victim’s account. The fraudsters may also scare a person by saying the funds in their account are in fact counterfeit. \nIt’s a plausible scam as many will believe the bogus PC’s story has been verified by a follow-up call to their bank. \nWhat the victim doesn’t realise is that the criminals are still on the phone pretending to be a bank official. \nThe callers ask people to leave their bank card and pin numbers on their doorstep. \nPolice officers or genuine bank officials would never ask you to divulge PIN numbers over the phone or send couriers round to collect cards or cash. \nIf you receive a call asking you to do this, hang up immediately and phone the police. \nCheck for an open line or ideally call from a different phone. \nTo report an incident, call Action Fraud on 0300 123 2040. Advice from Action Fraud on cashpoint scams Stand close to the terminal. Always shield the keypad with your free hand, purse or wallet, and your body, to avoid anything or anyone seeing you enter your PIN. This will protect your PIN from anyone who might be looking over your shoulder, and also help to keep your PIN safe if a fraudster has set up a hidden camera to film the keypad. Stay alert and put your personal safety first. If someone is crowding or watching you, cancel the transaction and alert a member of staff. Do not accept help from seemingly well-meaning strangers and never allow yourself to be distracted. Have your card company’s 24 hour contact number stored in your mobile phone. If your card is retained, stay at the ATM and contact your bank immediately. If you spot anything unusual about the machine, or there are signs of tampering, do not use it. If you think you have been a victim of fraud, you should contact your bank immediately. Stick with ATM’s you trust and keep your eyes peeled. If something doesn’t feel right about an ATM or a credit card reader, don’t use it. Like us on Facebook", "external_links": [], "published": "2018-03-24T12:29:00.000+03:00", "crawled": "2018-03-24T15:26:17.302+03:00", "highlightTitle": ""}