{"organizations": [], "uuid": "d46f7b37d654aa073b0915eb3fe21dcfdfb70ffd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14447123.ece/ALTERNATES/s1200/TMP_NEC_220318DeLaRue05JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/de-la-rue-vows-fight-14451389", "country": "GB", "domain_rank": 21960, "title": "De La Rue vows to fight decision to print UK passport abroad", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-23T20:44:00.000+03:00", "replies_count": 0, "uuid": "d46f7b37d654aa073b0915eb3fe21dcfdfb70ffd"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/de-la-rue-vows-fight-14451389", "ord_in_thread": 0, "title": "De La Rue vows to fight decision to print UK passport abroad", "locations": [], "entities": {"persons": [{"name": "de la rue", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}], "organizations": [{"name": "de la rue", "sentiment": "none"}, {"name": "gemalto", "sentiment": "none"}, {"name": "government", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business De La Rue vows to fight decision to print UK passport abroad Up to 200 jobs at the firm's plant on Gateshead's Team Valley have been put at risk by the Government decision Share The De la Rue plant in the Team Valley. The company has lost out on a big contract to a french company to produce the blue passports after Brexit (Image: newcastle chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe boss of speciality print firm De La Rue has vowed to fight a Government decision to make the UK passport abroad after meeting staff on Tyneside whose jobs have been put in jeapordy by the move. \nMinisters have defended the selection of Franco-Dutch firm Gemalto to make the post-Brexit blue passport, saying the choice will save taxpayers about £120m. \nBut the Government has come under fire over the decision after it put at risk 200 jobs at the De La Rue plant in Gateshead, which has the current contract to produce the UK passport. \nThe row has been heightened by the Government’s announcement in December that the UK passport would change from the standard EU burgundy colour to a blue and gold design when the EU comes out of Europe, billing the new passport as an “expression of our independence and sovereignty”. How a British passport will look after Brexit and a burgundy UK passport in the European Union style format (Image: PA) \nNow Martin Sutherland, CEO of De La Rue, has vowed to fight the contract decision, with the company likely to submit an appeal next week and working on grounds for a judicial review. \nAfter a visit to the Gateshead plant, he said: “I have met the team in Gateshead today who are disappointed about the Government’s decision. After providing such a fantastic service for the last nine years, it is a real blow for them. \n“I have pledged that we will continue to fight to get this decision overturned so that the production of the British passport stays here in the UK where it belongs and is made by the great team here in Gateshead.” \nDe La Rue, which employs around 600 people at Gateshead and also prints currency for a number of foreign Governments, has around two years of the current passport contract. Blaydon MP Liz Twist at De La Rue on Team Valley Trading Estate (Image: Newcastle Chronicle) \nMr Sutherland - who has challenged Prime Minister Theresa May and Home Secretary Amber Rudd to visit Gateshead to explain the decision to the workforce - hasn’t said how the Tyneside jobs would be affected but did say the company would have to find new work. \nThe Home Office says that around £120m would be saved during the lifetime of the 11-and-a-half year contract, while up to 70 jobs will be created at factories in Fareham, Hampshire, and Heywood, Greater Manchester. \nBlaydon MP Liz Twist has visited the plant and has vowed to raise the issue with Ministers. \nShe said: “My concern is that our Government has really let these workers down. \n“I was really gobsmacked, with all the fuss that was made about blue passports, that the contract hasn’t gone to a UK company. There’s a real irony of the iconic blue passport being produced by a French-Dutch company.” Like us on Facebook", "external_links": [], "published": "2018-03-23T20:44:00.000+03:00", "crawled": "2018-03-23T23:42:28.000+03:00", "highlightTitle": ""}