{"organizations": [], "uuid": "14b5f39def4dc1481b5c9f5759aacff1a5cdbb5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13762866.ece/ALTERNATES/s1200/141017EUprotest-1JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/anti-brexit-protest-weekend-biggest-14438138", "country": "GB", "domain_rank": 21960, "title": "Anti-Brexit protest this weekend will be biggest Newcastle has seen, say organisers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-21T13:00:00.000+02:00", "replies_count": 0, "uuid": "14b5f39def4dc1481b5c9f5759aacff1a5cdbb5a"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/anti-brexit-protest-weekend-biggest-14438138", "ord_in_thread": 0, "title": "Anti-Brexit protest this weekend will be biggest Newcastle has seen, say organisers", "locations": [], "entities": {"persons": [{"name": "david hardman", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "andrew) adonis", "sentiment": "none"}, {"name": "adonis", "sentiment": "none"}, {"name": "brian paddick", "sentiment": "none"}], "locations": [{"name": "anti-brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nThe biggest anti Brexit protest ever held on Tyneside is to take place this weekend, organisers claim. \nThe rally has been organised by the North East for Europe (NE4EU) campaign and starts at 2pm at Grey’s Monument, in Newcastle, on Sunday. \nOne of 12 regional marches and events by #StopBrexit campaigners this weekend, organisers said they “anticipate that this event will be the biggest anti-Brexit protest Newcastle has seen to date”. \nThe rally will include a visit from the Stop Brexit float featuring a large “Brexit is a Monstrosity” caricature of political figures. Lord Adonis with Sedgefield MP Phil Wilson (left) (Image: Newcastle Chronicle) \nIt will feature speeches from prominent national political figures including former Cabinet minister Lord (Andrew) Adonis and former London mayor candidate Brian Paddick. \nDavid Hardman on behalf of the NE4EU campaign, said: “We are delighted that Lord Adonis will be speaking at our event, given his important recent contributions to the Brexit debate, along with other national campaigners including the founders of Scientists for EU and youth campaign Our Future Our Choice.” Read More Think tank says slashing import tariffs after Brexit won't make much difference to shoppers \nThe rally, which is expected to last over an hour, takes place just four days before the 12 month countdown to leaving the EU begins on March 29. \nAnd it comes at the end of a week in which the UK and EU agreed on a “large part” of the deal that will lead to the “orderly withdrawal” of the UK. \nNegotiators Michel Barnier and David Davis said the deal on what the UK calls the implementation period was a “decisive step” in the Brexit process. North East for Europe in Newcastle (Image: LHR) \nThe transitional period will last from Brexit day on March 29, 2019 to December 31, 2020. \nEU citizens arriving in the UK between these two dates will enjoy the same rights and guarantees as those who arrive before Brexit. The same will apply to UK expats on the continent. \nThe UK will be able to negotiate, sign and ratify its own trade deals during the transition period and still be party to existing EU trade deals with other countries. \nThe UK’s share of fishing catch will be guaranteed during transition but UK will effectively remain part of the Common Fisheries Policy, yet without a direct say in its rules, until the end of 2020. The Union Jack flies behind the European Union flag (Image: Stefan Rousseau/PA Wire) \nNorthern Ireland will effectively stay in parts of the single market and the customs union in the absence of other solutions to avoid a hard border with the Republic of Ireland. \nMany people still remain sceptical about the future of the UK under Brexit and have not give up hope of it being reversed. Read More Brexit: If there was another referendum how would you vote? Geordies have their say \nMr Hardman said: “We have already heard that the North East will be the hardest hit region by the economic impact of Brexit, and incomes are set to fall by 13% after Brexit. \n“There will be no gain in sovereignty, no reduction in immigration, no more money for the NHS. Now is the time to stop, listen, and think.” Like us on Facebook", "external_links": [], "published": "2018-03-21T13:00:00.000+02:00", "crawled": "2018-03-21T16:28:35.003+02:00", "highlightTitle": ""}