{"organizations": [], "uuid": "94798b39a1e0b32613aacc528a15e26cbe199922", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14362162.ece/ALTERNATES/s1200/Mothercare-results.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/mothercare-could-become-latest-victim-14362068", "country": "GB", "domain_rank": 21960, "title": "Mothercare could become latest victim of retail crisis after issuing profit warning", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-02T19:18:00.000+02:00", "replies_count": 0, "uuid": "94798b39a1e0b32613aacc528a15e26cbe199922"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/mothercare-could-become-latest-victim-14362068", "ord_in_thread": 0, "title": "Mothercare could become latest victim of retail crisis after issuing profit warning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "mothercare", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mothercare could become latest victim of retail crisis after issuing profit warning Shares in the firm collapsed after it entered crunch talks with lenders over poor Christmas trading Share A Mothercare store (Image: PA) Share Get business   Thank you for subscribing!   \nShares in Mothercare collapsed on Friday after the baby retailer warned that profits would disappoint and revealed it has opened crunch talks with its lenders. \nThe company, which only issued a profit warning in January following dismal Christmas trading, said it expects adjusted pre-tax profit to come in at the lower end of the £1m to £5m range it had previously guided. \nMothercare is also working with its lenders as it seeks “waivers of certain financial covenants”. \nThe group said in a statement: “Reflecting the more challenging trading environment and our seasonal cash flows, we are working with our financing partners with respect to our financing needs for 2019 and beyond. \n“We forecast our borrowings to increase towards the limit of our total committed and non-committed facilities at various points from the start of the new financial year, and will therefore require waivers of certain financial covenants.” \nShares tanked over 14% to 21p in afternoon trading as the retailer also said it is exploring “additional sources of financing” to support its transformation programme. \nChief executive Mark Newton-Jones is attempting to turn the business around and has embarked on a radical store closure programme. \nMothercare has been working to slim down the total number of UK stores to between 80 and 100 from 143, having shuttered several locations over the past year as part of those plans. \n“As previously announced and as part of our transformation strategy we have taken decisive action to reduce our central cost base. The business is also continuing with its planned strategy of reducing the UK store estate whilst increasing digital capabilities. \n“A further announcement will be made in due course,” the retailer added. \nThe announcement comes in a horror show week for the retail sector, with Toys R Us and Maplin collapsing into administration on Wednesday, impacting over 5,000 jobs. \nPrezzo and New Look are also poised to shut stores through Company Voluntary Arrangements, following similar moves by Jamie’s Italian and burger chain Byron earlier this year. \nRetailers across the board have been hammered by weak consumer confidence off the back of soaring Brexit-fuelled inflation. \nMr Newton-Jones said: “The retail sector continues to face a number of pressures that are clearly having a profound impact on the sector as a whole. \n“Against this backdrop we are performing in line with our expectations and remain a cash generative business, but we also need to push ahead with our transformation strategy to meet our customers’ needs and continue adapting to evolving shopping habits around the world. \n“We are working together with all our stakeholders, including colleagues, franchisees, financiers, suppliers and pensions trustees on this next phase of our transformation and their part in delivering these plans. \n“Despite the challenges, there remains a clear way forward for Mothercare to realise its ambition to be the leading global retailer for parents and young children.” Like us on Facebook", "external_links": [], "published": "2018-03-02T19:18:00.000+02:00", "crawled": "2018-03-02T20:48:35.008+02:00", "highlightTitle": ""}