{"organizations": [], "uuid": "aab13f4bfd3d1bdd163e2ea0c88c598bc1eaf97b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article785380.ece/ALTERNATES/s1200/Neil-Parish.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/news-opinion/need-fix-broken-housing-market-1340458", "country": "GB", "title": "We need to fix our broken housing market", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-14T20:14:00.000+02:00", "replies_count": 0, "uuid": "aab13f4bfd3d1bdd163e2ea0c88c598bc1eaf97b"}, "author": "Neil Parish", "url": "https://www.devonlive.com/news/news-opinion/need-fix-broken-housing-market-1340458", "ord_in_thread": 0, "title": "We need to fix our broken housing market", "locations": [], "entities": {"persons": [{"name": "neil par", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion We need to fix our broken housing market The government has taken action since Neil Parish called for a New Homes Ombudsman six months ago Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010 \nSix months ago, I wrote in this paper about the need to fix our broken housing market. \nI called for new houses to be built in traditional, popular designs. I also called for a New Homes Ombudsman. \nThe government has since taken action. It has launched a consultation to ‘strengthen consumer redress in the housing market’. It’s vital consumers have swift, effective routes to complain when things go wrong; that they know where to go, and are clear about what they can expect. Neil Parish \nThe current landscape does not support this. There’s not one redress scheme but many - and each operate different practices. Even this array of schemes does not entirely cover the issues that consumers might encounter. Too many people have no option but to take a grievance through the courts. Read More Carmakers should stop trying to beat the system – and take their responsibilities to citizens seriously \nWe need to streamline redress services through a single, transparent and accountable body with a remit that covers the whole of the housing sector. We need homes, not houses and it’s right the government has taken up the proposal for a New Homes Ombudsman. \nA major overhaul to the National Planning Policy Framework has also been launched this week. It focuses on maximising the use of land, strengthening protections for the Green Belt and converting more planning permissions into homes. \nThis is good news. We should be building up, not just out onto precious Green Belt. We should be maximising existing retail and industrial space for new homes, extending upwards on existing houses, shops and offices, and increasing density. Neil Parish elected in 2010 \nUsing the air space above existing buildings will unlock thousands of new homes. For example, an additional two levels could be added to a property, provided it is in keeping with the roofline of other buildings in the street or square. In practice, we will see more mews houses and terraced streets, rather than tower blocks. Read More When it comes to our precious natural environment, actions speak louder than words \nThis goes hand-in-hand with the government’s pledge to introduce new quality standards, so well-designed new homes are built in places people are proud to live in and next door to. If we want to meet the target of delivering 300,000 homes a year by the mid-2020s, design is key to public support. \nThat’s why I’m pleased the government is looking beyond the bricks and mortar, to the built environment and the people who will live there. In this vein, government has allocated £866 million for 133 council-led projects to fund infrastructure including new roads, cycle paths, flood defences and land remediation work. We also need more pubs, shops, parks and schools, if new towns are going to work. It’s about creating streets and communities, not ghost towns. Read More I will not allow Brexit to side-line food and farming in this country \nWhilst there’s no silver bullet to fixing the housing market, the new Ministry of Housing, Communities and Local Government has been getting down to important work, laying essential foundations for reform. It’s now for local authorities, builders and local people to engage and deliver the high-quality homes this country needs. Like us on Facebook ", "external_links": [], "published": "2018-03-14T20:14:00.000+02:00", "crawled": "2018-03-14T20:42:16.000+02:00", "highlightTitle": ""}