{"organizations": [], "uuid": "a769891d361e10befa9e456c7e77d1cf9552a32d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14379590.ece/ALTERNATES/s1200/New-Look-job-losses.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-look-shutting-60-stores-14379553", "country": "GB", "domain_rank": 21960, "title": "New Look shutting 60 stores across the country including six in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-07T16:03:00.000+02:00", "replies_count": 0, "uuid": "a769891d361e10befa9e456c7e77d1cf9552a32d"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-look-shutting-60-stores-14379553", "ord_in_thread": 0, "title": "New Look shutting 60 stores across the country including six in the North East", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "metro centre", "sentiment": "none"}], "organizations": [{"name": "north east news new look", "sentiment": "neutral"}, {"name": "new look", "sentiment": "none"}, {"name": "invalid email  retailer new look", "sentiment": "none"}, {"name": "cva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News New Look shutting 60 stores across the country including six in the North East Up to 980 jobs around the country are at risk as fashion retailer admits it is facing a 'difficult' business environment Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nRetailer New Look plans to shut 60 of its stores around the UK including branches in the North East. \nThe fashion chain admits it is facing a “difficult” retail environment and has made proposals to close 60 of its 593 stores. \nNew Look is launching a Company Voluntary Arrangement (CVA) and seeking approval from creditors on a plan which it says will improve operational performance. \nRedundancies are likely, with 980 jobs at risk. \nIn the North East, New Look has identified six branches it wants to shut. \nThey are in Team Valley, Gateshead ; The Metro Centre (menswear store), Gateshead; North Shields; Wallsend; Thornaby and Stockton-on-Tees. Read More North East news LIVE: Latest breaking news, sport, weather, traffic and travel \nAlistair McGeorge, of New Look, said: “Given our challenged trading performance and over-rented UK store estate, we are having to take tough but necessary actions to reduce our fixed cost base and restore long-term profitability. \n“We have held constructive discussions with our key landlords and strategic partners and will now seek creditor approval on our CVA proposal. A priority for us is to keep all potentially affected colleagues informed during this difficult time.” \nDaniel Butters, at Deloitte, said: “The retail trading environment in the UK remains extremely challenging, driven by weaker consumer confidence, the implications of Brexit and competition from online channels. \n“New Look is an iconic brand on the high street and the CVA will provide a stable platform upon which Management’s turnaround plan can be delivered. We have fully engaged with the British \n“It is important to stress that no stores will close on day one, and employees, suppliers and business rates will continue to be paid on time and in full.” Like us on Facebook", "external_links": [], "published": "2018-03-07T16:03:00.000+02:00", "crawled": "2018-03-07T16:51:21.010+02:00", "highlightTitle": ""}