{"organizations": [], "uuid": "79e327972ff8c013667485595978e6cfcbbef6fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1332335.ece/ALTERNATES/s1200/bella-italiaPNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/whats-on/food-drink/cafe-rouge-bella-italia-owner-1330284", "country": "GB", "title": "Cafe Rouge and Bella Italia owner reports £60m losses after restaurants continue to struggle", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-13T13:12:00.000+02:00", "replies_count": 0, "uuid": "79e327972ff8c013667485595978e6cfcbbef6fc"}, "author": "Abbie Bray", "url": "https://www.devonlive.com/whats-on/food-drink/cafe-rouge-bella-italia-owner-1330284", "ord_in_thread": 0, "title": "Cafe Rouge and Bella Italia owner reports £60m losses after restaurants continue to struggle", "locations": [], "entities": {"persons": [{"name": "byron", "sentiment": "none"}, {"name": "jamie", "sentiment": "none"}, {"name": "prezzo", "sentiment": "none"}, {"name": "abbie bray", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}], "organizations": [{"name": "cafe rouge", "sentiment": "none"}, {"name": "bella italia", "sentiment": "none"}, {"name": "belgo", "sentiment": "none"}, {"name": "la tasca", "sentiment": "none"}, {"name": "kfc", "sentiment": "none"}, {"name": "casual dining group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cafe Rouge and Bella Italia owner reports £60m losses after restaurants continue to struggle They are the latest chains to reveal a huge loss of profits Share Abbie Bray What's On Reporter 11:12, 13 MAR 2018 Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe owner of restaurant chains Cafe Rouge and Bella Italia, saw losses widen last year in a further sign of how restaurants are struggling. \nThe Casual Dining Group, which also operates La Tasca and Belgo, posted a £60m loss for the year to May 2017, 18% worse than losses suffered the previous year. \nIt blamed a “difficult trading environment” and “challenging conditions” linked to weak consumer confidence and the collapse in the Brexit-hit pound, which has seen costs soar while also pushing prices up for hard-pressed diners. Read More KFC crisis continues as Devon restaurants are STILL running low on chicken \nThe likes of Byron, Prezzo and Jamie’s Italian have all shut large swathes of their store estates recently as the sector is also hammered by large increases in business rates. \nIt comes as the CDG boss Steve Richards joined industry big hitters in writing a letter to Chancellor Philip Hammond, warning over the cost of doing business in the troubled sector. \n“Our business, along with many others operating in the hospitality sector up and down the country, is set to be saddled with inflation-busting business rate hikes next month”, he said. \nHe added: “High business rates stifle the sector’s growth potential and ability to create more jobs.” \nCDG also pointed to the National Living Wage, the introduction of the Apprenticeship Levy and increases in employer’s pension contributions as part of a string of costs pressures it is facing. \nLike-for-like sales nudged up 2.2% and revenue rose 10% to £329m across the group, which employs more than 10,000 people across 300 locations. Read More Exeter's cheese festival is happening this weekend - and it's bringing more than 140 types of cheese \nFollowing the news The Casual Dining Group will also be launching a new delivery service which they have named Stack & Grill, based out of its Cafe Rouge kitchens. \nThere are currently over 80 Cafe Rouge branches in the UK including the restaurant in Exeter City Centre, and according to CEO James Spragg, the new delivery service will be operating out of all of them. \nMr Spragg said at the Casual Dining Show that the group hopes to adapt some of Café Rouge’s kitchens to accommodate the new delivery brand and said it will need to purchase more kit. Read More ", "external_links": [], "published": "2018-03-13T13:12:00.000+02:00", "crawled": "2018-03-13T13:41:39.001+02:00", "highlightTitle": ""}