{"organizations": [], "uuid": "c4fda6ca8543fe8d9ad190fcea534baa756198ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1370408.ece/ALTERNATES/s1200/MAIN-passport.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/devon-mps-calls-uk-ditch-1370423", "country": "US", "title": "Devon MPs calls for UK to ditch plan for French passports", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-22T11:09:00.000+02:00", "replies_count": 0, "uuid": "c4fda6ca8543fe8d9ad190fcea534baa756198ea"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/devon-mps-calls-uk-ditch-1370423", "ord_in_thread": 0, "title": "Devon MPs calls for UK to ditch plan for French passports", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "neil shaw", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "de la rue", "sentiment": "none"}, {"name": "gemalto", "sentiment": "none"}, {"name": "exeter mnp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon MPs calls for UK to ditch plan for French passports He says we should keep the current burgundy ones rather than have new ones made abroad Share Neil Shaw Head of Digital 09:09, 22 MAR 2018 Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Devon MP has called for Theresa May to reverse the decision to have future UK passports made in France when they switch from the current burgundy to a new blue cover. \nThe UK’s new blue passports, seen by some as a symbol of the country taking back control from the EU, will be made by a Dutch firm in France. \nBut Exeter MNP Ben Bradshaw has called the move 'a shambles'. \nBritish firm De La Rue, which produced its first passport for the UK Government in 1915, has lost out on the £490million contract to produce the UK’s post-Brexit identity documents from next year - which has been won by Dutch global security firm Gemalto, which is based in Amsterdam. Read More More than half claiming new benefit in Plymouth are struggling to pay rent \nThe Sun reports Gemalto were declared winners after a ‘blind tender’ process where means ministers were not allowed to know who had submitted the individual bids. \nHowever, former cabinet minister Priti Patel, who resigned over unofficial meetings with Israelis, told The Sun: “This should be a moment that we should be celebrating - the return of our iconic blue passport will re-establish the British identity. \n“It is a national humiliation. I would urge Amber Rudd and the Government to look again at the powers they have to see what they can do.” \nBen Bradshaw tweeted: \"Dear Theresa May, can we please keep our British-made burgundy EU passports, rather than being forced to have French-made blue/black ones?\" \nCivil service procurement rules mean the government is not able to exclude other EU nations from bidding. \nThe Home Office insisted the passport contract is being tendered 'fairly'. \nA spokeswoman said: \"We are running a fair and open competition to ensure that the new contract delivers a high quality and secure product and offers the best value for money for customers. Read More New laws coming into force in April could cost you hundreds, here's what you need to know \n\"All passports will continue to be personalised with the holder’s details in the United Kingdom, meaning that no personal data will leave the UK. \n“We do not require passports to be manufactured in the UK. A proportion of blank passport books are currently manufactured overseas, and there are no security or operational reasons why this would not continue.” \nThe decision has now sparked fears hundreds of jobs could be under threat at De La Rue, which produced its first passport for the UK Government in 1915, it was reported. \nThe ‘Blue‘ passport cover was introduced in 1921 and phased out when the UK joined the EU - however UK could have kept the navy travel documents. There is no Brussels regulation stating that EU countries’ passports had to be a certain colour, merely a non-binding European council resolution from 1981 which recommends burgundy. Like us on Facebook ", "external_links": [], "published": "2018-03-22T11:09:00.000+02:00", "crawled": "2018-03-22T11:33:15.029+02:00", "highlightTitle": ""}