{"organizations": [], "uuid": "6631f4dd5959b0d0f3ccf1fc73615c41ee1dc64d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14410484.ece/ALTERNATES/s1200/Toys-r-Us-at-the-Metro-Center-Gateshead.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/toys-r-close-3000-job-14410040", "country": "GB", "domain_rank": 21960, "title": "Toys R Us to close with 3,000 job losses after failure to find buyer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-14T15:28:00.000+02:00", "replies_count": 0, "uuid": "6631f4dd5959b0d0f3ccf1fc73615c41ee1dc64d"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/toys-r-close-3000-job-14410040", "ord_in_thread": 0, "title": "Toys R Us to close with 3,000 job losses after failure to find buyer", "locations": [], "entities": {"persons": [{"name": "stockton", "sentiment": "none"}, {"name": "moorfields", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "invalid email  toys r us", "sentiment": "none"}, {"name": "moorfields advisory", "sentiment": "none"}, {"name": "stockton share toys", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Toys R Us to close with 3,000 job losses after failure to find buyer The toy chain has stores in the North East at Gateshead, Sunderland and Stockton but they will close in six weeks Share Toys r Us at the Metrocentre (Image: Newcastle Chronicle) Share Get business   Thank you for subscribing!   \nToys R Us is to shut all 100 of its UK stores after administrators failed to find a buyer for the collapsed retailer, resulting in the loss of 3,000 jobs. \nThe toy chain - which has stores in the North East at Gateshead, Sunderland and Stockton - appointed Moorfields Advisory to oversee an administration at the end of February but the group said on Wednesday that \"it has not been possible to secure a sale\". \nA total of 67 staff at the company's head office in Maidenhead have now been made redundant and 25 stores have either closed in recent days or are due to close by Thursday. \nThese stores had been earmarked for closure as part of a restructuring before its demise and Moorfields will now begin a six-week \"wind down\" of the remaining estate, including those in the North East. \nSimon Thomas, joint administrator and partner at Moorfields, said: \"We have made every effort to secure a buyer for all or part of the company's business. This process attracted some interest, but ultimately no party has been able to move forward with a formal bid prior to the expiration of the stated deadline. \n\"It is therefore with great regret that we have made the difficult decision to make a number of positions redundant at the company's head office in Maidenhead and proceed with a controlled store closure programme. \nToys R Us is one of the nation's biggest toy retailers, employing more than 3,000 across 100 stores in the UK. \nMoorfields said at the time of the chain's collapse that it was making \"every effort\" to secure a buyer for all or part of the business, but no suitor materialised in what is proving to be a dire time for high street retailers. \nProfessor Heiner Evanschitzky, co-director of Aston Centre for Retail Insights based at Aston Business School, said: \"A key problem for Toys R Us was a lack of clear focus: is it a big box discount store for toys, a store with a vast assortment of toys, a leader in quality and service? \n\"They missed an opportunity to reposition themselves as an inspirational place to shop at. Consumers rightly asked why they should bother going there instead of buying online.\" \nThe retail sector has had a dismal start to 2018, with the collapse of Toys R Us and Maplin and a host of firms undergoing painful restructurings, including New Look and eateries run by celebrity chef Jamie Oliver , as well as Byron and Prezzo. \nHigh street chains across the board have been hit hard by falling consumer spending, soaring Brexit-fuelled inflation and competition from online rivals. Like us on Facebook", "external_links": [], "published": "2018-03-14T15:28:00.000+02:00", "crawled": "2018-03-14T15:51:13.009+02:00", "highlightTitle": ""}