{"organizations": [], "uuid": "6834cfc7bc0173e2c49d8464b118eac28267b140", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14189635.ece/ALTERNATES/s1200/Business-rates.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/communities-secretary-says-councils-like-14371032", "country": "GB", "domain_rank": 21960, "title": "Communities Secretary says councils like Northumberland are contributing to housing shortage", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-05T23:00:00.000+02:00", "replies_count": 0, "uuid": "6834cfc7bc0173e2c49d8464b118eac28267b140"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/communities-secretary-says-councils-like-14371032", "ord_in_thread": 0, "title": "Communities Secretary says councils like Northumberland are contributing to housing shortage", "locations": [], "entities": {"persons": [{"name": "sajid javid", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Communities Secretary says councils like Northumberland are contributing to housing shortage The Cabinet Minister responsible for housing hits out at local authorities that have delayed home-building plans Share Communities Secretary Sajid Javid (Image: PA) Share Get daily   Thank you for subscribing!   \nCommunities Secretary Sajid Javid has attacked councils such as Northumberland that have failed to agree housebuilding plans. \nHe said they were contributing to the nation’s lack of high-quality housing. \nMr Javid made the remarks as the Government launched proposals to increase the supply of affordable housing, including making local councils responsible for ensuring homes are built. \nNorthumberland scrapped its housing strategy in July last year and is currently consulting on a new one, but Mr Javid has threatened to intervene to force them to speed up the process. \nAnd in a speech to a national planning conference in London, he said: “You’ll have heard me express my frustration about some local planning authorities that are still lagging behind on this score. \n“I’ve said it before and I’ll say it again: these plans are absolutely key to helping us build the right homes in the right places. \n“So it’s vital that you get them in place quickly and keep them up to date to ensure that permissions turn into homes. \n“The alternative – speculative development and neighbourhoods that are poorly planned, lacking strong communities – is something that none of us want to see.” Read More \nNorthumberland was one of 15 councils put “on notice” by the Government last year for failing to agree a plan setting out how land will be used for new homes and jobs. \nIt is now unlikely to adopt a new Local Plan until 2020. Read More Here's what the North East needs to hear from Theresa May on Brexit \nThe Government has warned that failure to agree plans and keep them up to date “will no longer be tolerated” and threatened intervention to force them to act. \nBut Northumberland’s Conservative administration says it had to axe the previous plan, drawn up when the council was Labour-led, because it would “concrete over Northumberland”. Like us on Facebook", "external_links": [], "published": "2018-03-05T23:00:00.000+02:00", "crawled": "2018-03-05T23:44:01.000+02:00", "highlightTitle": ""}