{"organizations": [], "uuid": "9a7ce8436424449bf0236a1c56eca86dddacbfc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14311785.ece/ALTERNATES/s1200/JS144111326.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14372507", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: William Hill to sell off Australian bookmaker business after gambling crackdown", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-06T10:30:00.000+02:00", "replies_count": 0, "uuid": "9a7ce8436424449bf0236a1c56eca86dddacbfc7"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14372507", "ord_in_thread": 0, "title": "Business Breakfast RECAP: William Hill to sell off Australian bookmaker business after gambling crackdown", "locations": [], "entities": {"persons": [{"name": "william hill", "sentiment": "negative"}, {"name": "jonathon manning", "sentiment": "negative"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "north east local enterprise partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Future of North East economy depends on 'best possible' Brexit outcome, report says \nThe future success of the North East economy depends on the Government negotiating “the best possible terms of access to other markets” in the Brexit process, a new report will today say. \nThe North East Local Enterprise Partnership is unveiling its first annual Our Economy report, saying that more than two-thirds of new jobs created in the North East should be highly skilled. \nThe LEP’s Our Economy report highlights recent successes which have seen more than 55,000 new jobs created in the region between 2014 and 2017, more than half of the 100,000 target set by the LEP. Of those, 73% were classed as “better jobs”, meaning they were either at managerial level or above or in professional occupations. \nThe report also highlights the region’s exporting record, which saw £12.7bn of goods exported in 2016/17, with the EU accounting for 59% of all exports - a higher rate than the rest of England. \nDiscussing plans to maintain and strengthen the region’s international trade ties, the report says: \nThe North East LEP will work with its partners to deliver these objectives. \nHowever, the success of these measures will also rely on the UK having strong relationships and appropriate treaties in place with other nations. \nAs the UK Government goes through the process of leaving the EU, it is critically important for the North East’s businesses and residents that they negotiate the best possible terms of access to other markets for the UK. \nThe LEP report comes less than a month after a leaked Government impact report on Brexit revealed that the North East would be worst affected by leaving the EU, regardless of whatever deal was negotiated by the Government. \nLast week it was also warned that the UK automotive industry could be devastated by a no-deal Brexit, with the North East again likely to be among the hardest hit. Part of the Newcastle City Centre skyline (Image: Newcastle Journal) 9:24 KEY EVENT Your Move owner sees turnover grow by £4m amid 'subdued market' conditions \nEstate agent company LSL Property Services added almost £4m to its top line last year, despite the housing market suffering from subdued conditions. \nLSL, which owns 14 different brands including Your Move and Reeds Rains, saw its revenue grow from £307.8m to £311.5m for the year ending December 2017. \nCommenting on the results, chairman Simon Embley said: \nConsumer confidence was impacted by rising inflation, subdued wage growth and changes to buy-to-let regulations, leading to reduced housing transactions in 2017. Despite the subdued market backdrop, LSL’s focus on its stated strategy delivered growth in both Financial Services income and Lettings income and improved productivity in the Surveying business. These self-help measures have protected LSL from the full impact of the challenging housing market in 2017. \nWe continued to invest in our brands in 2017 to drive future growth, and increased dedicated headcount to support our successful Lettings and Financial Services income streams and to grow our Land & New Homes business. During 2017 we also opened two new Marsh & Parsons branches in outer prime Central London. \nWhile turnover at the firm was up operating profit fell from £65.4m to £52.1m. This was largely due to LSL boosting its operating profit in 2016 through the sale of £32.9m worth of assets. Your Move is owned by LSL Property Services Plc (Image: pa) 9:19 Jonathon Manning Newcastle firm designs app to launch new 10 pence pieces \nCoin collectors interested in a new range of 10p coins which includes an image of the Angel of the North can now take part in the “Great British Coin Hunt” thanks to a Newcastle tech firm. \nDigital marketing agency Mediaworks has designed and developed The Royal Mint’s Great British Coin Hunt app, which has been released before the roll-out of the UK’s new range of 10p coins. \nThe 26 coins depict an A to Z of quintessentially British items, locations and personas, with the first coin showing an image of Gateshead’s Angel of the North. Other coins portray James Bond, Stonehenge, double decker buses, and queuing. \nMediaworks’ app allows users to keep track of the coins they have collected by scanning the 10p piece with their smartphone. It also uses the phone’s map functionality to show where specific coins have been found and the location of swap shops events to help users complete their collection. \nInformation such as the coins rarity is stored on the app and users can also earn badges by unlocking more coins. Artistic coin collectors can also use the app’s “create-a-coin” feature to design their own 10p piece, which they can show to their friends. \nThe app’s launch has been a major success, with more than 700,000 people downloading the software within the first 24 hours. \nAndrew Blenkinsop, Mediaworks’ creative director, said: \nTo design and develop an app of this scale for The Royal Mint is hugely exciting and we’re incredibly proud of the end product we have delivered. \nWe hope both coin collectors and other users will enjoy using the app and the functionality we have included. \nInterested collectors can download the Great British Coin Hunt app from Google Play and the Apple App Store. Mediaworks has developed the Great British Coin Hunt app for The Royal Mint 9:10 Jonathon Manning ScS to open a further 15 stores as sofa specialist targets best retail units \nSunderland furniture chain ScS is planning to open a further 15 stores across the UK , with the group looking at expansion in Scotland. \nCompany CFO Chris Muir told The Journal that the sofa retailer planned to open between 10 and 15 new retail units in an attempt to continue to increase its market share. \nScS currently has 101 stores across the UK but believes there are still areas of the country where it could open to reach its “core customers”. \nBut Mr Muir warned that the openings would not be rushed as the company was waiting to secure only the best stores. \nHe said: \nWe are probably looking at entering 15 units over the next five to 10 years. If you rush to open, you don’t get the best units. \nWe are in a queue to get the best stores. We are only opening stores that are better than our average store. \nIt is unlikely that any further stores will be opened in the North East, as Mr Muir said ScS has the region “fairly well covered”. However, he added that the retailer could look to increase its presence in Scotland, as well as looking further South to places such as Peterborough and Exeter. \nEach store requires between eight and 10 sales staff to run, meaning the openings could lead to the creation of up to 150 new jobs. The expansion could also lead to an increase in the number of carpet fitters and distribution staff employed by the company. \nHowever, Mr Muir also warned that a number of poor performing branches could be closed in the future. \nHe said: \nThere are some stores we might look to move and a couple that we might close, and we will do when they come to the end of their leases. \nScS has staved off the poor retail conditions that have blight many of its rivals, with carpet retailer CarpetRight last week forced to issue its second profit this year. \nDuring 2016/17 ScS saw its turnover increase by almost 5% to £333m, while its operating profit grew by 9.1% to £12m. Chris Muir, ScS's chief financial officer (Image: NCJ Media) 9:05 Jonathon Manning Melrose deal could harm GKN's retirement fund, warns pensions watchdog \nMelrose’s £7.4bn hostile swoop for GKN could have a detrimental impact on the engineering giant’s pensions scheme, according to the pensions watchdog.The Pensions Regulator (TPR) said the levels of debt involved in the deal raised concerns about whether the Melrose would be able to service GKN’s £700m pension deficit.In a letter to the Work and Pensions Select Committee, TPR called for Melrose to put the deal through the authority’s voluntary clearance system, a process which allows companies to seek the watchdog’s backing before a deal is complete.Writing to committee chairman Frank Field, TPR chief executive Lesley Titcomb said: \nFrom the outset we have been concerned that the increased leverage involved in the proposed takeover by Melrose is likely to have a detrimental impact on covenant. \nIn any major corporate transaction, such as a takeover, we expect the companies involved to identify if there is potential material detriment to a pension scheme and explain how they will mitigate against that detriment. \nWe would expect sufficient mitigation to be agreed with scheme trustees to ensure that a pension scheme is not placed in a worse position by any takeover. \nThe committee has been calling for the voluntary clearance system to be made mandatory to ensure a pension scheme is not neglected when a deal is on the table.Such a move would enable the TPR to oppose a deal at an earlier stage if it risks putting the retirement fund in jeopardy.Mr Field urged Melrose to put the bid through voluntary clearance.He said: \nI think pensioners would be surprised to know that a pension scheme could be offloaded to someone clearly less equipped or inclined to support it without the regulator having a say. \nA proportionate, mandatory clearance check as we recommended would be valuable in cases like this. \nMelrose claims an impeccable record in protecting pension rights. The surest way to demonstrate its commitment in this case would be to apply voluntarily for clearance. \nThe letter comes after GKN announced on Friday that it is in talks with US firm Dana over a potential merger of its automotive business.The group has also firmed up the timings on Project Boost - its plan to persuade investors not to back Melrose’s bid - with a proposal to separate GKN Aerospace and GKN Driveline into two listed companies set for mid-2019.GKN, which employs around 58,200 staff, has become a target after profit warnings in October and November following problems at its US aerospace division sent shares tumbling.A Melrose spokeswoman said: \nMelrose has consistently strengthened the pension scheme covenants of the businesses that it has acquired. \nEvery time we have disposed of a business we have left the business free from deficit. \nWe have also stated that we will improve the position of GKN pensioners, making a £150 million cash contribution to the GKN pension schemes. \nMelrose model is about delivering operational improvements through investment and incentivising management teams. \nWe use only modest levels of leverage but invest on average an additional amount equivalent to a third of the original equity purchase price into our businesses in order to strengthen and grow them for the benefit of all our stakeholders, including pensioners, employees, customers and shareholders. GKN Jonathon Manning Just Eat hails record year despite swinging into the red \nOnline takeaway delivery firm Just Eat has swung to a loss in 2017 after taking a mammoth hit on its Australian and New Zealand business, but cheered a record surge in orders.The group - recently promoted to the FTSE 100 Index - slumped to a £76m pre-tax loss last year against profits of £91.3m in 2016 after taking a £180.4m charge on the acquisition of its Australian and New Zealand arm.Just Eat said with the hit stripped out, it would have made a profit of £104.4m.It posted underlying earnings of £164m - up 42% on 2016 - and forecast this to grow further in 2018, to between £165m and £185m.Recently appointed chief executive Peter Plumb - the former Moneysupermarket.com boss who took the helm last September - said he planned to step up investment across the UK and its overseas markets.He said: \n2017 was a record year for Just Eat. We helped 21.5 million customers order 172 million takeaways around the world, growing group revenue by 45% to £546m. \nHe added: \nAs the new CEO, I will be increasing our investment in brand, developing markets and delivery services that will be engineered to complement our thriving marketplace business by bringing more choice to our takeaway-loving customers. Just Eat app", "external_links": [], "published": "2018-03-06T10:30:00.000+02:00", "crawled": "2018-03-07T02:09:36.000+02:00", "highlightTitle": ""}