{"organizations": [], "uuid": "3522a1efea005122fcb4587a289b2ea324997e6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/article1316795.ece/ALTERNATES/s1200/Maplin-1jpeg.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/whats-on/shopping/exeters-maplin-store-closing-down-1316790", "country": "US", "title": "Exeter's Maplin store is closing down - and there's a HUGE clearance sale", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-08T20:51:00.000+02:00", "replies_count": 0, "uuid": "3522a1efea005122fcb4587a289b2ea324997e6f"}, "author": "Richard Amofa", "url": "https://www.devonlive.com/whats-on/shopping/exeters-maplin-store-closing-down-1316790", "ord_in_thread": 0, "title": "Exeter's Maplin store is closing down - and there's a HUGE clearance sale", "locations": [], "entities": {"persons": [{"name": "maplin", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "haven road", "sentiment": "none"}], "organizations": [{"name": "invalid email  exeter", "sentiment": "none"}, {"name": "rutland partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Maplin is holding a closing down sale Share Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nExeter’s Maplin store is closing down as the high street woes continue. \nThe electrical goods chain, which is owned by private equity firm Rutland Partners, called in administrators PwC last month to try and find a buyer. \nBut with buyers not forthcoming, a wave of redundancies have already taken place across the company – and staff at the Exeter branch are set to be next. Read More New blow for the high street as John Lewis and Waitrose reveal BIG fall in profits Some products are now up to 50 per cent off \nA huge closing down sale has now begun at the store, with some products being reduced by as much as 50 per cent. \nHuge signs reading “everything must go” have been plastered on the windows of the shop, based on Haven Road. \nA closing date for the store has not yet been revealed. \nMaplin’s other Devon stores – in Barnstaple and Plymouth – are also at threat at closure. \n“I can confirm this morning that it has not been possible to secure a solvent sale of the business and as a result we now have no alternative but to enter into an administration process, Maplin CEO Graham Harris said last week. \n\"During this process Maplin will continue to trade and remains open for business. Maplin in Exeter is set to close \n\"The business has worked hard over recent months to mitigate a combination of impacts from sterling devaluation post Brexit, a weak consumer environment and the withdrawal of credit insurance.” \nHe continued: \"This necessitated an intensive search for new capital that in current market conditions has proved impossible to raise. \n“These macro factors have been the principal challenge not the Maplin brand or its market differentiation. Read More The restaurants and shops we have lost in Devon over the past year \n\"We believe passionately that Maplin has a place on the high street, and that our trust, credibility and expertise meets a customer need that is not supported elsewhere. \n\"We will now work tirelessly alongside Zelf Hussain, Toby Underwood and Ian Green, from PWC, who have been appointed as the as Joint Administrators of Maplin Electronics Limited, to achieve the best possible outcome for all of our colleagues and stakeholders.” Like us on Facebook", "external_links": [], "published": "2018-03-08T20:51:00.000+02:00", "crawled": "2018-03-08T21:06:37.020+02:00", "highlightTitle": ""}