{"organizations": [], "uuid": "79c7e7b23ef3187441ff691d7a6c13194649135e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14446850.ece/ALTERNATES/s1200/DPP_SAH_WL180142_109JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-report-heathrow-airport-expansion-14446516", "country": "GB", "domain_rank": 21960, "title": "New report on the Heathrow Airport expansion plans - but it's calling for MORE delays", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-23T08:00:00.000+03:00", "replies_count": 0, "uuid": "79c7e7b23ef3187441ff691d7a6c13194649135e"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-report-heathrow-airport-expansion-14446516", "ord_in_thread": 0, "title": "New report on the Heathrow Airport expansion plans - but it's calling for MORE delays", "locations": [], "entities": {"persons": [{"name": "lilian greenwood", "sentiment": "none"}], "locations": [{"name": "heathrow airport", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}], "organizations": [{"name": "surrey)  committee", "sentiment": "none"}, {"name": "commons transport committee", "sentiment": "none"}, {"name": "invalid email  long-awaited", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLong-awaited plans for a third runway at Heathrow could face further delays after MPs raised a series of concerns about pollution, costs and the benefits for regional airports. \nNewcastle International Airport , North East England Chamber of Commerce and the region’s MPs have warned that the local economy will suffer unless Heathrow is expanded. \nBut the Commons Transport Committee has concluded that the Government should only allow the scheme to go ahead after it addresses concerns over air pollution , noise levels and fears that the fees charged to airlines will increase. Heathrow Airport Terminal 2, Heathrow, London (Image: Get Surrey) \nCommittee chairman Lilian Greenwood said: “The Government and Heathrow have made efforts to mitigate these significant impacts, but safeguards on air quality, surface access, connectivity, costs and charges and noise should be strengthened.” \nThe committee’s recommendations are significant because the planning process for a third runway can only proceed once Parliament approves the Government’s Airports National Policy Statement. \nMinisters have laid the statement before Parliament, and the committee was given the task of scrutinising it on behalf of the House of Commons. \nOne of the benefits of expanding Heathrow is that it would improve services from regional airports. \nTransport Secretary Chris Grayling has said a third Heathrow runway would allow new services from Durham Tees Valley Airport to Heathrow, connected to flights from across the globe, and existing services between Newcastle Airport and Heathrow would be safeguarded. Read More Theresa May rapped by Government body over claims police funding is on the rise \nNorth East business leaders and politicians say that international links are particularly important for the region because of the importance of exports to the local economy. \nHowever, one of the concerns raised by the Transport Committee was a lack of guarantees that regional airports would get the new connections which have been promised. \nReferring to the planned third runway as the North West Runway (NWR), the MPs said in a report published today: “Given the uncertainty around the eventual domestic route offering at Heathrow, more needs to be done to reassure non-London regions that they will be offered this connectivity once a NWR scheme is delivered.” \nThe Transport Secretary told the MPs that he intended to reserve up to about 15% of slots on the new runway for domestic connections, the MPs said. Long-awaited plans for a third runway at Heathrow could face further delays (Image: Get Surrey) \nBut they added: “It is not clear how the Secretary of State intends to reserve slots for domestic connections.” \nCommittee members included Grahame Morris , the MP for Easington. \nHe told the Chronicle: “The Transport Committee have looked at the issues involved in great detail taking evidence from those in favour and those against the expansion at Heathrow. \n“The committee has been quite clear in offering qualified support for Heathrow. \n“There are significant economic benefits of a new runway in the South East to regions like the North East but - and it is a big but - the Government must address and clarify some key issues including details of new surface transport links, guarantees of improved connectivity with the regions, mitigate the impact of noise pollution and climate change from an increased number of flights, and ensuring the taxpayer and passengers get value for money from what will be a huge £30 billion investment. \nFury over decision to manufacture post-Brexit blue passports in France - what our MPs are saying \n“Ministers must lay their plans before Parliament and do this before giving the green light to the next stage of the planning process to deliver the benefits of a key piece of national infrastructure, a modern international hub airport that serves the needs of the whole country.” \nThe Government announced it was backing a third runway at Heathrow in October 2016 but there have been concerns about the lack of progress since then. \nA Department for Transport spokesman said: “This report is very clear – airport expansion in the South East is vital and the Heathrow North West runway is the best option for delivering it. \n“We thank the select committee for its work, which recognises that boosting the UK’s airport capacity is essential for our future prosperity and our position in the global market. \n“Expansion will only proceed if it meets strict environmental obligations and offers a world-class package of compensation and mitigations for local communities. \n“We will consider the committee’s recommendations along with the more than 80,000 responses we received to our public consultation, and remain on track to publish a final National Policy Statement in the first half this year.” Like us on Facebook", "external_links": [], "published": "2018-03-23T08:00:00.000+03:00", "crawled": "2018-03-23T08:35:59.008+03:00", "highlightTitle": ""}