{"organizations": [], "uuid": "10f98c5bb22efee45dbff74b7f55965c8cea1081", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.bathchronicle.co.uk/incoming/article863240.ece/ALTERNATES/s1200/Natwest.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/scam-alert-eight-danger-areas-1357944", "country": "GB", "domain_rank": 48128, "title": "Scam alert: eight danger areas for 2018 highlighted by NatWest bank - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.993, "site_type": "news", "published": "2018-03-20T06:00:00.000+02:00", "replies_count": 0, "uuid": "10f98c5bb22efee45dbff74b7f55965c8cea1081"}, "author": "Vicky Shaw", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/scam-alert-eight-danger-areas-1357944", "ord_in_thread": 0, "title": "Scam alert: eight danger areas for 2018 highlighted by NatWest bank - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [{"name": "russia", "sentiment": "none"}], "organizations": [{"name": "leicester mercury get daily", "sentiment": "negative"}, {"name": "natwest", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFrom the World Cup in Russia to a rise in money mules - scammers are set to use these eight opportunities to catch you out in 2018. \nThat's the warning from NatWest which has predicted ways crooks could try to con people this year in a bid to help people avoid becoming victims. \nAdvice has also been put together to stop people being tricked. \nThe bank has worked with research agency the Future Laboratory to analyse scams trends from the last 18 months and predict eight emerging frauds in 2018. Read More Eight things you need to know about the potential Apple iPhones hitting the market later this year \nThese are the danger areas it has highlighted: \n1. Social media spying. People might not realise how much information they are giving away, but to a fraudster the posts can be very helpful in setting up a scam. \n2. Malicious software on smartphones. It is expected that malware or malicious software threats will grow among mobile devices. \n3. Bogus Brexit investments. Consumers should be wary of fake investment opportunities. For example, scammers may email customers, warning Brexit will affect their savings, and that they urgently need to move them into a seemingly plausible, but actually fake, investment product. \n4. Fraudsters preying on World Cup excitement. Some fraudsters will sell football tickets that are either fake or will never arrive. It is also expected that \"package trips\" will be offered by fake travel companies. \n5. Money mules. Mule recruiters may trawl social media for potential targets, particularly cash-strapped students in university towns, and use them to inadvertently launder money. Money mules receive the stolen funds into their account, they are then asked to withdraw it and send the money to a different account, often one overseas, keeping some of the money for themselves. \n6. Wedding excitement. Experts fear couples could be easy prey for scammers who tempt victims with extravagant offers at bargain prices. Scammers can set up fake websites for elements of the big day like venue hire, catering, or wedding dresses that appear very realistic. Fake wedding planners will take people's money and then disappear. \n7. Romance scams. Criminals create fake profiles to form a relationship with their victims. They use messaging to mine victims' personal details to use for identity fraud. Or, just when the victim thinks they have met the perfect partner the scammer asks them for money. \n8. Scams aimed at first-time buyers. Computer hackers monitor emails sent by a solicitor to a first-time buyer and then they pounce, pretending to be the solicitor and telling them the solicitors' bank account details have changed in order to steal cash. Read More The telltale signs your neighbours might be swingers laid bare \nJulie McArdle, NatWest security manager, said: \"Scammers are dogged in their attempts to get their hands on people's money and are always looking for new ways to get ahead. This means banks and customers need to evolve alongside scammers too. \n\"By being aware and staying ahead of scammers, we can stop them winning and keep the country's money safe and secure.\" \nTo help thwart scammers, NatWest said people should feel confident about turning down unsolicited requests for personal information. \nIt said if something feels wrong then it is usually right to pause and question it. \nIt said people should follow their bank's security advice and never provide remote access to their device when asked to do so following a cold call. Read More \nThey should also be cautious about what information they provide on social media. \nPeople should also make sure their mobiles have the latest security upgrades, NatWest said. \nA bank will never ask a customer to transfer money for fraud reasons or contact them out of the blue to ask for their Pin or full password. Like us on Facebook ", "external_links": [], "published": "2018-03-20T06:00:00.000+02:00", "crawled": "2018-03-20T06:51:40.002+02:00", "highlightTitle": ""}