{"organizations": [], "uuid": "b05132840f0e806796bd7f766dfe802a9da55775", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14354815.ece/ALTERNATES/s1200/MKR_NEC_290917pfi_03.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/damning-inspection-downgrades-surgical-service-14354724", "country": "GB", "domain_rank": 21960, "title": "Damning inspection downgrades surgical service at University Hospital of North Durham", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-01T15:22:00.000+02:00", "replies_count": 0, "uuid": "b05132840f0e806796bd7f766dfe802a9da55775"}, "author": "Kali Lindsay", "url": "https://www.chroniclelive.co.uk/news/north-east-news/damning-inspection-downgrades-surgical-service-14354724", "ord_in_thread": 0, "title": "Damning inspection downgrades surgical service at University Hospital of North Durham", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "university hospital of north durham damning", "sentiment": "negative"}, {"name": "university hospital of north durham inspectors", "sentiment": "negative"}, {"name": "darlington nhs foundation trust", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "university hospital of north durham", "sentiment": "none"}, {"name": "care quality commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Damning inspection downgrades surgical service at University Hospital of North Durham Inspectors rated the overall service provided by County Durham and Darlington NHS Foundation Trust as Requires Improvement Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheatre staff at the University Hospital of North Durham failed to attend mandatory training because they were too busy, according to a damning report. \nDuring an unannounced visit, inspectors examined the surgical team’s training records and found overall compliance with mandatory training within the service was 51% - against a target of 95%. \nThe service had its rating downgraded from good to requires improvement following the inspection by the Care Quality Commission. \nOverall the rating for services provided by County Durham and Darlington NHS Foundation Trust remained unchanged from a previous inspection in 2015 as Requires Improvement. \nInspectors found that despite action being taken, at trust level, regarding never events - a serious event that is entirely preventable - there was need for further learning to be embedded to keep patients safe. University Hospital of North Durham \nBut medical care, including older people, had improved. \nDoctors, nurses and healthcare professionals were supporting each other to provide care, with all staff working together as a team. \nInspectors, who visited the hospital between September 12 and October 20 last year, could see procedures to protect vulnerable adults or children were well embedded. \nThe team also visited Darlington Memorial Hospital which was also given an overall rating of Requires Improvement - the same as 2015. \nEllen Armistead Deputy Chief Inspector, Hospitals for the North, said to see a deterioration in surgery was a concern. \nShe added: “Since our last inspection at County Durham and Darlington NHS Foundation Trust, in February 2015, the rating for trust has remained the same at Requires Improvement. \n“We did see some improvement at Darlington; maternity services and leadership and medical care at Durham. \n“It was encouraging to note that the leadership had improved across the trust, due to the implementation of the recommendations from the 2015 report. \n“However, to see deterioration in surgery across the trust is a concern.” Read More 7,000 Nissan workers could lose their jobs if Theresa May gets Brexit wrong \nHowever, she said there is still “plenty of scope for the ratings” to improve and wants to pace of change to be addressed. \nShe added: “I hope that before future inspections the trust can make further improvements so that it can improve the quality and safety of care the benefit of patients. \n“The trust will need to demonstrate they can address all outstanding areas for improvement since our last inspection and sustain the improvements we have reported on.” \nA spokesperson for the trust said they are pleased the report recognises many improvements have been made since the previous inspection against a context of significant challenges for the NHS. \nThey added: “We continue to strive to receive a ‘good’ rating overall; we are fully committed to a continuous improvement journey and indeed much work has already taken place since the inspection last autumn. \n“We were able to respond straight away to some areas of improvement based on verbal feedback following the inspection, and some other areas are continuations on work programmes which are well under way across the trust.” Read More Behind the scenes: Times Square pantomime actors reveal why they walked out of troubled show \nThe spokesperson said patients should be assured their safety, quality of care and experience remains their highest priority. \n“This is recognised both through the trust’s consistent ‘good’ rating for caring as well as the trust’s ‘good’ rating for well-led with the CQC highlighting the strong link between the quality of overall management of a trust and the quality of its services,” the said. “It was also particularly pleasing to note the areas of outstanding practice highlighted across our maternity services and the compassion, dignity and respect with which our staff are caring for patients. \n“We are proud of our workforce and know there is a strong commitment and dedication running through the trust to deliver on these improvements and beyond.” Like us on Facebook", "external_links": [], "published": "2018-03-01T15:22:00.000+02:00", "crawled": "2018-03-01T16:50:42.030+02:00", "highlightTitle": ""}