{"organizations": [], "uuid": "5923ea0f72da84ddeceaafc721c7580b2b5a29e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14470130.ece/ALTERNATES/s1200/JS131155490.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14470120", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Bargain Booze owner to call in administrators putting 2,600 jobs at risk", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-29T10:21:00.000+03:00", "replies_count": 0, "uuid": "5923ea0f72da84ddeceaafc721c7580b2b5a29e3"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14470120", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Bargain Booze owner to call in administrators putting 2,600 jobs at risk", "locations": [], "entities": {"persons": [{"name": "decem", "sentiment": "none"}, {"name": "mike hawes", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford 750 Newcastle jobs safe as British Airways keeps call centre in-house \nHundreds of jobs at a North East British Airways call centre are safe after the airline confirmed the service will not be outsourced . \nThe travel giant confirmed that its Newcastle and Manchester contact centre operations will be maintained in-house, scuppering outsourcing firm Capita’s hopes of winning contracts for the work. \nThe decision, which follows a lengthy review of its operations at the two call centres, will come as welcome relief to staff at the centre on Newcastle Business Park, which employs 750 people. \nIt is the second time workers at the Newcastle centre have worried for their future, when concerns were raised that the operation could be moved overseas. Instead, however, the company ploughed extra investment and resources into the centre. The British Airways customer call centre on Newcastle Business Park (Image: Newcastle Chronicle) 9.10 KEY EVENT Newcastle city centre hotel set for transformation - creating 300 jobs \nDevelopers have pledged to create 300 new jobs with plans to transform one of Newcastle’s biggest hotels in a multi-million-pound deal. \nGainford Group have pledged to turn the former Premier Inn in New Bridge Street into the most luxurious hotel in Newcastle in a move which will also create a new gateway into the city. \nThe growing care and leisure group already owns the Vermont Hotel and Vermont Aparthotel on Newcastle Quayside, the County Hotel opposite Central Station and the forthcoming County Aparthotel on Westgate Road. \nNow the family firm has taken on its fifth and biggest leisure challenge to date, by completing the deal to purchase the 180-bed former Premier Inn hotel, which was sold for an undisclosed sum after being marketed with an asking price of at least £3.2m. \nThe deal safeguards 50 jobs – all of the hotel’s existing staff – and triggers the start of a huge project to completely refurbish the hotel to bring it in line with the rest of the group’s portfolio, which also includes Aveika, Livello and The Hudson. \nAround 300 jobs are set to be created or safeguarded through the makeover project – 150 new jobs in the hotel and 150 through the construction phase – which will get under way this summer. \nThe firm said the building lies in a currently neglected part of the city centre, but its plans aim to make the hotel the focal point of the area’s rejuvenation. A CGI of how the former Premier Inn in New Bridge Street, Newcastle, is set to be transformed by the Gainford Group 9.08 KEY EVENT Number of cars built in UK falls again \nThe number of cars built in the UK has fallen again following the seventh consecutive month of decline in the domestic market, new figures show. \nJust under 145,500 cars rolled off production lines last month, 4.4% fewer than in February last year, the Society of Motor Manufacturers and Traders (SMMT) reported. \nThere was another double digit decline in production of cars for the UK, down by 17%, following falls of 24% in December, 28% in November and 14% in September. \nExports also fell, by 0.8%, with 117,139 vehicles shipped overseas, 80% of the total output. \nMike Hawes, SMMT chief executive, said: “Another month of double digit decline in production for the UK is of considerable concern, but we hope that the degree of certainty provided by last week’s Brexit transition agreement will help stimulate business and consumer confidence over the coming months. “These figures also highlight the scale of our sector’s dependency on exports, so a final deal that keeps our frictionless trade links with our biggest market, the EU, after December 2020 is now a pressing priority.” Vauxhall Astra cars on production line in factory (Image: Handout) 9.05 Coreena Ford Grainger Games closes 21 stores and shuts down website as financial crisis worsens \nTroubled video game retailer Grainger Games has reportedly closed 21 of its shops, at the same time as its website was taken offline. \nGrainger Games - which started life by selling video games in Newcastle’s Grainger Market - revealed last week that it was facing a financial crisis after a number of its credit facilities were cut. \nThe company’s financial situation seems to have taken a turn for the worse after a third of its shops were told not to open, including shops at Durham, Whitley Bay, Thornaby and Washington. \nGrainger Games’ website has also been closed down, meaning the business will now only be able to sell its games and merchandise in its remaining high street shops. \nWhen viewed yesterday the retailer’s website showed an error code accompanied by the words “game over” and a picture of Nintendo character Mario, who appeared to have fallen over. The image has since been replaced by a picture of Grainger Games’ logo. Grainger Games, Nun Street, Newcastle upon Tyne (Image: Newcastle Chronicle) 9.00 Coreena Ford Ikea reveals gender pay gap for UK business \nIkea has revealed the gender pay gap across its UK operation, reporting men earn more in its retail sector - but women come out on top on the distribution side of the business. \nThe median gender pay gap is 6.9% in men’s favour for retail, but 0.9% towards women in distribution. Women make up just over half of the homeware giant’s 10,000 retail staff, responsible for running stores and online sales. \nHowever, only 17% of the 900 employees in the distribution operation, which includes logistics and transportation, are women. \nThe two sides of the business are registered as separate entities in the UK, according to a spokesperson. \nIkea’s senior management are registered under retail. \nThe report’s authors said more men occupied senior positions in store and country management level, which falls under retail, but the reverse is true for the smaller distribution sector. \nIkea’s figures are significantly lower than both the UK average (18.4%) and the average for other retail businesses (9.3%). \nBoth Debenhams and Argos have reported a smaller median gender pay gap for their business on the whole, however, of 0.3% and 4.2% respectively. \nJohn Lewis reported a median gender pay gap of 7.8%. \nThe gender pay gap is calculated as the difference between the average salaries of men and women - it is not the same as equal pay, where firms are required to pay people doing the same job the same salary regardless of gender. \nBy April 4, companies and public bodies with 250 employees or more are required to have submitted their median and mean gender pay gap figures to the Government. \nAn estimated 9,000 employers are expected to have to submit such data, with those who miss the deadline potentially facing legal action. \nIkea’s figures for the mean gender pay gap show the business in a more positive light in terms of gender equality, but both the Government and Office for National Statistics say the median figure is a more accurate measure. Plastic models of a man and woman (Image: PA) 8.55 Coreena Ford House prices fall for second month in a row \nAnnual house price growth fell to a seven-month low in March amid subdued consumer confidence, according to an index. \nAcross the UK, average values increased by 2.1% year-on-year in March, marking the weakest annual growth seen since August 2017. \nOn a monthly basis, prices dipped for the second month in a row. A 0.2% month-on-month decrease in March came after a 0.4% fall in February. The average house price in March stood at £211,625. \nRobert Gardner, Nationwide’s chief economist, said: \nOn the surface, the relatively subdued pace of house price growth appears at odds with recent healthy rates of employment growth, a modest pick-up in wage growth and historically low borrowing costs. \nHowever, consumer confidence has remained subdued, due to the ongoing squeeze on household finances as wage growth continues to lag behind increases in the cost of living. Housing (Image: Newcastle Chronicle) Coreena Ford US firm makes £3.9bn swoop for UK fin-tech firm Nex Group - and jobs will go \nUK financial-technology firm Nex Group has agreed to a £3.9bn takeover by US futures exchange giant CME, but the pair warned over plans to slash around 750 jobs after the deal. \nThe groups confirmed around 16% of the combined workforce is expected to be axed following the tie-up and said there will be potential office closures. \nThe combined firm’s operations, IT, and selling, general and administrative functions are expected to be in line for cuts in the first three years following completion of the deal, they said. \nThey also cautioned that there may be offices shut where they both have sites in London, New York, Singapore, Hong Kong, Tokyo, Beijing and Sydney. \nNex - which employs around 2,000 staff worldwide - will see its London headquarters merged with CME’s, which is based in Chicago, although the firms said their European HQ will be based in London in a boost to the City amid Brexit talks. \nNex founder and chief executive Michael Spencer - the former treasurer of the Conservative Party - will join the CME board and will remain with the combined group as a special adviser. \nHe will also act as ambassador for the combined company working with key clients, regulators and officials in EMEA and Asia. \nThe deal, which follows weeks of talks, will create a global markets giant, combining the world’s largest futures exchange with Nex’s expertise in currency and sovereign debt markets. Computer Circuit Board (Image: Getty Images) 8.40 Coreena Ford Who would be affected if Conviviality collapses? \n- According to the company’s most recent annual report published last August, Conviviality employs more than 2,600 people and has more than 700 retail stores trading primarily as Bargain Booze, Select Convenience and Wine Rack, and that’s alongside 352 franchises. \n- Conviviality supplies more than 25,000 restaurants, hotels and bars - including Wetherspoon - more than 700 franchised retail outlets, and over 400 independent specialists. \n- It also caters to festivals and events, as well as major supermarkets. \n- It has been reported that parts of the business could be close to a potential sale, but Conviviality has warned many of the pubs it supplies through its Matthew Clark distribution division could face short-term supply issues. \n- It is understood accountancy giant PwC is being lined up as administrator if a buyer isn’t found. 8.30 Shares in Conviviality remain suspended until further notice \nThe firm said shares of Conviviality Plc remain suspended pending further notice. \nA stock market announcement had been made last night, updating shareholders of the situation, detailing how a key element of resolving the firm’s finding requirements was an equity placing to raise £125m, which the directors believe is the minimum amount required to adequately recapitalise the business. \nThe firm said: \nDespite a significant number of meetings with potential investors resulting in good levels of demand, and constructive discussions with a number of key customers and suppliers regarding the provision of support, there was ultimately insufficient demand to raise the full £125.0 million. \nThe Board wish to thank its customers, suppliers and employees for their continued support during this difficult period for the Company. \nThe Company is in discussions with its lending banks and advisors regarding other possible options and is in receipt of a number of inbound enquiries regarding a potential sale of all or parts the business. 8.20 KEY EVENT Bargain Booze owner Conviviality to call in administrators \nBargain Booze owner Conviviality has said that unless circumstances change it plans to appoint administrators within the next 10 business days, putting around 2,600 jobs in jeopardy. \nThe company - owner of more than 700 retail stores trading primarily as Bargain Booze, Select Convenience and Wine Rack - said it will continue trading over that period in the hope of preserving “as much value as possible” for its stakeholders. \nIt will keep working alongside advisers and said it is exploring “a number of inbound enquiries regarding a potential sale of all or parts of the business”. \nRecent weeks have seen chief executive Dianna Hunter step down after issuing a string of profit warnings and revealing a £30m tax bill. \nThe firm was forced to try to tap up investors for £125m as a result, but it has been unable to convince them of its long-term future. \nThe group said that secured creditors of the business can appoint administrators without notice. \nIn a stock market announcement the firm said: \n“Following discussions with its lending banks, the board has resolved to file notice of intention to appoint administrators to the company. \n“Unless circumstances change, and in accordance with statutory requirements, the board intend to appoint administrators within 10 business days.” \nThe company’s collapse would cap a nightmare quarter for the retail sector. \nSince January, Toys R Us and Maplin have filed for administration, while fashion retailers such as New Look and Select have embarked on radical store closure programmes. \nPiling on the misery has been the under-pressure casual dining sector, with Prezzo, Byron and Jamie’s Italian all shutting restaurants and culling hundreds of jobs. Conviviality will call in administrators unless circumstances change More On", "external_links": [], "published": "2018-03-29T10:21:00.000+03:00", "crawled": "2018-03-29T11:15:24.000+03:00", "highlightTitle": ""}