{"organizations": [], "uuid": "f4717f0ce7186a1d345f8909cb6531079229fb00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14436198.ece/ALTERNATES/s1200/The-Rocket-2.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/commercial-property/challenges-remain-north-east-commercial-14436150", "country": "GB", "domain_rank": 21960, "title": "Challenges remain but North East commercial property professionals are positive", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-21T10:00:00.000+02:00", "replies_count": 0, "uuid": "f4717f0ce7186a1d345f8909cb6531079229fb00"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/business/commercial-property/challenges-remain-north-east-commercial-14436150", "ord_in_thread": 0, "title": "Challenges remain but North East commercial property professionals are positive", "locations": [], "entities": {"persons": [{"name": "jez davison", "sentiment": "negative"}, {"name": "sally ann norman", "sentiment": "none"}, {"name": "steve blair", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Challenges remain but North East commercial property professionals are positive Jez Davison finds professionals in bullish mood as they plough ahead with developments despite Brexit uncertainty Share The Rocket office development in Newcastle (Image: Copyright: Sally Ann Norman) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLast week young leisure entrepreneur Steve Blair revealed plans to transform the derelict 19th Century public toilets in the Bigg Market into Newcastle’s quirkiest wine bar. The 29-year-old engineer revealed he’d been in discussion with Newcastle City Council for two years about his intention to revamp the empty ‘flying saucer’ building, converting the cubicles into a trendy drinking establishment. \nThe ambitious project highlights the innovative thinking that characterises several commercial property developments that are gathering pace in the North East of England. Whilst UK economic growth generally remains sluggish – around 1.7% in 2017 – the local leisure and hospitality sectors are seeing plenty of activity. \nThis has been recognised in a new report which indicates the number of bars, restaurants and other licenced premises opening in Newcastle have outpaced those opening their doors in London. \nAnalysed by consultancy firm CGA on behalf of the Northern Restaurant & Bar trade show, the data shows that Newcastle was home to 397 licensed premises in 2017, with the number of bars and restaurants growing by 15.7% over the last five years. The city has more licenced premises than several larger cities, including Leeds (which has 341), Cardiff (220) and Bradford (107). \nIt’s not all good news, however. Several restaurants in the region have been hit by the recent crisis in the casual dining sector, with Prezzo announcing it is to shut outlets in Darlington and Newcastle. Meanwhile, Byron is to close its restaurant in the Metrocentre as part of a company voluntary arrangement that will see the upmarket burger chain shut up to 20 outlets and pay cheaper rent on those that remain open. \nThe picture is generally positive, though. The data analysed by CGA shows that the wider Tyne Tees area was one of the few regions in the country not to see its bar and restaurant numbers fall over the last five years. \nThe healthy level of activity in the leisure sector has been noted by commercial property professionals in the region. Tim Aisbitt, head of agency at Bradley Hall chartered surveyors and estate agents \nTim Aisbitt, head of agency at Bradley Hall chartered surveyors and estate agents, said: “Leisure and hospitality continues to be buoyant. The increasing number of bar and restaurant developments are set to continue to build the city’s reputation as an attractive destination. \n“The light industrial sector is also performing very well as consumer activity continues to increase steadily.” \nChallenges remain, however – not least the combination of slow economic growth, uncertainty surrounding the impact of Brexit and the continued lack of prime office space in the region. \nReal estate consultancy Knight Frank also highlighted the paucity of good quality modern industrial stock. \nPeter Bowden, partner and head of office at Knight Frank Newcastle, said: “The statistics show that there’s around 4.2 million sq ft currently available but only 485,000 sq ft of that space could be considered modern. The lack of supply is already driving rents upwards, which means industrial speculative development is back on the agenda. This is not the case for offices, where rents and lease lengths have not yet reached a level where development without some form of public sector support is viable. \n“However, we go into 2018 with around 170,000 sq ft of Grade A office space available but we believe there are currently around 250,000 sq ft of active city centre requirements. This will produce rental growth.” \nKnight Frank recently published an in-depth study that looked at the fortunes of the office market across key UK cities. Although Newcastle city centre saw a 19% fall in office take-up in 2017, there was a rise in the level of inquiries and viewings towards the end of the year. \nThe availability of Grade A space was 175,000 sq ft, 15% below the ten-year average, but none of this was made up of new buildings. Peter Bowden, partner and head of office at Knight Frank Newcastle \nMr Bowden said: “In the Newcastle city centre office market, prime rents are increasing with a new headline of £23.50 per sq ft being achieved at the end of 2017. This growth provides an opportunity for landlords who see the prospect of better returns by investing in their buildings to create a better product more aligned to the needs of the occupier. Examples of this include Central Square South which has recently achieved the new headline for the city. \n“After a major refurbishment last year, Earl Grey House on Grey Street has now set new headline rents for Grey Street and Barclays House will deliver a significant refurbishment in the next few months, further enhancing the offer to occupiers who are demanding so much more from their office space. It’s envisaged that rents will grow further looking forward, as the lack of new Grade A space continues.” \nPlans are in place to rectify the undersupply of office space. Science Central is due to deliver a first phase of 120,000 sq ft of speculative offices next year and will be the first new space to be developed in Newcastle since the Rocket office complex was completed in 2016 as part of the Stephenson Quarter scheme. \nElsewhere, Milburngate promises to boost the regeneration of Durham, with the first phase delivering retail and leisure outlets including a boutique Everyman cinema, Pitcher and Piano, a 92-bed Premier Inn and the new concept steak restaurant, Bar + Block. \nIn the industrial market, Henry Boot Developments was recently announced as the development partner for the International Advanced Manufacturing Park (IAMP) to the north of the Nissan site in Washington. The aim is to build an advanced manufacturing centre of excellence, creating at least 5,000 jobs and attracting more than £400m of private sector investment into the region. \nIn the south of the region, the £22m Tees Advanced Manufacturing Park aims to create 180,000 sq ft of accommodation for hi-tech firms across ten buildings, with the potential of up to 1,000 new jobs. Geoff Hogg, developer behind the forthcoming Tees Advanced Manufacturing Park \nGeoff Hogg, developer behind the Tees AMP, said work was “progressing well” and a formal planning application is due to be submitted in April or May of this year. Site investigation work and preparation for building work is ongoing and it’s anticipated that the first buildings will be available for use from early 2019. \nMr Hogg said: “The site is already home to the industry-leading TWI Technology and Training Centre, where testing of materials and products takes place for a wide range of industries, including oil and gas, chemical, power and transport. We’ll bring together a cluster of forward-thinking, like-minded businesses in premises developed in a high-quality landscaped environment. Tees AMP will add millions to gross value added (GVA) in the region and will change the face of manufacturing in the Tees Valley. Tees AMP is already working with colleges, universities and training providers to provide a comprehensive manufacturing solution with a trained and skilled workforce.” \nDeveloping Consensus, a consortium of North East-based property investors, developers and professional advisors, said there was likely to be more growth in the industrial sector in the future. \nChairman Gavin Black said: “A good level of expansion has taken place. Companies have taken up some of the vacant stock and that has encouraged more development.” \nIt has been more of a struggle for the retail sector, though. Toys R Us recently announced it was to close all of its UK stores, resulting in the loss of around 3,000 jobs, and the future of Maplin looks uncertain after administrators failed to find a buyer for the stricken electronics retailer. Smaller independent retailers have also struggled with spiralling rental costs and business rates but Mr Black said savvy operators could still thrive on the high street. \n“The pattern of retail has changed,” he said. “Companies that complement their physical store with an online presence and excellent customer service are the ones that can do well.” \nLocation is another critical factor that influences how successful retailers can be. Bob Fletcher, retail property consultant at Newcastle-based @retail, said: “In some parts of this region retailers are struggling but in more affluent market towns, such as Morpeth and Hexham, they’re doing well. In some towns there are too many retailers; some will have to close for others to thrive. \n“Having said that, there are still opportunities for independent retailers to take spaces that were previously occupied by multiples.” Bob Fletcher, retail property consultant \nMr Fletcher believes the North East holds plenty of commercial property investment opportunities, even if investors have to dangle a few extra carrots to get tenants through the doors. \n“Tenants have more power nowadays,” he said. “They can demand ten-year leases with break clauses.” \nAnother key challenge going forward is how the industry will deal with the impact of Brexit, whatever form that will take. North East firms are typically bullish, however, with Bradley Hall insisting that it was very much “business as usual”. \nTim Aisbitt said: “Businesses are still looking to grow their operations, especially in the office and industrial sectors. Investors have a continued appetite for the region due to good levels of returns. \n“The UK will continue to be a secure country to invest in [post-Brexit]. The North East has fantastic opportunities, a strong workforce and vibrant start-up sector.” Like us on Facebook", "external_links": [], "published": "2018-03-21T10:00:00.000+02:00", "crawled": "2018-03-21T10:12:41.003+02:00", "highlightTitle": ""}