{"organizations": [], "uuid": "69d3c06d6fe1058bad0373d2548aa5ded9e8b6c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.gloucestershirelive.co.uk/whats-on/shopping/article1387856.ece/ALTERNATES/s1200/selectPNG.png", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/select-could-soon-shut-stores-1392510", "country": "GB", "domain_rank": 48128, "title": "Select could soon shut stores putting jobs at risk", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-28T11:28:00.000+03:00", "replies_count": 0, "uuid": "69d3c06d6fe1058bad0373d2548aa5ded9e8b6c8"}, "author": "Isaac Ashe", "url": "https://www.leicestermercury.co.uk/news/business/select-could-soon-shut-stores-1392510", "ord_in_thread": 0, "title": "Select could soon shut stores putting jobs at risk", "locations": [], "entities": {"persons": [{"name": "humberstone", "sentiment": "none"}], "locations": [{"name": "quantuma", "sentiment": "none"}, {"name": "maplin", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "cva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Select could soon shut stores putting jobs at risk \"The business has suffered as a result of the depressed retail market and escalating rent and rate charges.\" Share Click to play Tap to play The video will start in 8 Cancel Play now Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAnother brand could soon be disappearing from Leicestershire high streets as the company behind high street fashion chain Select has become the latest retailer to embark on a radical restructuring. \nThe firm could close stores and put the future of some 2,000 staff at risk as a result. \nGenus UK, which trades as Select from 183 outlets, has called in corporate recovery firm Quantuma to advise on a Company Voluntary Arrangement (CVA), which allows a firm to close loss making stores and secure rent reductions. \nThe proposal includes an option for landlords to “take back loss-making sites” and comes at a dire time for the retail sector, following the collapse of Toys R Us and Maplin. Read More Maplin store closures could be announced soon \nLocations under threat have not been revealed. The value ladies’ fashion retailer, targeting 18-35-year-olds, has outlets in Humberstone gate in Leicester, in Coalville's Belvoir Shopping Centre and in The Crescent in Hinckley. \nThe likes of Mothercare, Carpetright and House Of Fraser are also facing choppy trading as retailers are hammered by Brexit-fuelled inflation, soaring business rates and falling consumer confidence. \nQuantuma said the decision to press ahead with the CVA reflected the “current prevailing issues for businesses trading on the high streets”. Around 2,000 jobs could be at risk (Image: www.alamy.com) \nAndrew Andronikou, partner at Quantuma, said: “The business has suffered as a result of the depressed retail market and escalating rent and rate charges. \n“This inevitably has caused a squeeze on cash flow resulting in a cash burning for a number of years. \n“The position for this business, and many businesses of the same model is no longer tenable and has escalated to the present situation where a CVA is considered to be the only option, other than closing it in its entirety”. Read More Mothercare, Moss Bros and CarpetRight: More big high street names struggling \nCreditors will meet on April 13 to vote on the CVA. \nMr Andronikou added: “The loss of anchor tenants on high streets and in smaller shopping centres has had a downward spiralling effect on stores such as Select, culminating in a reduction of footfall and therefore custom. \n“We have carefully considered the formulation of the proposals to present a balanced outcome for both the company and its creditors. We are confident that given the current turmoil in this sector the creditors will support the directors’ proposals and prevent another brand disappearing from our high streets.” Like us on Facebook ", "external_links": [], "published": "2018-03-28T11:28:00.000+03:00", "crawled": "2018-03-28T12:05:56.007+03:00", "highlightTitle": ""}