{"organizations": [], "uuid": "3de4b73f217ba6d5717352c82f7d39325b639ffe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14398167.ece/ALTERNATES/s1200/Untitled-design-1.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/revealed-top-10-university-degrees-14398118", "country": "GB", "domain_rank": 21960, "title": "Revealed - the top 10 university degrees for a career that pays around £100,000 a year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-12T13:00:00.000+02:00", "replies_count": 0, "uuid": "3de4b73f217ba6d5717352c82f7d39325b639ffe"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/revealed-top-10-university-degrees-14398118", "ord_in_thread": 0, "title": "Revealed - the top 10 university degrees for a career that pays around £100,000 a year", "locations": [], "entities": {"persons": [{"name": "pok wong", "sentiment": "none"}, {"name": "mickey mouse", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "national careers service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nStudent Pok Wong, 29, is suing her university for £60,000 over her ‘Mickey Mouse’ degree and what she described as its fraudulently misleading claims about its high-quality teaching and career prospects after she graduated. \nHowever, teen magazine Future Mag researched which degrees give graduates the chance to earn the highest salaries. \nThe publication is a careers and lifestyle magazine for those aged 14 to 19. \nThis is its top ten, based on the National Careers Service website as of March 2018. \n1. Medicine: Earn up to £102,500 a year (surgeon). Other jobs: pathologist, GP, hospital doctor, anaesthetist An operation taking place (Image: PA) \nThe UK has a shortage of doctors and the competition study medicine is fierce, if you missed out on a medicine degree there are other pathways, for example if you already have a degree in a science subject (minimum 2:1) you could take a four-year graduate entry programme into medicine. \n2. Maths. Up to £100,000 (insurance underwriter). Other jobs: financial adviser, accountant, banker, data analyst-statistician \nThere’s a shortage of maths graduates, and that looks set to continue – in fact the government is so worried about the number of students studying maths at A-level they’re going to pay sixth form colleges more money if they recruit more maths students. \n3. Finance. Up to £100,000 (management accountant). Other jobs: accountant, banker, financial analyst \nMoney does make the world go around and careers in finance have long been some of the best paid on the planet. London is one of the world’s largest financial districts -let’s hope Brexit doesn’t change that. Read More Everything you need to know about student life in Newcastle \n4. Science. Up to £99,500 (pharmacist). Other jobs: chemical engineer, biochemist, meteorologist \nThe UK Government is encouraging more young people into STEM subjects (although the national audit office has recently suggested that there is an over-supply of biology graduates). \n5. Architecture. Up to £90,000 (architect). Other Jobs: architect technician, interior designer, set designer \nIt takes seven years to become a qualified architect, including several years working in agencies on placements. \nMany junior roles are taken-up by trainees who are still studying and graduate level jobs are higher paid than most. The Government’s initiative around getting Britain building is good news for architects. \n6. Accounting. Up to £80,000 (auditor). Other jobs: accountant, management trainee, actuary \nA career in accounting is a particularly safe bet, especially in tough economic times. Global companies such as KPMG, Deloitte, PwC, and EY employ thousands of graduates (and school leavers) each year, who are then able to climb the corporate ladder. Read More Student tuition fees won't be abolished - so what WILL happen? \n7. Economics. Up to £80,000 (economist). Other jobs: banker, financial analyst, statistician \nEconomists work in a variety of sectors, in both public and private settings. The Civil Service is the largest employer of economists in the UK. The Bank of England also offers careers through their graduate scheme. \n8. Civil engineering. Up to £80,000 (civil engineer). Other jobs: surveyor, site engineer, structural engineer, environmental consultant \nAirports, bridges, dams and railways – none of these would be possible if we didn’t have civil engineers. They work in highly skilled roles which include housing projects as well as across huge infrastructure projects like Crossrail and HS2. \n9. Engineering. ​Up to £70,000 (nuclear engineer). Other jobs: Aerospace, defence, automotive, chemical, and construction engineer; patent officer; management consulting Civil Engineer at construction site is inspecting ongoing production according to design drawings (Image: iStockphoto) \nAccording to the Institute of Directors, engineering in its many forms – mechanical, chemical, electrical, biological - accounts for £1.2trn of the UK’s turnover, 27% of its GDP, about half of its exports and at least 3.6 million jobs. \n10. Computer science. Up to £70,000 (software developer). Other jobs: games developer, systems administrator, IT consultant \nWith technology driving more and more industries, the demand for talent in this area is growing. Like us on Facebook", "external_links": [], "published": "2018-03-12T13:00:00.000+02:00", "crawled": "2018-03-12T13:48:46.014+02:00", "highlightTitle": ""}