{"organizations": [], "uuid": "74bbfef3950b413208959c18d7cd48a4503157f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.derbytelegraph.co.uk/incoming/article1274353.ece/ALTERNATES/s1200/Maplin-gv.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/maplin-store-closures-could-start-1375638", "country": "GB", "domain_rank": 48128, "title": "Maplin store closures could be announced next week", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-23T14:24:00.000+03:00", "replies_count": 0, "uuid": "74bbfef3950b413208959c18d7cd48a4503157f7"}, "author": "Isaac Ashe", "url": "https://www.leicestermercury.co.uk/news/business/maplin-store-closures-could-start-1375638", "ord_in_thread": 0, "title": "Maplin store closures could be announced next week", "locations": [], "entities": {"persons": [{"name": "maplin", "sentiment": "none"}, {"name": "moss bros", "sentiment": "none"}], "locations": [{"name": "maplin", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "rotherham", "sentiment": "none"}, {"name": "rutland partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Maplin store closures could be announced next week No buyer has been found Share Click to play Tap to play The video will start in 8 Cancel Play now Get Business   Thank you for subscribing!   \nThe fate of some 2,500 workers hangs in the balance as Maplin has failed to find a buyer. \nThe axe has already been swung on 129 jobs at the firm’s head offices in London and Rotherham, and thousands more are now expected to be made redundant. \nStores look likely to begin shutting over the coming weeks. \nThe retailer, owned by private equity firm Rutland Partners, appointed PwC to oversee an administration at the end of February after rescue attempts failed. Read More Mothercare, Moss Bros and CarpetRight: More big high street names struggling \nMaplin has 217 stores in the UK and, while PwC is attempting to find a buyer for the group, it is understood that no credible offer has materialised. \nIt is thought that, if a white knight fails to emerge in the coming days, store closures could be announced as soon as next week. \nWhen Maplin went bust last month, it became the second retailer to collapse into administration in one day following the failure of Toys R Us, which is shutting all 100 of its UK stores. \nMaplin chief executive Graham Harris said at the time that the retailer had been struggling to mitigate the impact of the pound’s devaluation since the Brexit vote, along with a weak consumer environment and the withdrawal of credit insurance. Read More Could Poundstretcher be the next big name casualty on the high street in 2018? \nIt comes in a dismal first quarter for the UK high street, with Carpetright also announcing on Wednesday the prospect of store closures, and Moss Bros and Mothercare also in the doldrums. \nEarlier this week New Look agreed a restructuring plan with creditors which will see it shut 60 stores, resulting in the loss of up to 980 jobs. \nA host of restaurant chains – including outlets run by celebrity chef Jamie Oliver, Prezzo and burger chain Byron – are also planning to shut hundreds of branches. Like us on Facebook", "external_links": [], "published": "2018-03-23T14:24:00.000+03:00", "crawled": "2018-03-23T15:08:25.002+03:00", "highlightTitle": ""}