{"organizations": [], "uuid": "f342d8679a99672ca33e1268b914f7704b34449f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14424019.ece/ALTERNATES/s1200/DMR_NEC_180318qe_03.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/should-pay-more-tax-fund-14460181", "country": "GB", "domain_rank": 21960, "title": "Should we pay more tax to fund our collapsing NHS? MPs issue warning to Theresa May", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-27T07:00:00.000+03:00", "replies_count": 0, "uuid": "f342d8679a99672ca33e1268b914f7704b34449f"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/should-pay-more-tax-fund-14460181", "ord_in_thread": 0, "title": "Should we pay more tax to fund our collapsing NHS? MPs issue warning to Theresa May", "locations": [], "entities": {"persons": [{"name": "theresa", "sentiment": "negative"}, {"name": "elizabeth", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "qe hospital", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "none"}, {"name": "parliamentary commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Should we pay more tax to fund our collapsing NHS? MPs issue warning to Theresa May Hospitals and health trusts are to go £900 million over budget this year with the NHS in 'a perilous state' Share The £32m Emergency Care Centre at the QE Hospital in Gateshead (Image: handout) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe NHS is in “survival mode” with hospitals and community health trusts set to go £900 million over budget this year. \nThis is the warning issued by MPs today, as pressure grows on the Government to give the health service a massive funding boost. \nA cross-party group of 98 MPs has written to Prime Minister Theresa May calling on her to establish a Parliamentary Commission to consider whether there should be a special NHS tax . \nAnd there are reports that Health Secretary Jeremy Hunt is urging Downing Street to increase taxes, with the money used to boost NHS funding. Ambulances leave the Queen Elizabeth hospital, in Gateshead (Image: Daily Mirror) \nThe Commons Public Accounts Committee, which includes Bridget Phillipson , Labour MP for Houghton and Sunderland South, warned: “The NHS is still very much in survival mode, with budgets unable to keep pace with demand.” \nGovernment had provided extra funding, but it is far from enough, said the MPs. \nThey said: “Despite a rescue fund worth £1.8 billion in 2016–17, the financial position of the NHS remains in a perilous state.” \nAnd they added: “With trusts forecasting a deficit of over £900 million in 2017–18, the NHS still has a long way to go before it is financially sustainable.” Read More The North's children are being let down by poverty and poor schools \nIt’s just the latest warning that hospitals and the bodies which oversee GP services don’t have enough money. \nAnd hospitals are also struggling to find enough staff - and were forced to tell their existing staff to work longer hours instead. \n“We are concerned that some hospitals adopted unsustainable staffing models to meet the needs of patients over the winter period, with existing staff working more hours.” \nMPs are urging the Government to consider new ways of funding health services. \nConservative MP Sarah Wollaston led calls for the Prime Minister to set up an inquiry involving MPs and members of the House of Lords from all parties to consider how much money the NHS really needs and where it should come from. \nThis would look at options including a hypothecated tax, specifically to fund the NHS. An ambulance leaves the Royal Victoria Infirmary hospital (RVI) in Newcastle (Image: Daily Mirror) \nA letter setting out the proposal was signed by a total of 98 MPs including \nCatherine McKinnell, Labour MP for Newcastle upon Tyne North , as well as Anna Turley, Labour MP for Redcar. \nIt’s been reported that Health Secretary Jeremy Hunt is arguing for a tax rise to boost the NHS. This could mean a 1p rise on National Insurance, raising around £4 billion a year. \nMr Hunt did not directly call for higher taxes but dropped a strong hint in an interview with a Sunday newspaper. He said: “If we want every single old person to be treated with the dignity and respect we would want for our own mum or dad, it will need more resources.” Read More The Brexit EU referendum promises that came true - and the ones that didn't \nHe said the Government should be “open-minded to innovative models of taxation”. \nAnd he suggested that British people “don’t mind more money going to the NHS” as long as they can be sure it’s spent properly. \nIt remains to be seen whether the Prime Minister or Chancellor Philip Hammond would back the idea of a new NHS tax or an increase in existing taxes. \nA Department for Health and Social Care spokesman said: “As this report recognises, the NHS has made significant progress towards balancing the books and returning to a financially stable position. \n“The Health and Social Care Secretary has acknowledged that funding for the NHS needs to be addressed with longer-term measures, rather than short-term, which the Department supported in the Autumn Budget, giving priority to the NHS with an extra £2.8 billion, on top of a planned £10 billion a year increase in its budget by 2020/21.” Like us on Facebook", "external_links": [], "published": "2018-03-27T07:00:00.000+03:00", "crawled": "2018-03-27T09:36:01.012+03:00", "highlightTitle": ""}