{"organizations": [], "uuid": "a98bee66b5b295292d34ca47b788502f3fba6ac8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14404808.ece/ALTERNATES/s1200/Amanda-White-operations-manager-at-Manpower.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/jobs-worry-north-east-employers-14404775", "country": "GB", "domain_rank": 21960, "title": "Jobs worry in North East as employers get more cautious on hiring", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-13T15:01:00.000+02:00", "replies_count": 0, "uuid": "a98bee66b5b295292d34ca47b788502f3fba6ac8"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/jobs-worry-north-east-employers-14404775", "ord_in_thread": 0, "title": "Jobs worry in North East as employers get more cautious on hiring", "locations": [], "entities": {"persons": [{"name": "amanda white", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "business jobs", "sentiment": "negative"}, {"name": "manpowergroup employment outlook survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Jobs worry in North East as employers get more cautious on hiring Survey by employment group Manpower says UK employers are hiring, but it may be a pre-Brexit scramble for skilled labour Share Amanda White, operations manager at Manpower (Image: Publicity Pic) Share Get business updates   Thank you for subscribing!   \nEmployers in the North East are becoming more cautious about hiring at the same time that business hiring confidence in the rest of the country has reached a 12-month high, a new report syggests. \nThe ManpowerGroup Employment Outlook Survey is based on responses from 2,102 UK employers, who are asked whether they intend to hire additional workers or reduce the size of their workforce in the coming quarter. \nNationally, the survey showed the most positive jobs forecast in more a year, though it is believed the figures could be in part inflated by worried employers scrambling to fill vacancies as post-Brexit skills fears take centre stage. \nBut the North East has seen optimism among employers fall since the last quarter, albeit with hiring sentiment still positive and ahead of most of 2017. \nAmanda White, head of specialist markets for Manpower, said: “The green shoots of optimism we saw last quarter seemed to have been killed off during the recent cold snap, with hiring confidence in the North East trailing the national average at +5% this quarter. \n“Demand for jobs in driving and warehousing is continuing a downward trend in the wake of the Christmas peak and despite industries such as engineering proving popular with would-be applicants, employers are not finding a large enough pool of suitably qualified candidates. \n“While the highest-skilled employees in specialised roles are seeing their wages going up, the remainder of would-be employees find themselves competing for oversubscribed job roles such as in call-centres and energy sales companies. \n“With all of these structural employment issues, concerns about Brexit seem to have taken a back seat, and with a relatively low number of EU migrants in this region compared to elsewhere in the country, employers are yet to feel any significant Brexit impact.” \nManpower’s report singles out the North East for having the lowest average pay in the UK at £502, £102 below the national average. It also highlights the region’s high unemployment rate, but acknowledges that there has been significant job creation in the region over the last 12 months. Read More Northumberland electronics firm makes first acquisition since launch saved 23 jobs \nThe survey also describes a “tough” labour market for employers, with growing numbers of jobs being advertised but workers having increased bargaining power. \nNationally, hospitality emerged as the best-performing sector, up 14 points year on year to +16%, but Manpower said this is a sign of “desperate employers” scrambling to fill vacancies as post-Brexit skills fears take centre stage. \nJames Hick, of Manpower, described the surprise jump in confidence as a “mirage”, saying: “Up to 24% of all (hospitality) staff come from the EU. \n“Given that the sector employs around three million people, losing that proportion of the workforce would leave a shortfall of three-quarters of a million people. \n“In recent weeks we’ve seen more reports that the number of EU workers arriving in the UK is falling - particularly those from eastern Europe - and employers are racing to make up the shortfall.” Like us on Facebook", "external_links": [], "published": "2018-03-13T15:01:00.000+02:00", "crawled": "2018-03-13T15:30:21.016+02:00", "highlightTitle": ""}