{"organizations": [], "uuid": "a52553e83a844d19001f43886fd3dcc7d92c5270", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14454949.ece/ALTERNATES/s1200/RBP_ECH_101214SCHOOL1266JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/norths-children-being-down-poverty-14454810", "country": "GB", "domain_rank": 21960, "title": "The North's children are being let down by poverty and poor schools", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-26T07:00:00.000+03:00", "replies_count": 0, "uuid": "a52553e83a844d19001f43886fd3dcc7d92c5270"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/norths-children-being-down-poverty-14454810", "ord_in_thread": 0, "title": "The North's children are being let down by poverty and poor schools", "locations": [], "entities": {"persons": [], "locations": [{"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "none"}, {"name": "children’s commissioner", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The North's children are being let down by poverty and poor schools The Children's Commissioner, the official champion of our children, says things must change Share Children in a classroom (Image: South Wales Echo) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nChildren in the North are proud of where they come from - but many are held back by poverty and poor schools. \nAnd being poor in the North of England has a worse effect on your chances in life than being poor in London. \nThese are some of the findings of a report by the Children’s Commissioner, the nation’s official champion for children, in a major new report called “Growing up North”. \nIt found that many children growing up in the North are thriving. But they’re also being let down by the Government’s Northern Powerhouse project, which focuses on improving the economy without improving prospects for young people. \nThe report called for a massive push to improve school standards across the North. \nAnd it called for a major rethink of Government policy towards the North, saying: “Children’s prospects should be placed at the heart of the Northern Powerhouse and given the same attention as economic regeneration.” \nGrowing Up North is the culmination of twelve months of research, analysis and conversations with children, schools, business, councils, health professionals and charities. There is a strong link between poverty and lower results (Image: PA) \nThe Commissioner, Anne Longfield, is from Yorkshire and studied at Newcastle University. \nShe said: “Too many children in the North are facing the double-whammy of entrenched deprivation and poor schools. They are being left behind.” \nSome of the main findings include: \n* Northern 2 to 3 year olds are more likely than their London counterparts to attend nursery - but are less likely to reach the expected standard of development when starting school. \n* More than half of the schools serving the North’s most deprived communities are below a ‘good’ rating. This means children in these communities face the double-disadvantage of being from a poor community and attending a poor school. \n* Many more children in the North than nationally are starting school with high-levels of development issues, but fewer children are having special educational needs diagnosed before they start school. \n* High numbers of children across the North are dropping out of school too early, missing vital parts of their education and undermining their future prospects. \n* Fifteen years ago London’s schools were the worst in the country. Now they are among the best - but there is no sign yet of the same transformation taking place in the North. \n* Girls outperform boys in school but are paid less as adults - something which is true everywhere, but even more so in Northern areas where traditional industries have been very male-dominated. \n* The labour market in Northern communities is likely to have fewer high-wage, high-skilled jobs, and families are likely to have fewer economic connections. Children in a classroom \nThe report highlighted warnings from one Newcastle schools trust that pupils were beginning primary school without basic language skills. \nIt said: “A trend has been emerging in Newcastle and indeed further afield, of children starting school with delayed speech development. \n“It is becoming too familiar to hear children simply scream or point at objects to get an adult’s attention. Creating a language rich environment was unfortunately not enough to enable the children to form sounds and make themselves understood.” \nMs Longfield set out a series of recommendations, including calls for an end to cuts in government grants to councils which have hit children’s services. \nThe report said: “In the most disadvantaged areas we heard how Councils were making savings in non-statutory service areas such as early help and prevention despite the risk of this leading to additional demand on their statutory provision. \n“This was also putting additional pressure on schools who were attempting to fund additional services for their pupils out of their budgets, potentially reducing teaching budgets for schools facing the greatest need.” Read More New report on the Heathrow Airport expansion plans - but it's calling for MORE delays \nShe called for “a new northern schools programme” to improve schools within 10 years, particularly by helping them recruit staff and great headteachers. \nCouncils must make certain the have a plan to ensure every child is in an apprenticeship, training or education until 18 - which is now a legal requirement, she said. \nNational bodies funding the arts, culture and sports “should prioritise the North, and particularly its disadvantaged areas”, she said. \nMs Longfield urged the Government to support “family hubs” proving support for parents of very young children in the poorest areas, to help give children the best possible start in life. Read More Fury over decision to manufacture post-Brexit blue passports in France - what our MPs are saying \nAnd she called for the creation of new local bodies specifically created to help children, similar to the Government-backed Local Enterprise Agencies which were created across the country to support industry. \nShe said: “Children growing up in the North love and are proud of the place they live. They want a future where they live near their family and community and they want jobs and opportunities to rival anywhere else in the country. \n“The Northern Powerhouse and the new devolved mayors provide a once in a lifetime opportunity to drive that ambition. \n“While many children in the North are thriving, there are huge gaps between the poorest Northern kids and those in the South.” Like us on Facebook", "external_links": [], "published": "2018-03-26T07:00:00.000+03:00", "crawled": "2018-03-26T08:21:15.035+03:00", "highlightTitle": ""}