{"organizations": [], "uuid": "1981e8fb08228d310c021781825407c842727b85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14342088.ece/ALTERNATES/s1200/Winter-weather-Feb-27th-2018.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/local-news/north-east-news-live-updates-14361485", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-04T11:00:00.000+02:00", "replies_count": 0, "uuid": "1981e8fb08228d310c021781825407c842727b85"}, "author": "Katie Dickinson", "url": "https://www.chroniclelive.co.uk/news/local-news/north-east-news-live-updates-14361485", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "morpeth", "sentiment": "none"}, {"name": "judith pringle", "sentiment": "none"}], "locations": [{"name": "stamfordham road", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle civic centre  errors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Lane closed on A1 western bypass \nOne lane is closed due to a broken down vehicle on the A1 Western Bypass Southbound near A167 Stamfordham Road / B6324 Stamfordham Road (Westerhope Turn Off). \nTraffic is said to be coping well. 11:41 Speed restrictions cleared \nNormal service has been resumed on CrossCountry services between Berwick-upon-Tweed and Morpeth following earlier speed restrictions. \nThe restrictions have caused delays to a number of services from Newcastle this morning. 11:26 Social worker struck off \nAn “overworked” Newcastle City Council social worker has been struck off after making a catalogue of errors. \nA tribunal hearing heard that adoptive parents were almost put off the adoption process because of the delays and errors. \nJudith Pringle worked for the city council as a social worker for more than 10 years, the health and care professionals tribunal service (HCPTS) heard. \nHowever between 2012 and 2015, she made a number of errors which the HCPTS have found to be misconduct. Newcastle Civic Centre \nErrors included just copying and pasting information on adoption forms for a second time adopter, despite the fact the woman has remarried and was with a new partner. \nShe also misused her line manager’s email signature on documents without permission, causing delays in an adoption process. 11:13 Tributes to Ponteland student \nSaddened university bosses have led tributes to North East teenager Charlie Pope, after a body was found in a Manchester city canal. \nThe 19-year-old, from Ponteland went missing in the early hours of Thursday morning, and underwater divers made the discovery the following day. Underwater diving teams have found a body in a Manchester canal in the search for missing teenager Charlie Pope (Image: MEN Media) \nA spokesman for the university said they were saddened by the news, and staff at the university are providing support to those who knew him. 11:02 A66 reopened \nThe A66 between Durham and Cumbria is now open in both directions after work overnight to clear the snow 10:57 \nThe crews dealt with a casualty on Holy Island and one at Berwick last night \nAn update from them last night said: \nThe team were tasked this evening by Coastguard Operations Centre (CGOC) Humber to work with the North East Ambulance Service deal with a casualty with breathing difficulties on Holy Island. \nThe team had just returned to Station when they were retasked to proceed to Berwick upon Tweed to work with Berwick & Eyemouth Coastguard Rescue Teams, Northumberland Fire & Rescue, Northumbria Police, The North East Ambulance Service and Coastguard Rescue Helicopter 912 to deal with a casualty on the beach near Berwick Holiday Camp. 10:53 Newcastle train delays \nThe 10:28am to London Kings Cross and the 10:39am to Penzance via Leeds - both from Newcastle Central Station - have been delayed by a speed restriction because of snow and ice 10:42 Yellow warning for ice \nThere is a Met Office yellow warning for ice in place from 11am today until 11am on Monday. \nThe forecaster says: \nIcy stretches will continue to be likely on untreated roads, pavements and cycle paths. Driving conditions may become difficult and there is an increased chance of injuries from slips and falls on icy surfaces. 10:31 A19 abandoned vehicle cleared \nAll lanes are open again after an earlier abandoned vehicle on the A19 Southbound between A194 Leam Lane (Lindisfarne Roundabout) and A184 Newcastle Road (Testo’s Roundabout). 10:26 Politicians form 'Convention of the North' \nPolitical leaders from across the north of England will join forces at a summit in Newcastle to coincide with the Great Exhibition of the North . \nThey will come together for a “Convention of the North” to work out a common position on issues such as rail investment, Brexit and the need to ensure decisions that affect the north are taken in the North rather than in London. Newcastle City Council leader Nick Forbes (left) Mayor of Greater Manchester Andy Burnham \nThe aim will be to ensure the north of England can speak with one powerful voice to national government and Brussels. \nNewcastle City Council leader Nick Forbes is one of the organisers. Also involved are Andy Burnham, the mayor of Greater Manchester, and Steve Rotherham, the mayor of the Liverpool City Region. \nThe Convention is set to take place in June alongside the start of the three-month Great Exhibition, which will see thousands of visitors come to Newcastle and Gateshead to discover the story of the north of England through its innovators, artists, designers and businesses.", "external_links": [], "published": "2018-03-04T11:00:00.000+02:00", "crawled": "2018-03-04T17:04:51.008+02:00", "highlightTitle": ""}