{"organizations": [], "uuid": "6c095bde1c0bcdf15bfcf04e78b1aa2698e0a424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14393670.ece/ALTERNATES/s1200/NHS-pay-rise.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/news-opinion/nhs-65-pay-offer-accepted-14393680", "country": "GB", "domain_rank": 21960, "title": "Why the NHS 6.5% pay offer if accepted could have disastrous consequences", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-10T20:00:00.000+02:00", "replies_count": 0, "uuid": "6c095bde1c0bcdf15bfcf04e78b1aa2698e0a424"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/news-opinion/nhs-65-pay-offer-accepted-14393680", "ord_in_thread": 0, "title": "Why the NHS 6.5% pay offer if accepted could have disastrous consequences", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "treasury and department for health and social care", "sentiment": "none"}, {"name": "tory/lib dem coalition government", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Why the NHS 6.5% pay offer if accepted could have disastrous consequences The leaked details of the deal reveal workers would have to forfeit a day's holiday which would set a dangerous precedent Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nI had to re-read the story on Friday that the Government was going to offer NHS staff a 6.5% rise. \nMy double take wasn’t caused by the surprise that, on the face of it, it was an above inflation rate offer, bearing in mind that since the Tory/Lib Dem Coalition Government in 2010 and the Tories from 2015, pay offers have largely flatlined at zero per cent in the public sector. \nIt was the caveat that comes attached that caught my eye and should ring alarm bells across the country, not just for NHS workers considering whether to accept the offer, but those in the private sector too. \nThe Government has asked NHS staff to forfeit a day’s holiday to get that 6.5% rise. \nAccording to reports, the offer doesn’t even come in all at once. \nApparently the Treasury and Department for Health and Social Care plans will see non-medical NHS staff receiving a 3% pay rise next financial year and 1-2% in the next two years. Read More NHS 'crisis' protests: North East campaigners join national day of action to save the service \nLosing a day’s holiday is the equivalent of a 0.4% pay cut. In the three years it takes for the full 6.5% increase, if accepted, to kick in that would be 1.2% lost. So in effect, it’s a 5.3% increase over that period to begin with. \nAnd every year from then on, before ‘negotiations’ even begin, it will mean pay start at 0.4% down. A hospital ward (Image: PA) \nWhy don’t they just give the NHS staff a pay rise with no caveats? I can’t think of many people who would begrudge them of it. \nIt’s worrying for everyone else because, if accepted, think about the precedent it would set. \nFor I’m sure there are employers up and down the country stroking their collective chins sagely and thinking about it too. \nUsually, pay negotiations – there’s an oxymoron – between employers and employees take the form of the employers saying ‘this is the first and final offer, like it or lump it, you should be glad to have a job, close the door after you’. Read More Thousands of children of public sector workers are now living in poverty, says report \nNow there could be a further twist – ‘this is the first and final offer . . . etc, etc, etc . . . unless you throw a day’s holiday into the mix’. And if you want a bigger pay ‘rise’, how about two days? \nThe natural progression from that is the promise of an even bigger offer based on weeks you work so long as you agree not to be paid for the days you don’t. Prime Minister Theresa May (Image: Getty Images Europe) \nThis is how a zero hours contract for the whole of the country could evolve. Selling off any right you have in order to earn a little extra. Jam today and something a whole lot more foul-tasting tomorrow. \nAm I over egging it? Well, it was illuminating that when asked about whether the government would protect workers rights after Brexit, Prime Minister Theresa May was less than forthcoming. \nThe phrase ‘thin end of the wage’ springs to mind. Like us on Facebook", "external_links": [], "published": "2018-03-10T20:00:00.000+02:00", "crawled": "2018-03-10T20:45:22.071+02:00", "highlightTitle": ""}