{"organizations": [], "uuid": "9d11f81887fe5dce1171a0dc08071257a4145d0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14381866.ece/ALTERNATES/s1200/2016-Labour-Party-Conference-in-Liverpool.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-leader-nick-forbes-preparing-14381645", "country": "GB", "domain_rank": 21960, "title": "Newcastle leader Nick Forbes preparing for 'worst case scenario' in wake of Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-07T23:00:00.000+02:00", "replies_count": 0, "uuid": "9d11f81887fe5dce1171a0dc08071257a4145d0b"}, "author": "Laura Hill", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-leader-nick-forbes-preparing-14381645", "ord_in_thread": 0, "title": "Newcastle leader Nick Forbes preparing for 'worst case scenario' in wake of Brexit", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "negative"}, {"name": "forbes", "sentiment": "none"}, {"name": "laura hill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "brexit news newcastle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle leader Nick Forbes preparing for 'worst case scenario' in wake of Brexit Councillor Nick Forbes said he is 'seriously worried' about how the council will respond to a hard Brexit Share Laura Hill Local Democracy Reporter 21:00, 7 MAR 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle City Council is preparing for the “worst case scenario” in the face of Brexit, its leader has warned. \nAs the council approved its budget for the year ahead, council leader councillor Nick Forbes said that councils will be under more pressure than ever before if a hard Brexit pushes the economy into recession. Read More Newcastle leader Nick Forbes demands answers over improvements to East Coast Main Line \nThe North East will be the region worst hit by Brexit, leaked projections from the Treasury revealed earlier this year. Projected growth will go down by as much as 16% under the worst scenario. \nCoun Forbes told the full council meeting on Wednesday night that he is “seriously worried” about how the council will be able to respond to a hard Brexit combined with a recession and continued austerity. Labour Councillor Nick Forbes (Image: Daily Mirror) \nHe said: “With the great uncertainty of Brexit approaching, we simply cannot put off the difficult decisions any further. \n“Under the coalition and the Tories, we have seen that when Government is under pressure, local authorities suffer. \n“And with no clear plan for Brexit, no assurance that the economy is in safe hands, it is increasingly obvious that Brexit will be a shock to the system. \n“We have to be prepared, both as a council and a city, for what is coming our way in the next five years. That means difficult decisions now, not using up reserves and hoping austerity will just disappear.” Newcastle Civic Centre, Newcastle Upon Tyne (Image: Newcastle Chronicle) \nLib Dem opposition councillors have accused the Labour council of sitting on reserves of £90m, though the authority has said just £10m of the reserves are not earmarked for future projects. Read More Why some people are worried the North East could soon be trailing in Yorkshire's wake \nAnd with an uncertain economic future ahead for the region, the council is unwilling to dip into those reserves for fear they will be needed more in the future. \nCoun Forbes said: “Newcastle has a track record of preparing for downturns and fighting for jobs. We invested in the city when recession seemed to be at our door in the early years of the coalition Government. \n“We shielded the city from the worst of austerity, and yet now it looks like that effort was only the beginning. \n“The big challenge facing us is still the compound impact of austerity in a time of Brexit.” Like us on Facebook", "external_links": [], "published": "2018-03-07T23:00:00.000+02:00", "crawled": "2018-03-08T01:20:23.006+02:00", "highlightTitle": ""}