{"organizations": [], "uuid": "1a5203b871a4d50e71158daa75849ca4fa67567b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14442475.ece/ALTERNATES/s1200/SGP_NEC_210318GLASS04JPG.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/we-were-paid-pocket-money-14442468", "country": "GB", "domain_rank": 21960, "title": "'We were paid pocket money': Waitress lifts the lid on working conditions at troubled champagne bar", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-21T21:37:00.000+02:00", "replies_count": 0, "uuid": "1a5203b871a4d50e71158daa75849ca4fa67567b"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/we-were-paid-pocket-money-14442468", "ord_in_thread": 0, "title": "'We were paid pocket money': Waitress lifts the lid on working conditions at troubled champagne bar", "locations": [], "entities": {"persons": [{"name": "bethany", "sentiment": "none"}, {"name": "bethany walley", "sentiment": "none"}], "locations": [{"name": "cramlington", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "manor walks", "sentiment": "none"}, {"name": "glass house", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nStaff were given “pocket money” sums to keep working at a troubled restaurant despite struggling to pay their rent and bills, a former waitress has claimed. \nThe Glass House bar and restaurant in Cramlington , Northumberland , closed under a cloud this week amid protests from disgruntled employees . \nMany claimed they had missing wage payments, while the former owner blamed “tough trading” and “Brexit costs pressures” for why he was forced to close the business. \nNow, 17-year-old Bethany Walley has spoken out about the problems she and her colleagues say they faced at the bar. \nBethany started working at the Glass House when it first opened in September, leaving on February 17. \nShe is among a large number of former employees who have contacted us alleging the business failed to pay expected wages. The Glass House at Manor Walks, Cramlington (Image: Newcastle Chronicle) \nBethany said she’d initially been told pay would come weekly - but waited two weeks for her first wage packet. When she left, she believes she was owed for seven weeks work. \nShe said: “That’s how it started. They kept saying ‘we haven’t got enough to pay you so we’ll have to pay next week’.” \nAt first, she says, cash was handed out with proper pay slips, but eventually came in plain envelopes with that week’s sum scribbled on the front by hand. \nBecause of the backlog, Bethany said she would receive money for shifts worked several weeks ago, making it harder to keep track of exactly how many hours she had been paid for. Read More \nBethany, from Cramlington, was able to walk to work and had a secure place to live, but said co-workers were left with electricity going off, and one friend lost her flat because she couldn’t regularly pay rent. \n“We were all really close friends because we stuck together when we were there,” Bethany said. \n“I know some people would drive in and they would be owed so much they couldn’t afford to fill up their cars. \n“They’d go in and tell the manager and he’d get cash out of the till for petrol. \n“They would give you £20 or £30 and expect you to live on that for the week until they had enough money in the tills to give you more. Bethany Walley, 17 from Cramlington who worked at the Glass House manor Walks for six months (Image: Newcastle Chronicle) \n“They’d say we haven’t got enough money this week, so we’ll pay you this week - and it’s down to you guys to work hard so we take enough. \n“Pocket money, that’s what it was, giving us it so we would come in the next day.” \nThe teenager left her job in February because she had managed to secure another job in a care home. \nBut she believes she’ll never see what she claims she is owed, and won’t be able to claim the money through insolvency funds because she had left by the time administrators were called in. \nBethany said: “I did want to work hard for them because at the start it was really good, but things just started getting worse and worse.” Read More You can't get g-in! Newcastle spirit festival cancelled after venue pulls out \nIn a statement, former owner Mark Nigrelli thanked staff for their “hard work trying to help over come this difficult time”. \nHe said: “As a small independent company there has been many factors as to why we decided to close our doors. \n“Amongst many other national companies in financial trouble we are small and do not have huge financial backing with the combination of rising Brexit costs pressures and tough trading with lower footfall and spenditure [sic], we have had bad weather recently which hasn’t helped the cause. \n“Sustaining rent, service change and business rates all increasing along with staff costs and supplies has put a very difficult trading period in the leisure market at the moment. \n“As a company we have always re-invested into the business to help make it work which unfortunately didn’t succeed at our Cramlington branch.” \nMr Nigrelli did not want to respond directly to the claims of missing wages. Like us on Facebook", "external_links": [], "published": "2018-03-21T21:37:00.000+02:00", "crawled": "2018-03-22T01:04:55.000+02:00", "highlightTitle": ""}