{"organizations": [], "uuid": "764255c4c50f4610bd01d828f0f1e38092d2b689", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1391881.ece/ALTERNATES/s1200/Hamster2.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/girls-film-themselves-killing-hamster-1391882", "country": "GB", "title": "Girls film themselves killing hamster and laughing about it", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-27T21:54:00.000+03:00", "replies_count": 0, "uuid": "764255c4c50f4610bd01d828f0f1e38092d2b689"}, "author": "Katie Timms", "url": "https://www.devonlive.com/news/devon-news/girls-film-themselves-killing-hamster-1391882", "ord_in_thread": 0, "title": "Girls film themselves killing hamster and laughing about it", "locations": [], "entities": {"persons": [{"name": "drew pernham", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}], "organizations": [{"name": "herald", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Girls film themselves killing hamster and laughing about it This article and video contain images that some readers may find disturbing Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nA video ha sbeen shared online showing what appears to be two Devon girls killing a hamster by launching it into a wall - then laughing about it. \nThe disturbing footag has been shared on social networks including Facebook and Snapchat. \nThe video shows the hamster being launched into the air from a bed then being thrown against a wall. \nThe clips seem to be recorded by the perpetrators, followed by pictures showing a still hamster, claiming that it has died, reports The Herald . \nIt is understood the girls, one of whom is seen giggling during the incident, are from Devon. \nThe pictures show a hamster cage, with a still hamster inside, with text reading \"she's killed it ***?\" and \"rip x\". \nDrew Pernham posted: \"How this is funny is beyond me? \n\"You do you in your spare time but throwing hamsters at walls isn’t something you’d expect from any human being. Disgusting.\" Read More \nThe Herald has approached Devon and Cornwall Police for comment. \nA spokesman was unable to say tonight whether the incident had been reported or was under investigation. \nBut a spokesperson for animal cruelty charity the RSPCA said: “We urge anyone with any information about animal cruelty to call the RSPCA on 0300 123 4999.” What are the punishments for animal abusers? \nIn September the Conservative Government hit back at criticism after MPs - including Plymouth's Johnny Mercer - voted to reject the inclusion of EU laws recognising animal sentience into the EU withdrawal bill. \nEnvironment Secretary Michael Gove has said the sentience of animals will continue to be recognised and protections strengthened when we leave the EU. \nAnd, in a statement issued today, he revealed the Government was looking to increase the maximum sentences for animal cruelty from six months to five years - which he said was \"more than almost every other European nation\". \nHowever, Prime Minister Theresa May has previously said she is in favour of fox hunting - and the Conservatives vowed to hold a free vote on scrapping the Hunting Act 2004, which outlawed hunting with dogs, in its 2017 election manifesto. \nAnd while the RSPCA and the Humane Society have welcomed Mr Gove's statement, they still have concerns about the rejection of EU laws recognising animal sentience. \nIn a ministerial statement last year, Mr Gove said: \"This Government is committed to the very highest standards of animal welfare. \n\"As the Prime Minister has set out, we will make the United Kingdom a world leader in the care and protection of animals. \n\"It has been suggested that the vote last week on New Clause 30 of the EU Withdrawal Bill somehow signalled a weakening in the protection of animals - that is wrong. Read More Teacher assaulted after gang of youths tried to break into school grounds \n\"Voting against the amendment was not a vote against the idea that animals are sentient and feel pain - that is a misconception. \n\"Ministers explained on the floor of the house that this Government’s policies on animal welfare are driven by our recognition that animals are indeed sentient beings and we are acting energetically to reduce the risk of harm to animals – whether on farms or in the wild. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n\"The vote against New Clause 30 was the rejection of a faulty amendment, which would not have achieved its stated aims of providing appropriate protection for animals. \n\"The Prime Minister has made clear that we will strengthen our animal welfare rules. This government will ensure that any necessary changes required to UK law are made in a rigorous and comprehensive way to ensure animal sentience is recognised after we leave the EU. \n\"The Withdrawal Bill is not the right place to address this, however we are considering the right legislative vehicle. \n\"We are already proposing primary legislation to increase maximum sentences for animal cruelty from six months to five years, and the creation of a new statutory, independent body to uphold environmental standards. \n\"The current EU instrument – Article 13 – has not delivered the progress we want to see. It does not have direct effect in law – in practice its effect is very unclear and it has failed to prevent practices across the EU which are cruel and painful to animals. \n\"In contrast, here in the UK, we are improving animal welfare standards without EU input and beyond the scope of Article 13. \n\"We are making CCTV mandatory in all slaughterhouses – a requirement which goes above and beyond any EU rule. \n\"We will consult on draft legislation to jail animal abusers for up to five years – more than almost every other European nation. We propose combatting elephant poaching with a ban on the ivory trade which is more comprehensive than anywhere else in Europe. \n\"Our ban on microbeads which harm marine animals has been welcomed by Greenpeace as “the strongest in the world”, and is certainly the strongest in Europe. \n\"Once we have left the EU there is even more we could do. EU rules prevent us from restricting or banning the live export of animals for slaughter. Read More Flat used by drug dealers closed by police and council in Tiverton \n\"EU rules also restrict us from cracking down on puppy smuggling or banning the import of puppies under 6 months. Article 13 has not stopped any of these practices – but leaving the EU gives us the chance to do much better. We hope to say more in these areas next year. \n\"This government will continue to promote and enhance animal welfare, both now and after we have left the EU.\" \nThe RSPCA has welcomed Michael Gove’s reassurance that the government is committed to the very highest standards of animal welfare post-Brexit - but said the EU laws on animal sentience held Government to account when it made new animal welfare laws . \n\"Initiatives such as the introduction of mandatory CCTV in all slaughterhouses, moves to increase sentencing to five years for animal cruelty, action against the ivory trade and ban on microbeads are to be applauded. \n\"But the RSPCA firmly believes that, in addition, a formal acknowledgement that animals are sentient written into the EU (Withdrawal) Bill would send a strong message to politicians to help shape future legislation, ensuring the best protection for animals. There are two reasons for this \n\"Firstly there is no mechanism that holds the Government to account when formulating new legislation and assessing its impact on animal welfare in the future. Article 13 achieves this. \n\"Secondly although the Animal Welfare Act 2006 gives humans a responsibility to look after animals under their control this explicitly does not apply to wildlife not under human control nor animals used in research. \n\"So whilst it has been suggested that the existing Animal Welfare Act (2006) is sufficient as an alternative to a recognition of animal sentience in the Brexit bill, it clearly isn't. Read More Labour Party told to ditch obsession with animal rights to win rural votes \n\"Indeed as the Prime Minister correctly stated in Prime Minister’s Questions yesterday (22/11/17) the Animal Welfare Act (2006) only recognises animals that are 'under control of man'. \n\"What about the rest? Our fear is that the Government will not have to take animal welfare into account when drawing up new laws on the millions of wild animals as well as the millions of animals used in laboratories every year. \n“The call for legal recognition of animal sentience is echoed across animal protection groups and members of the public. As the EU (Withdrawal) Bill continues its progress through Parliament we will once again be urging for this important acknowledgement of animals sentence to be included”. \nThe Humane Society also broadly welcomed Mr Gove’s statement, but Director Claire Bass added: “Acknowledging that animals have the capacity to suffer and feel pain is absolutely fundamental to protecting them from harm, and we need a binding imperative enshrined in UK law that will hold government to account, ensuring that animal welfare is fully taken into account in all UK law and policy-making. \n\"We can’t afford for this guiding principle to be thrown out with the Brussels bathwater and so look forward to hearing the government’s legislative plans in the very near future.” Read More French woman driving wrong way down A303 caused life-threatening crash \nIn its 2017 general election manifesto, the Conservative Party promised to holding a free vote on scrapping the Hunting Act 2004, which bans the use of dogs to hunt mammals, such as foxes. \nSpeaking before the election, Prime Minister Theresa May said she has \"always been in favour of fox hunting\". \n“This is a situation on which individuals will have one view or the other, either pro or against”, said the PM. \n\"As it happens, personally I have always been in favour of fox hunting and we maintain our commitment. \n\"We have had a commitment previously as a Conservative Party to allow a free vote and that’s what it will allow, would allow, Parliament the opportunity to take a decision on this.” Like us on Facebook", "external_links": [], "published": "2018-03-27T21:54:00.000+03:00", "crawled": "2018-03-27T22:21:09.107+03:00", "highlightTitle": ""}