{"organizations": [], "uuid": "4370757fea0475330ff1509bf846f1756fd4307b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14357625.ece/ALTERNATES/s1200/Theresa-May-Takes-Prime-Ministers-Questions.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/heres-what-north-east-needs-14356079", "country": "GB", "domain_rank": 21960, "title": "Here's what the North East needs to hear from Theresa May on Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-02T07:00:00.000+02:00", "replies_count": 0, "uuid": "4370757fea0475330ff1509bf846f1756fd4307b"}, "author": "Evening Chronicle", "url": "https://www.chroniclelive.co.uk/news/north-east-news/heres-what-north-east-needs-14356079", "ord_in_thread": 0, "title": "Here's what the North East needs to hear from Theresa May on Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "anna round of ippr north", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "cabinet committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Here's what the North East needs to hear from Theresa May on Brexit As Theresa May prepares to deliver a major speech, Anna Round of IPPR North explains how to make Brexit work for the North East Share Prime Minister Theresa May leaving 10 Downing Street (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nYou could say the north east was where it all started, with the early declarations on referendum night signalling that sunrise over the north sea could bring a decision to leave the EU. \nToday the region was due to provide the setting for Theresa May to outline the Cabinet Committee’s conclusions – following last week’s meeting at Chequers – on the deal Britain should seek with the EU , as well as the government’s vision for a post-Brexit Britain . So what announcements could she make that would boost the north eastern economy? \nMrs May has not travelled to the North East as expected to deliver her Brexit speech, and is instead due to speak from the Mansion House in London, but here are the commitments the region would like to see from the strategy she is due to set out. Commitment 1: Provide Clarity for North East Businesses \nFrictionless trade is important for the north east, whose healthy export profile is well known. Businesses have made the most of their proximity to the ports of northern Europe, by seizing opportunities to build shared ‘value chains’ (in which components move between countries during the manufacturing process). \nThat’s helped to boost growth and employment, but now it means that regions like the north east are vulnerable to any increase in barriers to trade, as demonstrated by recent research at the University of Birmingham. And analysis for the London School of Economics shows that some of the north east’s main industries – including chemicals, transport manufacturing and retail – could face challenges even under a fairly ‘soft’ Brexit scenario. EU and Union flags (Image: PA) \nTheresa May has stated that she wants the UK to leave both the single market and the customs union, a scenario which will be difficult for an outward-facing region like the north east. What kind of ‘managed divergence’ – to use a phrase from that Chequers away day – could help the businesses here to prosper after Brexit? \nOne possibility is an approach that uses alignment with EU structures, rather than full membership. This is set out in IPPR’s proposal for a ‘shared market’. This would allow for a new and comprehensive customs union covering all goods, in which external tariff and trade policy matches the EU’s, but the UK is responsible for making its own free trade arrangements. \nThe UK could also seek alignment with the ‘four freedoms’ of the single market, and with broader factors that could otherwise create barriers for trade (such as competition and state aid rules, and consumer, employment and environmental protections). Mechanisms for divergence over time could be overseen by new bodies, similar to those that support Norway’s agreements with the EU. Such divergences, inevitably, would come at a significant cost for trade. Read More 7,000 Nissan workers could lose their jobs if Theresa May gets Brexit wrong \nMuch of the discussion of Brexit has focused on free movement within the European Union. The north east is something of an ‘outlier’ here, with a relatively small population of EU nationals even in sectors which elsewhere rely heavily on their labour (such as agriculture and construction). \nBut some of the institutions that are central to its industrial strengths, such as advanced manufacturing, transport and energy generation, rely on being able to attract talent from around the world – including the EU, and Theresa May’s speech must make it clear that they’re still welcome. She should also remember that people from this part of the world – especially students and young workers – need the freedom to travel and learn internationally. Commitment 2: Set out Future Domestic Policy \nOur post-Brexit future won’t be shaped in Brussels alone, and many in the region will be keen to know more about some key domestic policies. The details of how a successor to the Common Agricultural Policy will work are of huge importance both to the rural dwellers of Northumberland, County Durham and Teesside – as well as their urban neighbours. And the ‘Shared Prosperity Fund’ (promised in the 2017 Conservative Party Manifesto) remains an unknown quantity. Many in the region will wonder, with some justification, when public services will see the Brexit dividend described by the Leave campaign. Read More Theresa May reveals the five things she wants to achieve in the UK's Brexit agreement with the EU \nCommitment 3: Give the North of England a “Seat at the Table” \nPerhaps what the north east needs most from Mrs May is a voice in all this. Our future won’t be shaped in Brussels alone, but there’s a danger that too much of it will be shaped in London. The leaders of the Core Cities visited the EU headquarters last week, but the needs of the regions post-Brexit should be championed by national government, not articulated through a parallel process. \nThe north, and other regions of the UK, need a seat at the table and an opportunity to state their distinctive visions of life outside the EU. That includes a meaningful input to discussions with the Commission, and also a say on how powers that come back to the UK can be passed to local areas, rather than hoarded in Whitehall. \nWhat the north east most needs Mrs May to say is, “I’m listening”. We also need her to mean it. \nAnna Round is a Senior Research Fellow at IPPR North. She tweets at @annainnewcastle. Like us on Facebook", "external_links": [], "published": "2018-03-02T07:00:00.000+02:00", "crawled": "2018-03-02T08:36:05.004+02:00", "highlightTitle": ""}