{"organizations": [], "uuid": "792a97c3f1bd0ef9e2d222db1dda423022c3f512", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14357599.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-reveals-five-things-wants-14357270", "country": "GB", "domain_rank": 21960, "title": "Theresa May reveals the five things she wants to achieve in the UK's Brexit agreement with the EU", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-02T07:00:00.000+02:00", "replies_count": 0, "uuid": "792a97c3f1bd0ef9e2d222db1dda423022c3f512"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-reveals-five-things-wants-14357270", "ord_in_thread": 0, "title": "Theresa May reveals the five things she wants to achieve in the UK's Brexit agreement with the EU", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "european council", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May reveals the five things she wants to achieve in the UK's Brexit agreement with the EU The Prime Minister reveals her Brexit strategy in a major speech, saying she wants the 'broadest and deepest' trade agreement possible Share Prime Minister Theresa May as she greets European Council president Donald Tusk ahead of a meeting at Downing Street, London (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Theresa May is to set out five “tests” that will guide the UK’s negotiations with the EU in the run-up to Brexit, in a major speech. \nMrs May will say she wants the “broadest and deepest” trade agreement possible - with more co-operation than any trade agreement already operating in the world today. Read More 7,000 Nissan workers could lose their jobs if Theresa May gets Brexit wrong \nAnd she will insist her ambitious plan is achievable, because it is in the EU’s interest too. \nThe Prime Minister will say: “I believe that is achievable because it is in the EU’s interests as well as ours and because of our unique starting point, where on day one we both have the same laws and rules. \n“So rather than having to bring two different systems closer together, the task will be to manage the relationship once we are two separate legal systems.” \nHer comments suggest the UK could continue to have many of the same rules and laws as the EU even after Brexit , although Mrs May will also stress that the UK must “take control of our borders, laws and money”. \nIt had been reported that the widely anticipated speech, titled “Our Future Partnership”, would take place in the North East. However, the venue has been changed as a result of weather conditions making the journey from London unfeasible. \nMrs May will say the first of her five tests is to ensure the agreement with the EU respects the result of the 2016 referendum, which she will argue was a vote for the UK to take back control as well as a vote for “wider change”, so that no community in Britain is “left behind again”. Read More Here's what the North East needs to hear from Theresa May on Brexit \nSecondly, she will stress that the agreement with the EU must be permanent. She will say: “After Brexit both the UK and the EU want to forge ahead with building a better future for our people, not find ourselves back at the negotiating table because things have broken down.” \nThe third test is that the agreement “must protect people’s jobs and security,” she will say. \nMrs May will say: “People in the UK voted for our country to have a new and different relationship with Europe, but while the means may change our shared goals surely have not – to work together to grow our economies and keep our people safe.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe fourth test is that the agreement “must be consistent with the kind of country we want to be as we leave,” Mrs May will say. \nShe will say the UK is “a modern, open, outward-looking, tolerant, European democracy. A nation of pioneers, innovators, explorers and creators. A country that celebrates our history and diversity, confident of our place in the world; that meets its obligations to our near neighbours and far off friends, and is proud to stand up for its values.” \nThe fifth test is that the Brexit agreement “must strengthen our union of nations and our union of people.” Read More Six North East firms make European list of fastest growing companies \nMrs May will say: “We must bring our country back together, taking into account the views of everyone who cares about this issue, from both sides of the debate. \n“As Prime Minister it is my duty to represent all of our United Kingdom, England, Scotland, Wales and Northern Ireland; north and south, from coastal towns and rural villages to our great cities.” \nIt comes as talks with the EU have focused on the question of Northern Ireland. Brussels says it wants to avoid border checks between Ireland and Northern Ireland, but these appear to be inevitable if the UK leaves the Customs Union, which removes the need for checks. \nThe European Commission has suggested that Northern Ireland could remain in the Customs Union which would allow easy passage between Northern Ireland and Ireland, but would require the creation of border controls between Northern Ireland and the rest of the UK. Like us on Facebook", "external_links": [], "published": "2018-03-02T07:00:00.000+02:00", "crawled": "2018-03-02T08:36:08.004+02:00", "highlightTitle": ""}