{"organizations": [], "uuid": "51254f4cc690597100672ec75a2c25f8a3385b11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14362297.ece/ALTERNATES/s1200/TMP_NEC_270218OpencastProtest01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/campaigners-fighting-opencast-mine-take-14362271", "country": "GB", "domain_rank": 21960, "title": "Campaigners fighting opencast mine take 86,000-strong petition to Westminster", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-02T20:40:00.000+02:00", "replies_count": 0, "uuid": "51254f4cc690597100672ec75a2c25f8a3385b11"}, "author": "Kali Lindsay", "url": "https://www.chroniclelive.co.uk/news/north-east-news/campaigners-fighting-opencast-mine-take-14362271", "ord_in_thread": 0, "title": "Campaigners fighting opencast mine take 86,000-strong petition to Westminster", "locations": [], "entities": {"persons": [{"name": "sajid javid", "sentiment": "none"}, {"name": "scarlet hall", "sentiment": "none"}], "locations": [{"name": "dipton", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "bradley", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "consett", "sentiment": "none"}], "organizations": [{"name": "westminster protesters", "sentiment": "negative"}, {"name": "local government", "sentiment": "none"}, {"name": "banks group", "sentiment": "none"}, {"name": "coal action network", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Protesters against the Bradley Opencast Mine development, off the A692 near Dipton (Image: newcastle chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA petition with more than 86,000 signatures against an opencast coal mine in County Durham has been handed to the Government. \nMining firm Banks Group plans to open the mine in Dipton , near Consett, and extract 500,000 tonnes of coal. \nWork on the Bradley site is expected to start within weeks, with work to clear the access road already under way. Read More Nice day for a white wedding: Community rallies to get bride to the church despite the snow \nA petition was started by campaign groups Coal Action Network and 38 Degrees, calling on Sajid Javid, Secretary of State for Housing Communities and Local Government, to revoke planning permission for the site. \nScarlet Hall, of the Coal Action Network, said: “Today, the Government’s commitment to a coal phase-out will be tested. \n“We know from our communities living near opencast all across the UK that these projects do not bring jobs to local people; instead they bring health problems and destroy much-loved natural habitats. \n“So will Mr Javid do right by local communities, or will he rule in favour of big coal?” Protesters against the Bradley Opencast Mine development, off the A692 near Dipton (Image: newcastle chronicle) \nResident Drummond Carr, who lives 300 metres from the site, said this was the last chance to stop the scheme going ahead. \nHe said: “Sajid Javid has the power to overturn this. \n“He must not let half a million tonnes of coal be mined out of the ground despite the Government’s commitment to climate change. \n“This is about much more than just us residents. \n“It is going to have a huge ecological impact, damaging the community long term, and will provide no long term economic benefits. \n“It will cause severe damage and will be a massive blight on the landscape.” \nMr Carr said the opencast mine is not the same as those operated by generations of miners who helped power the industrial revolution. Read More Here's what the North East needs to hear from Theresa May on Brexit \n“This is very different and will not provide any long term benefits,” he said. “This is a smash and grab job. They move from one site to another, take what they need then leave.” \nMr Javid is currently considering whether to halt plans for another of Banks’ opencast coal projects near Druridge Bay in Northumberland. \nMr Carr added: “It is on one of the most beautiful stretches of coastline. It is unimaginable and beggars belief why they would even consider doing it.” \nEarlier this week, residents were left outraged after discovering trees and 200-year-old hedges had been ripped up to make way for a new access road. Protesters against the Bradley Opencast Mine development, off the A692 near Dipton (Image: Newcastle Chronicle) \nProtesters climbed the last remaining tree and now, a ‘land protection camp’ has emerged, aiming to prevent the felling of trees by the mining company. \nThey will also monitor the planning permission constraint and report any breaches. \nThe camp, which consists of home-made tree houses in the last remaining tree, aims to delay Banks’ work until June 3 when the company’s permit will expire if work has not begun. \nOne of the land defenders said: “We are setting up this camp to support the communities of Pont Valley in protecting this beautiful countryside from opencast extraction. \n“We have been met with warm hospitality from local to help us create the camp in these arctic conditions.” \nLewis Stokes, community relations manager at the Banks Group, said the views of those protesting does not reflect the community. Protesters climbed the last remaining tree (Image: Newcastle Chronicle) \nHe said: “We are aware that a small number of individuals, many of whom have travelled from outside the region, have been holding a gathering in the vicinity of the proposed Bradley surface mine site this week, with a view to sharing often-illegal techniques for disrupting legitimate business operations, and do not believe their opinions are representative of the feeling across the wider community.” \nMr Stokes said involving the community in their projects is a central part of the way they work. \nThis has included forming a committee to share information with locals, door-knocking sessions, delivering letters and using social media. \nHe added: “Many of the comments we’ve been getting on the doorstep from local residents have recognised both the importance of bringing new jobs and supply chain opportunities to the area, and the positive, long-term impact that the project’s community benefits fund would have on the facilities available to local people.” \nHe said the Government’s own projects state coal will be an important part of the UK’s energy mix until at least 2025. Like us on Facebook", "external_links": [], "published": "2018-03-02T20:40:00.000+02:00", "crawled": "2018-03-02T20:48:35.011+02:00", "highlightTitle": ""}