{"organizations": [], "uuid": "174e5204502a2353a3026d5ea34673c6173aeaa2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14453754.ece/ALTERNATES/s1200/NEC_SSR_240318toriesJPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/conservatives-smell-blood-theyre-coming-14453614", "country": "GB", "domain_rank": 21960, "title": "The Conservatives smell blood - and they're coming for Newcastle in May", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-24T21:00:00.000+03:00", "replies_count": 0, "uuid": "174e5204502a2353a3026d5ea34673c6173aeaa2"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/conservatives-smell-blood-theyre-coming-14453614", "ord_in_thread": 0, "title": "The Conservatives smell blood - and they're coming for Newcastle in May", "locations": [], "entities": {"persons": [{"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "city road", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "invalid email  newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle’s Tories have launched their ambitious push to weaken Labour’s iron grip on the city and install themselves as the main opposition on the council. \nThe Conservatives fired the starting pistol on their campaign for the May local elections at Hotel du Vin, on City Road, on Saturday. \nBerwick MP Anne-Marie Trevelyan rallied activists who are hoping to emulate the party’s resurgence in Northumberland and Scotland in recent election cycles. \nThere are currently no Tories on Newcastle City Council but the party is hoping to continue their push to break into Labour heartlands and push the Liberal Democrats into second place on May 3. \nThe Northumberland MP recounted a lighthearted conversation with Philip Hammond, the Chancellor of the Exchequer, which reveals the party’s renewed focus on the country’s northern reaches. Read More Government put pressure on Northumberland County Council over housing plan \nShe said: “For years the blue of the Conservative party was absent on the map of the North. \n“But in the 2015 general election the whole map south of the border turned blue and in 2017 the same happened on the other side. \n“Shortly after Philip Hammond said to me, ‘you guys are doing something right up there - how about you work your way down and we’ll meet in the middle’.” \nThe old battle lines of entrenched party loyalties, Mrs Trevelyan said, are disappearing because “people are increasingly voting on the messages they here rather than sticking to tribal loyalties”. \nMrs Trevelyan accepted national political developments have some influence on voters decision in local elections and that North East voters are increasingly looking to the Tories in light of Labour’s transformation under Jeremy Corbyn. \nIn a week when the opposition’s divisions have once again come to the fore, she said she was confident the Conservative party could appeal to voters in the region. Newcastle Conservative party activists at the launch of their local election campaign (Image: Reporter) \nFormer Labour leadership candidate and shadow Northern Ireland Secretary, Owen Smith, was sacked on Friday after he publicly called for a second referendum on the EU. \nShe said: “Labour is riven by division and the hard left has taken over the party. \n“You can see this with the sacking of Owen Smith - I couldn’t disagree with him more on Brexit but you’re getting a shadow cabinet minister sacked for expressing his convictions. \n“I think the Labour vote in the North East has always been made up of moderate, hard-working communities and I’ve even had people say to me on the door step ‘I’ll lend you my vote until Corbyn’s gone’. \n“The Conservative party is in a good place at the moment, driving forward with Brexit and our domestic programme, and people recognise that.” Read More Row erupts after councillor is accused of making an offensive comment about disability \nDuncan Crute, who is standing in the Chapel ward and has twice run as a parliamentary candidate in Newcastle, said he believes the party can become the city’s new opposition. \nHe said: “In the last election I stood in Newcastle North and we secured out best result in the city since 1992. \n“The Tory brand is growing in this city and, while we’re under no illusion that we’re going to take Labour’s heartlands in one go, we’re feeling confident. \n“Labour have taken Newcastle for granted and we’re meeting a lot of voters who say they’ve always voted for them but they appreciate what we’re doing now. \n“There are various issue around bin collections, roads and potholes that need to be solved and aren’t be and this is at the same time senior executives at the council are getting pay rises. \n“We know there’s a big Tory vote out there in Newcastle and we think lots of wards are in play for us.” \nMrs Trevelyan, who supports the push for a new regional devolved authority for the North of Tyne, ruled out a bid to become mayor. Like us on Facebook", "external_links": [], "published": "2018-03-24T21:00:00.000+03:00", "crawled": "2018-03-24T23:19:57.016+03:00", "highlightTitle": ""}