{"organizations": [], "uuid": "9676c477dc77ad6e6a765d72c20a50f88d900318", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14404861.ece/ALTERNATES/s1200/Spring-statement.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/could-end-austerity-looming-spring-14405832", "country": "GB", "domain_rank": 21960, "title": "Could the end of austerity be looming? Spring statement makes suggestions but no promises", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-13T20:00:00.000+02:00", "replies_count": 0, "uuid": "9676c477dc77ad6e6a765d72c20a50f88d900318"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/could-end-austerity-looming-spring-14405832", "ord_in_thread": 0, "title": "Could the end of austerity be looming? Spring statement makes suggestions but no promises", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "none"}], "locations": [], "organizations": [{"name": "house of commons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could the end of austerity be looming? Spring statement makes suggestions but no promises Chancellor Philip Hammond says cuts could come to an end, but not yet Share Chancellor of the Exchequer Philip Hammond delivers his first spring statement in the House of Commons (Image: PA) Share Get daily   Thank you for subscribing!   \nSpending cuts could come to an end this Autumn, but that’s not a promise, says Chancellor Philip Hammond. \nDelivering his Spring financial statement to the House of Commons, he said the Government’s official forecaster has upgraded projections for growth and predicted falling inflation, debt and borrowing. \nAnd this meant he might have more money to spend when he delivers his full Budget statement in the Autumn, he said. \nThe Chancellor told MPs: “If, in the autumn, the public finances continue to reflect the improvements that today’s report hints at, then ... I would have capacity to enable further increases in public spending and investment in the years ahead, while continuing to drive value for money to ensure that not a single penny of precious taxpayers’ money is wasted.” \nIt could mean an end or at least a softening of the spending cuts that have hit police forces and councils. \nBut Treasury officials insisted no decisions had been made so far. Chancellor Philip Hammond leaves number 11 Downing Street (Image: Getty Images Europe) \nMr Hammond revealed that the Office for Budget Responsibility now expects state borrowing to be £45.2 billion this year - some £4.7 billion lower than predicted in November and £108 billion lower than in 2010. \nIn the meantime, the North East has been invited to bid for a share of £840 million being distributed for transport improvements. \nIt’s part of the Transforming Cities Fund, which the Government says is designed to of drive up productivity “and spread prosperity through investment in public and sustainable transport in some of the largest English city regions.” \nThe first £840 million has already been distributed to areas with mayor-led combined authorities. \nAccording to the Department for Transport, a bid could come from the North East Combined Authority. However, three councils currently members of the Combined Authority, Newcastle , Northumberland and North Tyneside, are set to leave and form their own North of Tyne Combined Authority. \nRegional transport will then be overseen by a statutory Joint Committee, jointly on behalf of the North of Tyne and North East Combined Authorities. \nIf the new system is up and running before a bid is submitted then it will have to come from the Joint Committee, the Department for Transport said. \nIt also emerged that the United Kingdom will have to pay a £37.1 billion financial settlement to leave the EU - and the payments will continue until 2064. Read More \nThe size of the divorce bill was revealed in papers published by the Office for Budget Responsibility (OBR) to accompany the Chancellor’s Spring Statement. \nThe OBR is the UK Government’s official independent budget watchdog. \nIt expects that £16.4 billion will be paid by the end of 2020, with another £18.2 billion paid by the end of 2028. \nThe remaining £2.5 billion represents pension liabilities, and will continue to be paid for decades to come. \nHowever, the Chancellor barely mentioned Brexit in his speech. North East England Chamber of Commerce said employers needed more certainty about what to expect once the UK leaves the European Union. Read More Here's why thousands of North East families will have their benefits cut on April 9 \nRoss Smith, the Chamber’s director of policy, said: “Two big issues loomed large over this and were barely mentioned. The success or otherwise of negotiations and planning for Brexit could yet render these forecasts largely irrelevant and businesses still have little detail to base their planning on. \n“The Chancellor also failed to give any meaningful update on whether the gap between London and other regions is being closed, which again calls into question the commitment in the Conservative manifesto to make this the Government’s top priority.” \nEd Cox, Director of IPPR North said: “There was little regard for all parts of the North of England in today’s Spring Statement. Whilst we are seeing the green shoots of growth in places like Manchester and Leeds, too many places in the North are still being left behind. \n”Weakening long-term growth projections are the result of low productivity in the North and Midlands. We need to unlock their economic potential with regional industrial strategies backed with long-term investment and more radical and widespread devolution.” Like us on Facebook", "external_links": [], "published": "2018-03-13T20:00:00.000+02:00", "crawled": "2018-03-13T20:04:18.018+02:00", "highlightTitle": ""}