{"organizations": [], "uuid": "afb48465a0cf5b173152a8e116b245eeff567114", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11483982.ece/ALTERNATES/s1200/JS92139069.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14418438", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: JD Wetherspoon boss toasts profit boost but warns of rising costs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-16T10:30:00.000+02:00", "replies_count": 0, "uuid": "afb48465a0cf5b173152a8e116b245eeff567114"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14418438", "ord_in_thread": 0, "title": "Business Breakfast LIVE: JD Wetherspoon boss toasts profit boost but warns of rising costs", "locations": [], "entities": {"persons": [{"name": "wetherspoon", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "coreena ford currys pc world", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Shares fall at Berkeley amid decision not to increase housebuilding levels \nBerkeley is not planning to increase levels of housebuilding as it faces up to economic uncertainty, a fall in buy to let investment and increased planning red tape. \nThe group said that market conditions in London and the South East, its core market, are unchanged from the first half, when it said market fundamentals remain “compelling”. \nHowever, it added that high transaction costs, the 4.5 times income multiple limit on mortgage borrowing and “prevailing economic uncertainty” are some of the factors that mean Berkeley is “unable to increase production beyond the business plan levels”. \nBerkeley said: “The fundamentals of the market in London and the South East remain compelling, but the operating environment and its impact on transaction volumes, whilst sufficient for the business plan and five year profit guidance ... do not support the step-up in Berkeley’s production levels that these markets so badly need.” \nIt also pointed to a fall in domestic buy-to-let investors, who have been hammered by increases to stamp duty, and the “time and complexity of getting on site following planning approval”. \nShares tumbled 5% following the announcement, with fellow housebuilders Persimmon, Bovis and Taylor Wimpey also dragged into the red. Berkeley Group Chairman Tony Pidgley 9.05 KEY EVENT Bigg Market loo entrepreneur reveals high hopes for Newcastle's quirkiest cafe bar \nA young leisure entrepreneur has revealed his hopes to welcome a new generation of gents – and ladies – into the Bigg Market toilets . \nSteve Blair is the ambitious licensee keen to transform the famous 19th Century public conveniences, which have lain empty for six years, into the city’s quirkiest wine bar. \nThe 29-year-old engineer from Newcastle revealed he has been in discussion with Newcastle City Council for two years about his plans to revamp the empty ‘flying saucer’ building and convert the cubicles into a trendy drinking establishment. \nA lease agreement has yet to be finalised but Mr Blair is hoping to see the venue open within months. \nHe said: “This is my first venture, and it’s early days, but this is something I’ve been looking to do for some time. \n“I’ve been in talks with the council for the last two years and submitted a business plan soon after it came available – it’s such a unique building so it would be brilliant to bring it back into use. \n“The toilet is in the middle of an upcoming, affluent area, especially with works due to take place in the Bigg Market. \n“It’s a really important part of the work that’s going to be carried out in the Bigg Market, and the Heritage Lottery Fund plan has been in for some time now. \n“Hopefully work will start soon. So long as it’s all approved, it’ll be called WC Newcastle or The Water Closet, and it will be similar to bars in London that have been built in former public toilets – there’s quite a few, including one in Kentish Town called Ladies & Gents, and WC in Clapham.” The public toilets in Newcastle's Bigg Market 9.00 Coreena Ford Currys PC World says sorry for extra charges on Laptops \nCurrys PC World has apologised after customers complained they had been pressured into paying more than the advertised price for laptops on multiple occasions since 2015. \nWhich? said 108 customers had reported ordering laptops or seeing them advertised at a specific price only to be charged up to £40 more on collecting them. Customers reported staff telling them that pre-setup computers were the only ones left in the shop, so they would have to pay a previously unmentioned additional set-up fee. \nThe retailer offers a £35 ‘Knowhow’ set-up service, as advertised on its website, which includes a USB recovery stick, but customers told Which? they were not advised it was optional. \nThe watchdog said it had raised the issue with Currys PC World “multiple times” since 2015, but continued to hear from customers with the same complaint. The retailer said it was “urgently re-briefing” its stores to ensure customers should not be charged extra if there were only pre-setup models available. \nA Currys PC World spokeswoman said: \nWe are sorry to hear that some customers have been charged for a Knowhow Laptop Set-up service on their new machine when they did not request it. \nWhile setting up machines in advance enables customers who want the service to benefit from it straight away, it is not something everyone needs. “We are urgently re-briefing our stores now to remind them that, in the small number of cases where only pre-set up models are available, customers should not be charged for the service when they buy their laptop. Currys PC World (Image: Evening Gazette) 8.53 Coreena Ford Self-employed happier at work, study reveals \nThe self-employed are happier at work despite long hours and more uncertainty, a new study suggests. \nThe research carried out by experts from the universities of Sheffield and Exeter showed self-employed people felt more engaged with their work, predominantly because they enjoyed more freedom to innovate and influence their working environments. \nAcademics studied data collected from 5,000 workers in the UK, US, Australia and New Zealand across a number of sectors - including heath, finance and education. \nFurther analysis was undertaken of employees across four job grades - non-managerial workers, supervisors, middle managers and senior managers and directors. \nThe self-employed workers who took part in the research worked in a range of sectors, including management consultancy, financial services, retail, education, insurance and real estate. \nThe study found that those who were self-employed were not only amongst the most engaged but also experienced greater opportunities for innovation, achieving challenging targets and meeting high standards. \nNon-managerial company workers were the least satisfied and engaged. The self-employed are happier at work, a study has found. 8.45 Coreena Ford Troubled Bargain Booze owner makes progress of tax bill \nBargain Booze owner Conviviality has said that customers and suppliers remain “supportive” after the firm revealed that it owes the taxman £30m, suspended its shares and issued a profit warning. \nEarlier this week, Conviviality said that the tax bill’s discovery “created a short-term funding requirement” and resulted in operational difficulties that could negatively impact profits. \nIn a brief stock market update this morning the troubled group insisted that it has been actively engaging with stakeholders while it continues to work through its funding requirements. \nConviviality is working with PwC as it undertakes a review of the business and its funding requirements, and it has “engaged” with HM Revenue & Customs (HMRC) regarding the £30m payment, which is due in 13 days. (Image: Trinity Mirror Southern) Coreena Ford Durham University to sell £1.5m in fossil fuel shares in bid to go green \nDurham University is set to sell around £1.5m of shares in fossil fuel companies in an attempt to make its portfolio greener. \nThe university made the decision to withdraw its investments from companies involved in fossil fuel extraction “as soon as practicable”, following a proposal put forward by Durham Students’ Union. \nInstead the university will look to invest in renewable energy projects in an attempt to become a “major international partner in the development of green energy”. \nProfessor David Cowling, pro-vice-chancellor (arts and humanities) at Durham University, said: “The decision to divest from companies involved in fossil fuel extraction is an important one for the university. \n“It has been taken following full consultation, and I would like to thank all staff, students and alumni who shared their views on this issue. \n“Durham is a world top 100 university, a research partner of international standing and a significant employer in North East England. We are committed not only to divestment, but to becoming a major partner in the future development of green energy. \n“The university is proud to be home to the Durham Energy Institute, which is already a leading centre for energy research, and we look forward to building on this work in future.” \nThe decision to sell its shares in fossil fuel firms came after Durham University conducted a full consultation with staff, students, and alumni into the issue. Four out of five respondents support the university’s divestment plans. Durham University's Ogden Centre, off South Road (Image: Newcastle Chronicle) 8.35 Coreena Ford Turnaround continues at outsourcing giant Mitie \nOutsourcer Mitie has said that its turnaround plan remains on track and it will deliver higher cost savings than previously thought. \nThe group, which has been under pressure following a string of profit warnings, said that its transformation plan will now see it trim costs by £50m a year by 2020. \nIt marks a 10% increase in cost savings as Mitie moves ahead with simplifying its corporate structure, outsourcing and automating some back office functions, merging its London offices into one and also overhauling its group-wide IT. \nMitie said that revenue is expected to grow up to 2.5% to £2.2bn this year, as it pointed to a 10-year contract with the Home Office worth more than half a billion pounds. \nThe outsourcing firm is set to start supplying immigration services to the Home Office starting in May after winning in a contract worth £525m. \nHowever, operating profit is expected to come in “slightly down” on the previous year due to investment, the group added. \nBoss Phil Bentley said that the liquidation of rival Carillion raised “some fundamental questions” about the outsourcing industry, but insisted that Mitie is still valued by its clients. Phil Bentley, CEO of Mitie 8.30 KEY EVENT Wetherspoon cautious on outlook as costs rise \nUK pub restaurant giant JD Wetherspoon has posted a rise in half-year profit, but warned that sales will be lower over the next six months as the pubs chain is hit with rising costs. \nThe group, which now runs 886 pubs across the UK, posted a 36.1% rise in pre-tax profit to £54.3m in the 26 weeks to January 28, with revenue rising 3.6% to £830.4m. \nLike-for-like sales rose 6.1% in the period, but chairman Tim Martin said that growth in comparable sales will be lower in the next six months as it stomachs an array of costs. \nMr Martin apologised to customers over a meat recall earlier this year which saw sirloin, rump and gammon steak pulled from the menu of the chain’s 900 UK and Irish pubs. \nWetherspoon has since cancelled its contract with the now-bust Russell Hume and is sourcing its steaks from new suppliers. \nMr Martin also used the latest trading update to launch fresh criticism aimed at the chairmen of Whitbread and Sainsbury’s, who he accuses of misleading the public by saying that food prices will rise if Britain leaves the EU without a deal. \nHe said: “There has been a huge debate, since the referendum, about the economic effects of Brexit. In particular, trade organisations like the CBI and the BRC, supported by the FT, the Sunday Times, the Guardian, the chairmen of Whitbread and Sainsbury’s and others, have misled the public by saying that food prices will automatically rise if we leave the EU without a deal. \n“This is a fallacy - the EU is a protectionist organisation which imposes high taxes on food, clothing, wine and thousands of other items from non-EU countries - which comprise around 93% of the world’s population.” \n“Another frequently repeated Brexit concern is that the much bigger EU economy will be better able to withstand a Mexican standoff than the UK. \n“This is also a fallacy. For example, Wetherspoon is one of the biggest customers, or possibly the biggest customer, of the excellent Swedish cider-maker Kopparberg. If trade barriers were imposed, so as to make Kopparberg uneconomic, then Wetherspoon could switch to UK suppliers or those from elsewhere in the world. \n“In this case, the principal losers in a trade war would be the inhabitants of a small town in Sweden, where Kopparberg is produced, rather than the UK economy.” JD Wetherspoon chairman Tim Martin More On", "external_links": [], "published": "2018-03-16T10:30:00.000+02:00", "crawled": "2018-03-16T11:04:27.001+02:00", "highlightTitle": ""}