{"organizations": [], "uuid": "faa4a8d13857ab32ee20829f7bbd3155dcbcc5d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article793113.ece/ALTERNATES/s1200/UPS3.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/ups-gets-green-light-114m-1277726", "country": "GB", "domain_rank": 48128, "title": "UPS gets green light for £114m East Midlands Airport parcel depot - leading to 1,400 jobs", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-01T12:45:00.000+02:00", "replies_count": 0, "uuid": "faa4a8d13857ab32ee20829f7bbd3155dcbcc5d2"}, "author": "leicestermercury", "url": "https://www.leicestermercury.co.uk/news/business/ups-gets-green-light-114m-1277726", "ord_in_thread": 0, "title": "UPS gets green light for £114m East Midlands Airport parcel depot - leading to 1,400 jobs", "locations": [], "entities": {"persons": [], "locations": [{"name": "east midlands airport", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "ups", "sentiment": "negative"}, {"name": "north west leicestershire district council", "sentiment": "none"}, {"name": "aecom", "sentiment": "none"}, {"name": "pegasus business park", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFreight carrier UPS has been given permission to build a £114 million base at East Midlands Airport – over the objections of some people living nearby. \nAgent Aecom told North West Leicestershire District Council the company wanted to build an “airport gateway logistics centre” on a 28.5-acre plot. \nUPS has said the scheme could create more than 1,000 jobs. \nThe airport is already UPS’s operations base in Britain, employing 342 package handlers, screeners, clerical workers, support staff, team leaders, supervisors and a manager. \nA design and access statement, submitted as part of a planning application for the new centre, suggested the 24-hour operation could employ 936 people within two years and almost 1,400 within eight. \nThe site, between the airport and the M1 , is next to Pegasus Business Park and is currently used for parking. \nIn a statement, a spokeswoman said: \"UPS is always looking to make strategic investments that provide opportunities to grow our business and to strengthen the services and solutions that we bring to our customers.\" Artists impression of planned new UPS complex \nCastle Donington, Breedon and Long Whatton parish councils made no objections to the application. \nKegworth Parish Council clerk Vicky Roe wrote to the district council saying: \"The parish council can see no reason for the logistics centre to be built if there is to be no increase in aircraft movements, parcels or traffic. \n“The parish council can see that with round-the-clock automated operations in place this is bound to increase capacity and therefore have the knock-on effect of more movements on the ground and in the air.” \nThe parish also appealed for contributions for \"post-bypass\" work in the village centre. \nMelbourne Civic Society said it believed the new UPS centre and another occupant moving into the company’s other site would increase capacity at the airport by at least 4,500 air traffic movements a year. East Midlands Airport \nA spokesman said: \"All of these additional movements would be at night and require no additional planning permissions. \n\"Civic society members consider that the current night noise is too high and is unacceptable. \n\"We believe it is now incumbent on the district council to protest residents close to the airport and apply more stringent night-time noise controls by whatever means available.” \nDistrict councillors approved the development with conditions including that the 500-space car park should be built ready to use before buildings are occupied. \nEast Midlands Airport handles more than 320,000 tonnes of cargo every year and hopes to triple freight shipments to one million tonnes annually within the next 10 to 20 years. Download the Leicester Mercury app \nWe've just launched our very own app for Android and Apple devices which can be tailored to deliver the news and sport that you're interested in. To download the IOS app click here . To download the Android app click here . \nWe’ve also got Facebook groups for traffic and travel , breaking news and parenting . Join by clicking the links \nLast year, DHL opened a £90 million extension to its depot on the site . \nAirport managing director Andy Cliffe has previously said the airport has big expansion plans, despite the uncertainties of Brexit. \nHe said: “The UPS plan for a parcel distribution facility is a significant addition to what it already has at the airport and we take transatlantic flights for those guys and from all over Europe. \n“DHL has its extension, while on the passenger side we are still in growth mode. \n“I would describe this as a time of enormous opportunities, but at the same time some of the risks (associated with Brexit ) are very significant.” Like us on Facebook ", "external_links": [], "published": "2018-03-01T12:45:00.000+02:00", "crawled": "2018-03-01T12:58:45.010+02:00", "highlightTitle": ""}