{"organizations": [], "uuid": "2ea4e3b4ddb54400589b53b87d99dca69122ad23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14383948.ece/ALTERNATES/s1200/L-R-Kevin-Fitzpatrick-Nissan-Europe-divisional-vice-president-for-manufacturing-and-Coun-Harry-Tr.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-gives-sunderland-half-car-14383863", "country": "GB", "domain_rank": 21960, "title": "Nissan gives Sunderland half a car as thanks for being granted freedom of city", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-08T14:20:00.000+02:00", "replies_count": 0, "uuid": "2ea4e3b4ddb54400589b53b87d99dca69122ad23"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-gives-sunderland-half-car-14383863", "ord_in_thread": 0, "title": "Nissan gives Sunderland half a car as thanks for being granted freedom of city", "locations": [], "entities": {"persons": [{"name": "kevin fitzpatrick", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "sunderland museum and winter gardens", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "business nissan", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "nissan europe", "sentiment": "none"}, {"name": "invalid email  sunderland city council", "sentiment": "none"}, {"name": "nissan leaf electric", "sentiment": "none"}, {"name": "nissan bluebird", "sentiment": "none"}, {"name": "nissan leaf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Nissan gives Sunderland half a car as thanks for being granted freedom of city Nissan has given Sunderland City Council a cross section of its Nissan Leaf electric car, which will be displayed in a museum Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSunderland City Council has been presented with an unusual gift, after receiving half of a Nissan Leaf car from the Japanese manufacturer. \nThe cross section of the car reveals the innovative technology inside the Leaf, which is the world’s best selling 100% zero emissions car and is produced at the Sunderland site. \nThe unique gift was presented to the council as a thank you for honouring Nissan’s workforce with the Freedom of the City last September. \nIt will be put on display at the Sunderland Museum and Winter Gardens, alongside the first Nissan Bluebird to come off the factory’s production line. (L-R): Kevin Fitzpatrick, Nissan Europe divisional vice president for manufacturing and Coun Harry Trueman, leader of Sunderland City Council with the Nissan half-LEAF (Image: Unknown) \nKevin Fitzpatrick, Nissan Europe divisional vice president for manufacturing, said: “Building the Nissan Leaf and being awarded the Freedom of the City are two significant moments in the plant’s history. \n“So when we were looking for a gesture to say thank you to the city council and the people of Sunderland for the support they have given us over the past 30 years, it made perfect sense to combine the two.” \nCoun Harry Trueman, leader of Sunderland City Council , said: “We’re delighted to accept this fascinating half-Leaf cross-section model. It reflects the innovation, investment and phenomenal success that hallmarks the Nissan NMUK Sunderland plant. \n“Skills development is a priority for Nissan and for us, and this fascinating half-Leaf is a great way to help inspire pupils to become future engineers, and increase understanding of current students at our university. The cross section of the Nissan Leaf will go on display at Sunderland Museum and Winter Gardens (Image: Unknown) \n“We hope that when it moves to the museum as many people as possible see for themselves the inner workings of a pioneering car. It shows that in 2018, the city with a proud history of innovation continues to produce ground-breaking technology.” \nBefore being displayed at the museum, the car will be sent to the Institute for Automotive and Manufacturing Advanced Practice at Sunderland University, where engineering and automotive students will be able to study the inner workings of the vehicle in more detail. \nThe Nissan Leaf has been manufactured in Sunderland since 2013, and quickly became the Europe’s fastest selling electric vehicle with sales reaching above 19,000. The second generation of the car is now rolling off the production line. Read More Brexit is major threat to UK automotive industry, Vauxhall boss says \nNissan’s factory employs 7,000 people in Sunderland, and supports more than 40,000 supply chain jobs. \nIt is hoped that the North East’s reputation as a hub for the automotive sector will be reinforced following the launch of the International Advanced Manufacturing Park (IAMP), which will be located close to the Nissan plant. \nIAMP is expected to create over 7,000 jobs and bring more than £400m of private sector investment. It will cover 150 acres and comprises 1.69 million sq ft of industrial space. Read More Carillion bosses more interested in pay than company survival, investors say \nCoun Trueman said: “With the industries, high quality jobs and investment the IAMP will attract, it will be a game-changer for our current and future workforce. The IAMP is a once-in-a-generation opportunity to transform not only the Sunderland and South Tyneside economies, but the economic health of the North East and UK. \n“The strong relationship the city council shares with Nissan means that future generations will benefit from the new skills, training and resources that will come about from our combined commitment. This half-Leaf model is a great example of how working together boosts the city, and we thank Nissan for the donation.” Like us on Facebook", "external_links": [], "published": "2018-03-08T14:20:00.000+02:00", "crawled": "2018-03-08T14:32:47.006+02:00", "highlightTitle": ""}