{"organizations": [], "uuid": "f113b04391cdbc6a953fb1d0abb2144f43040874", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13762866.ece/ALTERNATES/s1200/141017EUprotest-1JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-protest-monument-live-updates-14454493", "country": "GB", "domain_rank": 21960, "title": "Anti-Brexit rally in Newcastle LIVE: Updates as 'biggest' protest comes to city centre", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-25T13:07:00.000+03:00", "replies_count": 0, "uuid": "f113b04391cdbc6a953fb1d0abb2144f43040874"}, "author": "Kathryn Riddell", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-protest-monument-live-updates-14454493", "ord_in_thread": 0, "title": "Anti-Brexit rally in Newcastle LIVE: Updates as 'biggest' protest comes to city centre", "locations": [], "entities": {"persons": [{"name": "adonis", "sentiment": "negative"}, {"name": "kathryn riddell", "sentiment": "negative"}, {"name": "david hardman", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "andrew adonis", "sentiment": "none"}, {"name": "andrew) adonis", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "brian paddick", "sentiment": "none"}, {"name": "kathryn riddell rally", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "durham city railway station", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ian Johnson Rally has ended \nThe rally has now ended but we will have a full story on the day’s events online shortly. 16:12 Ian Johnson Speech interrupted by protester \nHis speech is interrupted by lad in a SuperDry coat who grabs the mic to a chorus of boos. Anti-Brexit speech interrupted \nHe’s bundled quickly away from the mic before police come over. I can’t quite hear what he’s saying but he does mention “freedom of speech” before he leaves the scene on his own accord. 16:04 Ian Johnson Eastern European migrant cheered \nMikal Chantkowski, a Green Party worker, gets a cheer as he proudly states he’s an Eastern European migrant. \n“I don’t know any Eastern European migrants who come to this country just to claim benefits,” he claims, slamming David Cameron for arguing against EU migrants before campaigning to remain. \nHe adds EU migrants are statistically more likely to be in work than the British citizens, adding: “we are being blamed for undercutting British workers...but we are supporting the economy with our taxes.” 15:57 Ian Johnson 'Let's not have borders' \nBill Corcoran, from the Irish Centre, says we should remember the “stupidity” of the hard Irish border. \n“Nobody from the Irish community wants to listen to the news and hear another bomb has gone off.” \n“Let’s not have had borders - remember what happened to the Romans,” he adds. 15:44 'Striking' float brought to city centre \nJust spoke to a young couple who grabbed a quick snap of the float. 'Brexit is a monstrosity' float in Newcastle (Image: Staff) \nHe said it was “quite striking”. Understatement of the year? 15:36 KEY EVENT 'Monstrosity' float paraded through Newcastle \nThis Brexit ‘monstrosity’ float which mocks Tory MPs, has been spotted passing by Monument throughout the afternoon. \nThe contorted bodies represent Theresa May, Boris Johnson, Michael Gove and David Davis. 15:26 Ian Johnson Changing perceptions of the North East \nWhen asked if events like this actually change anybody’s mind, organiser Louise Brown insists “hardcore” leavers have stopped to speak to people today. \nHowever she doesn’t say if it has actually changed anybody’s mind. Crowd at anti-Brexit rally at Monument \nWhat she does say though is the event is vital in terms of keeping the idea of remaining alive - and changing people’s perception of the North-East. \n“We’ve this image as being a big leave area - but people forget Newcastle voted to remain. \n“Public opinion will decide if there will be a chance we will remain - and public opinion is shifting,” she adds. 15:10 Billed as biggest ever Brexit rally \nOrganiser Louise Brown tells me she thinks there are 500 people here. \nA Lib Dem member interrupts her to say police have told him there are 300 here. It had been billed as Tyneside’s biggest ever Brexit rally. \nShe said it is “on par” with previous events. 15:02 Ian Johnson Around 200 people \nAs a guesstimate - and I stress this is a guesstimate - I’d say there was 200 people here. Maybe 250. 14:55 Lord Adonis says young could derail Brexit \nGrabbed a quick chat with Lord Adonis as he left the rally. \nWouldn’t be drawn on Corbyn/Owen Smith, but did say if there was a referendum on the terms of leaving the EU, it’s the new 2m young voters who could derail Brexit. 14:50 Live footage of the rally \nWe’re now live from the anti-Brexit rally. \nSee the view of the crowd and hear the speakers here. 14:37 Kathryn Riddell Watch Lord Adonis's speech \nLord Andrew Adonis has been addressing the crowd and says he offered the French Jacob Rees-Mogg in return for the Bayeux Tapestry. 14:30 'Brexit is a monstrosity' float arrives \nThe striking float declaring Brexit to be a monstrosity has arrived at the Monument. \nPolitical figures behind Brexit have been depicted in the anti-Brexit artwork. 14:21 Kathryn Riddell Former London Mayor candidate speaks \nBrian Paddick, ex-Lib Dem London Mayor candidate delivers a speech on security post-Brexit to the crowd. London Mayor candidate Brian Paddock speaking 14:16 One man says he would change vote \nOnly giving his name as Brian, one man says he voted leave. Anti-Brexit rally in Newcastle \nWith the ‘full facts’, he would now probably vote to stay - but adds: “I don’t think there should be a second vote - it seems like these people want a second vote until they get what they want.” 14:12 Kathryn Riddell Scene at Monument now \nThe current scene at Monument, just over ten mins after what’s been billed as Tyneside’s biggest ever Brexit rally, began. 14:08 Crowd of around 80 people \nJarrow’s Trevor Upton is watching from the sidelines. \nThe remainer admires the 80-odd people who have turned out today, and wishes there was another vote. \nBut he admits: “The small crowd here shows people’s apathy.” 14:03 Rally open to dogs \nPeter is here with Suki, a five-year-old Irish Colley. \nAs a dog, Suki couldn’t give her opinion on Brexit - but it seems pretty obvious to me she’s a remainer... Suki at the anti-Brexit rally 13:59 'Should get a second chance' \nPeter Fuller says: “‘It is sometimes tiring continuing to fight for this. \n“Sometimes you wake up and question going out. But we feel the public didn’t know the full facts first time around and should get a second chance now - that’s all we want, another chance.” 13:53 Signs and flags at protest \nThe rally is starting to take shape ahead of the official start time. Anti-Brexit protesters in Newcastle city centre \nProtesters are gathering around Monument displaying flags or signs showing their support for the EU. Protesters at anti-Brexit rally", "external_links": [], "published": "2018-03-25T13:07:00.000+03:00", "crawled": "2018-03-25T14:03:56.006+03:00", "highlightTitle": ""}