{"organizations": [], "uuid": "60909007e82e7b87c2056aa54b1225bbb635de8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14475433.ece/ALTERNATES/s1200/mu080715unigrads5JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/businesses-leading-way-helping-north-14475301", "country": "GB", "domain_rank": 21960, "title": "Businesses are leading the way in helping the North East region to thrive and succeed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-30T14:12:00.000+03:00", "replies_count": 0, "uuid": "60909007e82e7b87c2056aa54b1225bbb635de8f"}, "author": "Angela Upex", "url": "https://www.chroniclelive.co.uk/business/business-news/businesses-leading-way-helping-north-14475301", "ord_in_thread": 0, "title": "Businesses are leading the way in helping the North East region to thrive and succeed", "locations": [], "entities": {"persons": [{"name": "brian aitken", "sentiment": "none"}, {"name": "tony lewin", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "angela upex", "sentiment": "none"}, {"name": "n'cle college", "sentiment": "none"}, {"name": "newcastle college", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Businesses are leading the way in helping the North East region to thrive and succeed For generations, North East businesses have shown the innovation, resilience and determination to overcome any obstacles and keep the region thriving Share The Invest in the North East campaign (Image: Newcastle Chronicle)   \nWhen ChronicleLive launched the Invest in the North East campaign to applaud and encourage investment, we knew they would see it as a rallying call and would be ready to collaborate for the good of the region. Here, our leading businesses give ANGELA UPEX their views of how the region is faring and tell her what they are doing to create more jobs and opportunities. NEWCASTLE COLLEGE Tony Lewin, Newcastle College (Image: provided by Brian Aitken as publicity handouts for N'cle College) \nCollaboration is key to making the North East a great place to live and do business \nBased in the heart of Newcastle with specialist academies in North Tyneside, Gateshead and at Newcastle Airport, Newcastle College is one of the region’s key employers. The College’s provision is vast and diverse, with individuals of all ages studying at entry level to Masters degree in subjects from accountancy and computing, to hospitality and specialist engineering disciplines. \nIt’s the College’s aim to unlock the potential of each and every single individual, creating opportunities for employment and progression through further study. \nTony Lewin, Principal at Newcastle College, has been at the helm for almost three years and talks about the shift in the way in which the business must adapt, seeking industry expertise to ensure that courses are fit for purpose. \nMr Lewin said: “Industry informs everything we do here at Newcastle College and collaboration and partnerships with North East businesses are central to all key business decisions. \n“As a leading vocational and technical college we need close dialogue with employers across all industries to ensure we produce work-ready individuals who can hit the ground running, right here in the North East. It’s not just a case of developing a qualification and letting a student find their own way. It’s our duty to craft meaningful opportunities and provide support at every step of their journey. This could be a young person starting a course straight from school or a senior manager completing leadership training through a degree apprenticeship – there isn’t a one size fits all.” \nThe College has a history which dates back over 120 years and over that time has enjoyed thriving relationships with employers who support with guest lectures, live briefs, work placements and full-time job roles. With recent changes in apprenticeship reforms and upcoming T levels, the College, more than ever understands the need to enhance and expand on these relationships with employers across all disciplines. \nMr Lewin comments: “As the North East landscape changes we have to be more flexible in our offer and our delivery. As a business we have to align ourselves to regional needs and work towards priorities identified by the North East LEP. We have a responsibility to make a significant contribution to the LEP’s target of 100,000 new jobs by 2024 and we can’t do this without regular employer engagement and dialogue. \n“Our focus is on responding to the needs of regional employers whilst supporting our students into sustainable employment. \n“We’re lucky as we benefit from being a part of one of the largest education and training groups in the UK, NCG. This allows us to share a wealth of expertise with our partner divisions. This combined with our employer relations gives us a solid foothold to be able to respond quickly to demand.” \nThe College’s recent royal recognition with the award of a Queen’s Anniversary Prize in February this year is proof that this industry liaison works. The award, presented at Buckingham Palace was in recognition of the College’s Transport Academy which is comprised of its Rail and Aviation Academies. \nMr Lewin is keen to point out that this is just one example of many which demonstrates the importance of close collaboration, which in turn supports job growth in the North East. \nHe commented: “The royal approval was a fantastic accolade for Newcastle College but it’s important to note that this is just one example, in one particular sector. Throughout our business these relationships exist across all industries. \n“Collaboration is key to our success and the North East as a whole. As a region we have so much to shout about and there’s some fantastic organisations and individuals who really make the region a great place to live and do business. \n“It’s our aim at the College to build upon these collaborations so that the North East economy can prosper.” STAGECOACH NORTH EAST Steve Walker, managing director, Stagecoach North East (Image: Unknown) \nStagecoach has made a series of improvements to help transform bus travel for customers, including the ‘Stagecoach Bus’ smartphone app which provides customers with journey planning, next-stop information and live bus tracking, and enables people to buy and download bus tickets straight to their mobile phone. \nContactless payments – along with Apple Pay and Android Pay – are now accepted on buses across the North East, with the local company being the first operator outside of London to introduce the technology. \nSteve Walker, Managing Director of Stagecoach North East, said: “We work hard to deliver high quality services for the many people who rely on the bus, and our current ticket range demonstrates the great value, unlimited travel we offer through our tickets.” \nThe North East has among the highest level of bus use across the UK, and national passenger satisfaction survey results showed that bus customers in Tyne and Wear rated operators highly for overall satisfaction and value for money. \n“The current mix of public transport options for our local communities is vital and provides a major boost for the regional economy. In the upcoming year, Stagecoach North East will continue to provide a wide range of product offerings for students, adults and young people, designed to offer excellent value to closer match our customers’ actual travel needs. \n“Our recent ticket collaboration on the standardisation of the £1 under-19 fare, which is valid across all local operators’ services, demonstrates a really positive step and is something we hope to see replicated across a wide range of ticket options in the coming months. A key barrier to travel can be the complexity of ticketing conventions, so simplifying our offers helps to unify the local public transport network and its users.” \nUnfortunately, the impact of traffic congestion is hugely detrimental to bus travel and significantly undermines the local operator investment. Research by campaign group Greener Journeys last year warned of the damaging impact of congestion within towns and cities across the UK. The research – by Professor David Begg – revealed that average traffic speeds in Britain’s busiest cities are set to fall to just 12mph by 2030 as traffic delays are expected to double over the next decade.* \nSteve continued: “Unfortunately, along with other road users, our customers are being affected by the serious issue of traffic congestion which reduces the reliability of bus services, pushes up fares, reduces air quality and lessens the appeal of bus travel. \n“We are investing in continued improvements for our customers but we need those responsible for road infrastructure to match that commitment by freeing up road space to let buses flourish.” \nOver the past six years, Stagecoach North East has invested heavily in improvements to its services, including the introduction of 241 new vehicles, worth £37million, for local communities. \nStagecoach North East is delighted to be supporting the Transport Links Business Breakfast 2018 and welcomes the opportunity to give voice to the organisation’s current challenges within the Public Transport industry, in the hope of contributing significantly to the continued development of our great region. NORTHUMBRIAN WATER Heidi Mottram OBE, Chief Executive of Northumbrian Water (Image: Copyright Jim Varney 2008) \nAs well as being the North East’s supplier of water and sewerage services, Northumbrian Water is proud to play an important role within the region’s economy. \nWe employ more than 2,200 people across the region, working in a wide range of roles that not only ensures we continue to deliver unrivalled customer service, but that we also protect and enhance our local environment. \nTo deliver this means investment in our region, in its communities, institutions and people. \nIn 2018 alone, we are investing £180m in infrastructure and services, which also supports our fantastic network of supply chain companies, the vast majority of which are based here in the North East. \nThis is part of our wider £1.1 billion planned programme of works between 2015 and 2020. \nWe’re investing in our people, too – North East people serving their communities. \nThey’re the people you see working out and about, but they’re also scientists, civil engineers, accountants, human resources professionals, to name but a few. \nMore than 200 of our people, some of whom have been working for decades, are being given a chance to develop their careers through our investment in apprenticeship programmes that will enhance their ability to deliver a first class service for our customers. \nIn addition we have more than 50 young apprentices working within our businesses, so we’re also investing in the region’s future. \nWe invest in innovation as well. \nLast year we held our first ever Innovation Festival at Newcastle Racecourse, bringing 140 organisations and more than 1,000 individuals from around the world together to look at how we can tackle problems that are faced by businesses and communities here in the region and further afield. \nThis industry-leading activity demonstrates how much value we see in the North East – we’re putting investment into ideas that will allow us to continue to be a champion of our region for the decades ahead. \nThis impetus to innovate is already bearing fruit - working with many of those organisations we have already seen an English first, the delivery of an environment-improving Moss Tree in Newcastle City Centre, and there are more exciting things to come. \nOne of our best known innovations is our ability to make “power from poo”. We’re the only UK water and sewerage company to use 100% of our sewage sludge to create energy through a process called Advanced Anaerobic Digestion (AAD). \nThis happens at our Howdon Sewage Treatment Works on North Tyneside, and we even go a stage further, converting some of that energy to gas, to feed back into the National Grid. \nBy delivering our core services well, we can lead good practice in infrastructure, skills and innovation and create the building blocks for investment in the region by others, safe in the knowledge we have the foundations covered. \nWe can also build upon our own operational sites to support other areas of the economy that one might not normally associate with a water company. \nAt Kielder, in Northumberland, we have Northern Europe’s largest man -made reservoir, Kielder Water. \nKielder Water itself came about to support the region’s growth. \nHaving created reservoirs along the Tees to provide water for Teesside’s growing industry, Kielder was developed to support all three of our region’s rivers, with the ability to provide water to 80% of the region and putting the North East in an enviable position of not having to worry about water shortages. \nSince that opened in 1982, we have worked with a range of partners to establish the Kielder Water & Forest Park Development Trust that has created a thriving and award-winning tourism attraction. \nIn 2017, we unveiled the fruits of our latest investment at our Landal Kielder Waterside Park, a range of new premium lodges for visitors to this stunning part of Northumberland. \nOver the last nine years tourism in the area has trebled with the visitor economy growing by more than £17 million and the newly-enhanced visitor offer at Kielder Waterside is expected to be worth an additional £2 million to the local economy. \nYes, we are a water company, but thanks to our region, its people, institutions, businesses and attitude to innovation we are so much more than that. \nWe are inspired by, and proud of, the region and the communities we serve. And we are proud to support this fantastic campaign. By Heidi Mottram OBE, Chief Executive, Northumbrian Water. NEWCASTLE UNIVERSITY Professor Chris Day, Vice-Chancellor and President of Newcastle University (Image: Simon Veit-Wilson) \nNewcastle University is one of the UK’s great redbrick universities, founded in 1834 to address the economic, health and social issues of an industrial city. \nOur original role was to educate the pioneers of the industrial revolution to make advances in engineering, shipbuilding and agriculture. We also led the way in research into public health issues that blighted the local population at that time. \nToday’s University is a thriving international community of more than 26,400 undergraduate and postgraduate students from over 140 countries worldwide studying at our vibrant city-centre campus in Newcastle and at our locations in London, Malaysia and Singapore. \nBut even though we have grown in scale and diversity, and are now operating on a truly global stage, Newcastle University continues to have a profound impact on the city of Newcastle and the North East of England. \nAs Vice-Chancellor and President of Newcastle University, I am immensely proud of the contribution our University makes to the prosperity of our city and region. I am also heartened that the students we teach, the collaborations we have with our many partners and the facilities we provide here are enriching people’s lives economically, culturally and socially. \nThe challenge, of course, is how as an anchor institution in Newcastle we build on this to address issues of social inequality in our region while recognising that we also need to adapt to the wider impact of Brexit, globalisation and profound societal changes such as an ageing population. \nWe actively invest in projects that are helping to attract new businesses and jobs to the region. In partnership with Newcastle City Council and Legal & General, we are creating Newcastle Helix - the new identity for Science Central – which is our £350million urban regeneration project on the site of a former brewery which is the largest of its kind in the UK. \nNewcastle Helix will be home to two national innovation centres, in the fields of ageing and data. Together with research centres in energy and infrastructure and our flagship Urban Sciences Building, they will create a full-scale demonstration site in the heart of Newcastle where business and communities can get involved in providing real-world solutions to the issues facing modern and growing cities. The University is also leading a national research centre for offshore and subsea engineering on the banks of the River Tyne. We are taking a similar approach to our research and teaching facilities outside the city. \nAt our farms in Northumberland and marine centre at Blyth, we are working alongside businesses, other education providers and the local community to create opportunities and develop skills that will bolster Northumberland’s economic prosperity. \nWe also invest in cultural venues linked to our academic excellence. The Hatton Gallery is part of our world-class School of Arts and Cultures while the Great North Museum: Hancock (GNM) is home to an extensive natural history and archaeology collection. \nAt the same time, we continue to operate on a global scale, with a world-class reputation for pioneering research and innovation in the fields of medicine, science and engineering, social sciences and the arts and humanities, and are committed to focusing our work on addressing some of the most pressing challenges facing global society. \nOur partnership with Invest in the North East gives me confidence in the knowledge that we have a very firm foundation on which to build and the assurance that by continuing to improve our performance, we can bring far-reaching benefits to our city and region and beyond. Professor Chris Day, vice-chancellor and president of Newcastle University NEWCASTLE AIRPORT Graeme Mason (Image: North East England Chamber of Commerce) \nNewcastle Airport is the international gateway for the North East and last year, we welcomed almost five and a half million passengers to the terminal for the first time in a decade – a 10% increase from the previous year. \nThe airport connects businesses to a global market and its future success and that of the region will be mutually dependent. A thriving airport will help deliver growth, jobs and investment for the region. \nGiven its location in the UK, it’s imperative that the North East is well connected, both domestically and internationally as businesses across the North East rely on the freight and passenger links the airport provides. \nThe airport offers flights to more than 80 destinations directly and many more worldwide through its extensive hub network, including daily flights to Dubai and several flights each day to London Heathrow, Amsterdam, Paris and Dublin. Looking to the future, expansion of our route network is key to ensuring passenger growth continues, as well as opening up new global markets for local businesses. \nWe aim to provide the best possible facilities and experience for our customers, and we believe that this good first impression will help the North East to attract new businesses and inbound tourists. Investment into the airport is strong and has allowed continuous improvement of this customer experience and the growth of passenger numbers. \nSome of the more recent investments include state-of-the-art air traffic control radars situated on the roof of the terminal and a brand new hold baggage screening system, both of which have helped to greatly improve operational effectiveness and offer an even better experience to customers. \nWe will also see the opening of our newly-expanded multi-million pound international arrivals hall this summer, which will include five brand new ePassport gates, ultimately getting people to the region as speedily as possible. \nIn order to keep achieving excellent customer satisfaction and attracting new passengers to the airport, it’s important to keep abreast of the latest innovations and continue to invest in state-of-the-art technology. \nIn a bid to boost inbound tourism in the North East, we last year announced a three-year partnership with VisitBritain and NewcastleGateshead Initiative to promote the region to overseas markets. \nThe partnership focuses on driving more visitors to explore the diverse culture and heritage of NewcastleGateshead and the surrounding region and, currently, the initiative is targeting visitors from Germany, highlighting the direct flights from Berlin to Newcastle Airport and profiling the Great Exhibition of the North, which the Airport is supporting as official international gateway, as a reason to travel in 2018. \nAs part of this partnership, we are also working with local destination management organisations, Northumberland Tourism and Visit County Durham, and tourism colleagues at Sunderland City Council, North Tyneside Council, South Tyneside Council and the Tees Valley Combined Authority, to develop bookable itineraries showcasing the region’s varied tourism product. \nWith continued passenger growth and emphasis on exploring the North East, it’s important to ensure transport links serving the Airport and throughout the North East are continually invested in. \nThe Government’s commitment to invest £337m into the Tyne and Wear Metro system is a big boost and timely delivery of new trains will improve access to the airport by public transport. \nThe recent investment in the A1 Western by-pass has greatly improved traffic flow to and from the airport on this strategically important route, and further upgrades planned between Birtley and Gosforth Park will enhance this further. \nImprovements to the A19 will also help, as would an upgrade to the A69 to improve connections to and from Cumbria. Graeme Mason, Planning and Corporate Affairs Director at Newcastle International Airport. NORTHERN \nNorthern plays a vital role in the North of England by connecting tens of thousands of people to work, leisure, education and more every day. \nArriva Rail North Limited became the new rail operator for Northern on 1 April 2016, marking the start of a nine-year franchise that will transform travel through a £1billion investment in the largest rail network outside London. \nThere are many exciting benefits to come as a result of over £1bn of investment during the next nine years, including brand new state-of-the-art-trains and faster and more frequent services. \nWe will also be introducing ‘Northern Connect’ which will connect major towns and rural communities across the network. \nAlong with the improved rail service, £60m investment will upgrade our stations with ticket machines, new seating, waiting areas, technology, information points and improved accessibility With extensive investment in trains and stations, and more frequent services, modernisation will deliver the biggest rail upgrade the North East has seen in a generation. \nOur changes will support economic growth, secure jobs, protect pay and make the North East a better place in which to live and work. \nIn the North East this will mean that by 2020 our local rail service will be unrecognisable to the one that you see today. \nMike Paterson, Regional Director at Northern, said: “In the coming months and years our customers will see further improvements as we work to modernise our stations and facilities. \n“We will also continue to improve our current fleet of trains and, from this year, will begin the introduction of 286 new, purpose built carriages. \n“These trains will provide more space and enable us to add more than 2,000 services every week, building on the 2,500 we already operate each day. \n“This is just the beginning of modernisation for our customers and there are many more exciting improvements to come on our journey to 2020.” \nNorthern is delighted to be working alongside the Journal, the Chronicle and other business in the region to promote the North East and celebrate its successes. Mike Paterson, North East director of rail company Northern Like us on Facebook", "external_links": [], "published": "2018-03-30T14:12:00.000+03:00", "crawled": "2018-03-30T20:29:30.026+03:00", "highlightTitle": ""}