{"organizations": [], "uuid": "e82a8e6ddcc7241db77909017f7fea732bd75fe4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.birminghammail.co.uk/incoming/article14043947.ece/ALTERNATES/s1200/theresa-brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-visit-newcastle-urge-country-14469039", "country": "GB", "domain_rank": 21960, "title": "Theresa May to visit Newcastle and urge the country to unite around Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-29T00:30:00.000+03:00", "replies_count": 0, "uuid": "e82a8e6ddcc7241db77909017f7fea732bd75fe4"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-visit-newcastle-urge-country-14469039", "ord_in_thread": 0, "title": "Theresa May to visit Newcastle and urge the country to unite around Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May to visit Newcastle and urge the country to unite around Brexit With a year to go until Brexit takes place, Mrs May will visit the North East as part of a tour of the UK Share Theresa May in Brussels for Brexit talks Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWith a year to go until we leave the European Union, Prime Minister Theresa May is embarking on a whistle-stop tour of the UK urging the country to pull together and make Brexit a success. \nBrexit is due to take place at 11pm on March 29 in 2019. \nAnd Mrs May is to begin the countdown by travelling across the country in one hectic day, including a stop in Newcastle. \nThe Prime Minster said: “I am determined that our future will be a bright one. It’s a future in which we trade freely with friends and partners across Europe and beyond. \n“Having regained control of our laws, our borders and our money, and seized the opportunities provided by Brexit, the UK will thrive as a strong and united country that works for everyone, no matter whether you voted Leave or Remain.” \nKicking off in Scotland, the Prime Minister will visit textile workers at a factory in Ayrshire. \nShe is then set to travel to Newcastle to meet with a local parent and toddler group. \nThen it’s off to Northern Ireland, where Mrs May will have lunch with farmers near Belfast. \nBack across the Irish Sea, she is to travel to to Barry to host a roundtable with Welsh businesses. \nAnd the Prime Minister will finish the day in West London, where she will have tea with a group of Polish citizens who have made the UK their home. \nSpeaking ahead of the visit, Prime Minister Theresa May insisted Brexit would benefit the whole of the UK - despite Treasury assessments which suggest the economies of the North East of England and the West Midlands could suffer. \nShe said: “The government is taking action to benefit the whole UK, from supporting the security services that keep us all safe and pursuing a modern industrial strategy which will deliver jobs and economic growth in every community, to pursuing an international trade policy which will open up new markets for our world-beating exports around the world.” Read More De La Rue workers bring the fight to save their jobs to Westminster \nAnd she issued what appeared to be a plea for the nations of the United Kingdom to stick together. \nShe said: “Today, one year until the UK leaves the EU and begins to chart a new course in the world, I am visiting all four nations of the Union to hear from people across our country what Brexit means to them. \n“I am determined that as we leave the EU, and in the years ahead, we will strengthen the bonds that unite us, because ours is the world’s most successful union. The UK contains four proud and historic nations, but together we amount to so much more than the sum of our parts and our Union is an enormous force for good. \n“We see that on the global stage, where the UK stands up for liberal and democratic values and leads the world in international development action. And we see the enormous benefits of our Union at home too, as we face challenges together, freely pooling and sharing risks and rewards as one united people.” Read More £150m creative industries deal to provide boost to the UK's virtual reality sector \nThe country is still divided about Brexit, a leading polling expert says. \nSir John Curtice, who correctly predicted the Conservatives would lose their majority in the 2017 general election, said there is “far from sufficient evidence” that a second referendum would reverse the result of the original vote. \nIn a report published by The UK in a Changing Europe, which is funded by the Economic and Social Research Council (ESRC), to mark one year to exit day, he said: “There is some sign of movement, but not enough to suggest that the country is anything other than more or less evenly divided down the middle on the subject, much as it was on referendum day itself.” \nSir John said there have been relatively few polls of how people might vote in a second referendum and those that had been carried out were close and come with a “health warning”. Like us on Facebook", "external_links": [], "published": "2018-03-29T00:30:00.000+03:00", "crawled": "2018-03-29T01:43:59.117+03:00", "highlightTitle": ""}