{"organizations": [], "uuid": "8d4422d4fda2397d1d08af75b9349040b753f924", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11113402.ece/ALTERNATES/s1200/JS84735793.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-could-actually-good-north-14374294", "country": "GB", "domain_rank": 21960, "title": "Why Brexit could actually be GOOD for the North East economy, according to one supporter", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-06T20:00:00.000+02:00", "replies_count": 0, "uuid": "8d4422d4fda2397d1d08af75b9349040b753f924"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-could-actually-good-north-14374294", "ord_in_thread": 0, "title": "Why Brexit could actually be GOOD for the North East economy, according to one supporter", "locations": [], "entities": {"persons": [{"name": "jo", "sentiment": "negative"}, {"name": "nathan arnott", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why Brexit could actually be GOOD for the North East economy, according to one supporter MEP Jonathan Arnott explains why he doesn't believe a Treasury assessment which found Brexit will be bad for the North East economy Share   Thank you for subscribing!   \nThere is no reason to believe claims that Brexit will devastate the North East economy, an MEP has insisted. \nNorth East MEP Jonathan Arnott, a supporter of Brexit, has produced a detailed report setting out reasons why quitting the EU will actually help the economy. \nBrexit will allow the UK Government to ensure contracts worth millions or billions of pounds go to UK firms, he said. \nAnd an independent UK may be able to sign crucial trade deals with the US - while the EU waits at the back of the queue. EU and Union flags (Image: PA) \nIt follows the high-profile leak of Treasury studies which said the North East’s economy will be 11% smaller 15 years after Brexit if there is a trade deal, or 16% smaller if we leave the EU without a trade deal. \nMr Arnott said: “As the United Kingdom prepares to leave the European Union, it’s important that claims are critically examined.” Read More Communities Secretary says councils like Northumberland are contributing to housing shortage \nIt emerged last month that a Treasury analysis had found leaving the EU will mean the UK’s economy is 5% smaller than if we stayed in - even if the UK agrees a trade deal with Brussels. \nAnd the assessment, which has not officially been published, found the North East would be particularly hard hit. Nissan Qashqai (Image: Handout) \nWhile it’s unclear exactly what impact that would have on the region, a smaller economy suggests there will be fewer jobs and lower wages. \nThe findings were seized on by opponents of Brexit, and some argued that they showed why there should be a second referendum. \nBut Mr Arnott, a former UKIP MEP and now an independent, said there was no reason to believe they are true. Read More What is Article 50? \nHe said: The findings fail to take into account the damaging effect of planned EU policies that will hit the UK if we stay in. For example, the EU plans a new Financial Transaction Tax, which would cost the UK more than other EU countries They also fail to include any advantages from leaving the EU, such as the ability to sign new trade deals. These would lower or end the tariffs UK firms currently have to pay to export products to many non-EU countries The media tends to focus on the most “shocking” and negative figures contained in any report, even if other outcomes are more likely Talk about lower economic output doesn’t take into account the fact that the population might also grow more slowly if we leave the EU. It means that economic output per person - which is arguably matters most - will fall by much less, or may increase It looks like the UK has more chance or getting a trade deal with the USA than the EU does. If this does happen then it would “tip the balance of the scales towards Brexit”. The British Government will be able to help businesses in ways that are currently prohibited by EU rules. For example, it could ensure it gives Government contracts to British firms And the British Government will be able to give state aid to struggling sectors of the economy without first needing the permission of the European Commission. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nMr Arnott said economic output (GDP) per person would be higher because of Brexit. \nHe said: “I remain convinced that Brexit will result, over the next 10-15 years, in the UK’s GDP per capita being higher than without Brexit”. Read More \nBut this did depend partly on the Government making the right decisions to take advantages of the opportunities Brexit offers, he said. \n“As time passes, the long term advantages of Brexit will become greater.” Like us on Facebook", "external_links": [], "published": "2018-03-06T20:00:00.000+02:00", "crawled": "2018-03-06T23:45:39.007+02:00", "highlightTitle": ""}