{"organizations": [], "uuid": "5f8d2e94242ce343e06b02123c8f6a9c0e21eb2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14408370.ece/ALTERNATES/s1200/RUSSIA_Putin_113782.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-playing-russias-hands-says-14416229", "country": "GB", "domain_rank": 21960, "title": "Brexit is 'playing into Russia's hands' says North East Labour MP", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-15T17:27:00.000+02:00", "replies_count": 0, "uuid": "5f8d2e94242ce343e06b02123c8f6a9c0e21eb2e"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-playing-russias-hands-says-14416229", "ord_in_thread": 0, "title": "Brexit is 'playing into Russia's hands' says North East Labour MP", "locations": [], "entities": {"persons": [{"name": "phil wilson", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "north east labour", "sentiment": "negative"}, {"name": "kremlin", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit is 'playing into Russia's hands' says North East Labour MP MP Phil Wilson says leaving the European Union is exactly what Vladimir Putin wants us to do Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nQuitting the European Union is what Russia wants us to do, an opponent of Brexit has claimed. \nRussian President Vladimir Putin wants to divide and weaken the West, said Sedgefield MP Phil Wilson. \nAnd Brexit is playing into his hands. \nMr Wilson said: “I do not think we should doubt that Russia’s intent with the continent of Europe is to divide and rule. Putin wants a weak Europe. \n“Brexit, I believe, plays straight into his hands. Russia wants to see Europe divided, introspective and prepared, ultimately, to play the international game by his and Russia’s rule.” Russian President Vladimir Putin (Image: POOL SPUTNIK KREMLIN) \nHe said Russia was in a weak position and wanted to avoid direct confrontations with its rivals. Instead, it aimed to influence the internal politics of opponents, said Mr Wilson. \n“Putin does not want kinetic action with NATO, but he does want us weakened, distracted and inward looking. That is why the warfare that Russia wants to adopt is hybrid. \n“It can be social, anti-democratic and economic warfare—trying, for example, to influence democratic elections. \n“From funding populist movements, such as Marine Le Pen’s Front National, now called National Rally, is it any wonder Nigel Farage sees Putin as one of his favourite leaders?” \nThe Labour MP also supported Prime Minister Theresa May’s action against Russia following the attempted murder of former Russian spy Sergei Skripal and his daughter, which included expelling 23 Russian diplomats. \nHis comments could be seen as a rebuke to Labour leader Jeremy Corbyn , who appears to believe it is still possible that the Russian Government lost control of the nerve agent used in the Salisbury attack - an option raised by the Prime Minister on Monday but ruled out by her on Wednesday, when she said it was now clear there had been “n unlawful use of force by the Russian state against the United Kingdom”. \nMr Wilson said: “The use of a chemical weapon on the streets of a city of the UK is also an attack on the principles by which we stand and they must be defended. Members of all parties in the House must declare on which side they stand. \n“This is about defending our way of life, which is internationally protected by a rules-based order that we need to preserve and which Russia seeks to undermine - from its indiscriminate military action in Syria, to the Ukraine and Crimea, to the boosting of its enhanced nuclear capabilities, to a failing economy run by oligarchs who use London as their plaything, and to the troll farms of St Petersburg, which spread news of a dubious nature throughout Europe and the US. \n“Russia is trying to shake our confidence in our way of life. Engage and beware, yes, but to give it the benefit of the doubt is ridiculous.” Read More North East MP Anne-Marie Trevelyan 'appalled' after babies buried in mass grave \nPresident Putin set out his vision of Russia’s place in the world in his Presidential address to the Russian Federal Assembly in December 2013. \nHe described Russia as standing up for “traditional values” such as traditional families and religion, in the face of Western liberal values. \nMr Putin said: “Today, many nations are revising their moral values and ethical norms, eroding ethnic traditions and differences between peoples and cultures. Society is now required not only to recognise everyone’s right to the freedom of consciousness, political views and privacy, but also to accept without question the equality of good and evil, strange as it seems, concepts that are opposite in meaning. Read More What is happening between the UK and Russia? What you need to know about the Salisbury spy poisoning \n“This destruction of traditional values from above not only leads to negative consequences for society, but is also essentially anti-democratic, since it is carried out on the basis of abstract, speculative ideas, contrary to the will of the majority, which does not accept the changes occurring or the proposed revision of values. \n“We know that there are more and more people in the world who support our position on defending traditional values that have made up the spiritual and moral foundation of civilisation in every nation for thousands of years: the values of traditional families, real human life, including religious life, not just material existence but also spirituality, the values of humanism and global diversity.” Like us on Facebook", "external_links": [], "published": "2018-03-15T17:27:00.000+02:00", "crawled": "2018-03-15T17:39:51.048+02:00", "highlightTitle": ""}