{"organizations": [], "uuid": "2c106a6cb02a011fabf6384aa40d8450059f5b1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14466172.ece/ALTERNATES/s1200/image1.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-takes-place-12-months-14465851", "country": "GB", "domain_rank": 21960, "title": "Brexit takes place in 12 months - what has already been decided and what do we know for definite?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-29T07:00:00.000+03:00", "replies_count": 0, "uuid": "2c106a6cb02a011fabf6384aa40d8450059f5b1a"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-takes-place-12-months-14465851", "ord_in_thread": 0, "title": "Brexit takes place in 12 months - what has already been decided and what do we know for definite?", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "neutral"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Seconds The withdrawal terms \nAn interim deal was struck in December on Britain’s financial settlement, the Irish border and citizens’ rights. \nAs a result, the UK will contribute to the EU budget until the end of 2020 and meet its share of commitments made in the past but not yet paid out, putting the total cost at between £35bn and £3bn. \nAlso, EU citizens living in Britain and British citizens living in the EU before exit day would be able to claim permanent residency status for themselves and their families. \nOn Ireland, the Government has committed to avoid a “hard border” with checkpoints between Northern Ireland and EU-member Ireland. \nPrime Minister Theresa May has conceded that the EU’s “backstop” proposal, in which Northern Ireland stays in a customs union with the EU post-Brexit, could be a possible solution. Read More A post-Brexit transition deal \nBritain will maintain its ties with the EU until December 2020, but will have no voting rights. \nDuring this period Britain would keep paying into the EU budget as planned, trade on the same terms and accept European rules and regulations. \nBritain will also grant any EU citizens arriving in Britain during the transition period the same rights as those arriving earlier, but it will be able to sign trade deals with countries outside the EU, which can come into force in 2021. \nMay came under fire from fishermen after agreeing to let the EU to continue to set quotas and allow European fishing vessels into British waters. Read More 'We want a hard Brexit' - North East MP signs letter setting out demands to Theresa May Future relations between the UK and the EU \nTheresa May has said the UK will leave the European single market and customs union as to remain part of them would require Britain to maintain free movement of workers, be subject to EU laws as well as giving up the right to strike trade deals with other countries. Like us on Facebook", "external_links": [], "published": "2018-03-29T07:00:00.000+03:00", "crawled": "2018-03-29T07:20:19.033+03:00", "highlightTitle": ""}