{"organizations": [], "uuid": "4acfe25c7d4225e5aa6d2ac057649d60baef9867", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13442064.ece/ALTERNATES/s1200/morrisonsJPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14403907", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Morrisons posts boost in profits as turnaround continues", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-14T10:30:00.000+02:00", "replies_count": 0, "uuid": "4acfe25c7d4225e5aa6d2ac057649d60baef9867"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14403907", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Morrisons posts boost in profits as turnaround continues", "locations": [], "entities": {"persons": [{"name": "coreena ford zara", "sentiment": "negative"}, {"name": "zara", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "morrisons", "sentiment": "negative"}, {"name": "inditex", "sentiment": "negative"}, {"name": "petards", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nNEW YORK: the Dow Jones closed down 171.6 at 25007.0. 9.22 Coreena Ford Zara owner Inditex to share out bonus pool worth £499m \nZara owner Inditex has posted a 7% rise in net profits to 3.37 billion euros (£3 billion) for 2017, saying global like-for-like sales grew 5%. \nInditex said it would share out a 562 million euro (£499 million) bonus pool among 88,000 staff worldwide, including a 42 million euro (£37.3 million) extra payout under its profit sharing plan. Zara staff after in for a bonus, thanks to good results for its owner Inditex 9.13 KEY EVENT Gateshead's Petards boosts order book to £18m \nGateshead tech firm Petards has posted a 30% leap in pre-tax profits following a strong year across all its markets. \nThe Team Valley business,which employs more than 100 people, develops, supplies and maintains security and surveillance technologies used by the rail, defence and emergency service sectors. \nThe company has now posted full year results for 2017, revealing an order book worth £18m, total revenues up 2% to £15.6m and pre-tax profit up 30% to £1,205,000. \nWith the addition of Stadler, Petards’ customer list now includes six of the world’s top ten train builders and exports have comprised over one third of revenues for a second consecutive year. \nRaschid Abdullah, chairman, said: \nThe Group’s order book at 31 December 2017 was over £18 million, of which £12 million is expected to be taken to revenue during 2018. We are also engaged in on-going discussions for new projects across all areas of our business, many of which our customers have themselves already been awarded. This coupled with a strong balance sheet provides the board with confidence for the Group’s prospects in 2018 and beyond. The Petards factory in Team Valley (Image: Google maps) 9.06 Coreena Ford The Co-operative Bank narrows losses \nThe Co-Operative Bank has reported an adjusted pre-tax loss of £140.3m for full year 2017, compared to a loss of £477.1m a year earlier. It thanked a drop in operating costs for helping narrow its annual loss, which included lower spending on staff. \nChief executive Liam Coleman said: “We concluded 2017 demonstrating a resilient business performance in our priority markets of mortgages and savings, despite the uncertainties earlier in the year. \n“The completion of the recapitalisation in September has transformed our capital position and provides a solid platform to deliver our future plans. “We are grateful to our investors for their continued support and to our customers for their loyalty during a challenging year for the Bank.” \nMr Coleman added that the bank’s priority now is to continue to reduce its losses and swing to a profit. \n“Like all retail banks we are operating in a difficult marketplace and we expect increasing competition in the mortgage market moving forward. \n“Our distinctive ethical brand, which we know is greatly valued by customers, continues to represent a clear point of difference for us and our access of the Bank of England’s Term Funding Scheme (TFS) ahead of its closure together with our recent securitisation of the Optimum book means we have a strong funding position. \n“We must focus on using that in the most effective way to support future growth as we implement our plan to build a successful, sustainable Co-operative Bank.” A co-operative bank (Image: PA) 9.00 Coreena Ford Popular Gibside Hotel in Gateshead is put up for sale with £2.9m price tag \nA popular family-run hotel in Gateshead has been put up for sale with a £2.9m price tag. \nThe Gibside Hotel in Whickham has been run by the same family since it was built in the 1980s and is now run as a Best Western hotel. \nThe freehold of the 43-bed hotel has now been placed on the market, with Newcastle leisure specialists Christie & Co looking after the sale. \nMarketing materials for the hotel detail its popularity within the commercial and tourist trade, providing a base for weddings, parties and functions. \nGood food and beverage trade is cited through weddings and functions, in its large bar, the Bowes Suite function room, Ravensworth conference room and 150-cover restaurant. \nA Christie & Co spokesman said: “The Gibside Hotel has been owned by our clients for over 30 years and in that time, has been operated as a family-run hotel which has provided our clients with an excellent standard of living.” The Gibside Hotel in Whickham which is up for sale (Image: christie & Co) 8.53 Coreena Ford Workwear Express creates more than 30 new jobs amid strategy to reach £50m turnover \nA North East workwear maker is ploughing £3.5m into the business to drive forward major growth plans and create new jobs. \nWorkwear Express was first launched in 1990 by Andrew Ward and it has been manufacturing uniforms, personalised workwear and promotional clothing ever since, kitting out the staff of a host of big name firms. \nHaving started out with a single-headed embroidery machine on a kitchen table, the firm is now based at Belmont Industrial Estate in Durham and employs around 170 people. \nNow Mr Ward plans to more than double the firm’s turnover from £22m to over £50m by 2023, through a projected 30% year-on-year growth. \nAs part of the five-year plan, Workwear Express has bought an additional 40,000 sq ft building on the site, which will link with its existing 25,000 sq ft base, and house advanced new machinery and modern office space. \nThe expansion will support the creation of more than 30 jobs this year, aking headcount to more than 200. \nCurrently growing by 1,200 new customers every week, Workwear Express has more than 100,000 active customers across its three divisions – e-commerce, key accounts and international – across sectors including healthcare, industrial and hospitality. \nMr Ward said: “Workwear Express is set to become the biggest modern facility of its kind in the UK and this multi-million pound investment is a strategic decision to support our exciting growth plans. We recognised a need to expand our premises in order to increase capacity to meet the demand for our products and services, particularly as we expand our operations further overseas. Andrew Ward in Workwear Express' new factory space (Image: Workwear Express) 8.45 Coreena Ford Prudential to split off UK and European business \nInsurance giant Prudential has announced plans to split its UK and European unit from the rest of the business, as it thanked its Asian operations for helping drive a 6% rise in group profits for 2017. \nThe decision to separate M&G Prudential comes just a year after it was created through the combination of Prudential’s life and asset management operations in the UK and Europe, and follows an in-depth review by the company. \nThe move will create two separately-listed companies, with the remaining Prudential business comprising its Asian, US and African operations and headed by the group’s chief executive Mike Wells. \nM&G, described by Prudential as one of the leading retirement and savings businesses in the UK and Europe, will be headquartered in the UK, led by its own chief executive John Foley . \nPrudential said it would look at ways of “realising efficiencies” across the two businesses following the split, and had already agreed to sell a £12 billion book of UK annuities to Rothesay Life. 8.40 Coreena Ford Globetrotting Sunderland children's business in running for parenting award \nA creative company which takes children on an educational journey around the world has been shortlisted for an award by MadeforMums , the UK’s fastest growing parenting community. \nGeo Journey aims to inspire children to learn about the world throughly monthly parcels, starting with an initial explorer kit of a suitcase, travel journal, passport map and activities. \nThrough the Sunderland company’s monthly subscription, youngsters are then sent monthly packages – addressed to them personally – from Geo Journey’s characters Geo the owl and his best friend Atlas the puppy, who tell children about countries they are visiting. \nThe firm is the brainchild of Christina Armstrong, who initially developed the idea as a way to teach her seven-year-old daughter Willow and four-year-old son Roman. \nNow the firm, based at the Business Innovation Centre in Sunderland, has been highlighted by MadeForMums, the largest parenting review website of its kind, which runs an annual competition to seek out the best products, brands and services for children and parents. \nEven if Geo Journey doesn’t win, making the shortlist is set to bring benefits, not least of all because the MadeForMums website attracts 12m page views a month which could lead to extra sales. \nLast year’s competition led to 596 entries and 120,000 votes, generating £130,000 worth of product purchases for those on the shortlist. Geo Journey sends parcels to children every month to teach them about the world in an imaginative way (Image: Sara Hazeldine) 8.35 Coreena Ford Pork pies scrapped from inflation basket \nThe humble pork pie has been ditched from Britain’s inflation basket and women’s exercise leggings have been added to the mix, underscoring the nation’s appetite for keeping fit. \nThe Office for National Statistics (ONS) said action cameras - such as GoPros - and children’s soft play areas have also been included in the goods and services basket in a sign that the population is spending more on keeping active. \nHowever, digital camcorders have been stripped out due to the rise of smartphones, while the digital revolution has also caused TV receivers to be replaced by digital media players made by Apple, Google and Amazon. \nONS senior statistician Philip Gooding said: \n“Every year we add new items to the basket to ensure that it reflects modern spending habits. \n“We also update the weight each item has to ensure the overall inflation numbers reflect shoppers’ experiences of inflation. \n“However, while we add and remove a number of items each year, the overall change is actually quite small. This year we changed 36 items out of a total basket of 714.” \nRaspberries, quiche, ready-made mashed potato, body lotion and high chairs have also made their way into the basket, which is used to calculate the cost of living. However, pork pies have been removed as an individual item and will now be covered as a “meat-based snack” alongside sausage rolls and scotch eggs. Edam cheese, peaches and nectarines, leg waxing and ATM charges have been taken out of the basket. \nNightclub admissions and bottles of lager bought in nightclubs have also been given the boot to reflect the sharp fall in the number of nightclub venues across the country. \nThe list is used to calculate the Consumer Prices Index including owner occupiers’ housing costs (CPIH), the ONS preferred measure of inflation. The Consumer Prices Index (CPI) rate of inflation was 3% in January, unchanged from December, while CPIH held steady in January at 2.7%. The pork pie - no longer in Britain’s inflation basket 8.34 FTSE 100 and pound latest \nThe FTSE-100 index at 8.15am was up 11.75 at 7150.53. \nThe pound at 8am was 1.3960 dollars compared to 1.3990 dollars at the previous close. \nThe euro at 8am was 0.8876 pounds compared to 0.8866 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.30 KEY EVENT Morrisons' bounce back continues amid rising profits and sales \nDirectors at supermarket Morrisons are celebrating another strong year after ringing up a hike in annual sales and profits as its turnaround gathers pace. \nThe chain posted a 16.9% leap in bottom line profits to £380m for the year to February 4. \nOn an underlying and comparative 52-week basis, pre-tax profits rose 9.5% to £374m. \nThe profit leap comes after group like-for-like sales lifted 2.8% over the year, including a 2.3% rise online and in its supermarkets. \nIt marks the group’s ninth quarter in a row of rising sales. \nChief executive David Potts said: “We have made good progress in our turnaround.” \nBut he added the market remains “very competitive” and said the group would continue to prioritise offering customers “value for money”. \nThe group also cheered investors with a 4p a share special dividend payout, seeing the total full year dividend nearly double to 10.09p a share. \nMorrisons said it saw more transactions - up 2% in the fourth quarter - but with shoppers buying 3.7% fewer items. \nMr Potts said inflation, which had soared in 2017 due to the Brexit-hit pound, had “tapered” off and would continue to ease back in 2018. \nBut he said the group had held off hiking prices to remain competitive. \n“The priority is becoming more competitive and looking through that (inflation) as we have to be more competitive to continue with the recovery of the firm,” he said. \nSupermarkets across the board have had to increase shop prices as costs have risen since the pound’s collapse following the Brexit vote. A Morrisons store (Image: Mikael Buck/Morrisons/PA Wire) More On ", "external_links": [], "published": "2018-03-14T10:30:00.000+02:00", "crawled": "2018-03-14T12:24:04.041+02:00", "highlightTitle": ""}