{"organizations": [], "uuid": "6a4b451671d11f22a391cac0ca3f77d6e273be10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12343380.ece/ALTERNATES/s1200/Grainger-Games-GV.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/future-grainger-games-unclear-retail-14437157", "country": "GB", "domain_rank": 21960, "title": "Future of Grainger Games unclear as retail crisis engulfs Newcastle firm", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-20T19:40:00.000+02:00", "replies_count": 0, "uuid": "6a4b451671d11f22a391cac0ca3f77d6e273be10"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/future-grainger-games-unclear-retail-14437157", "ord_in_thread": 0, "title": "Future of Grainger Games unclear as retail crisis engulfs Newcastle firm", "locations": [], "entities": {"persons": [{"name": "grainger", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "stephen bowyer", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "nun street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}], "organizations": [{"name": "business future of grainger games", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "grainger market", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Future of Grainger Games unclear as retail crisis engulfs Newcastle firm The North East video game retailer said it is in talks with a number of parties over the \"future of the business\" Share Grainger Games, Nun Street, Newcastle upon Tyne (Image: Newcastle Chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe future of Grainger Games has been thrown into doubt after the company had vital credit facilities slashed by lenders spooked by the recent string of high street failures. \nStephen Bowyer, managing partner of the North East video game chain, has said he was shocked to learn that Grainger’s lending facilities were being cut, and said the company was now in talks with a number of parties regarding the “future of the business”. \nThe company, which started as a market stall in Newcastle’s Grainger Market, has grown over the last 20 years to become the UK’s leading independent computer game specialist. \nIt has 68 stores operating between Berwick and Derby and employs nearly 400 people. \nMr Bowyer said: “Our trading has been strong in the period through Christmas with significant improvement against the previous year. In January 2018 we secured long working capital facilities bucking the market trend to support our successful diversification strategy. Grainger Games 'Be More Geek!' range (Image: Grainger Games) \n“However, confidence in UK high street retail has been at an all-time low which has been further impacted by recent retailer failures. \n“On the back of this, we have very recently been notified that Grainger has had or will have certain supplier credit limits cut or removed. This has come as shock to us all and presents a significant operating challenge driven by factors outside our control. Read More Carpetright and Claire's Accessories hit by crisis on the High Street \n“Grainger has a strong brand across the North of England with a well known value proposition and diverse marketing offering. We are working tirelessly with our advisers to explore all options and are in dialogue with a number of interested parties regarding the future of the business.” \nGrainger, which is headquartered in Longbenton, North Tyneside, operates 24 shops in the North East. \nLast year Grainger Games Holdings Limited made an operating loss of £1.3m after its turnover dipped to £48.7m. In 2016 the firm had reported an operating loss of £223,000 and revenues of £51.1m. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAt the time the company said it had suffered after key software franchises had underperformed. Its pre-owned business also suffered as fewer people opted to trade in their old products. \nHowever, the retailer has made an effort to adapt to the changing market and has said that its digital sales were on the rise. It has also looked to diversify its product range by selling merchandise and other complementary items. \nThe UK high street has been plagued by repeated bad news in the last few weeks after a number of retailers revealed they were filing for administration. Toys R Us was the first national firm to go after it filed for bankruptcy protection in the US and announced it was closing all of its UK stores. Read More Eldon Square and Metrocentre sale threatened by French firm's rival deal \nShortly after electronics retailer Maplin entered administration putting 2,500 jobs at risk across the country. The chain said it had struggled to recover from the Brexit hit pound and a weak “consumer environment”. \nClaire’s Accessories also filed for bankruptcy protection in the US after it built up debts of $1.9bn. The fate of its UK stores remains unclear. Like us on Facebook", "external_links": [], "published": "2018-03-20T19:40:00.000+02:00", "crawled": "2018-03-20T20:53:16.018+02:00", "highlightTitle": ""}