{"organizations": [], "uuid": "a6d2d606978091c1430cce2e2df11333ac94e38a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1362293.ece/ALTERNATES/s1200/Karen-Smart.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/stansted-airport-director-karen-smart-1362319", "country": "GB", "domain_rank": 48128, "title": "Stansted Airport director Karen Smart is new boss of East Midlands Airport", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-20T15:10:00.000+02:00", "replies_count": 0, "uuid": "a6d2d606978091c1430cce2e2df11333ac94e38a"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/stansted-airport-director-karen-smart-1362319", "ord_in_thread": 0, "title": "Stansted Airport director Karen Smart is new boss of East Midlands Airport", "locations": [], "entities": {"persons": [{"name": "karen smart", "sentiment": "negative"}, {"name": "andy cliffe", "sentiment": "negative"}], "locations": [{"name": "east midlands airport stansted airport", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "stansted airport", "sentiment": "none"}, {"name": "stansted", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "manchester airports group", "sentiment": "none"}, {"name": "ms smart", "sentiment": "none"}, {"name": "midland expressway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stansted Airport director Karen Smart is new boss of East Midlands Airport Andy Cliffe leaving the airport to join M6 Toll road operator Midland Expressway Share Karen Smart will replace Andy Cliffe at the Castle Donington airport next month Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA senior member of the Stansted Airport team has been appointed as the new managing director of East Midlands Airport. \nKaren Smart will replace Andy Cliffe at the Castle Donington airport next month. \nShe is currently director of landside operations at Stansted. \nAndy Cliffe has spent 19 years with the parent company of both airports Manchester Airports Group (MAG), and been in charge of East Midlands for five years. \nHe is leaving the business to become the chief executive of Midland Expressway, the company responsible for operating the M6 Toll road, in the West Midlands. \nMs Smart will lead a team of more than 500 employees at the international passenger airport which is also the UK’s biggest pure cargo airport. Andy Cliffe, managing director of East Midlands Airport is off to a new job \nShe said: “It’s a hugely exciting time in the aviation industry and I feel privileged to be taking on the role of MD at East Midlands Airport. \n“I’m looking forward to continuing the drive to attract new airlines to serve the vibrant region while further improving the customer experience.” \nMs Smart joined MAG in 2014 and during her time with the business has also served as customer services and security director at Stansted. \nPrior to joining the airports group she spent several years at the service provider Serco and had a distinguished career in the RAF. \nDuring his time running East Midlands Airport, Andy Cliffe has been responsible for increasing passenger numbers, transforming the terminal facilities and overseeing a big runway redevelopment programme. \nEast Midlands Airport plays a big role in driving the UK’s economy, and is the country’s biggest airport for dedicated cargo traffic. \nMr Cliffe recently told the Mercury he remained confident of expansion over the coming years, despite the uncertainties of Brexit. \nThe Castle Donington airport wants to double passenger numbers by 10 million a year within 20 years or less. \nIt also hopes to triple freight shipments to one million tonnes a year within 10-20 years. \nFreight carrier UPS was recently given permission to build a £114 million base there. \nAgent Aecom told North West Leicestershire District Council the company wanted to build an “airport gateway logistics centre” on a 28.5-acre plot. \nUPS has said the scheme could create more than 1,000 jobs. \nMAG chief executive Charlie Cornish said: “Andy has done a tremendous job in driving East Midlands Airport forward as a vital piece of UK infrastructure. Read More \n\"The airport provides a valuable service to leisure and business passengers across the region and through its significant cargo operation is responsible for fuelling the national economy.” Read More \n“Karen Smart is an exceptional leader and with her strong track record I’m sure she will build on the great foundations that exist at East Midlands Airport.” Like us on Facebook ", "external_links": [], "published": "2018-03-20T15:10:00.000+02:00", "crawled": "2018-03-20T15:18:58.015+02:00", "highlightTitle": ""}