{"organizations": [], "uuid": "25e435ceecc5794d8cd2fedc5d449ecb1e6b6b38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14165720.ece/ALTERNATES/s1200/JS140672252-1.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14456387", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: US firm Dana increases cash offer for GKN", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-26T10:30:00.000+03:00", "replies_count": 0, "uuid": "25e435ceecc5794d8cd2fedc5d449ecb1e6b6b38"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14456387", "ord_in_thread": 0, "title": "Business Breakfast LIVE: US firm Dana increases cash offer for GKN", "locations": [], "entities": {"persons": [{"name": "dana", "sentiment": "negative"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "gkn", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "melrose industries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford JD Sports to make US market debut \nJD Sports will make its US market debut after agreeing to buy up American sportswear company Finish Line in a “transformational” $558m (£396m) deal. \nIt will mean taking over 556 Finish Line branded retail stores across 44 US states and Puerto Rico, where it employs 3,700 full-time and 9,300 part-time staff. While the outlets are expected to stay under Finish Line branding, JD is planning to trial a number of its own stores across the US following the acquisition. JD’s executive chairman Peter Cowgill said: “We are extremely excited to be joining up with Finish Line, a well-established US operator. “The acquisition represents an excellent opportunity for JD to establish its market leading multi-brand proposition in the world’s largest athleisure market. “It immediately offers a major presence in the US, a clear next step to further increase our global scale.” He added: “This is a landmark day for JD and will be transformational for the business.” \nJD will also benefit from Finish Line’s relationship with Macy’s, serving as its exclusive retailer of athletic shoes both online and in-store where it operates 375 branded and 188 unbranded concessions. A JD Sports store Coreena Ford Newcastle's Performance Horizon named top tech firm in the North and Scotland \nEleven North East businesses have been named in a list of the 100 fastest growing tech companies in the North, cementing the region’s reputation as a hub for digital firms. \nNewcastle’s Hedgehog Lab was revealed as the fastest growing tech firm in the North East, placing ninth overall in the list compiled by tech investment firm GP Bullhound. \nCar battery manufacturer Hyperdrive Innovation were also found to be one of the fastest growing businesses in the North along with digital marketing firm Redu Group. \nVirtual reality specialist ZeroLight also scored highly coming in at 24th on the list. The company has won a number of major contracts to use its VR tech to promote and sell cars. \nNewcastle firms Performance Horizon and Opencast Software were also named on the list as were Bede Gaming, Aspire Technology Solutions, Waterstons, Visualsoft, and research company Everything Different. \nHugh Campbell, managing partner of GP Bullhound, said: “We have seen the Northern region’s technology sector grow extensively as local businesses are scaling to reach the global market. \n“Companies such as Peak AI and Sykes are a testament to the potential of Northern businesses to become international tech giants – we expect to see many more local companies with great ideas grow to reach the global technology landscape.” \nIn total, tech companies across the North of England and Scotland generated £4.5bn during 2017. The figure is more than double the £1.9bn generated in 2016 L-R: Paul Fellows, Alistair Wyse and Chris Blaxall of Performance Horizon (Image: Newcastle Journal) 9.04 Coreena Ford New office builds fall by half in 10 years \nThe number of new offices being built has fallen by more than half since the financial crisis in 2008, new research reveals. \nAround 2,300 applications for new office buildings were approved last year, down from 5,200 a decade ago, said Lendy. \nThe lending platform said the fall showed changing work patterns across the UK, with more flexible arrangements such as working from home. Shared workspaces and increasing use of technology has also reduced the need for employees to have their own dedicated workspace, said the report. \nLiam Brooke, co-founder of Lendy, said: “Modern ways of working mean that offices are no longer as essential as they may have been in the past. \n“Formerly, rising employment figures may have signalled a requirement for more offices. \n“However, there is now less need for offices as employees can, in many cases, work just as effectively from home or shared workspaces.” Plans are in for this office building in Gateshead - the first for almost 10 years in that area. (Image: Ryder Architecture) 9.00 Coreena Ford Spirit lovers offered chance to buy first ever Durham Whisky \nWhisky lovers are being offered the chance to be among the first to own the first batch of whisky being produced at a North East distillery. \nFans of a spirit are being offered a chance to own a bottle, case or cask of Durham Whisky, which is being produced by Durham Distillery. \nThe drink will be available from 2021 and will be sold in a variety of packages named after the city’s famous bridges, such as Prebends and Elvet. \nThe whisky will be the first created by the distillery, which started life producing gin before also adding vodka to its range. \nHead distiller Jessica Tomlison said: “Our venture into the world of whisky is a huge step for the company and as a regional first, we want to create a product that the North East can be proud of and enjoyed here in our hometown as well as across the globe. \n“We have been working hard to get our package offering just right with options to suit all audiences, from a whisky connoisseur who can’t wait to sample one of the first bottles, to venues with a desire to invest in a higher volume to stock behind the bar. We want these to remain exclusive so there is limited availability.” Jessica Tomlinson, head distiller at Durham Distillery (Image: Unknown) 8.59 Coreena Ford Optimism nosedives in financial sector \nOptimism in the financial sector has fallen for the fourth quarter in a row, even though work and employment has increased, a study shows. \nResearch by the CBI found that confidence has surpassed the gloom that hit the business during the financial crisis a decade ago. \nA survey of 81 firms revealed that sentiment in banking had deteriorated, while the mood among investment managers fell for the first time in over a year. Rain Newton-Smith, the CBI’s chief economist, said: “Financial services firms have performed well over the last three months, with business volumes and employment on the up and beating expectations. \n“But there is no escaping the rather large elephant in the room. Optimism has been flat or falling for over two years now - that’s nine quarters - something not seen since the financial crisis. \n“The Brexit transition that has been agreed between the UK and the EU will give financial services firms more reason to pause contingency plans, and to invest in the UK, but the Government must push energetically for the protection, maintenance and development of our world-beating financial services sector.” \nAndrew Kail, head of financial services at PwC, which helped with the report, said: “We are seeing a contradiction between a consistent trend of strong financial performance and weak levels of confidence about the future. The key question is: what looms that is worrying companies in the sector?” Rain Newton-Smith, director of economics at the CBI (Image: Handout) 8.50 Coreena Ford Casual dining sector faces a 'restructuring wave', KPMG warns \nThe UK casual dining sector will endure a wave of closures in the coming months, with a quarter of restaurant groups already suffering severe financial stress. \nThe crisis ripping through the sector will continue long into 2018, according to KPMG, with company voluntary arrangements (CVA) proving a popular choice on the restructuring menu. \nHigh street chains Byron burger, Jamie’s Italian and Prezzo have all embarked on CVAs since the start of the year, allowing them to close loss-making stores and secure rent discounts. \nFigures from KPMG found that 25% of companies in the casual dining space had booked an operating loss at least once over the last two quarters. \nIt comes as restaurants struggle to stomach the cocktail of pressures engulfing the industry, as margins are eaten into by rising business rates, the National Living Wage, the Apprenticeship Levy and persistently high inflation. \nKPMG partner Will Wright said cash-squeezed consumers are overloaded with options of where to eat and tend to choose “alternative ‘experiential’ dining experiences” over “familiar fare”. \nHe said: “We certainly anticipate this wave of restructuring to continue over the months ahead, as stakeholders take measures to ‘right size’ their estates to a more profitable core, with the ultimate aim of safeguarding their long-term futures.” \nKPMG analysed 125 casual dining companies with revenues of £15 million or more. It found that 78% of industry players had seen their net debt swell over the past two quarters. \nOf those that added to their debt pile, a fifth saw a decrease in their cash balance. \nMargins were also coming under pressure, with 69% of firms working with operating margins of under 5%. \nMr Wright added: “With profit margins being squeezed and debt burdens increasing, and all economic indicators pointing to signs that things aren’t going to improve any time soon, restaurant businesses are looking for cost cutting measures through operational and financial restructuring, including negotiations with lessors and in some cases, considering the need for a CVA.” Jamie's Italian in Newcastle - the firm is one of several to enter into CVAs (Image: Newcastle Chronicle) 8.45 KEY EVENT De La Rue vows to fight decision to print UK passport abroad \nThe boss of speciality print firm De La Rue has vowed to fight a Government decision to make the UK passport abroad after meeting staff on Tyneside whose jobs have been put in jeopardy by the move. \nMinisters have defended the selection of Franco-Dutch firm Gemalto to make the post-Brexit blue passport, saying the choice will save taxpayers about £120m. \nBut the Government has come under fire over the decision after it put at risk 200 jobs at the De La Rue plant in Gateshead, which has the current contract to produce the UK passport. \nThe row has been heightened by the Government’s announcement in December that the UK passport would change from the standard EU burgundy colour to a blue and gold design when the EU comes out of Europe, billing the new passport as an “expression of our independence and sovereignty”. \nNow Martin Sutherland, CEO of De La Rue, has vowed to fight the contract decision, with the company likely to submit an appeal next week and working on grounds for a judicial review. \nAfter a visit to the Gateshead plant, he said: “I have met the team in Gateshead today who are disappointed about the Government’s decision. \n“After providing such a fantastic service for the last nine years, it is a real blow for them. \n“I have pledged that we will continue to fight to get this decision overturned so that the production of the British passport stays here in the UK where it belongs and is made by the great team here in Gateshead.” \nDe La Rue, which employs around 600 people at Gateshead and also prints currency for a number of foreign Governments, has around two years of the current passport contract. The De la Rue plant in the Team Valley. The company has lost out on a big contract to a french company to produce the blue passports after Brexit (Image: newcastle chronicle) 8.40 Coreena Ford Co-op Bank bosses assure that hedge fund investors not heading for exit \nThe hedge funds which saved The Co-operative Bank from collapse last year are not running for the exit, its bosses have assured, adding investors are “supportive” of the bank’s current strategy. \nChief executive Liam Coleman said there was a precedent for Co-op Bank shareholders to stay on for the long-term, noting that some of its “significant” investors had been involved since 2013. \nWhen asked how long hedge funds might hold out, Mr Coleman said: “Those shareholders, those hedge funds, have remained very much committed to the bank and supportive of the bank across that period of time ... they’ve been material holders across a period of time, so certainly not in the short term.” \nHe added: “They’re supportive of what the bank has done and they’re supportive of what the bank is trying to do.” \nDennis Holt - who passed on the reins as chairman to Robert Dench last week - said a potential sale or flotation was not even under discussion at the bank’s recent meetings. \n“Any thoughts on this would be purely speculation at this stage and I would assure you that the item doesn’t even feature on the regular board agenda at this phase,” he said. \nThe comments come nearly half a year since The Co-op Bank struck a £700m rescue deal that saved it from potential collapse. 8.34 FTSE and pound latest \nThe FTSE-100 index at 8.15am was up 23.54 at 6945.48. \nThe pound at 8am was $1.4163 compared to $1.4148 at the previous close. The euro at 8am was 0.8730 pounds compared to 0.8737 pounds at the previous close. 8.30 KEY EVENT Engineering giant GKN receives increased offer from US firm \nUS firm Dana has upped its cash offer for GKN’s automotive business as the UK engineering giant looks to stave off a hostile bid from Melrose Industries. Dana, which specialises in car part manufacturing, said it had “improved the terms of its agreed combination” by upping the cash offer by 8.6% or $140m (£100m). \nIt brings the total cash consideration to $1.77bn (£1.28bn). \nIt will also double the size of its share repurchase programme to $200m (£145 million), helping sweeten the overall deal which was previously valued at around £4.4 billion. \nGKN welcomed the announcement, which will see its shareholders own more than 47% of the combined company that is set to be listed on both the New York Stock Exchange and London Stock Exchange. \nIt said £700 million would be returned to shareholders “as soon as practicable” after the deal is completed. \nGKN chairman Mike Turner said: “This transaction, which along with Project Boost was initiated prior to the Melrose bid, offers by far the best strategic route forward for GKN Driveline. \n“The challenges and opportunities of electrification mean that consolidation is required. By moving now, the Dana-GKN Driveline combination will be strongly positioned to be a global leader in this field.” \n“We believe that Melrose would find it extremely difficult to create equivalent value in the future from GKN Driveline if its offer were to be successful.” \nThe announcement comes just days before GKN’s fate could be sealed as part of a shareholder vote over an £8.1 billion bid for the British engineering firm by turnaround specialist Melrose. \nGKN investors have until 1pm on March 29 to cast their ballots on the controversial deal. GKN has doggedly rejected Melrose’s advances, with chief executive Anne Stevens describing Melrose’s takeover as “high-risk” and the offer not coming close to reflecting true value. The GKN headquarters", "external_links": [], "published": "2018-03-26T10:30:00.000+03:00", "crawled": "2018-03-26T10:37:08.001+03:00", "highlightTitle": ""}