{"organizations": [], "uuid": "42a1096d09ae0a5b8e819a06f60abe1eb9e4b506", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article431246.ece/ALTERNATES/s1200/34697377.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/leicester-city-reveal-record-925m-1289834", "country": "GB", "domain_rank": 48128, "title": "Leicester City reveal record £92.5m profit off the back of Champion's League run", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-02T18:48:00.000+02:00", "replies_count": 0, "uuid": "42a1096d09ae0a5b8e819a06f60abe1eb9e4b506"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/leicester-city-reveal-record-925m-1289834", "ord_in_thread": 0, "title": "Leicester City reveal record £92.5m profit off the back of Champion's League run", "locations": [], "entities": {"persons": [], "locations": [{"name": "leicester city", "sentiment": "none"}, {"name": "invalid email  leicester city", "sentiment": "none"}], "organizations": [{"name": "athletic madrid", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "city", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicester City reveal record £92.5m profit off the back of Champion's League run The Champions League added £70m to club’s bottom line last season Share Click to play Tap to play The video will start in 8 Cancel Play now Get Business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nLeicester City’s amazing Champions League run helped the club post record profits last season. \nReaching the quarter finals of the world’s greatest club competition pushed City’s pre-tax profits up to £92.5 million. \nThings could have been even better if the club hadn’t narrowly missed out on the semi-finals after losing 2-1 on aggregate to Athletic Madrid. \nLast year’s profits dwarfed the £16.4 million made in 2015/16 – the season they were crowned Premier League champions . \nAccounts seen by the Leicester Mercury show the Champions League added £70million to the club’s bottom line last season. \nTV rights from the likes of BT and Sky were up £25million to £120.7million thanks to a new three year Premier League deal. \nChampions League fixtures boosted gate receipts by £5million to almost £16.5million, while commercial sales – things like club shirts, clothes, scarves and memorabilia – were up more than £2million to £9.4million. Jamie Vardy meets Mathias Jorgensen for the first time, in Copenhagen last November (Image: Jonathan Nackstrand - AFP/Getty Images) \nIt all meant total club turnover last season reached £233million – almost £100million up on a year earlier. \nCity said today that much of the extra profit had been pumped back into the business and squad. \nAlthough talk of extending the 32,000 capacity King Power Stadium has gone quiet, the club is currently working on £80million plans for a new training ground between Loughborough and Melton. \nAs in past years the club did not pay a dividend to the Thai owners. \nUnder owners the Srivaddhanaprabha family and their King Power Group of companies, the club believes reinvestment will be a “catalyst for growth and its pursuit of further success”. Ex-manager Craig Shakespeare celebrates with Danny Drinkwater after the Champions League match between City and Sevilla (Image: Plumb Images) \nLeicester City chief executive Susan Whelan said: “Fundamental to that legacy is the commercial consolidation of the opportunities success has afforded the club. \n“This allows us to make further long-term investments in outstanding players and key personnel – infrastructure to strengthen our operations and services; and world-class facilities such as our proposed new training facility in Charnwood – all of which will aid the club’s continued growth for generations to come. \n“As with the on-pitch achievements of which these financial results are a consequence, we remain realistic about the immediate likelihood of them being repeated, but are determined to make sure their impact strengthens our aspirations and belief in the future for Leicester City Football Club and our consistent growth and success on and off the pitch.” LCFC figures for the 2016/17 season (2015/16 in brackets) Turnover: £233m (£128.7m) Profits from player sales: £38.8m (£10.8m) Estimated market value of squad: £305.1m (£236.3m) Investment in player registrations: £101.9m Average league attendance: 31,893 (32,021) Number of players: 50 (52) Other staff: 202 (171) Casual matchday staff: 594 (555) Wages and salaries: £92.3m (£68.8m) Total staff costs including pensions and national insurance: £112.5m (£80.3) Broadcasting revenues: £120.7m (£94.7m) Sponsorship and advertising: £14.25m (£14.43m) Gate receipts: £16.5m (£11.6m) Other operating income: £2.1m (£850,000) King Power Stadium value: £45.8m Charitable donations: £1.28m (£2.33m) including £1m to University of Leicester \nThe financial results showed the club made almost £39million last season from the sale of players such as N'Golo Kanté to Chelsea , Jeffrey Schlupp to Crystal Palace and Ritchie De Laet to Aston Villa. \nThat compared to £10.8million a year before and helped fund a £102 million investment in new players such as Islam Slimani , Wilfred Ndidi and Ahmed Musa . \nThe figures suggest the club valued the squad that year at £305million, up from £236million. Riyad Mahrez and Islam Slimani boarding a flight to Madrid for the Champions League quarter-final (Image: Photo by Plumb Images/Leicester City FC via Getty Images) \nBrexit also had an impact on the figures. \nThe drop in the value of sterling after the EU referendum meant City lost £2.6million on foreign exchange rates – although that was offset by exchange rate gains from Champions League cash. \nThe season saw Claudio Ranieri – who led Leicester to Premier League victory – sacked, to be replaced by his deputy Craig Shakespeare. Read More ", "external_links": [], "published": "2018-03-02T18:48:00.000+02:00", "crawled": "2018-03-02T19:22:43.000+02:00", "highlightTitle": ""}