{"organizations": [], "uuid": "8f2246e6403740fa0b8a24f44c8a721688a8cc1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14350077.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/7000-nissan-workers-could-lose-14349940", "country": "GB", "domain_rank": 21960, "title": "7,000 Nissan workers could lose their jobs if Theresa May gets Brexit wrong", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-01T02:01:00.000+02:00", "replies_count": 0, "uuid": "8f2246e6403740fa0b8a24f44c8a721688a8cc1c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/7000-nissan-workers-could-lose-14349940", "ord_in_thread": 0, "title": "7,000 Nissan workers could lose their jobs if Theresa May gets Brexit wrong", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "house of commons business committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News 7,000 Nissan workers could lose their jobs if Theresa May gets Brexit wrong A detailed inquiry into the UK's car industry has concluded it could be destroyed by a 'no-deal' Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA ‘no-deal’ Brexit could destroy the car industry and put hundreds of thousands of jobs at risk, a major inquiry has warned. \nEven quitting the European Union with a trade deal in place can only hurt rather than help the automotive sector, which directly or indirectly employs 900,000 people across the UK. \nThe findings from the cross-party House of Commons Business Committee reveals the threat to 7,000 jobs at Nissan’s car plant in Sunderland , as well as thousands of others in the carmaker’s supply chain. \nMPs said the UK must stick as closely as possible to existing EU rules and institutions “in order to give volume car manufacturing a realistic chance of surviving in this country”. \nCrucially, the inquiry found that keeping access to the EU single market is far more important to car manufacturers in the UK than signing new trade deals with other countries. \nIt follows warnings from the Society of Motor Manufacturers and Traders, which represents the car industry, that failing to agree a free trade agreement with the EU would result in a £4.5bn drop in exports by UK carmakers. A Nissan car dealership (Image: Andrew Matthews/PA Wire) \nAnd there is also a major threat from the possible introduction of what are called “non-tariff” barriers, which would mean delays and bureaucracy as car parts and vehicles are transported across borders. \nAt the moment, there are very few delays because of the UK’s membership of the EU’s Customs Union. \nCarmakers would suffer enormously if any delays are introduced, because they import parts from across Europe and depend on them arriving quickly. \nCommittee chair, Rachel Reeves, said: “The car industry is one of the UK’s great manufacturing successes. Innovative and efficient car plants across the country provide thousands of jobs and the automotive sector is a major contributor to our economic growth. \n“There is no credible argument to suggest there are advantages to be gained from Brexit for the UK car industry. \n“Regulatory consistency and friction-free trade benefits car companies, consumers and car workers. The Prime Minister now needs to ensure common-sense pragmatism prevails and spell out the Government’s intention to seek continued regulatory and trading alignment with the EU in the automotive sector.” \nMPs spoke to car makers and visited the Honda factory in Swindon. They also heard evidence from Business Secretary Greg Clark and EU politicians, and they said the received “a certain amount of information from companies in confidence, which we do not publish but has nonetheless helped inform our conclusions.” Read More The key findings \n• Leaving the EU without a deal would involve the introduction of a 10% tariff on cars \n“The current profit margin of around £450 on a £15,000 car would be comfortably wiped out,” MPs said. \nBut the alternative was to pass the extra cost on to customers. They warned: “Such an increase would inevitably have an impact on sales.” \n• A ‘no-deal’ Brexit would force global car-making giants to close UK factories. \nMPs said global firms invest in the UK because they are currently able to sell cars built here across the EU. \n“Inward investment from major Japanese companies over the last 40 years has been instrumental in revitalising car manufacturing in the North East and West Midlands.” \nBut firms would move production to other countries if tariffs were imposed on exports from the UK to the EU. \n“In simple terms, it is difficult to see how it would make economic sense for multinational volume manufacturers - the bulk of the UK automotive sector - to base production in the UK ... the shift of manufacturing to countries within the customs union and single market would be inevitable. \n“The cost in UK jobs could be in the hundreds of thousands.” Read More Home Office defends police payments to sex offenders following Operation Sanctuary \n• Cars made in the UK can be less than a quarter “British” for trade deal purposes, because they contain so many parts from other countries in Europe. \nIt means they might actually be excluded from future trade deals allowing the UK to export British-made goods to other countries. \nTo counter this, the Government will need to sign trade agreements in which “EU content can count as UK and vice versa”. \n• New trade deals would not make up for losing access to the EU single market. \n“We looked hard at potential opportunities arising from Brexit. We found that it is unrealistic to expect an expansion of trade overseas to outweigh the loss of trade to Europe arising from a hard Brexit.” \n“Retaining good access to the single market is more important than securing the freedom to secure new trade deals with third countries. \n• Car makers could struggle to recruit skilled workers if it becomes harder for EU citizens to work in the UK. \n“The Government should also seek a deal on immigration that enables the sector to access the full range of skills it requires and should further incentivise locating relevant research and development in the UK once we leave the EU.” \n• Brexit won’t help the car industry. The best the UK can do is to try to limit the damage. \n“Overall, no-one has argued there are advantages to be gained from Brexit for the automotive industry for the foreseeable future. We urge the Government to acknowledge this and to pursue an exercise in damage limitation in the negotiations. \n“This involves retaining as close as possible a relationship with the existing EU regulatory and trading framework in order to give volume car manufacturing a realistic chance of surviving in this country,” \n• But car-making is vital to the UK’s economy \n“The automotive sector is one of our key manufacturing industries: it contributes around one per cent of the UK’s output and 9.4 per cent of UK manufacturing output. \n“It employs 169,000 people directly, many in the manufacturing hub in the West Midlands, and a further 814,000 in associated supply chains throughout the UK.” Like us on Facebook", "external_links": [], "published": "2018-03-01T02:01:00.000+02:00", "crawled": "2018-03-01T03:08:55.003+02:00", "highlightTitle": ""}