{"organizations": [], "uuid": "68c3fa8bdb81c9ecce0c28ce93b4ebc10f52ad2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13440472.ece/ALTERNATES/s1200/Tom-Eden-Blog-Photo-Tyne-Quayside-Ouseburn.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/local-news/north-east-news-live-updates-14456302", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-26T08:30:00.000+03:00", "replies_count": 0, "uuid": "68c3fa8bdb81c9ecce0c28ce93b4ebc10f52ad2f"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/local-news/north-east-news-live-updates-14456302", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tom eden children", "sentiment": "negative"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south wales echo", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "none"}, {"name": "children’s commissioner", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A sunny, if a little chilly, morning so far. \nHere’s the Met Office’s forecast: \n“After a frosty start, a largely sunny and dry day is expected. \n“However some cloud will bubble up through the afternoon, and the odd light shower cannot be completely ruled out. \n“Maximum temperature 10 °C.” Tom Eden Children being let down by poverty and poor schools \nChildren in the North are proud of where they come from - but many are held back by poverty and poor schools. (Image: South Wales Echo) \nAnd being poor in the North of England has a worse effect on your chances in life than being poor in London. \nThese are some of the findings of a report by the Children’s Commissioner, the nation’s official champion for children, in a major new report called “Growing up North”. \nIt found that many children growing up in the North are thriving. But they’re also being let down by the Government’s Northern Powerhouse project, which focuses on improving the economy without improving prospects for young people. \nThe report called for a massive push to improve school standards across the North. \nAnd it called for a major rethink of Government policy towards the North, saying: “Children’s prospects should be placed at the heart of the Northern Powerhouse and given the same attention as economic regeneration.” \nGrowing Up North is the culmination of twelve months of research, analysis and conversations with children, schools, business, councils, health professionals and charities. Newcastle University KEY EVENT Cancer drug approved after 20 years of work \nA new cancer drug developed at Newcastle University could soon be available in the UK after 20 years of work. (Image: Daily Mirror) \nScientists have spent two decades developing a drug which treats ovarian cancer, a strain of the disease which affects 7,000 women across the country every year. \nThe drug, which is called Rubraca and benefited from Cancer Research UK funding, has been approved by the European Medicines Agency and is now eligible to be made available on the NHS. \nIt works by attacking the ability of cancerous cells to repair themselves, leading to a reduction in the size of tumours without harming healthy cells. \nSusan Ross, 60, from Whitley Bay , has been treated at the Freeman Hospital since being diagnosed ten years ago. \nWhen her cancer returned in 2015 and doctors found it was inoperable, she was prescribed Rubraca as part of a trial. \nSince taking the drug, her tumour has shrunk completely and Newcastle University say tests show more than half of women who take the drug will get similar results. \nShe said: \n“I feel the best I’ve felt since before my ovarian cancer diagnosis in 2007. I have my life back and I’ve been to far afield countries like Australia and Japan. \n“The team at Newcastle University should be very proud of what they have achieved as Rubraca is offering hope to ovarian cancer patients with the BRCA gene mutation that they can live their life well. \n“I would like to thank all those who have been involved in Rubraca’s® development and to the clinical team who have looked after me so well.” Lord Adonis 'Brexit would be calamitous for Tyneside - but young people can stop it' \n‘It is the youth that will stop Brexit’. \nThat was the message from Labour’s Lord Andrew Adonis, who spoke on Sunday to a crowd of ‘remainers’ in the centre of Newcastle. \nThe ex-Government minister, a key figurer in the pro-EU movement, claimed Brexit would be “calamitous” for the North East’s economy. \nIn the shadow of a float lampooning top Tories, the ex-Minister was cheered as he told how he had offered to give Jacob Rees-Mogg to France. \nAround 300 people turned out for the Grey’s Monument event, where Lord Adonis told the Chronicle: \n“I think there is every prospect we can stay in Europe. \n“There will be a parliamentary crisis when Theresa May returns with her treaty from Brussels. \n“She won’t have a majority for her treaty because the Labour Party will be bound to vote against it as there is no way the Labour Party can support \nConservative terms for Brexit which involves less trade and cuts to living standards.” Top Story Work starts on Newcastle City Pool and Baths \nWork to redevelop Newcastle’s historic City Pool and Turkish Baths has finally started. \nDeveloper Fusion Lifestyle is beginning the £5m renovation of the city centre building, which is now expected to open in summer 2019 after “unforeseen delays”. \nThe Northumberland Street site had originally been due to open to the public in spring this year. \nFusion, a registered charity, has developed plans to bring the pool, Turkish baths and spa back to life, and add a fitness suite and café bistro. \nThe plans include restoration of the Turkish baths and swimming pool, the creation of a new spa and fitness suite, glass fronted conditioning studios on the first and ground floor and changing areas. \nThe baths, first opened in 1928, were closed in April 2013 but a community campaign by Re-open Newcastle Turkish Baths Group was picked up by Fusion Lifestyle. \nFusion secured planning permission and listed building consent from Newcastle City Council in 2016. \nAnthony Cawley, operations director at Fusion Lifestyle, said: \n“We’re delighted to start the exciting work to bring the Newcastle City Pool and Turkish Baths back to life for a new generation. \n“The reinvigorated venue will bring between 100 to 150 jobs to the city once re-opened.” Chronicle KEY EVENT Today's front page \nToday’s front page leads with the story of a serial dangerous driver took police on a high-speed chase through Newcastle’s west end with his daughter in the car. \nMichael Curran travelled at more than twice the limit and swerved onto the wrong side of the road whilst being pursued on the West Road, Brighton Grove and sides streets in Fenham and Arthur’s Hill. \nNewcastle Crown Court was told the 37-year-old clocked speeds of 70mph in built-up areas where just 30mph was the limit. \nAnd, when police finally caught up with him after he temporarily came to a stop, the dad suddenly accelerated as one officer was trying to get into his car, a court heard. \nThe policeman was thrown to the ground as Curran ploughed his Skoda Octavia into a parked vehicle, \nNow, Curran, of Vine Street, Wallsend , has been locked-up for 18 months after he pleaded guilty to his sixth dangerous driving offence of his criminal career. US Politics Tom Eden Stormy Daniels 'warned to stay silent about Trump affair' \nPorn star Stormy Daniels has said she was threatened to keep silent about an alleged sexual encounter with Donald Trump in 2006, telling her story in a highly anticipated interview with CBS’ 60 Minutes. (Image: Pool Getty Images) \nMs Daniels said she was threatened by an unidentified man in Las Vegas to keep quiet about her alleged relationship with Mr Trump, an incident that she said happened while she was with her young daughter. She said in the interview that she had one encounter of consensual sex with the future president. \n“He knows I’m telling the truth,” said Ms Daniels, whose legal name is Stephanie Clifford. She does not allege that she was coerced in her encounter with Mr Trump, saying, “This is not a ‘Me too.’ I was not a victim.” \nThe adult film actress provided little new evidence of her alleged 2006 affair with Mr Trump but said she faced intimidation tactics aimed at ensuring her silence in 2011. \nMs Daniels said that in the incident, in a car park, the man told her: “Leave Trump alone. Forget the story.” She said he then looked at her daughter and said, “That’s a beautiful little girl. It’d be a shame if something happened to her mom.” \nMs Daniels received a 130,000 US dollars (£91,700) payment days before the 2016 presidential election for her silence and has sought to invalidate a nondisclosure agreement. 06:55", "external_links": [], "published": "2018-03-26T08:30:00.000+03:00", "crawled": "2018-03-26T09:59:27.000+03:00", "highlightTitle": ""}