{"organizations": [], "uuid": "24f6324eb2395b1989c7aabf9cbc061cc77438dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14379042.ece/ALTERNATES/s1200/CFR_NJL_071217atom_04.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/durhams-atom-bank-raises-149m-14378959", "country": "GB", "domain_rank": 21960, "title": "Durham's Atom Bank raises £149m to support further growth", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-07T14:41:00.000+02:00", "replies_count": 0, "uuid": "24f6324eb2395b1989c7aabf9cbc061cc77438dc"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/durhams-atom-bank-raises-149m-14378959", "ord_in_thread": 0, "title": "Durham's Atom Bank raises £149m to support further growth", "locations": [], "entities": {"persons": [{"name": "mark mullen", "sentiment": "none"}, {"name": "bridget rosewell", "sentiment": "none"}, {"name": "atom", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "durham's atom bank", "sentiment": "neutral"}, {"name": "toscafund", "sentiment": "none"}, {"name": "invalid email  durham-based atom", "sentiment": "none"}, {"name": "bbva", "sentiment": "none"}, {"name": "atom bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Durham's Atom Bank raises £149m to support further growth Big investors have backed the bank, which employs more than 300 people from its Durham headquarters Share Will.i.am with the Atom Bank team in Durham (Image: Atom Bank) Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nDurham-based Atom bank has raised a further £149m of investment to support its growth. \nSpanish banking group BBVA has invested £85.4m - taking its stake in Atom to 39% - while London asset managements group Toscafund has increased its stake with an investment of £54.4m. A number of Atom’s existing backers have also put in new investment. \nThe investment round means that Atom has brought in almost £400m of equity capital as it builds what is hoped to be the UK’s leading digital-only bank from the North East . \nAtom said the new investment would help it continue to grow and allow it to expand its technology and business capabilities. Atom Bank chief executive Mark Mullen (Image: Lansons) \nBridget Rosewell, Atom bank’s chair, said: “Atom is a rapidly growing, ambitious and vibrant business that is founded on the unique fit of our shareholders, our team and our partners. I am delighted that our investors have decided to back the bank with such a significant injection of capital to fuel our mission to change banking permanently for the better”. \nAtom CEO, Mark Mullen said: “We are very proud of what we have achieved in the Atom journey to date and we are excited about our plans for the future. \n“This further significant injection of capital secures the bank’s place as a disruptive force in the mainstream of UK banking. We will continue to invest in growth, in our technology and in our products as we continue to push ahead with the support of our investors.” Read More Whitley Bay's Jam Jar Cinema to open two new screens after gaining grant \nSince launching in 2015, Atom bank has taken more than £1.3bn of deposits and has now lent £1.2bn to small businesses and homeowners. \nThe bank has created around 300 jobs in Durham and has been named in the top 10 of KPMG’s global fintech rankings for the last three years. \nNewcastle law firm Womble Bond Dickinson advised Atom in the fundraising round. Read More Brexit is major threat to UK automotive industry, Vauxhall boss says \nPartner Ben Butler said: “Atom is one of the key disruptive forces that are reshaping today’s financial services landscape. This latest fundraising round is excellent news for Atom who continues to grow from strength to strength, offering consumers and businesses innovative and progressive solutions. \n“We’re delighted to have advised them on this transaction and look forward to continue working with the Atom team.” Like us on Facebook", "external_links": [], "published": "2018-03-07T14:41:00.000+02:00", "crawled": "2018-03-07T16:51:28.000+02:00", "highlightTitle": ""}