{"organizations": [], "uuid": "d2e2de830919a31d072cc552bd6db431b8278125", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.nottinghampost.com/incoming/article1313758.ece/ALTERNATES/s1200/35278693JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/police-arrest-two-teenagers-over-1314207", "country": "GB", "domain_rank": 48128, "title": "Police arrest two teenagers over claim of racist abuse at university - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-03-08T14:49:00.000+02:00", "replies_count": 0, "uuid": "d2e2de830919a31d072cc552bd6db431b8278125"}, "author": "Adrian Troughton", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/police-arrest-two-teenagers-over-1314207", "ord_in_thread": 0, "title": "Police arrest two teenagers over claim of racist abuse at university - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "joseph raynor", "sentiment": "none"}, {"name": "rufaro chisango", "sentiment": "none"}], "locations": [], "organizations": [{"name": "leicester mercury police", "sentiment": "negative"}, {"name": "nottinghamshire police", "sentiment": "none"}, {"name": "nottingham trent university", "sentiment": "none"}, {"name": "invalid email  police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Police arrest two teenagers over claim of racist abuse at university Two 18-year-old men have been detained Share Get Daily   Thank you for subscribing!   \nPolice have arrested two teenagers in connection with a video which shows \"vile\" racist abuse being chanted outside the room of a black student. \nNottinghamshire Police revealed that the suspects, both aged 18, had been detained in connection with racially aggravated public order offences. \nThe arrests come after Rufaro Chisango, a student at Nottingham Trent University, claimed that chanting at her halls of residence left her feeling \"shocked, isolated and uncomfortable\". The student union building at Nottingham Trent University (Image: Joseph Raynor) \nNottingham Trent University said an unspecified number of \"suspected perpetrators\" have been suspended after the abuse was captured on video and reported to security staff by Ms Chisango. \nNottinghamshire Police are investigating the video, which captured at least two males chanting \"we hate blacks\" and making other racist comments. \nOther chants captured by the video include \"We are the blacks haters\" and \"Sign the Brexit papers\". \nAt one point during the minute-long video, a female interrupts the chants, saying: \"Leave her alone.\" Read More Caring mum takes in homeless stranger who was sleeping in an abandoned train carriage \nMs Chisango, who posted footage of the incident on Twitter, told the BBC's Victoria Derbyshire programme the abuse earlier this week had a \"big impact\" on her, leaving her feeling shocked and isolated. \nThe student said: \"I just want the appropriate action to be taking place. Obviously it's racial abuse. It should not be tolerated at all.\" \nWhen is it OK to swerve or brake to avoid hitting an animal? The student union building at Nottingham Trent University (Image: Joseph Raynor) \nAsked if she intended to contact the police, she said she wanted to wait to see what action was taken by the university. \nMary Okpo, of Nottingham Trent's African Caribbean Society, told the BBC the incident was \"unjustifiable and unacceptable\". \n\"Whether they were inebriated or not, there's nothing that can justify what they said,\" she said of the students involved. \n\"This was a terrible, terrible incident. It's something that I didn't think I would see. For it to be so overt, open, in 2018. It's something that really, really shocked me.\" \nNottinghamshire Police said in a statement: \"We are aware of a video posted at Nottingham Trent University and which has been shared on social media. \n\"It is wholly unacceptable and we're proactively investigating the incident and liaising with the university.\" Read More \nIn a statement confirming \"suspected perpetrators\" had been suspended pending a full investigation, Nottingham Trent University said: \"This kind of vile behaviour will not be tolerated. \nTraffic wardens reveal 6 worst ever excuses to dodge a ticket \n\"We have contacted the student who made the complaint and are providing support to her and others affected. And we will be liaising with the police about this incident.\" \nAmong those who offered support on Twitter to Ms Chisango was the Labour MP for Tottenham David Lammy, who tweeted: \"Please contact the Police and your Member of Parliament and cc me in. All my love and solidarity.\" \nActor and radio presenter Adil Ray tweeted: \"This is a whole new low to see this at our universities.\" Like us on Facebook", "external_links": [], "published": "2018-03-08T14:49:00.000+02:00", "crawled": "2018-03-08T15:42:52.009+02:00", "highlightTitle": ""}