{"organizations": [], "uuid": "394e13098493a9770ddc97ad33ee8657102f8b55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14339000.ece/ALTERNATES/s1200/invest-in-the-north-east-3.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/invest-north-east-campaign-launched-14422502", "country": "GB", "domain_rank": 21960, "title": "Invest in the North East campaign launched to make the region a better place to live and work", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-03-19T02:01:00.000+02:00", "replies_count": 0, "uuid": "394e13098493a9770ddc97ad33ee8657102f8b55"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/invest-north-east-campaign-launched-14422502", "ord_in_thread": 0, "title": "Invest in the North East campaign launched to make the region a better place to live and work", "locations": [], "entities": {"persons": [{"name": "journa", "sentiment": "neutral"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Invest in the North East campaign launched to make the region a better place to live and work Journal and Chronicle campaign will focus on jobs, skills and infrastructure Share Invest in the North East   \nThe Chronicle is launching a campaign to make the North East a better place in which to live and work. \nInvest in the North East – which is being supported by some of the region’s top companies and public organisations – aims to celebrate positive initiatives to improve the economy of the region, whilst challenging the North East to be even more ambitious in the years ahead. \nThe campaign, which is also running in our sister title The Journal, will focus on three main areas: jobs; education and skills; and infrastructure. \nWe will be backing efforts by companies here and by businesses looking to come to the North East not just to create new jobs, but also to create better jobs by improving the skills of their workforce. \nWe will be pushing the Government to meet its manifesto commitment to narrow the gap between the regions of the UK by investing more in the North East and reversing funding inequalities affecting the region. \nAnd we will be encouraging employers and educators in the North East to work together to close the skills gap, especially in sectors like technology, science and engineering. Darren Thwaites Editor-in-Chief Trinity Mirror North East (Image: Newcastle Chronicle) \nJournal editor-in-chief Darren Thwaites said: “Invest in the North East will be a wide-ranging campaign that aims to make the North East the best place to live in the country. \n“The Journal and The Chronicle have fought for this region for well over a century, and now we are doing that in the digital age through the Chronicelive website. \n“People from the North East know that this is a great place to live and work, and one of the main priorities of the campaign will be to ensure that the rest of the country knows too. \n“We also want to tackle some of the challenges facing our region and ensure that everyone here has a great future.” \nThe campaign has been launched at a crucial time for the region, with devolution for the North of Tyne area offering a unique opportunity for the region to forge its own future. Newcastle International Airport (Image: Daily Mirror) \nBut there are also fears that Brexit will hit the region’s businesses, with Government research suggesting the North East will fare the worst of all UK regions when the UK leaves the European Union. \nInvest in the North East will also continue The Journal’s campaigning on issues important to the region’s future, including transport, digital infrastructure, responsible business, inward investment and job creation. \nThe campaign is being supported by a number of the region’s top employers, including Newcastle Airport, Northumbrian Water, Newcastle College, rail company Northern, Stagecoach and Newcastle University. \nInvest in the North East is being supported by Newcastle Airport, Northumbrian Water, Newcastle College, rail company Northern, Stagecoach and Newcastle University. \nProfessor Chris Day, vice-chancellor and president of Newcastle University, said: “As someone born, educated and now head of a world-leading institution in the North East, I am immensely proud of the contribution Newcastle University makes to the prosperity of our city and region. Professor Chris Day, Vice-Chancellor and President of Newcastle University \n“Contributing £1.1bn to the UK economy every year, not only do we add to the economic success of the city, but our students and staff also enrich the cultural and social environment. \n“We are actively investing in projects that are helping to attract new businesses and jobs to the region such as Science Central, two national innovation centres in the fields of ageing and data and a national research centre for offshore and subsea engineering. \n“Our world-leading research alongside industry, business and other organisations is creating solutions that are making a real difference to people’s lives. We are proud to be a champion for this campaign which highlights the achievements and vision of the North East as a whole.” \nNorthumbrian Water chief executive Heidi Mottram said: “We are delighted to support The Chronicle’s Invest in the North East campaign and honoured to have the chance to help showcase just how amazing our region is. Heidi Mottram, Northumbrian Water Group’s CEO \n“As one of the North East’s biggest employers, this is our community and we are incredibly proud of the area and, most importantly, its people. They are the heartbeat of our company and the driving force behind everything great that we do. \n“We are committed to playing our part in ensuring the successful future of the North East, whether that’s through creating new jobs, investing in local businesses or by improving local infrastructure and the environment. \n“It’s something we are incredibly passionate about and excited to get involved with.” \nTony Lewin, principal at Newcastle College, said: “The college’s origins date back over 120 years and we are now part of one of the largest education and training providers in the UK, NCG. We teach over 16,000 students each year from our Newcastle city-centre campus and award-winning academies throughout the North East. Tony Lewin, Newcastle College (Image: Copyright unknown) \n“Over this time we’ve forged partnerships and aligned ourselves to industry to ensure that our teaching is in line with employer demand. These strategic partnerships help us shape and adapt our curriculum so that each individual who studies with us has every opportunity to fulfil their potential and progress to further study or employment. \n“On a daily basis we hear about great achievements and success stories which take place throughout our region. As a key employer operating throughout the whole of the North East we welcome the opportunity to work together to spread these positive messages further afield. \n“The Invest in the North East campaign is the perfect platform to champion the North East, outlining it as a great place to live and do business.” \nMike Paterson, North East director of rail company Northern, said: “Northern plays a vital role in the North of England by connecting tens of thousands of people to work, leisure, education and more every day. \n“There are many exciting benefits to come as a result of over £1bn of investment during the next nine years, including brand new state-of-the-art- trains and faster and more frequent services. \n“Our changes will support economic growth, secure jobs, protect pay and make the North East a better place in which to live and work. In the North East this will mean that by 2020 our local rail service will be unrecognisable to the one that you see today. \n“Northern is delighted to be working alongside the Journal, the Chronicle and other business in the region to promote the North East and celebrate its successes.” Graeme Mason (Image: North East England Chamber of Commerce) \nGraeme Mason, planning and corporate affairs director at Newcastle Airport, said: “Newcastle Airport is the international gateway for the North East. \n“It connects businesses to global markets and it’s future success and that of the region will be mutually dependant. A thriving airport will help deliver growth, jobs and investment. That’s why we are delighted to support the Invest in the North East campaign. \n“The airport provides flights to more than 80 direct destinations and even more worldwide through our extensive hub network. We aim to provide the best possible facilities and experience for our customers, and we believe that this good first impression will help the North East to attract new businesses and inbound tourists. \n“We are proud to work alongside the Journal, the Chronicle and other leading businesses to showcase our great region and champion its achievements and its future potential.” Stagecoach North East buses (Image: handout publicity) \nSteve Walker, managing director for Stagecoach North East said: “Providing a mix of public transport options for our local communities is vital and provides a major boost for the regional economy. We are delighted to be supporting the Invest in the North East campaign and welcome the opportunity to be involved in such a positive step for the region. \n“Our company has made a series of investments to help transform bus travel for customers, including the recent introduction of the Stagecoach Bus app which offers journey planning, real-time bus tracking, next stop information and mobile ticketing. \n“Buses are critical to the local economy to help keep business workers on the move, and we are improving commuter journeys for customers by making it as easy as possible to travel to key locations. \n“With free wi-fi on board, customers are able to work remotely and check the latest journey information online; helping make bus travel more convenient for our customers.” Like us on Facebook", "external_links": [], "published": "2018-03-19T02:01:00.000+02:00", "crawled": "2018-03-19T02:13:41.005+02:00", "highlightTitle": ""}