{"organizations": [], "uuid": "a315d49d102764f5deb37ac7cb20e96ad06b766d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13540191.ece/ALTERNATES/s1200/Sainsburys-boss-pay.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13567896", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Brexit rules could leave food rotting at UK border, Sainsbury's CEO warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-04T10:35:00.000+03:00", "replies_count": 0, "uuid": "a315d49d102764f5deb37ac7cb20e96ad06b766d"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13567896", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Brexit rules could leave food rotting at UK border, Sainsbury's CEO warns", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "coupe", "sentiment": "none"}, {"name": "mike coupe", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "sainsbury", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "british retail consortium", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford North East universities aim to help innovative businesses with grants of up to £25,000 \nA consortium of the North East’s five universities is aiming to support innovative new businesses in the region with grants for SMEs in the creative, digital and IT sectors. \nThe Creative Fuse North East project – which brings together Newcastle, Northumbria, Durham, Sunderland and Teesside universities – is offering grants for up to £25,000 to companies in the region through its innovation pilot and its innovation development award scheme. \nGrants are available for SMEs and freelancers in the region’s creative, digital and IT (CDIT) sector to help them find ways to grow and innovate in their business. To qualify for the funding, they will need to work with staff from two of the universities involved in the scheme. \nProf Eric Cross from Newcastle University, who is leading the £4m project, said: “We want to hear ideas from businesses and freelancers which will help them to overcome challenges facing them, such as barriers to growth or developing new methods of working. \n“We’re particularly interested in applications which are ‘fused’: that is, combine ideas from creative design and technology. \n“The five university partners know just how important the CDIT sector is to our region and we are all looking forward to using our knowledge and expertise to help organisations achieve their goals.” \nCreative Fuse North East will be supporting a range of £5,000 innovation pilot awards, as well as a small number of innovation development awards for projects up to £25,000. Prof Eric Cross, Dean of Cultural Affairs, Newcastle University (Image: Zander Photography) 9.15 Coreena Ford Johnson Service group chief retires after more than three decades \nThe chief executive of Johnson Service Group is to retire after 33 years at the dry-cleaning, workwear and linen firm. \nChris Sander described leaving the company as “one of the most difficult decisions” he has had to make, but added that the group is in “excellent shape and very well-placed for continued growth”. \nHe started with the group in 1984, joined the board in 2008 and was appointed chief executive in 2014. \nJohnson Service Group’s board has begun the process of identifying a successor both internally and externally and Mr Sander’s retirement date is “flexible”, the company said, although it will take place in the first half of 2018. \nChairman Paul Moody said: “The board makes this announcement with a degree of sadness. It has been a genuine privilege to work with Chris; under his leadership, JSG has made enormous progress.” \nJohnson Service Group made the announcement alongside first-half results, which saw revenue rise 19.3% to £138m and pre-tax profit grow from £9.9m to £12.9m. 9.10 Coreena Ford TJ Hughes submits third set of plans for new bar and restaurant in city centre \nNewcastle’s Bigg Market could soon be home to a new bar and restaurant, after plans were lodged by department store chain TJ Hughes. \nThe company has asked Newcastle City Council for permission to convert its ground and basement floors into a new restaurant, which will also have a cafe situated outside. \nSketches of the restaurant’s front, drawn by Collective Design, suggest it will be called Swiss Cottage. \nIn the design statement TJ Hughes said: “It is proposed that this new venue becomes a high-level operation which looks to operate from breakfast through the evening.” \nIt adds: “The introduction of this new venue will enhance the area, create jobs and develop a sustainable business. \n“The design takes into consideration local and national planning policies to ensure that the scheme is delivered to the highest possible quality. It also looks to compliment the regeneration scheme which is investing into the surrounding areas.” \nTJ Hughes estimates that if opened the restaurant will lead to the creation of six full-time jobs and 20 part-time jobs. It will occupy a total of 6,824sqft and open between 11am in the morning and 2am in the evening. \nTJ Hughes argues that the development fits in with the council’s plans to reinvigorate the Bigg Market by spring 2018. A total of £2.9m is expected to be spent on the area. \nIt is not known whether the Swiss Cottage plans will come to fruition, as this is the third planning application TJ Hughes has submitted to convert its Newcastle premises over the last two years. \nIn 2015 the council approved plans for the department store to convert part of its shop into a 24-hour gym in the heart of the city. \nPermission was granted on the condition that the development would start no later than April 2018. Since approval was granted two gyms have been opened in the city centre. \nA later application, filed at the start of 2016, showed TJ Hughes’ first plans to create a restaurant in the Bigg Market. \nThe plans requested permission to open a restaurant on the ground floor, with a gym on the first floor of the building. TJ Hughes, in Newcastle's Bigg Market (Image: Newcastle Chronicle) 9.05 Coreena Ford Magners owner swoops for Admiral Taverns \nIrish drinks firm C&C, which is behind Magners cider, has inked a deal to acquire pub chain Admiral Taverns alongside Proprium Capital Partners in a £220m deal. \nAs part of the transaction, C&C will take 47% of Chester-based Admiral while Proprium, a property firm, will take a slightly higher stake. \nThe remainder will be held by Admiral’s management team, led by chief executive Kevin Georgel. \nThe deal contains both debt and equity and C&C is pumping £37m in for its holding. Admiral, which is being sold by hedge fund Cerberus, operates 845 pubs in Britain and raked in £25.2m in earnings last year. \nThe deal will give C&C, which also owns Tennents lager, a direct route to market “without taking significant financial and operational risk”, its boss Stephen Glancey said. \nHe added: “This is an attractive opportunity to create a new long term investment in the important on-trade channel, without taking significant financial and operational risk. \n“The investment will provide our brands with improved distribution in some of the best community pubs across the UK, with an opportunity to enhance on-trade penetration further over time.” \nThe acquisition is the latest move by a drinks firm to seize control of a pubs group. In December, Heineken snapped up Punch Taverns alongside private equity firm Patron Capital in a £403m deal. \nMr Georgel said: “Our strategy remains unapologetically consistent and I look forward to working with the support of our new investors to continue to build on the significant progress the business has made over the last five years and take advantage of the opportunities within our markets, as and when they arise.” C&C, the owners of Magners cider, has acquired pub chain Admiral Taverns alongside a property firm 8.50 KEY EVENT Kromek secures new $2m security screening deal \nSedgefield tech firm Kromek has announced a deal with a new customer which is a leader in X-Ray imaging systems. \nThe radiation detection technology company, which works in the medical, security and nuclear markets, has been awarded a five-year contract, worth $2m (£1.54m) over the period, by the new client which will incorporate Kromek’s technology into its baggage security screening systems, which will boost detection of an extensive range of threat materials. \nThe firm said this is the second long-term contract Kromek has signed in the security screening market this year, following the announcement in February of a five-year $3.1m (£2.39m) agreement with an existing US-based customer that is an emerging leader and global company in the homeland security marketplace. \nDr Arnab Basu, chief executive officer of Kromek, said: “We are delighted to secure another long-term contract with a new OEM customer in the security screening market. \n“This agreement further demonstrates the demand for our products and technology as all OEMs in this arena begin upgrading their legacy systems to bring them in line to detect modern day threats. We look forward to working with this new customer and developing a long-term relationship with them.” Arnab Basu, ceo of Kromek 8.45 KEY EVENT Alnwick Garden and Newcastle's Shared Interest in the running for national prizes \nTwo organisations in the North East are in the running to be named among the UK’s best social enterprises . \nAlnwick Garden in the Northumberland and Newcastle’s Shared Interest Society have been nominated in the UK Social Enterprise Awards 2017, which recognise the country’s best not-for-profit organisations. \nShared Interest, a financial co-operative that allows people to invest in fair trade projects, is nominated in the Social Enterprise of the Year category, where it faces competition from Auriga, Employers for Childcare, Here, Ninety and SharpFutures. \nShared Interest managing director Patricia Alexander said: “We are delighted to be shortlisted for an award that recognises businesses that give back to society. \n“We say that an investment in Shared Interest will not make you rich, but it will enrich the lives of others by providing fair finance to remote and disadvantaged communities across the globe.” \nAlnwick Garden, meanwhile, is in the running in the Consumer Facing Social Enterprise category. \nThe Garden’s CEO Mark Brassell said “We are in our 16th year at The Alnwick Garden with visitor numbers increasing every year, so this is incredibly rewarding for us and our visitors. \n“It’s only a few months since we won the best large visitor attraction in Northumberland, so to be recognised for the social impact as well as for tourism is very positive for us, especially as we are a community project and registered charity.” Alnwick Garden (Image: Newcastle Chronicle) 8.42 What's the FTSE latest? \nThe FTSE-100 index at 8:15am was down 13.25 at 7425.25. \nThe pound at 8am was 1.2957 dollars compared to 1.2973 dollars at the previous close. The euro at 8am was 0.9177 pounds compared to 0.9161 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.40 Coreena Ford BHS.com sales climb 35% \nThe boss of BHS.com has seen sales jump by more than a third as the retailer seizes a start-up mentality to resurrect the business online. \nManaging director Kevan Mallinder said sales climbed 35% during the second quarter thanks to a stand-out performance from its womenswear division, which surged 350% over the period. \nEfforts to rebuild the brand were also gaining traction, with first-time shoppers representing around two thirds of its customers. \nMr Mallinder said his 20-strong staff - the majority of which came from the defunct department store group - had thrown off the shackles of the past and were treating the operation like a disruptive start-up. \nHe said: “The star of the show in the last quarter has been womenswear and that has grown because we have better products and we have given it more focus. \n“A question I frequently ask is: ‘What would a start-up company do?’ And if they wouldn’t do it, then nor should we. \n“All the staff have needed is some freedom to ask themselves new questions.” \nThe Al Mana Group snapped up the brand and formed BHS International in June last year. Alongside BHS.com, it also owns the overseas franchise business, which has profitable department stores throughout Europe and the Middle East. \nThe Qatari firm poached Mr Mallinder to lead the online business from organic food delivery firm Abel & Cole six months ago. \nHe said the aim of BHS.com was to offer products “at prices in reach of any British home”, with a focus on UK contemporary design. The original BHS.com homepage last year, after it first launched 8.30 KEY EVENT Post-Brexit rules could leave food rotting at border, Sainsbury's CEO warns \nThe chief executive of Sainsbury’s has warned fresh food could be left rotting at the British border if strict customs controls for EU goods are put in place after Brexit. \nMike Coupe says that anything disrupting established food supply chains, currently governed by EU customs arrangements, would be “detrimental” and that the retail sector will make its voice heard “strongly” if pragmatism does not prevail during exit negotiations. \nHe said: \nThe UK sources roughly a third of its food from the European Union and food is by far and away the UK’s largest export. \nIf you take our fresh produce supply chains, for example, we put things on a lorry in Spain and it will arrive in a distribution centre somewhere in England, and it won’t have gone through any border checks. \nAnything that encumbers that has two effects: it adds cost, and it also has a detrimental effect on freshness - if you’re shipping fresh produce from a long distance, even a few hours of delay can make a material impact. \nThe warning comes after the British Retail Consortium said last week that food prices, already soaring following the Brexit-induced collapse in the pound, could rocket further unless measures to tackle red tape and improve ports are put in place before Britain exits the bloc in March 2019. \nMr Coupe said that the repercussions of supply chain disruption are “not fully recognised” in Westminster. \nHe cautioned that if it gets nearer to March 2019 and a solution has not been found, retailers and food producers will “make that point and make it very strongly”. \nMr Coupe added that while more pain was likely on the way for consumers, the market was not experiencing the “mother of all meltdowns” it saw during the financial crisis. \nHe pledged to reduce costs and work with suppliers to mitigate inflation, and also reduce overheads. \nSainsbury’s has committed to slashing £150m of costs this year and £500m in the following three years. \nSpeculation has been rife that the firm is preparing to follow Tesco in axing hundreds of head office jobs in the process, but Mr Coupe insisted that staff will be the first to know of any cuts. Fresh food could be left rotting at the British border if strict customs controls for EU goods are put in place, the Sainsbury's CEO says (Image: PA) More On ", "external_links": [], "published": "2017-09-04T10:35:00.000+03:00", "crawled": "2017-09-04T10:45:11.010+03:00", "highlightTitle": ""}