{"organizations": [], "uuid": "43b41dd41a07e506ff74e63bb52a18a1f300e1b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13638229.ece/ALTERNATES/s1200/Top-200-Business-Breakfast-Awards-2016.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/search-begins-find-north-easts-13637967", "country": "GB", "domain_rank": 21960, "title": "Search begins to find the North East's Top 200 companies", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-18T20:00:00.000+03:00", "replies_count": 0, "uuid": "43b41dd41a07e506ff74e63bb52a18a1f300e1b3"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/search-begins-find-north-easts-13637967", "ord_in_thread": 0, "title": "Search begins to find the North East's Top 200 companies", "locations": [], "entities": {"persons": [{"name": "virgin money", "sentiment": "none"}, {"name": "brian nicholls", "sentiment": "none"}, {"name": "amy evans", "sentiment": "none"}, {"name": "bill macleod", "sentiment": "none"}, {"name": "james ramsbotham  james ramsbotham", "sentiment": "none"}, {"name": "utilitywise", "sentiment": "none"}, {"name": "sintons", "sentiment": "none"}, {"name": "vertu", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "tracerco", "sentiment": "none"}, {"name": "ramside hall hotel", "sentiment": "none"}, {"name": "north east top", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "billingham", "sentiment": "none"}, {"name": "fastflow", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "wynyard", "sentiment": "none"}, {"name": "hebburn", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "metnor", "sentiment": "none"}], "organizations": [{"name": "hitachi construction machinery", "sentiment": "none"}, {"name": "nifco uk", "sentiment": "none"}, {"name": "esh group", "sentiment": "none"}, {"name": "mtl", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "companies house", "sentiment": "none"}, {"name": "castle building services", "sentiment": "none"}, {"name": "lanchester wine cellars ltd", "sentiment": "none"}, {"name": "bellway", "sentiment": "none"}, {"name": "winn holding the newcastle", "sentiment": "none"}, {"name": "pwc newcastle", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle college", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "impetus waste management", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Search begins to find the North East's Top 200 companies The annual list of the region's largest companies will be unveiled later this year Share The Journal and Gazette Top 200 Business Breakfast Awards 2016 held at the Stadium of Light (Image: Newcastle Journal) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIt’s North East Top 200 time again. Figures being tallied now will highlight the cream of the region’s businesses. Brian Nicholls reports \nWho are the North East’s most successful companies in 2017? That question is about to be answered from research under way to decide those meriting a place in the latest annual North East Top 200 league table. \nOur updated list of distinction – once more organised by The Journal and The Gazette, and run with associate sponsor North East England Chamber of Commerce - will be printed exclusively in a free supplement with The Journal and The Gazette of November 17. \nWith the table will be key facts, figures and background. Surprises are certain. \nA year of ongoing uncertainty from Brexit has had to be met, and benefits of Northern Powerhouse are still elusive in the North East. Companies that have found a rewarding way through these fogs, and the general economic uncertainty, will be in the table if their sales pass the minimum turnover to qualify. Only the final outcome of research will decide that figure. \nPollution emission cheats among motor manufacturers have hurt some dealerships in the region, but have not prevented last year’s fourth place Vertu from scoring record revenues in its 10th year of trading. Hitachi Construction Machinery, which last year slipped four places to 51, may prove a phoenix this year. The Hebburn maker of excavators and dump trucks has seen turnover soar by £30m. In the automotive supply chain, Nifco UK has enjoyed an eighth successive year of growth. \nThe housing crisis does not prevent builder Bellway from showing a revenue rise 11% up, enough perhaps to create a shuffle among the top five. And Virgin Money, having announced some of its best ever half year results, should stay in the top 10. In construction generally, despite a reported slowdown in work, two North East firms at least, Brims and Metnor, seem to be riding it out. \nExisting Top 100 members prospering from work with Hitachi’s entry to the North East rail industry should keep their end up, and maybe one or two of the others not previously on the list might squeeze into the table’s lower end this year if work from other clients has held up. \nLast year a £31.2m turnover secured new entry Lanchester Wine Cellars Ltd the final 200th place. Whether such a figure proves enough this year will emerge in due course. Meanwhile it will be a breakthrough indeed for any company nearing last year’s top of the tree £5.26bn that Nissan achieved . In the end, only latest figures count. \nBesides unfolding the region’s stories of outstanding corporate success, the table indicates the region’s business performance over all, and in the various sectors. \nCompanies confident of a place in the table should follow guidelines set out here. Benefits are numerous, as many firms already there confirm. \nThe table also highlights: leading companies of any size that show highest percentage turnover in a year; leading plcs and private companies; private equity backed companies; and companies with a parent outside the region. \nA watch will be kept for further sparkle from last year’s shooting stars – new entries and highest climbers. The top newcomers then were Vocare medical support group on Tyneside, Impetus Waste Management at Wynyard, Castle Building Services at Hebburn, and Winn Holding the Newcastle motor insurer. Biggest climbers were Utilitywise, the North Tyneside energy efficiency specialist, Durham construction group MTL, Fastflow, the Washington asset maintenance service, and Tracerco, the Billingham oil and energy firm. \nBill MacLeod, senior partner at Newcastle’s office of PwC, said: “PwC Newcastle is proud to continue its association with the Top 200. This year, more than ever, we find ourselves presented with a changing environment, whether it’s the long-term effects of leaving the EU or uncertainty about devolution. \n“However, the businesses I speak to are generally optimistic and determined to focus on the opportunities. This is reflected in the Top 200 where we see businesses from a broad spectrum of sectors performing well and delivering strong growth – testament to the health of North East business.” North East England Chamber of Commerce chief executive James Ramsbotham \nJames Ramsbotham, chief executive of the North East England Chamber of Commerce, said: “We are delighted to support the Top 200 which is a first class illustration of how dynamic the business community is here in the region. \n“This list is our equivalent of a best seller chart. The outstanding companies highlighted, without question, put us on the national and international map with their products and services. \n“We also support this publication as it is an extremely useful analysis of how our major companies are performing, complementing our Quarterly Economic Survey results. \n“The North East is a great place to be in business, the list clearly shows this, and emphasises that as a business community we are force to be reckoned with and together we grow stronger.” \nHOW THE TABLE IS COMPILED Top 200 sponsors \nThe Top 200 table is compiled from publicly available sources. All the information is taken from the published audited accounts of companies filed at Companies House or made available on the company website. \nThe companies in the list are ranked purely on latest turnover. The aim of the table is to identify companies which not only have a significant presence but also a significant decision making process in the region. \nBy taking all the information from publicly available sources we hope to make the Top 200 robust and transparent, and to remove as much subjectivity as possible. However a number of issues do have to be considered when the table is compiled. \nCompanies are identified as having a registered office address in the region (i.e. the postcode area is one of the following; NE, SR, DH, DL or TS) which means that divisions or manufacturing locations of large companies based in the North East are not included. Subsidiaries of companies are included if they are judged to have significant decision making in the region. \nThere are a few exceptions to this where, although a company has a registered address in the region, they have been excluded if there is no obvious presence in the North East after checking the company accounts and website. Conversely, the registered office address of a company could be outside the region but the controlling base of the company can be demonstrated to be in the region – such companies will be included in the list \nTo compare the turnover of the companies listed in the Top 200, calculations need to be made to some of the published figures in the accounts. This is because some companies publish their accounts in a different currency, in which case the exchange rate is taken at the reporting year end date (eg December 31). Also, some companies change their accounting reference dates resulting in a turnover figure for more or less than a 12 month period, in which case the turnover figure is pro-rated. \nPrivate companies are given nine months from the end of the accounting reference period to deliver their accounts to the Registrar at Companies House, after which the accounts are deemed to be overdue. To make the published table as meaningful and up to date as possible, no overdue accounts are included. The deadline for completion of the table this year is October 13. \nJOIN THE PACE SETTERS \nAn awards presentation featuring also a guest speaker – and open to the business community in general – will be held at Ramside Hall Hotel, County Durham on November 16 (7.30-10.30am approximately). \nGuests will receive their copy of the official and exclusive Top 200 supplement containing the full table that morning – a day ahead of the supplement’s appearance with The Journal newspaper of November 17. \nFor table and ticket bookings, or to find out about sponsorship opportunities, please contact Amy Evans, events manager, T: 0191 201 6092 E: amy.evans@trinitymirror.com \nSponsors of the North East Top 200 this year - besides the associate sponsor North East England Chamber of Commerce and research sponsor PwC – include Esh Group, Sintons and Newcastle College. \nInterested in North East jobs? Find job vacancy listings across a range of sectors here . Like us on Facebook", "external_links": [], "published": "2017-09-18T20:00:00.000+03:00", "crawled": "2017-09-18T20:37:30.002+03:00", "highlightTitle": ""}