{"organizations": [], "uuid": "016997459224458e1130e77df7ecce26458bfa4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13672315.ece/ALTERNATES/s1200/JS106633533.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/12-money-saving-hacks-save-13672001", "country": "GB", "domain_rank": 21960, "title": "12 money saving hacks to save hundreds of pounds before Christmas", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-25T20:00:00.000+03:00", "replies_count": 0, "uuid": "016997459224458e1130e77df7ecce26458bfa4e"}, "author": "Nisha Mal", "url": "http://www.chroniclelive.co.uk/news/north-east-news/12-money-saving-hacks-save-13672001", "ord_in_thread": 0, "title": "12 money saving hacks to save hundreds of pounds before Christmas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "12 money saving hacks to save hundreds of pounds before Christmas With all these tips we reckon you could save more than £600 over ten weeks Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily     \nAvoid going into the red this Christmas and start saving for the festive season now. \nMaking small changes to your finances, and putting money aside now, means you can also avoid paying off items in instalments well after Christmas day has been and gone. \nWe’ve put together 12 money saving hacks, tips and tricks to help you along the way. And we’ve worked out how much you can save over a 10 week period, with a total cash pot of £635.60 at the end. \nYou don’t have to follow all of them, alternatively pick and choose the ones that suit you and your lifestyle. Ditch the lunchtime meal deal \nThe average lunch time meal deal costs £3. Instead of opting for shop bought sandwiches make your own. \nIf you do this three days a week you can save £9. That’s £90 over 10 weeks. \nEstimated cash saved: £90 Stop buying coffees \nA grande latte from Starbucks will set you back £2.85 a pop. Cutting back on three shop-bought coffees each week will save you £8.55. Saving you £85.50 by the festive season. \nEstimated cash saved: £85.50 Be savvy with your Tesco vouchers \nUse your vouchers in store, online or at the pump to get money off. \nThe vouchers don’t just have to be spent on your groceries, use them to get money off Christmas presents across toys, electrical, beauty and other departments. \nTesco currently a half price toy sale, shop it here . \nYou can also quadruple your vouchers when eating out. A £2.50 Tesco Clubcard voucher will get you £10 to spend on food with a host of Tesco partners including Cafe Rouge, Bella Italia, Ask Italian and Zizzi. Switch bank accounts \nAccording to money saving guru Martin Lewis, founder and chair of MoneySavingExpert.com, the biggest bonus is hsbc.co.uk Advance account which pays new switchers £150, plus a further £50 after a year. Yet you need to pay in £1,750 per month (earn over £26,100 and get your salary paid in, as that’s £1,750+ after tax – you can take the money out straight away if you like). \nAlternatively firstdirect.com gives switchers £100 while bank.marksandspencer.com gives a £125 gift card and adds £5/month to it for a year. And both require a smaller monthly pay in of £1,000/mth. With all accounts you usually need to be a new customer, pass their (not too tough) credit check, use their seven day switching service and switch 2+ direct debits. \nMeanwhile Co-Op Bank customers are given £125 for joining and setting up four direct debits. It’s a great way to add money to your Christmas fund but make sure you choose an account that is right for you and your banking needs. \nEstimated cash made: £125-£150 Plan your weekly food shop \nAccording to a 2017 report from the Office of National Statistics (ONS) the average family weekly food shop comes in at £53.20. Plan out your weekly meals and go the supermarket, just once a week, armed with a shopping list. If you switch from premium brands to supermarket own brands, and avoid the temptation to impulse buy, it is possible to save between £10-£20. Cutting back £10 per week can save you £100 in 10 weeks. \nEstimated save: £100 Buy one less bottle of wine a week \nAccording to a market report by The Wine and Spirit Trade Association, due to rising inflation because Brexit, the average bottle of wine costs £5.56. If you buy one less bottle a week, you can make a saving of £55.60 come Christmas time. \nEstimated save: £55.60 Boots and Superdrug loyalty cards \nTake advantage of the points you earn from Superdrug and Boots and use them to buy Christmas gifts across health and beauty gifts. To bump up your points, look out for double point promotions and special offers. They will have more frequent incentives in the run up to Christmas. \nKeep an eye out for double point promotions at Boots here, or for Superdrug points offers here . Change to a SIM only mobile tariff \nAccording to uswitch most mobile phone contracts are set at either 12 or 24 months. \nHowever it’s very easy to forget when your contract is coming to an end. Phone your service provider and ask how long is left on your contact, if you’re nearing the end enquire about switching to a SIM only contract, these are much cheaper. For example EE’s best-selling iPhone 7 price plan costs £42.99 per month, if you’re on this tariff and switch to a £19.99 SIM only plan you could potentially save £23 per month. Saving you £57.50 over 10 weeks. \nEstimated save: £57.50 Use coupons \nSave on your shopping with free vouchers and discounts on cleaning, beauty and baby products as well as groceries. According to moneysavngexpert.com coupons can save you hundreds of pounds throughout the year. Coupons work by giving you money off everyday items. Sites like caringeveryday.co.uk regularly have coupons across health, beauty, baby and hygiene items which will knock money off your regular Boots and Superdrug visits. You can get anything from £1 off Neutrogena facial wipes to £5 off dog food. Tweak your eBay vocab \nIf you want to earn money on eBay tweak your vocab. A survey by Birmingham City University in 2016 trawled more than 68,000 UK eBay listings, finding the keywords that enticed buyers. Perfumes with ‘authentic’ in the description sold for £34 on average, shoes labelled ‘sneaker’ fetched £32 and fashion listings described as ‘men’s’ closed at £31.You could earn yourself a one-off amount of £97, by selling these three items. \nEstimated cash made: £97 Buy train tickets in advance \nIf you’re going away for Christmas book your tickets in advance to avoid steep train fares. Contractually Network Rail must have the timetable set 12 weeks prior to the journey, so train operators commonly release cheap advance tickets shortly after. It’s not always dead on 12 weeks though, often more like ten. Sign up and fill in your journey details with Trainline’s ticket alerts, you will get an email when cheap advance tickets, for that specific journey, go on sale. Visit www.thetrainline.com/ticketalert Read More 'Rip-off' petrol stations accused of maxing out brief hurricane fuel cost spike Take advantage of Black Friday and Cyber Monday \nPick up presents for children, grandparents, uncles, aunties and friends on Black Friday (November, 24) and Cyber Monday (November,27). Forgo the busy high street and do your shopping online, typically Amazon, Tesco and Currys have the best deals across all departments including toys, beauty and electricals. \nLast year, online retailer Amazon spread its Black Friday deals over 12 days with thousands of deals for its customers. \nIt’s important to bear in mind, that although Amazon’s discounts are amazing there is limited availability on products so if there’s already something you want you’ll have to act quickly on the day. \nAmazon also do flash sales know as Lightning Deals - these are time-limited offers and they will appear on the site unannounced throughout the day. To keep on top of these check the site regularly to see what’s on offer. Like us on Facebook", "external_links": [], "published": "2017-09-25T20:00:00.000+03:00", "crawled": "2017-09-25T20:20:13.002+03:00", "highlightTitle": ""}