{"organizations": [], "uuid": "ea6adda1af12a48d79fa1eb32996e9c6943e497e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/news/business/article431740.ece/ALTERNATES/s1200/BTSW-pic.jpg", "site_section": "http://www.middevongazette.co.uk/business.rss", "section_title": "devonlive - Business", "url": "http://www.devonlive.com/news/business/tech-innovators-say-theres-more-429460", "country": "GB", "title": "Tech innovators say 'there's more to the South West than cream teas and cowpats' and here's why", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-07T02:00:00.000+03:00", "replies_count": 0, "uuid": "ea6adda1af12a48d79fa1eb32996e9c6943e497e"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/tech-innovators-say-theres-more-429460", "ord_in_thread": 0, "title": "Tech innovators say 'there's more to the South West than cream teas and cowpats' and here's why", "locations": [], "entities": {"persons": [{"name": "devo", "sentiment": "none"}, {"name": "dave pearce", "sentiment": "none"}, {"name": "sally basker", "sentiment": "none"}, {"name": "kate doodson", "sentiment": "none"}, {"name": "sally adams", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "anne carlisle", "sentiment": "none"}, {"name": "neil robinson", "sentiment": "none"}, {"name": "rezcomm", "sentiment": "none"}, {"name": "stephens scown", "sentiment": "none"}, {"name": "cornish", "sentiment": "none"}, {"name": "toby parkins", "sentiment": "none"}, {"name": "scown", "sentiment": "none"}, {"name": "tom moore", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "newman", "sentiment": "none"}, {"name": "miles noble", "sentiment": "none"}, {"name": "stephen", "sentiment": "none"}, {"name": "drake", "sentiment": "none"}, {"name": "dave smith", "sentiment": "none"}, {"name": "marc ive", "sentiment": "none"}], "locations": [{"name": "south west", "sentiment": "none"}, {"name": "mount wise house", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "headforwards", "sentiment": "none"}, {"name": "exeter science park", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "exeter science park centre", "sentiment": "none"}, {"name": "plymouth science park", "sentiment": "none"}, {"name": "honiton", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "tech", "sentiment": "none"}, {"name": "mount wise house", "sentiment": "none"}, {"name": "royal william yard-based acutate marketing", "sentiment": "none"}, {"name": "university", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "downing street  connectivity", "sentiment": "none"}, {"name": "falmouth university", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "penny cross", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tech innovators say 'there's more to the South West than cream teas and cowpats' and here's why Devon and South West digital innovators are changing the face of the region's economy Share The #BackTheSouthWest campaign champions our regional innovators Share \nThink of Devon and Cornwall and what comes to mind? It’s likely that our pasties, long sandy beaches and cream teas are high on the list. \nOur natural assets, food and drink sector and tourism are major crowd pleasers here - and rightly so. \nBut there is a growing band of pioneering businesses that are changing the face of the economy. \nAccording to the latest tech nation report 2017 , the UK now has 1.64 million digital tech jobs, and the South West is supporting around 20,000 of them. Toby Parkins, co-founder of Headforwards, a software outsourcing company based in Pool Innovation Centre. (Image: Sally Adams) \nIn fact, our stunning scenery, quality of life, coast and moorland is a major draw for creative thinkers eager to leave the overheated South East or avoid it altogether. \nThe growth rate of digital jobs was more than double that of non-digital jobs between 2011 and 2015. What is more, these jobs are highly skilled and highly paid, contributing to the productivity and growth of the wider economy. It is estimated that the turnover of digital tech businesses reached £170 billion, an increase of £30billion in just five years. \nAnd it is growing super fast. The turnover of digital tech businesses reached £170billion, an increase of £30billion in just five years. Digital jobs 79% \nSource: Tech Nation 2017 \nTom Moore, a solicitor in the Stephen’s Scown intellectual property and IT team, said there are around 2,000 technology companies based in Devon and Cornwall alone. Tom Moore, solicitor at Stephens Scown IT and Intellectual Property team \nHe said: “Creating valuable skilled jobs and developing solutions to some of the most pressing issues facing our society today, these are businesses that should be celebrated. \n“The continued success of the South West economy relies on companies with such a high growth potential.” Read More We champion #BackTheSouthWest and this is our pick of six great tech firms, says Stephens Scown \nThe aim of the Back the South West campaign is to highlight the kind of innovation that is boosting our stake in this new economy, being dubbed the fourth industrial revolution. \nAnd it is also about asking for what we need from Government to make the best of our assets. Read More South West set to march on Downing Street \nConnectivity in road, rail and digital have to get stronger if we are to compete in a post-Brexit world. \nWe have compiled the Tech 30 list, highlighting some of the innovators making great strides in Devon and Cornwall. Read More The Tech List: 30 Exeter and South West firms at the cutting edge of technology and innovation \nThey predict that artificial intelligence will top technological breakthroughs coming through in the next five years – but they say that will mean a skilled workforce will be even more important. \nIn a survey of the 30 of the area’s leading digital companies, technological advances – particularly artificial intelligence (AI) – were repeatedly sited as the most important factor affecting a sector which is growing in importance. \nAnd that meant many of the firms also mentioned the need for skills and education to keep pace with developments. \nThey saw this as a major challenge, even ahead of the uncertainty posed by the UK’s imminent departure from the European Union. Miles Noble in his new offices at Altitude Design, in Mount Wise House (Image: Penny Cross) \nAt website design and marketing company Altitude, based at Plymouth’s Mount Wise House, chief executive Miles Noble said: “We’re seeing a slow, but steady spread of virtual reality (VR) and augmented reality (AR) devices and technologies. \n“This technology has potential to change the way we use the internet and live our lives. \n“As these devices become more common, demand will increase for websites to be designed with features that take advantage of this new hardware. \n“Imagine shopping for a fridge freezer on Amazon and being able to call up a 3D scale model you can observe from all angles with your VR headset. \n“Or, in the case of augmented reality platforms, imagine having that same fridge freezer visually projected into your kitchen so that you can make sure it will fit.” \nDave Pearce, of Royal William Yard-based Acutate Marketing, said: “VR has the capability of challenging how we interact with the web and to disrupt the high street.” \nHe was concerned about Brexit uncertainty and “its effect on consumer confidence” and the “generation gap” with young people’s debt burden a worry. \nDigital agency Cosmic, based at Honiton, joint chief executive Kate Doodson said: “Artificial intelligence and automation is likely to make the biggest impact. \n“Our biggest challenge is trying to keep ahead of technological developments. We pride ourselves in leading the way as early adopters of new technologies, so we must always be on top of our game.” \nAt Plymouth-based IT support company Acronyms, founder Dave Smith said: “Brexit and the uncertainty it brings is a challenge for every business.” \nIn the South West the ‘brain drain’ is also a concern. Professor Anne Carlisle, CEO and Vice Chancellor of Falmouth University. \nOne of Falmouth University’s top objectives is to grow the Cornish economy by building a talent pipeline that will stop brain drain to the South East while providing start-up support in high growth sectors for entrepreneurs. \nProfessor Anne Carlisle, Vice Chancellor at Falmouth University, said: “It’s a long-term project and multifaceted: working in schools and raising aspiration among young people, recruiting more Cornish students, and retaining the skills of our brilliant students by working with local businesses to ensure graduates have the right skills to get great jobs within the county when they graduate. \n“Secondly, the University is investing in entrepreneurship and innovation; offering research opportunities and facilitating the creation of start-ups in high-growth, high-value sectors. \n“The county’s economy is currently dominated by low wage, seasonal employment, which has long held back its development. \n“However, the region’s improving connectivity, creative heritage and pioneering spirit, mean that it is rapidly developing one of the fastest growing tech sectors in the UK.” \nAnd it is absolutely paying off with tech businesses offering some of the highest wages in the region. \nAnd that’s why the digital and tech sector features so strongly in Theresa May’s Industrial Strategy. Read More South West already set to lead on May's industry agenda \nAmong the initiatives outlined last year is the Industrial Strategy Challenge Fund to support smart energy technologies; robotics and artificial intelligence and 5G mobile network technology. This fund is part of £4.7 billion of additional R&D funding announced by the Prime Minister in November. \nBut it is not just digital companies or high tech manufacturers that can make the most of the latest developments. \nBy investing in innovation, traditional sectors can reach a brand new audience. Marc Ive, Travel Services Director and Neil Robinson, Parking Services Director of Rezomm (Image: © Guy Newman) \nRezcomm at Exeter Science Park, began life in North Devon as a traditional travel agency but has diversified to take advantage of a gap in the market emerging out of the online booking boom. Read More This Devon travel agent adapted for online buyers and now business is booming \nThe airport, parking and venue reservation specialists use innovative technology to help airports, parking operators and venues looking to automate their booking systems. Now, Rezcomm’s client-base spans the UK and Europe with new opportunities coming from the USA. \nIt has upsized its offices at Exeter Science Park Centre as it prepares to quadruple its workforce over the next two years. \nExeter Science Park and Plymouth Science Park in Devon and the Pool Innovation Centre in Cornwall are helping to create critical mass for fledgling companies. Dr Sally Basker, CEO of Exeter Science Park. said that embracing tech is do or die \nDr Sally Basker, Chief Executive at Exeter Science Park said that supporting young disruptive companies that are heavily reliant on investment in the early stages is critical to self-sufficiency in the long term. \nShe said: “This is a region that has a long history of innovation, taking risks and free thinking, just think about Drake or the Mayflower Pilgrims. \n“We need to capitalise on that. It strikes me that we have lots of SMEs that have got to be able to grow if they want to, but we need to pull all our resources to help them achieve their ambitions. \n“Any entrepreneurial business, innovation or disruptive technology is high risk and needs a lot of investment to get started. Our job is to give them that support to grow.” Like us on Facebook ", "external_links": [], "published": "2017-09-07T02:00:00.000+03:00", "crawled": "2017-09-07T02:15:48.004+03:00", "highlightTitle": ""}