{"organizations": [], "uuid": "0058b92a5d918d453873d675e72bc20e08f4ae14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/news/devon-news/article511318.ece/ALTERNATES/s1200/St-Georges-DayMAIN.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/ex-cabinet-minister-urges-corbyn-511268", "country": "US", "title": "Ex-Cabinet minister urges Corbyn to reclaim St George’s flag to woo Brexiteers and Tory voters", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-21T15:11:00.000+03:00", "replies_count": 0, "uuid": "0058b92a5d918d453873d675e72bc20e08f4ae14"}, "author": "Phil Goodwin", "url": "http://www.devonlive.com/news/devon-news/ex-cabinet-minister-urges-corbyn-511268", "ord_in_thread": 0, "title": "Ex-Cabinet minister urges Corbyn to reclaim St George’s flag to woo Brexiteers and Tory voters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Denham thinks the English flag should be reclaimed by the Left Share Comments \nLabour must reclaim the English flag if it is to win back Brexiteers and Tory voters, a former Cabinet minister from Devon has warned. \nJohn Denham, co-founder of a new English Labour Network group, said that too often the St George’s flag was linked by some in the party to the English Defence League and hate crime. \nAhead of the launch of the campaign at the annual conference in Brighton, Denham, who comes from Seaton, told HuffPost UK that Labour needed to reclaim a sense of “patriotism” for its progressive policies. \nAnd amid a fresh push by activists for a more liberal migration policy, he added that Labour would fail to regain power if it drew up plans “to benefit the migrants rather than people who already live here”. \nThe English Labour Network, which draws on the Left and centrist wings of the party, formally launches in Brighton with a mission to win back voters who drifted away from the party in England in recent years. \nIts backers include members of the ruling National Executive Committee (NEC), councillors, trade union members and local party campaigners. Labour MPs Jon Cruddas, Shabana Mahmood and Liam Byrne are supporters, as is Jeremy Corbyn’s 2016 leadership campaign director Sam Tarry. English flag bunting \n“There are people who get the importance of England right across the party from left to right,” Denham said. “And there are people who don’t get it right across the party, so it cuts across an awful lot of traditional factions, it’s very important it’s seen to have that broad base of support. \n“Many of the crises in UK politics are in England. We are leaving the European Union overwhelmingly because of English voters and they were the voters most likely to identify as English. England is the most divided part of the UK in terms of education, different economic geography, so if you are going to have progressive politics, you have got to win England itself.” Read More Body found in river in search for 'high risk' missing woman \nDenham, whose daughter Rosie is an Exeter city councillor and cabinet member, said that recent polls show Labour lags behind significantly in the support it gets from voters “who identify as English” rather than British, and needed to radically decentralise from London and not rely on Scotland to win a Commons majority. \n“Labour actually needs to aim to win an English majority. You can’t rely on a shedload of Labour MPs in Scotland to give you a UK majority. And I think as every year goes by it will be harder for a Labour UK majority government to introduce policies for England if Labour doesn’t have a majority in England. \n“We saw that in the 2015 campaign [which saw Ed Miliband pilloried over a possible SNP deal], there is this sense that the English interest isn’t always the same as the UK interest.” \nDenham, who was Communities and Local Government Secretary under Brown and police minister under Blair, represented Southampton Itchen as an MP, a key southern English marginal lost to the Tories in 2015. \n“There’s a really powerful English dimension to politics that Labour has often neglected or at worst shunned, not wanted to engage positively with England and Englishness,” he said. \nAsked what he felt about Emily Thornberry’s infamous tweet of a St George’s flag in Rochester, Kent in 2014, he insisted that she denied any attempt to sneer at voters. \nExeter cathedral tower to be scaffolding free Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“But you will get some people in the Labour party who will assume that the St George’s cross means ‘English Defence League’, hating migrants, reactionary on everything,” he said. \n“In fact of course there are more people in England who identify as English to some degree than identify as British. More people who emphasise their Englishness as their Britishness. Read More Man will be jailed for at least five years for having illegal gun \n“If you stereotype everybody who feels proud of being English or right-wing, anti-migrant, xenophobic, you are making two mistakes. One is you are completely misunderstanding what most people think about being English. Secondly you are putting on millions of people a set of values that they would reject. \n“I’m not by any means saying that’s the whole of the Labour party. But there are people in the Labour party who instinctively recoil from these things. If you go on Twitter you find that very quickly.” \nDenham said that towns, rather than big Metropolitan areas, where the key battleground for Labour, not least as many Brexit voters as well as Tory voters lived there. \n“It’s a very English thing to build your idea of England around a strong sense of place. We are a country perfectly comfortable with multiple identities. It’s critical for Labour to understand that because the key seats that Labour needs to win the next election and a majority are largely not in the big metropolitan cities. \n“They are largely in smaller cities, larger towns, sometimes with a rural area around it, where that sense of identity and place can be very strong indeed. We want to see how we draw out that sense of identity so the politics comes across as progressive absolutely but also patriotic.” Read More ", "external_links": [], "published": "2017-09-21T15:11:00.000+03:00", "crawled": "2017-09-21T15:22:09.002+03:00", "highlightTitle": ""}