{"organizations": [], "uuid": "c4dd538b8c7ca051abc84050db9e9e3bc7027b9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13627850.ece/ALTERNATES/s1200/JCR_MEN_140517Tech_08.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/police-pay-rise-will-lead-13666523", "country": "GB", "domain_rank": 21960, "title": "Police pay rise 'will lead to 12 officers being cut' - as North East forces are stretched further", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-25T07:00:00.000+03:00", "replies_count": 0, "uuid": "c4dd538b8c7ca051abc84050db9e9e3bc7027b9e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/police-pay-rise-will-lead-13666523", "ord_in_thread": 0, "title": "Police pay rise 'will lead to 12 officers being cut' - as North East forces are stretched further", "locations": [], "entities": {"persons": [{"name": "rudd", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "ron hogg", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "jonathan cribb", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "institute for fiscal studies", "sentiment": "none"}, {"name": "durham’s labour police", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "invalid email  durham police", "sentiment": "none"}, {"name": "durham police", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A police officer (Image: Publicity picture) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDurham Police could lose 12 officers because of the Government’s decision to grant a pay rise without explaining where the money will come from, an MP has claimed. \nSedgefield MP Phil Wilson has written to Home Secretary Amber Rudd urging her to ensure forces receive financial help. \nHe told her: “The estimated cost to Durham is approximately £0.5m and the choice for Durham is to either take it out of reserves, which have been earmarked for other purposes, or reduce officer numbers.” \nIt follows the Government ’s announcement that police are to receive a 2% pay rise for 2017-18, ending the public sector pay cap, which has limited rises to a maximum of 1% for the past seven years. Sedgefield MP Phil Wilson (Image: Unknown) \nBut there is no extra money from central Government to pay for the increase. Instead, forces will be expected to find the money from existing budgets, even though they have already had to cope with large funding cuts. \nRon Hogg, Durham’s Labour Police and Crime Commissioner (PCC), warned earlier this week that staff cuts had left officers overworked, with some taking sick leave or experiencing mental health issues as a result. \nAnd Mr Wilson said that finding an extra £500,000 to fund the pay increase could mean Durham Police had to reduce officer numbers by approximately 12 for a 12-month period. \nHe pointed out that some of the extra salary would actually go to the Treasury in the form of income tax and National Insurance, and urged Ministers to ensure that this money was returned to forces. Durham Police and Crime Commissioner, Ron Hogg (Image: Newcastle Chronicle) \nIn his letter to the Home Secretary, Mr Wilson said: “The total national cost to the police service of the non-pensionable award to police officers has been estimated at £50m. Therefore a proportion of this, approximately in the region of £12m - £15m, will be paid in income tax and national insurance to the Treasury. Read More Labour Deputy Leader Tom Watson on rule changes, Brexit and Destiny 2 \n“I would propose that the Treasury and Home Office give back the equivalent amount to police forces in the form of a one-off grant to compensate local constabularies who are seeing an increase in crime and a reduction in resources.” \nMr Wilson also called for police staff, such as PCSOs and detention officers, to get the same pay award as police officers. \nMs Rudd has previously agreed police funding had been cut, but insisted police had coped with budget cuts, \nShe told the BBC last week: “I accept that between 2010 and 15 there were cuts in the police budget, but I would also ask other people to accept that crime came down in that period. Home Secretary Amber Rudd (Image: Newcastle Chronicle) \n“The fact is crime overall is down by a third since 2010. The police have done a fantastic job in managing with those cuts.” \nShe added: “We’ve actually protected the police budget between 2015 and 20. We have asked the police to find the extra 1%, because you’re right, they’re getting 1% on their salaries and one per cent additional. Read More More than 38,000 innocent people sent to jail in one year \n“The fact is that’s £24m a year. They have about one and a half billion in reserves.” \nA leading economic think tank has warned that public services will struggle to recruit and retain the staff they need unless ministers ease the restraint on pay. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe cap remains in place for services such as the NHS. \nAnd the Institute for Fiscal Studies (IFS) found average public sector earnings had fallen by 4% in real terms since 2009-10 under the coalition and Conservative governments. \nContinuing pay restraint for public sector workers would take their pay to “historically low levels” compared to their private sector counterparts, the report said. \nJonathan Cribb, the report’s author, said: “If the Government decides to maintain the 1% cap, we should expect increasing difficulties in recruiting, retaining and motivating high quality public sector staff, reducing the quality and quantity of public services.” Like us on Facebook ", "external_links": [], "published": "2017-09-25T07:00:00.000+03:00", "crawled": "2017-09-25T08:53:28.005+03:00", "highlightTitle": ""}