{"organizations": [], "uuid": "25faa1a5f44287a7701c35ee337c0c33fd6e0e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13583182.ece/ALTERNATES/s1200/SGP_NEC_310817RUDD02JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/amber-rudd-enlists-show-racism-13583151", "country": "GB", "domain_rank": 21960, "title": "Amber Rudd enlists Show Racism the Red Card to tackle extremism in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-06T20:16:00.000+03:00", "replies_count": 0, "uuid": "25faa1a5f44287a7701c35ee337c0c33fd6e0e71"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/amber-rudd-enlists-show-racism-13583151", "ord_in_thread": 0, "title": "Amber Rudd enlists Show Racism the Red Card to tackle extremism in the North East", "locations": [], "entities": {"persons": [{"name": "rudd", "sentiment": "negative"}, {"name": "jo cox", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "paul kearns", "sentiment": "none"}, {"name": "mrs rudd", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "west midlands police", "sentiment": "none"}, {"name": "national action", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Amber Rudd enlists Show Racism the Red Card to tackle extremism in the North East In the wake of high profile attacks and Brexit, Amber Rudd visited the charity to discuss a new Home Office funded partnership between the two Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nShow Racism the Red Card and the Home Secretary are teaming up to combat extremism in the North East. \nThe Home Office are funding a new programme run by the North Tyneside -based charity which intervenes where young people have expresses extreme attitudes. \nAmber Rudd visited the charity’s headquarters last week to give the scheme her seal of approval, further cementing the charity’s reputation for tackling prejudice. \nHow to undermine extremism in the UK has become a highly charged and complex debate in recent years, especially in the wake of high profile terror attacks and a post-Brexit referendum spike in hate crime. \nTwo deadly assaults in London by Islamist attackers this summer killed 13 innocent people amid similar tragic events in other European cities. \nAt the same time, the murder of Jo Cox, an MP and mother-of-two, by a white supremacist terrorist put the issue of the far-right in Britain back in the headlines. Home secretary Amber Rudd on a visit to the Linskill centre, North Shields (Image: Newcastle Chronicle) \nOn September 5, four serving members of the armed forces were arrested by West Midlands Police under anti-terror laws for alleged membership of the banned neo-Nazi group National Action. \nIt is hoped that such early intervention work could prevent those who hold extremist views from developing into individuals capable to committing violence in the name of their distorted beliefs. \nAmber Rudd has spent part of the summer recess speaking to groups at the forefront of rooting out extremism and said that all types of extremism are a threat to the country. \nShe said: “All extremism concerns me. Part of the fact-finding I’m on at the moment is also sharing the commitment we have as a government to ensure that we tackle all sorts of extremism, whether it’s radical Islamist extremism or whether it’s on the far-right. \n“Both are dangerous, both do terrible harm and we’re determined to support organisations to help us stamp it out.” \nThe new partnership with Show Racism the Red Card, which will run for an initial 12 months but could continue for longer, aims to address a “gap in the market” between the government’s anti-terror Prevent strategy and the work the charity currently does. \nWhile they’ve battled racism among young people since 1996, this scheme is aimed at those who have more developed and entrenched views. Read More Operation Sanctuary: Home Secretary Amber Rudd on sexual exploitation in the North East \nIt’s expected that it will target juveniles from across the political spectrum, whether they be people who have expressed neo-Nazi views or Islamist views. \nPaul Kearns, the charity’s deputy chief executive, said: “We’ll be offering a bespoke service for those children across the whole spectrum of extremist attitudes. \n“One of the key things that we need to understand is that extremism is extremism whatever form it takes. \n“You see cases where white terrorists are described as ‘lone wolves’ rather than extremists and that needs to be addressed. \n“So when we’re discussing these issues with young people, we look at extremism in all its forms. \n“You have to give them that big picture to help them understand.” Read More The UK's plan for immigration after Brexit has been leaked - and this is what it means \nDuring the visit, the Home Secretary also addressed the post-referendum spike in hate crime that was experienced around the country. \nShe said: “There was a flare up of hate crime after the Brexit vote but it came back down. \n“It’s still at levels we find which we unacceptable and those levels are going up - but we think that is because people are reporting it more. \n“If you want more reporting you will get it, in my experience, and that’s what we are getting. \n“I think that we must be careful not to tar everybody by certain events that might take place. \n“We are committed as a government to make sure we fund projects on the ground. \n“I think the more we do that, the more we will be able to head it off while also encouraging people to report.” \nAs reported on September 5, Mrs Rudd also addressed the West End sex abuse scandal, saying that people must have an “open space” to talk about such atrocities to prevent hateful interpretations of events from festering and taking hold. Like us on Facebook", "external_links": [], "published": "2017-09-06T20:16:00.000+03:00", "crawled": "2017-09-06T21:01:19.005+03:00", "highlightTitle": ""}