{"organizations": [], "uuid": "b60c1d0ce117e39c001f69e1c4fd84c4bbd6831b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i4.leicestermercury.co.uk/incoming/article485393.ece/ALTERNATES/s1200/Eric-Skelding_low-res.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/local-news/100-year-old-dunkirk-veteran-485369", "country": "US", "domain_rank": 48128, "title": "100-year-old Dunkirk veteran from Leicestershire awarded medal by France - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.92, "site_type": "news", "published": "2017-09-16T15:45:00.000+03:00", "replies_count": 0, "uuid": "b60c1d0ce117e39c001f69e1c4fd84c4bbd6831b"}, "author": "Adrian Troughton", "url": "http://www.leicestermercury.co.uk/news/local-news/100-year-old-dunkirk-veteran-485369", "ord_in_thread": 0, "title": "100-year-old Dunkirk veteran from Leicestershire awarded medal by France - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "eric skel", "sentiment": "negative"}, {"name": "liz burrows", "sentiment": "none"}, {"name": "eric skelding", "sentiment": "none"}, {"name": "chris gittins", "sentiment": "none"}, {"name": "jean-claude lafontaine", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "hinckley", "sentiment": "none"}, {"name": "walter gabriel", "sentiment": "none"}, {"name": "andrée", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "ashby-de-la-zouch", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "tamworth", "sentiment": "none"}, {"name": "stourbridge", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "dunkirk", "sentiment": "none"}, {"name": "normandy", "sentiment": "none"}, {"name": "suffolk regiment", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "north-west leicestershire", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}], "organizations": [{"name": "leicester mercury click", "sentiment": "negative"}, {"name": "cancel play now comments  army", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "south staffordshire regiment", "sentiment": "none"}, {"name": "stourbridge players", "sentiment": "none"}, {"name": "clarke associates", "sentiment": "none"}, {"name": "caen", "sentiment": "none"}, {"name": "national federation of ironmongers", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "expeditionary force", "sentiment": "none"}, {"name": "ashby court bupa care home", "sentiment": "none"}, {"name": "ashby court bupa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Comments \nArmy officer Eric Skelding was involved in a touching incident which does not feature in the Second World War blockbuster movie Dunkirk. \nAmid the madness of the bombardment and aerial machine gun fire, the officer found a small packet of Army biscuits on the beach. \nDespite himself being hungry and frozen, his first thought was of his men. \nHe said: “There was nothing to eat and precious little water to drink. Eric Skelding celebrating his 100th birthday (Image: Clarke Associates) \n“I remember finding a little packet of army biscuits lying on the sand, gathering my men around me and opening them so we could enjoy a meal together. \n“Unfortunately they had been soaked in the sea and were so salty that they were impossible to eat, particularly as we were so thirsty.\" \nThis is typically selfless of the man who yesterday received the highest possible French order of merit medal in recognition of his military service during the Second World War. \nEric Skelding, now 100, received the celebrated Legion d'Honneur medal for his part in the liberation of France in 1944-45. Read More Man airlifted to hospital after three-car crash in Narborough \nThe medal is one of the highest accolades awarded by the French government, and Eric is among those surviving veterans who will receive the medal to mark the 70th anniversary of the liberation. \nThe medal was presented to Eric, who is a resident at Ashby Court Bupa care home in Ashby-de-la-Zouch, by Jean-Claude Lafontaine, Honorary Consul of France for the East Midlands. \nEric volunteered to join the army in 1939 and was part of the British Expeditionary Force which was eventually evacuated at Dunkirk in June 1940. He was a member of the South Staffordshire Regiment with whom he took part in the Normandy landings in June 1944. He fought through Normandy (including the battle for Caen), the liberation of France, followed by Belgium, Holland and finally Germany. \nIn the later stages of the war, he transferred to the Suffolk Regiment. \nEric was born in 1917 and was brought up in Stourbridge, in the West Midlands. \nHe was part of a local theatre group, the Stourbridge Players, as he had a talent for amateur dramatics. \nHe became good friends with Chris Gittins who went on to play Walter Gabriel in The Archers. Eric Skelding in uniform \nPrior to the war, Eric worked for the National Federation of Ironmongers. \nFollowing the end of hostilities, Eric started a theatre group to entertain troops still stationed in Germany - through which he met his wife, Andrée. \nThey married in 1949 and had two children together. \nHe still acted occasionally, including a spell in The Archers. \nAfter the war, he returned to his former job, eventually becoming Director of the organisation and running a group of industrial trade associations based in Birmingham and Tamworth. \nEric, who lived in North-West Leicestershire for decades, said: \"Looking back now, it seems like a different world, and I am glad that I have taken time to record in writing as best I can my memories of what happened during the war years and my time in the Army. Read More Good value homes and a regenerating town centre - why Hinckley is the place to be \n“I look back with some sadness because so many lives were lost, but also with enormous pride to have played my part in events that are still being talked about all these years later. \n“I’m extremely honoured and grateful to be receiving the Legion d’Honneur more than 70 years after the liberation of France and will never forget the significance of the sacrifice made by so many during those months.” \nIn his memoirs, Eric recorded his experiences in the war - including being part of the D-day landings and being evacuated at Dunkirk. \nOn the Normandy landings, he said: “By the time we finished fighting....we had eaten no food for about 14 hours and had no sleep for 24 hours, in addition to which we were absolutely soaked with rain, frozen stiff, fed up and far from home. \n“(The Germans are) shelling us all the time and we have had several direct hits on battalion HQ. \n“My jeep has been blown to pieces - we have taken quite a few prisoners. Could do with some sleep.” \nHe also describes how he had to write to the mother of one of his men who was killed after the ceasefire for the war had been received. \nHe said: “A few hours after we had received the ceasefire order, one of my men used my jeep to go and fetch a radio set from one of the outlying infantry companies and on his way back was killed by a mine in the road. Read More Leicestershire faces labour crisis as one-in-three EU workers threatens to quit post-Brexit \n“I had myself travelled up that road several times already and by sheer luck had missed the mine every time. \n“It was heartbreaking to have to write to his mother that evening to tell her about this when the war with Germany was virtually over.” \nEric tells of the raptuous welcome the soldiers received when they returned to England after being evacuated from Dunkirk. \nHe said: “Dover was an unbelievable sight of thousands of people cheering and shouting, bringing us cups of tea and something to eat.” \nLiz Burrows, deputy home manager at Ashby Court Bupa Care Home, said: “Eric is what you would call the perfect gentleman. \n“He's courteous, softly spoken and has lots to talk about, and he always has something interesting to say. \n“He'll often talk to us in French and make us giggle, and whenever he talks to anyone at the home, it's always a very engaging conversation. \n“He's a very popular resident and genuinely a perfect gent.” Like us on Facebook ", "external_links": [], "published": "2017-09-16T15:45:00.000+03:00", "crawled": "2017-09-16T19:13:20.008+03:00", "highlightTitle": ""}