{"organizations": [], "uuid": "84414a8f28df9c0722d8cb3df3200737fa779ade", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13645655.ece/ALTERNATES/s1200/Public-sector-pay.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/more-innocent-people-38000-sent-13645102", "country": "GB", "domain_rank": 21960, "title": "More than 38,000 innocent people sent to jail in one year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-20T10:00:00.000+03:00", "replies_count": 0, "uuid": "84414a8f28df9c0722d8cb3df3200737fa779ade"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/more-innocent-people-38000-sent-13645102", "ord_in_thread": 0, "title": "More than 38,000 innocent people sent to jail in one year", "locations": [], "entities": {"persons": [{"name": "jeremy beecham", "sentiment": "negative"}, {"name": "beecham", "sentiment": "none"}, {"name": "baroness vere of norbiton", "sentiment": "none"}, {"name": "lord keen of elie", "sentiment": "none"}, {"name": "timpson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}], "organizations": [{"name": "house of lords", "sentiment": "none"}, {"name": "ministry of justice", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "national rail", "sentiment": "none"}, {"name": "halfords", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "durham police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News More than 38,000 innocent people sent to jail in one year North East politician Jeremy Beecham says too many are sent to jail 'on remand', which means they have not been found guilty of a crime Share   \nMore than 38,000 people were sent to prison last year even though they were never convicted of the crime they were accused of. \nFigures from the Ministry of Justice have revealed the number of prisoners who were sent to prison on remand and then never convicted. \nThey were published in response to questions from Jeremy Beecham, a Newcastle councillor and forme r city council leader who is a Labour Shadow Justice Minister in the House of Lords. \nHe said: “The Government need to reduce significantly the number of prisoners on remand pending trial, a significant proportion of whom will be found not guilty or, if guilty, receive light, often non-custodial sentences.” \nCourts can order people accused of a crime are placed on remand, which means they are held in prison, while they are awaiting trial. Jeremy Beecham at home in Gosforth, Newcastle (Image: Newcastle Chronicle) \nJustice Minister Lord Keen of Elie revealed that 32,238 people dealt with by a magistrates court were held on remand in 2016 and never convicted. \nThey included people who were found not guilty, and cases where a trial simply never took place. \nAnother 6,524 people dealt with at a crown court, which hears more serious cases, were held on remand but never convicted. \nWhat’s not included in the figures are people who were actually convicted of a crime but did not receive a custodial sentence. Read More Durham Police Commissioner takes on Home Secretary over police funding \nLord Beecham said the number of prisoners on remand was contributing to overcrowding in the prisons system. \nHe told the House of Lords: “For a quarter of a century, under successive Governments, the number of prisoners grew inexorably, until we now have the highest incarceration rate in western Europe, higher than some of the less advanced countries in eastern Europe. \n“Also, of course, the number of prison officers has fallen substantially, by more than 25%. \n“The consequences include the highest number of deaths among prisoners on record in the year to March 2017.” \nHe highlighted a report by the Chief Inspector of prisons which revealed assaults on staff have risen by 88% in the last two years. \nConservative minister Baroness Vere of Norbiton said the Government wanted to cut prison overcrowding by reducing offending. \nShe said: “The Government are committed through the prison safety and reform programme to improving the education, training and employment opportunities for prisoners, including encouraging prisoners to get qualifications in English and maths, providing access to apprenticeship programmes and teaming up with employment partners such as National Rail, Timpson, Halfords and so many more.” Read More A second Brexit vote, fighting terrorism and better army pay - Liberal Democrats reveal new policies \nShe added: “The Government are also working to help prisoners beat addiction by ensuring access to trained providers of specialist addiction services. We have also announced ​measures to crack down on the availability of drugs in prisons. We believe that these actions will reduce reoffending and aid rehabilitation.” \nThe Government was also deporting more foreign criminals and hoped to make more use of electronic tagging in the future, she said. Like us on Facebook", "external_links": [], "published": "2017-09-20T10:00:00.000+03:00", "crawled": "2017-09-20T10:24:35.018+03:00", "highlightTitle": ""}