{"organizations": [], "uuid": "4d48e691c6bba8c94163666f0f614020a204d5da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13644694.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-takes-theresa-may-13644385", "country": "GB", "domain_rank": 21960, "title": "As Boris Johnson takes on Theresa May, is Brexit going horribly wrong?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-20T07:00:00.000+03:00", "replies_count": 0, "uuid": "4d48e691c6bba8c94163666f0f614020a204d5da"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-takes-theresa-may-13644385", "ord_in_thread": 0, "title": "As Boris Johnson takes on Theresa May, is Brexit going horribly wrong?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "negative"}, {"name": "ken clarke", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "robbins", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "oliver robbins", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "telegraph", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News As Boris Johnson takes on Theresa May, is Brexit going horribly wrong? Here's what the row between Boris Johnson and Theresa May is about and why the Government is in trouble over Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nIs Brexit going horribly wrong? \nIt looks like it may well be. \nFirst, the British Government is divided, with Foreign Secretary Boris Johnson battling Prime Minister Theresa May and other Cabinet colleagues. \nSecond, a top civil servant has quit from the Government department which is meant to be overseeing Brexit. \nAnd third, the EU and the UK have been calling each other names instead of reaching agreement. \nHere’s everything you need to know as negotiations continue... Theresa May with Boris Johnson (Image: PA) What has Boris Johnson done? \nForeign Secretary Boris Johnson published an 4,000-word article over the weekend setting out his personal vision for Brexit. \nIt wasn’t authorised by Theresa May. \nHe repeated claims made during the EU referendum - when he was a prominent “leave” campaigner - that Brexit could lead to a massive budget increase for the NHS. \nBut most significantly, he also attacked the idea of making payments to the EU. \nHe wrote: “We would not expect to pay for access to their markets any more than they would expect to pay for access to ours.” EU and Union flags (Image: PA) Why does this matter so much? \nTheresa May is to deliver a major speech in Florence on Friday setting out the UK’s plan for Brexit. \nWhile she may not say this directly, there is speculation that the Prime Minister could accept the idea that the UK should continue to make payments to the EU even after we leave, whether for a transitional period of two or three years or even longer. \nIn return, the UK would get access to the single market, which makes it easy for British firms trade with the EU. Foreign Secretary Boris Johnson (Image: Getty Images Europe) What is Boris Johnson up to? \nThere are a number of theories. One is that he is trying to force Theresa May to carry out a “hard” Brexit, where we split completely with the EU, even though she thinks it’s in the UK’s interests to keep some links. \nA second is that he is thinking about the next Conservative leadership contest and trying to build up support. There’s a lot of speculation that Mrs May will resign once Brexit is completed, and Mr Johnson could be a candidate in the contest to choose a replacement. \nA third theory is that he actually plans to resign from the Cabinet, and wants to make sure people understand why he’s done it. How did the rest of the Government respond? \nBoris Johnson was attacked by Theresa May and others. \nSome journalists accused Mr Johnson of behaving like a back seat driver, and the Prime Minister referred to this by saying: “This Government is driven from the front”. \nHome Secretary Amber Rudd told a BBC interviewer: “I wouldn’t want Boris managing the Brexit process.” \nBut it seems strange that he can continue as Foreign Secretary when his own Cabinet colleagues are attacking him. \nVeteran Conservative Ken Clarke, a former Chancellor, said Mrs May can’t fire Mr Johnson because her position is so weak. \n“Normally a foreign secretary would be sacked instantly,” he said. Boris Johnson (Image: PA Wire) Will Boris Johnson resign? \nThe Telegraph newspaper has reported Mr Johnson may resign as Foreign Secretary before the weekend. \nBut he denied this when he spoke to reporters in New York, where he is accompanying Mrs May on a trip to the United Nations. \nAsked if he planned to walk out of the Cabinet, he said: “No. \n“We are a government working together, we are a nest of singing birds.” Read More Has anything else gone wrong? \nYes. The top official at the Brexit department has quit. \nOliver Robbins is standing down as permanent secretary at the Department for Exiting the EU, where his boss is Brexit Secretary David Davis. \nInstead he will work as the Prime Minister’s EU adviser. \nMr Robbins will remain as the UK’s lead official during exit talks with the EU. \nAnd this suggests Mrs May is taking a firmer grip on Brexit - but sidelining Mr Davis. How are the talks with the EU going? \nBadly. Mr Davis has been leading negotiations about Brexit, while French politician Michel Barnier leads the EU side. \nBut earlier this month, Mr Davis described the EU’s approach as “silly” in an appearance on the BBC’s Andrew Marr show. \nIt followed a press conference in which the EU representative complained that little progress had been made in talks about Brexit. Read More So is everything going wrong? \nIt depends who you talk to, naturally. \nLabour MP Catherine McKinnell, who represents Newcastle North, said: “The current situation is entirely down to the Government’s shambolic mishandling of this historic process. \n“The Prime Minister decided to trigger Article 50 at a point when her Ministers were clearly totally unprepared for what this would actually entail, and they don’t seem to be any further forward on being able to define what their strategy towards the negotiations is – other than setting out that we’d quite like to have our cake and eat it. \n“The fact that prominent Leave campaigners are now complaining that things are going badly wrong really should set some alarm bells ringing. \n“Nobody wants Brexit to fail, but we are now in serious danger of this process doing irreparable damage to our country and international standing.” \nConservative Guy Opperman, MP for Hexham, said: “This is an on-going process, which is a negotiation with 27 countries and it is going to be a slow and steady negotiation. \n“The reality is that we have two years to complete this process, and everybody accepts that it will take two years. \n“The will of the people will be followed, but of course there are on-going discussions as to how it is that we exit the European Union and the nature of the arrangements as we do so.” Like us on Facebook", "external_links": [], "published": "2017-09-20T07:00:00.000+03:00", "crawled": "2017-09-20T08:02:42.008+03:00", "highlightTitle": ""}