{"organizations": [], "uuid": "67795d1db715f87e9306ef948700a3c98250527e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/incoming/article499115.ece/ALTERNATES/s1200/Untitled-design-42.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/authors/anne-marie-morris/fly-tipping-must-stopped-anne-498768", "country": "GB", "title": "Fly-tipping must be stopped - Anne Marie Morris MP column", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-19T16:24:00.000+03:00", "replies_count": 0, "uuid": "67795d1db715f87e9306ef948700a3c98250527e"}, "author": "Anne Marie Morris", "url": "http://www.devonlive.com/authors/anne-marie-morris/fly-tipping-must-stopped-anne-498768", "ord_in_thread": 0, "title": "Fly-tipping must be stopped - Anne Marie Morris MP column", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "rural affairs", "sentiment": "none"}, {"name": "department for environment, food and rural affairs", "sentiment": "none"}, {"name": "national fly-tipping prevention group", "sentiment": "none"}, {"name": "tory party", "sentiment": "none"}, {"name": "the national farmers union", "sentiment": "none"}, {"name": "environment agency", "sentiment": "none"}, {"name": "cla", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nftpg", "sentiment": "none"}, {"name": "land association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Anne Marie Morris MP has criticised fly-tippers Share Comments Anne Marie Morris is the MP for Newton Abbot and has been since 2010. \nThe South West has some of the most beautiful scenery in the country and is one of the reasons Devon is such a holiday hotspot, however fly-tipping is becoming an ever growing problem in our rural areas. \nIn 2015/16 local authorities dealt with 936 thousand fly-tipping incidents with an estimated cost of clearance to local authorities in England of £49.8 million. Having spoken with a number of organisations within my constituency there is a real feeling that the legislation surrounding fly tipping and littering is just not strong enough. There is a problem that needs to be addressed. \nIn April this year the Government published the Litter Strategy for England. This included measures that were to be taken by Government to clampdown on those who litter and reduce the near £800 million burden to the taxpayer through clean-up costs. Read More We've won our fight to save train services to South Devon - but there are more battles ahead \nOn the specific issue of fly-tipping the Government has already taken a number of measures to help tackle the problem such as introducing fixed penalty notices for small scale offences and the ability to seize vehicles that are used for fly-tipping. \nThe Government has also enhanced the powers of the Environment Agency who deal with the worst examples of fly-tipping and have given around £30 million in extra funding over the next 6 years to tackle both waste crime and the causes of it. The Environment Agency is responsible for dealing with large scale fly-tips on public land that are hazardous, smaller fly-tips are the responsibility of the local authority if they are on public land. Anne Marie Morris MP \nThe National Fly-Tipping Prevention Group (NFTPG) will also be given extra support to carry out its work and is now chaired by the Department for Environment, Food and Rural Affairs. The NTTPG is a group of organisations that work to tackle fly-tipping by raising awareness about the anti-social nature and potential health and environmental damage it can cause. Read More Anne Marie Morris' suspension from Tory Party remains 'indefinite' \nThe Country and Land Association (CLA) last month produced their five point plan for “tackling the blight of fly-tipping”. In their plan they stated that almost two thirds of landowners and farmers are affected by fly-tipping each year. \nUnlike public land, where any tips are dealt with by the local authority, private landowners must clean up the rubbish themselves. This comes at a great cost with estimations between £50 - £150 million a year. Unfortunately at present there is very little data to provide an accurate picture of the whole problem. Anne Marie Morris MP Read More Man dumped rubbish over four miles of Dartmoor after claiming he ran a waste disposal firm \nThe National Farmers Union claim that the problem is currently getting worse. Having spoken to the NFU and landowners I know that there is certainly a growing problem of rubbish being dumped on private land, such as in front of gated areas. They are now calling for local authorities and the police to assist landowners in the clean-up and reporting of fly-tipped waste and to work with all parties to bring about greater action on prevention, prosecution and clean up. Fly tipping in Devon \nThe CLA’s five point plan also wants greater support for the victims of fly-tipping, and want to introduce a scheme to allow any private landlord who did not cause or knowingly permit the fly-tipping to dispose of it at a waste disposal site free of charge. They also want to remove the landowner’s liability to clear up waste on private land. Local authorities and private landowners should be working together to help catch those that are involved in fly-tipping. Read More Devon MP to lead the way on Brexit \nIn 2015/16, 494,460 enforcement actions were taken in relation to fly-tipping with 35,888 Fixed Penalty Notices given out. Given that The Department for Environment, Food and Rural Affairs states that there were 936,000 fly-tipping incidents in 2015/16 and only 53% ended up in some form of action with only 4% ended with a Fixed Penalty Notice, more collaboration needs to happen between private landowners and local authorities to catch serial offenders and send out a strong message that those who blight our countryside will be dealt with. Like us on Facebook ", "external_links": [], "published": "2017-09-19T16:24:00.000+03:00", "crawled": "2017-09-19T16:32:24.004+03:00", "highlightTitle": ""}