{"organizations": [], "uuid": "65d0d161aaa3c997acf7926313e1b583ae61be9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13605154.ece/ALTERNATES/s1200/CFR_NJL_110917square_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/square-one-law-strikes-eu-13604713", "country": "GB", "domain_rank": 21960, "title": "Square One Law strikes EU alliance with Brussels law firm in the run up to Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-12T02:01:00.000+03:00", "replies_count": 0, "uuid": "65d0d161aaa3c997acf7926313e1b583ae61be9e"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/square-one-law-strikes-eu-13604713", "ord_in_thread": 0, "title": "Square One Law strikes EU alliance with Brussels law firm in the run up to Brexit", "locations": [], "entities": {"persons": [{"name": "law", "sentiment": "none"}, {"name": "kemmlers", "sentiment": "none"}, {"name": "schuman", "sentiment": "none"}, {"name": "scott crosby", "sentiment": "none"}, {"name": "ian gilthorpe", "sentiment": "none"}, {"name": "neil warwick", "sentiment": "none"}, {"name": "kemmler", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "rond point", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "external action service", "sentiment": "none"}, {"name": "kemmlers", "sentiment": "none"}, {"name": "square one law", "sentiment": "none"}, {"name": "invalid email  newcastle", "sentiment": "none"}, {"name": "eu commission", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Square One Law strikes EU alliance with Brussels law firm in the run up to Brexit The firm has formed a partnership with Kemmlers to make sure its clients have access to EU advice Share Square One Law’s Ian Gilthorpe (left) and Neil Warwick (right) who have established a new strategic alliance with Brussels-based Kemmlers (Image: Square One Law)   Thank you for subscribing!   \nNewcastle law firm Square One Law has announced a strategic alliance with a Brussels-based EU law practice in a move that will grant its clients access to legal advice on the continent in the run up to Brexit. \nThe alliance sees the company partner with commercial law firm Kemmlers. The deal was struck due to the North East’s continued reliance on Europe, which sees local companies export more than 50% of its services to EU member countries. \nDespite the UK preparing to leave the EU, British businesses will still require access to European legal advice if they trade overseas. By partnering with Kemmlers, Square One is ensuring that its clients will have access to the advice they need to trade in the EU. \nSenior partner, Ian Gilthorpe, said: “As a firm we have never expressed a view as to whether remain or exit was better for the UK and have remained neutral in the Brexit debate. During the negotiations and whatever their outcome, our client base will need access to Europe and the EU as people will always find a way to trade regardless of politics. \n“Neil Warwick, who heads our EU and competition team, is the leading EU lawyer in the region and this alliance will allow us to provide the necessary support our clients require whilst also offering Kemmlers’ clients access to the UK market.” The Union flag and the EU flag flying (Image: PA) \nNeil Warwick, Head of EU and competition law at Square One Law, added: “I have had a long-standing working relationship with the Kemmler’s lawyers, which this alliance now formalises. \n“Rather than simplifying matters, the introduction of the EU Withdrawal Bill may mean that international businesses are subject to existing UK law and also have to interpret the new laws to an EU-style of explanation. As the EU develops new laws, some businesses may face a dual interpretation system, which undoubtedly will add to the complexity of doing business in Europe. Read More Is Brexit just another challenge for businesses across the North East to overcome? \n“The North East is more reliant on the EU as a market for its services than any other region in the UK; therefore we are keen to give our clients as much flexibility as we can as they position their businesses to navigate future challenges.” \nKemmlers, as one of the few remaining boutique EU law practice in Brussels, with offices on Rond Point, Schuman. Its base between the EU’s External Action Service and the Parliament, and directly opposite the EU Commission, places the firm at the centre of the EU. \nScott Crosby, head of Kemmlers, said: “This alliance makes perfect sense and should benefit our respective clients and both parties at this difficult time and beyond.” Like us on Facebook", "external_links": [], "published": "2017-09-12T02:01:00.000+03:00", "crawled": "2017-09-12T03:27:24.007+03:00", "highlightTitle": ""}