{"organizations": [], "uuid": "bd2d6e4dbf8d53a867c1668983753b55b07291a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10107706.ece/ALTERNATES/s1200/JS48366111.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/fast-growing-companies-must-face-13575408", "country": "GB", "domain_rank": 21960, "title": "Fast growing companies must face up to challenges of Brexit, Fastest 50 organiser says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-06T02:01:00.000+03:00", "replies_count": 0, "uuid": "bd2d6e4dbf8d53a867c1668983753b55b07291a5"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/fast-growing-companies-must-face-13575408", "ord_in_thread": 0, "title": "Fast growing companies must face up to challenges of Brexit, Fastest 50 organiser says", "locations": [], "entities": {"persons": [{"name": "colin", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "colin hewitt", "sentiment": "none"}, {"name": "hewitt", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "baltic    the north east", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "baltic", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "business fast", "sentiment": "positive"}, {"name": "eu", "sentiment": "none"}, {"name": "ward hadaway fastest", "sentiment": "none"}, {"name": "companies house", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east local enterprise partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Fast growing companies must face up to challenges of Brexit, Fastest 50 organiser says Newcastle law firm Ward Hadaway is warning companies in the North East of the need to plan for life after Britain leaves the EU Share Colin Hewitt, at the Fastest 50 event held at the Baltic Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North East’s pace-setting businesses need to face up to Brexit to continue their success, according to organisers of the Ward Hadaway Fastest 50 for 2017. \nColin Hewitt, partner and head of commercial law at Ward Hadaway, which organises the annual countdown of the region’s fastest growing companies, says businesses need to factor in the challenges and opportunities posed by the UK’s departure from the EU sooner rather than later. \nColin said: “Whilst March 2019 - when the UK is scheduled to leave the EU - may still seem some way off, it is actually very close and getting closer by the day. \n“To put it in context, Brexit could well have happened before the end of the next financial year for many companies, something which should concentrate the minds of many. \n“Whilst the final terms of our withdrawal and how trading with the EU will work has still to be determined, the fact that we are already on to the third round of negotiations between the UK and the EU demonstrates that the clock is very much ticking. \n“We are a trading nation and our supply chains are closely integrated with the wider European market - two-thirds of growth in UK exports comes from exporting parts and nearly a quarter of the value of UK exports comes from imports, according to figures on UK trade between 2000 and 2011. \n“Those companies which are the best prepared for Brexit are likely to be the ones who are able to meet the challenges and opportunities which it brings – and be the kind of companies to make it into future editions of the Ward Hadaway Fastest 50.” \nWard Hadaway, which has offices in Newcastle , Leeds and Manchester, devised the Fastest 50 back in 1998 as a way of highlighting and celebrating the achievements of fast-growing privately-owned companies across the North East. \nEvery year since then the UK Top 100 law firm has used publicly available figures from Companies House to compile a list of the businesses across the region who have seen the highest annualised growth in their turnovers whilst remaining profitable. \nAn awards ceremony is then held where awards are presented to the fastest growing small business, fastest growing medium-sized business and fastest growing large business with one of these winners being crowned the overall fastest growing business in the North East. \nThis year will be the 20th time that the Ward Hadaway Fastest 50 Awards have been held with the event taking place at Baltic, the Centre for Contemporary Art, in Gateshead on October 6. \nMr Hewitt said: “We are currently crunching the numbers to compile a list of the final 50 which will be independently verified before being published in The Journal later this month. \n“The qualities exemplified by the companies which make this year’s list – dedication, determination, adaptability and expertise – are precisely those which will be needed as we head into what are unchartered waters in a post-Brexit Britain. \n“However, while Brexit does represent something of a journey into the unknown, there are things which companies can do to prepare for what it could bring.” \nIn addition to advising clients on the implications of Brexit, Ward Hadaway has been working with the CBI and the North East Local Enterprise Partnership (LEP) this year to brief businesses and entrepreneurs on what the UK’s withdrawal from the UK could mean for them. \nNorth East LEP chair to be guest speaker at Fastest 50 event \nThe firm held a joint seminar in June looking at the issues and challenges ahead and there are plans for further events in the months to come as Brexit draws closer. \n“Despite a lack of clear answers to many questions posed by Brexit, business needs to get on with it and be ready to deal with things when they happen,” warned Mr Hewitt. \n“There are a number of practical steps which companies can take now, including establishing a communications strategy to address workers’ concerns about their statuses with regard to immigration and carrying out an audit to identify the skills and nationalities of your workforce and what rights they currently have. \n“It would also be useful for companies to review their existing contracts with customers and suppliers to see whether Brexit could affect the performance of those agreements and their cost and also to consider introducing a ‘Brexit clause’ to agreements which could allow them to be reviewed in certain circumstances. \n“On the more positive side of things, with the UK looking to expand trade with non-EU nations, companies would be well advised to build on existing trading relationships with other countries, to open routes to new international markets or a combination of both. \n“This is particularly pertinent to the North East which, as we know, is one of the few regions in the UK which is a net exporter of goods and services thanks to strengths in sectors such as manufacturing, energy and the offshore industry and the support of an experienced professional services sector. \n“We are already highly effective in this regard so building on those links and the skills needed to support our growing businesses is vital for the future success of the region’s economy – and those future Fastest 50 companies.” Like us on Facebook ", "external_links": [], "published": "2017-09-06T02:01:00.000+03:00", "crawled": "2017-09-06T02:45:27.000+03:00", "highlightTitle": ""}