{"organizations": [], "uuid": "662e11b45c71a8c7a4907e40a59ee05677ebabb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10569187.ece/ALTERNATES/s1200/JS78334004.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-west-end-foodbank-now-13677578", "country": "GB", "domain_rank": 21960, "title": "The Newcastle West End foodbank is now here to stay, says its manager", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-27T07:00:00.000+03:00", "replies_count": 0, "uuid": "662e11b45c71a8c7a4907e40a59ee05677ebabb0"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-west-end-foodbank-now-13677578", "ord_in_thread": 0, "title": "The Newcastle West End foodbank is now here to stay, says its manager", "locations": [], "entities": {"persons": [{"name": "michael nixon", "sentiment": "negative"}, {"name": "nixon", "sentiment": "none"}, {"name": "christopher", "sentiment": "none"}, {"name": "jean-paul sartre", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "christopher mole", "sentiment": "none"}, {"name": "daniel blake", "sentiment": "none"}], "locations": [{"name": "west end", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "north-east", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "newcastle west end foodbank", "sentiment": "negative"}, {"name": "news the newcastle west end foodbank", "sentiment": "negative"}, {"name": "benwell venerable bede", "sentiment": "none"}, {"name": "libération", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The Newcastle West End foodbank is now here to stay, says its manager Boss Michael Nixon said instead of a short term project they are now planning to be around for years to come Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe boss of the Newcastle West End foodbank , originally set up as a temporary measure to deal with those hardest hit by austerity, has admitted it is now here to stay. \nIt opened its doors in 2013 and is now the UK’s largest, handing out on average £10,000 worth of foodstuffs to 1,000 people a week. \nManager Michael Nixon said: “We are now moving onto the second phase of the food bank. \n“We have come to realise that instead of the foodbank being here for this year and maybe next, to fulfill our proper purpose we are going to have to be here for the next five years, if not longer. Michael Nixon project manager at Newcastle West End Foodbank \n“We need to think about the future and have a proper discussion about our longer term existence.” \nMr Nixon said he is now looking to Europe to find out how countries there deal with the issue, particularly Scandanavian countries like Denmark and Sweden. \nIronically as he looks to the continent for fresh ideas, it seems that Europe is coming to the Newcastle West End foodbank as its work is now making headlines there. Read More \nIt was recently the focus of a large article in the French newspaper Libération looking at how Brexit would affect places like the North East. Liberation online version of story \nThe politically centre-left paper was co-founded in Paris in 1973 by the French philosopher Jean-Paul Sartre. \nThe article in June, translated from French, begins: “The impoverished region of the North-East of the United Kingdom, weighed down by budget cuts and where the film I, Daniel Blake was filmed, foresees disastrous consequences caused by Brexit.” \nFor the article, the reporter spoke mainly to people who volunteered at the foodbank and those who use it who feel marginalised in today’s Britain. Read More \nMr Nixon said: “Coverage abroad is new, I think we were also contacted by another paper recently. I think our link up with Newcastle United has raised our profile which might explain it.” Michael Nixon, Chief Executive of the foodbank at Benwell Venerable Bede church \nThe article was spotted by Durham University student Christopher Mole. \nHe told us: “I came across the article whilst reading the newspaper online. A friend and colleague had also made me aware of it as they knew I was from Newcastle and that I’d be interested in the subject matter.” Read More Newcastle food bank launches urgent appeal as stocks run low \nChristopher said he “thought it was interesting to see a portrait of the West End foodbank and its staff - as well as meeting some of its users - from an outside perspective.” \nHe added: “To see an article describing the detail of people from my hometown and the plight that some people are in but in a removed context like France was rather powerful.” Like us on Facebook ", "external_links": [], "published": "2017-09-27T07:00:00.000+03:00", "crawled": "2017-09-27T08:16:29.008+03:00", "highlightTitle": ""}