{"organizations": [], "uuid": "e2f9ae717370d24d8db362bb15add5cdda8b081e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13465784.ece/ALTERNATES/s1200/JS125161803.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13577093", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Mike Ashley declares Sports Direct on track to become 'Selfridges of sport'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-06T10:30:00.000+03:00", "replies_count": 0, "uuid": "e2f9ae717370d24d8db362bb15add5cdda8b081e"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13577093", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Mike Ashley declares Sports Direct on track to become 'Selfridges of sport'", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "hellawell", "sentiment": "none"}, {"name": "doug tidswell", "sentiment": "none"}, {"name": "mark turner", "sentiment": "none"}, {"name": "john garner", "sentiment": "none"}, {"name": "nick beckwith", "sentiment": "none"}, {"name": "conor murphy", "sentiment": "none"}, {"name": "mike ashley  mike ashley", "sentiment": "none"}, {"name": "chester", "sentiment": "none"}, {"name": "keith hellawell", "sentiment": "none"}, {"name": "patrick parsons", "sentiment": "none"}, {"name": "grant richardson", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}, {"name": "peter stienlet", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "huddersfield", "sentiment": "none"}, {"name": "hermes investment management", "sentiment": "none"}, {"name": "west yorkshire police", "sentiment": "none"}, {"name": "royal london asset management and standard life aberdeen", "sentiment": "none"}, {"name": "thda", "sentiment": "none"}, {"name": "durham cathedral", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ldc", "sentiment": "none"}, {"name": "patrick parsons  newcastle", "sentiment": "none"}, {"name": "m&e", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Byron Burger closes its intu Metrocentre restaurant 18 months after opening \nUpmarket burger joint Byron Burger has closed its intu Metrocentre branch , less than 18 months after opening. \nThe popular burger chain launched in the Metrocentre last April, when it moved into The Qube leisure complex. \nBut, less than 18 months after opening, Byron has quietly closed its Gateshead restaurant and removed any reference to it from the company’s website. \nThe Journal contacted Byron Hamburgers to find out why the restaurant had moved out of the Metrocentre, but the company failed to respond. Intu, the company which owns the Metrocentre and Eldon Square shopping centres, confirmed that Byron had moved out. \nGavin Prior, general manager at the Metrocentre, said: “We’re always working hard to refresh our store line-up with new and exciting retailers to give our visitors the best possible shopping experience. Since the Qube development in 2016, we have introduced nine new catering brands to the centre, which include some of the best performing in their groups.” Byron at the Metrocentre (Image: Publicity Picture) 9.10 Coreena Ford Two North East start-ups win chance to prove themselves in the US after winning Sage competition \nTwo North East businesses have won a competition to be sent to the US on a business exchange programme that is designed to help them grow overseas. \nRobotics firm Drone Ops and software firm Recite Me were chosen as the inaugural winners of a competition launched by technology giant Sage in partnership with the Department for International Trade and Invest Atlanta. \nBoth companies will now be flying out to Atlanta in an attempt to boost their export business. \nDrone Ops, which is based in Newcastle’s Science Central, specialises in developing small unmanned aerial systems (SUAS) and robotics technology. \nRecite Me, which is led by former athlete Ross Linnett, is a cloud-based software firm that helps businesses make their website accessible to those with disabilities, or who speak another language. \nNewcastle tech giant Sage launched the Start-up Exchange Programme in partnership with the Department for International Trade, Newcastle City Council, Invest Atlanta, and the Atlanta Mayor’s Office. \nGreg Hands, the Minister of State in the Department for International Trade, said: “Drone Ops and Recite Me are showcasing the sort of creativity and innovation, which makes the North East a global tech hub. \n“It’s great to see them given this opportunity to reach new international customers with Department for International Trade support along with Sage, Invest Atlanta and the City of Newcastle.” Ross Linnett is founder and managing director of Gateshead-based Recite Me (Image: handout) 9.08 KEY EVENT Teesside Tata Steel plant to forge new generation of products following £2m investment \nTata Steel has announced a near £2m investment programme to build a new generation of offshore products. \nThe company said the move emphasises its commitment to supporting North Sea oil and gas production. \nThe investment will be made in its Hartlepool and Port Talbot plants. \nBarry Rust, energy and sustainability manager at Tata Steel, said: “These important investments demonstrate Tata Steel’s continued commitment to health and safety and improving and increasing our product range to the North Sea and the oil and gas industry around the world, to help it meet ever- increasing challenges. \n“We’ve been involved in some of the largest projects in the UK Continental Shelf over the last 20 years and look forward to supporting the North Sea and the international industry for many years to come.” Steel being rolled in the Hartlepool Pipe Mill 9.05 Coreena Ford Michelle Mone selling luxury flats through bitcoin \nEntrepreneur Michelle Mone is selling luxury flats through bitcoin as part of a £250m property venture with her billionaire boyfriend Douglas Barrowman. \nThe Scottish founder of lingerie brand Ultimo is developing two apartment blocks and a shopping mall in Dubai, with plans to sell 150 of the homes using the cryptocurrency. \nBaroness Mone, who launched the Be Digital Northumberland drive at Alnwick Gardens two years ago, expects the lion’s share of the residences to be snapped up by expatriates. \nShe said: “This is the first major development selling to the bitcoin community. There has been one apartment here and there, one house here and there, but never a development. \n“I think it is exciting for that world that two well-known successful business people are backing it in a major development.” \nThe Aston Plaza and Residences will stretch across 2.4 million square feet and offer 1,133 studio, one bedroom and two-bedroom apartments inside two 40-storey towers. \nCommunal areas will be designed by her company Michelle Mone Interiors, while the shopping mall will feature boutique stores, cafes and restaurants. \nThe average price of a one bedroom apartment stands at $239,000, or around 58 bitcoin. \nBitcoin is the world’s leading cryptocurrency and uses a decentralised technology - or blockchain- for secure payments. \nMr Barrowman, chairman of finance and property management giant Knox Group, said bitcoin “represents an opportunity”. “We are the early adopters of the cryptocurrency to date and serious business people and the institutions are now looking at it. “The next five to 20% movement and adoption will take it mainstream, and then it becomes part of everyday life.” \nIf plans to sell apartments through bitcoin struggle, then Mr Barrowman will look to price up the properties in US dollars. Michelle Mone at the Be Digital Northumberland launch event 9.00 Coreena Ford Railtown Coffee brews up growth plan in expansion to new base \nA North East artisan coffee purveyor is preparing to roast the competition after moving into larger premises. \nAndrew Henley set up Railtown Coffee four years ago in Darlington, County Durham, as an independent supplier of freshly-roasted coffee to customers across the UK. \nHe launched the firm after working in the restaurant sector for 25 years, spotting an opportunity to improve on the standards of customer service he had received from the coffee suppliers with which he’d worked. \nSince then, the company has built up a customer base ranging from small cafes and farm shops through to large hotels and Michelin-starred restaurants, in­­cluding The Raby Hunt at Summerhouse and the Star Inn at Harome. \nNow, as part of plans to turn Railtown into the North East’s premier coffee supplier, the company has moved into new premises on the Aycliffe Trading Estate which are twice as large as its previous office, and which it hopes will help the company build on the 30% growth in turnover it has recorded in the last year. \nThe new premises include a training room, as well as space for a pop-up cafe where customers can try any of the dozen different blends that Railtown supplies. \nAs well as supplying coffee, Railtown supplies the equipment customers need to make their coffee, and provides training to ensure drinks are being made in precisely the right way. \nIt also employs a dedicated engineer to service and maintain customer equipment as required. \nRailtown Coffee has worked with RMT Accountants and Business Advisors on the move and the firm’s continuing development. Andrew Henley of Railtown Coffee (Image: Footprint Public Relations) 8.55 Coreena Ford North East business leaders join fight for replacement Metro trains \nBusiness leaders in the North East have urged the government to fund a new fleet of trains for the Tyne and Wear Metro. \nThe North East England Chamber of Commerce, the Confederation of British Industry (CBI) and the Federation of Small Businesses (FSB) have backed a campaign to persuade ministers to make an early decision on funding new Metro trains. \nDiscussions with the government on a £400m new fleet of trains are ongoing, but delays linked to the ageing Metros have become a growing source of frustration to both commuters and employers around the region. \nThe fleet dates back to the early 1980s and they are now some of the worst performing vehicles of their kind. \nResearch in the region suggests that the £400m cost of a replacement fleet would be repaid three times over in benefits to the region’s economy by supporting growth and reducing congestion. A mock up of a potential Metro design - the final look will depend on the manufacturer (Image: Nexus) 8.50 Coreena Ford Housebuilder Berkeley says Brexit is compounding London property market woes \nHousebuilder Berkeley Group has renewed its warning over the impact of Brexit uncertainty on London’s property market amid fears over the “terms and implications” of the UK’s withdrawal. \nThe group, which is focused on London and the South East, said the Brexit worries are compounding already difficult conditions in the capital after recent stamp duty tax hikes and planning woes. \nBut Berkeley said it remains in “excellent shape” despite the London housing sector troubles, with annual profits set to be “at least as strong” as the previous year. \nTrading for the first four months of the financial year has been in line with expectations and sales prices are above business plan levels, according to the group. \nThe update comes as Berkeley prepares to face shareholders at its annual general meeting, with the potential for an investor revolt over pay after six executives collectively took home £92m this year. \nTwo shareholder advisory groups - Glass Lewis and Pirc - have already urged investors to vote against the pay deals, which saw bosses including chairman and founder Tony Pidgley and chief executive Rob Perrins pick up hefty windfalls from long-term incentive schemes. 8.45 Coreena Ford North East founded housebuilder Barratt sees profits soar to £765m \nNewcastle-founded Barratt Developments has reported rising full-year profits as “robust consumer demand” helps prop up the housing market, despite signs of a wider slowdown triggered by the Brexit vote. \nThe UK’s biggest housebuilder booked a 12.1% increase in pre-tax profit to £765.1m in the year to June 30, while revenue rose 9.8% to £4.65bn. \nBarratt’s average selling price for its homes in the period increased by 6% to £275,200 and total completions came in at 17,395, up marginally compared with 2016 and the highest level in nine years. \nThe company said that while June’s general election created some uncertainty and the impact of Brexit is still unknown, the combination of Government support for housebuilding, attractive mortgage finance and Help to Buy continue to “support robust consumer demand”. \nForward sales are up 13.8% and chief executive David Thomas said: “This has been another excellent year for the group. \n“We have delivered a strong operational and financial performance and our highest completion volumes for nine years. \n“The group starts the new financial year in a good position with a strong balance sheet, healthy forward sales and we continue to see robust consumer demand supported by a positive mortgage environment.” \nThe results come as industry data points to a wider slowdown in the housing market. \nThe latest figures from Nationwide Building Society showed house prices dropped by 0.1% in August, signalling that pressure on household finances from Brexit-fuelled inflation is hitting buyer confidence. Signs on a Barratt Developments site (Image: PA) 8.40 What's the FTSE latest? \nThe FTSE-100 index at 8:15am was down 33.32 at 7339.60. \nThe pound at 8am was 1.3020 dollars compared to 1.3013 dollars at the previous close. The euro at 8am was 0.9153 pounds compared to 0.9152 pounds at the previous close. 8.38 KEY EVENT Multimillion-pound investment fuels growth for Newcastle's Patrick Parsons \nNewcastle engineering consultancy Patrick Parsons is fuelled for further growth following a multimillion-pound investment by a private equity firm. \nLDC, the leading UK mid-market private equity firm, has backed the consultancy Patrick Parsons with an undisclosed development capital investment to support the firm’s UK expansion strategy, together with the acquisition of infrastructure engineering specialist THDA. \nThe Newcastle-headquartered firm, which also has offices in London, Glasgow, Huddersfield, Chester, Birmingham, Manchester, Dubai and Sydney, has more than 250 specialist engineers and provides design services across civil, structural, geo-environmental and M&E disciplines to blue-chip clients in the residential, commercial and infrastructure sectors. \nSome of the firm’s most notable projects include consulting on restoration works at Durham Cathedral and developing the world’s first modular flat packed white water course in Glasgow. \nUnder the leadership of managing director Peter Stienlet and board directors Mark Turner, Grant Richardson, Doug Tidswell, Conor Murphy and Nick Beckwith, Patrick Parsons has seen significant growth over the past 10 years, both organically and through a targeted acquisition strategy. \nSince leading a management buyout in November 2007, the business has increased turnover from £1m in 2007 to £18m. \nFurther growth is now expected with LDC backing the management team to continue its growth strategy and the investment will support the immediate acquisition of THDA in Birmingham, which specialises in the design of civil engineering infrastructure for development schemes such as major highways, roads, earthworks modelling and flood risk assessments. \nPeter Stienlet, Managing Director at Patrick Parsons, said: “We have grown significantly and this is undoubtedly down to the hard work and commitment of our people. We pride ourselves on having created a collaborative business culture that has a strong focus on the values of a family business and this has enabled us to continue to attract and retain the best talent, and continue to grow and expand.” \nJohn Garner, Head of LDC in Yorkshire and the North East, added: “We’re committed to backing ambitious management teams in the North East and this latest deal signals our intent to continue investing in the region. We’ve expanded our team on the ground and with a healthy pipeline of activity there’s no doubt the region will play an important role in our commitment to invest £1.2bn nationally over the next three years.” Newcastle-based Patrick Parsons played a major part in the design and build of the world's first packaged white water course which opened in Glasgow 8.30 KEY EVENT Sports Direct to be 'Selfridges of Sport', says Newcastle United owner Mike Ashley \nMike Ashley, the billionaire owner of Newcastle United has said Sports Direct is on track to become the “Selfridges of sport” ahead of an AGM that could see the firm’s chairman toppled as shareholder frustration at the retailer mounts. \nIn a stock market note to shareholders the chain said the outlook “remains optimistic”, with earnings growth expected to be 5% to 15% ahead of last year and the performance of its “new generation flagship stores” exceeding expectations. \nMr Ashley said: “We remain fully focused on our strategic goal of moving our core business towards the ‘Selfridges’ of sport in order to further strengthen our proposition and drive long-term profitability.” \nHis comments come as pressure mounts on chairman Keith Hellawell, with a number of investors in the retailer publicly voicing their opposition to his re-election ahead of a crunch vote at today’s annual general meeting. \nThe former West Yorkshire Police chief constable and government drugs tsar has presided over a long list of scandals and controversies at the chain, and has pledged to step down if he does not receive the support of a majority of independent shareholders. \nIn January, Mr Hellawell saw 54% of independent shareholders vote against his reappointment and was only saved by Mr Ashley, who owns 55% of the company and whose backing meant he was re-elected with a total of 80.92% of votes cast. \nHermes Investment Management, Royal London Asset Management and Standard Life Aberdeen are among the investors to say they intend to vote against the chairman’s re-election. \nAs part of the trading update, Mr Ashley confirmed that Sports Direct now owns 100% of premium fashion chain Flannels. Mike Ashley (Image: Joe Giddens/PA Wire) More On ", "external_links": [], "published": "2017-09-06T10:30:00.000+03:00", "crawled": "2017-09-06T10:47:17.004+03:00", "highlightTitle": ""}