{"organizations": [], "uuid": "e7722cb286d19f32b96c3edcac09cca08ed2233f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13514974.ece/ALTERNATES/s1200/SSR_NEC_210817minister_05.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northern-powerhouse-danger-becoming-obsessed-13590264", "country": "GB", "domain_rank": 21960, "title": "Northern Powerhouse in danger of becoming obsessed with 'photo op' projects", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-10T10:00:00.000+03:00", "replies_count": 0, "uuid": "e7722cb286d19f32b96c3edcac09cca08ed2233f"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northern-powerhouse-danger-becoming-obsessed-13590264", "ord_in_thread": 0, "title": "Northern Powerhouse in danger of becoming obsessed with 'photo op' projects", "locations": [], "entities": {"persons": [{"name": "ben craig", "sentiment": "none"}, {"name": "craig", "sentiment": "none"}, {"name": "jake berry", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "fazeley", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "wear bridge", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "uk small and medium sized enterprises", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "facebooks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northern Powerhouse in danger of becoming obsessed with 'photo op' projects Expert said more attention should be given to attracting and keeping companies and workers to the region Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Northern Powerhouse is in danger of becoming a ‘hollow vehicle’ obsessed with ‘photo op’ schemes which could ultimately doom it to failure, it has been claimed. \nTax expert Ben Craig says at present too much emphasis is being placed on large infrastructure projects like HS2 instead of making small changes to help attract businesses to the region. \nMr Craig said to make the North flourish it needs \na structure of financial incentives not only to bring firms and workers to the region, but also to retain the talent already here. Jake Berry MP, the Northern Powerhouse minister visits the new Wear Bridge at Sunderland \nHe said: “As much as the North needs railways, it also needs small businesses that can flourish, grow and succeed outside of London. \n“At the moment, the main concern is the brain drain – a direct pipeline of talent and inspiration that trickles from the North to the South. \n“Graduates complete their studies in the North with an eye on a job in London. Technology start-ups form in the North but end up relocating to the capital. It’s an unhealthy situation, drawing entrepreneurs and their funding away from the region.” \nHe suggested special economic zones (SEZ) which can be focused on a different emerging sector, for example Artificial intelligence, machine learning or virtual reality, creating hotspots of innovation. \nMr Craig, manager of research and development for tax incentives for the company Ayming, said there should be tax incentives both for companies and staff to relocate to these zones. The Birmingham and Fazeley viaduct, part of the proposed route for the HS2 high speed rail scheme (Image: HS2/PA Wire) \nFor companies it could be lower corporation taxes or taxation holidays where they could receive preferential rates for activities in particular regions or industries. \nFor staff it could mean income tax breaks or a reduction in student loan payments. \nMr Craig said: “These types of initiatives are effective and can gift a region its own gravitational pull, attracting forward-thinking companies. \n“Not only this, but it also acts as a carrot to foreign investment.” Read More Northern Powerhouse minister warns 'devolution is not the only game in town' during North East visit \nMr Craig said that as well as taxation, the Government needs to review its research and development policy. \nThis area, he says, is crucial to emerging technologies and so special economic zones should offer extended research &amp; development tax credits. \n“These would provide tax reductions or cash payments against costs incurred whilst developing or improving products within a certain industry – beyond the credits already available to UK Small and Medium Sized Enterprises,” he said. \nWhile the North East’s exact place in the Northern Powerhouse scheme is still uncertain, the Minister responsible for it, Jake Berry, recently said ‘devolution wasn’t the only game in town’. \nWith Brexit negotiations under way, Mr Craig said leaving Europe could provide fresh opportunities for the government helping UK regions develop. \nOnce out of Europe, what State aid can be given out won’t be controlled as it is now by EU regulations. \nIf done correctly, Mr Craig said, the Northern Powerhouse could be a prototype for Britain’s future. Read More North East left out of Northern Powerhouse meeting as it has no elected mayor \nHe said: “Infrastructure is vital, as are strong, reliable and quick transport links. \n“The missing piece – the culture and environment of innovation and entrepreneurship – is needed to attract the Googles and Facebooks of this world... or help nurture their rivals.” \nHe added: “I wouldn’t say it is entirely failing, I think there’s a lot of good things being done, but at the moment it’s only looking at parts of the picture.” Like us on Facebook ", "external_links": [], "published": "2017-09-10T10:00:00.000+03:00", "crawled": "2017-09-10T10:44:31.000+03:00", "highlightTitle": ""}