{"organizations": [], "uuid": "a0d03a248fe6b56cad57e56eb89728469b72ae3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13116077.ece/ALTERNATES/s1200/Employers-can-afford-pay-rise.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-rising-cost-living-means-13558004", "country": "GB", "domain_rank": 21960, "title": "How the rising cost of living means wages are falling in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-01T18:00:00.000+03:00", "replies_count": 0, "uuid": "a0d03a248fe6b56cad57e56eb89728469b72ae3e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-rising-cost-living-means-13558004", "ord_in_thread": 0, "title": "How the rising cost of living means wages are falling in the North East", "locations": [], "entities": {"persons": [{"name": "rebecca long-bailey", "sentiment": "none"}], "locations": [{"name": "north east the north east", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "brexit  one of labour", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "energy", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How the rising cost of living means wages are falling in the North East The North East has the lowest wages in England and they have been falling in 'real terms' Share Notes and coins on a payslip (Image: PA) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nReal wages have fallen in the North East , leaving working people poorer. \nNew data compiled by House of Commons officials reveals wages have fallen by an average of 0.1% each year in real terms since 2010. \nThe figures were published by the Labour Party as part of its campaign to highlight plans for a major increase in the minimum wage if it wins power. \nAverage weekly pay in the North East, including any bonuses such as overtime, is £503 a week, according to official figures. \nAnd this is up from £492 a week in 2013. \nBut the new study looks at what has happened to wages in real terms, which means after inflation is taken into account. \nIt found that wages in the North East fell in real terms by 0.1% a year on average over the past seven years. \nThe good news for the region is that this is the smallest fall in the country. The people hit hardest by wage cuts are in London, where earnings fell by 1.2% a year in real terms. \nHowever, the North East still has the lowest average wage of any part of England, and any part of the United Kingdom except Northern Ireland. In London, the average weekly wage is currently £753. \nPay rises for public sector workers are currently frozen at 1% a year while inflation is 2.6%. This means that they are being cut in real terms each year. \nBut many workers in the private sector have also suffered real terms pay cuts. \nAnd official figures show the cost of some essential items has risen even faster than the overall inflation rate. \nAccording to the Office for National Statistics, the cost of clothing and footwear rose by 3.2% in the 12 months up to July 2017. The cost of fish rose by 7.4% in this period and the cost of fruit rose by 3.6%. Read More Japan Prime Minister insists Japanese investors have faith in the UK after Brexit \nOne of Labour’s proposals is a major increase in the “national living wage”, effectively the new minimum wage which employers are forced to pay. \nLabour says it expects to increase this to £10 an hour in 2020, if it is in power, and to ensure it applies to every worker over the age of 18. \nThe policy means that 287,000 in the North East and Cumbria will receive a pay rise under a Labour government, the party says. \nAt the moment, the minimum wage for people aged more than 25 is £7.50 an hour, including the so-called national living wage. \nThe minimum wage for workers aged 18 to 20 is £5.60 an hour, so minimum wage workers in this age range could enjoy a significant pay increase under Labour. Critics would argue that the change might also make some employers less willing to employ younger workers. Read More Six out of ten North East cops wouldn't recommend a career in the police force \nConservatives point out that more people are actually in work than ever before. \nLatest employment figures show 1.224 million people are working in the North East, up from 1.155 in the same period in 2015. \nRebecca Long-Bailey MP, Shadow Secretary of State for Business, Energy and Industrial Strategy, said: “The Government’s record on the economy is one of failure, with productivity and real wages lower now than they were in 2007. \n“Tackling low productivity is a complex issue and will involve measures which include increasing private and public investment in skills, capital and R&D, access to finance for firms. But boosting wages is key too. Higher wages act as a spur for firms to invest in new technology and skills so as to become more productive and maintain profitability. \n“Labour will boost wages and productivity by introducing a £10 an hour minimum wage by 2020, putting more money in people’s pockets and building an economy that works for the many not the few.” \nThe Conservative Party was approached for a comment. Like us on Facebook", "external_links": [], "published": "2017-09-01T18:00:00.000+03:00", "crawled": "2017-09-01T18:50:58.034+03:00", "highlightTitle": ""}