{"organizations": [], "uuid": "f2465ab378d93035eb02be97814b11fee6d7de60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i4.leicestermercury.co.uk/incoming/article410495.ece/ALTERNATES/s1200/Hinckley-is-increaslingy-congested.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/local-news/119m-bid-government-cash-ease-410374", "country": "US", "domain_rank": 48128, "title": "£11.9m bid for Government cash to ease Hinckley traffic congestion fails - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.119, "site_type": "news", "published": "2017-09-02T16:39:00.000+03:00", "replies_count": 0, "uuid": "f2465ab378d93035eb02be97814b11fee6d7de60"}, "author": "Dan Martin", "url": "http://www.leicestermercury.co.uk/news/local-news/119m-bid-government-cash-ease-410374", "ord_in_thread": 0, "title": "£11.9m bid for Government cash to ease Hinckley traffic congestion fails - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "hinckley", "sentiment": "negative"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "david bill", "sentiment": "none"}, {"name": "earl shilton", "sentiment": "none"}, {"name": "blake pain", "sentiment": "none"}, {"name": "john street", "sentiment": "none"}], "locations": [{"name": "hawley road", "sentiment": "none"}, {"name": "county hall", "sentiment": "none"}, {"name": "brookside", "sentiment": "none"}, {"name": "dean road west", "sentiment": "none"}, {"name": "derby road", "sentiment": "none"}, {"name": "ashby road", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "dean road", "sentiment": "none"}, {"name": "barwell", "sentiment": "none"}, {"name": "lancaster road", "sentiment": "none"}], "organizations": [{"name": "loughborough", "sentiment": "none"}, {"name": "hollycroft", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "leicestershire county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "£11.9m bid for Government cash to ease Hinckley traffic congestion fails A vastly scaled back programme of work is now planned Share \nA bid for nearly £12 million of Government cash to improve the transport network in Hinckley has failed. \nLeicestershire County Council applied for the cash to fund major improvements to roads around the town. \nNow however officials are having to scale back the proposals as only £800,000 is available. \nThe bid sought cash for capacity improvements on the A47, at the junction of the A447 and the approach to the A5 Dodwells roundabout, to support development sites in Hinckley and the sustainable urban extensions at Barwell and Earl Shilton. Read More \nIt also proposed capacity improvements at the B590 Rugby Road junctions with Hawley Road and Brookside, improved signs. and parking and traffic management, further walking and cycling routes and crossings across Hinckley town centre. \nAn extended 20mph zone in streets off the main B-road network was also wanted. \nNow however County Hall has to scale back the scheme due to lack of funds though officials are trying to find other sources of cash. \nProposed works are now currently restricted to forming a right turn lane and pedestrian crossing islands at the Derby Road junction with John Street, minor signal junction improvements and cycling facilities at the Ashby Road junction with Derby Road and cycle route links on Dean Road and Dean Road West. \nThere will be cycle parking across Hinckley and pedestrian crossing improvements in Lancaster Road. Read More Loughborough councillor urged to rep... \nTransport spokesman for the county council’s Liberal Democrat opposition David Bill represents Hinckley’s Hollycroft division. \nHe said: “The good news is there is commitment to the Lancaster Road crossing which as been a priority for many years. \n“That is the end of the good news. \n“This small package of measures will do nothing to relieve the major congestion in the town that grows worse day by day. \n“There are massive queues getting into and out of town, massive queues on the M69 to Leicester and none of this will be addressed. \n“Every few years glossy new schemes come forward that contain the prospect of major investment in our roads and time and time again when the bids go in it comes to nothing.” Read More Andrew Bridgen - 'The media is failing to report Brexit properly' \nConservative cabinet member for highways coun Blake Pain said: “It was disappointing not to receive the funding required from the local growth fund to deliver all of the schemes, but we will not let this deter us from making improvements to Hinckley. \n“We have made a good start in tackling congestion and boosting growth throughout the area and we want to continue in the same vein.” \nThe council’s environment and transport scrutiny committee will meet on Thursday, September 7, to discuss the plans, following this, the council’s cabinet will decide whether to go ahead with the proposals. If approved the schemes to be delivered in 2017/18 will be consulted on in the autumn. Like us on Facebook ", "external_links": [], "published": "2017-09-02T16:39:00.000+03:00", "crawled": "2017-09-02T19:12:13.003+03:00", "highlightTitle": ""}