{"organizations": [], "uuid": "77de25345962830855296b6d44a78cf33f7e5180", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/news/devon-news/article459274.ece/ALTERNATES/s1200/Ben-Bradshaw-2PNG.png", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/ben-bradshaw-completely-changed-mind-472967", "country": "US", "title": "Ben Bradshaw: Why I have completely changed my mind over Jeremy Corbyn - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.124, "site_type": "news", "published": "2017-09-13T20:01:00.000+03:00", "replies_count": 0, "uuid": "77de25345962830855296b6d44a78cf33f7e5180"}, "author": "Phil Goodwin", "url": "http://www.devonlive.com/news/devon-news/ben-bradshaw-completely-changed-mind-472967", "ord_in_thread": 0, "title": "Ben Bradshaw: Why I have completely changed my mind over Jeremy Corbyn - Devon Live", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "devon live ben bradhsaw", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "adrian chiles", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "devon tories", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ben Bradhsaw after increasing his majority in May Share Comments \nExeter MP Ben Bradshaw says Jeremy Corbyn is \"growing\" into his role as party leader and deserves to lead the party into the next General Election. \nMr Bradshaw, whose rise to the Cabinet came in the Blair and Brown years, had previously been scathing of Corbyn and his supporters in the Momentum movement. \nA year ago, during the row over a leaked list of MPs accused of \"abusing Corbyn\" he wrote an opinion piece calling the party's leadership a \"destructive combination of incompetence, deceit and menace\". \nIn the run-up to the election, Mr Bradshaw feared he might lose his seat until Theresa May's catastrophic campaign and a surge in support for Corbyn turned the tables massively, giving him and even bigger majority in the seat he has now held for 20 years. \nSpeaking to the BBC today, he readily admitted he had not backed Corbyn in two acrimonious leadership campaigns but gave him credit for reviving Labour's fortunes. \n\"We are a democratic party and all entitled to our view,\" he told Adrian Chiles on Radio 5 Live. \n\"I see a man who is growing into the job. I take my hat off to him for the way he performed in the election campaign - it was an incredible achievement to deny the Tories a majority and since then he has got better all the time. \n\"He has certainly earned the right to lead Labour into the next election if that's what he wants to do. And just look at the way he has shifted Labour's position on Brexit - absolutely vital in my view and a position that something that the majority of the voting public and Labour party members wanted.\" \nBen Bradshaw calls on Devon Tories to break ranks and defend democracy in Commons Brexit vote \n\"It is something which in all honesty I didn't expect him to do and has been an extremely welcome move.\" \nDuring his interview a Tory MP heckled that Corbyn had gone into the election \"with one view\" only to come out with another, Bradshaw snapped: \"We lost and so did you so the manifestos are completely irrelevant.\" \nHe went on: \"[Jeremy] has recognised that the hard Brexit which is being driven by ideological right-wing Tories is going to be a disaster for years to come and that for me is leadership.\" Read More ", "external_links": [], "published": "2017-09-13T20:01:00.000+03:00", "crawled": "2017-09-13T21:56:49.006+03:00", "highlightTitle": ""}