{"organizations": [], "uuid": "555c9be6ee599d0b1b3e0a80646abd090eb665e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13651336.ece/ALTERNATES/s1200/Minister-visits-GE-plant.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/minister-tasked-leading-brexit-comes-13651226", "country": "GB", "domain_rank": 21960, "title": "The minister tasked with leading Brexit comes to Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-21T07:00:00.000+03:00", "replies_count": 0, "uuid": "555c9be6ee599d0b1b3e0a80646abd090eb665e5"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/minister-tasked-leading-brexit-comes-13651226", "ord_in_thread": 0, "title": "The minister tasked with leading Brexit comes to Newcastle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News The minister tasked with leading Brexit comes to Newcastle Steve Baker visited General Electric in Walker as part of the government’s engagement with businesses ahead of Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East businesses have a bright future outside the EU – the minister for Brexit has insisted. \nSteve Baker, minister for exiting the EU , came to the region as part of a government programme to engage with UK businesses as Brexit negotiations continue. \nAs part of the tour the Wycombe MP spent an afternoon at General Electric Oil & Gas in Walker - a world-leader in designing and making flexible pipes to bring subsea oil and gas reserves to a surface platform. \nMr Baker said: “As part of the team responsible for ensuring a smooth and successful Brexit, we want to hear from companies about their concerns. Minister for Exiting the EU, Steve Baker on a visit to GE Wellstream, Walker. He is pictured with Managing Director Rusty Justiss (Image: Newcastle Chronicle) \n“Negotiations are ongoing and we are in a position where it is crucial to talk about future relationships when it comes to trade. \n“We also need to understand timelines on decision making, and how we can best give businesses the certainty they need.” \nOn his visit to General Electric, he said: “People have been very frank with us about their needs and it’s clear that a top priority is citizen’s rights, and how we make the UK an attractive place for talent. \n“That is absolutely a top priority for the government.” Read More Plunge in business confidence sees firms downsize and going out of operation \nThe minister said he was “confident” about the future of business in the North East. \n“We are determined there is going to be global trade and this company is a great example - a key part of their export market is to Brazil. \n“We need to work to ensure companies like this one are supported to grow their export markets.” Minister for Exiting the EU, Steve Baker on a visit to GE Wellstream, Walker. Pictured are Plant Manager Mark Stokes, Managing Director Rusty Justiss, Steve Baker and Director of Government Affairs at GE Craig Jones (Image: Newcastle Chronicle) \nMr Baker also said he had no concerns for the future of North East plants including Nissan and Hitachi, saying, “I’m convinced we can continue to make the UK a more attractive place to do business.” \nCraig Jones, director of government affairs at General Electric, said: “Today’s visit has been very useful. We wanted to show our excellent export record - 80% of our output is for export to places like Brazil, Venezuela and Angola. \n“But we want to build on that and win contracts in Africa and Asia to grow our success story.” \nMr Baker’s visit came as a survey of members at the Federation of Small Businesses (FSB) showed that small business confidence has plummeted to its lowest level since immediately after last year’s Brexit vote. \nFSB national chairman Mike Cherry called for help for small firms in the autumn Budget and a three-year Brexit transition deal. Like us on Facebook", "external_links": [], "published": "2017-09-21T07:00:00.000+03:00", "crawled": "2017-09-21T08:19:33.015+03:00", "highlightTitle": ""}