{"organizations": [], "uuid": "e32813e621264a8a79c2c1b4f523698c7f40915c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13667474.ece/ALTERNATES/s1200/Labour-Party-annual-conference-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-labour-politicians-urge-13667374", "country": "GB", "domain_rank": 21960, "title": "North East Labour politicians urge Jeremy Corbyn to back Single Market membership", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-24T16:35:00.000+03:00", "replies_count": 0, "uuid": "e32813e621264a8a79c2c1b4f523698c7f40915c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-labour-politicians-urge-13667374", "ord_in_thread": 0, "title": "North East Labour politicians urge Jeremy Corbyn to back Single Market membership", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "joe anderson", "sentiment": "none"}, {"name": "alison mcgovern", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "heidi alexander", "sentiment": "none"}, {"name": "chuka umunna", "sentiment": "none"}, {"name": "marr", "sentiment": "none"}, {"name": "clive lewis", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "brighton", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}], "organizations": [{"name": "news north east labour", "sentiment": "negative"}, {"name": "north east labour", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "ssi", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "ssi redcar", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour government", "sentiment": "none"}, {"name": "invalid email  north east labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East Labour politicians urge Jeremy Corbyn to back Single Market membership Divisions over Brexit emerge at Labour conference as Jeremy Corbyn sets out his objections to the EU single market Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nNorth East Labour politicians have urged leader Jeremy Corbyn to back staying in the European Single Market even after Brexit. \nBut speaking as Labour’s annual conference takes place in Brighton, Mr Corbyn made it clear he opposed single market membership, claiming it might prevent a Labour Government from carrying out radical policies such as taking the railways back into public control. \nIt means Labour’s divisions over Brexit were out in the open as the conference began. \nNewcastle North MP Catherine McKinnell, Sedgefield MP Phil Wilson and Nick Forbes, leader of Newcastle City Council, all signed a letter warning it makes no sense for Labour to call itself an anti-austerity party while also insisting that the UK must leave the Single Market. Labour leader Jeremy Corbyn (left) and Deputy Leader Tom Watson (Image: PA) \nThe letter said: “ Labour should commit to staying in the Single Market and Customs Union – ruling out no options for how to achieve this – and to working with sister parties and others across Europe to improve workers’ rights, boost trade union membership and put an end to the exploitation of workers, not freedom of movement. \n“This would send a powerful message of solidarity to the rest of Europe , and to the millions of EU and UK nationals living in limbo here and across the continent. \n“Labour is right to argue for a transitional period as we leave the EU, but we must now go further. \n“It is simply unsustainable to say we are an anti-austerity party but that we would jeopardise ties with our biggest trading partner.” \nThe letter was signed by more than 30 Labour MPs, MEPS, unions leaders, members of the House of Lords and local Government leaders. \nThey included backbench MPs Chuka Umunna, Alison McGovern, Heidi Alexander and Clive Lewis, as well as Liverpool mayor Joe Anderson. \nLabour’s current position is to back a transition period after Brexit takes place in March 2019, which would mean the UK remains in the Single Market temporarily. \nThere is no clear policy on whether the UK could then continue to have permanent Single Market membership. Labour says it backs a “jobs first Brexit” and would consider whether staying in the Single Market is the best way to achieve that. \nHowever, Mr Corbyn made it clear he is deeply sceptical about the Single Market in an interview with the BBC’s Andrew Marr Show. \nHe said: “I would also say that we need to look very carefully at the terms of any trade relationship ‘cause at the moment we’re part of the single market, obviously. That has within it restrictions in state aid and state spending. \n“That has pressures on it through the European Union to privatise rail for example and other services.” Read More Theresa May pledges to pay billions to EU and wants two-year Brexit transition period \nAsked by Marr to give an example of something Labour wanted to do that Single Market membership might have prevented, Mr Corbyn said a Labour Government would have intervened to prevent the closure of SSI’s steel plant in Redcar. \nHe said: “I would have wanted us to intervene immediately on SSI Redcar when the steel industry was in a crisis at that time. The Government claimed there were issues of state aid. We disputed that at the time.” \nReports over the weekend suggested the Conservative Government is divided over Brexit, with supporters of Foreign Secretary Boris Johnson claiming he prevented Prime Minister Theresa May backing a “soft” version of Brexit in a major speech on Florence last week. Like us on Facebook", "external_links": [], "published": "2017-09-24T16:35:00.000+03:00", "crawled": "2017-09-24T17:03:23.004+03:00", "highlightTitle": ""}