{"organizations": [], "uuid": "a86e653682573a0650ac6c9ad6bb97ac92f32cb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9801065.ece/ALTERNATES/s1200/JS49668848.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/uk-economy-open-brexit-business-13689896", "country": "GB", "domain_rank": 21960, "title": "The latest corporate hooey is driving me mad - now it will annoy you too", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-28T20:00:00.000+03:00", "replies_count": 0, "uuid": "a86e653682573a0650ac6c9ad6bb97ac92f32cb7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/uk-economy-open-brexit-business-13689896", "ord_in_thread": 0, "title": "The latest corporate hooey is driving me mad - now it will annoy you too", "locations": [], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business   Thank you for subscribing!   \nWhether it is a blessing or a curse I’m not quite sure, but I seem to have a keen ear for what might be termed “corporate hooey”. \nThis is not just those management terms – ‘blue sky thinking’, for example, or ‘pushing the envelope’ - that your boss says and makes you want to throttle him. \nMore annoying are the phrases that sweep through the CEO community as the trendy things for chief executives to say. \nA few years ago, this phrase-of-the-day was “not fit for purpose”. No boss wants to stand up and go: “Blimey, we’re rubbish” but if they said that their organisation was “not fit for purpose” it was a way of saying that which they thought sounded really intelligent. \nFor a year or two, executives everywhere were falling over themselves to declare their organisations “not for purpose” in a widespread celebration of corporate ineptitude not seen for decades. \nBut now a new phrase is entering the lexicon of corporate hooey. It is bugging the hell out of me and I am using this column to get it into your brains so that it annoys the heck out of you too. Read More 'Getting away with it' is not a business plan: Graeme Whitfield \n“We need to show the world the UK is open for business ”, idiots everywhere are starting to say. Keep an ear out because before too long, you’ll be hearing it on a daily basis. \nWe can’t ban Uber in London because “we need to show the world the UK is open for business.” The Fox takeover of Sky must go ahead because “we need to show the world the UK is open for business.” We’ve got to let the Chinese bankroll our new nuclear industry because “we need to show the world the UK is open for business.” Read More Food is big business: how can I get my nose in the trough? \nThe keener eyes among you might see the hidden subtext of this “open for business” line, which is: “Let’s make things easier for bad businesses because Brexit is gonna tank the economy and everyone’s gonna lose their jobs.” \nYou might have also spotted that some of the people now parroting this line are the ones who got us into this mess in the first place. \nSaying: “Let’s go Brexit” and then “Brexit’s gonna be bad – let’s do something else I want” is like going to a children’s birthday party, sneaking off to eat the entire cake and then saying: “There’s no cake! Why is there no cake? This is a disaster!” - and then offering to sell someone a cake. \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2017-09-28T20:00:00.000+03:00", "crawled": "2017-09-28T20:25:08.000+03:00", "highlightTitle": ""}