{"organizations": [], "uuid": "7bae9773b6f2006ff163e8edad928d281db75c7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12476600.ece/ALTERNATES/s1200/IBP_NEC_170117house_08JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/barratt-reports-rising-profits-housing-13580900", "country": "GB", "domain_rank": 21960, "title": "Barratt reports rising profits as housing market continues to flourish", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-06T15:52:00.000+03:00", "replies_count": 0, "uuid": "7bae9773b6f2006ff163e8edad928d281db75c7d"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/barratt-reports-rising-profits-housing-13580900", "ord_in_thread": 0, "title": "Barratt reports rising profits as housing market continues to flourish", "locations": [], "entities": {"persons": [{"name": "barratt", "sentiment": "positive"}, {"name": "david thomas", "sentiment": "none"}, {"name": "john allan", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "blakelaw", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "business barratt", "sentiment": "positive"}, {"name": "nationwide building society", "sentiment": "none"}, {"name": "barratt developments", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Barratt reports rising profits as housing market continues to flourish UK's biggest housebuilder has reported a 12% increase in pre-tax profits and said buyers are still looking for houses Share Barratt Homes City Edge development in Blakelaw (Image: Newcastle Chronicle) Share Get business updates   Thank you for subscribing!   \nBarratt Developments has reported rising full-year profits as “robust consumer demand” helps prop up the housing market, despite signs of a wider slowdown triggered by the Brexit vote . \nThe UK’s biggest housebuilder , which was founded in Newcastle , booked a 12.1% increase in pre-tax profit to £765.1m in the year to June 30, while revenue rose 9.8% to £4.65bn. \nBarratt’s average selling price for its homes in the period increased by 6% to £275,200 and total completions came in at 17,395, up marginally compared with 2016 and the highest level in nine years. \nThe company said that while June’s general election created some uncertainty and the impact of Brexit is still unknown, the combination of Government support for housebuilding, attractive mortgage finance and Help to Buy continue to “support robust consumer demand”. \nForward sales are up 13.8% and the company said it had a “a substantial year end net cash balance.” \nChief executive David Thomas said: “This has been another excellent year for the group. We have delivered a strong operational and financial performance and our highest completion volumes for nine years. Read More \n“The group starts the new financial year in a good position with a strong balance sheet, healthy forward sales and we continue to see robust consumer demand supported by a positive mortgage environment.” \nThe results come as industry data points to a wider slowdown in the housing market. \nThe latest figures from Nationwide Building Society showed house prices dropped by 0.1% in August, signalling that pressure on household finances from Brexit-fuelled inflation is hitting buyer confidence. John Allan, chairman of the housebuilder Barratt Developments (Image: Handout) \nChairman John Allan added: “This has been another excellent year for the group across all key operational and financial performance metrics. We achieved record profits, completion volumes were at their highest level for nine years and we remain industry leading in terms of quality and customer service. Read More Two North East start-ups win chance to prove themselves in the US after winning Sage competition \n“We have delivered our FY17 financial targets of 20% gross margin and 25% ROCE (return on capital employed), and we are committed to further progress. Improving our profit margin remains a priority for the group and we have a number of initiatives underway to further increase efficiency, reduce costs and simplify our business. \n“We remain the largest housebuilder in the UK, delivering 17,395 homes in the year reflecting the strength of our housebuilding operations.” Like us on Facebook", "external_links": [], "published": "2017-09-06T15:52:00.000+03:00", "crawled": "2017-09-06T16:26:34.002+03:00", "highlightTitle": ""}