{"organizations": [], "uuid": "2e4fa20f755fff788678320c87e5beef638fbf3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13393777.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-blues-newcastles-confidence-leaving-13579630", "country": "GB", "domain_rank": 21960, "title": "Brexit blues - Newcastle's confidence in leaving Europe plummets", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-06T20:00:00.000+03:00", "replies_count": 0, "uuid": "2e4fa20f755fff788678320c87e5beef638fbf3f"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-blues-newcastles-confidence-leaving-13579630", "ord_in_thread": 0, "title": "Brexit blues - Newcastle's confidence in leaving Europe plummets", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "epa pool", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe concern about how Brexit negotiations are going is laid bare in our exclusive survey. \nIt revealed almost half of people in Newcastle (45.8%) are feeling less confident about the future than they were six months ago, based on what they have heard and read about negotiations to leave the EU. \nIt also shows 39.7% of Chronicle readers are in favour of a vote on the terms of any EU exit deal. \nNearly three-quarters of Remain voters (73.7%) are feeling less confident about the future than six months ago based on what they have heard and read about negotiations to leave the EU compared to 17.3% of Leave voters. Among Leave voters, 34.1% are feeling more confident while 41.6% said their confidence levels hadn’t changed. United Kingdom's Secretary of State for Exiting the European Union, David Davis, centre left, sits with his team during a meeting with European Union Chief Brexit negotiator, Michel Barnier, centre right, and his team (Image: EPA Pool) \nSupport for another referendum is split between those who voted Remain, with 65% tending to agree or strongly agreeing with a second vote, and those who voted Leave, just 11.3% in favour. \nLeave voters are more likely to strongly disagree that a second vote is needed (68.9%), than Remain voters are to strongly agree that one is needed (46.9%). \nMore than half of those surveyed (54.3%) said having control over borders was more important than remaining in the Customs Union (45,7%), with 91.5% of Leave voters prioritising borders and 78.3% of Remain voters prioritising the Customs Union. \nTwo-thirds of those who responded to the survey (68.4%) said they did not feel there was enough information during the Referendum campaign about the whole Brexit process. This includes 47.5% of Leave voters and 86.9% of Remain voters. EU Chief Brexit Negotiator Michel Barnier, right, and British Secretary of State David Davis make statements as they arrive at EU headquarters in Brussels on Monday, June 19, 2017 (Image: AP) \nWhen asked whether they had more or less confidence in the Government’s handling of Brexit compared to six months ago, 63.1% said they had less, 22.1% said it was the same, and just 6.8% said they had more confidence. Read More Failing Brexit talks could do long term damage to North East economy \nConfidence has plummeted among Remain voters, with 80.1% saying they now have less confidence in the Government , but half of Leave voters (49.2%) are also feeling less confident. \nWhile Leave voters are the most likely to have increased confidence in the Government’s handling of Brexit, it’s still just one in nine of them (10.8%) who are giving the thumbs up. \nIf a deal can’t be reached before the 2019 deadline, the most popular option among readers was to stay in the EU until a deal was reached, with nearly half backing this (46%) - although support for this was split, with backing from 77.8% of Remain voters and 10.6% of Leave voters. Read More Labour would negotiate fresh EU trade plan to protect Nissan if Theresa May fails to get deal \nIn terms of options that would involve leaving the EU at the deadline date, 20.2% backed stopping negotiations as well, while 21.6% said to keep negotiating. The preferred option among Leave voters for what to do at deadline day was to leave and stop negotiating (43%). \nAsked about how likely they were to back a ‘transition period’ of three years, involving staying in the Customs Union and with free movement if a deal was not reached by 2019, 43.2% said they were very or somewhat likely to support it, compared to 35.1% who were unlikely to support. Read More Why is the slow pace of Brexit negotiations angering some North East politicians? \nTwo-thirds (66.9%) of Remain voters were likely to support, while 64% of Leave voters were unlikely to, although Leave voters were more likely to be in favour (19.3%), than Remain voters were to be against (14.9%). \nThe study, run in partnership with Google Surveys, was completed online by 4,000 people who visited the Chronicle website. Like us on Facebook", "external_links": [], "published": "2017-09-06T20:00:00.000+03:00", "crawled": "2017-09-06T20:06:24.003+03:00", "highlightTitle": ""}