{"organizations": [], "uuid": "e6504ed0ac81dd4aac7a26ecfe67144284a74b36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13613355.ece/ALTERNATES/s1200/brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/broken-brexit-promises-pledges-eu-13613132", "country": "GB", "domain_rank": 21960, "title": "The broken Brexit promises and pledges since the EU referendum", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-13T13:08:00.000+03:00", "replies_count": 0, "uuid": "e6504ed0ac81dd4aac7a26ecfe67144284a74b36"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/broken-brexit-promises-pledges-eu-13613132", "ord_in_thread": 0, "title": "The broken Brexit promises and pledges since the EU referendum", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "neutral"}, {"name": "mr davis", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "norway  norway", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "eu withdrawal bill", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "ecj", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "european free trade association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The broken Brexit promises and pledges since the EU referendum Brexit Secretary David Davis is singing a different tune today to the one he sang after the referendum result last June Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nIn the run-up to the EU referendum we were inundated with promises as to what a post-Brexit Britain would like. \nAnd while it may still not be clear how the negotiations will conclude, we do now know that many of the pledges and predictions made during the campaign have fallen by the wayside. \nSome promises were ditched within hours of the EU referendum vote on June 23. \nHere we the things we were told would or could happen that have been conclusively shown to be wrong. 1. German car makers will get us a good trade deal \nWe were told repeatedly in the run up to the referendum that there was zero chance of German industry allowing us to leave the EU without a good trade deal. \nHowever Germany’s industrial giants have robustly said they do not want the Single Market put at risk by allowing lower-priced rivals to flood the EU with cheaper products by a British back door outside the EU. 2. Turkey is joining the EU Nigel Farage launching an EU referendum poster campaign (Image: PA) \nDo you remember the ‘Breaking Point’ poster? \nThe Vote Leave campaign also released posters announcing: “Turkey (population 76 million) is joining the EU.” \nIt’s not. \nGerman Chancellor Angela Merkel said in an election debate this month that the “fact is clear that Turkey should not become an EU member”. 3. The NHS is going to get an extra £350m a week A 'Vote LEAVE' battle bus (Image: Getty Images Europe) \nIt was the eye-catching slogan on the side of the Leave campaign bus which many felt helped away the vote towards Brexit. In February this year, prominent Brexiteers like Boris Johnson voted against an amendment to the Brexit Bill which would indeed have meant £350m going to the NHS. 4. We can use our clout to negotiate individual deals with EU states \nIn the final run-up to the referendum last year, David Davis – who is now Secretary of State for Exiting the European Union – painted a picture of the UK’s negotiator being able to go to Berlin, Paris, Rome, to negotiate individual ‘bespoke deals’. \nHowever, the UK has been sucked into a Brussels-led negotiating process with the 27 other member states refusing to break ranks. 5. We can be like Norway \nNorway as well as Iceland both enjoy many of the benefits of the single market and exporters are spared bureaucracy in return for following common rules. \nBack in 2011, Nigel Farage proposed using European Economic Area membership, which Norway and Iceland have, as “a holding position from which we can negotiate as the European Union’s biggest export market in the world”. \nSince then, opposition to staying in the EEA or joining the European Free Trade Association (which includes Switzerland) has hardened – even as a transitional stage. \nBrexit Secretary Mr Davis this week described it as the “worst of all outcomes”. Read More Labour MP Ronnie Campbell explains why he defied orders and voted for EU Withdrawal Bill 6. We’ll be able to negotiate a free trade area larger than the EU in two years \nIn July last year, Mr Davis had very high hopes for striking transformative trade deals around the world. \nHe wrote: “Trade deals with the US and China alone will give us a trade area almost twice the size of the EU, and of course we will also be seeking deals with Hong Kong, Canada, Australia, India, Japan, the UAE, Indonesia – and many others.” \nHowever it has now been reported that the Government lacks the capacity to conduct such an epic series of negotiations so the focus is understood to be on temporarily duplicating the deals that the UK has an EU member. 7. We’ll be free of the shackles of the European Court of Justice \nIn Theresa May’s landmark Lancaster House Brexit speech, she declared: “We will take back control of our laws and put an end to the jurisdiction of the European court in Britain.” \nHowever, the UK wants to negotiate a “deep and special partnership” with the EU – and a way needs to be found to settle disputes and police the terms of the withdrawal agreement. \nThe UK Government has published a paper on how this can be done. It states that there “are a number of existing precedents where the EU has reached agreements with third countries which provide for a close cooperative relationship without the [European Court of Justice] having direct jurisdiction over those countries.” \nLabour Shadow Brexit Secretary Keir Starmer could sniff a u-turn, commenting that this talk of avoiding only the “direct jurisdiction” of the court “appears to contradict the red line laid (that) there could be no future role of the ECJ and that all laws will be interpreted by judges in this country.” Read More Brexit blues - Newcastle's confidence in leaving Europe plummets 8. David Cameron will stay Prime Minister \nBefore the EU referendum David Cameron assured everyone he would stay on even if the country voted for Brexit. Once it did, he quit within hours of the result. Like us on Facebook", "external_links": [], "published": "2017-09-13T13:08:00.000+03:00", "crawled": "2017-09-13T13:27:22.003+03:00", "highlightTitle": ""}