{"organizations": [], "uuid": "e8ac616d3949c99ca702b6ae6ed263de648c270f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11986376.ece/ALTERNATES/s1200/Co-op-results.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13648224", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Co-op Group sells off final 1% stake in troubled Co-op Bank", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-21T10:35:00.000+03:00", "replies_count": 0, "uuid": "e8ac616d3949c99ca702b6ae6ed263de648c270f"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13648224", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Co-op Group sells off final 1% stake in troubled Co-op Bank", "locations": [], "entities": {"persons": [{"name": "steve murrells", "sentiment": "none"}, {"name": "michael o'leary coreena ford", "sentiment": "none"}, {"name": "cher wang", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}, {"name": "nisa", "sentiment": "none"}, {"name": "nick greatorex", "sentiment": "none"}, {"name": "jeremy pardoe", "sentiment": "none"}], "locations": [{"name": "lingfield point", "sentiment": "none"}, {"name": "new taipei city", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "nisa", "sentiment": "none"}], "organizations": [{"name": "co-op bank key event ryanair", "sentiment": "negative"}, {"name": "co-op group", "sentiment": "negative"}, {"name": "ryanair", "sentiment": "negative"}, {"name": "coreena ford google", "sentiment": "none"}, {"name": "easyleads limited", "sentiment": "none"}, {"name": "civil service learning", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "coreena ford plunge", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "ialpa", "sentiment": "none"}, {"name": "information commissioner’s office", "sentiment": "none"}, {"name": "coreena ford capita", "sentiment": "none"}, {"name": "easyleads ltd", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "ministry of defence", "sentiment": "none"}, {"name": "tesco mobile", "sentiment": "none"}, {"name": "agm", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "ico", "sentiment": "none"}, {"name": "co-op bank", "sentiment": "none"}, {"name": "htc", "sentiment": "none"}, {"name": "irish airline pilots association", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "co-operative group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Strong year for Newcastle Science Central construction company Kier Group \nConstruction company Kier Group has unveiled strong full year results with revenues up 5% to reach £4.27bn. \nThe leading property, residential, construction and services group - which has offices across the north east including in Hebburn and Killingworth - also saw a 3% rise in underlying profits to £146m. \nThe business, which employs over 450 people across the region, is responsible for a number of projects in the area including the £100m revival of the former Swan Hunter shipyard in Wallsend. \nIt is also currently on site delivering a new £20m laboratory building forming part of the Newcastle Science Central development. \nHaydn Mursell, chief executive, said: \nOur underlying performance for the year was good. \nHaving simplified our portfolio, the Group is more focused and able to pursue its growth ambitions in our three core markets; building, infrastructure and housing, which now represent 90% of the Group’s revenue and profit. We continue to invest in the business to improve our operational efficiency, providing a robust platform on which to take advantage of the strong long-term fundamentals in these core markets. Haydn Mursell, Kier Group chief executive 9.14 Coreena Ford What is the 2,000-tonne structure dominating the skyline in Blyth? \nA 2,000-tonne structure designed in the North East for the growing offshore sector is changing the skyline of a Northumberland town. \nStocksfield-based Royal IHC has designed the 80-metre J-Lay system - so called because of its shape - which will be used to lay pipes for the oil and gas sector. \nAfter testing at the Port of Blyth , where it is currently berthed, it will be used to install pipelines with the equivalent mass of 2,000 cars whilst also dealing with the demanding environmental challenges faced at sea. \nPaul Hardisty, managing director of Royal IHC Ltd, said: “The equipment that we are bringing to market is some of the best in field, and in many cases is setting the benchmark for the industry.” J-Lay system developed by Royal IHC at the Port of Blyth 9.05 Coreena Ford Pub and restaurant group Mitchells & Butlers sees sales slow amid challenging trading \nNational pub and restaurant operator Mitchells & Butlers - owners of Newcastle’s Browns, The Badger, The Falcons Nest and countless Nicholsons and Toby Carveries amongst others - has seen a rise in sales despite poor weather. \nThe owner of All Bar One and Harvester revealed a hit to drinks sales as the recent chillier weather has put off pub-goers. \nIt said like-for-like drink sales fell 1.2% in the eight weeks to September 16 in a sharp reversal of the 3.8% surge seen in the previous 10 weeks. \nThe group blamed the poor weather in August and so far in September, although it said it outperformed the market. \nTotal sales edged 0.3% higher in the most recent eight weeks after more food sales, which rose 1.5% in an improvement on the 1.3% increase seen at the height of summer. \nMitchells said: “Following a strong sales performance in early summer, the market has been more challenging in recent weeks, particularly given poor weather this year up against a sunny period last year which has specifically impacted drink sales.” \nThe group said like-for-like sales in the 51 weeks so far of its financial year are up 1.8%, with drink up 2.1% and food 1.4% ahead. \nBut it reiterated that soaring costs will weigh on profit margins for the full year. \nThe industry has been under pressure from rising costs on a number of fronts, including the national living wage, property costs and the weak pound. Mitchells chief executive Phil Urban said: “Whilst the weather in August and September has adversely affected the market we remain encouraged that our like-for-like sales performance continues to outperform the market.” The Badger in Ponteland (Image: Publicity Picture) 9.00 KEY EVENT Ryanair braces itself for AGM today amid fears of pilot exodus \nRyanair bosses go head to head with shareholders today to address a crisis over pilot shortages and warnings that crews are rejecting cash bonuses to commit to the airline. \nThe company holds its AGM in its Dublin headquarters this morning amid reports of the widespread rejection by flight crews of offers of £12,000 and 12,000 euro for captains and half that for first officers to stay with the carrier. \nRyanair is facing a multimillion-pound compensation bill for cancelled flights after it revealed it was shelving up to 50 flights every day over the next six weeks, including many affecting North Eastern holidaymakers . \nThe airline said the cancellations were brought about by the over-allocation of pilots’ holidays during a relatively busy period. \nA spokesman for Ryanair said: “We will address this at the AGM today.” \nThe Irish Airline Pilots Association (Ialpa) claimed that 140 Ryanair pilots left for Norwegian Air in recent weeks and months. It also said other pools of pilots are on standby to move across Europe after accepting jobs with other airlines and waiting for start dates before handing in their notices. \nThe bill for the compensation for passengers left stranded and forced to re-book could reach £17.7m. \nPassengers have been reporting problems with the process of refunds and compensation for cancelled flights, saying information supplied by the airline is incorrect and calls are going unanswered. Ryanair boss Michael O'Leary Coreena Ford Firm fined after making 16 million automated calls \nA marketing firm behind more than 16 million automated calls about boiler grants has been fined £260,000. \nThe financial penalty handed to Coventry-based Easyleads Limited brings the penalties handed out in the last week by the Information Commissioner’s Office (ICO) to companies behind illegal recorded messages to £610,000. \nIn a statement confirming the fine, the ICO said Easyleads Ltd did not have specific consent from people that it made automated calls to. \nThe firm also broke the rules by not including a company name and contact details in the recorded message. \nMore than 550 complaints were made to the ICO about the calls, including from recipients of multiple messages or calls made in the early hours of the morning over the May 2017 bank holiday weekend. \nICO investigators said the firm had deliberately misled people by referring to a government scheme and the offer of a free boiler. 8.50 Coreena Ford Google snaps up [art of HTC in $1.1bn deal \nGoogle has agreed to buy part of device manufacturer HTC for $1.1bn to expand its efforts to build phones, speakers and other gadgets equipped with its arsenal of digital services. \nThe deal announced this morning suggests Google is becoming increasingly serious about designing its own family of devices to compete against Apple and Amazon in a high-stakes battle to become the technological hub of people’s lives. \nOver the past decade, Google has focused on giving away its Android operating system to an array of device makers, including Taiwan’s HTC, to ensure people would keep using its search engine, email, maps, YouTube video service and other software on smartphones and other pieces of hardware. Cher Wang, chairperson of HTC, second from right, speaks during a press conference in New Taipei City, Taiwan. Google is biting off a big piece of device manufacturer HTC for $1.1bn. 8.45 What's the FTSE and pound latest? \nThe FTSE-100 index at 8.15am was up 3.67 at 7275.62. \nThe pound at 8am was 1.3510 dollars compared to 1.3563 dollars at the previous close. The euro at 8am was 0.8806 pounds compared to 0.8849 pounds at the previous close. 8.40 Coreena Ford Plunge in business confidence sees firms downsize and going out of operation \nBusiness confidence has fallen to the lowest level since the EU referendum – with the political climate the main cause of the problem, two new reports say . \nResearch by the Recruitment and Employment Confederation (Rec) showed that a third of employers believed economic conditions were getting worse, while a survey of members at the Federation of Small Businesses (FSB) showed that small business confidence has plummeted to its lowest level since immediately after last year’s Brexit vote. \nThe small business index (SBI) of confidence stood at +1 for the third quarter of 2017, down from +15 in the second quarter and close to the -3 seen after the referendum. \nAround 70% of small firms reported a rise in operating costs compared to the same period last year, with labour costs, taxation and rent all mentioned as cost increases. \nFSB national chairman Mike Cherry called for help for small firms in the autumn Budget and a three-year Brexit transition deal. \nHe said: “Rising inflationary pressure and a weakening domestic economy are the twin drivers of plummeting confidence among small firms and consumers alike. With conference season and the Autumn Budget approaching, policymakers have an opportunity to restore optimism. Mike Cherry, Chairman of the West Midlands Policy Unit of the Federation of Small Businesses (Image: Jeremy Pardoe) 8.35 Coreena Ford Capita profits knocked by business exits \nCapita has seen half-year profits fall as the outsourcing giant was hit by moves to offload unwanted businesses. \nThe group said reported pre-tax profits sunk by 26% to £28m in the six months to the end of June, down from £37m for 2016. \nIt was driven by an exit from its specialist recruitment arm and part of its Capita Europe business, while its events operation was shut down. \nUnderlying pre-tax profits, however, make for brighter reading, lifting 46% to £195m, thanks in part to a £16m boost from reorganising a contract with the Ministry of Defence. \nUnderlying revenues eased back 3% to £2.1bn, with weak real estate and the part loss of a Civil Service Learning contract being offset by a new deal with Tesco Mobile and the expansion of Department for Work and Pensions PIP assessments. \nInterim chief executive Nick Greatorex said: “In the first half of 2017, we made good progress on executing the plans laid out at the end of last year to reposition the group: we announced the sale of our asset services businesses, completed the disposal of our specialist recruitment business and commenced a number of cost initiatives. Capita have an office at Lingfield Point in Darlington 8.30 KEY EVENT Co-op Group sells off remaining 1% stake in troubled Co-op Bank for £5m \nThe Co-operative Group has revealed it no longer holds any stake in the troubled Co-op Bank business after offloading its 1% holding. \nThe mutual had been left with just 1% after a £700m rescue and refinancing deal to get Co-op Bank back on track completed weeks ago, but confirmed it has now sold the last remaining stake for just £5m in the last few days. \nIt leaves the pair with just a relationship agreement, which will also fall away over the next few years and end formally in 2020. \nThis raises the question of whether the group would launch its own lender again at the end of the three year. \nChief executive Steve Murrells has been on the Today programme, saying: “I wouldn’t have a crystal ball and be looking into the future on those things. \n“There are many opportunities that we’re looking at, financial services may well be one of them but as you have seen with our interest in Nisa, wholesaling is another area.” \nDetails of the stake sale came as the Co-op Group posted a 48% fall in underlying pre-tax profits to £14m for the six months to July 1 after shelling out £35m in member rewards and after losses at its insurance arm. \nOn a bottom-line basis, profits rose 47% to £25m. \nCo-op Group is the front-runner to buy convenience store operator Nisa, muscling out rival bidder Sainsbury’s. \nThe Co-op is thought to have tabled a £140m bid for Nisa, whose 1,300 shopkeeper members run 3,000 stores. In its half-year results, the Co-op Group said its insurance business swung to an underlying operating loss of £1m against profits of £11m a year earlier as it increased reinsurance through third parties. A Co-operative Bank sign (Image: Nick Ansell/PA Wire) More On", "external_links": [], "published": "2017-09-21T10:35:00.000+03:00", "crawled": "2017-09-21T11:17:04.005+03:00", "highlightTitle": ""}