{"organizations": [], "uuid": "959a9fcba4a117db71f2a96ef426770bffcc1e63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13698459.ece/ALTERNATES/s1200/UKIP-Party-Conference-2017-Day-Two.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-henry-bolton-immigration-torquay-13698403", "country": "GB", "domain_rank": 21960, "title": "What new UKIP leader Henry Bolton thinks of immigration and Islam", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-30T18:19:00.000+03:00", "replies_count": 0, "uuid": "959a9fcba4a117db71f2a96ef426770bffcc1e63"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-henry-bolton-immigration-torquay-13698403", "ord_in_thread": 0, "title": "What new UKIP leader Henry Bolton thinks of immigration and Islam", "locations": [], "entities": {"persons": [{"name": "henry bolton", "sentiment": "negative"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "anne marie waters", "sentiment": "none"}, {"name": "bolton", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "riviera international centre", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "navy", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "royal marines", "sentiment": "none"}, {"name": "conservatives and labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What new UKIP leader Henry Bolton thinks of immigration and Islam Henry Bolton won the race to succeed Paul Nuttall and gave a keynote speech at the UKIP 2017 party conference in Torquay Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMass immigration and Islam are harming British culture - but there should be no cap on the number of migrants who can come to the country, UKIP’s new leader has said. \nHenry Bolton won the race to succeed Paul Nuttall on Friday, averting a potential split of the party by defeating anti-Islam candidate Anne Marie Waters, who finished second in the leadership election . \nIn a sign of the need to unite the party, the little-known former Army officer used his keynote speech to the party conference in Torquay to declare that the present rate of immigration is “unacceptable” and claim British culture was being “swamped” by multiculturalism. \nHe called for an Australian-style points-based system for managing migration, but in a major shift of UKIP’s position abandoned the party’s pledge to cap net migration. Newly elected UKIP leader Henry Bolton makes his leader's speech at their autumn conference being held at the Riviera International Centre on September 30, 2017 in Torquay (Image: Getty Images Europe) \nMr Bolton told the conference: “Immigration is overwhelming our public services, which themselves are being slashed - 25% off the police, for example, in some cases nearly 50% off local Government. \n“Housing and communities are being overwhelmed, it is harming our own culture, traditions and way of life. \n“We must demand that our own concerns about our own British culture are heard and that that feeds into our policy on immigration.” \nEarlier, he told reporters: “There is concern amongst the population writ large that there is an undermining through general immigration and the weight of numbers that we have got, and Islam as well, that our culture is being buried by this, being sort of pushed aside.” \nBut he also watered down UKIP’s promises in 2015 and 2017 to cap immigration, despite Prime Minister Theresa May remaining committed to a target of reducing net migration to the “tens of thousands”. \nMr Bolton told reporters: “Anybody who says ‘put a figure on it’ is actually being entirely unrealistic and trying to paint politicians like me into a corner that gives you a nice thing to hang a comment on, but you’re not going to get it from me because actually we need to be a lot more practical and operational about it.” \nThe ex-soldier opened his speech with a clear pitch to former UKIP voters who backed the Tories in the general election, suggesting Mrs May had betrayed them on Brexit. \nThe PM’s promise that “Brexit means Brexit” and her approach to the issue was thought to be a key factor in UKIP’s vote share tumbling to 1.8% from 12.6% in 2015. \nMr Bolton described a transition period as proposed by the Conservatives and Labour as “unacceptable” and said Britain must be “prepared” to leave the European Union immediately. Read More Should the North East have its own immigration policy to bring in foreign workers? \nHe claimed Mrs May’s Florence speech, in which she set out plans for a two-year transition and made a first offer towards a financial settlement, showed “the UK does not want to leave the EU in anything but name”. \nThe PM’s promise of a security partnership with the EU showed she was prepared to “subordinate” the UK’s foreign policy, defence and aid to Brussels, Mr Bolton said. \n“We must demand the repeal of the European Communities Act and be prepared to leave now,” he said. \nMr Bolton added: “The Prime Minister called the last general election, in her own words, ‘to strengthen my hand in the Brexit negotiations’. \n“She claimed that she offered ‘strong and stable’ leadership. \n“The country and many of our supporters trusted her and the Conservatives won the election. \n“So, 14 months after the referendum, have we regained control of our borders? \n“Are we able to conclude our own trade agreements? \n“We have not, no.” \nStaying on traditional UKIP territory, Mr Bolton attacked the Government’s cuts to defence spending, claiming 1,000 Royal Marines were being axed to save £3 billion to go towards the so-called Brexit “divorce bill”. \nHe said 13 of the Navy’s 19-strong fleet of Type 23 frigates and Type 45 destroyers were unable to sail due to a lack of manpower, fuel and supplies, and he drew audible gasps from the crowd when stating “we have fewer main battle tanks than Switzerland”. \nTurning to UKIP’s electoral failure, Mr Bolton set out plans to select candidates earlier, improve planning and training across the party and country, and better manage finances. \nHe ditched the 2017 manifesto and said 2015’s version would be used as a “baseline”, while members will be given a role in policy-making, with the party’s conference to vote on ideas. \nMr Bolton concluded: “Brexit remains our core task and to secure the future of our great nation is our core purpose. \n“Failure is not an option.” Like us on Facebook", "external_links": [], "published": "2017-09-30T18:19:00.000+03:00", "crawled": "2017-09-30T19:04:39.001+03:00", "highlightTitle": ""}