{"organizations": [], "uuid": "4d596fbce9a13ac6cf789b36e271a10f162a8f80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13681619.ece/ALTERNATES/s1200/Labour-Party-annual-conference-2017.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tom-watson-labour-brexit-referendum-13681522", "country": "GB", "domain_rank": 21960, "title": "Tom Watson reveals Labour's stance on a second Brexit referendum", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-27T14:20:00.000+03:00", "replies_count": 0, "uuid": "4d596fbce9a13ac6cf789b36e271a10f162a8f80"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tom-watson-labour-brexit-referendum-13681522", "ord_in_thread": 0, "title": "Tom Watson reveals Labour's stance on a second Brexit referendum", "locations": [], "entities": {"persons": [{"name": "tom watson", "sentiment": "negative"}, {"name": "joe anderson", "sentiment": "none"}, {"name": "alison mcgovern", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "mr khan", "sentiment": "none"}, {"name": "heidi alexander", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "clive lewis", "sentiment": "none"}, {"name": "sadiq khan", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "chuka umunna", "sentiment": "none"}, {"name": "west bromwich east", "sentiment": "none"}, {"name": "brighton", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom flag", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "eu single market", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union flag", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "single market", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Tom Watson reveals Labour's stance on a second Brexit referendum Labour's Deputy Leader says it's 'highly unlikely' the party could back a second Brexit referendum, but says 'we're not ruling it out' Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour doesn’t rule out a second referendum on Brexit , Deputy Leader Tom Watson has said. \nMr Watson said: “We’re not ruling it out. But it’s highly unlikely.” \nIt follows suggestions from other senior Labour politicians that the party could back a second public vote giving people the option of staying in the EU. \nLondon Mayor Sadiq Khan said it was “possible” Labour’s next manifesto could include a commitment to hold a second referendum, London’s Evening Standard reported. Deputy Labour leader Tom Watson (Image: PA) \nSpeaking to regional journalists at Labour’s annual conference in Brighton, Mr Watson stressed that the Labour leadership had ordered its MPs to vote for Article 50, which began the process of leaving the EU . \nAsked if he agreed with Mr Khan, he said: “To get to your point on a second referendum. I think it’s highly unlikely there will be one. \n“We want exit from the EU. That’s the decision of the referendum. That’s why we whipped Article 50. \n“But you have to see how the negotiations go, at the end of it. \n“So we’re not ruling it out. But it’s highly unlikely.” \nAt the same time, Mr Watson, Labour MP for West Bromwich East, suggested Labour would ultimately decide that the UK should leave the EU Single Market. \nThe party is calling for a transitional deal which would keep the UK in the Single Market for an unspecified period of time after Brexit takes place in 2019, but Mr Watson said it was unlikely the UK would remain a member permanently. The European Union Flag and United Kingdom Flag intertwined (Image: Getty Images Europe) \nHe said: “Our negotiating position - you’ve heard it from every one of us - is tariff-free access to the European market. \n“And I think that is the likely outcome. I think it’s highly unlikely that a deal will encompass membership of the Single Market after that transition period. \n“But you can’t rule anything out when you are in a negotiation. And that’s why we are not ruling anything out.” \nThe comments may disappoint Labour politicians who believe the party should be committed to Single Market membership. Read More Jeremy Corbyn tells Labour conference: I'm ready to be Prime Minister \nMore than 30 Labour figures have signed a letter warning it makes no sense for Labour to call itself an anti-austerity party unless it agrees to stay in the Single Market. \nThe letter said: “Labour should commit to staying in the Single Market and Customs Union – ruling out no options for how to achieve this – and to working with sister parties and others across Europe to improve workers’ rights, boost trade union membership and put an end to the exploitation of workers, not freedom of movement.” \nThe letter was signed by Labour MPs, MEPS, unions leaders, members of the House of Lords and local government leaders. \nThey included backbench Newcastle North MP Catherine McKinnell, Sedgefield MP Phil Wilson and other Labour MPs such as Chuka Umunna, Alison McGovern, Heidi Alexander and Clive Lewis, as well as Liverpool mayor Joe Anderson and Newcastle City Council leader Nick Forbes. Like us on Facebook ", "external_links": [], "published": "2017-09-27T14:20:00.000+03:00", "crawled": "2017-09-27T14:34:39.032+03:00", "highlightTitle": ""}