{"organizations": [], "uuid": "31646c79f924f636d4c95cf6fda5889aa08b8002", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13570379.ece/ALTERNATES/s1200/Manufacturing-output.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturers-ride-export-13570145", "country": "GB", "domain_rank": 21960, "title": "North East manufacturers ride export boom despite worries about UK economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-04T16:09:00.000+03:00", "replies_count": 0, "uuid": "31646c79f924f636d4c95cf6fda5889aa08b8002"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturers-ride-export-13570145", "ord_in_thread": 0, "title": "North East manufacturers ride export boom despite worries about UK economy", "locations": [], "entities": {"persons": [{"name": "scott duncan", "sentiment": "none"}, {"name": "craig burton", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "pa", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "manufacturing outlook", "sentiment": "none"}, {"name": "bdo", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East manufacturers ride export boom despite worries about UK economy Quarterly survey from EEF and BDO say most indicators are positive for manufacturers in the North East Share A worker inspecting rolls of steel (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nManufacturers in the North East are continuing to enjoy positive conditions, according to a survey from employers group EEF and business advisory group BDO. \nThe Manufacturing Outlook survey for the third quarter of 2017 shows that whilst output and orders have slipped back slightly from the last quarter’s very strong performance, they are faring well and forecast to pick up in the final months of the year. \nExport orders are particularly strong, with the weakness of the pound and an improvement in many European economies helping overseas sales. \nThe UK market is much weaker, however, reflecting a pattern across the UK of consumers being squeezed and political uncertainty. \nDespite the weaker UK market, business confidence amongst North East firms has risen to the second highest of any UK region. This is reflected in a continued boost for employment and demand for skills with recruitment intentions remaining strong, whilst investment intentions have also remained positive. \nScott Duncan, regional manager for EEF in the North East, said: “Manufacturers appear to have taken the recent political upheaval in their stride and are taking advantage of growing world markets to make hay while the sun shines. This period is likely to be the peak, however, and we are likely to see a more stable picture in the coming months rather than any further significant acceleration. Scott Duncan, EEF Membership Manager for the North East (Image: EEF) \n“There is little doubt that Brexit is likely to weigh on sentiment over the next 12 months with uncertainty over the UK’s terms of exit. \n“As such, it is vital the Government sends a signal to industry and investors in the UK and overseas that it is doing everything in its power to get growth of the UK economy back on the agenda. This must include a bold and ambitious cross -government industrial strategy.” Read More Manufacturing hits four-month high as weak pound boost exports \nThe one negative in the survey was manufacturers’ confidence in the UK economy. For the second quarter, that measure has fallen, with political uncertainty and a squeeze on consumer spending being blamed. \nCraig Burton, partner and head of manufacturing at BDO in the North East, said: “Despite the economic and political uncertainties, manufacturers’ in the North East continue to be a force to be reckoned with, delivering a strong performance as well as increasing employment plans to make the most of the strengthening export opportunities available to them. \n“However, manufacturers’ confidence about the UK economy has continued to fall for the second quarter running. \n“With growing opportunities around the world, particularly the Eurozone, manufacturers’ need stability and certainty in government policy (including Brexit) to provide the right environment for them to commit to the significant capital and research investment required to support continued growth.” Like us on Facebook ", "external_links": [], "published": "2017-09-04T16:09:00.000+03:00", "crawled": "2017-09-04T17:10:09.001+03:00", "highlightTitle": ""}