{"organizations": [], "uuid": "43b381167a0e9227ff96c9dfcd327f215e79679d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.birminghammail.co.uk/incoming/article13682549.ece/ALTERNATES/s1200/corbyn-speech2.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/key-messages-jeremy-corbyns-speech-13683047", "country": "GB", "domain_rank": 21960, "title": "The key messages from Jeremy Corbyn's speech at Labour's annual conference", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-27T18:00:00.000+03:00", "replies_count": 0, "uuid": "43b381167a0e9227ff96c9dfcd327f215e79679d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/key-messages-jeremy-corbyns-speech-13683047", "ord_in_thread": 0, "title": "The key messages from Jeremy Corbyn's speech at Labour's annual conference", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "brighton", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brighton centre", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "invalid email  labour", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "the labour", "sentiment": "none"}, {"name": "brexit  labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The key messages from Jeremy Corbyn's speech at Labour's annual conference Jeremy Corbyn challenged Theresa May to call another general election and predicted Labour was ready to win power Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour leader Jeremy Corbyn challenged Theresa May to call another general election , in his speech to Labour’s annual conference - and predicted he would win it. \nHe said: “The Labour campaign machine is primed and ready to roll.” \nMr Corbyn set out an unashamedly left-wing vision for the United Kingdom in his speech to activists in Brighton. \nHe said a future Labour government would take responsibility for growing the economy , rather than leaving it up to market forces. \nPolicies included imposing rent controls, to prevent landlords ripping off tenants, nationalising some industries and asking big business to pay more tax. \nBut Mr Corbyn said his ideas represented the new centre ground, after the banking crisis and economic crash showed that things had to change. \nHe said: “We are now the political mainstream.” \nAnd he predicted Labour would win power. \nMr Corbyn vowed: “Let everyone understand - We will not let you down.” \nHe said: “Labour can and will deliver a Britain for the many not just the few.” \nHere are the key messages from the speech: Labour leader Jeremy Corbyn delivers his speech at the Labour Party annual conference at the Brighton Centre, Brighton. 1) Labour are set to win power \nMr Corbyn said June’s general election result showed that Labour is on course to form a Government. \nHe said: “Conference, against all predictions in June we won the largest increase in the Labour vote since 1945 and achieved Labour’s best vote for a generation. It’s a result which has put the Tories on notice and Labour on the threshold of power. \n“Yes, we didn’t do quite well enough and we remain in opposition for now, but we have become a Government-in-waiting.” 2) Labour will unite Remainers and Leavers over Brexit \nLabour would unite remainers and leavers, Mr Corbyn said. \n“Labour is the only party that can bring together those who voted leave and those who backed remain, and unite the country for a future beyond Brexit.” \nAnd he promised that a Labour government would “guarantee” that the UK retained access to the Single Market. \nMr Corbyn said: “a Labour Brexit that puts jobs first a Brexit for the many, one that guarantees unimpeded access to the single market and establishes a new co-operative relationship with the EU.” 3) A new approach to the economy \nMr Corbyn called for the “public sector” to play a leading role in promoting economic growth. \nAnd he said Labour would take privatised public services back into Government ownership. \nThe Labour leader set out a vision for the economy radically different to the one that has dominated British politics since the 1980s. \nConservatives , and Labour under leaders such as Tony Blair, have seen the private sector as the engine that fuels the economy. \nHowever, Mr Corbyn said: “Now is the time that government took a more active role in restructuring our economy. Now is the time that corporate boardrooms were held accountable for their actions, and now is the time that we developed a new model of economic management to replace the failed dogmas of neo-liberalism. \n“That is why Labour is looking not just to repair the damage done by austerity but to transform our economy with a new and dynamic role for the public sector, particularly where the private sector has evidently failed.” \nGiving the water companies as an example, he said: “We are committed to take back our utilities into public ownership to put them at the service of our people and our economy and stop the public being ripped off.” \nAnd Labour would “ask big business to pay a bit more tax”, he said. Read More Tom Watson reveals Labour's stance on a second Brexit referendum 4) Labour’s ideas are the new centre ground \nWhile his ideas might once have been seen as left-wing, Mr Corbyn said that they now represented the “centre ground”. \nAnd he said that the banking crisis, and the subsequent economic crash, had convinced people that things had to change. \n“It is often said that elections can only be won from the centre ground. \n“And in a way that’s not wrong - so long as it’s clear that the political centre of gravity isn’t fixed or unmovable, nor is it where the establishment pundits like to think it is.” \nHe added: “A new consensus is emerging from the great economic crash and the years of austerity, when people started to find political voice for their hopes for something different and better. \n“2017 may be the year when politics finally caught up with the crash of 2008 - because we offered people a clear choice.” \nMr Corbyn said: “This is the real centre of gravity of British politics. \n“We are now the political mainstream.” 5) Rent controls as part of a major campaign to improve housing \nMr Corbyn said Labour would propose “a radical programme of action” to end homelessness at next year’s conference. \nAnd he set out plans to stop landlords imposing rent hikes on tenants. \n“Rent controls exist in many cities across the world and I want our cities to have those powers too and tenants to have those protections.” \nHe also said a Labour government would impose new barriers on local councils hoping to regenerate estates, including ensuring they “will have to win a ballot of existing tenants and leaseholders before any redevelopment scheme can take place”. 6) A pay rise for public sector workers \nMr Corbyn highlighted plans to give workers such as teachers and nurses a pay rise. \nHe said: “You can’t care for the nation’s health when doctors and nurses are being asked to accept falling living standards year after year.” Read More Shadow Brexit Secretary Keir Starmer on why Labour wants to end freedom of movement 7) Western foreign policy helps cause terrorism \nMr Corbyn condemned recent terrorist attacks in the UK, saying: “We all unite in both condemning the perpetrators and in our support for the emergency and security services, working to keep us safe.” \nHe added: “But we also know that terrorism is thriving in a world our governments have helped to shape, with its failed states, military interventions and occupations where millions are forced to flee conflict or hunger. \n“We have to do better and swap the knee-jerk response of another bombing campaign for long-term help to solve conflicts rather than fuel them.” 8) Attacking Donald Trump \nMr Corbyn said the UK should be “a candid friend to the United States”. \nAnd he criticised US President Donald Trump’s recent speech to the United Nations, in which Mr Trump said the US might be forced to destroy North Korea. \nMr Corbyn said: “Let me say frankly - the speech made by the US President to the United Nations last week was deeply disturbing. \n“It threatened war and talked of tearing up international agreements. \n“Devoid of concern for human rights or universal values, it was not the speech of a world leader. \n“Our government has a responsibility. It cannot meekly go along with this dangerous course. \n“If the special relationship means anything, it must mean that we can say to Washington: that way is the wrong way.” Like us on Facebook ", "external_links": [], "published": "2017-09-27T18:00:00.000+03:00", "crawled": "2017-09-27T22:33:00.001+03:00", "highlightTitle": ""}