{"organizations": [], "uuid": "b623bdf9c55bd563d5908a3c0894db96ed7e89f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13694042.ece/ALTERNATES/s1200/topfirms.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-parkdean-resorts-frank-recruitment-13693940", "country": "GB", "domain_rank": 21960, "title": "Newcastle's Parkdean Resorts and Frank Recruitment make list of top UK firms", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-29T16:35:00.000+03:00", "replies_count": 0, "uuid": "b623bdf9c55bd563d5908a3c0894db96ed7e89f6"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-parkdean-resorts-frank-recruitment-13693940", "ord_in_thread": 0, "title": "Newcastle's Parkdean Resorts and Frank Recruitment make list of top UK firms", "locations": [], "entities": {"persons": [{"name": "tim", "sentiment": "negative"}, {"name": "thornton", "sentiment": "none"}, {"name": "grant thornton", "sentiment": "none"}, {"name": "grant thornton top track", "sentiment": "none"}, {"name": "andy wood", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "st nicholas building", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "parkdean", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "parkdean resorts and frank recruitment", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "business newcastle", "sentiment": "negative"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "onex", "sentiment": "none"}, {"name": "grant thornton uk llp", "sentiment": "none"}, {"name": "frank recruitment group", "sentiment": "none"}, {"name": "share frank recruitment", "sentiment": "none"}, {"name": "aston martin, holland & barrett, travelodge", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parkdean resorts  it recruitment consultancy frank recruitment group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle's Parkdean Resorts and Frank Recruitment make list of top UK firms The Sunday Times Grant Thornton Top Track 250 league table ranks Britain’s private mid-market growth companies with the biggest sales Share Frank Recruitment and Parkdean resorts top table with sales Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTwo North East firms have seen their success recognised in a nationwide list of the UK’s leading private companies with growing sales. \nThe 13th annual Sunday Times Grant Thornton Top Track 250 league table lists Britain’s private mid-market growth companies with the biggest sales. \nTwo companies from the region have been singled out this year – holiday group Parkdean Resorts and IT recruitment specialists Frank Recruitment Group – for making a strong contribution to the local economy. \nNewcastle-based Parkdean Resorts, which employs 5,200 people across 73 holiday parks around the UK, is the biggest mid-market growth company in the region for a second consecutive year, and also has the largest profits. Sales grew 9% to £432m while profits grew 21% to £82m. \nWith the popularity of the ‘staycation’ holiday on the rise, Parkdean is seeking to grow even further by capitalising upon the popularity of UK holidays. \nOne months after it was sold to Canadian private equity house Onex for £1.35bn, in December 2016, the firm unveiled plans to plough £50m into its portfolio of holiday parks. Read More From caravan holidays in Northumberland to a £1bn holiday firm: meet the boss at Parkdean Resorts \nIT recruitment consultancy Frank Recruitment Group, based in St Nicholas Building in the city centre , meanwhile, makes the list this year after growing sales 33% to £126m, aided by its expansion in the US. \nThe firm made heavy investments in its workforce last year, with staff numbers across its worldwide offices increasing by a whopping 61%, from an average of 505 employees to 815. And that figure is set to rise again by the end of the current financial year, coming on the back of a recruitment drive set in motion earlier this year to fill 150 new jobs at its Newcastle headquarters. \nThe companies in the North East appear with businesses from around the UK, including Aston Martin, Holland & Barrett, Travelodge, Lush and PureGym. \nThe league table and awards programme is sponsored by Grant Thornton and Lloyds Banking Group, and compiled by Fast Track, the Oxford-based research and networking events company. Read More Frank Recruitment Group's 300 new employees helps to massive lift in sales \nAndy Wood, partner at Grant Thornton UK LLP, the title sponsor of the league table, praised the companies for their performance. \nHe said: “The UK may be at a pivotal point in its history, but the Top Track 250 clearly demonstrates what can be achieved by exciting dynamic businesses. \n“These companies think locally and act globally, they innovate to grow and embrace an entrepreneurial spirit that this country needs to secure a positive post-Brexit future. At Grant Thornton we are seeking to stimulate ideas and actions that can help shape a vibrant UK economy that thrives. We can all learn a lot from the Top Track 250.” Like us on Facebook", "external_links": [], "published": "2017-09-29T16:35:00.000+03:00", "crawled": "2017-09-29T16:53:22.000+03:00", "highlightTitle": ""}