{"organizations": [], "uuid": "53005bcd91fe789abc2823978c55767d53cc4f6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13072353.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/expanding-heathrow-could-bring-north-13557127", "country": "GB", "domain_rank": 21960, "title": "Expanding Heathrow could bring the North East 5,000 jobs - failure to do so may cost us services", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-01T23:00:00.000+03:00", "replies_count": 0, "uuid": "53005bcd91fe789abc2823978c55767d53cc4f6c"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/expanding-heathrow-could-bring-north-13557127", "ord_in_thread": 0, "title": "Expanding Heathrow could bring the North East 5,000 jobs - failure to do so may cost us services", "locations": [], "entities": {"persons": [{"name": "catherine mckinnell", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}], "locations": [{"name": "heathrow airport", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "durham tees valley", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "durham tees valley airport", "sentiment": "none"}], "organizations": [{"name": "parliament", "sentiment": "negative"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "durham tees valley airports", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A plane taking off from Heathrow Airport (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNext week Parliament returns from recess and, while Brexit understandably continues to dominate the headlines, one of the most important decisions we will need to make in the coming months is on a third runway at Heathrow Airport. \nAs the MPs for Newcastle and Durham Tees Valley Airports, we firmly believe the construction of the third runway is imperative to ensure the North East – with its proud exporting record – is able to maintain connectivity, not only to London, but to the rest of the world. \nThe increased capacity created by a third runway at Heathrow will reverse the trend of declining links between one of the world’s major hub airports and the nations and regions of the UK. \nAnd the independent Airports Commission Report, which recommended the construction of the third runway, highlighted that ‘around 60% of the overall boost to GDP would be focused on areas of the UK outside the South East.’ \nClearly, we want our region to benefit from this economic boost and additional global connectivity. We also welcome the attention being paid to the North East by Heathrow as it gears up for the construction of the third runway. Labour candidate for Newcastle North, Catherine McKinnell wins (Image: Newcastle Chronicle) \nThis month, Heathrow Airport and the North East England Chamber of Commerce are hosting a ‘business summit’ on Tyneside to connect the region’s firms with the airport’s supply chain, to ensure companies large and small can benefit – not only from additional connectivity as a result of Heathrow expansion, but also from construction of the runway itself. \nHeathrow already spends £1.5bn annually with more than 1,200 suppliers from around the UK. We want to see the North East continue to benefit with an expansion in the number of companies making up the Heathrow supply chain, both through the construction process and afterwards. \nIt is estimated that expansion at Heathrow could generate more than 100,000 jobs nationally – and 5,000 jobs could be destined for the North East. \nWe encourage as many local businesses as possible to bid for contracts as they arise, to grow that number further. \nIt’s clear that a third runway at Heathrow will play a major role in boosting jobs and growth in the North East. \nBusinesses need to connect through their local airport rather than travel for hours to an airport outside the region. Sedgefield MP Phil Wilson (Image: Ian Nicholson/PA Wire) \nThey need to get to destinations across the world, and flying from a local airport then connecting via a hub gives them the greatest choice. \nUnless Heathrow is expanded, there is a risk that the frequency of our services from Newcastle Airport could be reduced and eventually squeezed out. \nThis happened to Durham Tees Valley Airport, we do not want to see it happen to Newcastle too. Durham Tees Valley has been listed as one of six regional destinations expected to benefit from Heathrow expansion, offering a long-term lifeline to the airport. Read More Heathrow Airport funds trade missions for two North East firms \nAs the UK approaches Brexit, the country and particularly the North East need to ensure we have as much connectivity with the rest of the world as possible. It could be argued that this has always been the case, but we believe Brexit makes it all the more urgent. \nWe will continue to support the expansion of Heathrow. It offers great economic opportunity to our region, and we encourage business to take advantage of what will be one of the largest construction projects in Europe. \nBecause we want to see the North East benefit through economic growth, jobs and apprenticeships, and greater connectivity to a world more inter-dependent than ever before. \nCatherine McKinnell is the Labour MP for Newcastle North. Phil Wilson is the Labour MP for Sedgefield. Like us on Facebook", "external_links": [], "published": "2017-09-01T23:00:00.000+03:00", "crawled": "2017-09-01T23:13:52.006+03:00", "highlightTitle": ""}