{"organizations": [], "uuid": "f6e232a80ff0e9c1badf70e527eade46202458c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11483982.ece/ALTERNATES/s1200/JS92139069.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13618444", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Wetherspoon boss toasts rising sales as he launches another Brexit rant", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-15T10:30:00.000+03:00", "replies_count": 0, "uuid": "f6e232a80ff0e9c1badf70e527eade46202458c1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13618444", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Wetherspoon boss toasts rising sales as he launches another Brexit rant", "locations": [], "entities": {"persons": [{"name": "jonathon manning newcastle", "sentiment": "negative"}, {"name": "wetherspoon", "sentiment": "negative"}, {"name": "stephen swiokio", "sentiment": "none"}, {"name": "che connon", "sentiment": "none"}, {"name": "joe giddens/pa wire", "sentiment": "none"}, {"name": "connon", "sentiment": "none"}, {"name": "morgan", "sentiment": "none"}, {"name": "andrew bailey", "sentiment": "none"}, {"name": "joe prouse", "sentiment": "none"}, {"name": "purplebricks", "sentiment": "none"}, {"name": "craig muldoon", "sentiment": "none"}, {"name": "bailey", "sentiment": "none"}, {"name": "ian goss", "sentiment": "none"}, {"name": "candler", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "jesmond dene", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "michael bruce", "sentiment": "none"}, {"name": "atelerix", "sentiment": "none"}, {"name": "david varty", "sentiment": "none"}, {"name": "barry wilkinson", "sentiment": "none"}, {"name": "andrea styles", "sentiment": "none"}, {"name": "howard russell", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "peter candler", "sentiment": "none"}, {"name": "mick mclean", "sentiment": "none"}, {"name": "jonathon manning jesmond dene house", "sentiment": "none"}, {"name": "jonathon manning howard russell construction", "sentiment": "none"}], "locations": [{"name": "enfield", "sentiment": "none"}, {"name": "jesmond dene nursery", "sentiment": "none"}, {"name": "jesmond dene", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "rbs", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "ms morgan", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "treasury committee", "sentiment": "none"}, {"name": "atelerix", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}, {"name": "real tennis club", "sentiment": "none"}, {"name": "global restructuring group", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "jesmond dene house", "sentiment": "none"}, {"name": "apex business village", "sentiment": "none"}, {"name": "mps.financial conduct authority", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "royal bank", "sentiment": "none"}, {"name": "howard russell construction", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Longhorns BBQ Smokehouse to reopen after staff save struggling restaurant \nNewcastle’s popular Longhorns BBQ Smokehouse is reopening today after staff carried out a management buyout, saving the struggling restaurant from permanent closure. \nLonghorns proved popular with locals after it started serving a range of American style barbecue food from its restaurant on Mosley Street. \nNow the business has revealed it is opening the doors of its city centre branch once again after carrying out a management buyout, and attracting investment from businessman Dan Miller. \nLonghorns is relaunching tomorrow, September 15, at 5pm, with day-to-day operations being run by Jose Paniego, who has worked in the North East’s leisure sector for over a decade at venues including Slaley Hall, Sambuca restaurant in Durham, and Jesmond Dene House Hotel. \nThe return of the restaurant has allowed six full-time members of staff to keep their jobs, but more roles could be added in the future. It is unknown if any staff members lost their jobs. \nMr Miller, who owns The Fat Butcher steakhouse in Blyth, Northumberland, said: \nWhat we have been able to do is to retain some of the staff, which is great to do as we have a very good team in place and experienced staff. That is rare to find when taking over any business. \nWe are in a position where I have facilitated the buyout and we have put a management team together to manage the operation. I have come in to facilitate the buyout and for them to take the business and run it themselves. \nThe business will initially trade from its sole location on Mosley Street but will also sell food at key events, like festivals. \nMr Miller added: \nThe Mosley Street branch has been retained as the flagship restaurant, and then we will focus the energy of the business on events and functions. \nWe will do corporate events, street food and festivals. Longhorns Barbecue Smokehouse (Image: Newcastle Chronicle) 9:24 And Newcastle to Edinburgh in 14 minutes... 9:20 KEY EVENT Newcastle to Leeds in 13 minutes moves a step closer as North plan wins global Hyperloop contest \nA revolutionary transport system that could take people from Newcastle to Leeds in 13 minutes has taken a leap forward after winning a global competition. \nThe Northern Arc proposal – which would link Glasgow, Edinburgh, Newcastle, Leeds, Manchester and Liverpool – was one of 34 routes shortlisted in the Hyperloop One global challenge. \nMore than 2,600 international groups wanted to be part of the Hyperloop One Global Challenge – and now Northern Arc has fended off competition to be selected as one of 10 winners. \nThis brings the revolutionary proposal, led by Newcastle’s Ryder Architecture and engineers Arup, a step closer to reality, providing real hope that major cities across the North and Scotland could be connected through innovative technology which would allow passengers to travel between all cities in a little over 45 minutes. \nThe project aims to create super-fast transport in which passengers and cargo are loaded into a pod and accelerated gradually via electric propulsion through a low pressure tube. \nThe scheme is backed by Elon Musk, a Canadian-American business magnate who pioneered driverless cars through his Tesla company and is also developing a private space travel firm called SpaceX. \nNorthern Arc aims to expand the concept of the Northern Powerhouse to include the Scottish Central Belt, creating a pan-Northern City region, with a population in excess of 10 million people. \nWorking alongside other current transport improvements, the team believe the Hyperloop concept has the potential to help keep future generations moving and to transform connectivity across the North. \nAs technologies such as Hyperloop emerge and develop, the team is passionate that the UK and, more importantly, the North East is at the forefront of innovation. \nPaul Bell, partner at Ryder said: \nWe are hugely excited to be selected to collaborate with Hyperloop One on this transformational proposal. Hyperloop One are progressing the proof of concept work in Nevada at an incredible pace. \nThe north gave the world railway technology and we are passionate about making sure the north is at the forefront of the next generation of transport innovation, developing skills, expertise and system components that will be exported around the world. \nHyperloop One will now start to engage with us to develop the feasibility for hyperloop in the UK, and start to engage with government and people like Transport for North and the Northern Powerhouse. Proposed hyperloop link (Image: Copyright unknown) 9:15 Jonathon Manning Newcastle firm uses seaweed to transport stem cells in ground breaking new system \nA pioneering North East science company has developed a ground breaking way of transporting stem cells , by enclosing them in seaweed. \nThe technology, which has been developed by Newcastle University spin-out Atelerix, uses a gel made from seaweed to protect human cells without having to freeze them. \nAtelerix’s new system makes it simpler to transport cells used in stem cell therapy, and allows them to be delivered in a ready to use format. \nScientific founder, professor Che Connon of Newcastle University, has been working on the technology for five years. \nThe company is now planning to target three main markets, with the first being selling to companies that supply cells for research and development purposes. The firm is also planning to sell its services to cell therapy and regenerative medicine companies directly. \nAtelerix is also focusing on the development of a stem cell bandage, called StemGel, which can be used to treat injuries, burns, and wounds. It will initially be used on the outer layer of the eye. \nProf Connon said: \nEncapsulating cells in the alginate hydrogel is a simple, low cost system capable of preserving the viability and functionality of cells at temperatures between 4°C and 21°C for extended periods of time. \nUsed as a method of cell storage and transport, it overcomes the acknowledged problems associated with cryo-shipping. Cells are encapsulated by in... the gel for shipping in plates or vials, and can be rapidly released from the gel by the addition of a simple buffer. \nDr Mick McLean, CEO for Atelerix, said: \nUnderstanding both the technology and its commercial potential is essential for the translation of great science into an exciting business opportunity. \nPutting these elements in place by working together with the expert scientific team means that Atelerix has a clear value proposition - we enable the transport and storage of human cells at room temperature. (L-R) Prof. Che Connon and Dr. Stephen Swiokio from Newcastle University 9:11 Jonathon Manning UK financial watchdog refuses to publish RBS report \nBritain’s financial watchdog has refused to publish a leaked report into the scandal at Royal Bank of Scotland’s controversial restructuring unit, despite demands for its release by an influential committee of MPs.Financial Conduct Authority (FCA) chief executive Andrew Bailey pushed back after receiving a letter last week from Tory MP and Treasury Committee chair Nicky Morgan, who raised concerns about a leak to the BBC last month and called for the report to be published in full.But Mr Bailey said that publishing the skilled persons or Section 166 review - which collects insight about a firm’s activities from third parties - would mean revealing confidential information about the individuals who contributed to it. \nHe said: \nHowever, I recognise that the public interest justifies greater disclosure of material in the report relevant to the complaints of former customers. It is therefore our intention to publish a detailed summary. \nMr Bailey said the FCA has asked external lawyers to ensure the summary is a “fair and balanced” account of the report’s findings, adding that the report is nearly ready for publication.The FCA also has yet to decide whether the case requires a formal investigation.Mr Bailey’s offer falls short of Ms Morgan’s demands, which echoed calls by the SME Alliance and lawyers suing RBS on behalf of businesses affected by the scandal - which allegedly saw RBS’ turnaround unit GRG intentionally push businesses towards failure in hopes of picking up their assets on the cheap.The study was commissioned by the regulator almost four years ago as part of its inquiry into its Global Restructuring Group (GRG) and while the FCA pledged last November to publish a “full account” from the skilled persons’ report, it has so far refused to make it public.Commenting on Mr Bailey’s refusal, Ms Morgan said: \nThe Committee recognises that such reports are not intended for publication, and should in normal circumstances remain confidential. \nBut the report is now in the hands of an unknown number of third parties. If closure is ever to be brought to this long-running issue, Parliament and the public need the account ordered by the regulator. \nAnd so we consider that the public interest in publication in this specific case is overwhelming. A Royal Bank of Scotland sign (Image: Philip Toscano/PA Wire) 8:57 KEY EVENT Purplebricks lays foundations for US launch \nOnline estate agent Purplebricks is to launch in the US as it looks to tempt Americans to desert traditional high street firms and tap a $70bn (£52bn) market.The company will first set up shop in Los Angeles before extending across California, with other states also on the hit list.Boss Michael Bruce said the move represents the “single biggest moment in the company’s three-year history”. He said: \nWe are excited about the opportunity, in this 70 billion US dollars market, while mindful of the challenges. \nWe have planned accordingly, adapting both our technology platform and customer proposition, while building out an infrastructure and local team, with decades of experience. Purplebricks is looking to launch in the US (Image: Joe Giddens/PA Wire) 8:52 Jonathon Manning Jesmond Dene House could create luxury spa as part of 'once in a lifetime' land sale \nThe managing director of boutique hotel Jesmond Dene House has revealed hopes the venue can be extended to create a luxury spa on neighbouring land which is up for sale. \nThe neighbouring Jesmond Dene Nursery site in Newcastle was initially put up for auction with a guide price of £4m by Newcastle City Council last November, in one of the city’s most pivotal development site sales. \nThe land deal originally comprised 6.7 acres of land that had mostly been cleared yet included a number of vacant buildings, historic police stables and it also included the Grade II listed Real Tennis Club. \nHowever, the auction deadline was extended while the council agreed a secured future for the historic club, which the authority leases to the trustees of Jesmond Dene (Real) Tennis Club. \nThe deadline for bids to develop the remaining land is tomorrow, Friday September 15 – and Peter Candler, managing director of Jesmond Dene House said he has partnered with one of the bidders, with plans to extend the boutique hotel if the bid is successful. \nHe said the proposed development of the former nursery depot is critical to the future of the area and his special hotel, regardless of who secures the site. \nMr Candler said: \nIf we are involved in the proposals for this new site not only could it safeguard the future of the hotel and our 100 strong workforce but it could offer opportunities for expansion and new jobs to the area. \nThere could be an option for us to create a luxury spa and an additional 30 bedrooms. This would be a fantastic facility for the region and in addition could provide a further 40 quality jobs. \nWe are partnering with one of the bidders, a potential developer who is committed to a masterplan approach. It’s a huge site so there were would be residential development too. \nThis is a once in lifetime opportunity – and the only opportunity that the hotel has to expand. Due to its location in Jesmond Dene, there is no other way we could expand. \nWe have pushed for a masterplan approach for the site, so that each individual component considers the next component. \nWhoever ends up completing the development, the work will take years from start to finish so as well as the final scheme proposals it is also critical that issues such as noise, traffic and access are considered too. \nTo be clear, I have absolutely no issue with the development of this area and think it is a real opportunity but if done in an unsympathetic way it would damage what is a unique part of our beautiful city. Jesmond Dene House (Image: Handout) 8:47 Jonathon Manning Howard Russell Construction is fit for the future following boardroom shake-up \nA North East construction firm is gearing up for the future after a major boardroom shake-up following the retirement of one of its founders . \nHoward Russell Construction, which employs 33 staff from its office at Apex Business Village in Cramlington, was established in 1997 by David Varty and Joe Prouse, with Ian Goss joining them in 2003 as commercial director. \nAfter 20 years at the helm, Joe Prouse has announced his retirement and David Varty will take on the role of managing director following a share repurchase in March of this Year. \nThe firm has promoted a number of its staff and formed a new board which includes Ian Goss as chairman, Craig Muldoon as technical and sales director, Barry Wilkinson as contracts director and Andrea Styles as company secretary. \nOver the past five years Howard Russell has steadily built its turnover after enduring the worst effects of the recession. \nThe firm is targeting a turnover of £26m for the current financial year after securing a number of major contracts outside of the region. \nNew managing director David Varty is now focused on ensuring that the firm has the solid foundations needed to continue its growth. \nHe said: \nLast month we celebrated our 20th anniversary, which was a fantastic moment for the whole firm and with Joe’s retirement this really is an important year for us. We have worked very hard to secure work in the Midlands and South of England and we are now beginning to see the benefits with this year set to be our best yet. \nThe firm is currently carrying out more than £23m worth of new build projects across the country following its latest contract win, a £5.1m development of nine industrial units in Enfield for Chancerygate. The new board at Howard Russell Construction in Cramlington (Image: Howard Russell) 8:42", "external_links": [], "published": "2017-09-15T10:30:00.000+03:00", "crawled": "2017-09-15T11:18:33.019+03:00", "highlightTitle": ""}