{"organizations": [], "uuid": "c2407e11dfcfe7666696b566138522072fb26bff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13340729.ece/ALTERNATES/s1200/SouthShieldsBlogPic.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13622836", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-15T08:30:00.000+03:00", "replies_count": 0, "uuid": "c2407e11dfcfe7666696b566138522072fb26bff"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13622836", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tom eden colonel porter", "sentiment": "negative"}, {"name": "hayden", "sentiment": "none"}, {"name": "tom eden get", "sentiment": "none"}, {"name": "tom tom eden", "sentiment": "none"}, {"name": "howay hootenanny", "sentiment": "none"}, {"name": "chrissie gladstone", "sentiment": "none"}, {"name": "isaac hayden", "sentiment": "none"}, {"name": "porter", "sentiment": "none"}, {"name": "tom eden", "sentiment": "none"}], "locations": [{"name": "west road", "sentiment": "none"}, {"name": "west end food bank", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ponteland", "sentiment": "none"}], "organizations": [{"name": "st james", "sentiment": "none"}, {"name": "nufc food bank", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Social media images appear to show wires sticking out of a Lidl bag. \nThis is believed to be the source of the explosion. \nThe wires appear to be grey or white with red tips. \nPolice have not confirmed yet whether the incident is being treated as terror-related. \nHere’s footage of the bag: 09:51 Tom Eden Police in Parliament ‘told to be vigilant’ \nIt’s understood police in Parliament, which beefed up security after March’s terror attack, have been told this morning to be “vigilant”. \nMarch’s terror attack saw an officer, PC Keith Palmer, stabbed to death after he mowed down innocent pedestrians on Westminster Bridge. \nIt is believed security will be stepped up at key locations after today’s incident. London Tom Eden Emergency services at the scene \nEmergency services were called to a London Underground station after reports of an explosion on a train. (Image: PA) \nPictures appeared to show an explosion in a bucket towards the rear of a train.The incident occurred at Parsons Green Tube station on Friday morning.A metro.co.uk reporter said passengers suffered facial burns.The Metropolitan Police said: \n“We are aware of an incident at Parsons Green Tube station. Officers are in attendance.” \nBritish Transport Police said: \n“We’re aware of an incident at Parsons Green station. Officers are at the scene. The station is closed.” \nTransport for London said it is “investigating an incident at Parsons Green” and urged customers travelling between Wimbledon and Earls Court to use alternative routes.A London Ambulance Service spokesman said: \n“We are on scene alongside the Metropolitan Police at Parsons Green.” \nLondon Fire Brigade said they were called to the incident at 8.21am on Friday. 09:14 Parsons Greet tube station closed after reports of explosion \nLondon’s emergency services are attending a ‘live incident’ at Parsons Green Underground station . (Image: PA) \nReports say a container has exploded on a packed London Tube at 8.15am this morning, with commuters saying some have suffered burns and facial injuries. \nThe Met Police says it is ‘aware’ of the reports and ‘will release facts when we can’. Officers are at the scene. \nThe London Ambulance service says paramedics are at the District Line station. \nPictures have emerged of a white container or tub in a Lidl bag near one of the doors, which reportedly exploded in flames and released some kind of gas, Mirror Online reports. \nOne passenger said that a “fireball flew down carriage and we just jumped out open door”. \nTransport for London has suspended District Line services between Earls Court and Wimbledon. \nOn Twitter, TfL said: “We are investigating an incident at Parsons Green. Customers travelling between Wimbledon & Earl’s Court are advised to use alternative routes.” London Reports of an explosion on the tube \nEmergency services are responding to a ‘live incident’ at Parsons Green tube station in London. \nThere are reports of multiple casualties and victims with burnt faces. \nThere are also reports of armed police at the scene. \nA Transport for London spokesman confirmed a ‘live incident’ is underway. Kian Musgrove Tom Eden One more trip to America for Kian \nKian and mum Kat, 29, will fly to America for the final time in January after almost two years of waiting and fundraising. \nKat said: \n“When he gets to New York he’ll get scans again and a vaccine, and that’ll be it. \n“Then we’re just hoping he’s going to be okay once he’s had the treatment. \n“We need to get lots of follow-up appointments, hoping to get them arranged in England, providing everything’s okay at that time. \n“The doctors are saying they’re happy with him at the moment, there’s no sign of progression. \n“He can still relapse but we’re just hoping that doesn’t happen. He seems good in himself at the moment.” Top Story Kian Musgrove's latest scan results \nIt’s the news his doting mum has been praying for. \nWith just one round of cancer treatment to go, there was a major step forward for little Kian Musgrove as he received his latest scan results. (Image: Newcastle Chronicle) \nThe five-year-old’s mum Kat was over the moon as specialist medics in New York told her the neuroblastoma her son has been fighting has not progressed. \nThe Prudhoe schoolboy has spent more than a year travelling back and forth to America for treatment to target the cancer cells in his body. \nBut now the end is finally in sight as he returned from his penultimate round of treatment earlier this month. Kian has spent most of his life fighting the childhood cancer, which has a very high relapse rate. Sri Lanka Tom Eden Journalist 'killed by crocodile' \nTributes have been paid to a “talented, energetic and dedicated” journalist who was reportedly killed by a crocodile while on holiday in Sri Lanka. \nFinancial Times reporter Paul McClean was said to have been washing his hands in the river when he was attacked by the reptile. \nHe is thought to have been staying with friends at the East Beach Surf Resort near Elephant Rock in the South East of the island. \nJames Lamont, managing editor of the Financial Times, said: \n“Few details are known about the circumstances. \n“We are liaising closely with his family and the Foreign and Commonwealth Office and offering the FT’s assistance. \n“Our thoughts are with his family, friends and loved ones. \n“We are in touch with them, doing all we can to help during this difficult time.” \nMr McClean, aged in his mid-20s, was “a talented, energetic and dedicated young journalist” he said, adding that he had “a great career ahead of him at the FT”. \nMr McClean, who described himself on his Twitter profile as a “long-suffering Evertonian”, worked on the paper’s fastFT desk, and had been based for a time in Brussels reporting on Brexit and the EU. \nHe was described by Katie Martin, head of fastFT, as “a warm, funny person and a talented young journalist with a curious mind” and “a joy to be around, truly, with an impish sense of humour”. \nMr McClean was seen by a local fisherman being “dragged into the river” by the crocodile, said Fawas Lafeer, owner of Safa Surf School. Frankie Cooper Tom Eden Detective reveals race against time to capture killer \nPools of blood left on a city street led police to tragic Frankie Cooper’s killer. \nThe detective who brought his 17-year-old killer to justice has today revealed how police faced a race against time to trace the knifeman after midday violence erupted in Newcastle . \nThe teen, who cannot be named for legal reasons, was cleared of Frankie’s murder convicted of manslaughter on the grounds of lack of intent by a majority verdict following trial. \nDairan Browne, 19, was cleared of murder and manslaughter. \nAnd Detective Inspector Paul Waugh, of Northumbria Police , has told how Frankie’s tragic death was a stark reminder of the dangers of carrying knives in public. \nHe said: \n“This whole incident brings into focus the dangers of knives and carrying knives around. \n“It’s devastated not only Frankie’s life, but the lives of the offender and their friends and families. If you go out carrying a knife, this is the tragic result it can have.”", "external_links": [], "published": "2017-09-15T08:30:00.000+03:00", "crawled": "2017-09-15T09:44:58.000+03:00", "highlightTitle": ""}