{"organizations": [], "uuid": "60edc55c2548f72e72f3174e9c08e53d06989b4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13663568.ece/ALTERNATES/s1200/Theresa-May-Holds-Cabinet-Meeting-Ahead-Of-Tomorrows-Florence-Brexit-Speech.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-boris-johnsons-political-career-13663557", "country": "GB", "domain_rank": 21960, "title": "Will Brexit, Boris Johnson's political career, or the world end first? Mike Kelly asks", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-24T10:00:00.000+03:00", "replies_count": 0, "uuid": "60edc55c2548f72e72f3174e9c08e53d06989b4e"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-boris-johnsons-political-career-13663557", "ord_in_thread": 0, "title": "Will Brexit, Boris Johnson's political career, or the world end first? Mike Kelly asks", "locations": [], "entities": {"persons": [{"name": "boris johnson", "sentiment": "neutral"}, {"name": "will brexit", "sentiment": "neutral"}, {"name": "mike kelly", "sentiment": "neutral"}, {"name": "johnson", "sentiment": "none"}, {"name": "jesus", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "hotel california", "sentiment": "none"}, {"name": "share britain", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Will Brexit, Boris Johnson's political career, or the world end first? Mike Kelly asks In a weirder week than normal these were the questions that faced the great British public Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhich will come to an end first - the world, Boris Johnson’s political career or Brexit ? \nThose were the big questions of last week that was even weirder than normal. \nIf you’re reading this after Saturday, the world hasn’t ended as predicted and a fair few God botherers will be going back to some serious bible study to work out what went wrong. \nSaturday, in case you missed it, was the date pencilled in for the latest ‘Rapture’. \nThis is fast becoming an almost annual event in which optimistic Christians believe at last they will be proved right and Jesus will come again to guide them all upstairs to safety with the big fella and then all non believers left on earth will be wiped out. Read More As Boris Johnson takes on Theresa May, is Brexit going horribly wrong? \nThe term Rapture does not appear in the Bible, but the signs are supposed to be there and it is a term frequently used in conjunction with events relating to the Second Coming of Jesus. \nUsually news of the Rapture makes a big noise - for comedy purposes at the very least when a group of believers are filmed tramping up a hill in expectation on the night and then filmed again looking rather forlorn the next morning by an army of smirking heathens. \nHowever the shenanigans by Boris Johnson on what appeared to be a political suicide mission somewhat overshadowed it. \nHe wrote an article for the Telegraph in which he laid out his thoughts on what Brexit should or should not mean which appeared to vary with the official Tory party line , whatever that is. British Prime Minister Theresa May (Image: Getty Images Europe) \nAs an aside it seems odd that in order to access the thoughts of a government minister whose £135k a year salary is met by taxpayers on an issue which will impact on them profoundly they had to pay cash to a news organisation. Where do his loyalties lie? \nAnyway, some predicted the article could mean the end of Johnson’s Cabinet career. Not yet it seems. \nFor under greater threat than Johnson and the world at this moment is Brexit which is falling apart at the seams. \nWith EU citizens who work in the NHS and as a vital part of the food chain now upping sticks and leaving, the full impact of the referendum is beginning to hit home. Project Fear has become Project Here. Read More Theresa May's Brexit speech RECAP: Two-year transition deal proposed by PM in Florence \nThe health crisis is not far off being a national disaster and there’s also talk of food shortages. \nMeanwhile despite much grandstanding Theresa May has now admitted that getting out of Europe isn’t quite as simple as her ‘no deal is better than a bad deal’ mantra. \nShe has now announced plans to fork out £20bn a year to actually extend our stay in the EU for another two years after Brexit day in March, 2019. \nI suspect that date will be put back further in the future because for the UK, the EU has become like the Hotel California. \nWe can check out anytime but we can never leave. Like us on Facebook", "external_links": [], "published": "2017-09-24T10:00:00.000+03:00", "crawled": "2017-09-24T11:25:49.001+03:00", "highlightTitle": ""}