{"organizations": [], "uuid": "fdc22f6088c41375e845428e66677b51b4afe6c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.birminghammail.co.uk/incoming/article13637636.ece/ALTERNATES/s1200/vince1.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/liberal-democrat-leader-vince-cable-13639225", "country": "GB", "domain_rank": 21960, "title": "Liberal Democrat leader Vince Cable reveals plan to stop Brexit and keep us in the EU", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-19T00:00:00.000+03:00", "replies_count": 0, "uuid": "fdc22f6088c41375e845428e66677b51b4afe6c0"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/liberal-democrat-leader-vince-cable-13639225", "ord_in_thread": 0, "title": "Liberal Democrat leader Vince Cable reveals plan to stop Brexit and keep us in the EU", "locations": [], "entities": {"persons": [{"name": "vince cable", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "vince", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "farron", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "andrew matthews/pa wire", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brexit britain", "sentiment": "none"}, {"name": "bournemouth international centre", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu news liberal democrat", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "single market and customs union", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "coalition government", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Liberal Democrat leader Vince Cable reveals plan to stop Brexit and keep us in the EU In his big speech to the Lib Dem conference, Vince Cable will say: 'We believe the public have a right to change their mind' about Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nVince Cable will position the Liberal Democrats firmly as “the party of remain” as he delivers a staunch anti-Brexit speech to the Liberal Democrat annual conference. \nHe will describe Brexit as “a disaster” and warn that “Brexit Britain will be poorer and weaker” than if it stayed in the European Union. \nSir Vince will take on claims he is ignoring the result of last year’s EU referendum, saying: “We believe the public have a right to change their mind.” \nAnd he will accuse Labour leader Jeremy Corbyn of betraying voters who backed him in June’s General Election, by lining up behind the Tories to ensure Brexit happens. Liberal Democrat leader Sir Vince Cable during a question and answer session during the second day of the Liberal Democrats Autumn Conference at the Bournemouth International Centre. (Image: Andrew Matthews/PA Wire) \nIt will be Sir Vince’s first keynote speech to the party conference as leader, after he took over from Tim Farron in July. He answered questions from activists on Sunday. \nHe will endorse the policy first drawn up under Mr Farron’s leadership, when the Liberal Democrats pledged to hold a second Brexit referendum giving voters the chance to stay in the EU after all. Read More Newcastle MP threatened over 'unspeakable crimes' in wake of Operation Shelter views \nBut Sir Vince will go further than his predecessor in making it crystal clear that his aim is to keep the UK in the European Union. \nIn a dig at rival politicians including Boris Johnson, the Foreign Secretary and prominent ‘Leave’ campaigner, Sir Vince is expected to say: “A disaster looms. Brexit. The product of a fraudulent and frivolous campaign led by two groups of silly public school boys living their dormitory pillow fights.” A Union Jack flies with the European Union flag (Image: Getty Images Europe) \nHe will add: “In the real world, we have yet to experience the full impact of leaving Europe. But we have a taste of what is to come in the fall of the value of the pound. \n“Foreign exchange dealers are not point scoring politicians. Their cold, hard, unsentimental judgement has been, quite simply, that Brexit Britain will be poorer and weaker after Brexit than if we had decided to stay in Europe.” \nHe will accuse Labour of helping the Tories, saying they “lined up behind Theresa May, maximising the chance of chaos and disruption”. \nSir Vince will offer to work with “sensible grown-ups in the Conservative party and the Labour Party and the Greens” to try to ensure the UK retains membership of the Single Market and Customs Union. Liberal Democrat leader Sir Vince Cable during a question and answer session during the second day of the Liberal Democrats Autumn Conference at the Bournemouth International Centre. (Image: Andrew Matthews/PA Wire) \nBut he will also make it clear that the Lib Dems aim to prevent Brexit happening at all, saying: “Our position is clear: the Liberal Democrats are the party of Remain.” \nSetting out plans for a second EU referendum, he will say: “Let me be clear. This is not a call for a re-run – a second referendum – on Brexit. Read More New funding system provides millions in extra cash for North East schools \n“It is a call for a first referendum on the facts: when we know what Brexit means.” \nLib Dems have suffered a dramatic decline in their fortunes since being in Government as part of the Coalition Government from 2010 to 2015. \nThey won just 12 out of 650 seats in June’s election, a far cry from the 57 seats they won in 2010. Like us on Facebook", "external_links": [], "published": "2017-09-19T00:00:00.000+03:00", "crawled": "2017-09-19T02:32:26.001+03:00", "highlightTitle": ""}