{"organizations": [], "uuid": "93f5798bb3579fbacb9e1287978d86e1a695f8cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13629393.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/wetherspoons-set-strip-eu-beers-13629335", "country": "GB", "domain_rank": 21960, "title": "Is Wetherspoons set to strip EU beers and coffee from its menus?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-16T13:49:00.000+03:00", "replies_count": 0, "uuid": "93f5798bb3579fbacb9e1287978d86e1a695f8cd"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/wetherspoons-set-strip-eu-beers-13629335", "ord_in_thread": 0, "title": "Is Wetherspoons set to strip EU beers and coffee from its menus?", "locations": [], "entities": {"persons": [{"name": "wetherspoons", "sentiment": "neutral"}, {"name": "tim martin", "sentiment": "none"}, {"name": "jamie oliver-backed", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "juncker", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "jacob rees-mogg", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "taunton", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "lavazza", "sentiment": "neutral"}, {"name": "european union", "sentiment": "none"}, {"name": "kopparberg", "sentiment": "none"}, {"name": "wetherspoons", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "manchester evening news", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Is Wetherspoons set to strip EU beers and coffee from its menus? European brands including Lavazza and Kopparberg are among those under threat in the protest Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTwo of the most popular brands at pub favourite JD Wetherspoon could disappear from the menu as its owner takes a pro-Brexit stance against Brussels. \nTim Martin, a prominent supporter of last year’s Leave campaign has said he will stop stocking any beers or coffee made by European Union members if trade deals with the UK are blocked as part of the ongoing negotiations, the Manchester Evening News reports . \nThat could spell the end of customers buying a cup of Italian Lavazza coffee or Swedish Kopparberg cider at their nearest Wetherspoon in future if they become more expensive in Britain as a result of Brexit. \nMartin said: “In the current negotiations, democratically-elected politicians from the UK are dealing with unelected oligarchs from the EU. \n“Since the oligarchs are not subject to judgement at the ballot box, their approach is dictated by more sectarian factors – the interests and ideology of EU apparatchiks like them, rather than residents or businesses from EU countries. The Five Swans (Image: newcastle chronicle) \n“As a result of their current posturing and threats, EU negotiators are inevitably encouraging importers like Wetherspoon to look elsewhere for supplies. \n“This process is unlikely to have adverse effects on the UK economy, as companies will be able to switch to suppliers representing the 93% of the world’s population which is not in the EU, but this evolution will eventually be highly damaging to the economy of the EU. \n“Wetherspoon is extremely confident that it can switch from EU suppliers, if required, although we would be very reluctant to initiate such actions. \nHe said Juncker and other EU officials “need to take a wise-up pill in order to avoid causing further economic damage to struggling economies like Greece, Portugal, Spain and Italy.” Read More Jacob Rees-Mogg claims Labour 'hushed up' foodbanks but Newcastle's first opened in 2011 \nMany European sounding lagers sold here are actually brewed under licence in the UK, so may not be affected by the company’s decision. \nBut one product Martin said could be impacted is Swedish cider Kopparberg, which he claimed Wetherspoons sold more of than the whole of Sweden. \n“Would we switch to Taunton cider or other ciders?,” he said. “There are a lot of cider companies in the UK.” \nMartin said he was “almost embarrassed” to admit that coffee was its biggest selling product. \n“Lavazza is an Italian company, they are really good,” he added.”But it is very difficult for them to make their point (to EU officials).” A pint of beer (Image: PA) \nIt came as Wetherspoon’s announced annual profits jumped 25% to £103million, with sales up 4.1% to £1.6billion. \nThe firm’s share price leapt 13% to a record high yesterday, boosting the value of founder Martin’s stake by £48m to £398m. \nMartin repeated calls for the VAT on pub grub and drink to be cut to supermarket levels, claiming the company could open up an extra 300 pubs as a result. \nHe also slammed the celebrity chef Jamie Oliver-backed sugar tax, which would cost it £4m this year. \nHe feels you should tax soft drinks, which he doesn’t make, but not desserts, which he does,” he said. \nMartin joked that he didn’t have plans for new product lines “unless they legalise cannabis”. Like us on Facebook", "external_links": [], "published": "2017-09-16T13:49:00.000+03:00", "crawled": "2017-09-16T14:29:13.000+03:00", "highlightTitle": ""}