{"organizations": [], "uuid": "a5df29e0440484619903f6dde9714b4e6d27a59d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13571066.ece/ALTERNATES/s1200/UKIP-Autumn-Conference-2015-Day-3.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/slow-pace-brexit-negotiations-angering-13570928", "country": "GB", "domain_rank": 21960, "title": "Why is the slow pace of Brexit negotiations angering some North East politicians?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-04T18:00:00.000+03:00", "replies_count": 0, "uuid": "a5df29e0440484619903f6dde9714b4e6d27a59d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/slow-pace-brexit-negotiations-angering-13570928", "ord_in_thread": 0, "title": "Why is the slow pace of Brexit negotiations angering some North East politicians?", "locations": [], "entities": {"persons": [{"name": "barnier", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "trevelyan", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "british government", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "the european union", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why is the slow pace of Brexit negotiations angering some North East politicians? The slow pace of Brexit negotiations has angered some North East politicians who are demanding action Share Jonathan Arnott (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA North East MEP has condemned the European Union for insisting the UK must agree to pay billions of pounds before talks on a trade deal can begin. \nJonathan Arnott, the region’s UKIP MEP , said: “We need to make a stand on this because if we don’t this early in the negotiations what message does that send to the rest of the negotiations?” \nHe spoke out as relations between Michel Barnier, the EU’s chief negotiator, and David Davis, the British Government’s Brexit Secretary, reached a new low. \nMr David described the EU’s approach as “silly” in an appearance on the BBC’s Andrew Marr show on Saturday \nHe said Mr Barnier “wants to put pressure on us, which is why the stance this week in the press conference - bluntly, I think it looked a bit silly because there plainly were things that we had achieved”. \nIt followed a press conference last week in which the EU representative complained that little progress had been made in talks about Brexit. \nAnd Mr Barnier suggested the UK needed to be taught about the consequences of Brexit, saying over the weekend: “There are extremely serious consequences of leaving the single market and it hasn’t been explained to the British people. We intend to teach people ... what leaving the single market means.” \nMr Barnier, a French politician, later clarified the comments, saying Brexit was an “occasion to explain single market benefits in all countries, including my own.” \nProgress has stalled partly because the EU is refusing to discuss the future relationship between the UK and EU until the UK agrees to make payments estimated at up to £84bn. \nThis is money the UK is said to owe the EU, although much of it appears to be for future planned projects to increase living standards in Eastern European countries rather than money that has already been spent. \nMr Arnott said: “The European Union isn’t asking us to give up a little bit and get something in return. They’re asking us to give up a huge amount and get absolutely nothing in return and then try to make the UK seem unreasonable for not rolling over and accepting it. \n“They need to stop trying to push us into giving in to its excessive demands in exchange for nothing thinking we will just roll over.” \nAnne-Marie Trevelyan, Conservative MP for Berwick and a supporter of Brexit, said Mr Barnier needed to accept people in the UK, and possibly elsewhere, did not wish to be part of the EU project. \n“It’s a train heading to a supra-national state. We want to be friends and we want to trade but we don’t want to be part of it,” she said. Read More Failing Brexit talks could do long term damage to North East economy \nMs Trevelyan said talks were likely to become more productive after the German federal elections on September 24. \nOne of the difficulties facing the EU was how to replace the funding currently provided by the UK, and this was a particular issue for Germany as it might have to provide much of the cash, she said. \nAsked about the prospect of stepping up the tempo of talks, a Downing Street spokeswoman said: “We are ready to intensify negotiations. \n“Nothing has been formally agreed but that is something that we can discuss. \n“Typically, with negotiations, as time goes on you see the pace pick up. \n“Certainly we wouldn’t rule that out, but nothing has been agreed yet.” \nThe House of Commons will this week begin debating the second reading of the European Union (Withdrawal) Bill, a key piece of Brexit legislation which will bring existing EU laws and regulations into UK law. \nThe aim is to allow them to be abolished or changed over time, if Parliament chooses to do this, rather than simply ending all at once when Brexit takes place. \nThe legislation is also known unofficially as the Great Repeal Bill. \nA prominent Conservative opponent of Brexit dismissed suggestions the Government could face a rebellion over the legislation. \nFormer minister Anna Soubry said suggestions of a rebellion were “an absolute nonsense”, when she spoke on BBC Radio 4’s Today programme. \nShe said: “I don’t know any Conservative Member of Parliament that isn’t going to vote for this Bill at second reading.” Like us on Facebook ", "external_links": [], "published": "2017-09-04T18:00:00.000+03:00", "crawled": "2017-09-04T18:15:17.022+03:00", "highlightTitle": ""}