{"organizations": [], "uuid": "6648426d43a3d5efa313f1c18ad67b24af96cca7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13603759.ece/ALTERNATES/s1200/Jeremy-Corbyn-Visits-Scotland-In-An-Attempt-To-Win-Back-Support.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-holds-annual-conference-brighton-13663647", "country": "GB", "domain_rank": 21960, "title": "Labour holds its annual conference in Brighton as the party has united around Jeremy Corbyn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-24T10:00:00.000+03:00", "replies_count": 0, "uuid": "6648426d43a3d5efa313f1c18ad67b24af96cca7"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-holds-annual-conference-brighton-13663647", "ord_in_thread": 0, "title": "Labour holds its annual conference in Brighton as the party has united around Jeremy Corbyn", "locations": [], "entities": {"persons": [{"name": "jeremy co", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "tony benn", "sentiment": "none"}], "locations": [{"name": "brighton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "jeremy corbyn news opinion labour", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "ipsos mori", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Labour holds its annual conference in Brighton as the party has united around Jeremy Corbyn Activists and MPs are meeting as the Labour left has a real chance to lead the party into government Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nLabour activists are gathered in Brighton for what might be their biggest annual conference ever. \nThe party has issued 13,500 passes. And more members are due to turn up than at any Labour conference in the past ten years. There are 7,700 members attending in various guises, whether as visitors or delegates. \nLabour has a spring in its step and it’s easy to understand why. \nAn Ipsos MORI poll put them ahead of the Tories , with 44 per cent of voters apparently saying they would vote Labour in an election, compared to 40 per cent backing the Tories. \nIt follows June’s general election when Labour gained 30 seats and Theresa May’s Conservatives lost their majority. \nOf course, Labour lost that election. And if anyone could be described as winning it, it was the Tories. But it’s Labour that seems to be gaining popularity. \nParty leader Jeremy Corbyn got it right when he said in an interview: “The election has changed politics in this country. We are now the mainstream.” \nBut there’s a catch. Read More Labour Deputy Leader Tom Watson on rule changes, Brexit and Destiny 2 \nThe Labour Party itself has always been mainstream. Mr Corbyn seems to have been referring to the left-wing, unashamedly socialist politics that he believes in. \nLabour’s civil wars of the 1980s ended with the defeat of left-wingers such as Mr Corbyn’s political hero, Tony Benn. \nThe left (or hard left as some people call them) became a fringe tendency within the Labour Party, tolerated and patronised by MPs from other traditions. \nNot any more. The left are the masters now. Read More Theresa May pledges to pay billions to EU and wants two-year Brexit transition period \nWhat’s changed since the election is that just about everyone in the party now accepts that. \nWhether they’re happy about it or not, Labour MPs of all descriptions accept that Mr Corbyn has earned the right to lead them, and to pursue his type of politics. \nThat means standing on a left-wing manifesto with plans to nationalise the railways, push up the minimum wage, give public sector workers a pay rise – and increase taxes for larger businesses and some better off people. \nIt will be the next election, more than the last one, that reveals whether the public will vote for these policies. Because Labour now looks like a potential government that could actually carry them out. \nTheresa May’s divided administration looks more fragile by the day. Labour must be ready. Like us on Facebook ", "external_links": [], "published": "2017-09-24T10:00:00.000+03:00", "crawled": "2017-09-24T10:08:02.000+03:00", "highlightTitle": ""}