{"organizations": [], "uuid": "6439ccb112e07a9fe8f619b29c45bd479b346240", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12079463.ece/ALTERNATES/s1200/JS102074544.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-needs-brexit-deal-doesnt-13655523", "country": "GB", "domain_rank": 21960, "title": "Newcastle needs Brexit deal that doesn't undermine its economic growth, leader says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-21T21:00:00.000+03:00", "replies_count": 0, "uuid": "6439ccb112e07a9fe8f619b29c45bd479b346240"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-needs-brexit-deal-doesnt-13655523", "ord_in_thread": 0, "title": "Newcastle needs Brexit deal that doesn't undermine its economic growth, leader says", "locations": [], "entities": {"persons": [{"name": "nick fo", "sentiment": "negative"}, {"name": "coun forbes", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "tyneside cinema", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "business newcastle", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "brexit share newcastle city council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle needs Brexit deal that doesn't undermine its economic growth, leader says Nick Forbes uses State of the City speech to say that Newcastle needs to prepare for the potential shock of Brexit Share Newcastle City Council leader Nick Forbes Share Get business   Thank you for subscribing!   \nNewcastle needs to be ready for the challenges of Brexit if it is to continue its economic growth, the city’s leader has said. \nIn his annual State of the City address, Newcastle City Council leader Nick Forbes said that much of the area’s recent success had been built on European funding, including the Science Central site where he made his speech. \nHe said that the region “urgently needs assurances” that the Government’s Brexit deal will not undermine a boom in the city’s economy that recently saw it highlighted for having both the highest increase in average earnings at 6.3% in the UK and the biggest rise in productivity. \nThat Barclays study suggested a growing economic divide in the North East, with Newcastle’s boom coming at the same time that other parts of the region saw a worsening of a number of economic factors. \nCoun Forbes said that Newcastle had to be a city “preparing for the future” so that it did not suffer from the economic shock of Brexit in the same way that it did during the recession of 2007/08. Prime Minister Theresa May (Image: PA) \nHe was speaking on the eve of Prime Minister Theresa May’s speech in Florence, which is expected to set out more clearly Britain’s position on Brexit after months of wrangling both with Europe and within the Cabinet that have seen business confidence suffer. \nCoun Forbes said: “Newcastle and the North East have benefited immensely from the European Union, from finances and trade to culture and knowledge, and it is essential that whatever happens next builds on those benefits rather than abandoning them. Read More Plunge in business confidence sees firms downsize and going out of operation \n“In the last five years alone some £105m in EU funds has come to the city, helping fund projects at the Theatre Royal, Tyneside Cinema and the Great North Museum. The building we are in was kickstarted with EU funds. \n“Investment from Europe also comes to our city from another route – from trade. The North East has been the only English region with a positive trade balance for virtually the last 20 years. A Union Jack flies with the European Union flag (Image: Getty Images Europe) \n“Earlier today I met, along with a number of business leaders and the LEP, with the Brexit Minister. We stressed the importance of the labour market to our economy, including the high skilled economy, of the significance of our universities to our growth, and of the importance of trade to this region. I told him that we urgently need assurances that a post-Brexit settlement will reflect and build on our strengths. Because right now Brexit is a huge unknown, which threatens to undermine those who are not ready for a challenge.” \nCoun Forbes said devolution offered a chance for the region to shape its own future, with his city joining North Tyneside and Northumberland in hoping to agree a deal with the Government soon. Like us on Facebook", "external_links": [], "published": "2017-09-21T21:00:00.000+03:00", "crawled": "2017-09-21T22:23:29.001+03:00", "highlightTitle": ""}