{"organizations": [], "uuid": "b8effe87b05a80366855dfe1690111d06a00ab9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13329406.ece/ALTERNATES/s1200/Theresa-May-interview.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-brexit-key-speech-13660344", "country": "GB", "domain_rank": 21960, "title": "Theresa May's Brexit speech LIVE: Two year transition deal to be proposed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-22T16:22:00.000+03:00", "replies_count": 0, "uuid": "b8effe87b05a80366855dfe1690111d06a00ab9c"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-brexit-key-speech-13660344", "ord_in_thread": 0, "title": "Theresa May's Brexit speech LIVE: Two year transition deal to be proposed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This was an important line. May clearly not going to go down the low-tax route. 15:02 Sean Seddon The Brexit divorce bill \nShe says that some estimates of how much the UK should pay on departure have been exaggerated, a swipe at some Brussels figures who’ve floated figures like £60bn. \nBut May says that the UK will honour our commitments, clearest sign yet the UK government has accepted it will need to pay a hefty sum. 14:59 KEY EVENT Implementation period or cliff edge? \nMay is clear there needs to be an implementation period which would be “strictly time limited”. \nShe says that this period will last about two years but that elements could be brought forward more quickly. \nMay is setting a pretty strict limit here - this is all about keeping Brexiteers in her party happy. \nThey can just about stomach an implementation period but they will demand it doesn’t go on a second longer than necessary. \nShe calls for a firm lock that this period won’t go on beyond that. 14:57 Sean Seddon May on negotiations \nThe UK will cease to be a member of the EU from 29 March, 2017 she says. \nBut, she says, from that point neither party will be able to put these new arrangements in place. \nMay clearly wants these negotiations done early and seems to be sending a message to negotiators to get a move on. 14:55 May wants a big new security agreement \nMay has now moved on to the next big part of her speech: security. \nShe says threats are evolving faster than ever and that new dynamic arrangements that go beyond what is currently in place is needed. \nMay calls for a “bold new strategic agreement”, a treaty between the UK and the EU, that would strengthen our security relationship. \nThis would cover human rights and data protection and be able to respond to “threats”. \nIt would also cover collaboration between different police forces and security agencies. \nMay has gone full Catherine Ashton here - what she’s proposing would have scared some Brexiteers a few years ago. \nThis deal would be “unprecedented” in its depth. Prime Minister Theresa May holding talks with US President Donald Trump (Image: PA) 14:51 Sean Seddon What will replace the ECJ? \nShe says the government is committed to strengthening standards and rights, a swipe at Jeremy Corbyn and his emphasis on worker’s right in the Brexit talks. \nMay says there will be agreement on some things and area where there will be friction but “rights and obligations must be held in balance” and will effect how much access the two parties have to each other’s markets. \nA new mechanism, therefore, will be needed to mediate that between the two. \nNot UK courts, not the ECJ - May is calling for a new body or mechanism for this. \nThere is, however, little detail on what this would like so far. A Union Jack flies with the European Union flag (Image: Getty Images Europe) 14:48 Sean Seddon A new \"creative\" relationship \nThe UK is the EU’s largest trading partner, she says, and the EU is ours and that it’s in every interest to find a “creative” solution. \nCreative is the buzzword of this speech - it’s come up at least five times already. 14:47 Sean Seddon New economic relationship \nThe UK will not be part of the single market after Brexit because the “four freedoms” are indivisible. \nShe says a “new and different balance” is needed and that the UK does not start with a blank sheet of paper like Canada and similar countries did during trade talks. \nMay says that the current models like EEA membership and CETA are not good enough for the UK and something else is needed. \n“Would not work for the British people and would immediately lead to friction, damaging our relationship in the future”. \nShe says CETA type deal would not benefit either parties and “could take years to negotiate” - she added “we can do so much better than this”. 14:43", "external_links": [], "published": "2017-09-22T16:22:00.000+03:00", "crawled": "2017-09-22T16:46:06.007+03:00", "highlightTitle": ""}