{"organizations": [], "uuid": "e2a11ab772922dbe43a5dd58740e0715d1a480a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/incoming/article452672.ece/ALTERNATES/s1200/Michael-GovePNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/local-news/defra-secretary-michael-gove-admits-452636", "country": "GB", "title": "Defra Secretary Michael Gove admits his love of a Ginsters pasty on South West visit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-09T23:15:00.000+03:00", "replies_count": 0, "uuid": "e2a11ab772922dbe43a5dd58740e0715d1a480a8"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/local-news/defra-secretary-michael-gove-admits-452636", "ord_in_thread": 0, "title": "Defra Secretary Michael Gove admits his love of a Ginsters pasty on South West visit", "locations": [], "entities": {"persons": [{"name": "michael gove", "sentiment": "none"}, {"name": "raoul humphreys", "sentiment": "none"}, {"name": "eustice", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "charles cross", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "cornwall live", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "humphreys", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "george eustice", "sentiment": "none"}], "locations": [{"name": "south west", "sentiment": "none"}, {"name": "newlyn", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "camborne", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "rosewarne", "sentiment": "none"}, {"name": "rame peninsula", "sentiment": "none"}], "organizations": [{"name": "parma", "sentiment": "none"}, {"name": "green and blue design company", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "food and rural affairs", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "cornwall live", "sentiment": "none"}, {"name": "duchy college", "sentiment": "none"}, {"name": "principal of cornwall college", "sentiment": "none"}, {"name": "redruth conservative", "sentiment": "none"}, {"name": "cornwall pasty company", "sentiment": "none"}, {"name": "state for education and justice", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Defra Secretary Michael Gove admits his love of a Ginsters pasty on South West visit New Defra secretary Michael Gove was on a whistle-stop visit of Cornwall this week Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nThe secretary of State for the Environment, Food and Rural Affairs Michael Gove has admitted enjoying tucking into a Ginsters pasty while on a three-stop visit of Cornwall. \nThe architect of the Leave campaign during the Brexit Referendum campaign and former Secretary of State for Education and Justice, spent time in three of the Duchy's Conservative constituencies on Friday, visiting a design company which manufactures bee habitat bricks for new built homes, the land-based agricultural Duchy College at Rosewarne in Camborne before heading out to Newlyn fish market to speak to fishermen about fishing rights and seas borders and the fisheries can be improved after Britain finally leaves the European Union in March 2019, Cornwall Live reports. \nFollowing a visit to Perrnaporth-based Green and Blue design company, a firm which has created an award-winning brick concept that can act as a home for bees and be incorporated into new houses, Mr Gove headed out to the Duchy College where he was met by Raoul Humphreys, CEO and Principal of Cornwall College, with local MP and Defra minister George Eustice in tow. Read More We can't turn a blind eye to Torquay's street drug users - Kevin Foster MP column \nThe Defra boss told Cornwall Live that his visit to Cornwall was his first in his new ministerial role but not his first altogether - with a beach on the Rame Peninsula, being a particularly memorable moment of his. \nHe said the three stops represented the extent of his new Defra remit, environment nd ensuring the care and survival of pollinating insects such as bees, agriculture and the next generation of farmers and fishing and what will happen to the industry after Brexit. \nWhen asked what the Government will do to protect the geographical status of Cornwall's food stuff such as pasties, sardines and clotted cream after Brexit, Mr Gove insisted both Britain and EU countries want to ensure their food products such as Parma ham, Champagne or pasties remain mutually protected in law after the Brexit divorce. Read More The eight rights working parents have that you might not know about \nHe said: \"We want to continue to have a system that works. In fact we want to give people the maximum amount of information about where their food comes from. Because consumers quite rightly, myself included, want to know about the provenance of the food we're eating.\" Britain's Environment, Food and Rural Affairs Secretary Michael Gove \nHis choice of pasty might not endear him to the good folks of Cornwall who are famous for their love-hate relationship with Britain's biggest producer, but when asked what his favourite pasty is, Mr Gove said: \"Traditional. Whether it is Ginsters or the Cornwall Pasty Company I am very very happy. I'm omnivore. But as far as I'm concerned if it's got mince, potatoes, vegetables and pastry then it's perfect for me.\" \nHe added: \"What we have learnt over the past few years is that politicians who get pasties wrong often have to pay the price.\" Read More How the changes to Charles Cross may affect the busy roundabout \nWhen the name of Boris Johnson was dropped into the conversation, Mr Gove chuckled, insisting: \"I won't be mentioning any names. No names.\" \nDuchy College is home to 300 full time students, from animal care to engineering, floristry to dog grooming. \nMr Gove received a guided tour of the facilities from Mr Humphreys, the very college where Camborne and Redruth Conservative MP George Eustice was an agricultural students so many years ago. \nMr Eustice said he understood the anxiety farmers might have about the future status of the migrant workers they rely on to pick fruits and vegetables in Cornwall, but insisted Britain did not want to completely 'pull up the draw bridge' on immigration. Read More Fencing installed around site of future Newton Abbot Aldi \nHe said: \"There is anxiety in the farming sector especially soft fruit and daffodils growers who rely a lot on migrant workers. We have been clear that we want to have a much greater control on immigration. But we will look at all options and ensure there are arrangements in place that suit the farming sector such as seasonal working visas similar to those that exist in Australia.\" \nMr Eustice said more than 50% of workers in the fruit picking sector were migrants in Cornwall and 60% nationally. \nMr Gove was also given a tour of the dog grooming training facilities at the college and the exotic animals care section. But while he suggested to Mr Eustice that they should give the book on tarantulas lying about on a desk to the Tory Chief Whip Gavin Williamson, he was not too keen on picking a tortoise or wrapping a snake around his shoulders. Read More Closure order granted for flat after evidence of underage drinking, drugs and anti-social behaviour \nWhen asked if the Chief Whip needed a tarantula book as a master of webs and intrigues, Mr Gove smiled and said: \"No. Not for that reason. He genuinely has a pet tarantula.\" \nCornwall Live asked Mr Gove if there was dissent in the Conservative party ranks and if the rumblings of the summer over a leadership contest to replace Theresa May were over, he coyly said: \"Theresa May is completely safe. She'll be leader for as long as she wants to be and I think she's doing a great job at the moment.\" Like us on Facebook", "external_links": [], "published": "2017-09-09T23:15:00.000+03:00", "crawled": "2017-09-09T23:35:10.006+03:00", "highlightTitle": ""}