{"organizations": [], "uuid": "8bbb25c55eaeeaf843a5574ee185680615e7db84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/news/devon-news/article449218.ece/ALTERNATES/s1200/Michael-Gove1.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/gove-pledges-big-shakeup-farm-449268", "country": "US", "title": "Gove pledges big shakeup of farm subsidies - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.207, "site_type": "news", "published": "2017-09-11T15:26:00.000+03:00", "replies_count": 0, "uuid": "8bbb25c55eaeeaf843a5574ee185680615e7db84"}, "author": "Keith Rossiter", "url": "http://www.devonlive.com/news/devon-news/gove-pledges-big-shakeup-farm-449268", "ord_in_thread": 0, "title": "Gove pledges big shakeup of farm subsidies - Devon Live", "locations": [], "entities": {"persons": [{"name": "derek thomas", "sentiment": "none"}, {"name": "keith rossiter", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "redruth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "george eustice", "sentiment": "none"}, {"name": "hayle", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "newlyn harbour", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "camborne", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gove pledges big shakeup of farm subsidies Environment Secretary vows to divert cash to the environment Share Michael Gove, the Environment Secretary, at Newlyn Harbour yesterday (Image: Keith Rossiter) Share \nThe “lion’s share” of farm subsidies after Brexit should go to support environmental work, Michael Gove, the Environment Secretary, said during a visit to Cornwall yesterday. \nMr Gove was speaking during a visit to Newlyn Harbour with local MPs George Eustice and Derek Thomas. \nHe said it was made clear to farmers during the referendum campaign last year that EU subsidies would go. \n“It was also made clear at the general election that the Conservatives were the only party guaranteeing support for farmers in cash terms at the level it was before the election. \nHe told the WMN yesterday: “The basis on which subsidies are allocated at the moment is wrong.” \n“We absolutely intend to honour our commitment that that £3 billion of money is spent ensuring that our farmers can continue to do the great job that they do. Read More Defra Secretary Michael Gove admits his love of a Ginsters pasty on South West visit \n“My view is that we should use some of that money to sustain and boost agricultural productivity. But the lion’s share of that money should go to farmers to help them to do the right thing environmentally.” \nMr Gove, who said previously that Brexit provided a “sea of opportunity” for British fishermen, was visiting Newlyn Harbour to learn about plans to modernise and expand facilities there. \nHe said: “There is a huge opportunity for us to better conserve our fish stock and also to see our coastal communities revive as we take back control. \n“One of the great opportunities Brexit provides is to allow us to show the world that we can have this wonderful renewable resource.” \nHe said he did not anticipate disputes over fishing rights as happened in the Cod Wars with Iceland before Britain joined the EU. Read More We need to make a 'Green Brexit' work - Neil Parish MP column \n“We will have control over who fishes in our waters. We will allow people into our waters, on our terms, in the same way as we fish in other countries’ waters.” \nThere have been cases of disputes over fishing grounds between British and French boats, but Mr Gove said: “I’ve never found the French to be aggressive.” \nAnd he said that French consumers would continue to want to buy British fish. \nMr Gove stood by his claim, during the referendum campaign, that Britain would take back control of £350 million a week which he insisted was the amount now controlled by Brussels. \nBut he denied that the intention had been to give all of that money to the NHS, as implied by the Leave campaign’s battle bus. \nAnd he said Britain would honour its obligations to the EU. The EU referendum Leave campaign bus in Cornwall in 2016 \nFigures of between £50 billion and £100 billion have been quoted as the bill for leaving the EU and meeting our long-term commitments, such as pensions. \nMr Gove claimed that Britain pays £20 billion a year to the EU, “and that translates to £350 million a week that the EU currently controls and that we will have taken back control of. \nBut he was adamant that not all of that money should go to the NHS. \n“What I’ve said is that a slice of it should go to the NHS.” \nMr Gove said earlier this year that Britain could go for a “soft” Brexit. But yesterday he was adamant that we would be outside the Customs Union and the Single Market, and side-stepped the distinction between hard and soft Brexit. \n“What I’m keen on is making sure we have an appropriate implementation or transition period in order to ensure that we leave the European Union in the best way. \n“I don’t really understand why people use the phrase hard or soft Brexit. The most important thing to do is to honour the referendum vote so that people know we’re outside the Single Market and outside the Customs Union. \n“Some people will call it hard, some people will call it soft, some people will call it clean.” \nAsked whether Westcountry farmers would find enough workers to pick their produce Mr Gove, who had earlier visited the MP George Eustice’s fruit farm, said: “There were plenty of Cornish people working there, well paid and enmjoying their work. \n“There are a number of industries, including agriculture, that benefit from having talent from abroad, but nobody is suggesting that when we leave the EU we pull up the drawbridge. \n“We will make sure that every industry has access to the labour it needs at the right time.” George Eustice, Michael Gove, Derek Thomas at Newlyn Harbour (Image: Keith Rossiter) \nGeorge Eustice, a Defra Minister and MP for Camborne, Hayle and Redruth, admitted that there would always be a need for some migrant labour in agriculture. \nBut he said there was more scope to train British workers to take full-time jobs in the sector. \n“I worked on a farm myself and have never had a lot of sympathy for people who consider themselves above hard work. \n“We have the lowest level of unemployment since the 1970s. It’s an incredibly tight labour market. \n“But there are lots of local people who could do this kind of work.” Like us on Facebook", "external_links": [], "published": "2017-09-11T15:26:00.000+03:00", "crawled": "2017-09-11T15:50:02.015+03:00", "highlightTitle": ""}