{"organizations": [], "uuid": "9372110a2419bf26aa640f8a53bc99b3a83ddd39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13561922.ece/ALTERNATES/s1200/GWR_-NJL_040917pub_02.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/pubs-property-varied-work-life-13561685", "country": "GB", "domain_rank": 21960, "title": "From pubs to property, the varied work life of Richard Buckley", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-03T13:30:00.000+03:00", "replies_count": 0, "uuid": "9372110a2419bf26aa640f8a53bc99b3a83ddd39"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/pubs-property-varied-work-life-13561685", "ord_in_thread": 0, "title": "From pubs to property, the varied work life of Richard Buckley", "locations": [], "entities": {"persons": [{"name": "richard buckley", "sentiment": "neutral"}, {"name": "buckley burnett", "sentiment": "neutral"}, {"name": "jason flanagan", "sentiment": "none"}, {"name": "anish kapoor", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "norman foster", "sentiment": "none"}, {"name": "andrew burnett", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "h. j. banks", "sentiment": "none"}, {"name": "chris dobson", "sentiment": "none"}, {"name": "john dobson", "sentiment": "none"}, {"name": "joel day", "sentiment": "none"}, {"name": "grace hunter", "sentiment": "none"}, {"name": "peacock", "sentiment": "none"}, {"name": "joannne", "sentiment": "none"}, {"name": "dava sobell", "sentiment": "none"}, {"name": "felix", "sentiment": "none"}, {"name": "zerolight", "sentiment": "none"}, {"name": "peter kay  what", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "joanne", "sentiment": "none"}, {"name": "robert gibson", "sentiment": "none"}, {"name": "flanagan lawrence", "sentiment": "none"}, {"name": "oscar", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "belmont", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "manor house", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "middlehaven", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "yarm", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "liveworks", "sentiment": "none"}, {"name": "longhirst hall", "sentiment": "none"}, {"name": "marley hill", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "wynyard", "sentiment": "none"}, {"name": "temenos", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "victoria harbour", "sentiment": "none"}, {"name": "longitude", "sentiment": "none"}, {"name": "central park", "sentiment": "none"}, {"name": "grey street", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "middlehaven dock", "sentiment": "none"}, {"name": "north shore", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}], "organizations": [{"name": "infinity bridge", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "banks group", "sentiment": "none"}, {"name": "warwickshire county council", "sentiment": "none"}, {"name": "bede homes", "sentiment": "none"}, {"name": "darlington college", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "teesside urban regeneration company tees valley regeneration", "sentiment": "none"}, {"name": "mac", "sentiment": "none"}, {"name": "tvr", "sentiment": "none"}, {"name": "mac trust", "sentiment": "none"}, {"name": "amg shootingbrake  what", "sentiment": "none"}, {"name": "mercedes cla", "sentiment": "none"}, {"name": "h.j. banks and company", "sentiment": "none"}, {"name": "pub culture", "sentiment": "none"}, {"name": "arts council england", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "heritage lottery fund", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "From pubs to property, the varied work life of Richard Buckley The MD of Buckley Burnett is playing a major role in Sunderland's cultural renaissance Share Property expert Richard Buckley (Image: Copyright unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nProperty expert Richard Buckley has moved into the world of pubs as he helps plot Sunderland’s cultural renaissance. He tells The Journal about his varied career. \nLand and property expert Richard Buckley doesn’t want to take over the world – but he does want to make it a better place. \nThe managing director of property development consultancy Buckley Burnett, Richard is driven by a desire to improve where we live or work. \n“My ambition isn’t to lead a massive conglomeration, but to create better places for people, to improve our environment,” he explains. \nAnd with some of his most recent – and ongoing – projects he’s been able to do just that. \nBuckley Burnett is a leading player in the continuing development of Sunderland ’s Music, Arts and Culture (MAC) quarter. Working on behalf of the MAC Trust, he and partner Andrew Burnett have already transformed the run-down Dun Cow pub into a thriving, award-winning hostelry and are now doing the same with The Peacock, a hundred yards away. \nThe transformation has gone so well that Richard, Andrew and two other partners formed a new company, Pub Culture, to run and manage both venues – they will be running the pub/restaurant in The Fire Station and have recently completed the lease of The Brandling in Jesmond, which will be reopening in August under the Dun Cow brand. The Brandling in Jesmond (Image: Robert Gibson) \nIn the meantime, Richard and Andrew continue to be instrumental in the £3m conversion of an old fire station into a vibrant music and arts hub that will be at the core of Sunderland’s MAC Quarter. \n“This is the sort of project that gives me a buzz – The Fire Station will be at the centre of Sunderland’s arts and culture sector, helping to transform the city centre and people’s lives. \n“We’ve been involved right from the very start, helping to create the vision and then being involved with land deals, contractor appointments and overseeing the building work,” said Richard, 48. \nBut his work within the MAC Quarter doesn’t finish there, as his company has project managed the successful bid to build a new £8.2m, 450-seater auditorium next to The Fire Station. Planning permission was granted in mid February and Arts Council England confirmed a £6m grant for the new building through the National Lottery at the same time. Property expert Richard Buckley (Image: Copyright unknown) \n“We helped deliver the restoration of the Dun Cow and the transformation of The Peacock, working on the projects from start to finish, and then we put the winning bids together to the Heritage Lottery Fund for The Fire Station and the Arts Council England for the auditorium,” explained Richard. \n“We helped get all the partners and stakeholders on board – from both the public and private sector – and now we’re working with award-winning architect Jason Flanagan on ensuring the auditorium becomes the building that the city deserves. \n“There’s no doubt that it will transform the Sunderland’s cultural offering.” \nConstruction work on the new auditorium will begin later this year, with the multi-use venue opening in 2019. \nBuckley Burnett has a track record on working in a successful partnership with architect Jason Flanagan of architects Flanagan Lawrence, having already delivered the multi-award winning LiveWorks building for Live Theatre on Newcastle Quayside together. The architect previously worked on The Sage, while with the hugely-respected architect Norman Foster. Zerolight's new offices at Liveworks, Newcastle (Image: Chris Dobson PR) \nAlthough he has huge affection and respect for the region he is helping to transform, Richard is not a native. \nOriginally from Loughborough, he arrived at Newcastle University in 1988 to study engineering. The university was right, but the course wasn’t and he switched after a year to a town planning degree. \n“I was hooked straight away on Newcastle – our student flat was really central so we were at the heart of a party city, which as a student, was ideal.” \nThe degree course was five years, with a year’s placement in the fourth year at Warwickshire County Council where he developed a minerals local plan. \n“It doesn’t sound too exciting, but it actually became a huge help later on in my career,” said Richard. \nHe returned to Newcastle for his fifth year and did some work for solicitors Ward Hadaway, who sponsored the year. \n“On leaving university, I then joined Ward Hadaway as a planner, working on public enquiries and land deals.” Read More Jesmond pub to be re-named after being taken over by growing bar company \nAfter three years there, Richard joined what was H.J. Banks and Company, which is now The Banks Group. \n“I thoroughly enjoyed my time there, learned a great deal and worked on a variety of interesting projects, both small and large scale across the region and beyond.” \nHe rose through the ranks and by the time he left nine years later, he was Regional Director of The Banks Group. \nFrom there, he accepted the role of director of development with the Teesside Urban Regeneration Company Tees Valley Regeneration (TVR). There he got his wish to work on large-scale public sector developments, leading delivery on projects such as Middlehaven in Middlesbrough, including Anish Kapoor’s Temenos in Middlehaven Dock; North Shore in Stockton-On-Tees, including the development of Infinity Bridge; Victoria Harbour in Hartlepool and Central Park in Darlington, which included the new Darlington College. \n“At the time, we were the largest urban regeneration company in England and we worked on some exciting, transformational developments that enhanced people’s lives. I was very proud of my team and the work we did – we created several regional icons that have made a lasting impression on the region,” said Richard. \nHowever, he could see the writing was on the wall for urban regeneration companies and he was thinking of what a future outside of TVR might look like. \nHe’d originally met Andrew when he’d applied for a job at H. J. Banks and then brought him into TVR on a fixed-term consultancy contract a few years later. \n“We got on well, and over a pint one night we discussed our options outside of TVR. So in 2011 we established Buckley Burnett, with the company based in Belmont.” \nThe company moved to Wynyard and then, two years ago, to its present base in Sedgefield’s historic Manor House. \nThe business – and partnership – works well: “We complement each other in that Andrew is extremely good at the detail, whereas I take a more strategic approach. We’re also very different characters, which I think helps – we feed off each other, but we also trust each other.” \nDevelopment surveyor Grace Hunter, who works across the Buckley Burnett portfolio and with Pub Culture, joined the pair in 2014. \n“With our collective backgrounds, we’ve got a wealth of experience and long backgrounds in multi-use land assembly, development management, planning strategy, land acquisition or disposal, development viability and surveying. Basically, we’re experts in property and land development in both public and private sectors – a full solution consultancy package,” explained Richard. \n“And we’ve seen good, steady progress as a company. Turnover for our first year was about £150,000 the last few years have been steady at about £500,000, but we expect turnover for 2017 to be at about the £1m mark – the development business isn’t about overnight success and some long-term projects that have been in development for some time have come to fruition this year.” \nAs well as Buckley Burnett and Pub Culture, Richard has a share in property development company BIM. It is with BIM and other partners that Richard is developing Longhirst Hall, near Morpeth, ‘the first great country house’ of one of his heroes – famed architect and Grey Street designer John Dobson. Other projects are in the pipeline. \nAnother company he and Andrew have an interest in is Bede Homes, which was granted its first planning consent at the beginning of this month – for a housing development and conversion of an old school house at Marley Hill, Gateshead. \n“We plan to develop three sites a year for the next three years and we’ll see where we go from there,” explained Richard. \nWith such a busy and successful business portfolio, Richard works hard to ensure the work/life balance is in favour of the latter and he spends as much time as he can with wife Joanne and three sons. \nThey live in Yarm where Richard indulges in his obsession with watches which started while sitting on his great grandfather’s only leg: “He’d lied about his age and then had a leg blown off during World War One. On his return to civilian life, he entered the family steel business and rose to a senior position. To celebrate a promotion, he bought a watch that curved round his wrist, and it was this watch that started my obsession – and collection.” \nTo relax, he enjoys sailing ands ski-ing, but no longer gets into the ring to take part in Thai boxing – he was once an instructor, using his martial arts skills to help run security while a student at Newcastle University. \n“Getting the work/life balance right is hugely important to me – work is of course very important, but it’s not everything,” he says. Questionnaire \nWhat car do you drive? \nMercedes CLA 45 AMG Shootingbrake \nWhat’s your favourite restaurant? \nThe Fire Station in Sunderland (currently designing it!) \nWho or what makes you laugh? \nPeter Kay \nWhat’s your favourite book? \nLongitude by Dava Sobell \nWhat’s your ideal job, other than the one you have? \nAntiques dealer \nWhat’s your greatest fear? \nAnything bad happening to my children \nWhat’s the best piece of business advice you have ever received? \nMake sure your team benefits from your success \nAnd the worst? \nDon’t sell your shares the day before Brexit. \nWhat newspapers do you read? \nI keep up to date through BBC online \nHow do you keep fit? \nCycling and walking \nWhat’s your most irritating habit? \nBeing on time. \nHow much was your first pay packet? \n£7.20 for packing shelves at a supermarket \nWhat’s your biggest extravagance? \nWatches \nWhat historical character or fictional character do you most identify with? \nJohn Dobson – I’m currently helping to redevelop one of his first country houses – Longhirst \nHow would you like to be remembered? \nHaving been part of the delivery team for developments that enhanced the region \nWhich four people would you most like to dine with? \nMy wife Joannne and children Felix, Oscar and Joel Day in the Life \n6.45am Wake up. Get cup of tea, release the dog, get licked by dog \n7am Wake kids, herd kids between breakfast and showers \n7.15am Exercise bike for half an hour \n8.15am Leave for work whilst dropping eldest off at school \n8.45am In office meeting throughout day, some land, some pub, some development often traveling to meetings throughout the NE normally Newcastle, Durham or Sunderland. Squeeze lunch in when I can (preferably in one of our pubs) \n5.30pm Head home \n6-8.30pm Various child activities taxi service either piano, karate, swimming, cycling, football- the list goes on! Putting kids to bed and reading with the youngest when in from activities. \n8-9pm Dinner and chat to wife Joanne about our days. Watch an episode of whichever series we are currently watching, \n10.30pm Bed and catch up on news online, check where I am the next day Like us on Facebook ", "external_links": [], "published": "2017-09-03T13:30:00.000+03:00", "crawled": "2017-09-03T14:05:32.018+03:00", "highlightTitle": ""}