{"organizations": [], "uuid": "356c6396e8afdbb6df6500a31641f6d460ad24e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/news/uk-world-news/article441213.ece/ALTERNATES/s1200/Gary-Streeter.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/uk-world-news/devon-mp-lead-way-brexit-441730", "country": "GB", "title": "Devon MP to lead the way on Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-07T17:59:00.000+03:00", "replies_count": 0, "uuid": "356c6396e8afdbb6df6500a31641f6d460ad24e6"}, "author": "Keith Rossiter", "url": "http://www.devonlive.com/news/uk-world-news/devon-mp-lead-way-brexit-441730", "ord_in_thread": 0, "title": "Devon MP to lead the way on Brexit", "locations": [], "entities": {"persons": [{"name": "gary streeter", "sentiment": "none"}, {"name": "brexit gary streeter", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "brexit devon", "sentiment": "none"}, {"name": "ken clarke", "sentiment": "none"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "stefan rousseau/pa wire", "sentiment": "none"}, {"name": "john allen", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "streeter", "sentiment": "none"}, {"name": "henry viii", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "south west devon", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "tory party", "sentiment": "none"}, {"name": "south west devon conservative", "sentiment": "none"}, {"name": "global justice", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon MP to lead the way on Brexit Gary Streeter will chair key debates Share Gary Streeter, MP for South West Devon (Image: John Allen) Share \nGary Streeter, the veteran South West Devon Conservative MP, has been asked by the Speaker of the Commons to help chair the EU Withdrawal Bill as it is debated by Parliament over the next few months. \nMPs in debated the Bill during the first of two days of debate in the Commons chamber yesterday. \nAfter the Second Reading vote on Monday, MPs will scrutinise the Bill line by line in the committee stage. \nThe Brexit Bill will take several months to be debated and will be discussed largely on the floor of the House of Commons, as it is of constitutional significance. \nMr Streeter is one of four MPs who have been selected to oversee this Bill, two Conservatives and two Labour. Protesters from Another Europe Is Possible and Global Justice outside Parliament (Image: Stefan Rousseau/PA Wire) \n“I am delighted to have been asked to chair the proceedings,” Mr Streeter, MP for South West Devon, said. “It will place me at the heart of historic legislation. “It is likely to be both fascinating and gruelling in equal measure. It will mean me being at Westminster more over the next few months than in recent years.” \nBy custom, MPs who chair bills cannot vote on any part of the Bill, or speak on it. \n“My urgent task is to read and understand the very technical Bill in great detail as well as learn the names of the new MPs elected in June,” said Mr Streeter as he began preparations for this marathon task. Read More How to protect wildlife after Brexit \nSenior Tory Ken Clarke has hinted he could vote against the Government’s repeal bill and force them “to go back to the drawing board”. \nThe Europhile former chancellor raised concerns about sweeping powers contained in the proposals to change legislation through so-called “Henry VIII powers”. \nDavid Davis, the Brexit Secretary, introduced the Bill yesterday. \nHe accused Labour of adopting a “cynical and unprincipled” position by seeking to block flagship the legislation. \nMr Davis told the Commons the government did not believe it made sense to retain the EU’s charter of fundamental rights in court. \nHe was left red-faced after his Labour counterpart, Sir Keir Starmer, produced documents showing the Brexit Secretary had relied on the EU’s charter of fundamental rights during a 2015 court case – in which Mr Davis challenged then Home Secretary Theresa May. Read More Anne Marie Morris' suspension from Tory Party remains 'indefinite' \nLeading Conservative Remainer Anna Soubry dismissed the prospect of a Tory rebellion at this stage, but left open the door for challenges later in its progress. \nTory Remainers have signalled they could rebel over the legislation in later stages and bristled at suggestions from party whips that doing so would amount to supporting Labour and Jeremy Corbyn, who have signalled they could vote against the EU (Withdrawal) Bill at second reading, its first Commons stage. Like us on Facebook ", "external_links": [], "published": "2017-09-07T17:59:00.000+03:00", "crawled": "2017-09-07T18:09:18.004+03:00", "highlightTitle": ""}