{"organizations": [], "uuid": "44f9883f0e9e79abaa6ed5b1f6171b26e303159f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13584568.ece/ALTERNATES/s1200/Hiroto-Saikawa.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/new-nissan-leaf-start-production-13584477", "country": "GB", "domain_rank": 21960, "title": "New Nissan Leaf to start production in Sunderland by end of this year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-07T12:29:00.000+03:00", "replies_count": 0, "uuid": "44f9883f0e9e79abaa6ed5b1f6171b26e303159f"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/new-nissan-leaf-start-production-13584477", "ord_in_thread": 0, "title": "New Nissan Leaf to start production in Sunderland by end of this year", "locations": [], "entities": {"persons": [{"name": "hiroto saikawa", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "fumiaki matsumoto", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "chiba", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "oppama", "sentiment": "none"}, {"name": "smyrna", "sentiment": "none"}], "organizations": [{"name": "oppama plant", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "nissan leaf", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New Nissan Leaf to start production in Sunderland by end of this year Announcement from automotive giant safeguards hundreds of jobs at the Sunderland plant Share Nissan President and CEO Hiroto Saikawa speaks in front of its new Leaf electric vehicle during the world premiere in Chiba, near Tokyo Wednesday, Sept. 6, 2017 (Image: AP) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNissan will start production of the new electric Leaf by the end of the year, the company has announced. \nComing on the same day that the plant’s workforce is to receive the Freedom of Sunderland, Nissan announced in Japan that full production of the new Leaf would start in Sunderland and a factory in the USA before the end of the calendar year. \nThe two production sites join Nissan’s Oppama Plant in Japan, which is producing the new generation of the world’s best-selling electric vehicle. \nThe announcement safeguards existing jobs at the site, which has been producing the current model of the Leaf for the last four years. \nThe new model has been launched in Japan, with the vehicle having greater range than its predecessors, plus new features such as a one-pedal driving system, auto-parking technology and an updated design. Read More \nThe car is the most popular electric vehicle in the world, with nearly 300,000 having been bought since it was launched in 2010. \nBut it is facing increased competition as other automotive manufacturers join the electric vehicle revolution. \nFumiaki Matsumoto, executive vice president of manufacturing and supply chain management at Nissan, said: “We’re proud to continue manufacturing the Nissan Leaf at three plants globally. Read More Japan Prime Minister insists Japanese investors have faith in the UK after Brexit \n“The Nissan Leaf is the icon of Nissan Intelligent Mobility with its many advanced technologies. Nissan employees in Oppama, Smyrna and Sunderland are excited to continue producing the most popular electric vehicle in the world.” \nProduction of the Leaf began at Sunderland in 2013, while a battery plant has been on the site since 2007. \nThe battery unit, which employs 300 people, was sold to a Chinese investment group earlier this summer but will still produce batteries for the Leaf. Like us on Facebook", "external_links": [], "published": "2017-09-07T12:29:00.000+03:00", "crawled": "2017-09-07T13:26:03.019+03:00", "highlightTitle": ""}