{"organizations": [], "uuid": "ebb691ab07d741fe5305d9cd88c6100ddd08a41d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/news/business/article469700.ece/ALTERNATES/s1200/collage.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/business/how-tackling-south-west-productivity-469256", "country": "GB", "title": "How we are tackling the South West productivity puzzle", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-14T02:00:00.000+03:00", "replies_count": 0, "uuid": "ebb691ab07d741fe5305d9cd88c6100ddd08a41d"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/how-tackling-south-west-productivity-469256", "ord_in_thread": 0, "title": "How we are tackling the South West productivity puzzle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsored How we are tackling the South West productivity puzzle How the Heart of the South West LEP is putting prosperity in the South West top of the agenda Share Rail, road and digital connectivity are top of the wish list for the South West Share Comments \nSteve Hindley CBE DL, Chairman of the Heart of the South West LEP, says that the right skills are vital to economic productivity. \nAt the end of the summer as momentum increases in the workplace and students go back, this month we’re focusing on skills and training with an overview of what the LEP is doing in this area to create the conditions for growth. \nMany young people leave the South West and don’t return until they’re much older, or not at all. And this is why we have an ageing population which is not ideal for long-term business growth. Steve Hindley, Chairman of the Heart of the south West LEP, pictured at Royal William Yard, Plymouth. (Image: Marc Hill) \nEmployment levels are at an all-time high, but we must look to providing higher value careers to encourage our young people to stay in the area. \nThere are many choices available to them if they stay in the South West for education, training or employment, but they may not be aware of what local employers are looking for by way of skills, or how lucrative the local job market can be. \nSo it’s part of our job to help employers and the education sector work together to bring out the best in our local young people and help them achieve rewarding careers. Read More Tech innovators say 'there's more to the South West than cream teas and cowpats' and here's why \nLEP Board Member and Principal of South Devon College, Stephen Criddle, explains more about what the LEP is doing on the skills agenda, and we’re holding a skills conference in January to consolidate our ideas and build stronger links between education and industry. \nWe look forward to the Budget from Treasury in the autumn, when we’re expecting more news from Government about the future of LEPs, as our role becomes increasingly integral to raising the productivity of the nation in a post-Brexit economy. We’re told that the Government is keen to see more partnership working between LEPs to create economies of scale and robust sector offers, so we’re gathering momentum on the Great South West campaign that enables partners to collaborate with local authorities and the private sector across LEP borders and develop propositions that tackle barriers to productivity. It aligns with the #BackTheSouthWest campaign that this newspaper is championing, and aims to maximise on the £100 billion worth of businesses opportunities in the region and compete with the Northern Powerhouse and Midlands Engine. Following last year’s inaugural event, there’s a Growth Summit being held on 20 October in Exeter. \nAnother event to flag up - in November we’re holding our third Annual Conference where stakeholders can find out about the achievements of the LEP. In the afternoon session, the Heart of the South West Growth Hub is running free workshops that can help businesses grow. There’s more about that in the Growth Hub article with registration details for attending. Read More The Tech List: 30 Exeter and South West firms at the cutting edge of technology and innovation \nThere may be announcements in the Budget on the Nuclear Sector Deal that we sent to government in partnership with Cumbria LEP, and our response to the Industrial Strategy on the region’s aerospace sector. \nOther cross-LEP work we’ve been working on is the Rural Productivity Commission which explores the opportunities around the rural economy in HotSW, Dorset and Cornwall and the Isles of Scilly, and a new Energy Strategy, also covering these areas, which aims to create a low-carbon, low cost energy economy to benefit businesses and residents. \nOne of the major campaigns that we share with other south west LEPs and the private sector, is the need for better connectivity for road rail and broadband to reverse decades of under-investment. So we were delighted this week with Highways England’s announcement on an agreed route to dual the A303 at the section near Stonehenge. We believe this route will unlock growth at the same time as preserving the distinctive assets of the area, which is an important consideration for the Great South West campaign. Read More What are the top 150 businesses in Devon and Cornwall? \nBusinesses tell us that journey times are a real barrier to growth, and years of under investment in our transport needs to be reversed, so this is a major step in the right direction for the region and is planned for completion in 2021 which is the end date of our current investment programme. You can read more about the South West LEPs proposals to Government for better road, rail and broadband, search for the “Greater Connected” document on our website Rail, road and digital connectivity are top of the wish list for the South West \nHeart of the South West Scale-up Survey: What would help your business grow? Results of the survey will help shape the services businesses need to grow in the future \nIf you are a business or enterprise in Devon, Plymouth, Somerset or Torbay, we would like to know what could be done to better help your business grow. Please help us to understand the issues that are important to you by completing this short, online survey – which takes 5 to 10 minutes to complete. \nThe survey is being run by the Growth Hub in partnership with the LEP. We are particularly interested in feedback from businesses and enterprises who expect to grow significantly over the next couple of years or have recently done so. The closing date for responses is 29 September 2017. For any questions about the survey please contact \nStephen Criddle – LEP Board Member and Principal of South Devon College, talks about what the LEP is doing to raise skills and create higher value jobs. Stephen Criddle, principal South Devon College and board member HotSW LEP \nThe LEP’s partnership, which includes the ten FE colleges and the four universities in the HotSW area, plays an important role in raising skills to improve prosperity. \nAs well as being Principal of South Devon College, I am pleased to be a LEP board member and Chair of the “People” Group, which focuses on skills and employment. Our aim is to attract funding, encourage and support projects that will help create jobs and increase local skills. But not just more jobs; we want higher value, better paid jobs that give rewarding career opportunities for the people who live here. \nMany young people leave the HotSW area as soon as they finish their education, rather than building careers locally, and we believe that a key factor is that they’re not aware of what great careers are on offer or what skills and talent local employers need. So we analyse local businesses’ skills gaps to help inform the education sector to offer the right level of quality training to young people and adults, supported by expert information, advice and guidance. Some key skills gaps and opportunities that have been identified are for the digital sector and the construction sector; both of which offer excellent and wide career opportunities. Read More 'World class' new Deaf Academy plans submitted \nIt’s a win-win situation for businesses too; many companies tell that they need a greater pool of highly skilled people in the local area to give a secure pipeline of employees into the future as their own staff move on or retire. By improving local skills, we’re giving companies the confidence to invest in this area rather than relocating to other parts of the country where the population is proportionally younger. Skills are a key factor for potential new investors too – they will only invest here if they can rely on there being enough local employees with the right skills to join their workforce. \nThe majority of FE colleges in the area have benefited from investment from Growth Deal capital funding and the Hinkley Point Training Agency schemes. The development at Hinkley Point C will generate a higher demand for nuclear related engineering, construction and other skills, so we’ve contributed investment for the South West hub of the National College for Nuclear, which offers higher level vocational qualifications. We’ve also invested Growth Deal money into a new STEM centre at Plymouth City College, and there’s a project in the pipeline for a new Hi-Tech & Digital Skills facility at South Devon College. Read More 75 plots of Devon land earmarked for housing development \nAnother example of how we are addressing skills gaps is through the Enterprise Advisor Service – which brings together schools, colleges and businesses to help in a variety of ways including helping students make really informed choices about their education routes and qualifications including apprenticeship opportunities. \nTo consolidate all of our work on skills and training, we’re also holding a Skills Conference in January that will bring together employers and training providers; there’ll be more details on this in the coming months. In the meantime, here are some details about the current skills projects that the LEP is leading on: \nApprenticeships \nWe’re raising awareness amongst employers of the significant opportunities for businesses in taking on apprentices, and keeping them up to date about the recent and ongoing reforms in this area. We’ve had funding from the Education and Skills Funding Agency to target businesses through a media campaign and participation at the Federation of Small Businesses Annual Conference in Torbay in the spring. Our work has been selected for a good practice case study in an apprenticeship guide to be published by National Apprentice Service \nWe’re also running a Skills Support for the Workforce project with the HotSW Growth Hub, providing advisors to help employers take on apprentices and understand their roles and responsibilities, as well as helping them get the most out of the apprenticeship schemes. \nHinkley Point Training Agency There are lots of opportunities available if you have the right skills \nThe Hinkley Point Training Agency (HPTA) is a partnership of LEPs, Local Authorities, FE Colleges and independent training providers; bringing an innovative approach to recruiting local labour for the 25,000 new jobs generated by Hinkley Point C. HPTA aims to create 1,000+ apprenticeships; ensure that 34% of those working on-site are within a 90 minute travel zone; and leave a legacy of highly skilled sustainable workforce for the future. \nHi Tech and Digital Skills \nIn the UK there is a Digital skills crisis; 11.5 million people lack basic digital skills and it’s estimated that 745,000 additional workers with digital skills are needed. Within the next 20 years, 90 per cent of all jobs will requires some element of digital skills, and an estimated £63 billion a year in GDP could be lost if these skills are lacking. Higher Digital Skills are also a growing area of demand. \nThe business community echoed need for digital and mobile infrastructure, identifying them as the first and third most important factors likely to constrain growth. Digital is an underlying theme of the Productivity Plan, and by boosting STEM technology and training projects in colleges, we’re benefitting the majority of young and older people who study locally at Further and Higher Education colleges as well as aiding progression to Higher Education and universities. Enterprise Adviser Network is a programme designed to encourage businesses and schools to work together to support young people in making informed choices about their future careers. \nEnterprise Adviser Network \nA programme designed to encourage businesses and schools to work together to support young people in making informed choices about their future careers. It connects senior business volunteers with schools and colleges. The project is part of the government-backed Careers & Enterprise Company, which was launched to ‘join the dots’ in careers and enterprise provision across England. We started off with 36 schools taking part, then secured extra funding for a further 27, meaning that 60% of schools in the area have a business mentor. Here’s just one example of how it’s helping pupils, business and education work together: \nEnterprise Adviser Network Case Study: Chris Jones, Invirt Reality and King Arthur’s School, Wincanton. \nInvirt Reality, based in Yeovil, is a software technology company specialising in interactive Virtual Reality (VR) training systems. \nCompany Director Chris Jones talks about his experience of working as an Enterprise Adviser at King Arthur’s School in Wincanton – a school where he was a pupil forty years ago. \n“At Invirt Reality our background is in the Aerospace Industry, developing software for helicopter simulators and training systems. Since 2012, we have concentrated on developing VR solutions for training in highly regulated sectors including aerospace, rail and nuclear. At Invirt Reality, I am responsible for project management, business development and operations. \n“One of the main reasons I wanted to get involved in the Enterprise Adviser Network is because I wanted to ‘give back something back’ to a local school. It happened that King Arthur’s were seeking an Enterprise Adviser and so I jumped at the chance to link to my old school. \n“I also wanted to get involved because I believe that education is paramount to making society a better place. I would like to make a small difference in terms of providing experience and advice from an employer’s perspective. At Invirt Reality we have taken on work placement students from local schools, and we intend to continue with this in the future. \n“I would definitely encourage other employers to participate in similar programmes, as I believe it can be hugely rewarding. \n“My advice to all students would be to start planning your future career as soon as you can, to be enthusiastic, keen to learn, and to listen to good advice! Qualifications are important, so think carefully about further education and apprenticeship options.” The growth hub is a major initiative to support businesses in Devon, Plymouth, Torbay and Somerset Businesses invited to the annual HotSW LEP Conference Businesses are invited to the annual HotSW LEP Conference \nBusinesses in Devon, Plymouth, Somerset and Torbay are invited to attend the annual conference of the Heart of the South West Local Enterprise Partnership (HotSW LEP) on Friday 10 November in Somerset. \n‘Productivity’ is the theme of the conference that will focus on business support, how to align your business with the upcoming General Data Protection Regulation and provide vital information on hot business topics such as; finance, exporting, upskilling your workforce, marketing and collaborative working. \nThe morning session of the conference is for stakeholders to engage with the LEP and hear updates on the partnership’s strategic ambition for making HotSW the choice destination to live, work, learn, visit and invest. \nThe afternoon session of the conference is being coordinated by the HotSW Growth Hub, the LEP’s main mechanism for engaging with businesses throughout Devon, Plymouth, Somerset and Torbay. The afternoon will include an opportunity for business owner’s to hear directly from support schemes about the funded and part-funded support that is available to them. \nBusinesses are invited to attend free workshops and 1-2-1 surgery sessions in the afternoon, with specific workshops tailored to either start-ups and micro businesses, or higher growth organisations. \nGuest speakers and key contacts from business support programmes will be on hand throughout the day. More than 300 people are expected to attend the event, which will run from 09:30 – 16:00. \nAnyone who would like to attend either the morning session, afternoon session or the whole day should register their interest via the Growth Hub: info@heartofswgrowthhub.co.uk with more details and a booking form available soon. The event will look at how we can work smarter not harder in the South West \nProductivity through People Preview Event – University of Bath 27 September \nProductivity through People is a unique collaboration of world class organisations with the University of Bath School of Management who have co-designed this innovative programme to support and invest in the business leaders of the future. The programme will give them access to the latest techniques, thinking and research; a framework to improve upon the competitiveness and efficiency of their business through developing leadership and management capability to transform working practices; and will help them increase productivity through the empowerment of their workforce. It’s a twelve month programme for key decision-makers in Small and Medium-sized Enterprises in the South West starting January 2018, \nThe University of Bath is holding a preview event with presentations and drinks reception on Wednesday 27th September 2017, 5pm – 7pm . \nYou will meet the sponsors and project team who will explain how this programme could benefit you and your organisation and hear from participants on the current programme, followed by a drinks reception and opportunity to network. To register your interest email: Like us on Facebook", "external_links": [], "published": "2017-09-14T02:00:00.000+03:00", "crawled": "2017-09-14T02:48:08.003+03:00", "highlightTitle": ""}