{"organizations": [], "uuid": "0260eaf63f88ce3731963401e6e4296c0c7f997d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/incoming/article467784.ece/ALTERNATES/s1200/Devon-Flag.png", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/freedom-devon-delegation-goes-london-467776", "country": "GB", "title": "Freedom for Devon! Delegation goes to London to demand devolution", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-13T09:20:00.000+03:00", "replies_count": 0, "uuid": "0260eaf63f88ce3731963401e6e4296c0c7f997d"}, "author": "Neil Shaw", "url": "http://www.devonlive.com/news/devon-news/freedom-devon-delegation-goes-london-467776", "ord_in_thread": 0, "title": "Freedom for Devon! Delegation goes to London to demand devolution", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "hart", "sentiment": "none"}, {"name": "john hart", "sentiment": "none"}, {"name": "jake berry", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "torridge", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "birmingham share click", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "cancel play now comments  devon county council", "sentiment": "none"}, {"name": "local enterprise partnership", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Freedom for Devon! Delegation goes to London to demand devolution Devon and Somerset currently have an annual economy worth over £34 billion – more than Britain’s second city, Birmingham Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nDevon County Council leader John Hart is in London today to press the case for devolution for Devon and Somerset with Ministers. The two counties currently have an annual economy worth over £34 billion – more than Britain’s second city, Birmingham. Mr Hart is being joined by other council leaders at the meeting with Jake Berry, the Minister responsible for devolution and coastal communities. An agreement has been reached by the two county councils, the two unitaries, all the district councils, the Local Enterprise Partnership, the two national parks and NHS representatives - with a plan for devolution submitted to the Government. Mr Hart said he recognised that the Government was currently focusing attention on the Brexit negotiations but he wanted to get devolution back firmly on the agenda. Read More Devon couple mocked mercilessly for ... \n“I do not want our very strong bid for greater autonomy to get bogged down in Brexit,” he said. “In fact, one of the key planks of our devolution plan is how we can improve training and skills in the region and boost productivity. “That actually complements Brexit because it will help greatly strengthen the economy of our region and help boost trade. “At the moment training and skills comes from a fragmented budget delivered by a whole host of organisations. “We’ll be telling the Minister: ‘Give us the power and we will create a better skilled workforce to enhance our whole economy’. \n“We can upskill our people, increase inward investment and provide the skilled workforce that employers need to prosper.” One of the ways this would be achieved is by streamling the way young people are provided with careers advice and education information and guidance in schools and colleges. Mr Hart continued: “We have 17 local authorities working closely together on this plan with our other partners. “We have worked together as a team in producing the productivity plan and we have the united will to get on and succeed. “We’re not holding out a begging bowl. The £30 million a year for 30 years that we could receive is a useful sum of money but ultimately we want the powers to get on and do what needs to be done so that the people of our region can get better jobs and have a better life in a thriving economy.” Alongside the skills agenda, the partnership is also focused on improving road and rail links to the South West and creating more housing that is available to local people. The South West currently receives only about 90 per cent of the public spending that goes into other regions and some areas, such as Torridge, Torbay and Newton Abbot, have some of the lowest earnings in the country. Like us on Facebook ", "external_links": [], "published": "2017-09-13T09:20:00.000+03:00", "crawled": "2017-09-13T09:28:09.001+03:00", "highlightTitle": ""}