{"organizations": [], "uuid": "02d53785907d53a148aeddb51cd24fff6ba908a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11600825.ece/ALTERNATES/s1200/JS63987151-1.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13610009", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Quantum Pharma agrees £150m takeover deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-13T10:30:00.000+03:00", "replies_count": 0, "uuid": "02d53785907d53a148aeddb51cd24fff6ba908a6"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13610009", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Quantum Pharma agrees £150m takeover deal", "locations": [], "entities": {"persons": [{"name": "wakefield", "sentiment": "none"}, {"name": "kevin dowd", "sentiment": "none"}, {"name": "peter atkinson", "sentiment": "none"}, {"name": "jonathon manning bank", "sentiment": "none"}, {"name": "john vickers", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "parker", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "matt pullen", "sentiment": "none"}, {"name": "austen", "sentiment": "none"}, {"name": "gareth farrier", "sentiment": "none"}, {"name": "mervyn king", "sentiment": "none"}, {"name": "shirley spoors", "sentiment": "none"}, {"name": "akzonobel", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "jane austen", "sentiment": "none"}, {"name": "gadhia", "sentiment": "none"}, {"name": "michael borello", "sentiment": "none"}, {"name": "dowd", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "jayne-anne gadhia", "sentiment": "none"}, {"name": "strutt", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}], "locations": [{"name": "neptune", "sentiment": "none"}, {"name": "felling", "sentiment": "none"}, {"name": "northern rock", "sentiment": "none"}, {"name": "aviva", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}], "organizations": [{"name": "jonathon manning five", "sentiment": "negative"}, {"name": "quantum pharma", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "adam smith institute", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "lawrenson & grebby photography llp", "sentiment": "none"}, {"name": "blyth offshore demonstrator wind farm", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "winchester cathedral", "sentiment": "none"}, {"name": "cushman & wakefield", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "aviva investors", "sentiment": "none"}, {"name": "royal bam group", "sentiment": "none"}, {"name": "asi", "sentiment": "none"}, {"name": "hm treasury", "sentiment": "none"}, {"name": "sandgate house", "sentiment": "none"}, {"name": "financial stability board", "sentiment": "none"}, {"name": "akzo nobel", "sentiment": "none"}, {"name": "blyth offshore demonstrator project", "sentiment": "none"}, {"name": "keel row house", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "imf", "sentiment": "none"}, {"name": "edf energy renewables", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "akzonobel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning North East businesses look overseas for staff despite skills shortage \nAlmost half of North East businesses have faced skills or labour shortages over the last year, but very few are looking overseas to fill vacancies. according to the North East England Chamber of Commerce. \nThe annual workforce survey, based on the responses of over 1,400 business people across the UK, found that 45% of firms in the North East had faced skills or labour shortages over the last 12 months. \nOf these, most sought to address the shortages by increasing investment in recruitment (39%), training (32%), and pay and benefits (24%). The survey found that only 8% of businesses target recruitment of non-UK nationals overseas. \nThe survey also found that three in 10 (30%) businesses in the North East have employees from other EU countries on their workforce, while 25% have employees from outside the EU. 22% of North East firms say future restrictions on the rights of EU nationals to work in the UK would have a negative impact on their business. \nSusan Laing, Dean of Teesside University Business School, said: \nTeesside University has an established international reputation for academic excellence and the global impact of our research. We foster creativity, enterprise and innovation and have helped to shape the lives of students from over 100 countries worldwide. We welcome this report into the impact non-UK nationals can make to businesses in our region. \nThe University is a catalyst for business growth, strategic partnerships and regional and national prosperity and we want to work with more global businesses to bring skills and opportunities to the region. \nWe have recently launched our Centre for Professional and Executive Development (CPED) to help meet the region’s demand for thousands of skilled jobs and are working with employers across multiple sectors to design and deliver training which meets their demands and the skills needs of their workforce. \nDespite only 8% of firms actively targeting overseas markets for talent, 42% of businesses still receive job applications from EU nationals. Similarly 21% receive applications from non-EU nationals. \nOther key findings of the survey are: \nMembers of The Chamber said that their non-UK workers tend to be highly skilled, with 46% having manual or technical skills, 36% being skilled in managerial or professional roles. while 25% have administrative training. \nPaul Carbert, policy adviser, North East England Chamber of Commerce, said: \nMembers report that skills shortages are prevalent across all sectors, particularly at higher and technical levels, and almost half of North East businesses say they struggled to fill vacancies in the last year. \nOur members look to fill posts locally, and many many invest in training and apprenticeships, or build links with educational institutions to recruit the staff they need. However, skills shortages remain, as competition for highly skilled staff grows within the UK and across the world. \nHe added: \nAs the Government plans for a post-Brexit immigration policy, our members want to see a flexible and unbureaucratic system that allows businesses to access the best global talent. We will ensure that our members’ views are represented in the review currently being undertaken by the Migration Advisory Committee. Paul Carbert, policy advisor, North East England Chamber of Commerce (Image: handout) 9:17 Jonathon Manning Galliford Try confident in spite of profits hit \nHousebuilder and construction group Galliford Try has put faith in a strategy to boost earnings despite reporting a 57% slump in annual profits and cautioning over wider political and economic worries.The group posted pre-tax profits of £58.7m for the year to June 30, down from £135m a year earlier after it took a £98m hit following a financial review of two major joint infrastructure projects.The blow, which sent shares tumbling when it was first revealed in May, came after a re-appraisal of the two projects - introduced as fixed-price contracts in 2011 and 2014 - showed it was on the hook for around £78m more than previously thought.Galliford also said profits were knocked by £19m for the cost of sales in construction and £1m in professional fees for its £1.2bn aborted bid for troubled rival Bovis Homes earlier this year.But Galliford delivered on the upper end of its annual profits guidance thanks to revenues accelerating at property developer Linden Homes.It is also eyeing a 60% boost to pre-tax profits by 2021.Peter Truscott, chief executive of Galliford, said: \nWe remain cautious about the impact of the current political uncertainty and the medium-term outlook for the macro economy. \nHowever, all three businesses have clearly defined plans as part of our 2021 strategy, providing the group with confidence in its ability to deliver a strong performance, even in a period of lower growth in the wider economy. \nIts full-year results showed revenues rose by 7% across the group, with turnover up by 11% at Linden Homes.Liberum analyst Charlie Campbell said the full-year profits result was 9% better than he expected.He added: \nThe market should take comfort in the fact that there has been no deterioration in expected costs of completing legacy contracts. Galliford Try Jonathon Manning Five 15,000 tonne wind turbine foundations successfully installed off the Northumberland coast \nFive major wind turbine foundations, each weighing 15,000 tonnes, have been successfully installed at an offshore wind farm off the coast of Blyth. \nThe five gravity based foundations (GBFs) have now been installed at the Blyth Offshore Demonstrator Wind Farm, using a new “float and submerge” process – the first time the technique has been used for offshore wind turbines. \nThe GBFs were designed and built by Royal BAM Group in the Neptune dry dock on the Tyne. \nEDF Energy Renewables is currently delivering the Blyth Offshore Demonstrator Wind Farm, after taking over the scheme from ORE Catapult in October 2014. \nThe turbines are based 6.5km off the coast of Blyth and will generate a total of 41.5MW of electricity, which is enough to power around 34,000 homes. \nEach foundation was floated into position off the coast of Northumberland and submerged onto the seabed, and further ballasted to provide the structures that act as the foundations for the turbines. \nBAM Nuttall regional director Gareth Farrier said: \nThis is a significant milestone in both the construction of the Blyth project and in the development of the BAM gravity base foundation. \nWork is now underway to lay around 11km of cables offshore to connect the individual turbines and bring the electricity onshore. \nA further 1.5km of cable will then be used onshore to link the turbines to a new substation built at the site of the former Blyth power station. The five Gravity Based Foundations for the Blyth Offshore Demonstrator Project are in place and the next phase is underway (Image: EDF Energy Renewables) 9:07 KEY EVENT Virgin Money boss marks Northern Rock anniversary with personal loans warning \nThe boss of Virgin Money has warned that cheap personal loans could pose a threat to the financial system as the banking sector marks 10 years since the collapse of Northern Rock.Jayne-Anne Gadhia said personal unsecured loans were priced too low for a good economy “let alone one that might have an uncertain outlook” and called for regulators to keep a watchful eye on the car finance market.Her comments come alongside the 10-year anniversary of Northern Rock’s collapse, which saw the lender become a symbol of the financial crisis in the UK and crash into Government ownership.The chief executive - who oversaw Virgin Money’s takeover of Northern Rock’s “good” operations in 2010 - said: \nI would say that in the UK the car finance market is the area that should be watched. \nThe chief executive of Lloyds was quoted at the half-year results saying the Bank of England is concerned about credit growth, but we don’t see that on banks’ balance sheets. \nThat is because there is so much growth on car manufacturers’ balance sheets and I think that is quite a difficult conundrum for the regulators. \nThe other area that I find concerning, and Virgin Money are not in this, is personal unsecured loans that people might take out for a new kitchen or conservatory. \nThe pricing on those loans is very low at the moment. I saw a pricing chart only last week and they are being priced at about 3%. \nI would say that probably there is an issue there that the price of unsecured loans is not pricing in the real risk of how they might perform in a good economy, let alone in one that might have an uncertain outlook. Virgin Money Chief Executive Jayne-Anne Gadhia (Image: PA) 9:02 Jonathon Manning Major employer AkzoNobel secures 150 jobs after opening world's most advanced paint factory \nManufacturing giant AkzoNobel has opened the world’s most advanced paint factory in Ashington, securing 150 jobs. \nThe Northumberland plant cost more than £100m to build and contains state-of-the-art robots on their production lines which will be used predominantly to make Dulux paint. \nTo honour the North East’s industrial heritage, each of the robots is named after one of the region’s collieries, and many of the staff are ex-mine workers. \nMatt Pullen, AkzoNobel managing director for the UK and Ireland, said: \nWe have had a long history of association in the North East. We have a marine and protective coating site in Felling, which employs around 650 people, so we have a long history here. \nWe needed a big site and a big space - one that is about 14 football pitches in size - and Ashington was perfect from that point of view. We also wanted to create a legacy and a community and Ashington was one of those places that needed employment for the future. \nThe new facility is capable of doubling the company’s UK production levels to 200 million litres of paint of year, the equivalent of 80 million 2.5 litre cans, which is enough to redecorate every living room, bathroom, and kitchen in the UK. \nIt has also been designed to be the most sustainable plant of its kind in the world. Along with reusing 100% of its waste water, AkzoNobel estimates that the new plant’s carbon footprint will be 50% less than the facilities it is replacing. \nWhile the investment at the plant has already secured 150 jobs in the region , officials at AkzoNobel suggested that more jobs could be created in the future. \nShirley Spoors, whose role as production manager involves overseeing a team of 75 staff, said: \nAt the moment we employ 150 people in Ashington and in the future the plant is designed to grow. It is the most sustainable plant in the world. \nThe plan is that Ashington will grow and there is space for an additional two more filling lines. The new AkzoNobel manufacturing plant in Ashington, Northumberland (Image: Akzo Nobel) 8:57 Jonathon Manning Prominent Newcastle Quayside office Keel Row House sold in £8.85m deal \nA Newcastle Quayside office has been snapped up in an £8.8m deal which has also set a new record yield for the city. \nProperty firm Cushman & Wakefield has sold Keel Row House, the four-storey building let to law firm Ward Hadaway, on behalf of Aviva Investors. \nThe purchase price of £8.855m reflected 5.57% net initial yield, the lowest non annuity office yield achieved in the last 10 years. \nThe 23,794sq ft property is let to Ward Hadaway for a further 13.5 years with five yearly Retail Price Index linked rent reviews. \nThe deal has set a new benchmark yield for the city with the next lowest yield being 5.88% achieved on the adjacent Sandgate House, also let to Ward Hadaway, which sold for £10.75m last December. \nPeter Atkinson, partner in Cushman & Wakefield’s Newcastle based investment team, said: \nThis deal represents a great result for our clients who were selling following completion of their asset management programme which added significant value to the asset. \nThe sale received a depth of interest and the price attained demonstrates the strong investor demand for the region. \nCushman & Wakefield represented the vendors Aviva Investors whilst Strutt & Parker represented the purchaser. \nMichael Borello, assistant fund manager at Aviva, said: \nI am very pleased the market recognised the successful implementation of our asset management strategy for Keel Row House, with the level of interest reflecting the quality of the asset and the strong positive attributes of this regional market. \nCushman & Wakefield provided excellent advice throughout the sale, which is reflected through the strong sale price achieved. Keel Row House, Newcastle Quayside (Image: Lawrenson & Grebby Photography LLP) 8:52 Jonathon Manning Bank of England governor claims financial system is now much safer \nAs the 10th anniversary of the collapse of Northern Rock approaches this week, Mark Carney insisted that measures have been put in place to avoid the crisis ever happening again.He said the financial system was now “safer, simpler and fairer”.He told the Sun: \nWhen the global banking crisis hit, it spread panic through a banking system built on weak foundations and it left everyone in Britain an average of £20,000 worse off. \nHe added: \nBy fixing the faults that caused the crisis, the financial system is... safer because it has 10 times more capital - money put up by investors - to withstand losses. \nIt’s simpler because the complex web that caused panic to spread in 2007 has been untangled. \nAccording to the governor on average the 2007 banking crisis left people in Britain £20,000 worse off. \nHe added that investors - not taxpayers - would now foot the bill if a bank fails, making it fairer for all. \nBut Sir John Vickers, the economist who led a major review of the UK’s banking industry after the financial crash, has warned that more needs to be done to protect the economy from another meltdown.Sir John said the system was only around “halfway” to where it should be in terms of the capital buffers banks are required to have to protect against a financial shock.He said there had been some “good building” but there was an opportunity to go further and he was “very disappointed” that the Bank of England under Mark Carney appeared to consider that enough had been done.He told BBC’s Newsnight: \nI’m really very disappointed that the Bank of England does take the view that it now takes - very different from the one Mervyn King took when he was governor - (and) think that we have built enough in terms of capital buffers. \nI would say we are roughly, global level, halfway of where we ought to be. \nI believe we would be in huge trouble if a very large, very complicated banking institution got into trouble. \nSir John, a former Bank of England chief economist, added: \nI think we’ve done some good building but there’s an opportunity there to go a lot further, which should be taken. But the current policy stance is, no we don’t need to. \nA decade on from the collapse of Northern Rock, Sir John said there were now tools available to regulators which “shift the odds in a slightly more favourable place”. \nBut I certainly wouldn’t bet on those working perfectly. The Governor of the Bank of England, Mark Carney, during the unveiling at Winchester Cathedral, of the new £10 note featuring Jane Austen, which marks the 200th anniversary of Austen's death (Image: PA) 8:47 KEY EVENT Britain's banking industry branded 'accident waiting to happen' \nBritain’s finance sector is an “accident waiting to happen”, according to a report branding the Bank of England’s stress tests as “worse than useless”.A study by the Adam Smith Institute (ASI) said the Bank’s tests - designed to measure whether a bank could withstand a severe financial shock - give false comfort by overstating the resilience of the finance sector.It said major UK banks remain too highly leveraged and would all fail a stress test if it was based on market value of bank capital rather than book value.It comes as the banking industry marks 10 years since the collapse of Northern Rock, which acted as a precursor to the global financial crisis.Professor Kevin Dowd, senior fellow of the ASI and author of the report, said: \nThe stress tests are about as useful as a cancer test that cannot detect cancer. \nThey seek to demonstrate a financial resilience on the part of the UK banks that simply isn’t there. \nIt is disturbing that 10 years on from Northern Rock, the best measure of leverage - those based on market values - indicate that UK banks are even more leveraged than they were then. \nThe biggest risk facing the UK banking system now is the Bank of England’s own complacency. \nThe report said high bank leverage had helped fan the flames of the financial crisis, while market valuations of UK lenders indicate that some have hidden losses.Asked whether efforts to root out bad behaviour within the financial system have worked, Prof Dowd said: \nThe reform of corporate governance has been pretty menial. \nThe problem is that senior bankers don’t have enough incentive to avoid excessive risks. \nThere has to be strict liability of bank directors so they have serious skin in the game. \nThe reason there has been so few prosecutions (over the financial crisis) is because it is hard to prove negligence. \nAn HM Treasury spokesman said: \nSince the financial crisis, we have fundamentally reformed the system of financial regulation to make it more resilient. \nLeading international bodies, including the IMF and Financial Stability Board, have commended the UK’s post-crisis work and we are at the forefront of international reforms. Bank of England (Image: PA) 8:42", "external_links": [], "published": "2017-09-13T10:30:00.000+03:00", "crawled": "2017-09-13T11:14:15.017+03:00", "highlightTitle": ""}