{"organizations": [], "uuid": "493e29c766bf06f9f051b9158251a1bd48c912b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13581835.ece/ALTERNATES/s1200/Theresa-May-Holds-First-PMQs-Since-The-Summer-Recess.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-could-replace-theresa-conservative-13593537", "country": "GB", "domain_rank": 21960, "title": "Who could replace Theresa May as Conservative leader? Some of the names might surprise you", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-10T10:00:00.000+03:00", "replies_count": 0, "uuid": "493e29c766bf06f9f051b9158251a1bd48c912b6"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-could-replace-theresa-conservative-13593537", "ord_in_thread": 0, "title": "Who could replace Theresa May as Conservative leader? Some of the names might surprise you", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "atte", "sentiment": "neutral"}, {"name": "boris johnson boris johnson", "sentiment": "none"}, {"name": "jacob rees-mogg jacob rees-mogg", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "james cleverly james cleverly", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "esher", "sentiment": "none"}, {"name": "dominic raab dominic raab", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "hastings", "sentiment": "none"}, {"name": "walton", "sentiment": "none"}, {"name": "tugendhat", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "tom tugendhat", "sentiment": "none"}, {"name": "james cleverly", "sentiment": "none"}, {"name": "david davis brexit", "sentiment": "none"}, {"name": "rory stewart", "sentiment": "none"}, {"name": "dominic raab", "sentiment": "none"}, {"name": "jacob rees-mogg", "sentiment": "none"}, {"name": "rory stewart rory stewart", "sentiment": "none"}, {"name": "rees-mogg", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "tonbridge", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "north east somerset", "sentiment": "none"}], "organizations": [{"name": "huddersfield examiner", "sentiment": "none"}, {"name": "trinity mirror southern", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "surrey advertiser", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "plymouth moor view", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "penrith", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "foreign affairs select committee", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "territorial army", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "essex", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "assembly", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Who could replace Theresa May as Conservative leader? Some of the names might surprise you Attention has focussed on Jacob Rees-Mogg as a possible Tory leader but some of the possible candidates aren't very well known Share British Prime Minister Theresa May (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nWho could replace Theresa May as Conservative leader? \nAccording to some Tory MPs, it might be someone you’ve never heard of. \nQuestions have been asked about how long Mrs May will cling on since June’s general election, in which the Tories lost their majority. \nHer recent comment that she is in it “for the long term” has done nothing to end the speculation. \nMany Conservative MPs want Ms May to continue until Brexit is concluded in 2019. But they will not allow her to lead the party into another general election, following her disastrous performance in this year’s poll. \nSo who could do the job instead? Jacob Rees-Mogg Jacob Rees-Mogg MP (Image: PA) \nIn recent weeks, there have been reports that Jacob Rees-Mogg, the ultra-posh backbench MP for North East Somerset, could replace Mrs May. \nHe came top of a poll of Tory activists organised by website ConservativeHome. \nBut many MPs say he’s the wrong person for the job. Read More Could a Brexit bank holiday become a thing? A new Tory 'wish-list' has been revealed \nAnd they were expressing doubts even before Mr Rees-Mogg said he opposed abortion in any circumstances and same-sex marriage, in an interview with ITV’s Good Morning Britain. \nOne Conservative said: “He is one of the most intelligent people I have ever met. He’s frighteningly intelligent. \n“But he sits there and he talks in Latin on occasions. This is not Britain’s Got Talent. I just don’t get it myself.” Dominic Raab Dominic Raab (Image: Surrey Advertiser) \nInstead, many Conservatives think the next leader could be someone like Former solicitor Dominic Raab, MP for Esher and Walton. \nHe is currently a Justice Minister - but not a member of the Cabinet. \nSome Conservatives would like to see him given a Cabinet post, so that he has a chance to demonstrate whether he can cope with life at the very top of government. Rory Stewart Rory Stewart MP (Image: Huddersfield Examiner) \nRory Stewart is Conservative MP for Penrith and the Borders in Cumbria, and it might help the Tories to have a leader representing a Northern constituency. \nHe’s a former foreign office official, and currently the Government Minister for Africa. Read More \nAgain, some Conservatives would like to see him in the Cabinet, so that he has a chance to shine. James Cleverly James Cleverly (Image: Trinity Mirror Southern) \nSome of the names Tory MPs are discussing may come as a surprise - because they are backbench MPs and relative newcomers to Parliament. \nBut some Conservatives think their best bet is to “skip a generation or two” and offer the public a fresh face. \nNames mentioned include Essex MP James Cleverly. He’s a former leader of the Conservative group in the London Assembly, and an officer in the Territorial Army. Johnny Mercer MP Johnny Mercer (Image: Daily Mirror) \nJohnny Mercer, the backbench Conservative MP for Plymouth Moor View, is also seen as a possibility. \nHe is a former soldier who served three tours of Afghanistan. Tom Tugendhat \nThe third “unknown” to be mentioned is backbencher Tom Tugendhat, MP for Tonbridge and Malling. \nAnd he also has armed forces experience, after serving in Iraq and Afghanistan. \nMr Tugendhat is chair of the Foreign Affairs Select Committee. Amber Rudd Home Secretary Amber Rudd (Image: Newcastle Chronicle) \nOf the potential leaders already in the Cabinet, eloquent Home Secretary Amber Rudd might seem an obvious choice. \nShe has two problems, however. Her majority in her Hastings and Rye seat is only 346, with Labour second, and she could potentially become Conservative leader only to be kicked out of Parliament at the next election. Read More NHS managers explain why the health service is heading for a winter crisis \nFurtermore, Ms Rudd was a staunch remainer in the EU referendum campaign. And this could be an issue if there is a transition period after we officially quit the EU in 2019. \nBrexit-supporting Tories will want a Prime Minister who they trust to end this transition period and ensure a firm break with the EU does, eventually, take place. Ms Rudd will not be the candidate for them. David Davis Brexit secretary David Davis (Image: PA) \nDavid Davis, the Brexit Secretary, stood for the party leadership in 2005 and lost. \nBut he could do better this time. Although he’s been criticised by EU officials, many Conservative MPs think he’s doing a good job with the difficult task of leading the British Government’s negotiating team in Brexit talks with the EU. Boris Johnson Boris Johnson (Image: Estonian Presidency) \nThe Foreign Secretary was once seen as the favourite to become Conservative leader - back when David Cameron was in the top job. \nIt didn’t happen, of course. He pulled out of the 2016 leadership election battle before it officially began, and Mrs May ended up in Number 10. \nThere’s a feeling at Westminster that his star has faded. \nOne Conservative MP said: “His time has gone”. Like us on Facebook ", "external_links": [], "published": "2017-09-10T10:00:00.000+03:00", "crawled": "2017-09-10T10:44:32.000+03:00", "highlightTitle": ""}