{"organizations": [], "uuid": "2e6e7293d363e10906dc51af84b9e798409d6961", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12314843.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/shadow-brexit-secretary-keir-starmer-13678804", "country": "GB", "domain_rank": 21960, "title": "Shadow Brexit Secretary Keir Starmer on why Labour wants to end freedom of movement", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-27T07:00:00.000+03:00", "replies_count": 0, "uuid": "2e6e7293d363e10906dc51af84b9e798409d6961"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/shadow-brexit-secretary-keir-starmer-13678804", "ord_in_thread": 0, "title": "Shadow Brexit Secretary Keir Starmer on why Labour wants to end freedom of movement", "locations": [], "entities": {"persons": [{"name": "keir starmer", "sentiment": "negative"}, {"name": "keir", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brighton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "invalid email  labour", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "could labour", "sentiment": "none"}, {"name": "labour party members of parliament", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Shadow Brexit Secretary Keir Starmer on why Labour wants to end freedom of movement Labour's Shadow Brexit Secretary says the days when EU migrants could come to the UK without restriction must end Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour needs “a big discussion” about immigration that could last for years, according to Shadow Brexit Secretary Keir Starmer. \nBut one thing he’s certain of is that freedom of movement between the UK and EU must come to an end. \nThat’s not to say workers won’t migrate from one country to another. \nBut speaking to regional reporters at Labour’s annual conference in Brighton, Sir Keir said there must be “a balance” between the benefits migration brings to the economy and businesses, and the impact it has on communities. \nHe said current rules, allowing unfettered freedom of movement, “haven’t worked well everywhere”. \nIt’s one of the few things Labour does have a clear view on when it comes to Brexit. Sir Keir stressed that Labour was committed to getting a deal for the UK which retained “the benefits of the Single Market and the customs union”, but there’s currently no policy on whether the country should actually remain a permanent member of the Single Market after Brexit or not. \nInstead, he insists: “I’ve always said it’s the outcome that matters. And we shouldn’t get hung on the model.” \nSpeaking to Sir Keir, you can understand how he achieved the difficult task of uniting the Shadow Cabinet around some sort of Brexit policy. He chooses his words carefully and seems like he’d make a good diplomat (or even, dare one say, the type of person we want representing us in Brexit negotiations with the EU). \nAnd having sorted out Labour’s divisions, he has an even more ambitious goal - uniting the country. \n“Whatever we do, we’ve got to find a way of bringing the 48 per cent and the 52 per cent together,” he said. \nWhen it comes to freedom of movement, his position is clear. The 2016 referendum, when the country voted for Brexit, means that it has to end. \nSir Keir said: “I’ve always said the referendum result and freedom of movement are bound up, and therefore freedom of movement will end when we leave the EU. That is a statement of fact. \n“What we therefore need to do is to begin the discussion, both in our party and across the country, as to what does a changed immigration policy looks like. \n“And that’s a discussion that has to take place over the next few months and years, across all political parties.” \nHe added: “We need something that works for our economy and businesses, and we need something that works for our communities. How we strike that balance is a matter we need to discuss going forward. \n“The current rules have worked well in some respects but they haven’t worked well everywhere and we have to acknowledge that. \n“But moving from the position we are in to the position we will need to be in is obviously a big discussion for us as a party, and a big discussion for the Government.” \nIt’s unclear whether the UK could remain in the Single Market while abandoning freedom of movement. However, Sir Keir insists there is currently no policy on whether the UK should stay in (after a proposed transition period comes to an end), or try to negotiate a new trade deal with the EU instead. \n“I’ve always said it’s the outcome that matters. And we shouldn’t get hung on the model.” Read More Labour reveals plan to help 'Waspi' women hit by state pension age increase \nHighlighting his speech to the party conference, he said: “But I’ve also said in my speech we shouldn’t sweep options off the table. \n“That includes, at least as an option, staying in a customs union and, as an option, a new relationship with the Single Market. And whether we do it that way or do it as a bespoke trade deal is secondary to the outcome.” \nMore than 30 Labour figures sign a letter over the weekend arguing it makes no sense for Labour to call itself an anti-austerity party if it backs leaving the Single Market, on the grounds that this would cause enormous damage to the economy. \nHowever, party leader Jeremy Corbyn made it clear he is deeply sceptical about the Single Market in an interview with the BBC’s Andrew Marr Show. \nMr Corbyn suggested that membership could prevent a future Labour government carrying out its policies, saying: “I would also say that we need to look very carefully at the terms of any trade relationship ‘cause at the moment we’re part of the single market, obviously. That has within it restrictions in state aid and state spending.” \nI put it to Sir Keir that Jeremy Corbyn seemed to want the UK to quit the Single Market. \nHe insisted that his leader had said no such thing. Sir Keir said: “You can understand the concern of all Labour party Members of Parliament and party members to make sure we can implement our manifesto.” \nSir Keir added: “I don’t think there’s anything in the current [Single Market] rules that we have that does stop us implementing our manifesto, but obviously we are negotiating to a different position.” Labour leader Jeremy Corbyn (Image: Getty Images Europe) \nThere’s a strange moment during the interview when he refuses to rule out holding a second referendum on whether to go ahead with Brexit. It seems clear from everything he has said that a Labour government would go ahead with leaving the EU, and there are no plans to hold a second vote. \nStill, when asked directly whether Labour could possibly ask the country to think again, he declines to give a straight answer - four times. \nFirst, he said: “We have never called for another referendum”. \nThis is clearly true, but he wasn’t asked to confirm what the party has said so far. The question he was asked was whether Labour might consider holding a second referendum in the future, if it forms a government. So, for a second time, what’s the answer? \nHe replies: “We have been 15 months since the first referendum and we’ve not called for a referendum so it’s as simple as that.” \nBut the question isn’t about what Labour has done so far, it’s about what the party might do in the future. Could Labour hold a second referendum? \n“We have never called for a second referendum and that’s our position.” Read More Newcastle was chosen for an experiment with Universal Credit and it was a disaster \nThat does seem a bit clearer. Given a fourth opportunity to give a clear and unambiguous reply, he points out that the Liberal Democrats backed a second referendum and failed to make a breakthrough in June’s general election. \n“This is the idea that the Liberal Democrats put to the country in this general election as their flagship policy. \n“But whatever we do, we’ve got to find a way of bringing the 48 per cent and the 52 per cent together. \n“And I know that sounds vague but we it is very important that we understand why those who voted Leave voted Leave, but we also understand that those who voted Remain do not want to be written out of their own future. \n“And we have therefore to find something that truly reflects the vote but also brings the country back together. We can’t ignore one side or the other in this.” Like us on Facebook", "external_links": [], "published": "2017-09-27T07:00:00.000+03:00", "crawled": "2017-09-27T08:16:27.026+03:00", "highlightTitle": ""}