{"organizations": [], "uuid": "253ca0fb68fac8ae20232eb4eb5440b7664c951d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/incoming/article462393.ece/ALTERNATES/s1200/Cross-Country-trainJPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/weve-won-fight-save-train-462051", "country": "GB", "title": "We've won our fight to save train services to South Devon - but there are more battles ahead", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-12T13:06:00.000+03:00", "replies_count": 0, "uuid": "253ca0fb68fac8ae20232eb4eb5440b7664c951d"}, "author": "Guy Henderson", "url": "http://www.devonlive.com/news/devon-news/weve-won-fight-save-train-462051", "ord_in_thread": 0, "title": "We've won our fight to save train services to South Devon - but there are more battles ahead", "locations": [], "entities": {"persons": [{"name": "westminster", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}, {"name": "foster", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "kevin foster", "sentiment": "none"}], "locations": [{"name": "temple meads", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}, {"name": "dawlish", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}, {"name": "teignmouth", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "birmingham new street", "sentiment": "none"}, {"name": "bay", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "devon tories", "sentiment": "none"}], "organizations": [{"name": "virgin cross country", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "cross country trains", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "cross country", "sentiment": "none"}, {"name": "manchester piccadilly", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A Virgin Cross Country train sits at a platform in Temple Meads station. Share Comments \nA DevonLive campaign to save direct train services linking the north and the Midlands to Devon's holiday resorts has succeeded in saving the trains - for now. More than 1,000 people signed our petition after Cross Country announced their plans to axe services. \nTorbay MP Kevin Foster and his Newton Abbot counterpart Anne Marie Morris took the petition to Westminster and threw their weight behind the campaign. \nThe plans would have seen all but one Cross Country Trains service from Paignton axed. The only remaining service to stop at Dawlish, Teignmouth, Torquay and Paignton would have been the 7.02am service from Paignton to Manchester Piccadilly. There would have been no return service. Read More Police rescue 'distressed' woman from Torquay seaside cliffs \nCurrently three trains a day head north from Paignton to Manchester and one to Birmingham New Street, while two trains head from Manchester to Paignton and one from Birmingham to Paignton. \nThe CrossCountry Future Timetable Consultation said retention of the current level of CrossCountry Paignton services was not possible, given current levels of rolling stock. \nToday Mr Foster welcomed news of the reprieve for services but warned: \"We have only won the battle, not the war.\" Read More Ben Bradshaw calls on Devon Tories to break ranks and defend democracy in Commons Brexit vote \nMr Foster said he had been advised that Cross Country and the Department for Transport have been engaged in discussions in light of the feedback they received, including the petition. \nThe discussions were not completed in time to meet Network Rail's deadline for submitting a timetable for this December. As a result, details included in the newly-published timetable did not contain any of the changes that had been proposed, including the cuts to services to the Bay. \nMr Foster said he had been told that the discussions would continue, and pledged to remain watchful to see what further news is released by Cross Country Trains. \nHe said: \"I have constantly chased Ministers at the Department for Transport for an update on the future of Cross Country Trains’ direct services to the Bay, and I am pleased to finally receive some news. Read More Alleged Co-op cashpoint explosive gang appear in court \n\"Businesses, tourism and visitors to the bay need certainty and clarity on what our direct train services will look like going forwards. While I welcome the news that stakeholder feedback, no doubt including my petition of over 1,000 local signatories, has caused a delay in Cross Country’s plans, we have only won the battle, and not yet the war. \n‘I will be maintaining the pressure on Cross Country Trains and the Department for Transport over the coming months to ensure that the Bay continues to be served with a regular and adequate number of trains to the Midlands and North of England.\" Read More", "external_links": [], "published": "2017-09-12T13:06:00.000+03:00", "crawled": "2017-09-12T13:59:54.010+03:00", "highlightTitle": ""}