{"organizations": [], "uuid": "feb1b5e4adb8557be8bba358320a74a071945d6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13626863.ece/ALTERNATES/s1200/JS118047686.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/austerity-ends-public-sector-workers-13626802", "country": "GB", "domain_rank": 21960, "title": "Austerity ends for public sector workers with the promise of a smaller pay cut", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-16T18:00:00.000+03:00", "replies_count": 0, "uuid": "feb1b5e4adb8557be8bba358320a74a071945d6c"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/austerity-ends-public-sector-workers-13626802", "ord_in_thread": 0, "title": "Austerity ends for public sector workers with the promise of a smaller pay cut", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Austerity ends for public sector workers with the promise of a smaller pay cut Theresa May and her government have achieved the impossible and united the country - against them Share Prime Minister Theresa May and a hospital ward Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Theresa May’s effort to end austerity last week didn’t quite get the plaudits she hoped for. \nIt was announced the 1% public sector pay cap was to be lifted and obviously she and Chancellor Philip Hammond expected the country to celebrate. \nHowever, after seven years of grief, first from the Conservative-led Coalition with the Lib Dems and now the Conservatives on their own after a £1bn DUP bung helped them form a minority government, this country has learned to look at the small print before giving its opinion. \nThe small print here was that it had been lifted for a select group of public sector workers - not all of them by any means - and the ‘lucky’ ones were still going to get a pay rise less than the rate of inflation. British Prime Minister Theresa May (Image: Getty Images Europe) \nIn other words, the Government’s version of ending austerity is granting these workers a smaller than usual pay cut. \nIt’s like a bully claiming to have seen the error of his ways and promising in future not to punch his victims as much. \nTo put things in context, it’s worth remembering public sector pay was frozen in the financial years 2011-12 and 2012-13, except for the lowest earners. Rises were then limited to an average of 1% from 2013-14 to 2015-16, and then capped at 1%. \nIn the came period the CPI rate of inflation has gone up by a cumulative total of 17.82%. \nSo news that unions are calling for a 3.9% pay rise plus £800 for nurses comes as no surprise. \nIf granted, that would add £3bn to the NHS pay bill. However before cheeks are sucked in at the thought, remember around a quarter of that would come straight back in taxes - that’s £750m. \nMeanwhile a fair slice of the £2.25bn balance would be spent largely in UK shops and therefore pumped back into the British economy which has endured years of stagnation due to austerity and badly needs a cash stimulus. A hospital ward (Image: PAPeter Byrne/PA Wire) \nIt would also help those who have had to take out loans or maxed out credit cards to make ends meet which would go some way to deflating the current credit bubble which is leading the country towards another financial crisis. \nSince the 1980s, the thought of reasonable (ie fair) wage rises at the lower end of the pay scale, particularly among public sector workers, have been portrayed by union bashers as a drain on the country’s finances. Read More Government bows to pressure to offer police a better salary increase - but who will pay for it? \nOn the other hand, massive increases at the top end have been portrayed by the same union bashers as vital for the prosperity of the country, rewarding the ‘brightest and the best’ and ensuring their skills are kept in Britain. \nI’m not sure the general public ever bought these arguments but they’ve never been as united as now to oppose them. \nSo, looking on the bright side, at this time of division over Brexit, Theresa May and her calamity government have achieved the impossible. By uniting the country - against them. Like us on Facebook ", "external_links": [], "published": "2017-09-16T18:00:00.000+03:00", "crawled": "2017-09-16T19:27:29.000+03:00", "highlightTitle": ""}