{"organizations": [], "uuid": "4951cb61cfcf5325e8ca50d6530c6bcc3fcfd42e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/incoming/article223073.ece/ALTERNATES/s1200/Andrew-BridgenPNG.png", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/local-news/andrew-bridgen-the-media-failing-407882", "country": "GB", "domain_rank": 48128, "title": "Andrew Bridgen - 'The media is failing to report Brexit properly' - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2017-09-01T11:50:00.000+03:00", "replies_count": 0, "uuid": "4951cb61cfcf5325e8ca50d6530c6bcc3fcfd42e"}, "author": "Andrew Bridgen", "url": "http://www.leicestermercury.co.uk/news/local-news/andrew-bridgen-the-media-failing-407882", "ord_in_thread": 0, "title": "Andrew Bridgen - 'The media is failing to report Brexit properly' - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "andrew bridgen", "sentiment": "negative"}, {"name": "michael o’leary", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "alan duncan", "sentiment": "none"}], "locations": [{"name": "brexit britain", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "west leicestershire", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Comments \nNorth West Leicestershire's MP Andrew Bridgen is not happy with how Brexit is being reported. \nIn his latest column for the Leicester Mercury below, the Tory MP has shared his views on what he claims is an 'attack' on people who voted leave. \nIn the months since the EU referendum, we have had a constant stream of negative presentation about our prospects of negotiating our exit from the European Union by a media being fed by disgruntled remainers. \nFirstly they subtly attack and deride those who voted leave as not understanding the argument, being obsessed with immigration, or being small minded little Englanders. Doom has been forecasted for the British economy which they believe cannot possibly survive outside the EU and every bit of good news is tagged ‘despite Brexit.’ \nLast month the UK effectively started trade talks with the USA, the largest economy in the world. Read More Fire service reveals cause of Leicester high rise fire which saw man die from his injuries \nThe President of the USA was quoted as saying this is going to be a big deal. This could well be ready to be enacted as soon as we leave the EU and would be a huge card in our EU withdrawal negotiations. \nWhat do we get from the media?, a non-story about importing chlorine washed chickens, the same chickens millions of British people would have eaten in the USA. \nWe are the largest investors in the USA and they are the largest investors in the UK, we share a common language and values, yet no trade deal could ever happen between our countries whilst we remain in the EU - the reason being that the EU is a protectionist club which keeps goods out in order to protect inefficient industries within the bloc. \nMany of the UK markets and industries are efficient to the level that this is working against us and keeping prices higher than they need be. \nThe protectionism of the EU not only keeps out countries such as the United States but also developing nations who we fund through our International Development programme. \nThe only way these countries can truly develop and prosper is through trade and a post Brexit Britain will enable them to sell into our markets without huge tariffs and we will be able to achieve a return on our Aid budget. \nAgain the impact this could have on developing nations remains unreported even though those who wish us to remain in the EU are invariably the same people calling for increased assistance to developing nations. Read More \nAlso failing to make an impact in the reporting of Brexit is our talks with Australia, New Zealand, South Korea, Japan, China, India, Brazil and a host of other significant markets who want to make trade deals with the UK. The way the vote went could have been different according to study \nWhat we do keep hearing however is the exodus from the City of London of numerous financial institutions, however the reality is that companies such as Deutsche Bank have signed a 25-year lease for a new London headquarters and surveys of international workers in the City of London suggest they do not wish to work elsewhere. \nWe also keep hearing from people such as Michael O’Leary of Ryanair with warnings of Armageddon when we leave the EU and how the company are going to desert our markets without the media at any point challenging his agenda and his natural instinct to protect his business model. Read More MP Sir Alan Duncan claims he was rejected from role in government because he was gay \nExports are up 15% year on year, unemployment is at its lowest level since 1975 being only 1% North West Leicestershire , and the economy continues to grow in spite of the dire warnings predicted ahead of the referendum that we would be in a prolonged recession by now. \nAnd what of our relationship with the EU? The facts remain the same as they did before the referendum. Andrew Bridgen \nWe buy a lot more from them than we sell to them. They are not doing us a favour by allowing us to buy these goods and services. \nIt’s a trade relationship and there is no reason at all why we should not have a free trade agreement worked out very quickly. The Republic of Ireland will be desperate for this as we are its biggest customer by quite some distance. Read More Walkers could be ditching one of these favourite crisp flavours - and it's up to the public to decide \nIt is unfortunate how the media is choosing to represent Brexit. \nThe word of EU negotiators is taken as gospel and despite some of their totally unreasonable demands and behaviour, there are still people who believe we should not only remain in bed with this organisation, but become ever more intertwined as the EU takes steps to federalise. \nI would urge you to consider what agenda the people spreading these tales of chaos actually have, as clearly much of the media do not wish to challenge it. Read More ", "external_links": [], "published": "2017-09-01T11:50:00.000+03:00", "crawled": "2017-09-01T14:53:50.012+03:00", "highlightTitle": ""}