{"organizations": [], "uuid": "dbd153fc62ba379f4a89b6e66ead594ed24cd042", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11176376.ece/ALTERNATES/s1200/JS73964669.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13657701", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: 'Newcastle must prepare for the potential shock of Brexit', leader warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-22T10:40:00.000+03:00", "replies_count": 0, "uuid": "dbd153fc62ba379f4a89b6e66ead594ed24cd042"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13657701", "ord_in_thread": 0, "title": "Business Breakfast LIVE: 'Newcastle must prepare for the potential shock of Brexit', leader warns", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "coun forbes", "sentiment": "none"}, {"name": "coun nick forbes", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "tyneside cinema", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Newcastle swimming lesson company aims to go national with franchise programme \nA North East company that offers private swimming lessons is aiming to go national by launching a UK-wide franchise programme. \nNemo Swimming was founded in Jesmond, Newcastle, by swimming industry entrepreneurs Phillip Groom and Theresa Nicolson. It provides a complete range of swimming lessons for parents and their babies, toddlers, pre-schoolers and older children. \nHaving proven their business model by growing the company to cover 12 locations in Tyne and Wear, Mr Groom and Ms Nicolson are now expanding Nemo Swimming to the rest of the UK by selling their successful business model to franchisees. \nThe company has been supported by brand and digital agency Unwritten Creative, which has worked with it to create buyer personas to help identify customers and potential franchisees. Buyer Personas allowed both parties to better understand the needs of the company’s customers and future franchisees, and how to communicate with them. \nUnwritten Creative is also providing Nemo Swimming with a state-of-the-art website. \nMr Groom and Ms Nicolson are offering potential franchisees the benefit of their 10 years of experience working in the business and the opportunity to own and operate their own businesses. \nMr Groom said: “Setting up your own business can be daunting, many people want to be their own boss, but don’t always know where to start. Nemo Swimming’s new franchise scheme can solve this problem. \n“Working with Unwritten has allowed us to understand how to best connect with and support both customers and franchisees. Our scheme is ideal for motivated people who want to run their own business and guide parents and children through a complete pathway of learn to swim, in a safe and supportive environment.” (L to R) Phillip Groom, Theresa Nicolson and Amy Mooney (Image: Copyright unknown) 9.20 Coreena Ford Apple iPhone 8 goes on sale - but will tech fans wait for iPhone X? \nThe newest versions of the iPhone, the 8 and 8 Plus, have gone on sale in the UK for the first time this morning. \nBut traditional queues outside the technology giant’s flagship retail stores may be smaller than usual because a third new device, the ultra premium iPhone X, is still set to be released later in the year to mark the 10th anniversary. \nThe iPhone 8 and 8 Plus are the first smartphones from Apple to support wireless battery charging, as well as improved camera and screen specifications. The two phones also house Apple’s new A11 Bionic processor chip, which the tech giant says is the “most powerful and smartest” ever in a smartphone and makes the 8 up to 70% faster than the previous iPhone. \nBut some consumers appear to be willing to skip this generation of the device in order to wait for the special edition iPhone X, which features Apple’s first ever edge-to-edge screen and facial recognition technology. \nThis can be used to unlock the phone and make payments via Apple Pay, as well control new animated emoji - named Animoji - using their facial expressions. The iPhone X is due to be released on November 3, starting at £999, making it the most expensive iPhone ever. \nAs well as the 8 and 8 Plus, is a third generation Apple Watch - the Series 3 - which comes with its own mobile data connection capabilities for the first time, meaning it can be used to make calls independent from an iPhone. The new Apple TV 4K, the first streaming box from the firm that supports ultra high definition video, also goes on sale. Apple's new iPhone 8 and iPhone 8 Plus which are on sale from this morning. 9.13 What's the FTSE latest? \nThe FTSE-100 index at 8.45am was down 8.28 at 7255.62. \nThe pound at 9am was 1.3588 dollars compared to 1.3577 dollars at the previous close. The euro at 9am was 0.8827 pounds compared to 0.8802 pounds at the previous clos 9.10 Coreena Ford Habitat and Argos opening in Newcastle Sainsbury's - but another Argos will shut \nFurniture firm Habitat and Argos are to open stores inside the Sainsbury’s superstore in High Heaton, the supermarket giant has revealed. \nThe move will, however, lead to the closure of an Argos store in Newcastle city centre . \nArgos will move from its base in Northumberland Street into the Heaton store after the company acquired the catalogue retailer’s owner, Home Retail Group, transferring staff over to the new shop. \nThe deal will also see home furnishings leader Habitat create around eight jobs by moving into the store, provide a range of around 650 products from its furniture, upholstery, lighting, homewares and textiles range. \nShoppers will welcome news of Habitat’s return to the city, many years after its standalone store closed in Eldon Square and after the closure of the Habitat concession in Homebase at Kingston Park . Until now, the nearest stores have been in Edinburgh and Leeds. \nWork is under way to reconfigure the Sainsbury’s superstore with plans to open up its new additions to customers in November. \n(And for those wondering what happens to the Tu clothing section - it’s been mentioned a lot on social media - it IS staying: I’ve been assured by Sainsbury’s that it’s simply being moved to another area within the store.) Sainsbury's store in Heaton Coreena Ford Slough tops Glassdoor's list of 25 Best Towns and Cities to Work \nThe town immortalised by David Brent in the TV series The Office has been named the best in the country for jobs. \nSlough in Berkshire came top of a list for work, the cost of living and employee satisfaction. \nJobs site Glassdoor said its study showed that Slough had emerged as a “prime spot” to live and work as cities like London became too expensive. \nMedian salaries are £35,000, there are over 26,000 vacancies and the median price of a house is £390,000, the research found. \nDr Andrew Chamberlain, Glassdoor’s chief economist, said: “With large multinational businesses establishing themselves in Slough, along with high average salaries and close proximity to major transport hubs such as Heathrow Airport, the Berkshire town has now emerged as a prime spot to live and work.” \nManchester was second (median salaries £24,000, houses £177,200), followed by Cambridge (£31,200, £455,000), Swindon (£31,000, £248,000), Stoke-on-Trent (£21,000, £143,000), Reading (£35,000, £422,000), Leeds (£24,000, £206,000), Milton Keynes (£28,000, £301,000), Bolton (£21,000, £159,000) and Oxford (£30,000, £489,000). \nNewcastle was in 21st place. Management phrases were favoured by the ultimate embarrassing boss, The Office's David Brent (Image: BBC) 8.55 Coreena Ford Saga on track despite costs squeezing \nSaga said it was on course to achieve its fourth consecutive year of growth despite profits being squeezed by cost pressures. \nThe over-50s insurer and holiday firm saw pre-tax profits fall 6.3% to £103m for the six months ending in July, as it took a hit from a “successful refinancing and net fair value losses on derivatives”. \nWhile revenues dropped £1.8m to £435.4m over the period, underlying pre-tax profits rose 5.5% to £110.2m thanks to a 10.4% hike in its retail broking and travel business. \nThe group said it was enjoying bumper pre-sales for its cruise ship Spirit of Discovery, with travel profit growing 63% to £11.9m. \nIt came as the company also hiked its interim dividend by 11.1% to 3p. \nGroup chief executive Lance Batchelor said: “Saga is on track to deliver a fourth consecutive year of growth. \n“Underlying profits are up again and so is our dividend. Our retail broking and travel divisions are performing well. Saga’s new ship, Spirit of Discovery, will arrive in June 2019, and pre-sales are very strong. \n“Our confidence in demand has supported our decision to purchase our second new ship, Spirit of Adventure, and to bring forward delivery to August 2020. \n“I believe that these results continue to demonstrate that Saga is growing, has good momentum, and is on track to deliver in line with expectations for the full year.” \nFocusing on the insurance business, total revenues dropped 10.3% to £192.8m, but retail broking profits climbed 4.7% to £70.9m following a robust performance from motor broking. 8.50 Coreena Ford State of the City showcases Science Central's latest swish newcomer... \nThe State of the City event in Newcastle also gave the city the chance to show off the facilities inside the Urban Sciences building - home of the School of Computing Science and its 1,395 staff and students - which has only just opened up. \nVisitors, and students, are suitably impressed. 8.40 KEY EVENT World is watching us for Brexit deal success, Theresa May to tell EU leaders \nTheresa May will tell European counterparts their shared political legacies depend on agreeing a good Brexit deal as she seeks to break the deadlock in negotiations over the UK’s withdrawal from the EU. \nThe Prime Minister will set out her plans for a transitional period from the formal date of Brexit in March 2019, expected to last two years, before moving to a permanent trade deal. \nMrs May is thought to be considering an offer of paying around 20 billion euro (£17.6bn) over the transition period in order to secure favourable trading arrangements, which would also help address Brussels’ concerns about the potential hole in its current budget caused by the UK’s exit. \nAnd she is also reported to be ready to give ground on the issue of citizens’ rights for EU nationals in the UK, enshrining the terms of any deal in a formal treaty. \nHer landmark speech comes as an opinion poll suggested a majority of Britons now back staying in the European Union - with 52% in favour of remaining part of the bloc. \nIn the Italian city of Florence, Mrs May will say European leaders they have a “profound sense of responsibility” to agree good terms. \nHer direct pitch to the continent’s leaders will be seen as a further attempt to try to bypass the formal talks led by Brussels’ Brexit chief negotiator Michel Barnier, which have stalled amid concerns of a lack of progress on the financial settlement, citizens’ rights and the Northern Ireland border. \nMrs May will emphasise the historic nature of the negotiations as she calls for an “imaginative and creative” approach to securing a deal, in what may be seen as a fresh British complaint about the European Commission’s perceived rigid approach to talks. Prime Minister Theresa May (Image: PA) 8.35 KEY EVENT Newcastle needs Brexit deal that doesn't undermine its economic growth, leader says \nNewcastle needs to be ready for the challenges of Brexit if it is to continue its economic growth, the city’s leader has said. \nIn his annual State of the City address, Newcastle City Council leader Nick Forbes said that much of the area’s recent success had been built on European funding, including the Science Central site where he made his speech. \nHe said that the region “urgently needs assurances” that the Government’s Brexit deal will not undermine a boom in the city’s economy that recently saw it highlighted for having both the highest increase in average earnings at 6.3% in the UK and the biggest rise in productivity. \nThat Barclays study suggested a growing economic divide in the North East, with Newcastle’s boom coming at the same time that other parts of the region saw a worsening of a number of economic factors. \nCoun Forbes said that Newcastle had to be a city “preparing for the future” so that it did not suffer from the economic shock of Brexit in the same way that it did during the recession of 2007/08. \nHe said: “Newcastle and the North East have benefited immensely from the European Union, from finances and trade to culture and knowledge, and it is essential that whatever happens next builds on those benefits rather than abandoning them. \n“In the last five years alone some £105m in EU funds has come to the city, helping fund projects at the Theatre Royal, Tyneside Cinema and the Great North Museum. The building we are in was kickstarted with EU funds. \n“Investment from Europe also comes to our city from another route – from trade. The North East has been the only English region with a positive trade balance for virtually the last 20 years.” Coun Nick Forbes ", "external_links": [], "published": "2017-09-22T10:40:00.000+03:00", "crawled": "2017-09-22T10:54:07.001+03:00", "highlightTitle": ""}