{"organizations": [], "uuid": "8cb33a5e84166c0b258a9a90a397315d39393efe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i1.leicestermercury.co.uk/incoming/article471987.ece/ALTERNATES/s1200/Rory-Palmer.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/leicester-news/leicesters-deputy-mayor-rory-palmer-471828", "country": "US", "domain_rank": 48128, "title": "Leicester's deputy mayor Rory Palmer unlikely to be replaced when he departs for Brussels - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.529, "site_type": "news", "published": "2017-09-14T19:00:00.000+03:00", "replies_count": 0, "uuid": "8cb33a5e84166c0b258a9a90a397315d39393efe"}, "author": "Dan Martin", "url": "http://www.leicestermercury.co.uk/news/leicester-news/leicesters-deputy-mayor-rory-palmer-471828", "ord_in_thread": 0, "title": "Leicester's deputy mayor Rory Palmer unlikely to be replaced when he departs for Brussels - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "rory palmer", "sentiment": "negative"}, {"name": "rory", "sentiment": "none"}, {"name": "coun palmer", "sentiment": "none"}, {"name": "ross grant", "sentiment": "none"}, {"name": "peter soulsby", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "glenis willmott", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "labour east midlands", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicester mercury leicester", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicester's deputy mayor Rory Palmer unlikely to be replaced when he departs for Brussels The deputy's salary could be shared among assistant mayors with greater responsibilities Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nLeicester’s deputy mayor might not be directly replaced when he leaves to become an MEP next month. \nCouncillor Rory Palmer is heading to Brussels to take over from retiring Labour East Midlands MEP Glenis Willmott. Rory Palmer \nHis imminent departure has prompted city mayor Sir Peter Soulsby to rethink the structure of his nine-strong executive team. \nThe mayor is required by law to appoint a deputy, but Sir Peter indicated he might adopt a new approach and give more responsibility to three of his current assistant mayors, with one appointed as a ‘first among equals’ to stand in for him if needed. Read More \nSir Peter said each of the three would be paid more to recognise their additional responsibilities, but that any changes would be achieved within the existing financial envelope of his executive team. \nThe deputy mayor is currently paid just over £40,000 to carry out the role. \nSir Peter said: “I am considering whether this is an opportunity to make a number of changes to my executive team. \n“It may be I adopt a rather different model to having a single deputy and I have been looking at the structures used by other mayors.” \nSir Peter would not be drawn specifically on which of his assistant mayors could be promoted in a reshuffle, but said he would be looking at responsibilities linked to adult social care, children’s services and the environment. Read More \nHe said: “Those doing the jobs at the moment are not adequately paid given the levels of complexity and responsibility required. \n“They are full time jobs and are remunerated at the levels of comparatively junior members of staff. \n“What also irks me is that they are excluded from being part of a decent pension scheme.” \nCouncillors were invited to join the local government pension scheme some years ago but then were excluded from it by the Conservative Government to save money. Sir Peter Soulsby \nSir Peter denied that a lack of suitable candidates to be a like-for-like replacement for Coun Palmer had prompted his thinking. \nHe said: “I have a wealth of talent available to me but it may be that what was appropriate five years ago it not what is needed now.” \nHe added: “I am very grateful to Rory for the work he has done as deputy mayor. He has been bright, creative and extremely hard working. \n“I will be sorry to see him go but I know he has all the qualities needed to be an exceptional MEP.” \nSir Peter said he intended to formalise his new executive in the next 10 days. Read More Leicestershire county councillors set for 5.3% pay rise, despite further cuts looming \nTory city councillor Ross Grant said: “In principle, I don’t have a problem with it, but it raises the whole question about the role of assistant mayors. \n“Are there just too many of them? Some of them have very demanding portfolios and work very hard. Others have far fewer responsibilities, and could this not be a chance to trim the number down?\" \nCoun Palmer is awaiting a start date for an 18 month stint as an MEP that will come to an end when Brexit is achieved. \nHe said he felt it was not appropriate for him to comment on what might happen at the council after he leaves. Read More ", "external_links": [], "published": "2017-09-14T19:00:00.000+03:00", "crawled": "2017-09-14T21:02:07.002+03:00", "highlightTitle": ""}