{"organizations": [], "uuid": "78244260407486acb180a35d00dfdcb1ebb21084", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/incoming/article474291.ece/ALTERNATES/s1200/Humpback-Whale-Rescue-by-Dart-RNLI.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/dramatic-dartmouth-whale-rescue-features-474384", "country": "US", "title": "Dramatic Dartmouth whale rescue features on BBC show - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2017-09-14T12:30:00.000+03:00", "replies_count": 0, "uuid": "78244260407486acb180a35d00dfdcb1ebb21084"}, "author": "Zoe Stevens", "url": "http://www.devonlive.com/news/devon-news/dramatic-dartmouth-whale-rescue-features-474384", "ord_in_thread": 0, "title": "Dramatic Dartmouth whale rescue features on BBC show - Devon Live", "locations": [], "entities": {"persons": [{"name": "kevin", "sentiment": "none"}, {"name": "brexit  chris", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "katy", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "dart rnli", "sentiment": "none"}], "locations": [{"name": "start bay", "sentiment": "none"}, {"name": "blackpool sands", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "river thames", "sentiment": "none"}, {"name": "devon coast", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "dartmouth", "sentiment": "none"}, {"name": "dart rnli", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Dramatic Dartmouth whale rescue features on BBC show The dramatic rescue of a humpback whale, which got trapped in whelk pot lines off Start Bay, featured in Tuesday’s episode of the BBC’s Saving Lives at Sea Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nThe rescue of a humpback whale in South Devon featured on the BBC’s show Saving Lives at Sea on Tuesday. \nThe series tells the story of the volunteer lifeboat crews and lifeguards of the RNLI who rescue thousands of people and save hundreds of lives around our coastline and on London’s River Thames every year. It takes viewers right into the heart of the action, capturing the unpredictable work of the charity in never-before-seen detail. \nTuesday night’s episode showed in great detail the rescue of the humpback whale which became tangled in whelk pot lines from a fishing vessel off Blackpool Sands in March this year. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe programme followed the team’s efforts to rescue the 45 foot long, 20 tonne animal, which was feeding off Start Bay for several weeks. \nA team of nine boarded a fishing boat and hauled the whale to the surface to expose its tail and cut the rope tangled around it. \nThe operation took three hours, but ended successfully and the whale was later spotted feeding happily in the area. Read More Forensic teams called in after body ... \nSeveral crew members from Dart RNLI, who were involved in the rescue of the whale, were interviewed on the show, including rookie crew members Katy. \nKaty, who works as a deli assistant, said: “I’m not sure why it was in the area at all. It just appeared and stayed for ages. I think it just liked Dartmouth.” \nThe whale rescue was only Katy’s third ever shout. The rescue of the humpback whale in Start Bay (Image: Facebook/Dart RNLI) \n“I was actually in work about to leave when the alarm went off,” she explained. “I quickly whipped my apron off and I thought about if it would be quicker to take the car or run, and I decided just to run. \n“Chris was there already, and I asked him what was going on, he told me that the whale was stuck. I couldn’t believe it.” \nChris, a commercial skipper and member of the Dart RNLI team, said: “When we got close enough to the whale, the whale rescue guys had asked that we cut the engine. We were actually holding on the pot, and pretty much anywhere you looked around the boat was just whale, so she seemed pretty big in comparison to our boat.” Read More South Devon lifeboat crews to feature on BBC show tonight \nKaty added: “You could just see her coming up every three to five minutes, and then the gap got smaller and she was coming up every two minutes. You could just see netting around it really, and it was obviously very distressed.” \nChris continued: “The whale probably weight from 15 to 20 tonnes, and our boat’s about five-and-a-half metres. \n“To know that animal could swipe you out of the boat with one flick of its tail is terrifying. The rescue of the humpback whale in Start Bay (Image: Facebook/BDMLR) \n“We needed to come up with a better plan which to me meant more man power and maybe a more stable platform.” \nThe fishing boat that radioed in the alarm was still in the area so the crew got on it and continued their rescue from there. \nChris said: “It was a very tense few moments on the boat. It was something we’d never trained for so it was a brand new situation and I think even the marine life divers, although they’re trained in whale rescue, it was probably the first one they’d actually been to. Read More Police warn members of the public ‘not to approach’ injured seal \n“On any job, but especially with animals, you don’t know how they’re going to react, especially when in distress. Things can go wrong very quickly.” \nKaty said: “It felt very tense watching what was going on. It got so close each time, and we just wanted it to happen. \nKevin, a property maintenance worker and member of the Dart RNLI crew, said: “It’s quite an adrenaline burst at the time. I felt quite humbled actually being so close and being able to help such a large animal. Read More Dozens of elusive marine animals have been spotted off the Devon coast this summer as part of a nationwide sea survey \n“Everyone was pulling with all their might, and the whale was surfacing more and more rapidly.” \nKaty finished by saying: “We knew it had been done because it just went. It really went. It felt like a once in a lifetime thing.” Read More How to protect wildlife after Brexit \nChris added: “I think any rescue is very rewarding, but this one was special. And it will always be special.” \nKevin said: “We’ve been on several shouts where we’ve saved lives and done dramatic things, and nothing has ever been said. But all of a sudden after this shout a lot of people have said: ‘I heard you saved the whale’.” Like us on Facebook ", "external_links": [], "published": "2017-09-14T12:30:00.000+03:00", "crawled": "2017-09-14T12:53:57.023+03:00", "highlightTitle": ""}