{"organizations": [], "uuid": "b0bb9de1808d1e84b65d5de2a3c061948e5976c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13662415.ece/ALTERNATES/s1200/DSP_MEN_100616_HAINANAIRLINES48JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/devolution-north-tyne-possible-year-13662368", "country": "GB", "domain_rank": 21960, "title": "Devolution for North of Tyne 'possible this year', says Treasury Minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-22T19:49:00.000+03:00", "replies_count": 0, "uuid": "b0bb9de1808d1e84b65d5de2a3c061948e5976c6"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/devolution-north-tyne-possible-year-13662368", "ord_in_thread": 0, "title": "Devolution for North of Tyne 'possible this year', says Treasury Minister", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "jones", "sentiment": "none"}, {"name": "andrew jones", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "metro", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "metros", "sentiment": "none"}, {"name": "pfi", "sentiment": "none"}, {"name": "invalid email  a treasury", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "private finance initiative", "sentiment": "none"}, {"name": "wear metro", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "north east economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Devolution for North of Tyne 'possible this year', says Treasury Minister Treasury Minister Andrew Jones also said the principle of funding a new Metro fleet was agreed by the Government Share Get business   Thank you for subscribing!   \nA Treasury Minister has said devolution to Newcastle and the surrounding area could happen this year after good progress on talks to switch power from Westminster to the North East . \nExchequer Secretary Andrew Jones said the negotiations with Newcastle, North Tyneside and Northumberland on a ‘north of Tyne’ devolution deal were progressing well, with a deal in 2017 a “real possibility”. \nMr Jones also said that he hoped a deal with three authorities in the North East could see other parts of the region returning to the devolution agenda after councils in Gateshead, Durham, South Tyneside and Sunderland pulled out the devolution process last year over concerns that the Government could not commit to replacing EU funds that have sparked much of the region’s regeneration in recent years. \nSpeaking to the North East Economic Forum, Mr Jones said the Government was now committing to keep funding to regions like the North East going after Brexit, while he also said that the principle of funding a new fleet of Metros had been agreed at Whitehall. \nMr Jones met with business and political leaders in the North East before yesterday’s event and admitted that he had been given a “shopping list” of items from North East as Ministers put together the Government’s spending commitments ahead of the Budget on November 22. Read More Newcastle needs Brexit deal that doesn't undermine its economic growth, leader says \nRegional leaders are pushing for the North East to get increased funding to improve transport and skills, with the region still having one of the highest unemployment rates in the country and the highest level of adults without skills. \nMr Jones said the Government was listening to those calls, but that increased funding from the Government was not the only answer to the challenges facing the North East. \nHe said: “Devolution is about parts of the country owning their own destiny and that really is what the Northern Powerhouse is all about. It’s about feeling that you can shape your own destiny rather than having it done to you. \n“The councils up here are keen, there are conversations happening all the time with them and I hope we can get this over the line.” \nBusiness and political leaders in the North East have come together to call on the Government to fund a £400m new fleet of trains to replace the 37-year-old vehicles used on the Tyne and Wear Metro . Read More Anger as Chris Grayling, transport secretary, says North-South investment gap is a 'myth' \nMinisters are believed to be weighing up whether to fund the new fleet directly or use the Private Finance Initiative to pay for it, though council leaders in the North East are strongly opposed to the use of PFI. \nAsked about funding for new Metros, Mr Jones said: “There is a finite amount of Government capital. If we can bring other sources of capital for projects like this, we can deliver more projects. \n“There’s only so much Government money we can spend and the Government shopping list has to include things like new nuclear, HS2, flood defences and the biggest upgrade to the rail network since the Victorian era. That puts pressure on Government finances so if we can bring other sources of funding to do some things quicker, we’ll do that. \n“It’s not just in the North where we’ll do that. It’s no different to the approach we’ll take in all parts of the country.” Like us on Facebook", "external_links": [], "published": "2017-09-22T19:49:00.000+03:00", "crawled": "2017-09-22T20:39:53.005+03:00", "highlightTitle": ""}