{"organizations": [], "uuid": "a15a9d109adbd22d31beeb60243d4bd9852ae29d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.plymouthherald.co.uk/incoming/article413479.ece/ALTERNATES/s1200/Exmoor4.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/local-news/re-wilding-rebrand-could-help-413257", "country": "US", "title": "A re-wilding rebrand could help engage upland farmers, lively Exmoor debate hears", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-01T18:09:00.000+03:00", "replies_count": 0, "uuid": "a15a9d109adbd22d31beeb60243d4bd9852ae29d"}, "author": "Athwenna Irons", "url": "http://www.devonlive.com/news/local-news/re-wilding-rebrand-could-help-413257", "ord_in_thread": 0, "title": "A re-wilding rebrand could help engage upland farmers, lively Exmoor debate hears", "locations": [], "entities": {"persons": [{"name": "christopher sandom", "sentiment": "none"}, {"name": "david attenborough", "sentiment": "none"}, {"name": "sandom", "sentiment": "none"}, {"name": "rachel thomas", "sentiment": "none"}, {"name": "steve langdom", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "holsworthy", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "martin ryall", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "chris binnie", "sentiment": "none"}, {"name": "flemming", "sentiment": "none"}, {"name": "milton", "sentiment": "none"}, {"name": "george monbiot", "sentiment": "none"}, {"name": "robin milton", "sentiment": "none"}, {"name": "flemming ulf-hansen", "sentiment": "none"}, {"name": "jeremy holtom", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "natural england", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "prince's countryside", "sentiment": "none"}], "organizations": [{"name": "national farmers' union", "sentiment": "none"}, {"name": "exmoor national park authority", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "brendon commons council", "sentiment": "none"}, {"name": "department for environment, food and rural affairs", "sentiment": "none"}, {"name": "exmoor society", "sentiment": "none"}, {"name": "brendon commons council", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "sussex university", "sentiment": "none"}, {"name": "uplands forum", "sentiment": "none"}, {"name": "national parks", "sentiment": "none"}, {"name": "enpa", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "national farmers’ union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Speakers from the National Farmers' Union (NFU), Exmoor National Park Authority (ENPA) and Natural England were among those at the Brendon Commons meeting Share Comments \nCan post-Brexit agricultural policy and an increasing interest in re-wilding bring benefit to Exmoor and its farming community? The Brendon Commons Council recently organised a meeting of Exmoor farmers, land owners and academics to debate the future of upland farming – and an inevitable polarisation of views led to robust and lively discussion. \nThe speakers were National Farmers’ Union (NFU) Uplands Forum chairman, Exmoor National Park Authority chairman and Exmoor farmer, Robin Milton; reporting on recent discussions with the Department for Environment, Food and Rural Affairs (Defra) as the government endeavours to shape future agricultural policy; Flemming Ulf-Hansen from Natural England and re-wilding expert Dr Christopher Sandom, from Sussex University. \nOpening the debate, Brendon Commons council secretary, Jeremy Holtom, warned of the effects of climate change and globalisation of trade on upland farming and pointed out that the Exmoor commons are enriched with natural capital and wedded to the farmsteads that surround them. Exmoor farmer Robin Milton said upland farming delivers huge public benefits and its biggest influence is in trade (Image: Robin Milton) \n“Re-wilding is ‘one-sided’ and that cultural severance from the commons represents a threat if people ‘disconnect’ from the landscape and how their food gets onto the table,” he said. “If farming of the commons stops, then the knowledge of how to do it will be lost.” \nENPA Chairman, Robin Milton, fresh from discussions with the Defra policy team, gave a candid report on developments in shaping UK agricultural policy following Brexit. “In the recent period, politicians have been playing political games and manoeuvring and have ended up back where they started, with less influence. It’s time for farmers to challenge them,” said Mr Milton. \n“The UK is the second biggest economy in the EU and we need to be making more of that. Upland farming delivers huge public benefits and its biggest influence is in trade. The majority of the sheep currently go abroad – we are the basis of the sheep system, we provide quality food and we deliver landscape value. This includes some of the most productive dairy farmers in the country. All this has fantastic value and we must highlight that, not ‘doom and gloom’. Read More West livestock handlers add to season's haul at 121st Holsworthy and Stratton Show \n“Much of the [subsidy] money currently goes to the arable sector and large land owners – is that an appropriate use of public money?” \nMr Milton thinks that the Countryside Stewardship Scheme is not appropriate for upland farmers and they should instead be looking for a long-term, sustainable package. “Proposals are being put together that are based on Farmed Landscape and any scheme should be payable to those actually farming – not just to the land owner,” he commented. \nHe went on to advise that the way forward is negotiating with upland farming's natural capital and says there is always a place for environmental delivery for areas that are important. “There are not many votes in the countryside so upland farmers must be bold and go to the ministers - both Defra and the Treasury - and justify why they need support. The Brendon Commons Council organised the recent meeting of Exmoor farmers, landowners and academics \n“There is currently a degree of uncertainty as the government is only guaranteeing levels of farming subsidies for ‘the term of this Parliament’, whatever that is. We must feed suggestions into the policy-making now.” \nMr Milton recently met with new Environment Secretary Michael Gove and his team and thinks that Michael Gove will be quite radical in his thinking. \nFlemming Ulf-Hansen, from Natural England, is in favour of public money funding long-term initiatives run by National Parks and collaborative groups, such as land owners and farmers, who should be encouraged to take local responsibility with projects such as creating woodland and improving flood and pasture management. He said areas of non-farmed land also need to be embraced within new environment schemes – and for the long term. Read More Devon's Jersey Girls are stars of show at national youth competition \nNatural England is working closely with Defra and, although at this stage Flemming does not know what the schemes will be like, options being looked at include ‘Payment By Results’ and ‘Tendering’ – which are currently being tested with pilot schemes. “Most money currently goes to arable areas and it would be interesting to get more money into wildlife areas,” he said. \nDr Christopher Sandom, from Sussex University, looked at a range of re-wilding case studies across the UK, including the re-establishment of wetlands using beavers in Devon. He described re-wilding as “restoring natural processes for the benefit of nature, society and the economy”, and said that “letting nature take its course” resulted in regeneration of habitat at various sites across the UK and substantially reduced the maintenance work required. \n“While re-wilding can increase and regenerate habitat and forestry, produce positive carbon and reduce flooding and greenhouse gases – there are the risks of reducing biodiversity and loss of tourism and cultural landscape,” commented Dr Sandom. “There are also human / animal conflict and welfare issues, as large and potentially dangerous animals like wolves, lynx and wild boar meet people, and animals are left to their own devices to live and die. Exmoor ponies in the distance on Brendon Commons \n“It is a challenge to society and finding the right balance and there are winners and losers. There are opportunities for people who want to do things differently – to evolve and change things.” \nBut Dr Sandom acknowledges the concept can cause problems and conflict in rural communities – particularly with more controversial aspects such as the re-introduction of predators like wolves. \nDunkery Commons grazier Chris Binnie said that introducing wolves to Exmoor would be of “serious detriment” to moorland farming stock and wildlife – resulting in farmers being unable to operate and derive the necessary income, which would also have an impact on food production. Read More Ford tractor enthusiasts to gather in Devon for 100th anniversary celebrations \nExmoor Society president, Rachel Thomas, highlighted the small scale of Exmoor, running at only twelve miles from North to South, and said that “Exmoor is nice as it is”. \nDr Sandom’s response was that people all over the world live near to dangerous animals, without eradicating those species, and suggests that the concept is something people will have to question and consider. \nMr Milton then reminded everyone of an interview between journalist George Monbiot and Sir David Attenborough. When they discussed re-wilding, Sir David commented that if wolves were going to be introduced, the UK population would have to be reduced by two thirds first – and that when you allow people into those areas “then all the problems will arise”. Exmoor's upland farming plays an important role in its cultural heritage and landscape, along with food production \nDr Sandom stressed: “You would need to find the right location and a group of people willing to maximise the opportunity – who will invest in a major change in the landscape over 100 years and make it work.” \nFarmer Martin Ryall added: “There is a need for a local solution rather than a nationally-presented solution. We need to decide locally what is good for Exmoor using experience – and working with people like Dr Sandom.” \nDr Sandom couldn’t agree more and thinks locally driven projects are the way forwards and that the government needs to support more schemes like that. Read More Small farms in Devon and Cornwall invited to take part in Prince's Countryside Fund scheme \nOverall there was positivity on aspects of re-wilding from the Exmoor farming community. However, farmer Steve Langdom suggested that looking at it as ‘regeneration of the habitat’ rather than ‘re-wilding’ may be more likely to interest and engage farmers and the local community. \nIf post-Brexit agricultural policy can be shaped to recognise and support the important role that upland farming plays in cultural heritage and cultural landscape, along with quality food production – while encouraging and rewarding the regeneration of moorland habitats – a compromise may well be reached that moves further towards suiting everyone; farmers, land owners, conservationists and the general public alike. Like us on Facebook", "external_links": [], "published": "2017-09-01T18:09:00.000+03:00", "crawled": "2017-09-01T19:13:54.000+03:00", "highlightTitle": ""}