{"organizations": [], "uuid": "e5df5d3d91b92ac9955c247b6ddd5b901cc14089", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13605552.ece/ALTERNATES/s1200/IBP_NEC_080617election_16JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mp-explains-voted-13605496", "country": "GB", "domain_rank": 21960, "title": "North East MP explains why she voted against the European Union Withdrawal Bill", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-12T07:00:00.000+03:00", "replies_count": 0, "uuid": "e5df5d3d91b92ac9955c247b6ddd5b901cc14089"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mp-explains-voted-13605496", "ord_in_thread": 0, "title": "North East MP explains why she voted against the European Union Withdrawal Bill", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "caroline flint", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "edward leigh", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "edward", "sentiment": "none"}, {"name": "henry viii", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "flint", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european union withdrawal bill north east", "sentiment": "negative"}, {"name": "european union withdrawal bill labour", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "yorkshire labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nottinghamshire", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East MP explains why she voted against the European Union Withdrawal Bill Labour says it opposed Brexit legislation because it would let Government Ministers ignore Parliament Share Click     Thank you for subscribing!   \nThe Conservatives have been accused of using Brexit as an opportunity to scrap or water down employment rights and consumer protection. \nNewcastle North MP Catherine McKinnell said she was opposing the Government’s European Union (Withdrawal) Bill, also known as the Repeal Bill, because it would give the Government the power to make “sweeping changes” without requiring a vote in Parliament. \nTempers frayed during a heated debate about the legislation in the House of Commons. A Union Jack flies with the European Union flag (Image: Getty Images Europe) \nThe Tory Government is proposing the legislation, which prevents the EU enforcing its legislation in the UK after Brexit, but also brings existing European legislation into UK law so that they can be enforced by British courts. \nLabour leader Jeremy Corbyn ordered his MPs to oppose the Bill, on the grounds that it also gives Ministers the powers to modify the European laws. The Government says it needs this power because some EU laws won’t make sense after Brexit unless they are changed. \nHowever, Mr Corbyn faced a rebellion from a small number of backbenchers. Caroline Flint, a Yorkshire Labour MP and former Europe Minister, said she was abstaining on the legislation and faced heckles from Labour colleagues as she told the House of Commons that the measures in the Bill were essential “unless your ambition is to thwart the result of the EU referendum and prevent or delay the UK leaving the EU”. \nThere are also rebels on the Conservative side, such as Nottinghamshire MP Anna Soubry. They are planning to attempt to amend the Bill when they have a chance to propose changes in future debates, rather than voting against it at this stage. \nMs McKinnell, a Labour MP , said the Bill would place too much power in the hands of Government Ministers. Newcastle North, Labour MP Catherine McKinnell (Image: Newcastle Chronicle) \nShe said: “Regardless of how people voted last year, there are now serious concerns about existing rights and protections being watered down or weakened as a result of the Government’s approach to leaving the EU – whether employment rights, environmental legislation, consumer protection or human rights. \n“This Bill would give Ministers in a minority Government the power to make sweeping changes, without any real scrutiny or accountability by Parliament. \n“The Prime Minister has no mandate to do this, and it is far from the ‘taking back control’ that people were led to believe they were voting for last year.” \nMs Flint suggested Labour MPs voting against the Bill should learn more about working class pro-Brexit constituencies such as the one she represents. Read More What is the EU withdrawal bill and why is it so controversial? \nShe told the Commons: “I voted and campaigned for the UK to remain. \n“Not in a metropolitan city or university town, but in a seat where I knew the Leave vote was the likely outcome. \n“I welcome colleagues who weren’t campaigning in such seats to visit mine.” \nConservative MP Sir Edward Leigh provoked laughter as he referred to the powers the Bill will grant to the Government, which are known as Henry VIII powers after the Tudor king who imposed his will on Parliament. \nSir Edward said: “We’ve heard a lot about Henry VIII, when I was a rebel I used to care about these things. Read More \n“Now I’m a loyalist, I let the Government get away with it in so many ways. \n“I mean, Henry VIII is a bastard, but he’s my kind of bastard.” \nThe debate was expected to last until midnight. It was set to be followed by a vote on the Second Reading of the Bill. \nAt this stage, MPs can only vote for or against the legislation. However, in later debates it will be possible to propose and vote on amendments, and this would provide a chance for MPs to reduce the powers the Bill gives to the Government without throwing it out entirely. Like us on Facebook", "external_links": [], "published": "2017-09-12T07:00:00.000+03:00", "crawled": "2017-09-12T08:13:08.000+03:00", "highlightTitle": ""}