{"organizations": [], "uuid": "092e3fa39bc519e607917314043c4215cf3c7eb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13639576.ece/ALTERNATES/s1200/Liberal-Democrats-annual-conference-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/second-brexit-vote-fighting-terrorism-13639329", "country": "GB", "domain_rank": 21960, "title": "A second Brexit vote, fighting terrorism and better army pay - Liberal Democrats reveal new policies", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-19T00:00:00.000+03:00", "replies_count": 0, "uuid": "092e3fa39bc519e607917314043c4215cf3c7eb3"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/second-brexit-vote-fighting-terrorism-13639329", "ord_in_thread": 0, "title": "A second Brexit vote, fighting terrorism and better army pay - Liberal Democrats reveal new policies", "locations": [], "entities": {"persons": [{"name": "vince cable", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "chloe rutherford", "sentiment": "none"}, {"name": "liam curry", "sentiment": "none"}], "locations": [{"name": "bournemouth", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "birmingham yardley", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "solihull", "sentiment": "none"}], "organizations": [{"name": "liberal democrats", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "lib dems", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLiberal Democrats have been setting out the policies they hope will make them a major force in British politics again, at their annual conference in Bournemouth. \nParty leader Sir Vince Cable said it was “perfectly plausible” he could become the UK’s next Prime Minister, in a BBC interview over the weekend. \nBut what are the Lib Dems offering? For a start, they want to give the UK a chance to reverse Brexit and stay in the European Union after all, by having a second referendum. \nHowever, they also have plans to fight terrorism, stop young people joining gangs and ensure businesses do more to help society. \nHere are some of the policies put forward at the Lib Dem conference: A new approach to fighting terrorism \nLiberal Democrats say they oppose cuts in funding to the police, and want “proper funding of community policing” to fight against terrorism and violent extremism. \nThey are also want to scrap a Government programme called Prevent, which is intended to stop people becoming drawn to extremist ideas, joining extremist groups and carrying out terrorists activities. \nLib Dems say they will “scrap the Prevent Strategy, and replace it with a new programme called Engage - an inclusive community engagement strategy that would support communities to lead in developing their own approach to tackling the dangers of violent extremism”. Read More Prime Minister Theresa May accused of ignoring families of Chloe Rutherford and Liam Curry Tougher fire safety rules to prevent another Grenfell \nThis includes tougher rules now, such as all blocks over four stories to have annual fire checks by persons on a professional register, and also a complete review of building regulations. \nThe review would look at the use of sprinklers and cladding in tower blocks, and more. Offering another referendum on Brexit \nLiberal Democrats want to hold a referendum on whether to go ahead with Brexit - or to stay in the EU after all. \nThis would take place when the full terms of the deal Theresa May’s government is negotiating with the EU are known. \nLib Dems say the public will be offered “an opportunity to exit from Brexit” under their plans. Better pay for the armed forces \nLiberal Democrats have called on the government to immediately lift the pay cap on the armed forces. \nCurrently, a newly trained private on £18,488 would see a £351 real-terms pay cut next year, once inflation is taken into account. The Liberal Democrats say they would would raise wages in line with inflation, meaning a newly trained private would get a pay rise of £536 up to just over £19,000. Read More Government bows to pressure to offer police a better salary increase - but who will pay for it? Protecting the environment \nLiberal Democrats want “a tough new watchdog” to protect the environment from what they say are threats posed by Brexit. \nThey are calling for the creation of an Office for Environmental Responsibility that would ensure laws on air quality or the cleanliness of beaches are properly enforced. Fighting gangs \nThe Lib Dem conference on Tuesday will discuss proposals to offer more funding for community organisations which try to prevent young people joining gangs, and to provide mentoring and training in conflict resolution for people aged 18 and under. \nThey will also discuss proposals for regular amnesties “to provide a safe time to turn over guns and knives”. Better businesses \nLib Dems want the UK to have more businesses which aren’t focused entirely on making profits. For example, that would mean more mutuals and co-operatives. \nThey also want firms to publish data about the number of employees paid less than the living wage, and to reveal the ratio between the highest pay in the company and the “median” pay. \nFor example, this could reveal whether the chief executive was paid twice as much, ten times as much or 100 times as much as ordinary employees. While it wouldn’t directly affect what anyone was paid, it might shame some businesses into offering staff a better deal. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe Lib Dems also want workers to be represented on the boards that govern companies. And they want to change the law so that directors have a legal obligation to consider the long-term interests of the company and its employees, suppliers, customers, the community and the environment, rather than simply acting in the best interests of shareholders. \nLib Dems would also establish an explicit “public interest” test when considering approvals for takeovers of large or strategically significant companies by overseas-based owners. In practice, this could make it harder for foreign firms to take over major British businesses unless they could demonstrate it was in the public interest to let the takeover go ahead. Why the Liberal Democrats are in trouble \nThe Liberal Democrats have suffered a dramatic decline. \nThey were in power from 2010 to 2015, as junior members of the Coalition government. \nAnd they could claim to have widespread support. In the 2010 General Election they got 23 per cent of the vote, while Labour wasn’t that far ahead on 29 per cent and the Tories won 36.1 per cent. \nThe Liberal Democrats were clearly the third party, but they were in the same league as Labour and the Conservatives. \nThey also had two MPs in the West Midlands, in Birmingham Yardley and in Solihull. \nThat’s all changed. In June’s general election they won 7.4 per cent of the national vote. \nThey have just 12 MPs across the country, out of 650 in the House of Commons. And there are no Lib Dem MPs at all in the West Midlands. \nBut new leader Vince Cable hopes to turn Lib Dem fortunes around. \nAnd the party has used its conference, taking place in Bournemouth this week, to highlight its policies. Like us on Facebook", "external_links": [], "published": "2017-09-19T00:00:00.000+03:00", "crawled": "2017-09-19T02:32:24.000+03:00", "highlightTitle": ""}