{"organizations": [], "uuid": "f11a20a7f2aca3dd5d72d81826bf388ee99ef25a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/news/article435838.ece/ALTERNATES/s1200/Sea-fans.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/how-protect-wildlife-after-brexit-435637", "country": "US", "title": "How to protect wildlife after Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-06T19:36:00.000+03:00", "replies_count": 0, "uuid": "f11a20a7f2aca3dd5d72d81826bf388ee99ef25a"}, "author": "Keith Rossiter", "url": "http://www.devonlive.com/news/how-protect-wildlife-after-brexit-435637", "ord_in_thread": 0, "title": "How to protect wildlife after Brexit", "locations": [], "entities": {"persons": [{"name": "michael gove", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "mike markey", "sentiment": "none"}, {"name": "richard yorke", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "barton", "sentiment": "none"}, {"name": "harry barton", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "devon wildlife trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How to protect wildlife after Brexit Write to your MP Click to play Tap to play The video will start in 8 Cancel Play now Share \nLast chance to have your say on wildlife protection after Brexit. \nHarry Barton, chief executive of Devon Wildlife Trust, is urging voters to contact their MPs ahead of next Monday’s vote on the European Union (Withdrawal) Bill. \nBehind the scenes, crucial decisions are being made in Westminster right now that could shape the future of our wildlife and natural heritage for a generation. \nThe European Union (Withdrawal) Bill is beginning its journey through Parliament. The Bill will receive its second reading over the next few days, before it is expected to become law later in the year. \n\"Everyone who wants our children and grandchildren to inherit a natural world that is not an impoverished version of what we see today needs to be concerned,\" Mr Barton said. A scallop on the seabed (Image: Richard Yorke and Mike Markey) \n\"Most of the existing laws that protect our wildlife and environment are tied to our membership of the European Union. This includes our strongest protection for special wildlife sites and effective regulations on pollution of our seas and rivers. \n\"The act of leaving the European Union will create huge gaps in these crucial safeguards unless something at least as comprehensive and effective is created to take their place. \n\"We know that our wildlife is continuing to decline, despite a lot of good progress. This is true whether you look at groups of species, such as birds or plants, or at particular habitats on land or in our seas. The obvious conclusion is that our existing protections don’t go far enough and they’re not always enforced strictly enough. If we want to reverse the decline, more of the same isn’t good enough. We need better, and soon. \n\"Environment Secretary Michael Gove has recently made some encouraging statements about the government’s commitment to environmental legislation. And it is fair to say that there is a lot to welcome in the Withdrawal Bill. But there is a lot that is less heartening too.\" \nHe said there was no guarantee that all the EU environmental principles will be incorporated in the new UK-based laws. Read More Devon fishing fleet's chance to have say on state of the industry \n\"Laws are only effective if they are enforced and if there is come-back on those who transgress them. Yet there is currently no guarantee that there will be public bodies that are funded and empowered to police any new laws and follow up appropriately when they aren’t. \n\"Thirdly, and worryingly for democracy, the Bill gives the government lots of powers to change laws without having to consult parliament. This could mean that important laws are amended, weakened or even abolished without the public even knowing about it.\" \nMr Barton added: \"The Withdrawal Bill gives us a unique chance to come up with something even better that the existing EU protections. We have an opportunity to tell our legislators that we think people in Devon, the South West and all across the UK deserve a world-class environment: clean air, clear water, a stable climate, healthy seas and thriving wildlife in the places we love. Let’s grasp it.\" \nTo find out how you can influence this debate visit www.wildlifetrusts.org/RepealBill What the wildlife trust wants to see in the Repeal Bill \n1. All current EU wildlife and environment laws brought across in to UK law \n2. Any future potential changes to these laws checked and debated by Parliament • Clauses 7-9 and 17 of the Repeal Bill give the Government lots of powers to legislate or de-legislate by Statutory Instrument• According to the Repeal Bill, they could justify this on the grounds of a “failure to operate effectively” or “any other deficiency” “arising from withdrawal”. But these terms are not defined.• This could mean that Ministers or civil servants weaken those wildlife laws we do retain without involving Parliament: a Minister under pressure from a developer could unilaterally remove vital wildlife protections, which we have spent decades securing. \n3. Wildlife and environment laws must be enforced and upheld • Currently the European Commission keeps an eye on the UK Government to check it is implementing and enforcing environmental law.• Although the Bill gives the Government the power to pass these functions to new or existing public bodies (clause 7(5)), it is not obliged to do so.• We think that all the functions carried out by EU institutions in relation to environmental protection should be passed to well-funded public bodies after Brexit. \n4. All EU environmental principles transferred to UK law It is not clear that key environmental principles will be carried over in any form through the Bill. This would greatly weaken wildlife protection. \nThe three big EU environmental principles are:- Those who pollute the environment pay for repairing the damage (the ‘Polluter Pays’ principle)- Economic development happens in a way that looks after our natural resources for future generations (the ‘Sustainable Development’ principle)- When an activity puts the health of humans or the environment at risk, action must be taken to deal with this, even if the science is not 100% clear (the ‘Precautionary Principle’) Like us on Facebook", "external_links": [], "published": "2017-09-06T19:36:00.000+03:00", "crawled": "2017-09-06T20:00:06.001+03:00", "highlightTitle": ""}