{"organizations": [], "uuid": "fcc2ebcabd91133c44d5d012604a1155abc428cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i4.leicestermercury.co.uk/incoming/article502456.ece/ALTERNATES/s1200/pjimage-1.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/sport/football/transfer-news/live-leicester-city-news-transfer-501981", "country": "US", "domain_rank": 48128, "title": "Live Leicester City news and transfer rumours: Liverpool reaction - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.596, "site_type": "news", "published": "2017-09-20T19:26:00.000+03:00", "replies_count": 0, "uuid": "fcc2ebcabd91133c44d5d012604a1155abc428cb"}, "author": "Martin Crowson", "url": "http://www.leicestermercury.co.uk/sport/football/transfer-news/live-leicester-city-news-transfer-501981", "ord_in_thread": 0, "title": "Live Leicester City news and transfer rumours: Liverpool reaction - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "harry maguire", "sentiment": "none"}, {"name": "ben hamer", "sentiment": "none"}, {"name": "matthew lewis/getty images", "sentiment": "none"}, {"name": "jules", "sentiment": "none"}, {"name": "jamie vardy", "sentiment": "none"}, {"name": "drinkwater", "sentiment": "none"}, {"name": "leo ulloa", "sentiment": "none"}, {"name": "arsene wenger", "sentiment": "none"}, {"name": "shinji", "sentiment": "none"}, {"name": "okazaki", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "shakey", "sentiment": "none"}, {"name": "rob tanner", "sentiment": "none"}, {"name": "leonardo ulloa", "sentiment": "none"}, {"name": "lionel messi", "sentiment": "none"}, {"name": "danny drinkwater", "sentiment": "none"}, {"name": "islam slimani", "sentiment": "none"}, {"name": "iborra", "sentiment": "none"}, {"name": "silva", "sentiment": "none"}, {"name": "shakespeare", "sentiment": "none"}, {"name": "craig shakespeare", "sentiment": "none"}, {"name": "vicente iborra", "sentiment": "none"}, {"name": "james sharpe", "sentiment": "none"}, {"name": "eibar", "sentiment": "none"}, {"name": "aleksandar dragovic", "sentiment": "none"}, {"name": "shinji okazaki", "sentiment": "none"}, {"name": "slimani", "sentiment": "none"}, {"name": "alex oxlade-chamberlain", "sentiment": "none"}, {"name": "dragovich", "sentiment": "none"}, {"name": "vote slimani", "sentiment": "none"}, {"name": "vardy", "sentiment": "none"}, {"name": "jurgen klopp", "sentiment": "none"}, {"name": "adrien silva", "sentiment": "none"}, {"name": "jordan blackwell", "sentiment": "none"}], "locations": [{"name": "leicester city", "sentiment": "none"}, {"name": "iborra", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "king power stadium", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "bournemouth", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "shinji okazaki  leicester city", "sentiment": "none"}, {"name": "chilwell", "sentiment": "none"}, {"name": "mercury", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "negative"}, {"name": "getty images) news shinji", "sentiment": "none"}, {"name": "getty images", "sentiment": "none"}, {"name": "reds", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "st georges", "sentiment": "none"}, {"name": "nick potts/pa wire golden goal happy", "sentiment": "none"}, {"name": "getty images) breaking news blackwell", "sentiment": "none"}, {"name": "king power stadium", "sentiment": "none"}, {"name": "plumb images/leicester city fc", "sentiment": "none"}, {"name": "tottenham", "sentiment": "none"}, {"name": "morgan", "sentiment": "none"}, {"name": "sevilla", "sentiment": "none"}, {"name": "nou camp", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "anfield", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "liverpool shinji okazaki", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "liverpool  leicester city", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now \nLeicester City go into the fourth-round draw tonight for the Carabao Cup after last night's victory over Liverpool. \nGoals from Shinji Okazaki and Islam Slimani - and what a special one it was - secured victory. \nLiverpool had enjoyed more than 75 per cent possession in the first-half, but could not get the breakthrough. \nThe game changed with the introduction of Shinji Okazaki early in the second-half after Leonardo Ulloa limped off injured. Read More Leicester City 2-0 Liverpool: Shinji Okazaki praised for performance \nHis goal then gave City something to hang on to until Slimani popped up with that great strike to seal it. \nWe'll also have any news on Adrien Silva, who was at the game last night after returning from Portugal. \nTo have your say on any of today's stories, get in touch on Facebook or Twitter . Video \nBen Hamer on last night’s victory over Liverpool. Poll Slimani is feeling the love \nAlgerian striker Islam Slimani is feeling the love on our ‘player of the match poll’ after his stunning winning goal against Liverpool. \nBut it’s as close as a Brexit vote at the minute with Okazaki, Morgan, Gray, Dragovich, Chilwell and Iborra all within one mark of taking the lead. \nIf you want to influence the result - and how close it is, get involved. Islam Slimani curls the ball into the back of the net to make it 2-0 during the Carabao Cup third round match between Leicester City and Liverpool at King Power Stadium. (Photo by Plumb Images/Leicester City FC via Getty Images) Breaking News Blackwell's return confirmed by Ryanair \nBREAKING NEWS: For those of you following the case of my colleague Jordan Blackwell, who is on holiday in Barcelona and due to come home on a Ryanair flight, he has just confirmed via a Facebook message, that his flight has NOT been cancelled and he will return to Leicester as planned. \nTherefore, the sports desk’s statistician and Excel spreadsheet specialist will be back on Live Blog duties next Monday. Ryanair planes \nRyanair planes line up at Barcelona airport to bring Mercury reporter Jordan Blackwell back for his Monday shift News The Ox gets a pasting online \nPoor Alex Oxlade-Chamberlain is getting a pasting online for his performance for Liverpool in their loss at Leicester City last night. \nThe Reds’ new signing (pictured right) was taking his fair share of the blame for Liverpool’s third consecutive away defeat to Leicester. \nIn one particularly stinging attack, fans’ website www.rushthekop.com said he had an ‘absolute stinker’ \nIt continued: “It should have been so different. The £40m man should have rocked up and held up two fingers to the world, his Arsenal detractors and anyone who said he couldn’t play in a central role. \n“But he didn’t. To the doubters, this confirmed their doubts. To the supporters, this wavered their support. To the Reds fans, it knocked them out the League Cup. \n“On the basis of that performance, Gunners boss Arsene Wenger was laughing all the way to the bank and Anfield boss Jurgen Klopp was looking for a shoulder to cry on.” \nOuch! Harry Maguire (left) and Alex Oxlade-Chamberlain during an England training session at St Georges' Park. Photo by Nick Potts/PA Wire Golden Goal Happy birthday to a star striker \nThere’s never NOT a reason to show this goal again. \nHappy birthday Jules. \nHe had some serious wheels didn’t he? News City boss on new boys: 'They got better as the game went on' \nLeicester City boss Craig Shakespeare was pleased with two debutantes in the club’s 2-0 Carabao Cup win over Liverpool last night. \nAustrian Aleksandar Dragovic and Spaniard Vicente Iborra started for the first time since joining the club and were on the winning side as Leicester went through to the last 16 of the competition. \nBoth took their time to get used to the pace of the game but Shakespeare believed they both got better as the game wore on. \n“I think they needed the game time,” he said. “You could see the experience they have both got.” Vicente Iborra is on his way back to fitness and will play in the under-23s tonight. (Photo by Plumb Images/Leicester City FC via Getty Images) News Shinji silences doubters after showing in Liverpool victory \nReporter James Sharpe looks at five talking points from last night’s 2-0 win over Liverpool Shinji Okazaki celebrates scoring the opening goal for Leicester City against Liverpool at King Power Stadium in the Carabao Cup (Image: LINDSEY PARNABY/AFP/Getty Images) Video \nLeicester City manager Craig Shakespeare describes last night’s win. TWEET Ben Hamer was happy with the victory over Liverpool! TWEET Iborra was happy with his debut against Liverpool \nLeicester City’s summer signing Vicente Iborra made his debut last night against Liverpool and gradually worked his way into the game. \nThe former Sevilla midfielder was also happy with the game and tweeted his thoughts in both English and Spanish for all his followers. NEWS What's the latest on Adrien Silva? \nLeicester City boss Craig Shakespeare was asked last night if there were any further developments on the saga of Adrien Silva and his £22million move to the club. \nThe answer was “no”, but Silva was at the King Power Stadium for the Liverpool game after returning from Portugal following time with his family. \nLet’s hope for some good news soon - and let’s hope Shakey gets to announce the news as he has had to front up the difficult situation so far and it’s not really his problem. Adrien Silva ahead of the Carabao Cup third round match between Leicester City and Liverpool at King Power Stadium. (Photo by Plumb Images/Leicester City FC via Getty Images) TRIVIA Was there a better place to be than the King Power Stadium last night? \nWhile most of us were slumming at the King Power Stadium last night, the man who often does this blog was living the high life. \nMy colleague Jordan Blackwell was living the dream at the Nou Camp watching Barcelona beat Eibar 6-1 as Lionel Messi scored four times. \nThe only problem is that he is due back at work on Monday and is flying by Ryanair. VOTE Slimani, Vardy, Drinkwater - which Liverpool goal was the best? \nIslam Slimani’s super goal to seal victory against Liverpool last night was a special effort - smashing the ball into the top corner from the edge of the penalty area. \nBut was it better than Jamie Vardy’s long-range volley in the 2015/16 season? Or Danny Drinkwater’s volley against Liverpool the following season? Islam Slimani curls the ball into the back of the net to make it 2-0 during the Carabao Cup third round match between Leicester City and Liverpool at King Power Stadium. (Photo by Plumb Images/Leicester City FC via Getty Images) INFO When is the draw for the next round? \nThere’s still plenty of big names left in the Carabao Cup despite Leicester City’s dispatching of Liverpool last night. \nTottenham are already through and Arsenal, Manchester United, Manchester City and Chelsea all play tonight. \nIt might also be nice to avoid a midweek night trip to either Middlesbrough or Bournemouth, who both won their ties last night. \nHere our guide to the draw, when it’s on TV and what channel. VIDEO Here's Shakespeare singing the praises of Shinji - not literally, it's not that interesting REACTION Here's the verdict on the Liverpool victory \nManager Craig Shakespeare may have rightly singled out Shinji Okazaki for praise - bit what a goal from Islam Slimani to settle the game, nerves and the Carabao Cup tie. \nIn his big match verdict , my colleague Rob Tanner gets pretty excited about the goal LEICESTER, ENGLAND - SEPTEMBER 19: Islam Slimani of Leicester City celebrates scoring his sides second goal during the Carabao Cup Third Round match between Leicester City and Liverpool at The King Power Stadium on September 19, 2017 in Leicester, England. (Photo by Matthew Lewis/Getty Images) REACTION Delight at performance of Shinji Okazaki \nLeicester City boss Craig Shakespeare singled out Shinji Okazaki for special praise after his goal-scoring performance against Liverpool. \nThe Japan international came on early in the second-half for the injured Leo Ulloa and transformed the game. Here is what Shakey had to say . And don’t you just love Shinji’s smile. Shinji Okazaki celebrates after scoring to make it 1-0 during the Carabao Cup third round match between Leicester City and Liverpool at King Power Stadium. (Photo by Plumb Images/Leicester City FC via Getty Images) MAN OF MATCH Your chance to vote for Leicester City man of the match ", "external_links": [], "published": "2017-09-20T19:26:00.000+03:00", "crawled": "2017-09-20T19:49:48.007+03:00", "highlightTitle": ""}