{"organizations": [], "uuid": "2050b7b413c88394e523106b4c33a59395b9fd4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13198770.ece/ALTERNATES/s1200/IMG_4061-1JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13679729", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-27T08:32:00.000+03:00", "replies_count": 0, "uuid": "2050b7b413c88394e523106b4c33a59395b9fd4f"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13679729", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Busy on the Felling Bypass \nThere’s congestion on the A184 Felling Bypass eastbound from Gateshead Highway to Heworth Roundabout. 14:55 KEY EVENT Woman in 70s flown to hospital after crash \nAn elderly woman has been airlifted to hospital with serious injuries after a collision near Consett. (Image: The Great North Air Ambulance Service) \nAn air ambulance was called to Corbridge Road outside the Hat and Feathers pub in Medomsley Edge just after 9am on Wednesday to reports of a crash. \nThe woman, who is said to be in her 70s, was assessed and treated at the scene by paramedics from the Great North Air Ambulance Service before being flown to the Royal Victoria Infirmary in Newcastle within 11 minutes. \nShe arrived in a serious but stable condition. \nCrews from the North East Ambulance Service and the County Durham Fire and Rescue Service were also in attendance. 14:26 Katie Collings Slow in Sunderland \nThere’s congestion on the A1231 St Michael’s Way between Livingstone Road Roundabout and Durham Road Roundabout. Politics Tom Eden Jeremy Corbyn's conference speech \nThe centre of gravity in British politics has shifted to make Labour the party of “mainstream” voters, Jeremy Corbyn has claimed. \nIn his keynote speech to Labour’s annual conference in Brighton, Mr Corbyn declared that Labour was ready for government and urged Theresa May to call another snap election to put him into Downing Street. \nBuoyed by loud chants of “Oh Jeremy Corbyn” which delayed the start of his address, the Labour leader said that a “new consensus” had emerged a decade after the financial crash of 2008, with voters ready for “something different and better”. \nThe Grenfell Tower fire which killed 80 in west London in June was the symbol of a “degraded” political system which had dominated Britain for a generation, and which Labour was now ready to sweep away, he said. \nTo fervent applause, he promised to end the public sector pay cap, close the gender pay gap, tackle inequality, renationalise utilities, rebuild the NHS and invest in the economy. \nAfter a four-day conference characterised by optimism and largely free of the infighting seen in his first two years as leader, Mr Corbyn said it was clear that Labour had achieved unity and “left our own divisions behind”. \nHe told activists that Labour now needed to show that it had the “credible and effective” plans and the competence needed to deliver “socialism for the 21st century, for the many, not the few”. \nAnd in a message to those who backed Labour on June 8, he said: \n“We offered an antidote to apathy and despair. Let everyone understand - we will not let you down. \n“Because we listen to you, because we believe in you. Labour can and will deliver a Britain for the many, not just the few.” \nDenouncing the Government’s “bungling” of Brexit negotiations, Mr Corbyn claimed Theresa May and her ministers were “hanging on by their fingertips”, and mocked the Prime Minister’s “strong and stable” election slogan. \n“This is a deeply divided Government with no purpose beyond clinging to power,” he said. “It’s Labour that’s now setting the agenda.” \nAnd recalling Mrs May’s decision to call a snap election during a hiking trip in Snowdonia, he challenged the Prime Minister: \n“Take another walking holiday and make another impetuous decision. The Labour campaign machine is primed and ready to roll.” More On ", "external_links": [], "published": "2017-09-27T08:32:00.000+03:00", "crawled": "2017-09-27T09:45:44.015+03:00", "highlightTitle": ""}