{"organizations": [], "uuid": "b67957fbdac51d3e9971d5145506990d5749f125", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13571982.ece/ALTERNATES/s1200/JS129585421.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/cake-decorator-sees-headcount-fall-13571919", "country": "GB", "domain_rank": 21960, "title": "Cake decorator sees headcount fall by 36 amid year of cost cutting", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-04T18:59:00.000+03:00", "replies_count": 0, "uuid": "b67957fbdac51d3e9971d5145506990d5749f125"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/cake-decorator-sees-headcount-fall-13571919", "ord_in_thread": 0, "title": "Cake decorator sees headcount fall by 36 amid year of cost cutting", "locations": [], "entities": {"persons": [{"name": "ahington", "sentiment": "negative"}, {"name": "keogh", "sentiment": "none"}, {"name": "simon keogh", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eileen grace", "sentiment": "none"}, {"name": "culpitt", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "culpitt", "sentiment": "none"}], "organizations": [{"name": "culpitt limited", "sentiment": "negative"}, {"name": "queen’s awards for enterprise  culpitt", "sentiment": "none"}, {"name": "eileen grace limited", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cake decorator sees headcount fall by 36 amid year of cost cutting Ahington's Culpitt Limited said it had been working to 'reduce overhead costs' during 2016 Share Some of Culpitt products in use Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe number of staff employed at award-winning cake decorating business Culpitt Limited fell by nearly a quarter last year as the firm carried out a major cost cutting exercise. \nCulpitt saw its workforce fall from 156 members of staff to just 120 during the 2016 calendar year. \nThe biggest fall in headcount was in the firm’s management and administration team, which saw its numbers drop from 60 to 25. \nThe Ashington-headquartered business said it had been focusing on reducing costs over the year. \nIn the company accounts, finance director Simon Keogh said: “Steps were taken during 2016 to reduce overhead costs and focus on profitable baskets. By maintaining the core competencies of the business there is every reason to believe that the company can build on the foundations established.” \nThe cost cutting plans were put in place after a restructuring exercise saw Culpitt fully take over the running of its subsidiary business, Eileen Grace Limited. \nAs part of the restructure, Eileen Grace ceased trading in September 2015 and all 14 of the firm’s staff were transferred to Culpitt in November. \nDespite the cost cutting, Culpitt made a loss of £302,000 for 2016, after previously reporting an operating profit of £1m during the previous year. However, turnover at the firm grew by 6.4% to £18.2m. \nThe lion’s share of the growth came from its UK sales, which increased from £14m to £15m. Mainland Europe sales fell slightly from £2.71m to £2.68m. Read More Four North East firms scoop Queen’s Awards for Enterprise \nCulpitt said that Brexit had a “significant” impact on its financial performance, with the falling value of the pound increasing purchasing costs. \nMr Keogh added: “Trading conditions in the UK and worldwide remained challenging during the year, the Eileen Grace business was incorporated into Culpitt and growth was seen through export and supermarket channels. \n“The company continues to offer innovative products and an industry leading delivery and service proposition and despite the ongoing challenging economic conditions the company has continued to meet the changing needs of its customer base.” \nThe biggest impact to the company’s balance sheet were increased administration costs, which soared by over £1m to £1.9m. \nIn both 2012 and 2016 Culpitt received the Queen’s Award for Enterprise. Last year it won the award for outstanding growth in international sales over the last three years. Like us on Facebook ", "external_links": [], "published": "2017-09-04T18:59:00.000+03:00", "crawled": "2017-09-04T19:19:13.004+03:00", "highlightTitle": ""}