{"organizations": [], "uuid": "b985a5eedb4e3014f73f2290a92612b43d0bc140", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/incoming/article429333.ece/ALTERNATES/s1200/jkljhljklJPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/wrong-directors-london-offices-can-528723", "country": "GB", "title": "Its wrong that directors in London offices can play God with our city centres", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-25T17:37:00.000+03:00", "replies_count": 0, "uuid": "b985a5eedb4e3014f73f2290a92612b43d0bc140"}, "author": "Patrick Phelvin", "url": "http://www.devonlive.com/news/devon-news/wrong-directors-london-offices-can-528723", "ord_in_thread": 0, "title": "Its wrong that directors in London offices can play God with our city centres", "locations": [], "entities": {"persons": [{"name": "exeter ci", "sentiment": "none"}, {"name": "budenburg", "sentiment": "none"}, {"name": "karime hassan", "sentiment": "none"}, {"name": "pete edwards", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "robin francis budenberg", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "princesshay shopping centre", "sentiment": "none"}, {"name": "paris street", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "exeter city council", "sentiment": "none"}, {"name": "real food company", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Its wrong that directors in London offices can play God with our city centres Exeter City Council will be blamed for the fact that investors have pulled out of a £100m plan to redevelop the bus station site, but it's not their fault Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nThese are tough times for Exeter City Council. Its ambitious pool and bus station plans have been scrutinised to the nth degree, widely criticised and are subject to rising costs. \nNow the £100m project to redevelop the rest of the vast bus station site are in tatters after the Crown Estate and its partner TH Real Estate pulled the plug, citing unspecific “market conditions”. \nBetween them the city council and its former partners invested many millions of pounds to take this project to the stage where building work was almost ready to start. Today’s announcement means that a site that should be full of new shops, public spaces and a cinema could well remain a vacant lot for perhaps years while the powers that be decide what parts of the Princesshay extension can be resurrected, then try and find backers to make that a reality. TH Real Estate and The Crown Estate's extension of Princesshay Shopping Centre on a large section of the bus and coach station site \nThose at the Civic Centre are today no doubt bracing themselves for more angry correspondence from those who told them that this was the wrong project, in the wrong place, and at the wrong time. \nKarime Hassan, Exeter City Council’s chief executive, and its leader, Councillor Pete Edwards, are the public face of the authority and both will take flack for this apparent disaster of epic proportions. \nBut let’s be clear, the council’s part of the project, the bus station redevelopment and swimming pool, is at the moment still going ahead. The council has upheld its side of the bargain. DevonLive.com is happy to hold the council to account for the decisions it makes and there have been disagreements between us and the authority over some of our critical coverage of this very development, but this one isn’t the council’s fault. Developing the bus station site was always going to be complex and time consuming - there are multiple businesses to negotiate with, planning hurdles to overcome and investors to find. Here's what Paris Street will look like after the Princesshay Leisure development is complete \nIf you’re feeling aggrieved by the fact that viable and worthwhile ventures like the Real Food Company have been evicted from their premises to make way for a development that is no longer happening (I know I am) then perhaps it’s worth directing your ire at the Crown Estate Board of Directors who are guilty with messing around with a city centre many miles from their swanky metropolitan offices. \nIt is these nine individuals (four of whom have honours) who spent years promising the world and then pulled the plug on this project, withholding many millions of pounds worth of investment from our city. It is this group – chaired by former banker Robin Francis Budenberg CBE - who are responsible for the fact that much of Paris Street looks like it belongs in a ghost town, and will do for some time to come. Read More Developer pulls out of £100m Exeter Princesshay extension scheme \nYes, Brexit might have caused a wobble or two in the economy and pushed the price of building up, but isn’t the Crown Estate supposed to be interested in long-term investments? Can’t it buy into Exeter’s story of growth and optimism? \nMr Budenburg and his mates might have lost confidence in Exeter but plenty of us haven’t. I was already cooling to its generic multiplex and national brand plan. It was a proposal which didn’t seem designed for me, or many of those I know. Now I hope something inspiring arises from the ashes of this bonfire of a scheme, it should be somewhere that independents like the Real Food Company are welcomed in and nurtured, not unceremoniously cast out. \nSo farewell the Crown Estate – I would say it’s been great but quite frankly it hasn’t. No hard feelings but please keep your distance for a bit. What would really add salt to the wound would be if you were to stand in the way of this city’s development merely because you have other business interests nearby. Like us on Facebook", "external_links": [], "published": "2017-09-25T17:37:00.000+03:00", "crawled": "2017-09-25T17:59:25.005+03:00", "highlightTitle": ""}