{"organizations": [], "uuid": "1b29f0166d771922ce3a8cee213975991702303c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13588380.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/david-davis-conundrum-governments-biggest-13588436", "country": "GB", "domain_rank": 21960, "title": "The David Davis conundrum: why are the Government's biggest idiots in the most important positions?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-07T19:44:00.000+03:00", "replies_count": 0, "uuid": "1b29f0166d771922ce3a8cee213975991702303c"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/david-davis-conundrum-governments-biggest-13588436", "ord_in_thread": 0, "title": "The David Davis conundrum: why are the Government's biggest idiots in the most important positions?", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "negative"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "liam fox", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "pa", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "conservative central office", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit secretary David Davis (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThere is a real danger that this column will turn into a weekly rant about which particular Tory Minister appals me the most. \nI am well aware of the common prejudices that short men are bitter, redheads have short tempers and Northerners are chippy. \nSo as a little ginger Geordie I have always considered it my duty to be as cheerful as possible. \nBut I am finding it very hard to sustain any form of bonhomie in the face of a ruling executive seemingly hellbent on proving that idiocy is no barrier to holding the highest offices of state. \nThis week my ire has mostly been focussed on David Davis, a man who thought it acceptable to launch his bid for the Tory leadership with models in tight T-shirts bearing the words: “It’s DD for me.” He was 56 at the time. \nBut Mr Davis has exceeded even his own capacity for stupidity this week by saying of Brexit : “Nobody ever pretended this would be simple or easy.” Read More The Let's Grow scheme created nearly 8,000 jobs: why did the Government cancel it? \nOnly they did. He did, in fact, saying that “we can do deals with our trading partners, and we can do them quickly.” And so did Liam Fox, who opined that “the free trade agreement we will have to come to with the European Union should be one of the easiest in human history.” \nSo either he’s a liar, or a fool, or possibly both. And certainly he appears to be taking us all for fools. \nI have made my feelings on Brexit more than clear over the last 18 months and won’t repeat them here, but it does seem to be a growing feature of this Government that it is appointing its biggest halfwits to take charge of the most important subjects. \nSo we have Jeremy Hunt running the NHS, Chris Grayling in charge of transport while Boris Johnson tours the world trying to avert nuclear armageddon. Read More The burning question of the Northern rail debate: is Chris Grayling just a little bit daft? \nOf course my views won’t worry anyone in Conservative Central Office. \nI am left-of-centre and live in Newcastle , so my vote is about as much use to them as a chocolate teapot. \nBut they might like to consider that, of all the people I speak to in the North East business community, people on all sides of the political spectrum, I can’t think of the last person who had a single good word to say about this Government. \nAnd if that hasn’t got you sufficiently depressed, consider this: the only alternative is a Labour Party who seem equally intent on putting their most egregious chuckleheads in charge and hiding the talent on the backbenches. \nThis ain’t gonna end well... \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2017-09-07T19:44:00.000+03:00", "crawled": "2017-09-07T19:58:38.000+03:00", "highlightTitle": ""}