{"organizations": [], "uuid": "11fb74e5a186b87aafae22d6cd97a8c7ccee9fa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11919631.ece/ALTERNATES/s1200/JS100289332.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/plunge-business-confidence-sees-firms-13650029", "country": "GB", "domain_rank": 21960, "title": "Plunge in business confidence sees firms downsize and going out of operation", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-20T18:24:00.000+03:00", "replies_count": 0, "uuid": "11fb74e5a186b87aafae22d6cd97a8c7ccee9fa7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/plunge-business-confidence-sees-firms-13650029", "ord_in_thread": 0, "title": "Plunge in business confidence sees firms downsize and going out of operation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Plunge in business confidence sees firms downsize and going out of operation Research by FSB and the Recruitment and Employment shows business confidence falling to levels seen after EU referendum Share Mike Cherry, chair of the Federation of Small Businesses Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusiness confidence has fallen to the lowest level since the EU referendum - with the political climate the main cause of the problem, two new reports say. \nResearch by the Recruitment and Employment Confederation (Rec) showed that a third of employers believed economic conditions were getting worse, while a survey of members at the Federation of Small Businesses (FSB) showed that small business confidence has plummeted to its lowest level since immediately after last year’s Brexit vote . \nThe small business index (SBI) of confidence stood at +1 for the third quarter of 2017, down from +15 in the second quarter and close to the -3 seen after the referendum. \nAround 70% of small firms reported a rise in operating costs compared to the same period last year, with labour costs, taxation and rent all mentioned as cost increases. Read More Long term future of North East car parts firm is secured under new brand name Novares \nFSB national chairman Mike Cherry called for help for small firms in the autumn Budget and a three-year Brexit transition deal. \nHe said: “Rising inflationary pressure and a weakening domestic economy are the twin drivers of plummeting confidence among small firms and consumers alike. With conference season and the Autumn Budget approaching, policymakers have an opportunity to restore optimism. \n“A record proportion of business owners currently expect to downsize, sell or shut up shop, while rent and taxation are frequently mentioned as causes of increased costs. We need to see more support in this space – that includes ending enforcement of the ridiculous ‘staircase tax’. \n“Small firms will be looking to the Chancellor to extend a lifeline at the Budget. In such a difficult trading environment, any new tax grabs or loss of reliefs for entrepreneurs would exacerbate existing challenges.” \nThe Rec report found that almost two out of five of the 600 employers surveyed said they expected to be hit by a shortage of temporary agency workers to fill vacancies, especially in the construction industry. \nKevin Green, chief executive of Rec, said: “Employers are showing a great deal of resilience as they continue to hire despite a growing number losing faith in the direction the economy is heading. Read More Plans revealed for micropub in derelict Newcastle city centre shop \n“The political climate isn’t helping the situation. Businesses need clarity in order to plan effectively and so far the Brexit negotiations have not resolved any of the core issues. \n“Employers are worried about how they will fill vacancies in the future. There are now just 1.9 unemployed people for every vacancy, and net migration from the EU is falling, which means the pool of people available to employers is shrinking.” \nShadow business secretary Rebecca Long-Bailey said: “This is a worrying signal. \n“With the fiasco over business rate relief over the summer and lack of leadership on Brexit, the Conservative Government is letting small businesses down.” \nLiberal Democrat leader Vince Cable said: “One in eight small businesses now plan to close or downsize, the worst level since records began. This is economic reality, not political spin. \n“Theresa May must change course from an extreme Brexit, to avoid years of lower growth and falling living standards.” \nA Government spokeswoman said: “The economy has grown continuously for more than four years, the deficit is down, the UK is home to a record 5.5m small businesses, and a record number of people are in work. We are proud of this, but not complacent. \n“We know that businesses are asking to be given as much certainty as possible as we move through the exit process from the European Union, which is why we are intensifying our engagement with the business community to ensure their voice is heard and reflected throughout our negotiations.” Like us on Facebook", "external_links": [], "published": "2017-09-20T18:24:00.000+03:00", "crawled": "2017-09-20T18:41:56.006+03:00", "highlightTitle": ""}