{"organizations": [], "uuid": "ad4a43b2c7025291b58c466e273d4547ba11a584", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12389798.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-brexit-bank-holiday-become-13584074", "country": "GB", "domain_rank": 21960, "title": "Could a Brexit bank holiday become a thing? A new Tory 'wish-list' has been revealed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-07T13:00:00.000+03:00", "replies_count": 0, "uuid": "ad4a43b2c7025291b58c466e273d4547ba11a584"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-brexit-bank-holiday-become-13584074", "ord_in_thread": 0, "title": "Could a Brexit bank holiday become a thing? A new Tory 'wish-list' has been revealed", "locations": [], "entities": {"persons": [{"name": "nigel evans", "sentiment": "none"}, {"name": "ian liddell-grainger", "sentiment": "none"}, {"name": "christopher chope", "sentiment": "none"}, {"name": "steve double", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "hazel grove", "sentiment": "none"}, {"name": "william wragg", "sentiment": "none"}, {"name": "eddie hughes", "sentiment": "none"}, {"name": "gareth", "sentiment": "none"}, {"name": "mr henderson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "shipley", "sentiment": "none"}, {"name": "chope", "sentiment": "none"}, {"name": "peter bone", "sentiment": "none"}, {"name": "philip davies", "sentiment": "none"}, {"name": "david amess", "sentiment": "none"}, {"name": "carl", "sentiment": "none"}, {"name": "martin vickers", "sentiment": "none"}, {"name": "davies", "sentiment": "none"}, {"name": "bridgwater", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "mr bone", "sentiment": "none"}, {"name": "esther mcvey", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "gordon henderson", "sentiment": "none"}, {"name": "mcvey", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "northern ireland office", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "tatton", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "ribble valley conservative", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "council tax restrictions", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "cleethorpes conservative", "sentiment": "none"}, {"name": "invalid email  tory", "sentiment": "none"}, {"name": "national health service", "sentiment": "none"}, {"name": "wellingborough conservative", "sentiment": "none"}, {"name": "southend west", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "newquay tory", "sentiment": "none"}, {"name": "public service broadcasters (privatisation", "sentiment": "none"}, {"name": "sittingbourne & sheppey conservative", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "christchurch conservative", "sentiment": "none"}, {"name": "st austell", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "department for international development", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "walsall north conservative", "sentiment": "none"}, {"name": "healthcare", "sentiment": "none"}, {"name": "scotland office", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "government equalities office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "European Union flag (Image: PA) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nTory right-wingers have set out their proposals for governing Britain. \nThey include selling the BBC to the private sector, charging patients to use the NHS and ending UK aid to foreign countries. \nThe ideas are set out in proposed new laws presented to the House of Commons by a number of Conservative backbenchers. \nIt’s extremely unlikely that any of the laws will actually be approved by Parliament. And they may only be supported by a small minority of Tory MPs. \nBut they do provide an insight into the type of society some Conservative backbenchers would like to live in. A nurse on a ward at a hospital (Image: PA) Making people pay for the NHS \nProposed laws include the National Health Service (Co-Funding and Co-Payment) Bill, backed by Christchurch Conservative MP Christopher Chope and Wellingborough Conservative MP Peter Bone. \nThis would “make provision for co-funding and for the extension of co-payment for NHS services in England”. \nCo-payment is when you have to pay for NHS services. Many people already have to pay to see an NHS dentist, for example. But the MPs want to extend this to other services. Read More NHS managers explain why the health service is heading for a winter crisis Privatising the BBC \nThen there’s the Public Service Broadcasters (Privatisation) Bill, backed by Mr Chope, Mr Bone and Shipley MP Philip Davies. \nThis would privatise both the BBC and Channel 4, which is also publicly owned. \nThe three MPs are joined by Ribble Valley Conservative Nigel Evans, Bridgwater MP Ian Liddell-Grainger and Tatton MP Esther McVey in backing the BBC Licence Fee (Civil Penalty) Bill, which would “decriminalise” the non-payment of the BBC licence fee - effectively making it optional. Ending overseas aid \nThe Government Departments (Abolition) Bill is backed by Mr Bone, Mr Davies, Mr Chope, Sittingbourne & Sheppey Conservative MP Gordon Henderson and St Austell and Newquay Tory MP Steve Double. \nIt would abolish the Department for International Development - which in practice would mean the end of UK aid to foreign countries. \nThe Bill would also abolish the Government Equalities Office, which is currently responsible for equality strategy and legislation across government. \nAnd it would abolish the Office of the Secretary of State for Wales, Scotland Office and Northern Ireland Office, which would mean those nations no longer had their own Secretaries of State in the Cabinet of the UK government. Instead, there would be a “Department for the Nations of the United Kingdom”. Students sit an exam (Image: Gareth Fuller/PA Wire) More selection in schools \nA Schools Bill, backed by Mr Chope, Mr Bone, Mr Davies and Cleethorpes Conservative MP Martin Vickers, would make it easier to bring back grammar schools by ending the ban on pupil selection. \nIt would also “allow schools to determine maximum class sizes”, ending the current maximum limit of 30 pupils to a class. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now A Brexit bank holiday \nSome Conservatives also want to give us an extra bank holiday. \nThe June Bank Holiday (Creation) Bill, backed by Mr Bone, Mr Davies, Mr Double, Hazel Grove Conservative William Wragg and Sir David Amess, Conservative MP for Southend West, would “make provision for a national public holiday on 23 June or the subsequent weekday when 23 June falls at a weekend”. \nThis is, of course, the date of the 2016 EU referendum, which the MPs clearly want to celebrate. \nAnd the EU features in other proposed new laws too. European Union flags are pictured outside the European Commission building (Image: Carl Court/Getty Images) Make the EU give us money \nMr Bone, Mr Henderson, Mr Davies and Mr Chope are proposing what they call the European Union (Return of Contributions) Bill. \nThis would solve the current dispute over how much the UK should pay the EU when Brexit takes place. Instead of giving the EU a penny, the law would require the Government “to obtain, on withdrawal from the European Union, a payment from the European Union not less than 50 per cent of the United Kingdom’s net contributions to that institution”. \nIn other words, the Government would somehow make the EU give us £4 billion as a goodbye present. Read More Newcastle United and Sunderland could see kit current sponsors scrapped under Labour proposals Let councils push up council tax \nThe Local Authorities (Removal of Council Tax Restrictions) Bill, backed by Mr Chope, Mr Bone, Walsall North Conservative MP Eddie Hughes and others, would allow local councils to put up council tax by more than two per cent. \nAt the moment, they have to obey a strict limit of 2 per cent (and in some cases an extra 3 per cent if they spend the money on social care) or hold a referendum of local voters - which they would be certain to lose. Hospital car parking charges on a sign. Some NHS hospital trusts are making more than £3 million a year from car park charges, an investigation has found (Image: Dave Thompson/PA Wire) End hospital parking charges \nThere are some proposals which might actually win support from MPs across the House of Commons. \nThe Hospital (Parking Charges and Business Rates) Bill, backed by Mr Bone, Ms McVey and others, would ban hospitals from charging patients and visitors for parking. It would also exempt hospitals from paying business rates. \nLabour MPs might well agree with this. Read More Jeremy Corbyn attacks Sports Direct boss Mike Ashley over zero hour contracts Stop NHS cuts \nAnd the Healthcare (Local Accountability) Bill, backed by Mr Chope, Mr Bone and others, would put a stop to controversial “NHS sustainability and transformation plans”, which in some parts of the country involve cuts to services, unless they were backed by local people in a referendum. Like us on Facebook", "external_links": [], "published": "2017-09-07T13:00:00.000+03:00", "crawled": "2017-09-07T13:26:01.002+03:00", "highlightTitle": ""}