{"organizations": [], "uuid": "f629d531418d676686e86b74e4735fd5ee12dbd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/news/devon-news/article530736.ece/ALTERNATES/s1200/29574492JPG.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/exeters-double-whammy-leisure-centre-529532", "country": "GB", "title": "Exeter's 'double whammy' as leisure centre and bus station also put on hold", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-25T19:33:00.000+03:00", "replies_count": 0, "uuid": "f629d531418d676686e86b74e4735fd5ee12dbd5"}, "author": "Phil Goodwin", "url": "http://www.devonlive.com/news/devon-news/exeters-double-whammy-leisure-centre-529532", "ord_in_thread": 0, "title": "Exeter's 'double whammy' as leisure centre and bus station also put on hold", "locations": [], "entities": {"persons": [{"name": "pri", "sentiment": "none"}, {"name": "pete", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "pete edwards", "sentiment": "none"}, {"name": "cllr edwards", "sentiment": "none"}, {"name": "robert mcalpine", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "paris street", "sentiment": "none"}, {"name": "exeter bus station", "sentiment": "none"}, {"name": "sidwell street", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "cheeke street", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "news exeter", "sentiment": "none"}, {"name": "exeter  objectors", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "crown estate", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "st sidwell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Exeter's 'double whammy' as leisure centre and bus station also put on hold Cancellation of Princesshay extension followed by news that a deal to build new pool and bus station has also collapsed Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nExeter's hoped-for city centre development has been hit by a \"double whammy\" after a deal to build the new leisure centre and bus station collapsed, the city council leader has revealed. \nIt emerged on Monday morning that the Crown Estate had cancelled its plans to extend Princesshay shopping centre, citing \"market conditions\". \nThis consigned to the rubbish bin an ambitious plan for a huge public space and amphitheatre across Paris Street into the old bus station and up to the back of Sidwell Street. \nFollowing this, Exeter City Council revealed that a contract with the firm lined up to build the state-of-the-art swimming pool and bus station, believed to be Sir Robert McAlpine, had not been signed. \nThe authority has now walked away from the deal and plans to re-tender for both projects, adding a year to the completion date, now set at 2020. \nAsked if the two were connected, council leader Pete Edwards said the building firm may have been banking on securing the contract to construct the Princesshay extension. Pete Edwards, Exeter City Council leader \n\"I don't know, maybe the builders were after the Crown Estate contract and now that's not going ahead...I don't know, nobody is saying anything,\" he told Devon Live. \n\"I think the builders are probably genuinely scared of taking the risk. We have agreed a price and asked them to sign a contract but they won't sign. Who knows what the reasons are behind the scenes. \n\"I did warn them if they didn't sign we would put it out to tender.\" \nDespite the setback, the council insists the ageing bus and coach station will permanently shut as planned. \nThe 50-year-old facility will close after the last bus has left the station on Saturday, October 28. \nThe council's new Exeter Bus Station was set to open in the winter of 2019, at the same time as its planned passivhaus leisure centre, a pool and gym complex built to strict design standards. \nHowever, the council-led £40m development of a section of the bus station site, creating St Sidwell's Point leisure complex and a new bus station, now needs a new builder. \nIt will not be complete until at least 2020. \nIn the meantime, temporary measures will be in place on the roads around the development site, including Sidwell Street and Cheeke Street. \nFrom Sunday, October 29, passengers will be picked up and dropped off at these dedicated bus stands. \n. \nThe bus station was meant to close in March, but the project was put on hold after the council struggled to find a contractor within the constraints of their budget. \nEconomic uncertainty around Brexit has been blamed for rising prices and the falling value of the pound may have made the leisure centre even more expensive. \nCllr Edwards believes the exchange rate is making material from mainland Europe more expensive but has vowed to complete the project, dubbed by critics \"Pete's Pool\", \"before he dies\". \n\"It is a double whammy and a disaster for the city,\" he added. \nMan arrested after acid attack robbery in Devon \n\"I don't know whether costs have gone up because of Brexit; a lot of the building materials , especially the glass, come from Germany, maybe that's gone up because the pound's dropped. \n\"I am determined to build this place before I die - stick with me and I will deliver it.\" \nThe leader has suggested that the new city redevelopment around the bus station may move away from retail. \n\"We have got a great opportunity because we won the bus station - maybe the market needs something else, maybe housing or offices as we a really short of good quality offices,\" he added. \n\"We are closing the bus station on October 28 and we are going to continue with that.\" \nPrior to Monday's shock announcements, one of the major stumbling blocks to the Princesshay scheme was the contentious closure of Paris Street. \nMassive £5 million Hindu temple planned for Exeter \nObjectors angry that re-routed traffic would cause gridlock elsewhere had forced a public enquiry, which could have scuppered the planning consent. \nThe Department for Transport has yet to announce the date for the enquiry and it is unclear whether it will now go ahead. Read More", "external_links": [], "published": "2017-09-25T19:33:00.000+03:00", "crawled": "2017-09-25T19:59:39.002+03:00", "highlightTitle": ""}