{"organizations": [], "uuid": "5081813da2d091f504747863c6dd3edc73e101d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13398894.ece/ALTERNATES/s1200/BELGIUM_Brexit_134527A.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/more-eu-plays-games-over-13564540", "country": "GB", "domain_rank": 21960, "title": "The more the EU plays games over Brexit the more I think we're better off out of it", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-03T13:00:00.000+03:00", "replies_count": 0, "uuid": "5081813da2d091f504747863c6dd3edc73e101d8"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/more-eu-plays-games-over-13564540", "ord_in_thread": 0, "title": "The more the EU plays games over Brexit the more I think we're better off out of it", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "barnier", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "invalid email", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion The more the EU plays games over Brexit the more I think we're better off out of it I'm a remainer but the EU's behaviour during the Brexit talks makes me wonder if I was wrong Share News Opinion The EU chief Brexit negotiator Michel Barnier, right, and British Secretary of State David Davis (Image: AP) Share Get daily   \nI’m a remainer. I thought the UK would be better off staying in the European Union. \nBut if there’s one thing that might change my mind, it’s the European Union itself. \nLast week we saw Brexit Secretary David Davis and Michel Barnier, the EU’s chief negotiator, standing side by side in a Brussels press conference to explain how negotiations are going. \nMr Davis insisted things were going well. But Mr Barnier wasn’t having it. He complained: “We’re not making much progress.” \nHe claimed the UK refused to recognise its “legal obligations”. \nAnd he said recent UK proposals showed “a sort of nostalgia in the form of specific requests which would amount to continuing to enjoy the benefits of the single market and EU membership”. \nThat sounds damning. And some of the Government’s critics, including some newspapers and commentators, saw it as evidence that the Government was making a pig’s ear of the talks. \nBut I don’t see why we should take Mr Barnier’s side. Read More How the rising cost of living means wages are falling in the North East \nThe “benefits of the single market” are the ability to trade with EU countries. \nTrade between countries - which of course means the French and Germans can sell things to us, as well as Brits selling things to them - is not some special privilege. It’s how countries make their economies strong. \nIf the EU thinks the idea of trading with a non-member country is strange then that illustrates a problem with the EU. It’s not a failing on our part. \nThe “legal obligations” Mr Barnier refers to are the £100 billion bill the EU reportedly wants the UK to pay (it hasn’t officially named a figure yet). \nBut the UK has said it’s willing to pay up. It just thinks £100 billion is too much, which seems reasonable. Read More Who will last longest - Theresa May or Jeremy Corbyn? \nAnd the reason the talks aren’t making progress is because the EU refuses to talk about a trade deal before the UK agrees to pay this money. \nAt the same time, it knows full well the British government can’t and won’t simply agree to pay whatever figure EU officials pluck out of the air. \nThe refusal to talk is just an arbitrary decision on the part of the EU. It could discuss trade, and make progress, if it wanted. \nWe can’t expect the EU to do us any favours. But we can expect EU officials to behave like grown-up professionals - and they’re not. \nSome people might argue that it’s inevitable the EU would try to punish the UK for leaving. The EU doesn’t want Brexit to be a success, because that might encourage other countries to follow our lead. \nPerhaps so, but do we want to be part of a club which relies on fear of reprisals to stop its members quitting? Like us on Facebook", "external_links": [], "published": "2017-09-03T13:00:00.000+03:00", "crawled": "2017-09-03T13:23:35.011+03:00", "highlightTitle": ""}