{"organizations": [], "uuid": "933ae40e26b4393e08a80902570a6776d8ab6325", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/news/devon-news/article460324.ece/ALTERNATES/s1200/30536611JPG.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/ukip-leader-says-defectors-who-460278", "country": "US", "title": "Ukip leader says defectors who jumped ship to Devon Tories have ‘badly miscalculated’ - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.203, "site_type": "news", "published": "2017-09-11T19:43:00.000+03:00", "replies_count": 0, "uuid": "933ae40e26b4393e08a80902570a6776d8ab6325"}, "author": "Phil Goodwin", "url": "http://www.devonlive.com/news/devon-news/ukip-leader-says-defectors-who-460278", "ord_in_thread": 0, "title": "Ukip leader says defectors who jumped ship to Devon Tories have ‘badly miscalculated’ - Devon Live", "locations": [], "entities": {"persons": [{"name": "ukip", "sentiment": "none"}, {"name": "steve cro", "sentiment": "none"}, {"name": "cllr bridgeman", "sentiment": "none"}, {"name": "tudor evans", "sentiment": "none"}, {"name": "mr salmon", "sentiment": "none"}, {"name": "maddi bridgeman", "sentiment": "none"}, {"name": "john riley", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "chris storer", "sentiment": "none"}, {"name": "christopher storer", "sentiment": "none"}, {"name": "steve crowther", "sentiment": "none"}, {"name": "cllr riley", "sentiment": "none"}, {"name": "david salmon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ian bowyer", "sentiment": "none"}, {"name": "mr crowther", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "honicknowle", "sentiment": "none"}], "organizations": [{"name": "devon live news ukip", "sentiment": "none"}, {"name": "devon tories", "sentiment": "none"}, {"name": "plymouth city council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "herald", "sentiment": "none"}, {"name": "cllr storer", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip  cabinet", "sentiment": "none"}, {"name": "plymouth ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Ukip leader says defectors who jumped ship to Devon Tories have ‘badly miscalculated’ Steve Crowther says trio who swapped allegiance and swung power at council will be punished at the polls next year Share Comments \nThree Ukip councillors made a mistake by defecting to the Conservatives and will be punished by voters at the election, the party leader has warned. \nThe Plymouth city councillors walked out and joined the city's Tory group, claiming the party had served its purpose by securing Brexit. \nCouncil leader Ian Bowyer welcomed John Riley, Maddi Bridgeman, and Chris Storer to the “blue team”. \nHe said the trio now accept the referendum result in the city, where 60 per cent of residents in voted to leave the European Union, was the end of Ukip. \nInterim leader Steve Crowther, who will give map out the future of the party at its annual conference in Torquay next month, said they should not assume electors in former Labour wards will vote Tory. \n“I understand why they have done it but I think they and the Conservatives may have badly miscalculated,” he told Devonlive.com. \n“All three took seats from Labour and were elected because people didn’t want to vote Labour or Conservative and instead wanted the very useful function that Ukip provides in local government. \n“They are assuming they will be re-elected in the same seat in Conservative colours - they would have been better off with the Conservatives not standing against them.” Councillors Maddi Bridgeman (left) Christopher Storer (centre) and John Riley (right) have quit Ukip \nCabinet member and Honicknowle representative John Riley, Moor View ward's Maddi Bridgeman and Ham elected member Christopher Storer swung the council towards the Tories. \nThe group now has 30 seats on the council, securing a majority over rivals Labour. \nThe move comes as a huge blow to Ukip, which gained representation on Plymouth City Council for the first time in 2014 after snatching three seats from Labour. \nThe leader of the Labour group believes three councillors have \"broken their contract\" with the communities they serve. \nTudor Evans has called for by-elections. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIn a statement, Ukip party spokesman David Salmon said: \"We would like to thank them for their past service to the party and to their local populace and wish them every success in the future.\" \nMr Salmon, former chairman for Plymouth Ukip branch, said he'd \"just finished his Sunday lunch\" when the party's branch secretary called to deliver the news. \nHe said talks would be thrashed out at a party committee meeting soon over its future direction. \nBut Mr Salmon says he's confident all three councillors will continue to work hard for their residents. Nigel Farage celebrates \nSpeaking to the Herald, Mr Salmon said: \"They have decided, I guess, that in order to best serve the people are they representing, they need to step down from Ukip. \n\"I am not 100 per cent sure what they are doing. But I have had confirmation from the secretary (that they have resigned). \n\"(The voters) have still got these same people fighting their corner. \n\"They are not stepping down as councillors. \n\"They will still be representing their constituents; they are doing a good job and always have done. \n\"They are very, very hard working councillors. Obviously, I am disappointed.\" \nTemporary leader Mr Crowther, who lives in North Devon, said he would set out the vision for Ukip before revealing the new party leader on September 29. \nHe said: “A lot of people have come to the conclusion that Ukip’s job has been completed – it has been a problem for us over the past 18 months. \n\"I have been working in part on a new brand which will be unveiled at our conference. \n“We need to make clear what our future is and what we stand for, which is about more than just exiting the EU. \n“It is about examining what our party has always been about – sovereignty, democracy, patriotism and pride in our nation.” \nCllr Bridgeman, Cllr Riley and Cllr Storer have all been approached for comment.", "external_links": [], "published": "2017-09-11T19:43:00.000+03:00", "crawled": "2017-09-11T20:31:06.011+03:00", "highlightTitle": ""}