{"organizations": [], "uuid": "f26f7ba2051ba6b7f6b86e7d0a20a3334dc3abf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12649455.ece/ALTERNATES/s1200/John-Lewis-results.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13612680", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: John Lewis profits tank as consumers feel the pinch", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-14T10:30:00.000+03:00", "replies_count": 0, "uuid": "f26f7ba2051ba6b7f6b86e7d0a20a3334dc3abf8"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13612680", "ord_in_thread": 0, "title": "Business Breakfast LIVE: John Lewis profits tank as consumers feel the pinch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Next upbeat on outlook after 'encouraging' performance \nRetail chain Next has delivered a “modest” upgrade to its full-year outlook after an “encouraging” performance amid tough high street conditions.The fashion group posted a 9.5% fall in pre-tax profits to £309.4m for the six months to the end of July after total sales across its high street stores, including markdowns, fell by 8.3%.But chief executive Lord Wolfson said while it was a challenging first half, improved trading in the second quarter suggested efforts to overhaul its ranges were beginning to pay off.He said the worst of the Brexit-fuelled price rises on the high street were also over.He said the impact of the Brexit vote “doesn’t look like it’s fuelling an inflationary spiral and is passing right through”.A prominent Leave campaigner, Lord Wolfson said 2018 will see an end to price rises, with the group predicting stable prices in the autumn.Next put up prices by 4% on average for its spring and summer season this year, but is pencilling in a rise of 2% for next spring and summer, with prices remaining flat at the end of 2018.Lord Wolfson added that the benefit of the weak pound will start to be felt next year as it boosts exports. \nHe said: \nThe bad news will be this year and the good news next year. \nNext is forecasting full-year profits of around £717m, up from £710m previously, although this would still mark a drop on the year before.It said sales could fall by up to 2% or rise by 1.5% over the year, having previously warned of a fall of up to 3%.Lord Wolfson said: \nThe first half of the year has been difficult and sales and profits are in line with our cautious expectations. \nHowever, our performance in the last three months has been encouraging on a number of fronts and whilst the retail environment remains tough, our prospects going forward appear somewhat less challenging than they did six months ago. Bumpy times are ahead for retailers, according to a report. Next has seen sales fall for the first time in five years. (Image: Paul Faith/PA Wire) 9:20 KEY EVENT 50 jobs to go at Utilitywise amid changes to operations at three sites \nAround 50 employees are set to lose their jobs at North East energy consultancy Utilitywise amid changes to operations in three of its offices. \nThe North Shields-headquartered firm has announced changes at its Tyneside, Portsmouth and Redditch offices which will affect 100 staff who have now entered into a redundancy consultation. \nEmployees at the company, which arranges discounts for individual companies in return for taking their contracts to one energy supplier, were told of the proposals in an announcement this morning. \nThe jobs will be cut across the three offices and it is understood those affected will be in a variety of back office and support roles. \nHowever, Utilitywise directors said it would be looking to redeploy people into customer facing roles where possible. \nIt also said it is continuing to grow its SME business and believes that, despite the redundancy consultation, the firm’s headcount will increase over the next 12 months. \nIn a statement, the firm said: \nUtilitywise, the leading independent utility cost management consultancy, has today announced it is proposing changes to operations at its sites in Portsmouth, Redditch and Newcastle. \nUtilitywise is in the process of creating new roles across the Group as it implements its strategy to focus on activities where it sees opportunities for the highest growth as well as improving the operational efficiency of the business. The means adding more customer facing roles, particularly as Utilitywise focuses on growing its SME business (or Enterprise Division). \nHowever, as part of the process, a number of current roles will no longer be needed and Utilitywise has today entered into formal consultation with affected employees. \nWhere possible, impacted staff will be redeployed into the new roles being created. \nOver the next 12 months, Utilitywise expects its overall employee number to increase from nearly 1,500 staff based across the UK, as the Group seeks to grow the business \nA spokesman for the firm added: \nWe expect less than 50 people to actually leave the business as a result of these changes, while at the same time we expect our total overall headcount to grow over the course of the financial year. Utilitywise CEO, Brendan Flattery Jonathon Manning Virgin Money CEO marks Northern Rock anniversary with personal loans warning \nVirgin Money CEO Jayne-Anne Gadhia has warned that cheap personal loans and the car finance market potentially pose a threat to the financial system as the banking sector marks 10 years since the collapse of Northern Rock. \nMrs Gadhia said personal unsecured loans were priced too low for a good economy “let alone one that might have an uncertain outlook” and called for regulators to keep a watchful eye on the car finance market. \nHer comments coincide with the 10-year anniversary of Northern Rock’s collapse, which saw the lender become a symbol of the financial crisis in the UK as it crashed into Government ownership. \nThe chief executive, who oversaw Virgin Money’s takeover of Northern Rock’s “good” operations in 2010, said: \nI would say that in the UK the car finance market is the area that should be watched. \nThe chief executive of Lloyds was quoted at the half-year results saying the Bank of England is concerned about credit growth, but we don’t see that on banks’ balance sheets. \nThat is because there is so much growth on car manufacturers’ balance sheets and I think that is quite a difficult conundrum for the regulators. \nThe other area that I find concerning, and Virgin Money are not in this, is personal unsecured loans that people might take out for a new kitchen or conservatory. \nThe pricing on those loans is very low at the moment. I saw a pricing chart only last week and they are being priced at about 3%. \nI would say that probably there is an issue there that the price of unsecured loans is not pricing in the real risk of how they might perform in a good economy, let alone in one that might have an uncertain outlook. Virgin Money Chief Executive Jayne-Anne Gadhia (Image: Newcastle Chronicle) 9:10 Jonathon Manning Morrisons enjoys healthy rise in half-year profit \nMorrisons has reported rising half-year profits as the supermarket hailed seven consecutive quarters of growing sales.Pre-tax profits increased 39.9% to £200m in the six months to July 30, while turnover rose 4.8% to £8.42bn.Second-quarter like-for-like sales grew by 2.6%, while comparable sales over the second half as a whole rose 3%.Morrisons chief executive David Potts, who is overseeing a turnaround of the business, said: \nA new Morrisons is beginning to take shape. \nThe capability of the team continues to improve and we are making strong headway with our plans to Fix, Rebuild and Grow. \nOur supermarkets continue their focus on improving the customer shopping trip and, in wholesale supply, we are beginning to realise some of the opportunities that our unique team of food makers and shopkeepers bring us. Morrisons CEO David Potts. (Image: Buck/Morrisons/PA Wire) 9:04 Jonathon Manning Shield Therapeutics CFO exits firm \nShield Therapeutics has announced that Joanne Estell has resigned from her board position and as the listed firm’s chief financial officer. \nMs Estell has left the company to pursue other business interests outside the healthcare sector. \nThe pharmaceutical firm, which produces iron deficiency drug Feraccru from its base in Gateshead, is now searching for new CFO. \nDr Karl Keegan is now taking on the role as interim CFO. Mr Keegan ha a background of senior fianncial positions in the specialty pharmaceutical sector, and previously worked closely with Ms Estell in his rtols as director of corporate development. \nCarl Sterritt, founder and chief executive officer of Shield Therapeutics, said: \nOn behalf of the board, I thank Joanne for her contributions to the growth of Shield as a publicly listed company, particularly her role in the recent financing. We are fortunate and pleased to be able to appoint Karl as interim CFO. \nHe is a well-qualified and suitably sector-experienced internal successor to Joanne and we look forward to working with Karl on Shield’s continued success. We look forward to updating investors on recent progress within the business on 20 September when we publish our interim results. Carl Sterritt, Shield Therapeutics", "external_links": [], "published": "2017-09-14T10:30:00.000+03:00", "crawled": "2017-09-14T10:40:37.008+03:00", "highlightTitle": ""}