{"organizations": [], "uuid": "16943435cfc1937dd352d16c85ac36c9910d485c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13607246.ece/ALTERNATES/s1200/CFR_NJL_120917akzo_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/100m-northumberland-paint-plant-launched-13607203", "country": "GB", "domain_rank": 21960, "title": "£100m Northumberland paint plant launched by major North East employer AkzoNobel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-12T13:05:00.000+03:00", "replies_count": 0, "uuid": "16943435cfc1937dd352d16c85ac36c9910d485c"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/100m-northumberland-paint-plant-launched-13607203", "ord_in_thread": 0, "title": "£100m Northumberland paint plant launched by major North East employer AkzoNobel", "locations": [], "entities": {"persons": [{"name": "liam fox", "sentiment": "none"}, {"name": "akzonobel", "sentiment": "none"}, {"name": "dulux", "sentiment": "none"}, {"name": "thierry vanlancker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "felling", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}], "organizations": [{"name": "dulux academy", "sentiment": "none"}, {"name": "akzonobel", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "slough", "sentiment": "none"}, {"name": "akzo nobel", "sentiment": "none"}, {"name": "dulux", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Major employer AkzoNobel secures 150 jobs after opening world's most advanced paint factory The new manufacturing plant will make Dulux paint and has a carbon footprint 50% less than its old facility Share Click to play Tap to play The video will start in 8 Cancel Play now Get business   \nManufacturing giant AkzoNobel has opened the world’s most advanced paint factory in Ashington , securing 150 jobs. \nThe Northumberland plant cost more than £100m to build and contains state-of-the-art robots on their production lines which will be used predominantly to make Dulux paint. \nTo honour the North East’s industrial heritage, each of the robots is named after one of the region’s collieries, and many of the staff are ex-mine workers. \nMatt Pullen, AkzoNobel managing director for the UK and Ireland, said: “We have had a long history of association in the North East. We have a marine and protective coating site in Felling, which employs around 650 people, so we have a long history here. \n“We needed a big site and a big space - one that is about 14 football pitches in size - and Ashington was perfect from that point of view. We also wanted to create a legacy and a community and Ashington was one of those places that needed employment for the future.” The new AkzoNobel manufacturing plant in Ashington, Northumberland (Image: Akzo Nobel) \nThe new facility is capable of doubling the company’s UK production levels to 200 million litres of paint of year, the equivalent of 80 million 2.5 litre cans, which is enough to redecorate every living room, bathroom, and kitchen in the UK. \nIt has also been designed to be the most sustainable plant of its kind in the world. Along with reusing 100% of its waste water, AkzoNobel estimates that the new plant’s carbon footprint will be 50% less than the facilities it is replacing. \nWhile the investment at the plant has already secured 150 jobs in the region , officials at AkzoNobel suggested that more jobs could be created in the future. \nShirley Spoors, whose role as production manager involves overseeing a team of 75 staff, said: “At the moment we employ 150 people in Ashington and in the future the plant is designed to grow. It is the most sustainable plant in the world. \n“The plan is that Ashington will grow and there is space for an additional two more filling lines.” Read More Major North East employer AkzoNobel posts disappointing second-quarter results \nThe investment in the site shows a major commitment from AkzoNobel to remain in the North East, and has helped calm concerns that major manufacturers could consider leaving the UK after Brexit. \nCEO Thierry Vanlancker said that the plant would be unaffected by Brexit as its major focus was on the UK market, although it would also export to Europe on a smaller scale. \nHe said: “Brexit is a major event in the UK, but for the plant in Ashington the key market served is the UK. \n“As we have been indicating this is an investment in the long term. \n“We are the big dog in the UK market for decorative paint. Whatever happens with Brexit, life goes on.” \nAshington will also have a second Dulux Academy, a training centre for painters and decorators to provide them with the expertise they need, following on the from the success of the first £1.4m academy in Slough, Berkshire, which has trained 1,600 people in its first year. \nAshington is AkzoNobel’s second major investment in the North East, alongside its Performance Coatings plant at Felling, Gateshead, which employs more than 800 people, out of a total UK workforce of more than 3,500. \nThe company is investing £11.5m in the creation of a technical innovation hub at the Felling site, work which involves a raft of local construction contractors. Read More £30m research facility places Gateshead at heart of UK's battle for clean energy \nAkzoNobel made the investment in Ashington after making the decision to close two of its other UK sites in Slough and Prudhoe. While the Slough site is being slowly closed down by the paint giant, its Prudhoe facility has been sold off allowing many of its workers to remain employed. \nIn total AkzoNobel employs more than 1,000 people in the North East, but earlier in the year there were concerns that some of these roles would be cut if the firm was taken over by US rival PPG Industries. AkzoNobel survived the takeover after fending off three multi-billion pound bids. Like us on Facebook", "external_links": [], "published": "2017-09-12T13:05:00.000+03:00", "crawled": "2017-09-12T14:28:49.016+03:00", "highlightTitle": ""}