{"organizations": [], "uuid": "9353a1920237d09f305e76c8a34bbbc8f6cbe159", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13614277.ece/ALTERNATES/s1200/Man-Booker-Prize-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/man-booker-prize-shortlist-offers-13614222", "country": "GB", "domain_rank": 21960, "title": "Man Booker Prize shortlist offers Christmas gift ideas for bookworms but few laughs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-13T14:55:00.000+03:00", "replies_count": 0, "uuid": "9353a1920237d09f305e76c8a34bbbc8f6cbe159"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/man-booker-prize-shortlist-offers-13614222", "ord_in_thread": 0, "title": "Man Booker Prize shortlist offers Christmas gift ideas for bookworms but few laughs", "locations": [], "entities": {"persons": [{"name": "sarah wood", "sentiment": "none"}, {"name": "rose", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "linda", "sentiment": "none"}, {"name": "mohsin hamid", "sentiment": "none"}, {"name": "cathy", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "emily fridlund", "sentiment": "none"}, {"name": "willie", "sentiment": "none"}, {"name": "hamish hamilton", "sentiment": "none"}, {"name": "elisabeth", "sentiment": "none"}, {"name": "patra", "sentiment": "none"}, {"name": "saeed", "sentiment": "none"}, {"name": "hamid", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}, {"name": "colman getty", "sentiment": "none"}, {"name": "ali smith", "sentiment": "none"}, {"name": "abraham lincoln", "sentiment": "none"}, {"name": "archibald isaac ferguson", "sentiment": "none"}, {"name": "stanley ferguson", "sentiment": "none"}, {"name": "paul auster", "sentiment": "none"}, {"name": "lotte hansen", "sentiment": "none"}, {"name": "nadia", "sentiment": "none"}, {"name": "bardo", "sentiment": "none"}, {"name": "auster", "sentiment": "none"}, {"name": "leo", "sentiment": "none"}, {"name": "george saunders", "sentiment": "none"}, {"name": "baroness young", "sentiment": "none"}, {"name": "lola", "sentiment": "none"}, {"name": "fiona mozley", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "finger lakes", "sentiment": "none"}, {"name": "inverness", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "new york state", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "elmet", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "lahore", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "bardon", "sentiment": "none"}, {"name": "georgetown", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "syracuse university", "sentiment": "none"}, {"name": "man group", "sentiment": "none"}, {"name": "faber & faber", "sentiment": "none"}, {"name": "jm originals", "sentiment": "none"}, {"name": "mid-20th century america", "sentiment": "none"}, {"name": "colman getty", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "weidenfeld & nicolson", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Man Booker Prize shortlist offers Christmas gift ideas for bookworms but few laughs The prestigious fiction prize sees six \"unique and intrepid\" novels vying for the £50,000 prize and some hectic autumn promotion Share The books shortlisted for the Man Booker Prize, 2017 (Image: Colman Getty) Share   Thank you for subscribing!   \nThe shortlist for the Man Booker Prize 2017 has been announced – which means these are six novels you will see prominently displayed in your local bookshop in the coming weeks. \nThey are 4321 by Paul Auster, History of Wolves by Emily Fridlund, Exit West by Mohsin Hamid, Elmet by Fiona Mozley, Lincoln in the Bardon by George Saunders and Autumn by Ali Smith. \nWith such an array of new books published every year, the annual fiction prize is seen by many as an indication of quality. \nThese half dozen books, pored over by a panel of judges who have set their merits against hundreds of others, should move closer to the top of the Christmas present list if you’ve a bookworm in the family. Read More Who's coming to Durham Book Festival? Here are some of the famous names \nIt has to be said, though, that collectively they do not add up to a barrel of laughs. Themes of war, loneliness and dislocation abound. \nBut even if the contents of the gifted book doesn’t, in the end, delight, the recipient can always say: “Well, it was up for the Booker Prize.” \nBy Christmas the winner of this year’s prestigious prize will have been announced – at a presentation on October 17, to be broadcast by the BBC. \nEach of the shortlisted authors receives £2,500 and a specially bound edition of their book. The winner will receive a further £50,000 plus international recognition and inclusion on a list of distinguished winners dating back to 1969. \nIt became the Man Booker Prize in 2002 when the Man Group started its sponsorship of the prize which is awarded annually to “the best single work of fiction translated into English and published in the UK”. Baroness Young, chair of the Man Booker Prize 2017 judges, with the shortlisted titles (Image: Colman Getty) \nThis year’s judging panel was chaired by Lola, Baroness Young. \nShe said the shortlist included “six unique and intrepid books that collectively push against the borders of convention”. \nThe list includes two first-time female writers, Emily Fridlund and Fiona Mozley, who are also the youngest on the shortlist, and two who were previously shortlisted, Mohsin Hamid and Ali Smith who has made the list for the fourth time. \nHere are the six shortlisted novels in detail... 4321 by Paul Auster (published by Faber & Faber) 4321 by Paul Auster (Image: Colman Getty) \nSynopsis: In the maternity ward of a New Jersey hospital on March 3, 1947, a baby is born – Archibald Isaac Ferguson, only child of Rose and Stanley Ferguson. \nBut he is to lead four simultaneous and independent fictional lives. Readers follow these four boys who are in fact the same boy as their stories unfold against the tumult of mid-20th Century America. Paul Auster, author of 4321 (Image: Lotte Hansen) \nThe judges said: “Auster’s achievement is to pull off an ambitious, complex, epic narrative about the coming of age of a young man during one of the most turbulent times in recent North American history.” \nPaul Auster was born in 1947 and lives in New York. History of Wolves by Emily Fridlund (Weidenfeld & Nicolson) History of Wolves by Emily Fridlund (Image: Colman Getty) \nSynopsis: Fourteen-year-old Linda lives on a dying commune beside a lake in the American mid-West. She and her parents are the last inhabitants and at school Linda is regarded as a freak. \nOne day she notices the arrival of a young family in a cabin across the lake and starts to befriend them, feeling a sense of belonging that has been missing from her life. \nThere are four-year-old Paul and his mother, Patra. But the father, Leo, is absent. When he returns home, Linda is shunned. Her efforts to be accepted again have devastating consequences. Emily Fridlund, author of History of Wolves (Image: Colman Getty) \nJudges: “A novel of silver prose and disquieting power that asks very difficult questions about human responsibility, knowledge and agency.” \nEmily Fridlund was born in 1979 and grew up in Minnesota. She now lives in the Finger Lakes region of New York State and this is her first novel. Exit West by Mohsin Hamid (Hamish Hamilton) Exit West by Mohsin Hamid (Image: Colman Getty) \nSynopsis: In a city swollen with refugees, a young couple, Saeed and Nadia, fall in love. \nBut the city becomes unsafe with bombs falling ever closer, curfews and public executions. \nThe couple, even though they are not married, move in together, exposing themselves to other risks. \nMeanwhile rumours spread of strange black doors in secret spaces across the city leading to places of potential safety such as London, San Francisco, Greece or Dubai. Mohsin Hamid, author of Exit West (Image: Colman Getty) \nJudges: “The story of Exit West focuses on the movement of large numbers of people across the globe in search of freedom and a new life of one kind or another. \n“The reasons may be clear or opaque – there’s no judgement about their motivation in Hamid’s emotionally intelligent, clear, crisp narrative.” \nMohsin Hamid was born in 1971, grew up in Lahore and has since lived there and also in London and New York. Elmet by Fiona Mozley (JM Originals) Elmet by Fiona Mozley (Image: Colman Getty) \nSynopsis: Daniel is heading north, looking for someone. The simplicity of his early life with Daddy and Cathy has turned sour and fearful. \nSometimes Daddy disappeared and would return with a rage in his eyes but when he was at home he was at peace. \nHe would tell them the little copse in Elmet was theirs alone but greedy and watchful local men began to circle like vultures – and the rage inside Daddy grew. Fiona Mozley, author of Elmet (Image: Colman Getty) \nJudges: “A forceful first novel that witnesses with the eyes of a child the struggle of a family to retain its self-sufficiency as the old ways succumb to the bland greed of the new normality... \n“The tale is told in vivid language whose poetry survives even in its last dark catastrophe, with no punches pulled.” \nFiona Mozley was born in 1988 and grew up in York. She is studying for a PhD in medieval history. Lincoln in the Bardo by George Saunders (Bloomsbury) Lincoln in the Bardo by George Saunders (Image: Colman Getty) \nSynopsis: Over the course of one evening – February 22, 1862 – Abraham Lincoln paces around Georgetown cemetery where his 11-year-old son, Willie, has been laid to rest after his death two days previously. \nThe man is troubled by the death and by the grim shadow of a war he feels will never end. Willie, meanwhile, is trapped in limbo, drawn to his father but no longer able to communicate with him in a graveyard populated by spirits. \nJudges: “This extraordinary work focuses on a single night in the life of Abraham Lincoln: an actual moment in 1862... \n“Strangely and brilliantly, George Saunders activates this graveyard with the spirits of its dead.” George Saunders, author of Lincoln in the Bardo (Image: Colman Getty) \nGeorge Saunders was born in Texas in 1958 and teaches at Syracuse University, New York. Autumn by Ali Smith (Hamish Hamilton) Autumn by Ali Smith (Image: Colman Getty) \nSynopsis: This is the first in a seasonal quartet of novels set in the autumn of 2016 when Daniel, aged 101, is dying and Elisabeth, aged 32 and his only friend, has her eye on the future. \nBut the UK is in pieces, divided by the historic, once-in-a-generation summer event that was Brexit. \nThe book is “a meditation on a world growing ever more bordered and exclusive”. Ali Smith, author of Autumn (Image: Sarah Wood) \nJudges: The novel is “a lens of exploration between states that might appear disjointed”. The author “writes poetic prose, unique in its freedom and tempo, about the mysterious and melancholy nature of time”. \nAli Smith was born in Inverness in 1962 and was also shortlisted for the Booker in 2001 (Hotel World), 2005 (The Accidental) and 2014 (How to be Both). Like us on Facebook", "external_links": [], "published": "2017-09-13T14:55:00.000+03:00", "crawled": "2017-09-13T15:47:24.006+03:00", "highlightTitle": ""}