{"organizations": [], "uuid": "3473abb6103b8b587535ceb79727bd8d89b6aed6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13609110.ece/ALTERNATES/s1200/Jeremy-Corbyn-visit-to-East-Midlands.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-labours-conference-revealed-huge-13673249", "country": "GB", "domain_rank": 21960, "title": "How Labour's conference has revealed huge divisions in the party", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-25T23:00:00.000+03:00", "replies_count": 0, "uuid": "3473abb6103b8b587535ceb79727bd8d89b6aed6"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-labours-conference-revealed-huge-13673249", "ord_in_thread": 0, "title": "How Labour's conference has revealed huge divisions in the party", "locations": [], "entities": {"persons": [{"name": "angell", "sentiment": "none"}, {"name": "richard angell", "sentiment": "none"}, {"name": "alison mcgovern", "sentiment": "none"}, {"name": "stella creasy", "sentiment": "none"}, {"name": "chris leslie", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "yvette cooper", "sentiment": "none"}, {"name": "luke akehurst", "sentiment": "none"}, {"name": "vernon coaker", "sentiment": "none"}, {"name": "ruth smeeth", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "john lennonists", "sentiment": "none"}, {"name": "gloria de piero", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "wayne david", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "akehurst", "sentiment": "none"}], "locations": [{"name": "cuba", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "how labour", "sentiment": "neutral"}, {"name": "labour", "sentiment": "neutral"}, {"name": "progress", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour first", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How Labour's conference has revealed huge divisions in the party Moderates have launched a furious attack on supporters of Jeremy Corbyn Share Click to play Tap to play The video will start in 8 Cancel Play now Get   Thank you for subscribing!   \nLabour MPs have given up attempts to sack Jeremy Corbyn as leader, creating the impression that the party’s civil wars may be over. \nBut battles taking place at the party conference show that Labour is still far from united. \nFactions including Labour First and Progress are waging war against Momentum, the left-wing organisation which grew out of Mr Corbyn’s leadership campaign. \nIn a furious message to supporters, Labour First Secretary Luke Akehurst described Momentum as a mixture of naive “John Lennonists” and “extremely cynical Leninists”. Labour leader Jeremy Corbyn (Image: PA) \nThere is anger at the way Momentum has used a smartphone app called M.APP to instruct supporters, many of them young, how to vote at the conference. \nSo-called Labour moderates believe this helps explain why there will be no conference vote on Brexit. Instead, members chose to hold debates and votes on housing, rail, the NHS and pay. \nLabour First held a conference rally on Sunday where speakers included MPs Stella Creasy, Ruth Smeeth, Chris Leslie, Wayne David, Vernon Coaker and Yvette Cooper. \nIt has been characterised as the vanguard of the old Labour right. \nBut it has made common cause with Progress, a group associated with the Blairites who controlled Labour for much of the 1990s and 2000s, and Progress Director Richard Angell also spoke at the Labour First rally. Read More Labour promises to give the north a bigger voice after conference snub \nWriting in a daily conference briefing email to Labour First members, Mr Akehurst said Momentum had “denied members the chance to vote on Labour’s position on Brexit”. \nHe said: “Momentum factionalists are just looking for ridiculous fights over anything. They thrive on conflict so they are trying to provoke division and infighting on conference.” \nAnd he claimed: “Amid many decent idealists who have been politically energised by Jeremy Corbyn – ‘John Lennonists’ who want a better world but are arguably a bit naive about the nature of the British electorate and how fast we can persuade voters to change society, there are unfortunately a minority of extremely cynical Leninists. \n“Leninists don’t care what voters think because they are happy to impose political change through violent revolution. They fetishise the violence of the Russian revolution and the authoritarianism of contemporary regimes like Cuba or Venezuela.” \nHe continued: “Because they are not democrats, and they feel no comradely feelings towards democratic socialists, these people treat fellow Labour members with contempt. They subject anyone who disagrees with them online to a barrage of disgusting, personalised abuse to try to drive them out of political activity.” Read More Labour offers lifeline to people trapped by massive credit card debt they can't pay off \nAn email from Mr Angell to Progress members was almost as vituperative. \nHe said: “Yesterday Momentum successfully pulled the wool over the eyes of their delegates and blocked Brexit being democratically discussed at Labour party conference.” \nHe added: “It is shameful tactics by the Bennite Momentum leadership, made worse when you think the young Corbynite Momentum membership are desperate to stop a hard Brexit.” \nProgress is chaired by Labour MP Alison McGovern. It’s strategy board includes Labour MPs Gloria De Piero and Sedgefield MP Phil Wilson. Like us on Facebook", "external_links": [], "published": "2017-09-25T23:00:00.000+03:00", "crawled": "2017-09-25T23:23:27.004+03:00", "highlightTitle": ""}