{"organizations": [], "uuid": "2b65888a7f474ab2a079f77c9b324d2d89db7a31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/news/devon-news/article527785.ece/ALTERNATES/s1200/pRINCESSPNG.png", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/live-100m-exeter-bus-station-527675", "country": "US", "title": "LIVE: £100m Exeter bus station development is CANCELLED - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2017-09-25T16:27:00.000+03:00", "replies_count": 0, "uuid": "2b65888a7f474ab2a079f77c9b324d2d89db7a31"}, "author": "Colleen Smith", "url": "http://www.devonlive.com/news/devon-news/live-100m-exeter-bus-station-527675", "ord_in_thread": 0, "title": "LIVE: £100m Exeter bus station development is CANCELLED - Devon Live", "locations": [], "entities": {"persons": [{"name": "pete edwards", "sentiment": "none"}, {"name": "keith patch", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "john grinnell", "sentiment": "none"}, {"name": "steve hole", "sentiment": "none"}, {"name": "derek phillips", "sentiment": "none"}, {"name": "jane harrow", "sentiment": "none"}, {"name": "christopher cook", "sentiment": "none"}, {"name": "melissa gale", "sentiment": "none"}, {"name": "karime hassan", "sentiment": "none"}, {"name": "donna gibbins", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "lush", "sentiment": "none"}, {"name": "pete edwards  aled davies", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "paris street", "sentiment": "none"}, {"name": "sidwell street", "sentiment": "none"}, {"name": "sand down lane", "sentiment": "none"}, {"name": "exeter city", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "newton st cyres", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "princesshay", "sentiment": "none"}], "organizations": [{"name": "exeter chamber of commerce and industry", "sentiment": "none"}, {"name": "estate/th real estate", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newton st cyres primary school", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "city council", "sentiment": "none"}, {"name": "council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now \nDevelopers have pulled the plug on a £100m project to radically change the face of Exeter. \nThe Crown Estate has cancelled its plans to extend Princesshay shopping centre, citing \"market conditions\" \nExeter City Council chief executive Karime Hassan and Labour council leader Pete Edwards attended a meeting in London on Friday at which they were told the massive investment would not go ahead. \nThe huge redevelopment of the area was set to create five new blocks up to 23m tall around a massive outside public amphitheatre. \nIt covered 17,739 square metres of internal floor space after the demolition of 7,195 square metres of existing buildings at Exeter Bus and Coach Station, 188 Sidwell Street and a row of shops on Paris Street. 14:27 This is how Exeter people reacted to our Facebook Live chat with Exeter City Council leader Pete Edwards \nAled Davies said: “For whatever reason, and perhaps it is the Paris Street closure scenario, it’s a complete shambles. \n“Where does the actual blame lie? Who is willing to put their head(s) on the block? Exeter is thriving and beautiful city but this a total shambles. \n“More regular updates and residents’ input is vital going forward.” \nChristopher Cook said: “We have a leisure centre at Exe Bridges!!” \nMelissa Gale said: “Why can’t the bus station and leisure centre be updated and put the rest of the money into things Exeter people would actually like in our city.” \nSteve Hole said: “Bet if it was student accommodation it would get the go ahead.” \nKeith Patch said: “The people of Exeter want a decent sized concert venue.” \nDonna Gibbins said: “I feelfor the little shop owners that have already sold up because of this development.” \nJane Harrow said: “The bus station in the city brings people into the heart of the city. Why the hell move it, it’s nuts.” 13:31 Motorbike crash outside Newton St Cyres primary school \nA motorcycle is involved in a crash on A377 near Sand Down Lane (Newton St Cyres Primary School). \nThere are reports of slow traffic due to the accident. 13:23 Exeter MP Ben Bradshaw blames Brexit and the collapse of sterling \n“This is very disappointing news from Crown Estates, but, as their statement makes clear, it reflects the significantly worsening investment climate across Britain because of the ongoing economic uncertainty caused by Brexit, with retail suffering in particular from inflation caused by the collapse in sterling. \n“I’m sure Exeter City Council will want to look at alternative plans to deliver long overdue improvements to this part of Exeter.” 13:07 Chamber of Trade 'disappointed' \nDerek Phillips, vice president of Exeter Chamber of Commerce and Industry, said: “The Chamber is disappointed that the developers have pulled out of the scheme. \n“We fully support the City Council in seeking an alternative proposal to ensure that this very important area is improved, to complement the great success of Princesshay.” 13:05 Statement from Exeter City Council leader Pete Edwards - the council will retender and wants a new development by 2020 \nExeter City Council leader Pete Edwards said: “The Crown Estate/TH Real Estate have informed us they are no longer able to proceed with their plans for the redevelopment of the city centre site. They cited market conditions when we visited them in person on Friday. \n“In addition, negotiations over the tender for our scheme have proved difficult - with a risk that costs could escalate further. This is unacceptable to us. Therefore I intend to ask the council to retender, with a view to addressing design implications imposed by The Crown Estate/TH Real Estate’s withdrawal. \n“This is likely to have an impact on the timeline by around a year - potentially opening now in 2020. \n“Our resolve and ambition, to create a strong city centre, remains. \n“I am calling a special council meeting to discuss the way forward with colleagues to reaffirm our commitment to a new bus station and leisure centre where we intended it to be. Now more than ever, I am determined the bus station and new flagship leisure facilities will take place. The bus station will close as expected. \n“We however need to take a short pause to reflect on these events - and also to work through potential options to bring the whole site to completion. \n“I would like to thank you for all your support so far and anticipated support in the coming months as we continue to do everything in our gift to deliver a project the city deserves.” 13:00 Timeline: The history of the site since plans to redevelop the bus station began in 1984 12:58 Official statement from the Crown Estate and TH Real Estate \nThe Crown Estate and TH Real Estate not progressing proposed extension to Princesshay shopping centre, Exeter \nThe Crown Estate and its partner TH Real Estate regret to announce that they are no longer able to progress the proposed extension to the Princesshay shopping centre in Exeter due to current market conditions. \nThe proposals, first submitted for planning approval in July 2015, had included a redevelopment of the bus and coach station site into new restaurants, shops and a cinema. \nThe partnership was committed to providing a successful development for Exeter, which required the right mix of shops and restaurants to take the space. Unfortunately in the current market, many retailers and restaurateurs are now more cautious about making new commitments, particularly in proposed developments, which take time to build and therefore require a commitment several years ahead. \nBoth partners remain committed to Exeter City and to the existing Princesshay shopping centre, which continues to be a fantastic retail and restaurant destination, with recent lettings to Lush and New Look Men. \nJohn Grinnell, ‎Deputy Head of Development and Project Management at The Crown Estate, said: \n“We know this is disappointing news for many people, including for our own team who have been working hard for over two years, along with a team of architects, agents and advisors, to try to make this project work. We want to be clear that we remain as committed as ever to Exeter and to the existing Princesshay centre, which is a fantastic shopping and restaurant destination in its own right. We’re now looking at what more we can do at Princesshay to further enhance the experience for shoppers and will continue to work closely with the Council and others in the area to help achieve this.” More On ", "external_links": [], "published": "2017-09-25T16:27:00.000+03:00", "crawled": "2017-09-25T17:11:27.007+03:00", "highlightTitle": ""}