{"organizations": [], "uuid": "3ced4ea77ea5c86e501c4ae2ecd17cb3c30a2666", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11927891.ece/ALTERNATES/s1200/JS39138120.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/moving-transport-boost-business-growth-13608480", "country": "GB", "domain_rank": 21960, "title": "Get moving on transport to boost business growth, Fastest 50 organiser demands", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-13T02:01:00.000+03:00", "replies_count": 0, "uuid": "3ced4ea77ea5c86e501c4ae2ecd17cb3c30a2666"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/moving-transport-boost-business-growth-13608480", "ord_in_thread": 0, "title": "Get moving on transport to boost business growth, Fastest 50 organiser demands", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "hadaway", "sentiment": "none"}, {"name": "jamie martin", "sentiment": "none"}], "locations": [{"name": "liverpool", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "baltic", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "carlisle", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "baltic", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "ward hadaway fastest", "sentiment": "none"}, {"name": "ward hadaway north east fastest", "sentiment": "none"}, {"name": "wear metro fleet", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get moving on transport to boost business growth, Fastest 50 organiser demands Newcastle law firm Ward Hadaway has warned that central government must action transport improvements across the region Share Jamie Martin, managing partner at Ward Hadaway Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCentral government “really needs to get moving” on transport improvements across the North if it is serious about business growth, a leading lawyer has warned. \nJamie Martin, managing partner at UK Top 100 law firm Ward Hadaway, which organises the definitive run-down of the fastest growing companies in the region, the Ward Hadaway Fastest 50 , says that practical steps and spending commitments are urgently required for the Government’s rhetoric on the Northern Powerhouse to become a reality. \nWard Hadaway, which has offices in Newcastle , Leeds and Manchester, has been charting the fortunes of the North East’s fastest growing companies with its annual Fastest 50 since 1998. \nAnd with this year’s awards – the 20th in the event’s history – less than a month away, the firm’s managing partner says that transport infrastructure improvements are a vital part of ensuring that future Fastest 50 companies can survive and thrive in the region. \nJamie Martin said: “Whilst many things have changed quite dramatically since we first held the Ward Hadaway Fastest 50 in 1998, in some respects the situation with regard to transport links within the North and further afield has remained almost static. \n“For example, the A1 in Northumberland – the key road route connecting the North East to Scotland – is still single carriageway for much of its duration, as is the A69 connecting Newcastle and Carlisle. \n“The Tyne and Wear Metro has been extended and is being modernised, but the exact same trains are running on the network as they were in the 1980s and it remains the case that it is in some cases quicker to get from Newcastle to London on the train than it is to travel from Newcastle to Liverpool. \n“At Ward Hadaway, we are fortunate to work with some of the best businesses right across the North and we get to see at first hand how their innovation and excellence is helping to drive the economy forward. \n“Better transport links could accelerate this process still further, expanding the size of the talent pool from which companies could recruit by cutting down journey to work times as well as speeding up routes to market. \n“I believe it could also encourage greater trade and co-operation between different areas of the North, all of which is even more important given that Brexit is less than two years away.” \nHowever, whilst the Government has acknowledged that improving transport across the North would boost the region’s economy, Ministers have so far proved reluctant to back warm words with hard cash. \nWhile Highways England last week published its preferred plans for a £290m scheme to dual the A1, no decision has been taken on an update to the ageing Tyne and Wear Metro fleet, despite pressure from the CBI and the Federation of Small Businesses. \nTransport Secretary Chris Grayling has also backed plans for a £30bn Crossrail 2 scheme in London whilst axing electrification of the Transpennine rail line and said the North must “design and manage” transport improvements itself. Ward Hadaway North East Fastest 50 Awards 2016 held at the Baltic, Gateshead (Image: Newcastle Chronicle) \nJamie Martin, who is also a former CBI North East regional chairman, said: “This runs the risk of creating a piecemeal set of improvements at a time when a joined-up approach is what is required, as can be seen by the way in which the different areas of the North have come together to call for a better deal for the region as a whole. \n“There appears to be a greater consensus among civic leaders in places like Newcastle, Leeds, Manchester and Liverpool about this issue than there has been for anything else for a long time and the ability to put forward a united case for investment is a great asset for our case. \n“The work of Transport for the North in putting together a costed, comprehensive blueprint for investment also cannot be underestimated and hopefully this combination of political unity and informed expertise will prove a success. \n“Better transport isn’t a ‘magic bullet’ solution to instantly improve our economy and our lives but, over time, it has the potential to put the North on the fast track to further growth.” \nThe North East’s current pace-setting, privately owned companies will be revealed later this month when The Journal publishes the A to Z list of the Ward Hadaway Fastest 50 for 2017. Read More Fast growing companies must face up to challenges of Brexit, Fastest 50 organiser says \nThe list is compiled using publicly available data from Companies House which is then independently verified. \nThen on October 6 in an event at BALTIC, the Centre for Contemporary Art, in Gateshead, awards will be given to the fastest growing small business, the fastest growing medium-sized business and the fastest growing large business. \nOne of these three winners will then be named as the overall fastest growing business in the North East for 2017. Like us on Facebook", "external_links": [], "published": "2017-09-13T02:01:00.000+03:00", "crawled": "2017-09-13T02:17:49.000+03:00", "highlightTitle": ""}