{"organizations": [], "uuid": "ddf78d69282dbbc0e0e634c0722a4328a37f9c0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13648668.ece/ALTERNATES/s1200/CPE.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/food-drink-news/colonel-porters-emporium-newcastle-review-13648363", "country": "GB", "domain_rank": 21960, "title": "Colonel Porter's Emporium: what's the food like at one of Newcastle's newest restaurants?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-20T15:50:00.000+03:00", "replies_count": 0, "uuid": "ddf78d69282dbbc0e0e634c0722a4328a37f9c0c"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/whats-on/food-drink-news/colonel-porters-emporium-newcastle-review-13648363", "ord_in_thread": 0, "title": "Colonel Porter's Emporium: what's the food like at one of Newcastle's newest restaurants?", "locations": [], "entities": {"persons": [{"name": "porter", "sentiment": "negative"}, {"name": "mains", "sentiment": "none"}, {"name": "baba", "sentiment": "none"}, {"name": "whitby", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "vanilla crumble", "sentiment": "none"}, {"name": "dean street", "sentiment": "none"}], "locations": [{"name": "newcastle city", "sentiment": "none"}, {"name": "dean street", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}, {"name": "wellington", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "milburn house", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "newcastle brown ale", "sentiment": "none"}, {"name": "prawn cocktail sandwich filler taco", "sentiment": "none"}, {"name": "arcadian", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Colonel Porter's Emporium on Dean Street in Newcastle City Centre Share Get what's on     \nCross yourself upon entering, for you are treading upon cursed ground. \nMilburn House has been home to some popular restaurants over the last few years but all have met gruesome ends. \nCanteen and Cocktails; Oak; Oldfields. All gone. \nTucked away largely below ground level at the bottom of Dean Street (a hellish slog when you’re three courses deep), businesses here seem to vanish. \nBut never mind, another newcomer has decided to give it a shot: Colonel Porter’s Emporium – a restaurant that comes with a “story”. Colonel Porter's Emporium on Dean Street in Newcastle City Centre (Image: Newcastle Chronicle) The restaurant \nThe founding myth transports us to “back in the day” when Master Brewer Colonel Porter invented Newcastle Brown Ale. \nThey say that Porter travelled the world, “led by the stars”, on a quest to distribute his beer round the globe and this Emporium, they say, celebrates this journey. \nHow? I have absolutely no idea whatsoever. I spent an hour there and I still don’t get it. \nSo, they serve Newcastle Brown Ale, like many bars in town, but what a “botanical garden and rhum bar” has to do with it I have no idea. \nAnd that annoying “rhum” spelling? It comes from a niche type of French Caribbean rum apparently, another pointless stylistic twist. \nInside, guests are exposed to a jumble sale of tat which falls into the “old fashioned” category, an explosion of uber-kitsch, colonial-chic tomfoolery that appeals in the same way that Boris Johnson kind of does but doesn’t – and nowhere near as much. (Image: Newcastle Chronicle) \nApparently, this is a stab at a 1920s theme, which is exactly not what dead animal heads mounted on the wall and portraits of Queen Victoria make me think of. \nI didn’t particularly like the Brexit-dressing-up-box interior to begin with but I was willing to give it the benefit of the doubt – and then I tried the food. \nOnce you’ve endured three courses, what might have seemed playful starts to come across as abrasive and irritating. \nIt’s all pretty ungratifying and, because I know you all have busy lives, I’m going to say this early to spare you some time: the food, in my opinion, is bad. Really bad. Starters \nThere are no starters on the menu so we ordered a couple of “small plates” – a ludicrous new label invented by and for people who struggle with the distinction between ‘starters’ and ‘tapas’. Starters at Colonel Porter's Emporium (Image: Reporter) \nFirst, the ‘Lobster Taco’ - or, as you may know it, the Prawn Cocktail Sandwich Filler Taco. \nAny trace of lobster meat is completely lost in a gloopy mayo which completely dominates the dish, rendering it sickly and dull. \nThis is supermarket-level fare – and it cost more than £8. \nAlongside that, we ordered the ‘Northumbrian pinwheel’ – or, as you may know it, the Sausage on a Plate. Starters at Colonel Porter's Emporium (Image: Reporter) \nThe Sausage on a Plate comes covered in BBQ-flavoured ketchup and an unidentified condiment which may or may not be the promised “mustard glaze” and sits alone, in all its `sausageness’, in the middle of the plate. \nIt’s hard to hate because, you know, it’s a sausage on a plate but, reader, you can have Sausage on a Plate at home. \nThis is scran-van fare – and it cost a fiver (which is steep for a scran-van). Mains \nMy friend ordered the fettuccine, which apparently consisted of “fresh egg pasta, Whitby crab meat, white wine, garlic fresh herbs and parmesan”. Mains at Colonel Porter's Emporium (Image: Reporter) \nIt’s hard to order a naff pasta dish in Newcastle but here it is – an extravagantly bland meal. \nThe pasta doesn’t taste at all fresh, the crab meat resembles the chewy rubbish you get in a tin and any promise of white wine, garlic or parmesan appears broken – but we really should have known better than to order an Italian dish in sight of three Union flags. \nI went for something with a more Arcadian bent, ‘Beef Roly Poly’, billed as “tender beef cheeks rolled in suet pastry, creamy mashed potatoes, smoked bone marrow, Brown Ale gravy and crispy shallots”. Mains at Colonel Porter's Emporium (Image: Reporter) \nThe meat in the ‘roly poly’ – which is somewhere between a beef Wellington and a strudel – is tough and has an unpleasant aftertaste, like it has been sitting in its juices too long. \nIt’s served alongside a dollop of mashed potato, which is fine, and a pot of gravy, which is also fine, no more, no less. \nI had a long, hard look at the bone marrow, served artlessly in a shard of femur, but that’s not the sort of thing you want prepared for you by someone who seemingly cannot hack pasta. \nBy the way, vegetarians: unless you want macaroni cheese without Parmesan, there’s absolutely zilch for you on the mains menu. Desserts Desserts at Colonel Porter's Emporium (Image: Reporter) \nBy this stage, all hope has faded but we solemnly pledge ourselves to a couple of desserts so we can review all three courses: ‘Rhum Baba’ and ‘Apple and Vanilla Crumble and Custard’. \nI’ll keep this short. \nFor a place which boasts about its “rhum” at the entrance, the Rhum Baba was notably un-rhumed and their attempt at apple crumble was as poor as their attempt at pasta was – and if you’re not getting pasta and apple crumble right, what’s left? Desserts at Colonel Porter's Emporium (Image: Reporter) Verdict \nThere’s a grim irony in Colonel Porter’s Emporium being at the bottom of the same hill The Botanist is at the top of, as if Dean Street is a literal sliding scale. \nBoth restaurants are basically going for the same thing: spruced up pub food, pricey cocktails and lavish surroundings. \nIf that’s what you’re into, go somewhere else, you deserve better – especially at £60 for two plus a couple of beers. \nWill the curse of Milburn House strike again? \nPerhaps, and maybe that’s a small mercy – because if this place is going to live and die on its food, it won’t be long of this world. Factfile", "external_links": [], "published": "2017-09-20T15:50:00.000+03:00", "crawled": "2017-09-20T16:41:52.005+03:00", "highlightTitle": ""}