{"organizations": [], "uuid": "042f2391a91cafd24ed6767d334d5fc593bb1cee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.liverpoolecho.co.uk/incoming/article12549610.ece/ALTERNATES/s1200/JS110710494.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-eu-withdrawal-bill-controversial-13577212", "country": "GB", "domain_rank": 21960, "title": "What is the EU withdrawal bill and why is it so controversial?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-05T18:55:00.000+03:00", "replies_count": 0, "uuid": "042f2391a91cafd24ed6767d334d5fc593bb1cee"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-eu-withdrawal-bill-controversial-13577212", "ord_in_thread": 0, "title": "What is the EU withdrawal bill and why is it so controversial?", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "henry viii", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "neutral"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union share european union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What is the EU withdrawal bill and why is it so controversial? The European Union (Withdrawal) Bill used to be called the Great Repeal Bill, and it's an essential part of leaving the European Union Share European Union flag in front of Big Ben Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMPs debate a vital piece of Brexit legislation this week. And Government Ministers, who back the Bill, are bracing themselves for a battle with the Labour opposition, which is likely to vote against it. \nIt’s called the European Union (Withdrawal) Bill, although it’s also been known as the Great Repeal Bill. \nBut what is it and why is it so important? What is the European Union (Withdrawal) Bill? \nIt stops the European Union having the ability to impose laws on the UK. \nSpecifically, it repeals the European Communities Act 1972, although the change only comes into force on the day that Brexit takes place. \nAnd that will mean that EU law no longer has supremacy over legislation passed by the UK Parliament and rulings made by UK courts. \nOf course, it follows the result of the EU referendum in June 2016, when the nation voted for Brexit . \nExperts have called it the most significant constitutional bill since the UK joined the EU in 1973. But it also provides continuity \nThe Bill is provides “legal continuity” by copying over the entire body of EU law into UK law. \nThat means that existing EU rules and regulations will stay in force even after Brexit. They will be known as “retained EU law”. \nThe difference will be that these laws can now be abolished by the UK if it wishes. \nAccording to the Government, the idea is to provide stability rather than simply leaving huge holes in UK law on exit day. Read More Who will last longest - Theresa May or Jeremy Corbyn? Why is it controversial? \nLabour supports leaving the EU, and also supports the principle of keeping EU laws in place at first. \nHowever, there are objections to measures in the Bill which give Government Ministers the power to make changes to retained EU law. \nIn some cases, the Government will be able to change legislation which has previously been debated and voted on in Parliament. \nThis is what’s known as a “Henry VIII” power, after the Tudor monarch. \nLabour says it will oppose the Bill because it makes Government Ministers more powerful than Parliament. \nA spokesman said Labour MPs would be asked to oppose the European Union (Withdrawal) Bill because it would “let Government Ministers grab powers from parliament to slash people’s rights”. \nHowever, Labour’s position could change if the Bill is amended to introduce more safeguards. Read More Why is the slow pace of Brexit negotiations angering some North East politicians? What does the Government say? \nThe Government insists Henry VIII powers contained in the Bill will not be used to make significant changes, and only to make technical amendments to EU law through secondary legislation. \nPrime Minister Theresa May’s official spokesman said the measures in the Bill were required to provide certainty for business and continuity during the period of exiting the EU. \nThe Government has been clear the powers it proposes for “correcting” details within the legislation being transposed onto the UK statute book will be time-limited, said the spokesman. \nAnd he stressed that any “significant” changes would be subject to primary legislation - which means they are debated by the House of Commons - in a series of new laws covering issues like immigration, trade and customs. \nThe spokesman said: “The whole point of the repeal bill is to mean supremacy of EU law in the UK will end and all laws will be made in Westminster, Edinburgh, Cardiff or Belfast, not in Brussels. \n“That bill will provide a smooth and orderly exit from the EU and stand trade talks with the EU in good stead, since both sides will start from a point of exact equivalence.” Like us on Facebook", "external_links": [], "published": "2017-09-05T18:55:00.000+03:00", "crawled": "2017-09-05T19:35:26.002+03:00", "highlightTitle": ""}