{"organizations": [], "uuid": "1fe5b64edb5df9f4d6101568d6edbe57d4476eb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13692467.ece/ALTERNATES/s1200/asr_paul2.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/how-north-east-automotive-alliance-13692248", "country": "GB", "domain_rank": 21960, "title": "How the North East Automotive Alliance is driving sector to a whole new level", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-29T13:42:00.000+03:00", "replies_count": 0, "uuid": "1fe5b64edb5df9f4d6101568d6edbe57d4476eb0"}, "author": "Anne Southby", "url": "http://www.chroniclelive.co.uk/business/business-news/how-north-east-automotive-alliance-13692248", "ord_in_thread": 0, "title": "How the North East Automotive Alliance is driving sector to a whole new level", "locations": [], "entities": {"persons": [{"name": "brexi", "sentiment": "negative"}, {"name": "matt boyle", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "matt walker", "sentiment": "none"}, {"name": "mark lane", "sentiment": "none"}, {"name": "butler", "sentiment": "none"}, {"name": "paul butler", "sentiment": "none"}], "locations": [{"name": "qashqai", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "north east automotive alliance", "sentiment": "negative"}, {"name": "ac", "sentiment": "none"}, {"name": "caterpillar", "sentiment": "none"}, {"name": "university of sunderland", "sentiment": "none"}, {"name": "neaa", "sentiment": "none"}, {"name": "automotive council", "sentiment": "none"}, {"name": "komatsu", "sentiment": "none"}, {"name": "sevcon", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "iamp", "sentiment": "none"}, {"name": "nissan motor manufacturing uk", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business How the North East Automotive Alliance is driving sector to a whole new level Despite Brexit uncertainties, the region’s automotive sector is riding the crest of a wave, as MARK LANE discovers Share Paul Butler of NEAA and Matt Boyle, president of Sevcon, at the company’s production facility in Gateshead Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThese are strange times for the North East manufacturing sector. \nOn the one hand we have Brexit and all the uncertainty this has brought for businesses which trade internationally. \nYet on the other we have the automotive sector – a sector which, touch wood, looks to be entering a tremendously exciting new era which offers an array of opportunities for the region’s automotive supply chain. \nThe sheer scale of these opportunities was made clear to me when I recently caught up with Paul Butler, chief executive of the North East Automotive Alliance. \nThis increasingly prominent organisation has carried out a detailed analysis of the companies currently operating in the North East automotive sector – and results came as a welcome surprise. \n“We wanted to truly understand the size of the region’s automotive sector,” Butler tells me. \n“We now have evidence to prove the sector generates sales of over £11bn annually in the North East and we directly employ over 30,000 within the manufacturing companies and supply chains linked to automotive. \n“The sector is predicted to grow by more than £3bn by 2021 and we should see in the region of 3-5,000 new jobs created by then depending on who comes into the UK.” \nFigures such as these give credence to the idea that manufacturing is making a genuine comeback in the North East, led primarily by the automotive sector. Qashqai production at Nissan (Image: Matt Walker) \nThat said, the manufacturing sector we see now is a different animal altogether to yesterday – cleaner, more tech driven and with huge global ambition. \n“Nissan may have provided the initial lightning rod but in its wake we have seen the spawning of a remarkable supply chain, characterised by technical innovation and the adherence to world class standards. \n“Automotive is a very important sector to the region,” Butler says, with notable understatement. “Undoubtedly the automotive industry has gone through a significant renaissance period in the North East, and the UK. \n“We have seen a lot of investment coming into the UK and it’s no coincidence that this coincides with a period overseen by The Automotive Council (AC), which has been highly influential for the sector. \n“That has been a private and public sector partnership where we have key industrialists who sit on the AC alongside government officials and that aids much better cooperation across the sector. \n“They set out a UK strategy in 2013 for the sector and that has been taken on board across the UK and also within our own organisation and amongst our members.” \nThis brings us onto the organisation Butler heads up. The North East Automotive Alliance is a membership organisation which, since setting up in March 2015 to support the growth and competitiveness of the region’s automotive sector, has proved conclusively that industry cooperation within the region can provide the much-needed strategy and direction the sector requires. Paul Butler \nCrucially, the Alliance is industry-led, with an executive and advisory board who formulate a strategy for the group centred around five key schematic areas of activity. \nThese include networking and connectivity, business competitiveness, skills, innovation and technology, and trade and investment. \nObviously, there is an element of cross-over between all of these, although the overriding objective is improving the international competitiveness of the region’s automotive sector – ensuring it is, and remains, world class. \nThe NEAA is about bringing added value and ensuring the North East’s automotive industry maximises its huge potential. \nThe past 18 months have seen some real challenges for the sector, the most notable of these being the uncertainty generated by the prospect of Brexit, and the related currency volatility this has brought. \nThere have also been concerns raised about the long-term commitment of Nissan to the region. \nBut recent announcements would suggest the Japanese car giant remains as committed to Sunderland, and our region, as ever. \nAsked for his own thoughts on the current state of play, Butler says: “We are going through quite a significant growth period and the North East remains a highly globally competitive region for automotive manufacturing. \n“We have been fortunate that Nissan has announced that the new generation of the Juke, Qashqai and X-Trail will be built at its Sunderland plant and that’s given a level of certainty to suppliers for the supply chain to be able to make investment decisions and develop their business plans for the next seven-to-10 years. \n“That level of certainty has helped issues around Brexit in the short-term, although in the long-term we don’t know what impact that might have on the region.” \nButler says the planned International Advanced Manufacturing Park (IAMP) is hugely important for the region’s automotive sector. \nIMAP is planned for land to the north of Nissan’s main Sunderland site, the country’s largest car manufacturing plant. \nButler explains: “This was highlighted by the government as a key strategic infrastructure project for the UK and is linked to Nissan’s commitment to next generation vehicles and an associated production base for those vehicles. \n“IAMP will be a location for companies moving to the region to support Nissan’s growth and expansion, so we have the potential to go through quite a significant growth period over the next three to four years. \n“Overall, it’s an extremely positive picture for the North East automotive sector at present.” \nWhile Butler is naturally optimistic about the prospects for the automotive sector, he also recognises that challenges lie ahead. \nUncertainty over Brexit, which already seems to be dragging on far longer than any of us would have wanted, are far from helpful. \n“Nobody knows what the impact will be until we know what happens in terms of trade deals,” he says. \n“Obviously we are pushing what we would like in terms of a trade agreement for the sector, but until those trade talks are finalised, we really cannot see what impact Brexit will have. \n“It’s very much about continuing to do what we do, improving regional competitiveness and as and when those negotiations are complete we’ll get a true understanding of its impact.” \nOne thing Brexit has done is create exchange rate volatility. This is very much a double-edged sword. \nWeak sterling provides a boon for exporters but means the cost of importing parts has soared. \n“Sterling’s depreciation supports export obviously, so it’s been good for the likes of Nissan, Komatsu and Caterpillar, and makes them more competitive,” Butler says. \n“On the other hand, there are companies in the supply chain who rely heavily on the European market for parts etc, so they have seen an increase in their cost base. \n“Overall it’s had a mixed impact, hence the reason why one of the key focuses of the sector is to try and localise as much content as possible. \n“While many parts are being imported, companies are now looking at alternative suppliers in the UK and we need to work with the sector to try and support that localisation agenda.” \nBut could the government be doing more? Is enough support being given to the region in terms of manufacturing infrastructure, logistics and so on? \nButler said: “To secure a free trade agreement would be the best possible outcome from Brexit. \n“In terms of other support for the sector we have a once in a lifetime opportunity around IAMP in the growth and expansion of the sector.” \nHe continued: “With the sort of production volumes Nissan are predicting, we have an opportunity through IAMP to attract companies into the UK to support that growth. \n“The reality is that these are globally-mobile organisations which have operations across the world in many cases and therefore we are directly competing with other European locations. \n“To this end we would like to see more support from the UK government around getting those businesses into the UK. \n“Other European regions offer attractive incentives, but at the moment there is nothing available of that nature in the UK to support potential inward investors.” \nAll of this said, Butler’s overriding message is one of positivity. In the North East, he believes we are witnessing a switch towards near-shoring, with automotive playing its own very important part. \nButler is sure this is a trend we will see continue, helped by organisations such as the NEAA. \n“The continued growth of the automotive sector is likely to see UK manufactured content increased within the region, with more localised content,” he added. \n“We are currently as a sector across the UK standing at around 44% of local content going into UK-built cars. \n“That figure has increased from a low point of 35% but we need to get that up to the sort of levels Germany has (more than 60%). \n“To do this we need to continue to attract new companies, and get more companies supplying into automotive which then supports the cost competitiveness of the sector.” \nOne issue which may cast a shadow over the UK automotive industry is automation/digital manufacturing and its impact. \nAgain, Butler is positive on the subject: “It is about working with industry to make sure they maximise the opportunities from any technological advancements. While many feel automation will result in a loss of jobs, the fact is nationally we are expecting 100,000 jobs over next five years or so.” \nHe continues: “Quite simply we do not have the capacity to fill these vacancies and automation is one way we can actually take people from less demanding jobs and upskill them and move them into higher value jobs that are more challenging and more rewarding.” \nAnd what of his own organisation? What part will it play in automotive’s renaissance as we move forwards? He says: “We want to continue with the growth and supporting the local automotive sector. \n“We are already the largest automotive cluster in the UK – we have over 250 member companies, and we’re looking to continue growing that base. \n“We constantly review our strategy with industry and our advisory board to make sure all of our activities are aligned to the needs of the sector.” \nOne important area nearing fruition is the plan to establish a Centre of Excellence in Sustainable Advanced Manufacturing (CESAM) on the IAMP. \nThese have been developed alongside Nissan Motor Manufacturing UK and the University of Sunderland and will support companies to incorporate the latest developments in science, technology and management. \nHe adds: “Uniquely, CESAM is designed to accelerate the adoption of innovations by demonstrating and proving them to industry standards on full-scale, moving production lines. There is no similar facility in the UK.” \nConcluding, Butler says: “We look forward to working closely with our existing members, and welcoming new companies into the region to ensure the North East remains a globally competitive region for automotive manufacturing.” Like us on Facebook ", "external_links": [], "published": "2017-09-29T13:42:00.000+03:00", "crawled": "2017-09-29T14:06:57.000+03:00", "highlightTitle": ""}