{"organizations": [], "uuid": "0d105e778fdd45c960487fc669ecf5a0c9c13044", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13565922.ece/ALTERNATES/s1200/airport.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-20m-newcastle-airport-upgrades-13565544", "country": "GB", "domain_rank": 21960, "title": "What £20m Newcastle Airport upgrades mean for its place in the world - and for you", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-03T15:00:00.000+03:00", "replies_count": 0, "uuid": "0d105e778fdd45c960487fc669ecf5a0c9c13044"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-20m-newcastle-airport-upgrades-13565544", "ord_in_thread": 0, "title": "What £20m Newcastle Airport upgrades mean for its place in the world - and for you", "locations": [], "entities": {"persons": [{"name": "mason", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "graeme mason", "sentiment": "none"}], "locations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "brexit britain", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA multi-million pound round of upgrades and renovations to Newcastle Airport is nearing completion - with more improvements in the pipeline. \nSince the beginning of last year, work has been carried out to improve customer services and behind the scenes operations in order to tweak the airport’s security and efficiency. \nLike all airports, the 2008 financial crisis and the economic slump that followed hit the business hard. \nBut, being on track for over million passengers this year, Newcastle Airport has recovered the ground it lost and is back in a strong position. \nAccording the to the airport’s director of planning and corporate affairs, Graeme Mason, the airport is now in peak condition and ready to play a role in Brexit Britain. \nMr Mason believes this round of investment, which was signed off on by board of local authority representatives who co-manage the facility, are key to its future. Graeme Mason (Image: North East England Chamber of Commerce) \nHe said: “The airport is a critical asset for the region in terms of the jobs and economic growth it delivers, to the extent it has a genuine impact on the competitiveness of the North East. \n“So it’s important that we are able to invest in it because that is what is needed to be considered ‘best in class’ and be recognised nationally as a quality airport. Newcastle Airport (Image: Newcastle Chronicle) \n“We put a list of investments to our board that amounted to around £20m over 2016 and 2017 and they’ve been supportive of those ambitions which is great. \n“This airport is a finely tuned machine so you have to keep it in good nick by investing and adding to it.” Read More Cheapest culture packed city breaks revealed and you can fly to two of the top three from Newcastle \nAmong the key upgrades is a £7.2m state of the art baggage system which is expected to be fully up and running by the end of the year. \nThe new equipment will improve security scans on suitcases, be more efficient and reduce the space for human error in determining where baggage ends up. Newcastle Airport new digital departure and arrivals information board (Image: Newcastle Chronicle) \nDragging the airport’s technology offering into the future has been central to this programme of improvements too. \nFree wi-fi for customers and business partners has been rolled out across the airport at a cost of £150,000 and a new £5m radar system has been installed to improve the effectiveness of air traffic control. \nA further £3m has been used to provide a new long-stay car park and the airport’s fleet of vehicles, including snowploughs which reduce disruption in the winter months, have been upgraded. \nFinally, new digital check in screens and a refurbished floor at the front hall of the airport have also been added. \nMr Mason said: “We want to deliver a good customer experience and currently get 99% of passengers through security in six minutes - I’m not aware of another UK airport which does that. Newcastle Airport bars (Image: Newcastle Chronicle) \n“In terms of technology, investment and innovation, I believe we are the forefront of airports in this country. \n“It’s a critical part of the region’s infrastructure so we can’t be complacent.” \nHe also promises that there is more to come, including plans announced earlier this year to extend the arrivals lounge by 4,800 sq ft to increase capacity and speed security checks up. Read More Why North East airports face a 'catastrophe' because of unfair competition from Scotland \nA public consultation on the long term plan for the airport up until 2035 will be launched around the end of this year and promises to paint an ambitious picture for what Newcastle Airport can achieve. \nAnd with the UK’s departure from the European Union looming, Mr Mason says he wants the airport to be in a perfect position to adapt to the new economic reality. \nHe said: “This airport is an international gateway for the North East. Newcastle Airport duty free (Image: Newcastle Chronicle) \n“We’ve got businesses in the region trading all over the world already but as we go into a post-Brexit world, air connections are going to be more important than ever. \n“Businesses need to be able to connect by air if we’re going to exploit new international markets.” \nThe investments come as think tank Policy North warn the SNP government’s decision to cut Air Departure Tax could see passengers opt to fly from Scottish airports to save money, which could in turn see passenger numbers in the UK decline. Like us on Facebook", "external_links": [], "published": "2017-09-03T15:00:00.000+03:00", "crawled": "2017-09-03T15:19:03.017+03:00", "highlightTitle": ""}