{"organizations": [], "uuid": "1fcbacdfa45ec70ff2b1fb76d732f381c82200f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13563527.ece/ALTERNATES/s1200/Corbyn-visit-to-Scotland.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-tells-labour-conference-13678779", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn tells Labour conference: I'm ready to be Prime Minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-27T09:30:00.000+03:00", "replies_count": 0, "uuid": "1fcbacdfa45ec70ff2b1fb76d732f381c82200f6"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-tells-labour-conference-13678779", "ord_in_thread": 0, "title": "Jeremy Corbyn tells Labour conference: I'm ready to be Prime Minister", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "jeremy corby", "sentiment": "negative"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "universal credit", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "national education service", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour leader Jeremy Corbyn (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJeremy Corbyn will declare that he is ready to be Prime Minister, in a confident speech to Labour’s annual conference. \nHe will tell activists that they won “Labour’s best vote for a generation” in June’s general election. \nMr Corbyn will say that Labour didn’t do well enough to kick the Conservatives out of power. But he will add: “We have become a government-in-waiting. \n“And our message to the country could not be clearer: Labour is ready.” \nThe conference speech comes as Mr Corbyn’s grip on his party is stronger than ever. So-called moderate MPs, who previously sought to remove him as leader, have been quiet since the party defied expectations and gained 30 seats in June’s poll. \nMeanwhile, the Conservative government appears increasingly divided, with Foreign Secretary Boris Johnson and Chancellor Philip Hammond at odds over Brexit. \nMr Corbyn will call on the Conservative cabinet to pull themselves together - or get out of the way so Labour can negotiate Brexit for Britain. \nHe will tell his party: “Against all predictions, in June we won the largest increase in the Labour vote since 1945 and achieved Labour’s best vote for a generation. It’s a result which has put the Tories on notice and Labour on the threshold of power.” \nThe Labour leader will say he is “ready” to lead a different type of government to those seen before, and will make businesses accountable to the public while public services will become “accountable to communities”, \nHe will promise: “Power will be devolved to the community, not monopolised in Westminster and Whitehall.” \nAnd he will claim that the Grenfell Tower fire , which killed an estimated 80 people in London, was a result of “a failed and broken system, which Labour must and will replace”. Read More Labour reveals plan to help 'Waspi' women hit by state pension age increase \nMr Corbyn will tell the conference; “The disregard for rampant inequality, the hollowing out of our public services, the disdain for the powerless and the poor have made our society more brutal and less caring.” \nThe current regime has “a tragic monument - the chilling wreckage of Grenfell Tower, a horrifying fire in which dozens perished, an entirely avoidable human disaster.” \nA key theme of the speech will be the need to prepare the UK for dramatic changes to the world of work resulting from artificial intelligence and robotics. \nMr Corbyn will promise to provide free training and education at all levels, to ensure people have the skills needed to succeed as the economy changes rapidly. Read More Newcastle was chosen for an experiment with Universal Credit and it was a disaster \n“As we move into a new era of huge industrial, technological and workplace change, we are committed to establishing a National Education Service. \n“And that will include, at its heart, free tuition for all college courses, technical and vocational training, so that no one is held back by costs and everyone has the chance to learn. That will give millions a fair chance. \n“Lifelong learning for all is essential in the economy of the future. The huge shift of employment that will take place under the impact of automation must be planned and managed. It demands the re-skilling of millions of people.” Like us on Facebook", "external_links": [], "published": "2017-09-27T09:30:00.000+03:00", "crawled": "2017-09-27T11:31:14.000+03:00", "highlightTitle": ""}