{"organizations": [], "uuid": "b1556fe8f13a42376fc165743db7c0a8c087a580", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/incoming/article518932.ece/ALTERNATES/s1200/GettyImages-182266083.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/devons-hindu-community-having-party-518993", "country": "GB", "title": "Devon's Hindu community is having a party - and we're all invited!", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-22T18:29:00.000+03:00", "replies_count": 0, "uuid": "b1556fe8f13a42376fc165743db7c0a8c087a580"}, "author": "Becky Sheaves", "url": "http://www.devonlive.com/news/devon-news/devons-hindu-community-having-party-518993", "ord_in_thread": 0, "title": "Devon's Hindu community is having a party - and we're all invited!", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "garba", "sentiment": "none"}, {"name": "navratri", "sentiment": "none"}, {"name": "manish gandhi", "sentiment": "none"}, {"name": "dandiya", "sentiment": "none"}, {"name": "sivlal", "sentiment": "none"}, {"name": "lesley robson", "sentiment": "none"}, {"name": "prem sivlal", "sentiment": "none"}, {"name": "navaratri", "sentiment": "none"}, {"name": "thomas hall", "sentiment": "none"}, {"name": "sandhya dave", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "puja", "sentiment": "none"}, {"name": "navaratri", "sentiment": "none"}, {"name": "cowley bridge rd", "sentiment": "none"}], "organizations": [{"name": "exeter hindu temple cultural and community centre", "sentiment": "none"}, {"name": "exeter steiner academy", "sentiment": "none"}, {"name": "exeter hindu temple trust", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Indian folk dancing is a key part of the Navaratri festival Share Comments \nFree pakoras are just some of the fun on offer this Saturday in Exeter at a special party being held by Devon’s Hindu community. \n“We celebrate every year the festival of Navaratri with food, music and dancing,” said Prem Sivlal, president of the Exeter Hindu Temple Trust. “This year we are inviting everyone to come along and join us.” \nNavaratri which means nine nights, is a Hindu festival celebrated each year with special folk dances. One is a clapping folk dance called called Garba and the other is a circular dance with sticks called Dandiya. Navratri is celebrated twice a year during the spring and autumn seasons and symbolises the triumph of good over evil \n“It is a fun festival where the different generations come together to honour the power and strength of women, as every evening a different Hindu goddess is honoured and celebrated,” said Mr Sivlal, a property developer who grew up in South Africa and who has lived in Devon for 40 years. \n“When I was a child, we would go to the temple to dance and celebrate every night for nine nights. Today here in Exeter, we are holding just one night of celebrations as we are a much smaller Hindu community but it will be lots of fun. We’d love for as many people from across the city as possible to come along and join us.” \nThe celebration will take place on September 23 at The Exeter Steiner Academy (Thomas Hall, Cowley Bridge Rd, Exeter EX4 5AD) between 7-11.30pm. \nThe evening will consist of dancing, learning about Navaratri, taking part in Puja (Hindu worship) and a delicious home-cooked Indian meal. \nDr Manish Gandhi, the chair of The Exeter Hindu Temple Cultural and Community Centre, said: “We are very excited to be sharing Navaratri, this annual fun and meaningful festival with the wider Exeter community. \n“Hinduism is a peaceful and open religion, and it is a pleasure to share our faith with others, especially with a joyous festival like Navaratri which is still very relevant today, celebrating equality and the important role of women.” \nDevon teenagers create documentary to tackle mental health \nThe Lord Mayor, Lesley Robson, will be attending. The event is part of a year-long project to celebrate diversity in Exeter. Previous events in the project have included celebrations of Eid at The Mosque and Cultural Centre in July and Polish Easter celebrations. Project Coordinator Sandhya Dave said: “This project is about bringing the people of Exeter and Devon together, and about learning, sharing and celebrating other heritages and faiths. \n“In the recent wake of the Brexit negative narratives and racism towards our migrant communities, we feel it’s more important than ever to show our neighbours and fellow residents that Exeter s a welcoming city and that we stand together with each other and are against hatred and intolerance”. \nFurther details about the project, and links to the event pages can be found on Facebook, at https://www.facebook.com/CelebrateExetersDivercity/ . Like us on Facebook", "external_links": [], "published": "2017-09-22T18:29:00.000+03:00", "crawled": "2017-09-22T18:52:32.002+03:00", "highlightTitle": ""}