{"organizations": [], "uuid": "a120a9f1ce9ddc7f64e72f372a921cc53d5d694e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article8295734.ece/ALTERNATES/s1200/GL3845678.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13571086", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Newcastle opening 'prosperity gap' with rest of North East, Barclays study shows", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-05T10:35:00.000+03:00", "replies_count": 0, "uuid": "a120a9f1ce9ddc7f64e72f372a921cc53d5d694e"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13571086", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Newcastle opening 'prosperity gap' with rest of North East, Barclays study shows", "locations": [], "entities": {"persons": [{"name": "battle bay", "sentiment": "none"}, {"name": "paul swinney", "sentiment": "none"}, {"name": "jill mcdonald", "sentiment": "none"}, {"name": "rovio", "sentiment": "none"}, {"name": "kati levoranta", "sentiment": "none"}, {"name": "mika ihamuotila", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "eastern england", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "helsinki", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "negative"}, {"name": "halford  halfords", "sentiment": "neutral"}, {"name": "coreena ford angry birds", "sentiment": "none"}, {"name": "angry birds", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "centre for cities", "sentiment": "none"}, {"name": "rovio entertainment", "sentiment": "none"}, {"name": "halfords", "sentiment": "none"}, {"name": "trema", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Redrow posts 'exceptional' results \nHousebuilder Redrow has hailed a record set of results, defying fears over a housing market slowdown and a volatile political and economic environment. The firm saw revenue rise 20% to £1.66 billion in the year to June 30, while pre-tax profit rose 26% to £315 million. \nRedrow saw completions rise 15% to 5,416 in the period and the average selling price of its homes increased 7% to £309,800. \nChief executive John Tutte said: “These exceptional results were achieved against an uncertain political and economic backdrop as a result of Brexit and also an ongoing requirement to manage an industry-wide shortage of skills to meet our build programmes.” \nThe results come amid mounting signs that the wider property market is cooling amid sluggish economic growth. \nRecent figures from Nationwide Building Society showed house prices dropped by 0.1% in August, signalling that pressure on household finances from Brexit-fuelled inflation is hitting buyer confidence. \nMr Tutte said that while Redrow’s strategy is to continue to grow the business, the rate of growth is expected to “moderate over time”. Nevertheless, Redrow has increased its medium-term guidance and now expects turnover in 2020 of circa £2.2 billion and pre-tax profit of £430 million. A Redrow housing development in Kent, as the housebuilder posted another set of strong results (Image: Gareth Fuller/PA Wire) 9.20 KEY EVENT Stadium Group powers ahead with record order book \nTeesside tech firm Stadium Group is powering ahead with a record order book as it unveils strong half year results. \nThe Hartlepool headquartered business, which supplies design-led technologies which are crafted and manufactured in the UK, Sweden and Asia. \nThe firm, which has two divisions, Technology Products and Electronic Assemblies, posted group revenues of £27.4m, up by 12.7%, for the six months ended June 30 2017. \nPre-tax profits also more than doubled, from £709,000 to £1.96m. \nWith a record order book, of £30.8m, a platform for growth overseas and a strong pipeline, directors said they were confident for the coming months. \nOperational highlights in the six months included the New Design Centre for Connectivity division going fully operational in Kista, Sweden, as well as the successful integration of the Cable Power acquisition. \nTechnology Products division accounted for 61% of total revenues, up from 57% in the comparable period, to £16.8m, while Electronic Assemblies income rose from £10.4m to £10.6m. \nChairman Nick Brayshaw OBE said: “We are very pleased with our performance in the first half of the year and the progress that we’ve made in establishing our position as a successful design-led technology business. \n“We believe that our operating model, focused around strategically located regional design centres, manufacturing centres of excellence and regional fulfilment centres, will allow us to deliver further accelerated growth going forward. \n“The continued positive momentum seen in the first half is further underpinned by our record order book and strengthening pipeline of new design wins which provides us with confidence in the full year outlook and beyond.” Stadium Group's Hartlepool facility Coreena Ford Kilfrost Limited returns to profit after 'turbulent' few years \nDe-icer manufacturer Kilfrost has boasted a return to profit after suffering from a “turbulent” three years. \nKilfrost Limited, which is part of the Kilfrost Group, makes de-icing fluid for aircraft around the world, but mild weather has led to poor trading at the Northumberland business in recent years. \nBut, after striking a major licensing deal earlier this year, Kilfrost’s operating profits rose to £2.2m for the year ending March 31. \nThe results are a significant imp­rovement on its performance during the previous year, when the firm made a loss of £559,000. The recent profit increase came about after Kilfrost sold off a number of assets in an attempt to refocus the business. \nInitially, the firm attempted to sell its aircraft de/anti-icing fluids (ADF) business to one of its main European competitors, Clariant. But, following an enquiry by the Competitions and Markets Authority, the deal collapsed. \nKilfrost continued its search for a buyer, but the discussions instead led the firm to signing a licensing deal with Solventis, which saw it take over the running of the majority of Kilfrost’s European business. Gary Lydiate, chief executive of Kilfrost 9.05 Coreena Ford Software firm Aveva agrees Schneider Electric tie-in \nEngineering software firm Aveva has agreed a multibillion-pound tie-up with the software arm of France’s Schneider Electric. \nThe deal, which comes after two failed merger attempts in the past two years, will create an industrial software giant with combined revenues of around £658 million and earnings of some £146m. \nThe merger will be structured as a so-called reverse takeover, with Schneider folding its software business into Aveva’s operations in return for a controlling 60% stake in the enlarged group. \nBut Aveva will keep its headquarters in Cambridge and remain listed on the London Stock Exchange. \nPhilip Aiken, chairman of Aveva, said: “The transaction will be transformational to Aveva, creating a global leader in industrial software, which will be able to better compete on a global scale.” 9.00 Coreena Ford £35m hotel with rooftop pool and nightclub planned for Newcastle's Grey Street \nA £35m plan to create a luxury hotel complex complete with a rooftop swimming pool, nightclub, restaurants and retail outlets has been unveiled for Newcastle city centre. \nLeisure operator Malhotra Group is behind the multimillion-pound scheme which will transform a number of buildings in the Grainger Town area, reinvigorating a huge property plot around a focal 120-bedroom hotel. \nThe Newcastle company, which also operates care and property divisions, has spent a number of years acquiring a number of buildings around Grey Street, with a view to creating a landmark hotel for the city centre. \nPlans were first mooted by the group seven years ago, when a spend of up to £15m was set to be ploughed into creating a 55-bed hotel on Grey Street. \nThat scheme has now been revised and goes far beyond original ambitions, encompassing nine existing buildings, seven of which are Grade II listed. \nThe site of the development, which is being overseen by designers Space Architects, will stretch from Grey Street down to its junction with Mosley Street and across to the lower part of Cloth Market. \nThe scheme includes the famous Balmbras music hall at the Cloth Market, with the aim of restoring it to its original identity, along with a plan for Drury Lane – the site of the original Theatre Royal – which will be home to a number of retail outlets within a glass-covered cobbled street. \nThe Malhotra Group said it sees the scheme as being the jewel in the crown of its impressive property portfolio and believes it will become a visitor attraction in its own right, as well as creating a significant number of jobs while boosting the local economy. \nThe development will also help strengthen the company’s foothold on Grey Street, where it operates the boutique Grey Street Hotel which recently underwent a £1.2m refurbishment. The block on Grey Street which is set to be transformed by The Malhotra Group (Image: Malhotra Group) 8.55 Coreena Ford Cake decorator sees headcount fall by 36 amid year of cost cutting \nThe number of staff employed at award-winning cake decorating business Culpitt Limited fell by nearly a quarter last year as the firm carried out a major cost-cutting exercise . \nCulpitt saw its workforce fall from 156 members of staff to 120 during the 2016 calendar year. The biggest fall in head count was in the firm’s management and administration team, which saw its numbers drop from 60 to 25. \nThe Ashington-headquartered business said it had been focusing on reducing costs over the year. \nIn the company accounts, finance director Simon Keogh said: “Steps were taken during 2016 to reduce overhead costs and focus on profitable baskets. By maintaining the core competencies of the business there is every reason to believe that the company can build on the foundations established.” \nThe cost-cutting plans were put in place after a restructuring exercise saw Culpitt fully take over the running of its subsidiary business, Eileen Grace Limited. \nAs part of the restructure, Eileen Grace ceased trading in September 2015 and all 14 of the firm’s staff were transferred to Culpitt in November. \nDespite the cost-cutting, Culpitt made a loss of £302,000 for 2016, after previously reporting an operating profit of £1m during the previous year. However, turnover at the firm grew by 6.4% to £18.2m. \nThe lion’s share of the growth came from its UK sales, which increased from £14m to £15m. Mainland Europe sales fell slightly from £2.71m to £2.68m. \nCulpitt said that Brexit had a “significant” impact on its financial performance, with the falling value of the pound increasing purchasing costs. Some of Culpitt products Coreena Ford Internet bookie 888 slumps to a loss \nOnline bookmaker 888 has been pushed into a half-year loss following a sanction for serious failings in its handling of vulnerable customers. \nThe group recorded a pre-tax loss of $17.3m(£13.3m) in the six months to June 30, compared with a $27.8m (£21.5m) profit last year. \n888 was stung by $50.8m (£39.3m) of exceptional charges, including $5.5m (£4.2m) set aside in connection with a Gambling Commission probe into its treatment of vulnerable customers. \nThe investigation found “significant flaws” in the bookmaker’s social responsibility processes and 888 agreed to pay £7.8m in total as a settlement. \nIt also took a $45.3m (£35m) charge linked to a potential historic VAT bill in Germany. \nTotal revenue increased 3%, or 9% on a constant currency basis, to $270.1m (£209m) in the period, helped by sports gambling, Sports sales rose 35% to $33.7m (£26m) and 888 said it benefited from launching into Italy and live betting. \nMobile also drove growth and accounted for 69% of UK revenue. \nBoss Itai Frieberger said: “Trading in Q3 has started well and in line with the board’s expectations. \n“Underpinned by this momentum as well as the proven strengths of the group’s business model, the board remains confident that 888 will achieve further progress and deliver its expectations for the full year.” Online bookmakers 888 has been fine £7.8m by the Gambling Commission 8.45 Coreena Ford Staycation summer boosts sales at Halford \nHalfords has notched up a hike in sales thanks to surging demand for roof boxes and camping gear as more Britons chose to “staycation” in the UK. \nThe car parts-to-bicycles chain said like-for-like retail sales rose 3.5% in the 20 weeks to August 18, with motoring sales lifting 2.3%. Halfords saw travel solutions sales jump 8.2% higher, driven by the rising popularity of holidaying in the UK in the face of poor exchange rates from the Brexit-hit pound. It also reported strong demand for bikes, with sales up 5.2% and electric bikes and repair services seeing strong performances. \nOutgoing chief executive Jill McDonald, who is leaving next month to head up Marks & Spencer’s fashion and homewares arm, said: “A combination of good planning and execution meant that we optimised sales from the staycation summer, with strong growth in camping, roof boxes and cycle carriers.” But the group saw a 2% drop in like-for-like sales at its autocentres service, leaving overall group-wide same-store sales 2.7% higher in the 20-week period. 8.40 Coreena Ford Angry Birds firm set to fly on the stock market \nThe company behind Angry Birds has announced its intention to list on the Helsinki stock exchange as it looks to raise 30 million euro (£27.6m). \nRovio Entertainment said that the stock market flotation will enable it to “pursue its growth strategy and improve strategic flexibility”. \nThe initial public offering (IPO) will see Trema, Rovio’s largest shareholder, sell down its stake. \nChairman Mika Ihamuotila said: “We believe Rovio is well positioned to succeed in the growing mobile gaming market and see a bright future ahead for the company. \n“The contemplated IPO and listing will offer new shareholders an opportunity to participate in Rovio’s success.” \nRovio, which has also recently launched Angry Birds Evolution, Battle Bay and Angry Birds Match, is on a high after reporting soaring revenue in the second quarter. \nLast month the firm said revenue rose to 86.2 million euro (£79.2m) in the period as it reaped the rewards of income from The Angry Birds Movie. \nThe growth was also driven by a 30% increase in the number of monthly paying users for its games and a 51% increase in revenue per monthly paying user. Chief executive Kati Levoranta said: “All of our recent launches - Angry Birds Evolution, Battle Bay and Angry Birds Match - have shown better performance in key performance indicators than any previously launched Rovio game, thus suggesting additional growth potential ahead. \n“I am confident in our games-first strategy. The contemplated IPO and listing are an important milestone in developing Rovio into an even stronger games-first entertainment company.” The Angry Birds movie - the firm behind the popular game is set for flotation 8.35 FTSE and pound latest \nThe FTSE-100 index at 8:15am was up 15.55 at 7427.02. \nThe pound at 8am was 1.2928 dollars compared to 1.2942 dollars at the previous close. The euro at 8am was 0.9209 pounds compared to 0.9208 pounds at the previous close. 8.30 KEY EVENT Rest of the North East can’t match prosperity boom in Newcastle \nA stark economic divide is emerging in the North East with Newcastle seeing a boom in wages and big falls in unemployment while the rest of the region struggles, a new study suggests . \nThe UK Prosperity Map produced each year by Barclays highlights Newcastle as an island of growth - making the Top 10 of UK cities - while the North East as a whole saw its economy worsen and was ranked at the bottom of the UK league table. \nThe Barclays study ranks areas on a range of factors, including numbers of millionaires, average earnings, business growth rates, house prices, and GDP per capita to generate a Prosperity Index score for each UK region and city. \nThe study showed Newcastle had both the highest increase in average earnings at 6.3% and the biggest rise in GDP per capita, a measure of the economic output in each region. The city also recorded the second largest fall in unemployment, being beaten only by Cardiff. \nThe Barclays study showed London remaining as the UK’s most prosperous region, followed by the South East and Eastern England. London was also the most prosperous city, followed by Reading and Cambridge. \nThe North East was ranked bottom of the 12 UK regions and was the only area of the country to see a fall in average earnings. \nDespite that, there are still thousands of millionaires in the North East. \nPaul Swinney, principal economist at the Centre for Cities, said: “This research illustrates the need for the Government’s forthcoming industrial strategy to address the barriers that currently prevent over parts of the country generating prosperity for their residents that is seen in the south-eastern corner of England.” Newcastle is emerging as as island of growth, according to the latest UK Prosperity Map More On", "external_links": [], "published": "2017-09-05T10:35:00.000+03:00", "crawled": "2017-09-05T10:52:47.000+03:00", "highlightTitle": ""}