{"organizations": [], "uuid": "35195fb0fd3111fb58a5fc5a50ddc7cd104e8d72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/incoming/article440082.ece/ALTERNATES/s1200/DSC_0026JPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/legal-kill-eat-feral-pigeon-441937", "country": "GB", "title": "Is it legal to kill and eat a feral pigeon?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-07T18:21:00.000+03:00", "replies_count": 0, "uuid": "35195fb0fd3111fb58a5fc5a50ddc7cd104e8d72"}, "author": "Zoe Stevens", "url": "http://www.devonlive.com/news/devon-news/legal-kill-eat-feral-pigeon-441937", "ord_in_thread": 0, "title": "Is it legal to kill and eat a feral pigeon?", "locations": [], "entities": {"persons": [{"name": "pcso sarah giles", "sentiment": "none"}, {"name": "melissa gill", "sentiment": "none"}, {"name": "gill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "food standards agency", "sentiment": "none"}, {"name": "rspb", "sentiment": "none"}, {"name": "rspca", "sentiment": "none"}, {"name": "the food standards agency", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "general licence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Is it legal to kill and eat a feral pigeon? Well, sometimes it might be… Share Gob smacked city centre police officers believe the pigeons' cruel capture was for food Share \nAfter reports by Devon Live that traders in Exeter saw a group of street drinkers stuff 14 live pigeons into a rucksack ‘for food’, we thought we’d investigate the laws around killing and eating feral pigeons. \nPCSO Sarah Giles, part of the city centre's policing team, described the unbelievable incident as part of 'blatant pigeon eating' recognised by police, and has pinpointed a particular group of drinkers responsible. \nOne anonymous trader said the incident last Thursday, which took place over 20 minutes, was \"horrifying\" to witness. Sidwell Street traders' have spoke of their horror after witnessing street drinkers stuff 14 pigeons into a rucksack in the space of 20 minutes \nThere are lots of different laws issued by lots of different governing bodies – and the outcome is slightly unclear. Is it legal to kill a feral pigeon? \nAccording to Natural England, the government’s advisor for the natural environment in England, killing wild birds could be legal under some circumstances. \nAs long as it can be proved that you are killing a wild bird to prevent serious damage to livestock, foodstuffs for livestock, crops, vegetables, fruit, growing timber, fisheries or inland waters, and prevent the spread of disease, and you adhere to the terms and conditions on the Natural England General Licence, you should be protecting by law. Read More \nThe licence also outlines how the birds must be killed – and there’s even a specific section for killing feral pigeons. \nThe General Licence permits authorised persons to kill or take any of the following wild birds: Crow Rook Woodpigeon \nThe General Licence also permits authorised persons to take, damage or destroy the nests, or to take or destroy the eggs of the following wild birds: Canada Goose Ring-necked Parakeet Egyptian goose \nThe General Licence also has lawful methods of killing the wild birds on the lists, or taking and destroying their nests: A semi-automatic weapon A cage trap, the dimensions of which do not satisfy the requirements Any hand held or hand propelled net to take birds whilst not in flight \nThere’s a separate section in relation to the killing or taking of Feral Pigeon: Any device for illuminating a target or any sighting device for night shooting; - any form of artificial lighting or any mirror or other dazzling device. \nHowever, the General Licence also makes it very clear that it only applies to landowners, occupiers and other Authorised Persons. Sidwell Street traders' have spoke of their horror after witnessing street drinkers stuff 14 pigeons into a rucksack in the space of 20 minutes \nThe second part of the Exeter incident which is may land the street drinkers in hot water is the Wildlife and Countryside Act 1981, which protects wild birds and other animals in England and Wales. \nThe fact that 14 pigeons were reported to be put into a single rucksack means that the birds will have been caused unnecessary suffering, which will be left to the RSPCA and the RSPB to investigate, along with police. Is it legal to eat a feral pigeon? \nThe answer is that it might be, but the Food Standards Agency don’t suggest it. \nMelissa Gill of Natural England, which oversees the permits in England, spoke to the BBC about the legality of eating wild birds. \nShe told them: \"The licensee is at fault if he sells on the meat of a bird he has killed under licence - it is a condition of the licence which he is granted that he does not do that.\" \nBut tucking into a dead bird which had been found in their garden or as roadkill would not contravene the act. Read More How to protect wildlife after Brexit \n\"It would not be illegal to eat it, so long as the individual could prove that they had not killed it and had discovered it dead,\" Ms Gill adds. However, the legal onus would be on the individual eating the bird to prove how and where they found it. \nThe organisation responsible for food safety, the Food Standards Agency, advises against making a meal of a newly discovered avian carcass. \n\"The Food Standards Agency would not advocate cooking and eating roadkill,\" a spokesman says. Read More \n\"There are various reasons for this, including the possibility that the animals you find may not have been healthy when killed and may have been suffering from disease or environmental contamination which could have an adverse effect on your health.\" Like us on Facebook ", "external_links": [], "published": "2017-09-07T18:21:00.000+03:00", "crawled": "2017-09-07T18:28:07.007+03:00", "highlightTitle": ""}