{"organizations": [], "uuid": "6522fd133a3611d78ec25d547c3e369d7453f1c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.plymouthherald.co.uk/incoming/article410060.ece/ALTERNATES/s1200/Farmer1.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/local-news/small-farms-devon-cornwall-invited-410022", "country": "US", "title": "Small farms in Devon and Cornwall invited to take part in Prince's Countryside Fund scheme", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-01T12:05:00.000+03:00", "replies_count": 0, "uuid": "6522fd133a3611d78ec25d547c3e369d7453f1c0"}, "author": "Athwenna Irons", "url": "http://www.devonlive.com/news/local-news/small-farms-devon-cornwall-invited-410022", "ord_in_thread": 0, "title": "Small farms in Devon and Cornwall invited to take part in Prince's Countryside Fund scheme", "locations": [], "entities": {"persons": [{"name": "cornwall  stephen", "sentiment": "none"}, {"name": "claire saunders", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mrs saunders", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "prince's countryside", "sentiment": "none"}, {"name": "east devon aonb", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "east devon area", "sentiment": "none"}, {"name": "taunton", "sentiment": "none"}, {"name": "prince of wales", "sentiment": "none"}], "organizations": [{"name": "phil mingo / pinnacle photo agency", "sentiment": "none"}, {"name": "prince’s farm resilience programme", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Small farms in Devon and Cornwall invited to take part in Prince's Countryside Fund scheme Applications have opened for the Prince's Farm Resilience Programme, which aims to tackle some of the biggest challenges faced by small farm businesses Share The Prince’s Farm Resilience Programme works to help small farms improve their way of working by providing business support, skills and planning tuition Share Comments \nSmall farm businesses across Devon and Cornwall are being invited to take part in the second year of the highly successful The Prince’s Farm Resilience Programme, run by The Prince’s Countryside Fund. \nProven to help small farms improve their way of working, the programme will provide free business support, skills and planning tuition, and one-to-one guidance to 20 small livestock and mixed family farm businesses. \nThe programme will be run on Dartmoor, in the East Devon AONB, and in Penzance in Cornwall. Applications are open from today (September 1) and will close on October 31. The programme will be run on Dartmoor, in the East Devon Area of Outstanding Natural Beauty (AONB), and in Penzance in Cornwall \nStephen, a farmer in Taunton who took part in the programme last year, said: “I’d recommend the programme to anyone. It’s a great learning experience and overall a fantastic programme. \n\"All the information has been of benefit somewhere along the line, from the initial benchmarking to the forward planning and succession sessions. The programme has really given us more confidence to move forward.” Read More Thousands more badgers set to be killed \nThe programme aims to tackle some of the biggest challenges being faced by small farm businesses across the UK. Developed off the back of The Prince’s Dairy Initiative, which has helped strengthen the UK dairy supply chain since 2012, the £1.5million programme will support up to 300 farm businesses this year. \nFarmers will be given the skills to evaluate their viability and make informed decisions about the future by using the Business Health Check Tool. The programme also brings together like minded family farm enterprises in local networks so they can review their current activity, and identify opportunities and improvements that can be made on-farm to build resilience. The Prince's Countryside Fund was established by the Prince of Wales in 2010 to improve the prospects of family farm businesses (Image: Phil Mingo / Pinnacle Photo Agency) \nClaire Saunders, director of the Prince’s Countryside Fund, said: “We are thrilled to be bringing The Prince’s Farm Resilience Programme to more locations this year, building on the excellent response to its first year. \n“The skills training and expert advice provided by the programme help farmers to cope with the many challenges that their businesses face, and allow them to plan for the future more confidently.” Read More Meet the driven young dairy farmer aiming to deliver free-range milk to Devon doorsteps \nResearch commissioned by the Fund and carried out by the University of Exeter into the future of the small family farm in the UK revealed a steep decline in numbers since the beginning of the century. Declining farmgate prices have also led to the average farm income falling below £20,000 for the first time since 2007. \nMrs Saunders added: \"With uncertainty caused by Brexit adding extra pressure to farmers, the programme is more important now than ever.\" \nIf you are interested in taking part in The Prince’s Farm Resilience Programme, or would like to find out more, visit www.princescountrysidefund.org.uk/farmresilience Like us on Facebook ", "external_links": [], "published": "2017-09-01T12:05:00.000+03:00", "crawled": "2017-09-01T12:54:52.000+03:00", "highlightTitle": ""}