{"organizations": [], "uuid": "96ab17a717ad078ca6fc71cb2727f7838931a2c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13563798.ece/ALTERNATES/s1200/corbynmay.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-last-longest-theresa-jeremy-13563457", "country": "GB", "domain_rank": 21960, "title": "Who will last longest - Theresa May or Jeremy Corbyn?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-03T10:00:00.000+03:00", "replies_count": 0, "uuid": "96ab17a717ad078ca6fc71cb2727f7838931a2c3"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-last-longest-theresa-jeremy-13563457", "ord_in_thread": 0, "title": "Who will last longest - Theresa May or Jeremy Corbyn?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May insisted she is “not a quitter” last week - and gave the impression she plans to lead the Conservative Party into the next election. \nBut the chances of her managing that are slim. \nMost Tory MPs want Mrs May gone well before the election takes place. \nBy contrast, Labour leader Jeremy Corbyn appears secure in his job, after Labour did much better in June’s election than many expected. \nBut there are also question marks about his future - after it was reported he told colleagues he wanted to quit in 2018. \nMrs May promised to fight on when she was questioned by journalists during a visit to Japan. Japanese Prime Minister Shinzo Abe welcomes British Prime Minister Theresa May to the Akasaka Guest House in Tokyo where they attended an official welcoming ceremony before holding talks (Image: Getty Images AsiaPac) \nAsked if she intended to lead the Conservatives into the next general election, she said: “Yes. There’s been an awful lot of speculation about my future which has no basis in it whatsoever.” \nAnd she added: “I’m in this for the long term. There’s a real job to be done in the United Kingdom.” \nBut perhaps she had to say that. Any leader who sets a date for their retirement risks being seen as a “lame duck” who has little authority. \nAnd it followed reports that she had pencilled in Friday, August 30 2019 as the day she will quit as Prime Minister. \nShe may have felt under pressure to dismiss that report. \nCertainly, Tory MPs don’t believe Mrs May can continue as Prime Minister for too long. Read More How the rising cost of living means wages are falling in the North East \nOne said: “Nobody in the Conservative party at all believes she will lead us into the next election.” \nA minority view among Conservative MPs is that the sooner she goes, the better. The Conservative party’s reputation has suffered enormous damage, and the party can’t start to deal with that until it has a new leader, according to some MPs. \nAnd critics say she’s out of her depth. They believe she is being propped up by colleagues such as Gavin Williamson, the Chief Whip, and Damian Green, the First Secretary of State (a role which effectively makes him deputy prime minister). \nBut most of them believe she has to continue for a while longer - perhaps until after Brexit takes place, which will probably be in March 2019. \nThere are fears a leadership election would be very destabilising, and could lead to a general election which Labour , led by Jeremy Corbyn, could win. \nIn fact, Mrs May is believed to have considered resigning after June’s humiliating general election, when she expected to win a landslide victory but instead lost her majority in the House of Commons. She was convinced to stay on by Tory colleagues. \nSo her position is safe, for now. But colleagues would be “waiting to pounce” if she really did appear determined to remain Tory leader into the next election. Labour leader Jeremy Corbyn (Image: PA) \nAs for Mr Corbyn, friends say he is enjoying being Labour leader more than ever. \nAnd he spent the summer doing what he loves most - speaking to adoring crowds in his whirlwind tour of the country, taking in a number of Conservative marginal seats. \nHis opponents in the Labour Party are in disarray. The “Blairite” or moderate wing have nobody willing to step up to the plate and publicly challenge him, and show no sign of having any new ideas beyond a desire to win power. \nLabour has begun to establish itself as the party of “soft Brexit”, after senior figures such as Shadow Brexit Secretary Keir Starmer and Deputy Leader Tom Watson said the party now only backed a transition period after Brexit in which the UK would remain in the single market, but could consider permanent single market membership. \nThis appears to be a change of policy, as Labour Shadow Chancellor John McDonnell, an ally of Mr Corbyn, said in June that voters would interpret continued membership of the single market as “not respecting” the result of the EU referendum. Read More Japan Prime Minister insists Japanese investors have faith in the UK after Brexit \nBut it removes one of the grievances some Labour MPs had against Mr Corbyn - that he was pursuing a “hard Brexit” policy indistinguishable from the approach of the Conservative Government. \nWhether it was a genuine complaint or, perhaps, a good excuse for his opponents to attack him, it’s now much less of an issue. \nLabour figures agree that Mr Corbyn can remain leader at least until he has another chance to lead Labour into a general election. \nHowever, there’s one caveat. \nDuring the 2016 Labour leadership election, Mr Corbyn is said to have to have told allies he was willing to stand again - but only wanted to do the job until 2018. \nWhat we don’t know is whether he feels the same way today. Mr Corbyn’s overwhelming success in that contest, and Labour’s surprise general election gains, may have convinced him it’s worth sticking around to see if he can lead his party, and the country, as Prime Minister. Like us on Facebook ", "external_links": [], "published": "2017-09-03T10:00:00.000+03:00", "crawled": "2017-09-03T10:22:33.005+03:00", "highlightTitle": ""}