{"organizations": [], "uuid": "980d13ca5082516e9422d3c063e2eec352aadd85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13661514.ece/ALTERNATES/s1200/may-speech.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-pledges-pay-billions-eu-13661809", "country": "GB", "domain_rank": 21960, "title": "Theresa May pledges to pay billions to EU and wants two-year Brexit transition period", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-22T20:00:00.000+03:00", "replies_count": 0, "uuid": "980d13ca5082516e9422d3c063e2eec352aadd85"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-pledges-pay-billions-eu-13661809", "ord_in_thread": 0, "title": "Theresa May pledges to pay billions to EU and wants two-year Brexit transition period", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "barnier", "sentiment": "none"}, {"name": "jeff j mitchell/getty images", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "north east ukip", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nPrime Minster Theresa May attempted to end the deadlock over Brexit by promising to give billions to the EU , in her landmark speech in Florence. \nAnd she said the UK wanted a transition period “of around two years” even after we quit the EU in March 2019. \nIt would mean that the UK had access to EU markets “on the current terms”, she said - which means we could still be bound by EU rules until as long as 2021. \nShe was hoping to persuade the EU to begin detailed discussions about a future trade deal. British Prime Minister Theresa May gives her landmark Brexit speech in Florence, Italy (Image: Jeff J Mitchell/Getty Images) \nSetting out plans for an implementation period, Mrs May said : “During the implementation period access to one another’s markets should continue on current terms and Britain also should continue to take part in existing security measures.” \nShe stressed that the UK would pay money it is said to owe the EU. She did not name a figure, but this is thought to mean paying around 20 billion euros. \nMrs May: “I do not want our partners to fear that they will need to pay more or receive less over the remainder of the current budget plan as a result of our decision to leave. The UK will honour commitments we have made during the period of our membership.” \nAnd the Prime Minister said that even after Brexit , the UK would continue to help pay for some EU schemes, such as those which promote science of improve the security of the whole of Europe. \nShe said: “In doing so, we would want to make an ongoing contribution to cover our fair share of the costs involved.” \nIn a concession to the EU, she said UK courts would be allowed to take decisions of the European Court of Justice into account when dealing with the rights of EU citizens living in the UK. Read More Labour Deputy Leader Tom Watson on rule changes, Brexit and Destiny 2 \nIt would mean European courts still, indirectly, had some influence over legal decisions in the UK. \nShe insisted Brexit would be a success, telling her audience: “This will be a defining moment in the history of our nation.” \nNorth East business leaders said they hoped it would now be possible to move on to talks about a future UK-EU trade deal. \n“Our businesses have concerns have concerns about the shape of our future trading relationship with the EU. It is essential the negotiations move on to those issues as quickly as possible.” \nResponding to the speech, North East UKIP MEP Jonathan Arnott said Mrs May had given the rest of the EU the impression she was a “soft touch” by promising to make payments without getting anything in return so far. \nHe said: “It is the wrong way to handle a negotiation. \n“You don’t treat the other side with kid gloves and make concessions to them when there is no sign of them making any concessions to you. \n“It is all give from the UK side and no take.” Read More More than 38,000 innocent people sent to jail in one year \nMrs May was trying to persuade the EU to begin talks about a trade deal by conceding that the UK will have to pay a massive divorce bill for Brexit. \nIt comes after the failure of the UK and EU negotiators to make progress in talks about leaving the EU. As things stand, the UK is due to quit in March 2019. \nThe EU has said it won’t talk about trade until the UK agrees to pay its debts to the European Union. But it’s unclear how much it claims the UK owes. \nOther issues causing trouble are the legal rights of EU citizens living in the UK, and the border between Northern Ireland and Ireland. \nThe Prime Minister attempted to reassure EU leaders, saying: “We want to be your strongest friend and partner as the EU and the UK thrive side by side.” \nShe said there would be no physical border between the UK and Ireland. \nAnd she told EU citizens living in the UK their rights would be enshrined in UK law. \nHer direct pitch to the continent’s leaders is seen as an attempt to try to bypass the formal talks led by Brussels’ Brexit chief negotiator Michel Barnier. \nOn Thursday, Mr Barnier repeated demands that the UK pay up if it wants a trade deal with the EU. \nHe said the UK must “settle the accounts” if it wants a free trade deal when it leaves the bloc. \nMr Barnier said there was still “major uncertainty” over the UK’s approach on key issues and a “question of trust” about the financial settlement. Like us on Facebook", "external_links": [], "published": "2017-09-22T20:00:00.000+03:00", "crawled": "2017-09-22T20:39:32.012+03:00", "highlightTitle": ""}