{"organizations": [], "uuid": "0542639c8df864368736837a015f9da8cb52ed95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13606379.ece/ALTERNATES/s1200/JS32408760.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13606316", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Wood Group's £2.2bn takeover of Amec gets green light", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-12T10:25:00.000+03:00", "replies_count": 0, "uuid": "0542639c8df864368736837a015f9da8cb52ed95"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13606316", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Wood Group's £2.2bn takeover of Amec gets green light", "locations": [], "entities": {"persons": [{"name": "jon lewis", "sentiment": "none"}, {"name": "ian marchant", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}], "organizations": [{"name": "wood group", "sentiment": "negative"}, {"name": "amec", "sentiment": "negative"}, {"name": "cma", "sentiment": "none"}, {"name": "markets authority", "sentiment": "none"}, {"name": "amec foster wheeler", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:12 KEY EVENT Square One Law strikes EU alliance with Brussels law firm in the run up to Brexit \nNewcastle law firm Square One Law has announced a strategic alliance with a Brussels-based EU law practice in a move that will grant its clients access to legal advice on the continent in the run up to Brexit. \nThe alliance sees the company partner with commercial law firm Kemmlers. The deal was struck due to the North East’s continued reliance on Europe, which sees local companies export more than 50% of its services to EU member countries. \nDespite the UK preparing to leave the EU, British businesses will still require access to European legal advice if they trade overseas. By partnering with Kemmlers, Square One is ensuring that its clients will have access to the advice they need to trade in the EU. \nSenior partner, Ian Gilthorpe, said: \nAs a firm we have never expressed a view as to whether remain or exit was better for the UK and have remained neutral in the Brexit debate. During the negotiations and whatever their outcome, our client base will need access to Europe and the EU as people will always find a way to trade regardless of politics. \n“Neil Warwick, who heads our EU and competition team, is the leading EU lawyer in the region and this alliance will allow us to provide the necessary support our clients require whilst also offering Kemmlers’ clients access to the UK market. \nNeil Warwick, Head of EU and competition law at Square One Law, added: \nI have had a long-standing working relationship with the Kemmler’s lawyers, which this alliance now formalises. \nRather than simplifying matters, the introduction of the EU Withdrawal Bill may mean that international businesses are subject to existing UK law and also have to interpret the new laws to an EU-style of explanation. As the EU develops new laws, some businesses may face a dual interpretation system, which undoubtedly will add to the complexity of doing business in Europe. Square One Law’s Ian Gilthorpe (left) and Neil Warwick (right) who have established a new strategic alliance with Brussels-based Kemmlers (Image: Square One Law) 9:07 KEY EVENT Historic menswear retailer Greenwoods with six North East stores calls in administrators \nAdministrators are hoping to find a buyer for historic menswear firm Greenwoods , which has fallen into administration putting more than 300 jobs in jeopardy. \nThe clothing company, which dates back to 1860 and has 63 stores and two concessions across the UK – including in Newcastle, Durham, Darlington, Middlesbrough, Redcar and Stockton – has called in administrators from Deloitte. \nAdrian Berry and Clare Boardman from Deloitte have been appointed as joint administrators of Greenwoods Menswear Ltd, which employs 318 people, citing tough trading times in the retail market as the reason for Greenwoods calling in the business advisors \nThey are now looking into options available to the £20m turnover business, headquartered in Bradford, which sells formal and casual menswear and has a formal suit hire service, under the Company’s “1860” brand. \nAt the time of the appointment there were 318 employees, of which 292 work in stores, 15 at the head office and 11 in the warehouse. \nAdrian Berry said: \nWe are currently assessing the options available to the company, including a potential sale of the business, and are continuing to trade it in the meantime. No redundancies are being announced at this stage and we are grateful to the employees for their support at this difficult time. \nThis is a challenging time for the UK retail sector, which has affected the company. Greenwoods (Image: Handout) Jonathon Manning AA confirms Hastings Merger talks \nThe AA has confirmed that it held discussions about a possible merger of its insurance division with rival Hastings, a move which is reported to have led to a blazing board-level row.The roadside recovery firm said in a stock market announcement that “preliminary discussions” with Hastings were held in early summer to “explore a possible combination of the AA’s insurance business with Hastings”.The group added: \nThe AA regularly reviews all strategic options, including whether a spin-off of any of its business lines would unlock further value and be in its shareholders’ interests. \nThe attempted spin-off led to a physical altercation between executive chairman Bob Mackenzie, who was thought to be opposed to the merger, and AA insurance chief Michael Lloyd, according to the Financial Times.In August the AA sacked Mr Mackenzie for gross misconduct, removing him with immediate effect.A spokesman said it was a “personal conduct-related matter”, but declined to give more information.Hastings also confirmed the talks and in its own statement said: \nThe board confirms that the company did have preliminary discussions with the AA regarding a potential partnership with its insurance division, which have ceased. \nWhilst Hastings regularly reviews selective acquisition opportunities, its core strategy remains to deliver on its organic growth and its disclosed targets. AA has confirmed that it entered merger talks with Hastings 8:57 Jonathon Manning People can earn £1,000 for acting as a recruiter for Sunderland firm tombola \nMembers of the public could be paid up to £1,000 for helping an online gaming company find new members of staff. \nSunderland’s Tombola is calling for local people to act as recruiters, and is offering a “bounty” for anyone who recommends a new member of staff. \nThe Tombola Talent referral scheme will pay up to £1,000 for each role filled, with higher ranking positions earning more cash. \nThe scheme was launched after the company trialling the referral scheme internally with its own members of staff. \nMarc Lightfoot, Tombola’s HR recruitment executive, said: \nWe’ve gone down the traditional recruitment route for some time using agencies and advertising, but wanted to do something different. \nWe’ve had a successful internal referral scheme open to Tombola employees for about a year and thought it could be opened up to the wider public. \nThe way it will work is that our talent spotters – and that’s anyone over the age of 18 - will register online and they’ll be issued with a unique referral link. This identifier will be passed on to prospective new members of our team and for everyone signing up and completing a three-month probationary period, a bounty will be paid to the spotter. \nTombola’s new recruitment drive has been launched to coincide with the opening of its £6m high-tech headquarters on the banks of the Wear. The firm currently employs around 400 people, with a further 70 based in Spain and Gibraltar. \nRoles at the new Sunderland headquarters will include jobs in software development and testing, design and animation, IT infrastructure, product management, and marketing. How the new tombola HQ will look in Sunderland (Image: Ryder Architecture) 8:52 Northern Gas Networks' CEO explains the importance of InTEGReL 8:47 Jonathon Manning £30m research facility places Gateshead at heart of UK's battle for clean energy \nThe North East will be at the front line of the UK’s fight against climate change after the launch of a £30m renewable energy research centre in Gateshead . \nNorthern Gas Networks (NGN) has launched the InTEGReL facility - which stands for Integrated Transport Electricity Gas Research Laboratory - in Rowlands Gill. \nThe site will focus on developing new technology to allow the UK to reach its target of reducing carbon emissions by 80% by 2050. \nIt will be the first facility in the UK to provide a place for research, development, and demonstrations of integrated energy systems, working on technology that will help improve many aspects of the UK’s energy network, including electricity, gas, and transport. \nInTEGReL, which could employee hundreds of workers once fully operational, was launched at an event attended by senior figures from the UK’s energy sector. \nAt the event NGN chief executive Mark Horsley welcomed guests and explained the importance of the research centre. \nHe said: \nThis is an amazing day as far as I am concerned, I have spent nearly 40 years in the industry and I don’t think we have had a point which is as exciting as this one is. \nIn my past life I was the chief executive of Northern Power Grid and now I’m at NGN, so we’re looking uniquely across the two vectors. And we’re bringing together the transport piece of that as well. \nWe have had a vision and a view for years now that we look at energy as a whole and not as silos. What this site will do is bring those silos together so we can work together and work with people, either in research or in small business, to develop those ideas and bring them into practice. \nThe facility’s main objective is to move UK consumers away from energy created from fossil fuels, and towards green energy in an affordable way. InTEGReL will look to develop new technology to help move the UK away from carbon energy (Image: NCJ Media) 8:42 KEY EVENT JD Sports celebrates full-year results cheer after record first half \nRetailer JD Sports has hailed another record set of results and upped its earnings outlook for the full year after robust sales.The group cheered an “exceptional first half” after it saw pre-tax profits leap a third higher to £102.7m in the six months to July 29.It said full-year profits were now set to come in towards the upper end of market expectations, which are currently in the range of £268m to £290m.Executive chairman Peter Cowgill said strong sales across its core UK and Ireland stores underpinned the half-year profits leap, but he also hailed progress on expanding internationally.Mr Cowgill said: \nThis is another pleasing result demonstrating the strength of our highly differentiated multichannel proposition and our ability to prosper in an increasingly competitive market for athletic-inspired footwear and apparel. \nHe added: \nWe are encouraged by the sales to date in the second half which have continued at similar levels to those in the first half. A JD Sports store ", "external_links": [], "published": "2017-09-12T10:25:00.000+03:00", "crawled": "2017-09-12T10:44:55.000+03:00", "highlightTitle": ""}