{"organizations": [], "uuid": "35a97d0b0b65271d201e98bf5d1c8d45c0b86abe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/special-features/article462746.ece/ALTERNATES/s1200/Plym-Student1.jpg", "site_section": "http://www.westernmorningnews.co.uk/property-news.rss", "section_title": "devonlive - Property", "url": "http://www.devonlive.com/special-features/how-you-can-make-money-462603", "country": "GB", "title": "How you can make money by snapping up a posh student apartment in Plymouth", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-12T14:46:00.000+03:00", "replies_count": 0, "uuid": "35a97d0b0b65271d201e98bf5d1c8d45c0b86abe"}, "author": "Andy Pyle", "url": "http://www.devonlive.com/special-features/how-you-can-make-money-462603", "ord_in_thread": 0, "title": "How you can make money by snapping up a posh student apartment in Plymouth", "locations": [], "entities": {"persons": [{"name": "hiew yoon khong", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "alastair buchan", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "beaumont square", "sentiment": "none"}, {"name": "beaumont sqaure", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "brexit uk", "sentiment": "none"}, {"name": "beaumont square share", "sentiment": "none"}], "organizations": [{"name": "plymouth top", "sentiment": "none"}, {"name": "plymouth sponsored how", "sentiment": "none"}, {"name": "temasek", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "plymouth college of art", "sentiment": "none"}, {"name": "drake circus", "sentiment": "none"}, {"name": "university of plymouth", "sentiment": "none"}, {"name": "knight frank", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "plymouth college", "sentiment": "none"}, {"name": "theatre royal plymouth", "sentiment": "none"}, {"name": "university of oxford", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "plymouth eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsored How you can make money by snapping up a posh student apartment in Plymouth Top property firm is offering you the chance to become a landlord for less than £80k and make an annual return of more than £6,000 on your investment Share Inside one of the self-contained studio apartments in Beaumont Square Share \nAn exclusive new development in Plymouth is offering potential landlords the chance to buy one of 39 fantastic student apartments close to the city centre. \nInvestors can purchase a self-contained studio in Beaumont Square from £78,500 through One Touch Property Investment . As well as a kitchen area and an en-suite shower room, tenants also benefit from a communal laundry room, reception area and 24-hour CCTV. Beaumont Sqaure is situated near to the university and Plymouth College of Art \nThe development’s central location ensures that students will get to enjoy everything that Plymouth has to offer, including Drake Circus, Theatre Royal Plymouth and much more. \nAnd being situated near to both the University of Plymouth and Plymouth College of Art, means tenants will have an easy commute to lectures and seminars. Read More Plans for commercial redevelopment of Civic Centre to be revealed \nThe appeal of a development such as Beaumont Square – a Plymouth student accommodation investment – is obvious. Apartments are fully managed, meaning landlords will not have to concern themselves with finding new tenants or day-to-day maintenance, they only need to think about what they will do with the rental income. \nStudent accommodation is one of the most robust asset classes in the UK, and Knight Frank estimates the purpose-built student accommodation market to be worth £46bn. You can buy one of these plush student apartments in Beaumont Square \nThe largest transaction was the purchase by the property arm of Temasek of a portfolio of 25 student buildings in various cities including London and Manchester. Hiew Yoon Khong, chief executive of Mapletree (Temasek’s real estate section), commented: “Student accommodation is a big business and relatively low risk.” \nDevelopers are so confident the units in Beaumont Square will achieve good occupancy levels, they are offering an eight per cent net rental income assured for three years. That means a £6,280 net yield per annum on the original £78,500 purchase price. Purpose-built student accommodation in Plymouth is an appealing investment Why the student accommodation investment sector in Plymouth is still strong – despite Brexit \nPerhaps the most pressing issue with regards to student accommodation investments currently, is the sustainability of demand, especially since Brexit and predictions that the number of students going on to further education will fall, especially those coming to study from EU countries. A floorplan of a self-contained apartment in Beaumont Square Why invest in student accommodation in Plymouth? \nThe amount of student accommodation in Plymouth was previously a problem but in 2012, the city council introduced the Article 4 Direction which meant that anyone planning to turn a home into a House of Multiple Occupancy (HMO) needed to seek out planning permission. \nAs is common knowledge, many HMOs are let to students because it is a less expensive alternative to renting an entire flat or house. The fact that these are now restricted by the council has made purpose-built student accommodation in the city centre much more appealing to the discerning student who has perhaps found their options become limited. Students are always on the lookout for good accommodation in Plymouth EU student numbers still strong. International student numbers have increased \nFigures from 2017 suggest that investors’ fears can be allayed. A total of 26,090 students from the EU have been placed, which although is a fall of three per cent compared to 2016, is still the second highest number on record. \nThe number of international students accepted has increased by four per cent to 30,350. Professor Alastair Buchan, Head of Brexit strategy at the University of Oxford, says the university has seen a 10 per cent rise in the number of international applications from the EU. Read More How did Devon's MPs vote on the Brexit Repeal Bill? Search by name or constituency following the major vote \nThese numbers are encouraging, especially because due to Brexit UK universities will lose their additional 15 per cent of funding. With the increase in international students, however, the additional fees paid will go some way to bridge that shortfall. \nThere is also an increase in the number of 18-year-olds going to university, and a drop in the number of more mature students taking up places. This is an ideal situation for those who invest in student property , as 18-year olds are much more likely to move to another city for university, and therefore need accommodation, over mature students who may have their own home or need to stay in the same city because they have family ties there or for work. \nTo find out more about Beaumont Square , and other student accommodation investments please click here to contact One Touch Property, and an investment consultant will be happy to discuss available opportunities and your requirements. Like us on Facebook", "external_links": [], "published": "2017-09-12T14:46:00.000+03:00", "crawled": "2017-09-12T15:24:42.002+03:00", "highlightTitle": ""}