{"organizations": [], "uuid": "98e9f0285db4601b62bf6237fdda106fb5add0ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/news/devon-news/article530736.ece/ALTERNATES/s1200/29574492JPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/five-things-would-like-see-533308", "country": "GB", "title": "Five things we would like to see in Exeter now the £100m plan has collapsed", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-26T15:28:00.000+03:00", "replies_count": 0, "uuid": "98e9f0285db4601b62bf6237fdda106fb5add0ca"}, "author": "Phil Goodwin", "url": "http://www.devonlive.com/news/devon-news/five-things-would-like-see-533308", "ord_in_thread": 0, "title": "Five things we would like to see in Exeter now the £100m plan has collapsed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Five things we would like to see in Exeter now the £100m development plan has collapsed The Conservatives say now is the right time to rethink the city centre redevelopment - here are some suggestions Share Opponents have called for a rethink of plans for the site Share Comments \nShoppers, traders and locals are all wondering what is next for the redevelopment of Exeter. \nBut is the collapse of the scheme to reshape the the city centre really cause for doom and gloom or a golden opportunity to get creative and deliver something radically different? \nAfter years of work and about £4m spent, the Crown Estate has decided that extending Princesshay is no longer financially viable, citing market conditions. \nThe council’s own plans have also been cast into doubt after its chosen builder refused to sign on the dotted line amid fears that Brexit and the falling pound had sent costs soaring again. \nWhatever the owners of Princesshay decide, Labour leader Pete Edwards has vowed that he will build the £40m leisure centre and a replacement bus station. Read More Massive Exeter business park REFUSED by planners as it would cause 'abject misery' to residents \nBut with costs for the state-of-the-art St Sidwell’s Point pool rising there must now be doubt as to what will be built on the site of the bus and coach station, which closes on October 28. \nThe leader of Exeter's Tory group Cllr Andrew Leadbetter, says the project is now in “chaos” and has called for a pause for thought. \n“We want to go back to the drawing board and look at alternatives – there needs to be a rethink of uses for the site,\" he said. \nHere are five things we could see instead: Open market for farmers and food producers Exeter farmers market \nThe existing farmer’s market looks a little cramped on the corner of South Street and Fore Street. Traders would love to pack into the large central bus station site. \nThe Real Food Store in Paris Street was forced out by the development and a lack of suitable retail space meant the business had to split into three elements. \nEmma Parkin, who set up the community food store, café and bakery, said: \"I personally never thought that what Exeter needed was more Princesshay-style expensive retail units. \n“I would like to see a market square for Exeter on the space, like the one in Crediton. You could have market stalls, open air events, street theatre. I’d also welcome smaller, less expensive shops which independent traders could afford.\" \nit would be a relatively cheap and popular solution, at least in the short term. Theatre/conference centre \nThere have been calls for a theatre all through the process of developing the leisure centre plans. \nThe council appointed external adviser Fourth Street in April this year to carry out a needs assessment for a new 1,000 seat minimum capacity venue. \nThe city already boats the Corn Exchange, the Barnfield Theatre, the Bike Shed and the Northcott up on the university campus. \nNevertheless, many want something bigger in a prime location, able to attract bigger music acts, who often bypass the city for Plymouth Pavillions. \nLiam Gallagher will play before around 4,000 fans in December. Read More Fans miss out on tickets for Liam Gallagher gig in Plymouth as they sell out within minutes Exeter misses out on stars such as Liam Gallagher, who is playing Plymouth \nPeter Goodwin, Chair of the Theatre for Exeter Group, set up in 2013, said: “Over the last few years we have been contacted via our website by many people who would like to see a new theatre in the city as well as by those who would not.\" \nIt could be a tricky project to secure funding and get off the ground and the prospect of thousands of fans descending on the city centre may also raise concerns over parking. Shipping containers/enterprise zone Shipping containers at Wapping Wharf, bristol \nNot quite German state-of-the-art design standard but metal boxes are being used to create hip new urban retail and business space in places like Bristol. \nThey are relatively cheap and easy to install and could prove popular with independent businesses looking for a cost-effective way to secure a semi-permanent home in a prime location. Shipping containers in place at H&W Portishead \nThe city council is said to be considering this idea though nothing has been formally presented. \nIt is easy to imagine this working as a short-term solution which could raise revenue for the council. \nWould play well with the Fore Street sector but may not match officials' ambitions. Water fun park Sandcastle Typhoon Lagoon Wave Pool, Blackpool \nNostalgic residents in Exeter long for the fun-filled days at the old Riverside swimming pool, when there was a palm tree, a water slide and a wave machine. \nAs the pool plans were being approved - and criticised for not stretching to an Olympic size facility - there were calls for something simpler and recreational. \nWith the Riverside still closed after the fire until at least another year and the 1930s Pyramids now on its last legs, the city is crying out for some water-based leisure. Board riding in Swansea \nIf the Passivhaus standard proves too prohibitive for the city council, maybe it could shift the focus from style to pure fun and build a cheap and cheerful water park. Velodrome \nExeter was a cycling demonstration city a few years ago and is aiming to boost cycle journeys from 6 per cent to 12 per cent over the next few years. \nThe Exeter Cycling Campaign is starting to have an effect on policy making and is now consulted by Devon County Council on some matters. \nWhy not make a statement of intent by making the city the centre for two-wheels in the South West. \nThe only facility is currently in Torbay - an outdoor flat track - while the closest indoor track is far away in Newport, South Wales. British track and road star Mark Cavendish \nThe move could draw cycling stars to the city but would likely attract brickbats in equal measure. \nNot one that has been put forward to date but with nothing concrete on the agenda, a radical idea may well capture the imagination. Like us on Facebook", "external_links": [], "published": "2017-09-26T15:28:00.000+03:00", "crawled": "2017-09-26T15:38:12.006+03:00", "highlightTitle": ""}