{"organizations": [], "uuid": "8a58a011de64efabad47bda18bdd3105f35bd2d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13578590.ece/ALTERNATES/s1200/A-Border-Force-officer-checking-passports-of-in-Terminal-2-The-Queen-Terminal-at-Heathrow-Airport.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uks-plan-immigration-after-brexit-13578577", "country": "GB", "domain_rank": 21960, "title": "The UK's plan for immigration after Brexit has been leaked - and this is what it means", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-06T09:23:00.000+03:00", "replies_count": 0, "uuid": "8a58a011de64efabad47bda18bdd3105f35bd2d3"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uks-plan-immigration-after-brexit-13578577", "ord_in_thread": 0, "title": "The UK's plan for immigration after Brexit has been leaked - and this is what it means", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "neutral"}, {"name": "theresa may", "sentiment": "none"}, {"name": "yvette cooper", "sentiment": "none"}, {"name": "oli", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "migration advisory committee", "sentiment": "none"}, {"name": "the guardian", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "house of commons home affairs committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nProposals for new restrictions to cut numbers of low-skilled migrants from Europe following Brexit have been revealed in a leaked Home Office paper. \nThe 82-page document, obtained by The Guardian, suggests that new arrangements would be immediately introduced at the point the UK finally leaves the EU at the end of a transition period lasting at least two years. \nDeparture from the EU will mean “the end of rights-based, unconditional free movement”, with the Government adopting powers to take “a more selective approach” to which migrants will be allowed to work and settle in the UK. \nIt is understood that the document - marked “Official Sensitive” - is a draft version of an upcoming White Paper which has been circulated among senior officials and politicians but has not been agreed by ministers. \nIt is described as “a platform for discussion”. \n“The Government will take a view on the economic and social needs of the country as regards EU migration, rather than leaving this decision entirely to those wishing to come here and employers,” it states. \nThis could involve requiring EU nationals to seek permission before taking up a job, making employers recruit locally first or restrict access to lower-skilled occupations which are not experiencing staffing shortages, the document suggests. The leaked plan is yet to be approved by ministers (Image: Oli Scarff/Getty Images) \nThe Guardian quoted the document as saying: “Put plainly, this means that, to be considered valuable to the country as a whole, immigration should benefit not just the migrants themselves but also make existing residents better off.” \nThe leaked paper makes clear that the Government’s handling of post-Brexit migration will continue to be driven by the aim of reducing net immigration to “sustainable” levels, previously defined by Prime Minister Theresa May as below 100,000 a year. \nWherever possible, UK employers should “look to meet their labour needs from resident labour”, it suggests. \nAmong proposals floated to cut numbers of lower-skilled migrants are a restriction to two years’ residency, compared to work permits for a longer period of three to five years for those in high-skilled occupations. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIt is not envisaged that EU citizens would be required to apply for permission to visit the UK for tourism, family visits and short business trips or be given stamps in their passports on arrival. \nBut they will have to show passports, rather than using a national identity card, to enter the country. \nUnder the document’s proposals, those on longer stays would have to register with the authorities and may be required to provide fingerprints and proof of employment, self-sufficiency or study status. \nThe right to bring family members into the country could be tightened to only the most direct relatives like partners, spouses and children, and there could be an unspecified “income threshold” for EU citizens to show they can support themselves while in the UK. \nAn EU national living in the UK wanting to bring their spouse in from outside the EU may have to show they earn the £18,600 a year minimum required from the restriction already imposed on Britons, said the document. \nAnd it says the UK is considering measures to require certain travellers to apply in advance for electronic travel authorisation. \nThe paper sets out possible arrangements for three phases of Britain’s withdrawal process - the period during which current residents will be able to apply for “settled status” in the UK; an implementation period of at least two years following the March 2019 date of Brexit; and the future era of new immigration controls. \nDuring the implementation period, travellers can expect to experience “relatively few changes to current rules”, the document states. \nA Government spokesman said: “We do not comment on leaked draft documents. \n“We will be setting out our initial proposals for a new immigration system which takes back control of the UK’s borders later in the autumn.” \nBut Labour MP Yvette Cooper, the chair of the House of Commons Home Affairs Committee, said the document seems to contradict the Home Secretary’s decision just over a month ago to ask the Migration Advisory Committee to provide all the evidence to underpin a new immigration policy. Read More ", "external_links": [], "published": "2017-09-06T09:23:00.000+03:00", "crawled": "2017-09-06T09:39:17.000+03:00", "highlightTitle": ""}