{"organizations": [], "uuid": "0f9cc2daa64985fec09451c84767c245fbf6bde0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13650518.ece/ALTERNATES/s1200/JS131151085.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-uncertainty-north-east-man-13650391", "country": "GB", "domain_rank": 21960, "title": "Brexit uncertainty of North East man whose work could save the NHS billions", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-21T07:00:00.000+03:00", "replies_count": 0, "uuid": "0f9cc2daa64985fec09451c84767c245fbf6bde0"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-uncertainty-north-east-man-13650391", "ord_in_thread": 0, "title": "Brexit uncertainty of North East man whose work could save the NHS billions", "locations": [], "entities": {"persons": [{"name": "sterghios", "sentiment": "negative"}, {"name": "sterghios moschos", "sentiment": "none"}, {"name": "jeremy beecham", "sentiment": "none"}, {"name": "svetlana", "sentiment": "none"}, {"name": "moschos", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "sterghios a moschos", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}, {"name": "estonia", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "pfizer", "sentiment": "none"}, {"name": "university of portsmouth", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "principal scientist", "sentiment": "none"}, {"name": "university of westminster", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit uncertainty of North East man whose work could save the NHS billions Athens-born Dr Sterghios Moschos led a Northumbria University team that made a crucial health breakthrough Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe man behind a North East university’s major breakthrough in treating diseases like cancer and cystic fibrosis faces an uncertain future - because of Brexit . \nWe revealed this week that Dr Sterghios Moschos of Northumbria University led a research team that came up with a way of predicting how patients respond to DNA drugs used to treat 6,000 inherited conditions. \nThis could save the NHS billions as these types of drugs, while highly effective, are expensive, usually costing over £100,000 while they do not work on all patients. \nEven though he has lived in Britain since 1996, Dr Moschos, 38, was born in Athens and has now decided to apply for permanent residency to be sure of remaining here. Dr Sterghios A Moschos, who is concerned about his future post-Brexit \nHe is hopeful his application will be granted, but he said: “You can never be sure of what’s going to happen. \n“I’ve lived half my life here. I’ve worked here, paid my taxes here, I feel British and expect my children to go to school here.” \nThe right of EU nationals like Dr Moschos to stay in the UK post-Brexit has been at the centre of a heated debate. \nHaving lived here for at least five years, under government plans post-Brexit, he would automatically get ‘settled status’ and keep the same rights and benefits of Britons under British law. He can also apply for permanent residency. \nHowever Theresa May’s offer is only made on the strict condition that the other 27 EU nations make the same deal for those Brits. \nAnd Europe isn’t impressed by the proposal thinking it offers insufficient protection and want their citizens protected by EU laws not just British. EU and Union flags (Image: PA) \nDr Moschos lives in the North East with his wife Svetlana, 31, an economist who was born in Estonia, another EU state, who is in the same uncertain position. \nWhile Dr Moschos is actively studying permanent residence papers with a view soon to apply, he says his wife is taking a different approach. \n“She’s more for waiting to see how it all turns out,” he said. \nThe couple have a young son called Erlund - a name chosen for its Norse/Old England sound. \nDr Moschos admitted the vote to leave the EU came as a great surprise. Read More A second Brexit vote, fighting terrorism and better army pay - Liberal Democrats reveal new policies \n“We were on holiday on a ship off Greece when we heard. We spent the first few days trying to get over the shock. We never expected it.” \nIn an impressive career in the UK, Dr Moschos first studied molecular biology at the University of Portsmouth. \nHe later gained a PhD in pharmaceutics and worked in several other universities before being head hunted as Principal Scientist for top company Pfizer, and then again by the University of Westminster. \nIt was in October last year, in quite a coup for Northumbria, he became associate professor of cellular and molecular sciences there. \nDr Moschos said even now he feels there might be a second EU referendum in the future as the talks continue. Read More \nThe post Brexit atmosphere has seen the UK polarised between those who want to leave the EU and those who cling to the hope of remaining somehow part of it. \nAt times, emotions have run high and anti-EU sentiments have been voiced. \nDr Moschos said: “I’ve experienced a little bit personally but I really don’t won’t to go into specifics.” \nHe fears the atmosphere could undo the good work of Europe. \n“Europe has spent 70 years picking up the pieces. It has come together, got closer and prospered.” Jeremy Beecham at home in Gosforth, Newcastle (Image: Newcastle Chronicle) \nJeremy Beecham, a Newcastle councillor who is a Labour Shadow Justice Minister in the House of Lords, expressed his concern about the effect the Brexit uncertainty is having on people like Dr Moschos. \nHe said: “It’s a worry that someone as eminent as Dr Moschos who has made such a vital contribution to the health and well being of the UK is living under search uncertainty. \n“What kind of message is it sending out? I think it’s high time the government sat down and had a re-think of it attitude towards EU nationals living in the UK.” Like us on Facebook", "external_links": [], "published": "2017-09-21T07:00:00.000+03:00", "crawled": "2017-09-21T08:19:38.009+03:00", "highlightTitle": ""}