{"organizations": [], "uuid": "9164a47c36afb068701c997e50a81b75b010cc67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/news/devon-news/article433588.ece/ALTERNATES/s1200/3622054-large.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/plan-slash-mps-create-devon-433565", "country": "US", "title": "Plan to slash MPs and create Devon-Cornwall parliamentary seat to be 'ditched' by Theresa May", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-06T15:12:00.000+03:00", "replies_count": 0, "uuid": "9164a47c36afb068701c997e50a81b75b010cc67"}, "author": "Phil Goodwin", "url": "http://www.devonlive.com/news/devon-news/plan-slash-mps-create-devon-433565", "ord_in_thread": 0, "title": "Plan to slash MPs and create Devon-Cornwall parliamentary seat to be 'ditched' by Theresa May", "locations": [], "entities": {"persons": [{"name": "theresa", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "paul tyler", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "tamar", "sentiment": "none"}], "locations": [{"name": "devon-cornwall", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "north cornwall", "sentiment": "none"}], "organizations": [{"name": "times", "sentiment": "none"}, {"name": "boundary commission", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nA Tory manifesto pledge to slash the number of MPs in a bid to save £50m is set to be abandoned, according to reports. \nDivisive proposals to reduce the size of the Commons from 650 to 600 seats will be dropped after the prime minister, Theresa May, failed to hold on to her party’s majority in the general election, the Times said, citing “three senior sources” . \nOne of the mooted reforms included merging Devon and Cornwall constituencies into one single seat, straddling the border between Devon and Cornwall. \nThe plan had been vociferously opposed in the region on both sides of the Tamar. \nThe Liberal Democrats welcomed the decision to abandon the plan. \nLord Paul Tyler, Lib Dem spokesman for Constitutional & Political Reform and former MP for North Cornwall, said: “There is no sense in forcing through changes which destroy the historic integrity of communities and require the redrawing of boundaries every five years. The new seat was to cross the boundary between the counties \n\"After years of campaigning against these damaging proposals I am delighted that we are in sight of success. This should mean that the reduction of MPs in Cornwall won’t go through, and the ill-fated joint constituency straddling the Tamar will never happen – “Devonwall” is doomed. “I wish that this threat had been removed years ago; only one of the present Conservative MPs in Cornwall was prepared to stand up to the party whips, or we might have achieved success much earlier.” Read More Buses come to a stop in Exeter in tribute to colleague who died suddenly “There is a strong case for more consistency between constituency sizes. However, these plans will be damaging and it would be a mad time to cut the number of MPs, They need to be working harder than ever to keep a check on the government through the Brexit process.” \nThe reform was intended to save £50m over five years and equalise the number of voters in each constituency. \nBut concern about getting a Commons majority for the move, which would mean a wide-ranging redrawing of constituency boundaries, has reportedly led to the change of direction. \nLast year, the Boundary Commission published draft seat boundaries designed to equalise the size of constituencies and cut back on MPs. May’s team are said to doubt that she will be able to get the required vote to enact the plan. \nAn Exeter nurse speaks about the pay cap Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe commission is set to publish its latest proposals based on 600 constituencies next month, revealing which MPs would face the axe. \nLabour opposes the reduction, which would cut the number of seats in its urban heartlands and result in the party losing more seats than the Tories. The Labour leader, Jeremy Corbyn, has previously labelled the plans “gerrymandering”. \nThe Tory leadership is preparing to abandon the plan and ask the Boundary Commission to redo the review on the basis of keeping all 650 MPs to ensure that all constituencies are of broadly equal size, the Times said. \nIf abandoned, the plans will be the latest Tory manifesto pledge scrapped in the wake of the snap election in June. \nMay has already dropped plans to push through social care funding changes dubbed the “dementia tax”, and an expansion of grammar schools since the election. Read More", "external_links": [], "published": "2017-09-06T15:12:00.000+03:00", "crawled": "2017-09-06T15:29:30.002+03:00", "highlightTitle": ""}