{"organizations": [], "uuid": "b79ccf7cf7fef81523d6f0e1da3c1f137f778553", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13587718.ece/ALTERNATES/s1200/keyboard.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bobble-bobble-hat-every-day-13587580", "country": "GB", "domain_rank": 21960, "title": "Why there is a bobble on a bobble hat? This and other every day objects explained", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-09T20:00:00.000+03:00", "replies_count": 0, "uuid": "b79ccf7cf7fef81523d6f0e1da3c1f137f778553"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bobble-bobble-hat-every-day-13587580", "ord_in_thread": 0, "title": "Why there is a bobble on a bobble hat? This and other every day objects explained", "locations": [], "entities": {"persons": [{"name": "heinz", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why there is a bobble on a bobble hat? This and other every day objects explained Here are a list of every day objects with a purpose you may never have realised they had before Share Every day objects with a purpose Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThey are the things you may have noticed over the years and never realised they had a purpose. \nSome are larger and more obvious than others and have made you occasionally wonder why it’s there or why it’s like that. \nLike the hole on the top of the pen lid, why a hair pin is zig zag shaped and why is there a bobble on a bobble hat. All the explanations are found here on our list everyday objects and their unknown uses. 1. Look at the lid of your ball point pen and you’ll notice a hole. Why is it there? \nThose who have wondered about this generally think the hole in the cap of a ballpoint pen is there to keep the pen from drying out. The real reason is to lower the risk of suffocation. If a small child was chewing on the cap and choked on it, the hole keeps their airway from closing up entirely. 2. The little pocket within the larger pocket on your jeans. Style or substance? \nJeans were first made in the 19th century and were very popular with cowboys like Butch Cassidy and the Sundance Kid who needed somewhere to keep their pocket watch. 3. The hole in the handle of your pot. Why? \nIt’s multi purpose - something to hang it up with and if required and you can also put a cooking spoon in it to stop it messing up your work top. 4. What’s that arrow next to your petrol gauge there for? \nIt’s not in all cars but the next time you get in yours have a look. It should be next to the fuel gauge and the reason it is there is to indicate the side of the car your petrol cap is on. 5. Why is one side of a hair pin - or kirby grip- bent into a zigzag? \nThe grooves help the hairpin hold the hair better. And, controversially (I’m told by those who wear them) the grooved side is the bottom of the pin and should face toward the scalp. 6. What’s the little hole in the bottom of a padlock for? \nNext to where you put the key in, if you want see. There’s a number of reasons why it’s there. The first is to let water drain out of the lock if you’re using it outdoors, so it won’t rust in the rain or freeze and break in the winter. The hole can also be used to oil the lock to keep it working well. Read More Guinness World Records - the bizarre feats that got these people in the latest book 7. What about the little horizontal ‘dashes’ on the ‘F’ and ‘J’ keys on a keyboard? \nIf you’re a trained touch typer, you know this one. For those who aren’t, in 10-finger typing, the ‘F’ and ‘J’ keys are the home keys, where your index fingers rest. The little dashes let you find your way back to the home position without looking down at your keyboard. 8. What about the hole found in rulers? \nIt’s for hanging them up. That’s your lot for that one 9. Why do wine and champagne bottles have those indentations in the bottom? \nNo. it’s not there so you can get a better grip while they’re pouring although it helps. It’s actually there to compensate for the pressure that the contents of the bottle go through during the corking process. The sides and bottoms of bottles are weak spots, and the indentation helps evenly distribute the pressure inside the bottle. That’s why it’s so much deeper on champagne bottles, which are under much more pressure due to the carbonation. Read More Brexit blues - Newcastle's confidence in leaving Europe plummets 10. What is the ‘57’ on a glass Heinz ketchup bottle there for. \nNot just a brand thing, apparently. In order to release ketchup faster from the glass bottle you have to hit the sweet spot on the neck of the bottle - indicated by the 57. If you’d known that you wouldn’t need the plastic bottle. 11. The bobble on a bobble hat. \nIt is not there to make people who wear them look a bit silly. It’s original function was to protect sailors’ heads from getting bashed when they bent down under things. \n• What would you like to know? Email mike.kelly@trinitymirror.com Like us on Facebook", "external_links": [], "published": "2017-09-09T20:00:00.000+03:00", "crawled": "2017-09-09T20:15:28.010+03:00", "highlightTitle": ""}