{"organizations": [], "uuid": "fae9c09ad9fab51766921eaa9cd887d53fcbe6b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13559420.ece/ALTERNATES/s1200/Renolits-factory-in-Cramlington.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/kitchen-laminate-manufacturer-renolit-creates-13559371", "country": "GB", "domain_rank": 21960, "title": "Kitchen laminate manufacturer Renolit creates new jobs as turnover grows", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-01T14:03:00.000+03:00", "replies_count": 0, "uuid": "fae9c09ad9fab51766921eaa9cd887d53fcbe6b1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/kitchen-laminate-manufacturer-renolit-creates-13559371", "ord_in_thread": 0, "title": "Kitchen laminate manufacturer Renolit creates new jobs as turnover grows", "locations": [], "entities": {"persons": [{"name": "renolit", "sentiment": "negative"}, {"name": "david hall", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "hall", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "renolit", "sentiment": "negative"}, {"name": "renolit group", "sentiment": "negative"}, {"name": "ncj media", "sentiment": "none"}, {"name": "consett", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Kitchen laminate manufacturer Renolit creates new jobs as turnover grows The Renolit Group saw its turnover hit £65.1m last year after receiving a boost from the Brexit-hit pound Share Renolit's factory in Cramlington (Image: NCJ Media) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPlastic film manufacturer the Renolit Group added almost £5m to its turnover last year and promised to create new jobs throughout 2017. \nThe Cramlington firm, which makes and sells plastic films used to decorate kitchen cabinet doors, saw its turnover grow 7% to £65.1m during the year ending December 31 2016. \nAlong with the financial growth, Renolit boosted its headcount by hiring an extra 14 members of staff , and promised that more new jobs will be created during 2017. \nIn the company accounts, general manager David Hall said: “As the business has grown, and the proportion of Cramlington manufactured products increased, additional employees were taken on and we finished the year with 279 people - up 14 on December 2015. \nInterested in North East jobs? Find job vacancy listings across a range of sectors here . Read More North East 'well placed' to benefit from multi-million pound life sciences boost \n“Further recruitment is planned for 2017 as we look to increase capacity with the addition of a new embossing line. This £3.5m investment was contracted during 2016 and is now under construction.” \nRenolit also managed to convert its increased turnover into bottom line growth, with the firm boosting its operating profit 53%, from £5.8m to £8.9m. Profit after tax also grew from £4.6m to £7.2m. \nAs an exporter, the company said that the Brexit-hit pound had helped it achieve its increased sales, but warned that the long term impact of Brexit on the business is still unknown. Read More Jobs coming to former Consett steelworks site with creation of business units \nMr Hall said: “2016 was a successful year for the company as both sales values and volumes rose. \n“As a net exporter, the short term impact of the Brexit decision was positive. With GBP losing on average 10% of its value against the euro and 11% against the US dollar, export sales received a significant boost.” \nHe added: “In the medium to long term there is much uncertainty as to how Brexit will impact the business, in particular if restrictions are placed on free trade or import tariffs imposed. \n“The situation will continue to be reviewed and action taken as required as events unfold over the coming years.” \nRenolit is also in the midst of updating its core IT system, which will go live at the start of next year. The new tech is being introduced to help future proof the firm’s computer system. Staff training on how to use the new system is being carried out this year. Like us on Facebook", "external_links": [], "published": "2017-09-01T14:03:00.000+03:00", "crawled": "2017-09-01T14:35:36.003+03:00", "highlightTitle": ""}