{"organizations": [], "uuid": "1a145ba46124fcbca291e9866a83b257e1c7c48a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13559501.ece/ALTERNATES/s1200/Manufacturing-and-construction-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/manufacturing-hits-four-month-high-13559417", "country": "GB", "domain_rank": 21960, "title": "Manufacturing hits four-month high as weak pound boost exports", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-01T14:09:00.000+03:00", "replies_count": 0, "uuid": "1a145ba46124fcbca291e9866a83b257e1c7c48a"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/manufacturing-hits-four-month-high-13559417", "ord_in_thread": 0, "title": "Manufacturing hits four-month high as weak pound boost exports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Manufacturing in the UK has been boosted by the Brexit-weakened pound (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOutput in Britain’s manufacturing industry unexpectedly pushed to a four-month high in August thanks to a jump in new work. \nThe Markit/CIPS UK Manufacturing purchasing managers’ index (PMI) showed a reading of 56.9 last month, up from 55.3 in July and above economists’ expectations of 55. A reading above 50 indicates growth. \nThe bright update for the UK economy gave a momentary boost to the pound, which edged into positive territory against the US dollar before slipping back to 1.292. \nThe PMI report said activity rose to its second-highest level in more than three years, as production picked up pace despite overseas demand for British goods easing from a near-record high in July. \nFirms were also feeling more positive, with business confidence reaching its highest level for three months, on the back of new product launches and the stronger global economy. \nRob Dobson, director at IHS Markit, said the manufacturing sector was in “good health” despite concerns over Brexit, handing further evidence for policymakers calling for an interest rate hike. \nHe said: “The UK manufacturing sector continued to show signs of solid progress during the third quarter, with rates of expansion in output, new orders and employment all gathering pace in August. \n“The key question is whether this positive start to the second half of the year can be sustained. This is looking increasingly likely during the near-term, given the breadth of the expansion. \n“There are increasing signs of supply-side issues leading to raw material and staff shortages, which could become a constraint on output growth going forward, while also leading to higher costs.” \nThe Brexit-hit pound was pinpointed as key factor in attracting foreign buyers to British products, with firms seeing new export work from mainland Europe, USA, China and Australia. \nHowever, sterling’s slump has proved a double-edged sword for manufacturers, fuelling demand by making British goods cheaper on global markets while ramping up import costs. \nNearly a third of companies saw a rise in purchase prices despite the overall rate tracking below record levels seen at the start of 2017, according to the report. \nSamuel Tombs, chief UK economist at Pantheon Macroeconomics, said: “The pick up in the PMI brings tentative hope that the recent decline in the official manufacturing output data will be reversed swiftly. \n“The manufacturing sector, however, should be doing even better, given sterling’s huge depreciation and the emergence of a strong recovery in the Eurozone. \n“Indeed, the UK’s PMI remained below the eurozone’s (57.4) for the fourth consecutive month. \n“In addition, manufacturers’ optimism regarding future production growth only edged up in August to its five-year average, suggesting that they will invest only cautiously in extra capacity.” \nA robust performance from the manufacturing industry will fuel hopes that the UK economy can churn out a stronger performance in the third quarter following its tepid start to the year. \nThe Office for National Statistics (ONS) confirmed last month that Britain delivered the slowest growth in the second quarter out of the G7 group of nations, expanding by 0.3% for April to June, up from 0.2% during the first three months of the year. \nIt came as household spending slumped to its lowest level in nearly three years following a slowdown in new car sales and persistent pressure from higher inflation. Like us on Facebook", "external_links": [], "published": "2017-09-01T14:09:00.000+03:00", "crawled": "2017-09-01T14:35:34.000+03:00", "highlightTitle": ""}