{"organizations": [], "uuid": "1e3992f9b104f1959c288aa50ed445aa7390bcb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/news/devon-news/article537877.ece/ALTERNATES/s1200/AGM-Image-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/great-uncertainty-ahead-britains-national-537899", "country": "GB", "title": "\"Great uncertainty\" ahead for Britain's National Parks, warns Exmoor Society chairman", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-26T21:14:00.000+03:00", "replies_count": 0, "uuid": "1e3992f9b104f1959c288aa50ed445aa7390bcb7"}, "author": "Lewis Clarke", "url": "http://www.devonlive.com/news/devon-news/great-uncertainty-ahead-britains-national-537899", "ord_in_thread": 0, "title": "\"Great uncertainty\" ahead for Britain's National Parks, warns Exmoor Society chairman", "locations": [], "entities": {"persons": [{"name": "uncertai", "sentiment": "none"}, {"name": "rachel thomas", "sentiment": "none"}, {"name": "steven pugsley", "sentiment": "none"}, {"name": "alison smith", "sentiment": "none"}, {"name": "helen blackman", "sentiment": "none"}, {"name": "dieter helm", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "myc riggulsford", "sentiment": "none"}, {"name": "nigel stone", "sentiment": "none"}, {"name": "antony acland", "sentiment": "none"}, {"name": "ian bateman", "sentiment": "none"}, {"name": "mike green", "sentiment": "none"}, {"name": "keith howe", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "national park", "sentiment": "none"}, {"name": "myc riggulsford", "sentiment": "none"}, {"name": "plantlife", "sentiment": "none"}], "organizations": [{"name": "national parks", "sentiment": "none"}, {"name": "exmoor society", "sentiment": "none"}, {"name": "exeter university", "sentiment": "none"}, {"name": "oxford university", "sentiment": "none"}, {"name": "the exmoor society", "sentiment": "none"}, {"name": "society", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "exmoor society agm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News \"Great uncertainty\" ahead for Britain's National Parks, warns Exmoor Society chairman \"Uncertainty over the continuation of future public funding and no clear way ahead for the rural environment and agriculture\" she says Share From l-r: Alison Smith, Myc Riggulsford, Rachel Thomas, Sir Antony Acland, President, Dr Helen Blackman, Dr Nigel Stone, Steven Pugsley - © The Exmoor Society; Share \nThe chairman of the Exmoor Society has warned the National Park is facing a period of “great uncertainty”. \nAt the recent Exmoor Society AGM, Chairman Rachel Thomas said: “We have now, in 2017, entered a period of great uncertainty in so many ways and not least for national parks. \n“As we face Brexit and the end of the Common Agricultural Policy there appears to be no firm ground, with uncertainty over the continuation of future public funding and no clear way ahead for the rural environment and agriculture. There is a great deal of noise and clutter from different bodies and interest groups putting forward their own views, sometimes exaggerated or in black and white terms leading to claims and counter claims.” Read More Balancing act for National Trust on shooting, badger cull and trail hunting \nShe added: “The Exmoor Society needs to keep abreast with the different ideas for future farm funding on Exmoor with around £13 million coming into the area from the Basic Payment Scheme and agri-environmental payments at the moment. What we do know is that Exmoor’s diverse landscapes, rich habitats and wildlife and ancient culture are inextricably linked to farming activities and the farming community. \n“The viability of Exmoor hill farms and livestock enterprises is of crucial importance and any new agri-environmental scheme must take this into account. The Exmoor Society \n“Some elements within the conservation movement, by only concentrating on the negative impacts, have underplayed the significance of farming in protecting natural and cultural assets. There is a strong case for public funding if farmers commit to delivering a wide range of public goods and services within national parks. \n“The Exmoor Society remains convinced that this will be the case here as the farming community has long recognised that as landscape farmers they produce both food from healthy livestock and fine landscapes valued by the public. For example, the Society will strongly support its conviction that the moorlands are not “a sheep-wrecked desert”. Read More Somerset-bred ram smashes centre record at English National Texel sale \nInstead, although fragmented and not of the vast scale found in other national parks, they are important for Exmoor, dominating it physically and aesthetically, providing challenging open access and experiences of wide open spaces with a sense of freedom and glimpses of the wild. Most moorland blocks are designated as SSSIs, internationally recognised for their wildlife, and their heather, which has been so magnificent this year, and grass habitats, with valuable natural resources such as clean water and act as carbon sinks, they contain pre-historic remains and memories and stories associated with the moor. \nFarmers play an essential role in maintaining the many assets not least through traditional activities such as swaling and controlling the growth of scrub and trees that lead to loss of views, access, archaeology and moorland landscape character. Heather Moorlands 2017 (Image: Mike Green) \nDr Keith Howe, Trustee and Exeter University said: “A future Exmoor farm scheme must fit in with the national policy framework and understanding some of the relatively new concepts such as natural capital is paramount. The Society’s annual Spring Conference in April had heard from two world class experts, Professors Dieter Helm (Oxford University) and Ian Bateman (Exeter University) and many of their ideas can be incorporated into an agri environmental scheme for Exmoor. The Society has now commissioned further research into how a natural and cultural capital approach can be put into practice at a farm scale on Exmoor.” Read More Exmoor horse rider smashes fundraising target in gruelling 100-mile charity challenge \nThe Annual General Meeting also heard from other speakers including Dr Helen Blackman, the Society archivist, Alison Smith from Plantlife, Myc Riggulsford on the Charter of the Forest, 800 hundred year’s old this year, and Steven Pugsley who won the Founder’s Award. The meeting closed with Dr Nigel Stone giving his reflections on 17 years as Exmoor Chief Executive. Like us on Facebook", "external_links": [], "published": "2017-09-26T21:14:00.000+03:00", "crawled": "2017-09-26T21:23:01.001+03:00", "highlightTitle": ""}