{"organizations": [], "uuid": "cd5bcd59397ca8f9b4ee95be8194719e7d086326", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i1.leicestermercury.co.uk/incoming/article383621.ece/ALTERNATES/s1200/Marked-up-aerial2.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/revealed-nestl-planning-vast-new-446990", "country": "US", "domain_rank": 48128, "title": "Revealed: Nestlé 'planning vast new Leicestershire warehouse' - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.603, "site_type": "news", "published": "2017-09-10T07:00:00.000+03:00", "replies_count": 0, "uuid": "cd5bcd59397ca8f9b4ee95be8194719e7d086326"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/revealed-nestl-planning-vast-new-446990", "ord_in_thread": 0, "title": "Revealed: Nestlé 'planning vast new Leicestershire warehouse' - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "andrew bridgen", "sentiment": "none"}, {"name": "eddie stobart", "sentiment": "none"}, {"name": "nick pulley", "sentiment": "none"}, {"name": "roxhill", "sentiment": "none"}], "locations": [{"name": "heathrow airport", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "east midlands gateway", "sentiment": "none"}, {"name": "north west leicestershire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "kegworth", "sentiment": "none"}, {"name": "east midlands gateway  the east midlands gateway", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bardon hill", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "coalville", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "leicester mercury click", "sentiment": "negative"}, {"name": "leicestershire enterprise partnership", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "xpo logistics", "sentiment": "none"}, {"name": "slough", "sentiment": "none"}, {"name": "property week", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "leicestershire  north", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nestle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Comments \nNestlé, the world’s biggest food and beverage company, is reported to be planning a vast new warehouse in Leicestershire. \nThe food and drinks giant is understood to be in talks for a 600,000 sq ft unit at the East Midlands Gateway – a 700 acre distribution park being built in north Leicestershire. \nThe Swiss business is staying tight lipped about the plans but reports suggest it could help kickstart other lettings there. \nNestlé already has a distribution site at Bardon Hill, near Coalville, run by truck company Eddie Stobart and the Leicester Mercury understands Nestlé would be switching that operation to the new site. Read More Co-op invests £2 million in Leicestershire \nNorth west Leicestershire MP Andrew Bridgen said: \"Nestle have been in contact with me and have promised to keep me updated as and when they have more information on the plans between themselves and XPO Logistics. \n\"I understand the development is still in its very early stages however what is being planned is a state-of-the-art facility. \n\"Plans such as this show the confidence companies have in doing business in North West Leicestershire and in the UK following the Brexit vote.\" \nIt is not known how many jobs Nestléwould bring to the new site – which would be operated by its third-party transport provider XPO Logistics – or if new jobs would be created. Work is underway at East Midlands Gateway \nThe East Midlands Gateway (EMG) is being built on a huge greenfield site by property investment and development companies Segro, in Slough, and Roxhill, in Rugby. \nThe three-year construction programme got under way earlier this year just north of East Midlands Airport. \nThe Property Week source said: “This will really get things moving and is a vote of confidence in the scheme. \n“There’s plenty of demand from companies in need of state-of-the-art logistics space, and East Midlands Gateway, being next to the motorway, train links and the airport, is already proving to be a draw for potential occupiers like Nestlé.” Nestlé is the world’s largest food and beverage company \nA Nestlé spokesman said they were working with XPO Logistics on a new main distribution centre for Nestlé UK but would not confirm if the new site would be in Leicestershire. \nBut, all being well, it would start operating in 2019. \nHe said: “We are pleased to be working with XPO Logistics on plans for a brand new, state-of-the-art distribution centre to service Nestlé. Read More Leicestershire distribution complex bids to become a main supplier for £16.5bn Heathrow expansion \n“The development is still in the early planning stages and we will be able to provide more detail in the near future.” \nEast Midlands Gateway is being built between Kegworth and Castle Donington and will have its own rail terminal, eventually generating more than 7,250 jobs. Read More 150 events scheduled for third annual Leicester Business Festival \nOnly last week it was announced the developers were bidding for the 6 million sq ft site to become a main supplier for the planned £16.5 billion expansion of Heathrow Airport. \nIt hopes to be one of four locations used to pre-assemble components for the new runway and terminals – avoiding the disruption caused by actually doing the work at Heathrow. \nA total of 121 sites have put themselves forward for the contract with the final four announced later this year. \nNick Pulley, who chairs the Leicester and Leicestershire Enterprise Partnership, said businesses based there could become key players in delivering one of the largest and most important infrastructure projects in Europe. Like us on Facebook ", "external_links": [], "published": "2017-09-10T07:00:00.000+03:00", "crawled": "2017-09-10T11:23:58.002+03:00", "highlightTitle": ""}