{"organizations": [], "uuid": "48fa3617e486b59057f261797ec659451d55a091", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/incoming/article496189.ece/ALTERNATES/s1200/imperial-exeterPNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/whats-on/food-drink/wetherspoon-pubs-could-soon-axe-496150", "country": "GB", "title": "Wetherspoon pubs could soon axe European beers and ciders after Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-18T21:09:00.000+03:00", "replies_count": 0, "uuid": "48fa3617e486b59057f261797ec659451d55a091"}, "author": "Abbie Bray", "url": "http://www.devonlive.com/whats-on/food-drink/wetherspoon-pubs-could-soon-axe-496150", "ord_in_thread": 0, "title": "Wetherspoon pubs could soon axe European beers and ciders after Brexit", "locations": [], "entities": {"persons": [{"name": "wetherspoon", "sentiment": "none"}, {"name": "brexit wetherspoon", "sentiment": "none"}, {"name": "tim martin", "sentiment": "none"}, {"name": "jamie oliver-backed", "sentiment": "none"}, {"name": "wetherspoons", "sentiment": "none"}, {"name": "juncker", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "jean claude juncker", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "taunton", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "kopparberg", "sentiment": "none"}, {"name": "wetherspoons", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "lavazza", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wetherspoon pubs could soon axe European beers and ciders after Brexit Firm’s Exeter-based boss warns it will take business elsewhere unless the EU “wises up” Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nThe Exeter boss of pub giant JD Wetherspoon, Tim Martin has threatened to axe EU-made ales unless officials “wise up”. \nMr Martin claimed European Commission President Jean Claude Juncker and other “oligarchs” are risking making EU goods more expensive by blocking a trade deal with the UK. \nAnd he warned Wetherspoons could cull some of the products it buys from Europe as a result, potentially hitting supplies of some booze and Lavazza coffee – its biggest single seller – from Italy. Wetherspoons is backing a national Tax Equality Day - which means you'll get a cheaper pint for one day only Read More Starbucks to close major Devon branch \n“In the current negotiations, democratically-elected politicians from the UK are dealing with unelected oligarchs from the EU,” Mr Martin said. \n“Since the oligarchs are not subject to judgement at the ballot box, their approach is dictated by more sectarian factors – the interests and ideology of EU apparatchiks like them, rather than residents or businesses from EU countries. \n“As a result of their current posturing and threats, EU negotiators are inevitably encouraging importers like Wetherspoon to look elsewhere for supplies. \n“This process is unlikely to have adverse effects on the UK economy, as companies will be able to switch to suppliers representing the 93% of the world’s population which is not in the EU, but this evolution will eventually be highly damaging to the economy of the EU. \n“Wetherspoon is extremely confident that it can switch from EU suppliers, if required, although we would be very reluctant to initiate such actions.” Read More Could you handle the Big Mac challenge? \nHe said Juncker and other EU officials “need to take a wise-up pill in order to avoid causing further economic damage to struggling economies like Greece, Portugal, Spain and Italy.” \nMany European sounding lagers sold here are actually brewed under licence in the UK, so may not be affected by the company’s decision. \nBut one product Martin said could be impacted is Swedish cider Kopparberg, which he claimed Wetherspoons sold more of than the whole of Sweden. \n“Would we switch to Taunton cider or other ciders?,” he said. “There are a lot of cider companies in the UK.” \nMartin said he was “almost embarrassed” to admit that coffee was its biggest selling product. \n“Lavazza is an Italian company, they are really good,” he added.”But it is very difficult for them to make their point (to EU officials).” Martin said he was “almost embarrassed” to admit that coffee was its biggest selling product. Read More Would you like a job eating chocolate? - This Westcountry company is looking for a chocolatiers apprentice \nIt came as Wetherspoon’s announced annual profits jumped 25% to £103million, with sales up 4.1% to £1.6billion. \nThe firm’s share price leapt 13% to a record high yesterday, boosting the value of founder Martin’s stake by £48m to £398m. \nMartin repeated calls for the VAT on pub grub and drink to be cut to supermarket levels, claiming the company could open up an extra 300 pubs as a result. \nHe also slammed the celebrity chef Jamie Oliver-backed sugar tax, which would cost it £4m this year. \n“He feels you should tax soft drinks, which he doesn’t make, but not desserts, which he does,” he said. \nMartin joked that he didn’t have plans for new product lines “unless they legalise cannabis”. Like us on Facebook ", "external_links": [], "published": "2017-09-18T21:09:00.000+03:00", "crawled": "2017-09-18T21:27:34.001+03:00", "highlightTitle": ""}