{"organizations": [], "uuid": "32bc7eb47b980c3f569b67d95f4b48d1f22c1886", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/incoming/article457152.ece/ALTERNATES/s1200/2730892.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/whats-on/shopping/gallery/20-princesshay-shops-restaurants-came-457130", "country": "US", "title": "The 20 Princesshay shops and restaurants that came and went - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2017-09-11T16:24:00.000+03:00", "replies_count": 0, "uuid": "32bc7eb47b980c3f569b67d95f4b48d1f22c1886"}, "author": "Alex Richards", "url": "http://www.devonlive.com/whats-on/shopping/gallery/20-princesshay-shops-restaurants-came-457130", "ord_in_thread": 0, "title": "The 20 Princesshay shops and restaurants that came and went - Devon Live", "locations": [], "entities": {"persons": [{"name": "zavvi", "sentiment": "none"}, {"name": "pandora", "sentiment": "none"}, {"name": "edinburgh woollen mill", "sentiment": "none"}, {"name": "ann summers", "sentiment": "none"}, {"name": "richard branson", "sentiment": "none"}, {"name": "jamie oliver", "sentiment": "none"}, {"name": "mario", "sentiment": "none"}, {"name": "jack wills", "sentiment": "none"}, {"name": "byron burger", "sentiment": "none"}, {"name": "clintons", "sentiment": "none"}, {"name": "jamie", "sentiment": "none"}, {"name": "bennett", "sentiment": "none"}, {"name": "virgin megastore", "sentiment": "none"}, {"name": "dorothy perkins", "sentiment": "none"}, {"name": "barratts", "sentiment": "none"}, {"name": "lk bennett", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "jane norman", "sentiment": "none"}, {"name": "euan sutherland", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "princesshay", "sentiment": "none"}, {"name": "dart", "sentiment": "none"}], "locations": [{"name": "bedford square", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "roman empire", "sentiment": "none"}, {"name": "north africa", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "virgin megastore", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "strada", "sentiment": "none"}, {"name": "princesshay", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "exeter high street", "sentiment": "none"}], "organizations": [{"name": "torquay", "sentiment": "none"}, {"name": "usc", "sentiment": "none"}, {"name": "edinburgh woollen mill", "sentiment": "none"}, {"name": "la senza", "sentiment": "none"}, {"name": "orange tree", "sentiment": "none"}, {"name": "hmv", "sentiment": "none"}, {"name": "the co-operative group", "sentiment": "none"}, {"name": "nike running and sweat shop", "sentiment": "none"}, {"name": "cafe rouge", "sentiment": "none"}, {"name": "virgin megastore", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "strada", "sentiment": "none"}, {"name": "united sports corporation", "sentiment": "none"}, {"name": "bristol channel", "sentiment": "none"}, {"name": "disney store", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On gallery The 20 Princesshay shops and restaurants that came and went \nWhether it was the credit crunch or just a relocation to a bigger pad, try not to get too nostalgic over these long-gone retailers Updated 15:05, 11 SEP 2017 Virgin Megastore was one of the first to leave Princesshay when large swathes of Sir Richard Branson's HMV competitor were sold. If you're feeling sad pangs of nostalgia don't worry - you can still find Virgin Megastore in the Middle East and North Africa. 1 of 18 Jamie's Italian was a major coup for Princesshay, but it all went a bit sour because of the Brexit - according to celeb chef owner Jamie Oliver. He blamed the decision of the referendum for killing six of his darling's - affecting 120 employees. 2 of 18 Remember Principles? This one will certainly be a blast from the past - set up in 1984 as a rival to Dorothy Perkins (also RIP). The credit crunch victim went defunct in 2009 after a couple of years trading in Princesshay. You can find Principles in some capacity inside Debenhams stores. 3 of 18 Before the burger boom and the proliferation of pizza places, Exeter had a tapas takeover. The Spanish restaurant stopped serving paella and tapas in Princesshay in 2014. The nearest is now in Bath and you'll find posh burger joint Byron Burger in its place at Bedford Square. 4 of 18 This one is a bit of technicality as CULT went under a rebrand to become Superdry - which still has a large unit in Princesshay. Fun fact: CEO of Superdry is Euan Sutherland, the former CEO of The Co-operative Group. That tin of beans is trendier than you think... in a way? 5 of 18 Orange Tree was one of the few local businesses that had a unit in Princesshay. The things it sold weren't exclusively orange, with blue and red things too. They are still going despite closing its Princesshay shop. You can still find them at Dart's Farm and online. 6 of 18 Before Jamie's Italian, one of the biggest dining units was occupied by (also-Italian) Strada - owned by the same people as Cafe Rouge right next door. Which could be why, in 2014, 43 Strada's were snapped up by Sun Capital and ours went the way of the Roman Empire. Jump over the Bristol Channel to find your nearest Strada now - in Cardiff. 7 of 18 Like CULT, the sign for Scottish fashion retailer USC is one you can't help but remember in Princesshay. It merged with Sports Direct in 2013 and its presence in Exeter ended. What does USC stand for? United Sports Corporation. The more you know... 8 of 18 Husbands, avert your eyes from the models in the window, it's lingerie shop La Senza. A war with Ann Summers and Triumph was clearly lost between 2012 and 2013 when a third of the Canadian chain's stores were axed - including a Princesshay unit in a prime location. 9 of 18 After the fall of Virgin Megastore in '07, Zavvi was formed independently from the ashes. But it didn't last long, and the plummeting phoenix had to be snapped up by HMV. No matter who owns it, it appears the corner site will always be occupied by an entertainment chain. 10 of 18 A double bill here, with Nike Running and Sweat Shop both setting up, er, shop next to, er, Next. Sports Direct is a major shareholder of the business, and, like USC, have been erased from Princesshay. One positive is that Lush is moving into the unit instead - which obviously smells nicer than sweat. 11 of 18 GAME, the video games retailer which has hopped around Exeter from one place to the next like Mario after a few mushrooms, was once in Princesshay. Now in the Guildhall after a confusing to-and-fro relationship with Gamestation. 12 of 18 Another double whammy. Barratts moved out of Princesshay and was replaced, for a surprisingly brief tenure, by The Disney Store - a whole new world away from women's shoes. But will The Disney Store ever return? With the global giant absorbing Star Wars and Marvel superhero movies, the company has boomed in the years since it shut its doors in Exeter. 13 of 18 Too luxurious for Exeter? International fashion brand LK Bennett has left Exeter recently. You can still find LK Bennett clothing in John Lewis. 14 of 18 Gone, but not very far. Jack Wills began life in Exeter in Princesshay's Bedford Square. The rah-rahlly cool brand clearly proved popular with city shoppers and students - moving to a much bigger building on Exeter High Street. Their former home in Princesshay would soon become Pandora - bailing out boyfriend's struggling to think what to buy their girlfriend for Christmas since 2009. 15 of 18 After a massive restructure after emerging from bankruptcy in 2016, Exeter lost its branch of the Australian/American fashion chain. Here's a fun, but useless, fact: Quicksilver was found in Torquay, Australia. While Devon's Torquay is one of the most exotic places in the UK, Australia's probably pips it for sun-tan fans. 16 of 18 Women's clothing retailer Jane Norman also vanished from Princesshay in recent years. Owned by Edinburgh Woollen Mill and related to Peacocks, the company went into administration in '14 and waved goodbye to Princesshay and hello to concession stands in Edinburgh Woollen Mill at the Cathedral Green. 17 of 18 Another mover, Clintons was once sat on the main route through Princesshay before making a leap (and a trendy red rebrand) to Exeter High Street. They didn't appear to send anyone a post card. Ironic, really. 18 of 18 More On ", "external_links": [], "published": "2017-09-11T16:24:00.000+03:00", "crawled": "2017-09-12T02:54:53.010+03:00", "highlightTitle": ""}