{"organizations": [], "uuid": "cfd807123b37324b5e8220e55d457042d4fbf903", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13306890.ece/ALTERNATES/s1200/JS124629200.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jacob-rees-mogg-never-tory-13594734", "country": "GB", "domain_rank": 21960, "title": "Jacob Rees-Mogg will never be Tory leader but he does make politics interesting, says Jon Walker", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-10T10:00:00.000+03:00", "replies_count": 0, "uuid": "cfd807123b37324b5e8220e55d457042d4fbf903"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jacob-rees-mogg-never-tory-13594734", "ord_in_thread": 0, "title": "Jacob Rees-Mogg will never be Tory leader but he does make politics interesting, says Jon Walker", "locations": [], "entities": {"persons": [{"name": "jon walker", "sentiment": "negative"}, {"name": "jonathan", "sentiment": "negative"}, {"name": "jacob rees-mogg", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jess phillips", "sentiment": "none"}, {"name": "mogg", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "rees-mogg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "tory", "sentiment": "negative"}, {"name": "conservative", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Conservative MP Jacob Rees-Mogg (Image: Jonathan Brady/PA Wire) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nSo it’s goodbye to the Jacob Rees-Mogg show. \nMr Mogg, a Conservative backbencher, had been tipped as a possible future Tory leader. \nIt was partly because supporters had begin praising him on Twitter using the hashtag #MoggMentum - a play on the Labour movement called Momentum which backs Jeremy Corbyn. \nThere was no way of knowing how many people were involved in MoggMentum or how serious they were, but it made for a nice story. \nA poll of readers of the ConservativeHome website, aimed at Tory activists, found Mr Rees-Mogg was their first choice to replace Mrs May. \nAnd Prime Minister Theresa May is widely expected to quit before the next election (despite her recent assertion that she intends to carry on) while there is no obvious candidate to replace her. So why shouldn’t it be him? Read More Could a Brexit bank holiday become a thing? A new Tory 'wish-list' has been revealed \nMr Rees-Mogg did little to dampen speculation that he might run for the leadership. \nHe told Radio 4 in August: “I wouldn’t put any money on it”. That’s a weak denial. \nBut talk of Mr Rees-Mogg becoming Tory leader has dried up after he told ITV’s Good Morning Britain that he was “completely opposed to abortion” and against same-sex marriage. \nHe also made it very clear that he doesn’t think the Government should actually prevent people getting abortions or marrying same-sex partners, saying his views were a result of his Catholic religion and he had no right to force them on anyone else. \nBut that hardly matters. You can’t have a party leader who says those things. \nThe interview marked the end of a silly season story which deserved to die. Because Mr Rees-Mogg was never going to be Conservative leader. \nRather like Boris Johnson, Mr Rees-Mogg adds to the gaiety of the nation but is not to be taken seriously. Read More Jeremy Corbyn attacks Sports Direct boss Mike Ashley over zero hour contracts \nHis habit of quoting Latin and citing ancient history marks him out as an eccentric and as something of an intellectual. \nHe seems likeable, and even charmed the outspoken Labour MP Jess Phillips when they made a film for Channel 4 together. \nBut voters would never have taken him seriously as a potential Prime Minister, and that’s why Conservative activists would never have made him leader. \nHe’s not even as posh as he seems. His dad was editor of the Times, top job on a great newspaper. \nBut even the most successful journalist is still a journalist - practitioners of a trade which marks them as middle class at most. Like us on Facebook ", "external_links": [], "published": "2017-09-10T10:00:00.000+03:00", "crawled": "2017-09-10T10:44:30.004+03:00", "highlightTitle": ""}