{"organizations": [], "uuid": "e5f1d9a46827ec34019dfdb0cd35ab957edcd95e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11588562.ece/ALTERNATES/s1200/JS81937054.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mp-wants-style-yellow-bus-13609421", "country": "GB", "domain_rank": 21960, "title": "MP wants US-style yellow bus services for Northumberland schools", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-13T07:00:00.000+03:00", "replies_count": 0, "uuid": "e5f1d9a46827ec34019dfdb0cd35ab957edcd95e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mp-wants-style-yellow-bus-13609421", "ord_in_thread": 0, "title": "MP wants US-style yellow bus services for Northumberland schools", "locations": [], "entities": {"persons": [{"name": "mrs trevelyan", "sentiment": "none"}, {"name": "gibb", "sentiment": "none"}, {"name": "nick gibb", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "northumberland  asking", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "glendale", "sentiment": "none"}], "organizations": [{"name": "conservative", "sentiment": "negative"}, {"name": "berwick anne-marie trevelyan", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Conservative MP for Berwick Anne-Marie Trevelyan Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Government has been urged to back proposals to let schools run their own bus services. \nNorthumberland County Council wants to change the way pupils get to school in the county so that it no longer relies on commercial bus services. \nIt follows complaints that bus firms are charging too much. \nBut MP Anne-Marie Trevelyan told Ministers that the councils would need the support of the Government to introduce a new system. A bus stop near Morpeth, Northumberland \nAsking for funding, she said: “I call on the Minister to pump-prime a Northumberland project that puts education and transport needs at its heart.” \nNorthumberland pupils could travel long distances to get to school, she said, and the catchment area for Glendale valley schools is some 250 square miles. \nBut bus companies are failing to offer good value for money, the MP claimed. Read More Why is the slow pace of Brexit negotiations angering some North East politicians? \nShe told the House of Commons: “Continuing to pay bus companies large sums of money to provide limited services, and charging post-16 students’ families more than £600 per year per pupil for transport passes , is simply unsustainable.” \nShe added: “Surely this is money that could be spent on frontline teaching, education resources and tools to give our children the very best chance in life, which is what a country such as the United Kingdom should be affording them wherever they live.” \nMrs Trevelyan said the Tory-run country council hoped to use a “social enterprise”, such as a charity, to provide transport. Read More MP claims she was victim of hate campaign saying she should be burnt as a witch \n“To that end, I would like to encourage a new system that will empower schools themselves to no longer have to rely on the big bus companies with a very limited offer, but to create a community transport solution, perhaps something like the yellow bus model we see in ​the United States.” \nShe urged education minister Nick Gibb: “I ask him to sit down with me, councillors and the relevant Transport Minister to help design a community transport hub that can flex to the needs of the most rurally based children and others in communities currently cut off from so much by the lack of public transport.” \nMr Gibb said: “I would be interested to hear more about Northumberland County Council’s proposals so that we can consider them in more detail.\" \nHe also told MPs: “Local authorities have responsibility for the provision of home to school transport. In consultation with schools, they are best placed to determine the specific needs of a particular local community. They already commission a range of free and subsidised transport services, spending around £1 billion each year on home to school transport. \n“The existing home to school transport framework allows local authorities the flexibility and freedom to make transport arrangements which best suit the needs of pupils and offer value for money for their local communities.” Like us on Facebook", "external_links": [], "published": "2017-09-13T07:00:00.000+03:00", "crawled": "2017-09-13T09:01:31.000+03:00", "highlightTitle": ""}