{"organizations": [], "uuid": "1e064a750a4550d5d9a8a66327aa33267956d765", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/news/devon-news/article542047.ece/ALTERNATES/s1200/Turning-of-the-Stone-1953-Denys-Bridgman-Second-left.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/devil-comes-devon--meet-541964", "country": "GB", "title": "The Devil comes to Devon – meet the Devon villagers who save the world once a year", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-27T17:43:00.000+03:00", "replies_count": 0, "uuid": "1e064a750a4550d5d9a8a66327aa33267956d765"}, "author": "Joe Bulmer", "url": "http://www.devonlive.com/news/devon-news/devil-comes-devon--meet-541964", "ord_in_thread": 0, "title": "The Devil comes to Devon – meet the Devon villagers who save the world once a year", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "lucifer", "sentiment": "none"}, {"name": "hugh grant", "sentiment": "none"}, {"name": "morris dancers", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "martin warren", "sentiment": "none"}, {"name": "george ackland", "sentiment": "none"}, {"name": "bill ackland", "sentiment": "none"}, {"name": "paul watts", "sentiment": "none"}, {"name": "denys bridgman", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "walter ackland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bill hayne", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "shebbear", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "saxon", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "none"}, {"name": "st michael’s church", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The Devil comes to Devon – meet the Devon villagers who save the world once a year It’s a little known fact that a village tucked away in the heart of Devon every year staves off the Devil “saving the world from potential catastrophe”, or so the story goes. Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nIt’s a little known fact that a village tucked away in the heart of Devon every year staves off the Devil “saving the world from potential catastrophe”, or so the story goes. \nShebbear in North Devon is home to an unusual rock known as the Devil’s Stone it is believed by locals to be the resting place of the Devil after he was cast out of heaven by the archangel Michael. \nAfter casting him down to earth Michael threw a stone at him trapping him beneath the ground. Bill Hayne, Denys Bridgman, Bill Ackland, Walter Ackland and George Ackland turn the stone in 1953 Read More 20% of workplace mugs are contaminated with faecal matter, research shows \nThis stone, according to legend, landed in Shebbear’s village square. \nWhile it may seem far fetched that the devil is buried under a village square in Devon, locals are adamant the ceremony is vital. Some claim the last time the stone went unturned was in 1939, the year World War Two started. \nEvery November 5 after the local vicar gives a speech on the origins of the rock the bell ringers of St Michael’s Church turn the hefty stone forcing Lucifer to start tunnelling to the surface all over again for another year. \nThe ceremony is often accompanied by Morris Dancers, face painting and BBQs and it has even had static motorbike displays. The stone being turned in 2013 Read More Hugh Grant to film scandalous starring role in Devon next month \nVillager Paul Watts explained the appeal and importance of the yearly ceremony, he said: “It predates history, no one knows when it first started. It’s mentioned in the Domesday Book and is believed to be the oldest continuing ceremony in Europe. \n“It predates Christianity but it’s been taken over by Christianity like many pagan holidays, Christmas for example. \n“It’s a struggle to turn it over, it is a big old rock. The turning of the stone has been missed on a couple of occasions and various catastrophes have followed.” \nHe added: “During the ceremony the vicar gets very animated, he tells people the story and occasionally throws in some current affairs, he got Brexit in last year.” The stone ceremony is conducted by the village vicar Read More BREAKING: Ryanair to cancel flights affecting 400,000 more people \nDevonLive.com spoke to the village vicar Martin Warren about the tradition and his role in it. \n“I lead out the ringers to turn the stone and I tell the story. The story of Michael ousting the devil is biblical and is a story of good triumphing over evil, it’s very appropriate,” said Martin. \n“The stone has clearly been a part of the of the village’s history. We know in Saxon times people would gather at the stone to pay their taxes. \n“Every place has its quirks but forget about bonfire night this is an opportunity to celebrate the triumph of goodness, it’s like Easter at the other end of the year.” Read More", "external_links": [], "published": "2017-09-27T17:43:00.000+03:00", "crawled": "2017-09-27T18:26:06.002+03:00", "highlightTitle": ""}