{"organizations": [], "uuid": "0bb676b3fbdd60e4d30e8e0ecbfa1f35f899fb0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13189725.ece/ALTERNATES/s1200/SGP_NEC_080617ELECTION18JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/outspoken-new-north-east-mp-13683464", "country": "GB", "domain_rank": 21960, "title": "Outspoken new North East MP has 'quite a future' in politics, says Tom Watson", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-09-27T18:00:00.000+03:00", "replies_count": 0, "uuid": "0bb676b3fbdd60e4d30e8e0ecbfa1f35f899fb0b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/outspoken-new-north-east-mp-13683464", "ord_in_thread": 0, "title": "Outspoken new North East MP has 'quite a future' in politics, says Tom Watson", "locations": [], "entities": {"persons": [{"name": "tom watson", "sentiment": "negative"}, {"name": "pidcock", "sentiment": "none"}, {"name": "pat glass", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "ms pidcock", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "pidcock", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "share labour", "sentiment": "none"}, {"name": "invalid email  labour", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Outspoken new North East MP has 'quite a future' in politics, says Tom Watson The Labour Deputy Leader was praised North West Durham MP Laura Pidcock Share Labour's Laura Pidcock (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour Deputy Leader Tom Watson has praised outspoken MP Laura Pidcock and said she has “quite a future” ahead of her. \nMs Pidcock, MP for North West Durham , has caused a splash since she was elected for the first time in June. \nShe was widely praised after saying that Parliament “reeks of the establishment and of power” in her maiden speech in the House of Commons. \nMr Watson said he knew Ms Pidcock before she entered politics , when she worked for anti-racism charity Show Racism the Red Card. \nIn a light-hearted comment, he told the Chronicle : “I sometimes think that when you are in my position, if you try to pick winners it’s very bad for their future career.” Deputy Labour leader Tom Watson (Image: PA) \nBut he added: “I worked with her before she became an MP. \n“She did fantastic work with Show Racism the Red Card. She did really innovative work combating racism. \n“When you get elected to Parliament at such a young age, the one bit of advice I do give to colleagues is that it’s a marathon, not a sprint. \n“But I do think she’s got quite a future ahead of her.” \nMs Pidcock was elected as a Labour MP in the June 8 General Election after former North West Durham MP Pat Glass stood down. Read More Tom Watson reveals Labour's stance on a second Brexit referendum \nIn her maiden speech in the Commons, she told fellow MPs: “Turning to this place, this building is intimidating. \n“It reeks of the establishment and of power; its systems are confusing - some may say archaic - and it was built at a time when my class and my sex would have been denied a place within it because we were deemed unworthy. \n“I believe that the intimidating nature of this place is not accidental. The clothes, the language, and the obsession with hierarchies, control and domination are symbolic of the system at large. Read More Newcastle was chosen for an experiment with Universal Credit and it was a disaster \n“But the most frustrating thing has been to sit opposite those people who tell me that things are better, and that suffering has lessened for my constituents. \n“I would like them to come and tell the people who have been sanctioned that things are better. I would like them to tell that to the teacher in my constituency who was recently made redundant. I would like them to talk to the 16,500 people in County Durham in receipt of food parcels. \n“I would like them to talk to the nurses, the junior doctors and the firefighters — come and tell them that years of austerity have improved their practice or their profession.” Like us on Facebook ", "external_links": [], "published": "2017-09-27T18:00:00.000+03:00", "crawled": "2017-09-27T20:22:57.012+03:00", "highlightTitle": ""}