{"organizations": [], "uuid": "5e9b95bf882fd8e52bf274bc7bc3aef3c1f309c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12907382.ece/ALTERNATES/s1200/Theresa-May-statement.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tories-hope-make-gains-across-12924961", "country": "GB", "domain_rank": 21960, "title": "Why the Tories hope to make gains across the North in Theresa May's General Election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why the Tories hope to make gains across the North in Theresa May's General Election", "spam_score": 0.0, "site_type": "news", "published": "2017-04-23T12:00:00.000+03:00", "replies_count": 0, "uuid": "5e9b95bf882fd8e52bf274bc7bc3aef3c1f309c9"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tories-hope-make-gains-across-12924961", "ord_in_thread": 0, "title": "Why the Tories hope to make gains across the North in Theresa May's General Election", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Why the Tories hope to make gains across the North in Theresa May's General Election Conservatives think North voters will turn against Londoner Jeremy Corbyn in the run up to General Election on June 8 Share Prime Minister Theresa May makes a statement in Downing Street, London, announcing a snap general election on June 8 (Photo: John Stillwell/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nConservatives believe Theresa May’s surprise General Election is their chance to make historic gains in the North of England - and demolish Labour’s claim to be the obvious choice for working class Northern voters. \nPolling experts say any seat held by Labour with a majority of less than 5,000 at the last general election may be at risk. \nThat includes North seats such as Middlesbrough South and Cleveland East, where Labour’s majority was 2,268 in the 2015 election; Hartlepool, where the party is defending a majority of 3,024, and Bishop Auckland in County Durham, where Labour’s majority is 3,508. \nTory hopes were buoyed by their by-election win in Copeland, Cumbria, in February. They succeeded in overturning a Labour majority of 2,564. \nSitting Labour MPs in two of the seats under threat have already announced their intention not to stand again. Tom Blenkinsop \nMiddlesbrough South and Cleveland East MP Tom Blenkinsop quit with a broadside at Labour leader Jeremy Corbyn, saying; “I have made no secret about my significant and irreconcilable differences with the current Labour leadership.” \nHartlepool MP Iain Wright also said he was standing down. \nThey were joined by Pat Glass, MP in the safe Labour seat of North West Durham, and Dave Anderson, MP for Blaydon, bringing the number of quitting Labour MPs in the region to four. MP Dave Anderson (Photo: John Stilwell/PA Wire) \nTory whip Guy Opperman , the MP for Hexham in Northumberland, said: “Jeremy Corbyn’s out of touch, London based, Labour Party is no longer the party of ordinary, hardworking people in the North. In fact, four Labour MPs in the North East have already quit the election before it has even begun, including the MPs for the two key marginal seats of Hartlepool and Middlesbrough South.” \nConservatives hope to make Brexit the theme of the election, and to contrast what they describe as strong leadership under Conservative Theresa May with the “chaos” that would result if Labour’s Jeremy Corbyn became Prime Minister. Hexham MP Guy Opperman \nMr Opperman said: “The North East faces a clear choice between strong and stable leadership in the national interest - with Theresa May as Prime Minister - or weak and unstable coalition government led by Jeremy Corbyn, propped up by Nicola Sturgeon’s Scottish Nationalists.” \nBut Labour hopes to persuade voters the election is about far more than just Brexit. \nMr Corbyn launched his election campaign on Thursday with a hard-hitting speech condemning a “gilded elite” who “leech” off low-paid workers - and named Sports Direct boss Mike Ashley as one of the people in his sights. \nHe followed this up on Friday by attacking the Tory government for allowing class sizes to rise in primary schools. Video Available. Parliamentary candidate Ian Mearns casts his election vote at his local polling station. (Photo: Claire McKie) \nGateshead Labour MP Ian Mearns said: “This is about how a government runs a whole country over a period of five years, not just one issue, however important that may be. \n“Theresa May is trying to have another Brexit referendum really, but what we’ve got to do is get the debate round to the other issues of the day, and there are so many of them. \n“Education funding, the NHS in crisis, the care system, housing shortages, transport and the crisis which exists in much of our transport system - all of that is going on along with so many other things that are vital to the North of England like local government funding cuts.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-04-23T12:00:00.000+03:00", "crawled": "2017-04-23T09:04:15.000+03:00", "highlightTitle": ""}