{"organizations": [], "uuid": "74370f6c831bb71585f4e05beb5fc5ef1c75eee7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12910342.ece/ALTERNATES/s1200/FCR_NJL_121016PaulNECCJPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/uk-sleepwalking-low-value-low-12910193", "country": "GB", "domain_rank": 21960, "title": "UK is sleepwalking into a 'low-value, low-skills' economy, new report warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "UK is sleepwalking into a 'low-value, low-skills' economy, new report warns", "spam_score": 0.0, "site_type": "news", "published": "2017-04-19T07:01:00.000+03:00", "replies_count": 0, "uuid": "74370f6c831bb71585f4e05beb5fc5ef1c75eee7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/uk-sleepwalking-low-value-low-12910193", "ord_in_thread": 0, "title": "UK is sleepwalking into a 'low-value, low-skills' economy, new report warns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Carbert, policy advisor, North East England Chamber of Commerce (Photo: handout) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe UK is sleepwalking into a low-value, low-skills economy which leaves the nation ill-prepared for its post-Brexit future, the Government is being warned. \nThe Chartered Institute of Personnel and Development (CIPD) has highlighted “multiple failings” in the country’s skills system, with England and Northern Ireland together ranked in the bottom four Organisation for Economic Co-operation and Development (OECD) countries for literacy and numeracy among 16 to 24-year-olds. \nOut of 19 countries, the UK ranks bottom of the class on young people’s computer problem-solving skills, while employers spend less on training than other major EU economies and less than the EU average. \nCIPD added that the UK lies fourth from the bottom in an EU league table on participation in job-related adult learning, with evidence showing a marked deterioration since 2007. \nLizzie Crowley, skills adviser for the CIPD, said: “This is a sobering analysis of the state of skills in the UK. Our report should serve as a real wake-up call for the Government to break with the past two decades of failed skills policy and set the UK on a new course that delivers the right results for individuals, organisations and the economy as a whole. \n“While more efforts are being made to reform education, it’s clear that there needs to be a much greater emphasis on learning and development in the workplace. \n“As we move towards Brexit, and possible restrictions on overseas talent, it’s crucial that government works in partnership with education providers and businesses to address these deep-rooted issues that continue to blight individual and business potential.” Read More \nThe CIPD said skills should be at the centre of the Government’s industrial strategy. \nSkills shortages are a major concern for many North East businesses. \nPaul Carbert, policy adviser at the North East England Chamber of Commerce, said: “Chamber members frequently cite skills shortages as one of their key concerns, and this report is clear about the challenges we face. \n“To build a Working North East, we are supporting members with campaigns on increasing graduate retention in the region, improving careers guidance in schools, and growing the number of apprenticeships that are available. We need stability and long-term commitments to funding from the Government to help us build a skills and training system fit for the future.” Like us on Facebook", "external_links": [], "published": "2017-04-19T07:01:00.000+03:00", "crawled": "2017-04-19T03:05:28.000+03:00", "highlightTitle": ""}