{"organizations": [], "uuid": "451ab1c3f37b704034c0d8f433aaf05a165873f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30300681/15978261.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/will-rachel-johnson-anger-brother-boris-by-standing-as-an-anti-brexit-mp-at-the-general-election/story-30300681-detail/story.html", "country": "GB", "title": "Will Rachel Johnson anger brother Boris by standing as an...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Will Rachel Johnson anger brother Boris by standing as an...", "spam_score": 0.0, "site_type": "news", "published": "2017-04-28T22:11:00.000+03:00", "replies_count": 0, "uuid": "451ab1c3f37b704034c0d8f433aaf05a165873f3"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/will-rachel-johnson-anger-brother-boris-by-standing-as-an-anti-brexit-mp-at-the-general-election/story-30300681-detail/story.html", "ord_in_thread": 0, "title": "Will Rachel Johnson anger brother Boris by standing as an...", "locations": [], "entities": {"persons": [{"name": "boris", "sentiment": "none"}, {"name": "rachel johnson", "sentiment": "none"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "ivo dawnay", "sentiment": "none"}, {"name": "jo", "sentiment": "none"}, {"name": "tory ian liddell-grainger", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "will rachel johnson", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "yeovil", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "bridgwater", "sentiment": "none"}, {"name": "winsford", "sentiment": "none"}, {"name": "west somerset", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "guardian", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Will Rachel Johnson anger brother Boris by standing as an anti-Brexit MP at the general election? By WMN_PGoodwin | Posted: April 28, 2017 1 COMMENTS SHARES The author and columnist could oppose her brother in parliament Will Rachel Johnson anger brother Boris by standing as an anti-Brexit MP at the... X \nCopy link to paste in your message / Comments (1) \nRachel Johnson, the journalist and sister of Foreign Secretary Boris Johnson, has joined the Liberal Democrats in protest against Tory support for Brexit and could be eyeing a Westcountry seat. \nThe Mail on Sunday columnist and author, who hails from Exmoor and has a home there, is hoping to run as a Lib Dem candidate, possibly in Devon or Somerset. \nHopes that she might contest a Tory-held seat in the general election on 8 June have been dashed as she does not qualify under rules that insist candidates be members for at least a year before consideration. \nA member of the Conservative party until 2011, Johnson, whose brother Jo is universities minister, has made no secret of her support for Britain remaining in the EU, either in her newspaper columns or during her regular slot on Sky. \nIn the aftermath of the referendum in June she wrote about how she \"sat down and wept\" over the result. \nJohnson has also written about the fallout from her brother Boris's decision to lead the leave campaign. \nBut until now she has always stopped short of withdrawing her support for the Tories. \nLast year, she wrote in her column: \"In general elections I have voted nothing but Tory, and since I have two brothers standing as MPs for the party, it's sort of a matter of family duty.\" \nJohnson's decision to join the Lib Dems is expected to infuriate her brother Boris, who has had a relatively marginal role in the post-Brexit negotiations so far. \nShe could not be reached for comment, but retweeted a message from her husband Ivo Dawnay: \"It's been 25 years since my wife @Rachelsjohnson agreed on anything - but then Brexit. I joined the LibDems 6 weeks ago. Why haven't you?\" \nThe Johnson family farm is on Exmoor near the village of Winsford, in the Bridgwater and West Somerset seat held by Tory Ian Liddell-Grainger. \nShe would make a high-profile choice for two of the Lib Dems' biggest losses in 2015, Yeovil and Bath, where the candidates selected during a party process last year have decided not to stand in the forthcoming election. \nA spokesman for the Lib Dems said Johnson would not be standing in the snap election but could be considered in the future, possibly in Somerset. \nWith just nine MPs, the Lib Dems have campaigned consistently against Brexit. \nParty rules prevent her becoming an official candidate but if she decides to stand, one option is the party not standing against her. \nJohnson is understood to have sought Nick Clegg's counsel over the possibility of standing for election, the Guardian has reported. \nA regional spokesman for the party said details of candidates would emerge once the Devon County Council election was out of the way.", "external_links": [], "published": "2017-04-28T22:11:00.000+03:00", "crawled": "2017-04-28T17:58:19.000+03:00", "highlightTitle": ""}