{"organizations": [], "uuid": "5a96de44461e84a306b41c8db4e4584b1434cce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12910396.ece/ALTERNATES/s1200/Theresa-May-Announces-A-General-Election.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-2017-theresa-claims-12910084", "country": "GB", "domain_rank": 21960, "title": "General Election 2017: Theresa May claims it's needed because of 'division' over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "General Election 2017: Theresa May claims it's needed because of 'division' over Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-04-19T00:28:00.000+03:00", "replies_count": 0, "uuid": "5a96de44461e84a306b41c8db4e4584b1434cce2"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-2017-theresa-claims-12910084", "ord_in_thread": 0, "title": "General Election 2017: Theresa May claims it's needed because of 'division' over Brexit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe battle for the United Kingdom’s future begins on Wednesday as MPs vote on Prime Minister Theresa May’s plan to hold a general election on June 8. \nTory leader Mrs May stunned Westminster by announcing plans for an early election, despite previously insisting there would be no poll until 2020. \nIn a statement outside Downing Street, she said she was going to the country because of “division” over Brexit . \nBut laws passed in 2011 mean the Prime Minister no longer has the power to call a general election. \nInstead, she will present a motion to the House of Commons asking for one, which will require a two-thirds majority to be approved. \nLabour leader Jeremy Corbyn said he was ready for the fight, insisting: “I welcome the Prime Minister’s decision to give the British people the chance to vote for a government that will put the interests of the majority first.” \nThe early poll means the North East is certain to lose some sitting MPs. \nNorth West Durham MP Pat Glass confirmed she would stand down. Prime Minister Theresa May makes a statement to the nation in Downing Street (Photo: Getty Images Europe) \nAnd Tom Blenkinsop, Labour MP for Middlesbrough South and East Cleveland said he “cannot in good faith stand as the Labour candidate” because of “significant and irreconcilable differences with the current Labour leadership”. \nBlyth Valley MP Ronnie Campbell had planned to retire in 2020, but he said he was considering whether to stand again in June. Read More General Election announced RECAP: North East MPs to step down after PM calls for snap election on June 8th \nNick Brown, MP for Newcastle East, was making no announcement at this stage about whether he would stand in the election. \nLabour MPs attacked Mrs May’s decision to call an early general election after repeatedly ruling it out. \nSouth Shields Labour MP Emma Lewell-Buck said on Twitter than the Conservative government “have broken election promise after election promise, We’re in very unstable times and now May wants you to put your trust in her.” Prime Minister Theresa May makes a statement in Downing Street, London, announcing a snap general election on June 8 (Photo: PA) \nBut Mrs May, who has a fragile working majority of just 17 in the Commons, claimed an election was needed because of divisions over Brexit. \nShe accused rival parties of attempting to undermine the outcome of last year’s EU referendum, saying: “At this moment of enormous national significance there should be unity here in Westminster, but instead there is division. The country is coming together, but Westminster is not. \n“In recent weeks Labour has threatened to vote against the final agreement we reach with the European Union . The Liberal Democrats have said they want to grind the business of government to a standstill.” Read More How the General Election could land you with more holiday money \nShe added: “What they are doing jeopardises the work we must do to prepare for Brexit at home and it weakens the government’s negotiating position in Europe. \n“If we do not hold a general election now their political game-playing will continue, and the negotiations with the European Union will reach their most difficult stage in the run-up to the next scheduled election.” The Labour leader Jeremy Corbyn (Photo: Daily Mirror) \nLabour leader Jeremy Corbyn suggested the election would be about the Government’s management of public services such as schools and hospitals. \nHe said: “I welcome the Prime Minister’s decision to give the British people the chance to vote for a government that will put the interests of the majority first. Read More General Election 2017: Could Labour lose North East seats to the Tories? \n“Labour will be offering the country an effective alternative to a government that has failed to rebuild the economy, delivered falling living standards and damaging cuts to our schools and NHS. \n“In the last couple of weeks, Labour has set out policies that offer a clear and credible choice for the country. We look forward to showing how Labour will stand up for the people of Britain.” Tim Farron (Photo: PA) \nLiberal Democrat leader Tim Farron appeared to confirm that his party would focus on Brexit. \nHe said: “This election is your chance to change the direction of our country. \n“If you want to avoid a disastrous Hard Brexit. If you want to keep Britain in the Single Market. If you want a Britain that is open, tolerant and united, this is your chance. \n“Only the Liberal Democrats can prevent a Conservative majority.” \nWhile the North East is traditionally seen as a Labour heartland, Conservatives hope that recent opinion polls putting them far ahead of Labour mean they are in with a chance of winning seats such as Bishop Auckland following their by-election victory in Copeland, in the North West of England, in February. Like us on Facebook ", "external_links": [], "published": "2017-04-19T00:28:00.000+03:00", "crawled": "2017-04-19T01:50:07.000+03:00", "highlightTitle": ""}