{"organizations": [], "uuid": "ba47a4c64dc123943d9726c65157e7b912053bb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12732931.ece/ALTERNATES/s1200/Bovis-Homes-profits.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12841193", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Galliford Try abandons plans for Bovis Homes takeover", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Galliford Try abandons plans for Bovis Homes takeover", "spam_score": 0.0, "site_type": "news", "published": "2017-04-05T14:55:00.000+03:00", "replies_count": 0, "uuid": "ba47a4c64dc123943d9726c65157e7b912053bb6"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12841193", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Galliford Try abandons plans for Bovis Homes takeover", "locations": [], "entities": {"persons": [{"name": "redrow", "sentiment": "none"}, {"name": "weber", "sentiment": "none"}, {"name": "fitzgerald", "sentiment": "none"}, {"name": "galliford", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "manfred weber", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "greg fitzgerald", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "galliford", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bovis homes", "sentiment": "negative"}, {"name": "redrow", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "bovis", "sentiment": "none"}, {"name": "housebuilder galliford try", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european people’s party", "sentiment": "none"}, {"name": "ey for the london stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The FTSE-100 index opened at 7321.82. \nThe pound at 8am was 1.2437 dollars compared to 1.2435 dollars at the previous close. \nThe euro at 8am was 0.8580 pounds compared to 0.8573 pounds at the previous close. 8:10 Jonathon Manning 200,000 jobs could be at risk as Euro clearing leaves London \nThe head of the European Parliament’s biggest political bloc poured cold water on hopes euro clearing might stay in London after Brexit, putting over 200,000 jobs at risk. \nManfred Weber, chair of the European People’s Party, was outlining the group’s political priorities or “red lines” on Brexit during a press conference in Strasbourg, when he said EU citizens must “decide on their own money”. \nMr Weber said: \nThat’s about the financial markets. \nWhen Great Britain is leaving the European Union, for us it’s not thinkable that at the end the whole euro business is still managed in London. \nWhen this is an external place, this is not an EU place any more, then the euro business should be managed on EU soil. \nThe party leader did not clarify whether he was referring specifically to euro clearing, which settles business and trade conducted in euros, but Mr Weber’s comments have dampened hopes London will end up hosting the operations after Britain completes its divorce from the EU. \nAn independent report conducted by EY for the London Stock Exchange last autumn said up to 83,000 clearing jobs could be lost over the next seven years if euro-denominated clearing leaves London. \nBut those job losses would create a domino effect on other financial sectors, impacting up to 232,000 jobs across the UK, the report said. \nJohn McDonnell, Labour MP and shadow chancellor, said the job threat is “all too predictable given the Tories’ extreme approach to the Brexit negotiations”. \nHe said: \nThis is yet another major concern facing our country since Theresa May triggered Article 50, and yet Tory ministers appear stunned and unprepared when obvious issues arise. \nWe need to know immediately from the Government what its strategy is to protect jobs in the finance sector, because all we have witnessed so far is silent bewilderment. Euro, Dollar and pound sterling notes beside a UK passport (Photo: Matt Cardy/Getty Images) 8:05 KEY EVENT Galliford Try abandons plans for Bovis Homes takeover \nHousebuilder Galliford Try has given up its pursuit of under-pressure rival Bovis Homes just a week after fellow suitor Redrow walked away from the takeover tussle. \nGalliford had remained in talks with Bovis after its approach was first rejected last month, but said it had abandoned plans for a tie-up after it was unable to “secure the support of the board of Bovis on terms that represent the best interests of Galliford Try shareholders”. \nThe move leaves Bovis without any potential deals on the table, with Redrow last week saying it would not return with a higher offer after its initial proposal was also rebuffed. \nBut Bovis has put faith in new leadership to help “deliver greater value for shareholders”, separately announcing the appointment of former Galliford boss Greg Fitzgerald as its new chief executive. \nMr Fitzgerald spent more than 30 years of his career at Galliford, latterly as chief executive and chairman. Bovis Homes development (Photo: PA) Share", "external_links": [], "published": "2017-04-05T14:55:00.000+03:00", "crawled": "2017-04-05T10:21:19.933+03:00", "highlightTitle": ""}