{"organizations": [], "uuid": "10fab4af56a2aa533cb419bf53ab90d4fb0d56ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12837060.ece/ALTERNATES/s1200/BRITAIN_Brexit_155504.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-brexit-mean-increase-slavery-12836942", "country": "GB", "domain_rank": 21960, "title": "Could Brexit mean an increase in slavery and people trafficking in the North East?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Could Brexit mean an increase in slavery and people trafficking in the North East?", "spam_score": 0.0, "site_type": "news", "published": "2017-04-03T23:00:00.000+03:00", "replies_count": 0, "uuid": "10fab4af56a2aa533cb419bf53ab90d4fb0d56ab"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-brexit-mean-increase-slavery-12836942", "ord_in_thread": 0, "title": "Could Brexit mean an increase in slavery and people trafficking in the North East?", "locations": [], "entities": {"persons": [{"name": "mrs may", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nicola wake", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cris mccurley", "sentiment": "none"}, {"name": "wake", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumbria unive", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "northumbria university", "sentiment": "none"}, {"name": "ben hoare bell", "sentiment": "none"}, {"name": "north news & pictures ltd", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could Brexit mean an increase in slavery and people trafficking in the North East? Northumbria University academics have gathered to discuss the issue Share Click   IN FULL: Theresa May's statement as she triggers Article 50 Share this video   Thank you for subscribing!   \nLeaving the EU is likely to have a huge number of different consequences, good or bad, for Britain and the North East, but could one effect be an increase in people trafficking? \nAcademics at Northumbria University say it’s a risk, unless legislators are careful. \nDr Nicola Wake, associate professor of law at Northumbria University, organised a conference on Wednesday on the impact Brexit could have on the horrific crime, just as Prime Minister Theresa May triggered Article 50, beginning the process of leaving. \nAccording to the Government’s estimate, there are between 10,000 and 13,000 victims of modern day slavery in the UK today. Across Europe, 65% of victims of slavery come from other EU states. Dr Nicola Wake (Photo: (c) North News & Pictures ltd) \nDr Wake said she believed the conference was vital to raise awareness of the issues surrounding people trafficking, and to urge Government to consider how new laws introduced following Brexit will affect the vulnerable people exploited by heartless traffickers. \nShe said: “If the focus is on tighter border controls, what will it mean for victims of human trafficking? We just don’t know yet. \n“A lot of the protections are enshrined in EU law. When the Government enacts the Great Repeal Bill, it will chose which laws to repeal and remove: this could have some really major impacts on protection for victims of human trafficking.” Read More Money-grabbing people smuggling gang jailed for human trafficking of illegal immigrants \nAmong the other uncertainties are how UK police will cooperate with European law enforcement after the country leaves the union, and whether UK rhetoric around immigration could make it easier for traffickers to convince their victims not to speak out, as they could feel they will not be helped in Britain. \nDr Wake urged Mrs May, who worked on modern day slavery as Home Secretary and introduced tougher penalties for traffickers, to continue to prioritise the issue, even as other parts of the negotiations catch the headlines. \nShe said: “It’s all really quite uncertain. There’s a real risk that if trafficking victims aren’t prioritised it could make things worse.” Read More Brexit will be 'calamitous' for the North East's NHS if EU doctors leave, senior medic warns \nCris McCurley, an expert on honour-based violence, forced marriage and trafficking, and a senior partner with North East legal practice Ben Hoare Bell, also spoke at the conference. \nShe said: “Human trafficking and modern day slavery come in many guises and it is imperative that any professionals working with these issues make sure they are both fully aware of how to identify them and where to get expert help. \n“Getting it wrong can put lives at risk. This is one of the most critical challenges of our time.” Like us on Facebook", "external_links": [], "published": "2017-04-03T23:00:00.000+03:00", "crawled": "2017-04-03T18:37:17.816+03:00", "highlightTitle": ""}