{"organizations": [], "uuid": "7c018a5f4aaee4c4551f646808ccdc1dfa892330", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12863074.ece/ALTERNATES/s1200/UK-Prime-Minister-Meets-With-The-European-Council-President-Donald-Tusk.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/ready-welcome-new-normal-paying-12863162", "country": "GB", "domain_rank": 21960, "title": "Get ready to welcome the new normal: Paying to see the doctor and expulsion of foreign workers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Get ready to welcome the new normal: Paying to see the doctor and expulsion of foreign workers", "spam_score": 0.0, "site_type": "news", "published": "2017-04-08T01:00:00.000+03:00", "replies_count": 0, "uuid": "7c018a5f4aaee4c4551f646808ccdc1dfa892330"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/news/news-opinion/ready-welcome-new-normal-paying-12863162", "ord_in_thread": 0, "title": "Get ready to welcome the new normal: Paying to see the doctor and expulsion of foreign workers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion British Prime Minister, Theresa May and The Chairman of the European Union, Donald Tusk, meet inside 10 Downing Street on April 6, 2017 in London, England (Photo: Getty Images Europe) Share Get daily   Thank you for subscribing!   \nI’ve finally made it back home for the first time since the summer holidays. Our second child’s fraught arrival rooted us to Holland for half a year, but a work meeting in Manchester provided the pretext for the much-longed for return. \nIt’s also of course the first trip home since Theresa May has pushed the big red Brexit button. But with the exception of a stream of jingoist tabloid headlines from the gutter press, there’s precious little appears to have changed. \nSt James’ Park was mesmerising and it’s fascinating to see the Science City tower blocks springing up on the Newcastle Brewery site. The pint of Jarl from the Durham Brewery tasted as fresh and tasty as ever and I’m looking forward to my habitual wander along the stunning Tyneside coast. \nBut I fear this serenity is a ‘phoney war’ before the ‘shock and awe’ of Brexit is unleashed upon us. \nThere’s a Great Repeal Bill that’s heading to Parliament and it’s looking like being a Trojan Horse to unleash the wildest neoliberal fantasies of the hardest-line Tory fringe. (Photo: Dominic Lipinski/PA Wire) \nIf we have to privatise the NHS to get a trade deal with America, then we’ll be told we’re ‘taking back control’. Feeding our children with genetically-modified American meat is a patriotic liberation from Brussels’ nannying interference. \nThe Tories’ strategy was buoyed by George Osborne’s successful austerity trick with bare-faced denials of obvious unwelcome truths. Disabled people were forced to work, unemployed people were starved to death, and we were told that it was the only way to save the country’s finances. \nThe deeper Osborne cut, the more the UK bled, but no one called out the government on the terrible price of their false promises. We’ve forgotten what a peaceful life was like under Labour , and persuaded ourselves that we deserve falling pay, zero-hours contracts and the permanent stress of economic uncertainty. Read More Beware the patriotism peddled by scoundrels at home and abroad \nThat was the real success behind Osborne’s austerity trick: making us poorer and persuading us to believe that it’s all our fault. And we run the risk that this trick will be pulled on us all over again if we don’t remember what life was like before Brexit started making it bad. \nThere’s a lot of things going to happen that a decade ago would have seemed unacceptable and we’re going to be told that this is normal, that this is fine. We’re going to have our European Citizenship torn up, lose the protections that it brings, and told that we’ve been freed. \nI remember when raw sewage was pumped out into Cullercoats Bay, and we’re going to be told pretty soon that that’s all normal again. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-04-08T01:00:00.000+03:00", "crawled": "2017-04-07T21:05:27.713+03:00", "highlightTitle": ""}