{"organizations": [], "uuid": "7aa6dd4c5583146deb58741622cf3f107dbd3cbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12910396.ece/ALTERNATES/s1200/Theresa-May-Announces-A-General-Election.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12906181", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Snap election wipes £45bn off FTSE 100", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Snap election wipes £45bn off FTSE 100", "spam_score": 0.0, "site_type": "news", "published": "2017-04-19T14:55:00.000+03:00", "replies_count": 0, "uuid": "7aa6dd4c5583146deb58741622cf3f107dbd3cbf"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12906181", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Snap election wipes £45bn off FTSE 100", "locations": [], "entities": {"persons": [{"name": "ray barlow", "sentiment": "none"}, {"name": "neill winch", "sentiment": "none"}, {"name": "steve watson", "sentiment": "none"}, {"name": "dean gray", "sentiment": "none"}, {"name": "james dickson", "sentiment": "none"}, {"name": "caroline goodall", "sentiment": "none"}, {"name": "michael law", "sentiment": "none"}, {"name": "philip day", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "james bond", "sentiment": "none"}, {"name": "macandrew", "sentiment": "none"}, {"name": "douglas macandrew", "sentiment": "none"}, {"name": "wolfson", "sentiment": "none"}, {"name": "jaeger", "sentiment": "none"}, {"name": "barlow", "sentiment": "none"}, {"name": "myers", "sentiment": "none"}, {"name": "jane shields", "sentiment": "none"}, {"name": "hadrian", "sentiment": "none"}, {"name": "aspley guise", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "ian ross", "sentiment": "none"}, {"name": "john myers", "sentiment": "none"}, {"name": "jane norman", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "malcolm young", "sentiment": "none"}], "locations": [{"name": "celtic park", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "walkergate", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "yolo ponteland", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "durham city", "sentiment": "none"}, {"name": "slovakia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ponteland", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "fenwicks", "sentiment": "none"}, {"name": "plessey road", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "seaham hall", "sentiment": "none"}], "organizations": [{"name": "st james", "sentiment": "negative"}, {"name": "amgen", "sentiment": "none"}, {"name": "better capital", "sentiment": "none"}, {"name": "alixpartners", "sentiment": "none"}, {"name": "hutter jennings & titchmarch", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "newlands", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "mercedes", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "austin reed", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "hjt", "sentiment": "none"}, {"name": "danieli holdings", "sentiment": "none"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "edinburgh woollen mill", "sentiment": "none"}, {"name": "vianet group plc", "sentiment": "none"}, {"name": "bradford & bingley", "sentiment": "none"}, {"name": "safc", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "rt james & partners", "sentiment": "none"}, {"name": "whs tripp & partners", "sentiment": "none"}, {"name": "burberry  luxury fashion house burberry", "sentiment": "none"}, {"name": "burberry", "sentiment": "none"}, {"name": "smith electric vehicles", "sentiment": "none"}, {"name": "williams & glyn", "sentiment": "none"}, {"name": "bank holidays", "sentiment": "none"}, {"name": "aeromobil", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "mclaren", "sentiment": "none"}, {"name": "royal mail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Man behind regional landmarks Metrocentre and St James' Park retires \nThe engineer responsible for some of the region’s recent major landmarks - including the Metrocentre and St James’ Park - is about to retire after almost half a century in the construction industry. \nJohn Myers of 3e engineering consultants started work in June 1968 when there were no computers, faxes, emails, photocopiers or mobile phones, relying upon the technology of the day – drawing boards, pens and pencils, slide rules and the Royal Mail postal service – to carry out his work. \nAfter going into work straight from school, at WHS Tripp & Partners on £4 10 shillings per week as a technician, he progressed to RT James & Partners in 1975 before a major career breakthrough on joining Hutter Jennings & Titchmarch in 1978, later to be branded as HJT, where he progressed up to partner level. \nHis major achievements include leading major projects including the Metrocentre, from start to finish, and a number of stadia developments including Newcastle United’s St James’ Park ground, SAFC’s Stadium of Light and Celtic Park in Glasgow. \nWhile at HJT he was head of teams which delivered the mixed use development at Walkergate, Durham City, the Debenhams extension to the Metrocentre, the Citygate development in Newcastle and The Seaham Hall and Spa refurbishment. \nMr Myers launched 3e with three former colleagues at HJT, setting up a Newcastle office in 2004, and he now hands the reins to directors Steve Watson and Dean Gray. Despite retiring, he will remain as a consultant to 3e. John Myers and the Metrocentre 9:05 Next boss's total pay packet plummets by over 55% \nThe boss of Next has seen his total pay packet plummet by more than 55% after tough trading on the high street pushed the retailer to its first fall in annual profits for eight years. \nChief executive Lord Wolfson saw his total remuneration drop to £1.8m for 2016/17, down from £4.3m for the year before, as the high street bellwether’s lacklustre performance left executives with no annual bonus and a significant cut to their long-term share awards. \nIn the retailer’s annual report, the remuneration committee said it had also cut planned pay rises for the Next board after the firm eked out lower-than-expected profits and earnings per share. \nExecutive directors Michael Law and Jane Shields were both in line for a 15% annual salary increase to £475,000, but instead were handed a 1% rise to £416,200 for 2016. \nThe move comes as Next unveiled a new remuneration policy for the three years to 2020, which will face a binding shareholder vote at the firm’s annual general meeting (AGM) on May 18 this year. \nCaroline Goodall, chairman of the remuneration committee, said: \nAs outlined in our strategic report it has been a challenging year for Next and the remuneration outcomes for the directors have reflected this. \nTotal annual remuneration earned by our executive directors for the financial year 2016/17 was significantly less than that earned for the financial year 2015/16. “In the view of the remuneration committee, this is appropriate and aligns the remuneration received by management with the experience of shareholders. \nNext posted a 3.8% fall in underlying pre-tax profits to £790.2m for the year to January - the first fall in profits since 2008/09 at the height of the financial crisis. \nThe retailer confirmed in March that it had hiked prices by 4% on average for the first half of the year and warned prices would remain under pressure in the second half from rising buying costs caused by the Brexit-hit pound. Lord Wolfson of Aspley Guise, Chief Executive of Next 9:00 KEY EVENT Vianet Group to announce increased profits \nBusiness data company Vianet Group Plc said it is on track to reveal year-on-year profit growth for the 2016/17 financial year. \nIn a trading update the firm said performance over the second half of the year has continued to improve. \nChairman James Dickson said: \nThe group expects to again deliver year-on-year profit growth. \nImportantly, there has been overall progress across the core businesses where focus on our exciting medium to long term prospects, particularly for telemetry and payment solutions for the coffee vending market is gaining momentum. \nThe Stockton-based firm’s results for the year ending March 31 2017 will be released on June 6 2017. James Dickson of Stockton-based Vianet 8:50 Weak pound causes 'exceptional' sales at Burberry \nLuxury fashion house Burberry has cheered ongoing “exceptional” trading in the UK as it continues to receive a boost from the Brexit-hit pound. \nThe group, famous for its trench coats and check scarves, saw global comparable store sales lift 2% in its final quarter to March 31, while total retail revenues over the second half jumped 19% to £1.3bn thanks to the weakness of sterling since the Brexit vote. \nThe UK was once again its star performer for sales thanks to booming tourist trade as shoppers from the US and Asia have flocked to Britain to take advantage of the plunging pound to snap up luxury goods at a knock-down price. \nIt said a “continued exceptional” showing from the UK led double-digit sales growth across the Europe, Middle East, India and Africa region, adding that it saw strong demand from both tourists and domestic customers. \nA robust quarter in China, where sales rose by a “high single digit percentage”, also helped offset a tougher quarter in Hong Kong and the United States, where sales slid. \nThe fourth quarter comparable sales rise marks a slight slowdown on the 3% reported in the previous three months, but left overall growth at 3% in the final six months of its year. \nBurberry said its second-half sales were buoyed by a strong customer response to its February runway collection and demand for leather goods. A Burberry store KEY EVENT e-Therapeutics makes £16.3m loss as business \"refocuses\" \nGateshead pharmaceutical company e-Therapeutics made a £16.3m operating loss last year as the business refocuses on key drug discovery projects. \nOperating losses for the year ending January 31 2017 soared 41%, up from £11.6m during the previous year. \nHowever, the year was one for major change for the business, which refocused its drug discovery business after it halved its drug discovery projects from 12 to six. \nChairman Ian Ross said: \nThe business has changed fundamentally in the past 12 months. \nWe are now focusing on our core strengths around our unique drug discovery platform and the discovery of novel preclinical drugs. \nThe priority has been to ensure we have the right infrastructure, skills and capabilities in place to execute our business strategy. We approach the coming year with increasing optimism. \nThe company also its cash and deposits reduced from £24.8m to £14m. However the firm did increase its R&D spend by 24% to £3.1m, and its discovery spend by 73% to £7.6m. \ne-Therapeutics also recently brought in Amgen’s Ray Barlow as its new CEO after Malcolm Young stepped down from the role. \nMr Barlow said: \nAt the start of my tenure as CEO, I inherit a refocused and reenergised business. \nMy near-term aim is to ensure that our resources are appropriately focused on activities that are of the greatest commercial potential to support our ambition of creating value for our shareholders. \nAs part of this process, I will be engaging with our key stakeholders as well as subsequently positioning and promoting the Company to commercial partners. Professor Malcolm Young stepped down as CEO of e-therapeutics last year 8:37 Yolo in Ponteland is expanded after owners invest in mezzanine makeover \nNorth East leisure operator Danieli Holdings has invested £80,000 into its popular yolo bar in Ponteland as it prepares to bring the brand to Newcastle city centre. \nThe firm, which is also spearheading a drive to bring Hadrian’s Tipi back to the central station area, is pumping funds into expanding the venue following high demand for private parties and functions. \nThe work includes extending the mezzanine level which will also get its own bar, taking the floor’s capacity up to 50. \nMeanwhile downstairs, the main bar has been extended with a section for draft and bottle service only to speed up customer flow and reduce queuing during busy periods on weekends and Bank Holidays. There are also more VIP booths for hire, the interior has been tweaked and a pizza oven has been installed in the kitchen. \nAs part of the changes, the outdoor terrace has secured a later license, hosting guests all day until 10.30pm. \nDanieli Holdings chief executive Neill Winch said: \nWe have been overwhelmed by the success of yolo Ponteland and to meet demand have invested a significant sum to build on the private hire and functions arm of the business, as well as further enhancements aimed to make customers’ dining and drinking experiences even more enjoyable. \nThere is more to choose from than ever before on our food and drinks menus, including sharing options and cocktail experiences for group bookings. Following the relaunch of our Ponteland venue, we are gearing up for the grand unveiling of its sister site in Newcastle city centre and can’t wait for the big reveal. The ground floor of yolo Ponteland (Photo: maxcooperphotography) 8:27 More than 200 jobs to be aced at Jaeger as stores begin to close \nMore than 200 jobs at Jaeger are to be axed as administrators to the stricken fashion chain begin the process of closing twenty stores. \nLast week AlixPartners was appointed to oversee the administration process following failed attempts by the company’s private equity owner, Better Capital, to sell the struggling retailer. \nOn Tuesday AlixPartners said that it has earmarked twenty “financially unviable” stores to close down, employing a total of 165 people. \nThe firm said: \nFollowing consultation with all appropriate stakeholders it has become apparent that the operating costs of a number of stores are financially unviable given the company’s difficulties. \nAs a result, the joint administrators have made the difficult but necessary decision to commence a programme of store closures. We can confirm that all employees at these stores will be paid for the duration of the process. \nIn addition to the store closures, 44 people will be made redundant at Jaeger’s head office and distribution function, impacting 32 and 12 staff respectively. \nJaeger has two concessions in Fenwicks and John Lewis, in Newcastle. These branches have yet to be affected. \nPrior to its collapse, Jaeger employed 680 staff across 46 stores, 63 concessions, its London head office and a logistics centre. \nBetter Capital has sold Jaeger’s debt to a company understood to be controlled by the retail billionaire Philip Day, who heads up Edinburgh Woollen Mill. \nInsiders expect all of Jaeger’s stores to eventually close down, although the brand is likely to survive as part of the Edinburgh Woollen Mill stable, which also includes Jane Norman, Peacocks and Austin Reed. \nGift cards continue to be honoured at Jaeger stores, AlixPartners added. Jaeger 8:20 Flying car takes to the air thanks to leading North East engineer \nIt might sound something from a James Bond film, or even the ultimate solution for harassed motorists stuck in a traffic jam: a sports car that sprouts wings and can convert into a plane. \nBut the AeroMobil, a two-seater car that also functions as a fully working plane, will be launched this week, thanks in part to an engineer from Northumberland who helped get the idea off the ground. \nThe vehicle, which will take the stage at the Top Marques Show in Monaco on Thursday, has been developed by a company in Slovakia, but its chief technical officer is Blyth-born Douglas MacAndrew, who until recently worked for a company in the North East. \nThe AeroMobil is expected to hit the market within the next three years but drivers will be able to buy it before then, provided they can meet its price tag of “several hundred thousand Euro”. \nThe launch of the car marks the end of nearly two years of work for Mr MacAndrew, who was brought in to help create the futuristic vehicle after a successful career working as an engineer at Jaguar Land Rover, BMW, Mercedes, McLaren, and most recently Washington’s Smith Electric Vehicles. \nCommenting on how he became involved in the AeroMobil project Mr MacAndrew, a former pupil of Plessey Road and Newlands schools in Blyth, said: \nMy ex-boss at McLaren contacted me and asked me to take a look at the business and the product, convincing me that he believed in the approach and direction taken to date. \nI visited Slovakia and spent time with the team and the product, looking, as you expect, for the reasons why it wasn’t possible. I am an engineer after all and we are always looking for the holes and not appreciating the donuts. \nI couldn’t find the reasons that would prevent a product of this sort being commercialised and I believe that the product we are now showing in Monaco on the 20th, its world premier, is a demonstration of its credibility as a means of providing users with operational flexibility and freedom of movement. The AeroMobil was flown in 2015 during a test flight (Photo: AeroMobil) 8:15 KEY EVENT Government willing to sell stake in RBS at a loss, says Chancellor \nPhilip Hammond has admitted that the Government is prepared to sell its stake in Royal Bank of Scotland (RBS) at a loss to the public purse. \nThe Government bought its 72% stake in the bank for £45bn in 2008, at £5.02 a share, as part of a bailout at the height of the financial crisis. \nBut shares in the troubled lender are now trading at less than half that price at £2.23. \nThe Chancellor said on Tuesday: \nThe Government is not at present actively marketing its stake in RBS. \nOur policy remains to return the bank to private hands as soon as we can achieve fair value for the shares, recognising that fair value could well be below what the previous government paid for them. \nWe have to live in the real world and make decisions on the future of our holding in RBS in the best interests of taxpayers. \nIt is understood that only once RBS’ legacy issues - such as fines in the US and state aid obligations - are dealt with, will the Government begin selling down the taxpayers’ stake. \nIn February, RBS racked up its ninth consecutive year of annual losses, ending 2016 £7bn in the red and announcing a major cost-cutting drive expected to result in large-scale job losses. \nIn addition, the European Commission has launched an in-depth probe into Government proposals which aim to spare RBS from being forced to sell off the Williams & Glyn branch network. \nMr Hammond has previously said the Government does not expect to offload its 72% stake in RBS until after 2020. \nHe added: \nWe are making real progress in realising our holdings in the banking sector. We continue the programme sale of our shareholding in Lloyds, which is now down from 43% to less than 2%, and just last month we sold £12bn worth of Bradford & Bingley mortgages in a highly competitive process. Philip Hammond (Photo: Parliamentlive.tv)", "external_links": [], "published": "2017-04-19T14:55:00.000+03:00", "crawled": "2017-04-19T18:50:55.000+03:00", "highlightTitle": ""}