{"organizations": [], "uuid": "751b2ddfaae33f746ccd5ec08436590d1858449d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.plymouthherald.co.uk/images/localworld/ugc-images/276351/Article/images/30266121/15952554.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/flybe-boss-fears-brexit-may-put-travellers-off-flying/story-30266121-detail/story.html", "country": "US", "title": "Flybe boss fears Brexit may put travellers off flying | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Flybe boss fears Brexit may put travellers off flying | Devon Live", "spam_score": 0.69, "site_type": "news", "published": "2017-04-12T19:32:00.000+03:00", "replies_count": 0, "uuid": "751b2ddfaae33f746ccd5ec08436590d1858449d"}, "author": "William Telford", "url": "http://www.devonlive.com/flybe-boss-fears-brexit-may-put-travellers-off-flying/story-30266121-detail/story.html", "ord_in_thread": 0, "title": "Flybe boss fears Brexit may put travellers off flying | Devon Live", "locations": [], "entities": {"persons": [{"name": "willi", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ourmieres-widener", "sentiment": "none"}, {"name": "christine ourmieres-widener", "sentiment": "none"}], "locations": [{"name": "telford", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Flybe boss fears Brexit may put travellers off flying By WT_Herald | Posted: April 12, 2017 By WILLIAM TELFORD, Business Editor, @WTelfordHerald 3 COMMENTS SHARES TAKING FLIGHT: Could Brexit reduce passenger numbers? Flybe boss fears Brexit may put travellers off flying X \nCopy link to paste in your message / Comments (3) \nThe new boss of Devon airline Flybe has warned that Brexit could reduce passenger numbers and urged the Government to strike a deal that protects companies. \nBut Christine Ourmieres-Widener, chief executive of the Exeter-based firm, said she is optimistic PM Theresa May will act in airlines' best interests. \nAcross the industry there are fears any departure from the European Single Aviation Market will seriously wound UK airlines and could lead to some services being scrapped. \nBut Ms Ourmieres-Widener said Flybe would be less exposed in this scenario because its intra-European flights are limited. \nThe former CityJet head said: \"For Flybe, compared to other players, the impact is a bit different because we don't have a business model with intra-European routes using Europe as an open market. \n\"So it's a very limited impact on our capacity to fly the routes we are flying today. \nREAD NEXT: Fears Brexit could affect air travel and Plymouth tourism \n\"For us the most important impact is about the customer experience, we think it would be difficult to see any change in the customer experience when you talk about customs and frontiers. \n\"Security is always on our agenda but at the same time if the customer experience is becoming more difficult it could have an impact on the willingness of our customers to fly.\" \nShe said there could be problems if the Government walked away without a deal at the end of its negotiations with the EU. \n\"It would be difficult for any airline, the airline industry is an open market, very competitive,\" she said. \"I don't believe for one moment the Government would do anything that is negative for the consumers \n\"Maybe we are optimistic and some of our colleagues are very pessimistic. \n\"We are trying to talk to different MPs to explain to them how important this experience is, I think most of the MPs we are talking to understand that we have to do everything we can to not see any difficulty for travellers in the future.\" \nFlybe, Europe's largest regional carrier, has 85 per cent of its business booked in the UK, so most of its revenue in sterling. \nBut most of its costs are in dollars, the currency used by airlines, and so it is exposed to the effects of the pound's weakness. \n\"We are a small company compared to the other legacy carriers so we are doing everything to try to predict and hedge at the right level,\" Ms Ourmieres-Widener said. \n\"It's about making sure you can mitigate any risk and have a level of predictability in the risk. \nIn March 2017, Flybe's trading statement highlighted pressures caused by the weak pound and weak consumer demand. \nMs Ourmieres-Widener said Flybe operated in a \"challenging market.\" \nAnd she added: \"On most of the routes in the UK we are competing against the train, so our proposition is much stronger because we are faster than the train, but you need to be competitive on price so you need to keep your costs low to be able to offer a competitive price to the customer. \n\"On routes to Ireland or Europe it's finding the right positioning and price for the customer.\" \nShe said the company had embarked on a review and added: \"This study has been done, now the question is between the study and how we want to deploy that in the next two or three years, what do we do and which fleet. \n\"It's not only the number of the destinations, it's about the frequency, the best flights to optimise what we fly today. \n\"It's not about big changes, it's about really significant optimisation.\" ", "external_links": [], "published": "2017-04-12T19:32:00.000+03:00", "crawled": "2017-04-12T20:52:40.731+03:00", "highlightTitle": ""}