{"organizations": [], "uuid": "d54f8aa6dc79ed2b88c52dc88fe65abf6f486426", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12909422.ece/ALTERNATES/s1200/Home-grown-produce-figures.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/farming/farming-groups-say-rural-economy-12909300", "country": "IE", "domain_rank": 21960, "title": "Farming groups say rural economy must not be forgotten in the General Election - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Farming groups say rural economy must not be forgotten in the General Election - Chronicle Live", "spam_score": 0.039, "site_type": "news", "published": "2017-04-18T22:32:00.000+03:00", "replies_count": 0, "uuid": "d54f8aa6dc79ed2b88c52dc88fe65abf6f486426"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farming-groups-say-rural-economy-12909300", "ord_in_thread": 0, "title": "Farming groups say rural economy must not be forgotten in the General Election - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "helen wooley", "sentiment": "none"}, {"name": "meurig raymond", "sentiment": "none"}, {"name": "zoe davies", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "cla", "sentiment": "negative"}, {"name": "general election nfu", "sentiment": "negative"}, {"name": "nfu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "national pig association", "sentiment": "none"}, {"name": "country land association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farming groups say rural economy must not be forgotten in the General Election NFU and CLA set out their stall to ensure farming interests are represented in the election campaign Share A combine harvester making it's way along a field of wheat (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFarming organisations and other groups in the rural economy have called on candidates in June’s snap General Election not to forget the countryside. \nThe surprise election announcement was broadly welcomed as a chance to keep rural and farming concerns at the centre of the Brexit debate. \nAmong those speaking shortly after Prime Minister Theresa May’ s surprise announcement was NFU president Meurig Raymond. \nHe said: “With farming arguably the sector most impacted by Brexit, NFU members will want to understand how each of the political parties plans to support profitable, productive and progressive agriculture and horticulture in the future. \n“The right post-Brexit trade deal is absolutely critical but equally well so is a new wider policy framework that better delivers for farming and the nation. \n“Throughout the next seven weeks the NFU will ensure that all parties fully understand and engage with the food and farming community on the issues facing the sector both now and post-Brexit . British farms currently grow the raw ingredients for the UK food and drink manufacturing sector worth £108bn and moreover the public want to continue to buy British food. \n“For that to happen it’s vital that candidates recognise the enormous contribution that agriculture makes - for every £1 invested, farming delivers £7.40 back to this country – and to back British farming.” \nHelen Wooley, director general of the Country Land Association (CLA), said: “In light of the Prime Minister’s decision to call a General Election we welcome the opportunity to get out and engage with candidates about the future of the countryside and ensure the rural voice is heard. \n“The CLA will work throughout the campaign to ensure MPs understand that the future of the rural economy must be a national priority through Brexit and beyond.” \nAnd National Pig Association chief executive Zoe Davies said her association would use the weeks in the election campaign to highlight the sector’s needs. \nBusiness groups in the North East welcome move for snap General Election \nShe said: “We will call for all parties to ensure their manifestoes deliver a fair deal for the pig industry from the Brexit negotiations. \n“Our top three priorities are free access to the Single Market, measures to protect UK producers and consumers from cheaper, lower standard imports, including insisting on equivalence of standards, and measures to ensure continued access to EU labour. \n“We also want to see a fair and balanced regulatory regime that protects our standards on the global market but removes the unnecessary Brussels-imposed burdens, and policies that ensure we protect our borders from animal disease wherever it originates from. \n“Across the range of policies that affect pig farmers, Brexit- and non-Brexit-related, we will bang the drum for our members.” Like us on Facebook ", "external_links": [], "published": "2017-04-18T22:32:00.000+03:00", "crawled": "2017-04-19T08:51:00.000+03:00", "highlightTitle": ""}