{"organizations": [], "uuid": "9f1903a6ec604b6c6ddee432cb90a7d26dab37f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12804140.ece/ALTERNATES/s1200/BRITAIN_Bexit_162747.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/article-50-joy-fear-westminster-12828036", "country": "GB", "domain_rank": 21960, "title": "Article 50: Joy and fear at Westminster as MPs remain divided over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Article 50: Joy and fear at Westminster as MPs remain divided over Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-04-02T15:00:00.000+03:00", "replies_count": 0, "uuid": "9f1903a6ec604b6c6ddee432cb90a7d26dab37f7"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/article-50-joy-fear-westminster-12828036", "ord_in_thread": 0, "title": "Article 50: Joy and fear at Westminster as MPs remain divided over Brexit", "locations": [], "entities": {"persons": [{"name": "mrs may", "sentiment": "none"}, {"name": "tyne north", "sentiment": "none"}, {"name": "andrew neil", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "mrs mckinnell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexiteers", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "tim barrow", "sentiment": "none"}, {"name": "brexit bill", "sentiment": "none"}, {"name": "peter bone", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "parliament", "sentiment": "negative"}, {"name": "brexit eu", "sentiment": "negative"}, {"name": "european council", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EU and Union Flags fly outside Parliament (Photo: AP Photo/Kirsty Wigglesworth) Share Get daily     \nBrexit began this week, but MPs are still deeply divided about it. \nTheresa May spoke in the House of Commons on Wednesday to confirm that her letter triggering Article 50 of the Treaty on European Union had been delivered. \nShe said: “In accordance with the wishes of the British people, the United Kingdom is leaving the European Union.” \nAnd the announcement was greeted with joy by Brexiteers. \nSome of them have been fighting to take the UK out of the European Union for years - or decades. \nAnd they’ve frequently been ridiculed and attacked as bigots, racists or worse. \nConservative MP Peter Bone is one. Responding to the Prime Minister’s announcement, he told her: “Some Government Members and some Opposition Members have worked throughout their political career to extract the United Kingdom from the European superstate. Prime Minister Theresa May during an interview with Andrew Neil on BBC1 \n“Sometimes we were isolated, sometimes we were ignored, and sometimes we were insulted, but thanks to the British people, today we are leaving the European Union.” \nBut other MPs are downcast, and worry that regions like the North East, where exports are particularly important for jobs, are going to suffer. \nThey include Catherine McKinnell , MP for Newcastle upon Tyne North and one of the Labour MPs who voted against the Government’s Brexit Bill in February. \nShe responded to Mrs May’s announcement by saying: “Leaving the EU will have a significant impact on the North East and our economy for decades to come – and yet we still have no idea how, or even if, the Government intends to properly engage with the region to ensure our interests are secured as part of these negotiations. \n“The Government has promised that the trade deal they want to reach will deliver ‘the exact same benefits’ we currently enjoy, and this is critical for the North East given that almost 60% of our exports currently go to the EU.” Britain's permanent representative to the European Union Tim Barrow, left, hand delivers British Prime Minister Theresa May's Brexit letter in notice of the UK's intention to leave the bloc under Article 50 of the EU's Lisbon Treaty to EU Council President Donald Tusk, in Brussels, Belgium, Wednesday, March 29, 2017 (Photo: REUTERS POOL) \nLike many opposition MPs, Mrs McKinnell was unhappy that the Prime Minister’s letter to European Council President Donald Tusk said the UK wants “to agree a deep and special partnership between the UK and the EU, taking in both economic and security cooperation”. \nSome MPs and commentators think this amounts to a threat to stop working with the EU on security issues unless it offers the UK a good trade deal. \nMrs May, of course, insists that the UK is going to get a trade agreement, so this isn’t really an issue. Read More Will Newcastle United's recruitment be affected by Brexit? New calls for football to be 'exempt' \nThe Article 50 announcement wasn’t the only important bit of Brexit business at Westminster. \nDavid Davis, the Secretary of State for Exiting the European Union, launched a consultation on what the Government calls the “Great Repeal Bill” on Thursday. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-04-02T15:00:00.000+03:00", "crawled": "2017-04-02T10:28:56.480+03:00", "highlightTitle": ""}