{"organizations": [], "uuid": "836cbe40923a423137b3da6bfcf31b9202637e2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30298579/15976800.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/tories-parachute-in-exeter-election-hopefuls-as-hq-says-exeter-is-do-able/story-30298579-detail/story.html", "country": "GB", "title": "Tories 'parachute' in Exeter election hopefuls for selection...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Tories 'parachute' in Exeter election hopefuls for selection...", "spam_score": 0.0, "site_type": "news", "published": "2017-04-28T17:36:00.000+03:00", "replies_count": 0, "uuid": "836cbe40923a423137b3da6bfcf31b9202637e2c"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/tories-parachute-in-exeter-election-hopefuls-as-hq-says-exeter-is-do-able/story-30298579-detail/story.html", "ord_in_thread": 0, "title": "Tories 'parachute' in Exeter election hopefuls for selection...", "locations": [], "entities": {"persons": [{"name": "ed miliband", "sentiment": "none"}, {"name": "douglas hellier laing", "sentiment": "none"}, {"name": "dom morris", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "anne jobson", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "cllr hellier laing", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "mel stride", "sentiment": "none"}, {"name": "john harvey", "sentiment": "none"}, {"name": "harvey", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "devon news", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "freemasons hall", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "central devon", "sentiment": "none"}, {"name": "gandy street", "sentiment": "none"}], "organizations": [{"name": "masonic lodge", "sentiment": "none"}, {"name": "parliamentary candidate", "sentiment": "none"}, {"name": "association", "sentiment": "none"}, {"name": "exeter conservative association", "sentiment": "none"}, {"name": "raf", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "teignbridge district council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tories 'parachute' in Exeter election hopefuls for selection meeting at Masonic Hall By WMN_PGoodwin | Posted: April 28, 2017 3 COMMENTS SHARES John 'Mr Exeter' Harvey will not be on the Tory shortlist at the hustings next week Tories 'parachute' in Exeter election hopefuls for selection meeting at Masonic... X \nCopy link to paste in your message / Comments (3) \nLeading Conservatives are set to \"parachute\" in potential candidates to challenge Devon's only Labour MP after senior figures decided that \"Exeter is doable\" at the general Election. \nBen Bradshaw held his seat in 2015 with an increased majority of 7,000 despite a poor performance nationally for the party under Ed Miliband. \nSenior figures at central office believe the combination of Brexit and a divided Labour party make the university city a winnable target. \nHowever, local members have been caught out by the snap election which has come to soon to include a local Tory hopeful, John Harvey, a retired city centre manager who bills himself as \"Mr Exeter\". \nThe national party has decreed that two of the three candidates will be outsiders with one local candidate coming from the city. \nExeter's Conservative association will name the official candidate after a selection meeting behind closed doors on May 6 at the city's Freemasons Hall. \nThe Hall - a Grade I listed building in Gandy Street which dates back to the 14th century and is advertised for hire - was chosen as other venues were unavailable at short notice and selection meetings are always held in private, the party says. \nThe Tory frontrunner will have just a month to get a campaign up and running against Mr Bradshaw, a seasoned veteran of 20 years with a formidable local operation backed by a powerful Labour city council. \nTheir has been criticism for overlooking Mr Harvey in drawing up the shortlist of three. \nIt is claimed the former city councillor had simply not registered with the national party for vetting and approval and therefore could not be processed in time. \nThe beaten Tory candidate in the 2015 General Election – former RAF pilot Dom Morris – has also been overlooked despite telling Devon live he had \"thrown his hat into the ring\". \nDouglas Hellier Laing, a Conservative member of neighbouring Teignbridge district council's ruling executive, said Harvey's record and local popularity made him the best hope of unseating Bradshaw, a former cabinet minister. \nCllr Hellier Laing said he texted Central Devon MP Mel Stride on Wednesday evening, calling for him to intervene on behalf of Harvey. \n\"I had a chat with John last night in the Terrace restaurant and he said he would 'dearly have loved a crack' at the election,\" he added. \n\"Me replied to say he 'didn't have the ability' though he said 'Exeter is do-able this time, I think.' \nRead more : What really happens inside a Masonic Lodge? \n\"Ben Bradshaw has done a good job for Exeter – that's saying something coming from a Conservative – but this is a once in a lifetime opportunity. \n\"Someone universally known as Mr Exeter with support from a wide range of the public, regardless of politics, should have been at least shortlisted.\" \nCllr Hellier Laing said other senior people, with connections at central office, have said they are not in the position to influence the decision. \n\"I am sure all the candidates will be worthwhile – we need the best candidate regardless of whether they are local or not. \n\"I would never push for a local person who doesn't have the qualities – it is just too short notice for John because other candidates are already lined up.\" \nThe Conservatives say party rules mean all shortlists are agreed nationally, in consultation with several people. \nIn the case of Exeter, the list this time just happened to contain one local and two outside candidates, the party said. \nAnne Jobson, Association Chairman, said: \"As Chairman of the Exeter Conservative Association and a former Parliamentary Candidate for Exeter, I am delighted that it will be the Members of the Exeter Conservative Association who will be responsible for selecting the 2017 Parliamentary Candidate. \n\"We have a talented shortlist from which to choose and our Members will make a thoughtful and careful decision following a rigorous interview process. \n\"I can understand why there is such enthusiasm to get behind the selected candidate to help ensure that Jeremy Corbyn does not get the keys to No 10. If we want a strong and stable government then we need a Conservative win in Exeter and I am sure that from our shortlist the candidate to achieve that victory will emerge.\" DEVON NEWS ", "external_links": [], "published": "2017-04-28T17:36:00.000+03:00", "crawled": "2017-04-28T13:11:51.000+03:00", "highlightTitle": ""}