{"organizations": [], "uuid": "13cf4da5925890c1646d9aca03d8926fa66dad97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12557421.ece/ALTERNATES/s1200/Ronnie-Campbell-recovering-from-major-cancer-surgery.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ronnie-campbell-votes-against-early-12915650", "country": "GB", "domain_rank": 21960, "title": "Ronnie Campbell votes against early General Election - but makes his own U-turn to stand again", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Ronnie Campbell votes against early General Election - but makes his own U-turn to stand again", "spam_score": 0.0, "site_type": "news", "published": "2017-04-20T01:00:00.000+03:00", "replies_count": 0, "uuid": "13cf4da5925890c1646d9aca03d8926fa66dad97"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ronnie-campbell-votes-against-early-12915650", "ord_in_thread": 0, "title": "Ronnie Campbell votes against early General Election - but makes his own U-turn to stand again", "locations": [], "entities": {"persons": [{"name": "ronnie campbell", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "campbell", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "national health service", "sentiment": "none"}, {"name": "blyth valley constituency", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour government", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "nec", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "national executive committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJust one North East MP voted against Theresa May’s decision to hold an early General Election on June 8. \nThe overwhelming majority of MPs backed plans to go to the polls - which means the election will go ahead . \nBlyth Valley MP Ronnie Campbell was one of 13 MPs from across the country who voted to oppose the early election. \nBut he confirmed that he would stand in it. \nMr Campbell, aged 73 and recovering from stomach cancer, had been expected to stand down in 2020, when the next election was due, but Prime Minister Mrs May’s decision to hold an early poll means he will stand again. Ronnie Campbell MP (Photo: Newcastle Chronicle) \nHe said: “It was my intention to stand down at the next General Election, however due to circumstances following the announcement of the snap election I have decided to stand again for Blyth Valley. \n“I have to inform the National Executive Committee (NEC), chief administrative body of the Labour Party, by Thursday of my decision. \n“If my decision was to stand down, the NEC would draw up a short list and they would pick the candidate for Blyth Valley, meaning that there would be no selection process for Blyth Valley Constituency. \n“Therefore, it was on that basis that I have decided to stand for election.” \nLocal party members usually have a major role in choosing Labour candidates , but Mrs May’s decision to hold a snap election at short notice means that the NEC would have made the decision instead, if Mr Campbell had chosen to quit. \nThe Prime Minister got the support of 522 MPs when she presented a motion to the House of Commons calling for an early election. \nMost Labour MPs, including party leader Jeremy Corbyn , voted to back the idea. \nUnder the Fixed Term Parliament Act, she needed the support of 434 MPs, two thirds of all seats in the House of Commons, for the election to go ahead. Prime Minister Theresa May makes a statement to the nation in Downing Street (Photo: Getty Images Europe) \nMrs May said the poll was an opportunity to secure “strong and stable leadership” for Britain as it forges a new position outside the European Union - while Mr Corbyn said voters should take the chance to make their judgment on the Conservative record on austerity and public service cuts. Read More When does postal voting open? All you need to know for General Election 2017 \nTelling MPs it was time to “put our fate in the hands of the people and let the people decide”, Mrs May told the House of Commons: “We are determined to bring stability to the United Kingdom for the long term and that’s what this election will be about - leadership and stability. \n“The decision facing the country will be clear. I will be campaigning for strong and stable leadership in the national interest with me as Prime Minister and I will be asking for the public’s support to continue to deliver my plan for a stronger Britain, to lead the country for the next five years and to give the certainty and stability that we need.” \nA large majority for the Tories would strengthen the Government’s hand in negotiating a good Brexit deal and provide “strong and stable leadership in the national interest”, she said. Labour party leader Jeremy Corbyn (Photo: Getty Images Europe) \nBut Mr Corbyn dismissed her argument that she needs a fresh mandate to deliver Brexit, and said it was “extremely interesting” that she had chosen to call an election as the Crown Prosecution Service prepares to decide whether to press charges against a string of Tory MPs over allegations relating to 2015 general election expenses. Read More How do I vote in the General Election 2017? Our guide to casting your ballot \nHe said Mrs May’s U-turn on her previous insistence that she would not call a snap election showed she could not be trusted. \nAnd he told MPs: “We welcome the opportunity of a General Election because it gives the British people the chance to vote for a Labour Government that will put the interests of the majority first. \n“The Prime Minister talks about a strong economy, but the truth is most people are worse off then they were when the Conservatives came to power seven years ago. The election gives the British people the chance to change direction. \n“This election is about her Government’s failure to rebuild the economy and living standards for the majority. \n“It is about the crisis her Government has plunged our National Health Service into, the cuts to our children’s schools which will limit the chances of every child in Britain, four million of whom now live in poverty.” Like us on Facebook ", "external_links": [], "published": "2017-04-20T01:00:00.000+03:00", "crawled": "2017-04-19T20:36:36.000+03:00", "highlightTitle": ""}