{"organizations": [], "uuid": "ea6efcb3e6af7006509ac4cf34b587404ceba661", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12894946.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/fewer-people-attending-easter-services-12894767", "country": "GB", "domain_rank": 21960, "title": "Fewer people are attending Easter services but our church leaders have a message of hope", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Fewer people are attending Easter services but our church leaders have a message of hope", "spam_score": 0.0, "site_type": "news", "published": "2017-04-16T01:00:00.000+03:00", "replies_count": 0, "uuid": "ea6efcb3e6af7006509ac4cf34b587404ceba661"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/fewer-people-attending-easter-services-12894767", "ord_in_thread": 0, "title": "Fewer people are attending Easter services but our church leaders have a message of hope", "locations": [], "entities": {"persons": [{"name": "christ", "sentiment": "none"}, {"name": "keith blundy", "sentiment": "none"}, {"name": "mark bryant", "sentiment": "none"}, {"name": "joseph", "sentiment": "none"}, {"name": "salisbury", "sentiment": "none"}, {"name": "keith palmer", "sentiment": "none"}, {"name": "jesus", "sentiment": "none"}, {"name": "mary magdalene", "sentiment": "none"}, {"name": "kirsty kew", "sentiment": "none"}, {"name": "nicodemus", "sentiment": "none"}, {"name": "christine hardman", "sentiment": "none"}, {"name": "son of god", "sentiment": "none"}, {"name": "jarrow", "sentiment": "none"}, {"name": "paul butler", "sentiment": "none"}, {"name": "rev paul butler", "sentiment": "none"}, {"name": "bradley lowery", "sentiment": "none"}, {"name": "jesus christ", "sentiment": "none"}], "locations": [{"name": "stockholm", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "whitley bay", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "durham rt", "sentiment": "none"}, {"name": "hexham abbey  church", "sentiment": "none"}, {"name": "oasis aquila", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}, {"name": "bishop of jarrow right revd", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "depaul", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "hereford", "sentiment": "none"}, {"name": "durham cathedral", "sentiment": "none"}, {"name": "aegies associates", "sentiment": "none"}, {"name": "church", "sentiment": "none"}, {"name": "st nicholas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Fewer people are attending Easter services but our church leaders have a message of hope Easter messages of hope from Church of England leaders aim to unite at a difficult time both home and abroad Share Church of England leaders aim to unite at a difficult time both home and abroad Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJust one in 72 people in parts of the North East will attend a Church of England Easter service this weekend. \nBut religious leaders are working hard to change the trend? Kirsty Kew finds out more. \nLatest figures released by the Church of England show that only 20,600 people in the Durham diocese went to an Anglican service at Easter in 2015. \nThis works out at just one in 50 Christians, and one person in 72 overall in the area. \nThis was the lowest proportion of Christians, and one of the lowest proportions of people overall, attending England’s established church anywhere in the country on what is one of the two most important festivals in the Christian calendar. \nUsually 12,700 people went to church in Durham on a typical Sunday, meaning that congregations are about two-thirds larger than usual at Easter in the diocese. \nA spokesperson for the Church said: “Whilst the statistics around church attendance are deeply concerning they do not show the complete picture. However they do show why a priority for growth is at the top of the Diocesan agenda. \n“The recent ‘Talking Jesus’ mission engaged with more than 30,000 people in our communities and online; growing both awareness and active participation. This is an example of the work we are doing to reenergise and bless our communities in Jesus’ name for the transformation of us all.” Read More Easter Sunday services at Durham Cathedral, Newcastle's St Nicholas and Hexham Abbey \nChurch attendance during the festival has fallen 10 per cent in Durham between 2010 and 2015, and seven per cent on regular Sundays during this time. \nElsewhere in the North East, 17,400 people in Newcastle attended an Easter service in 2015, which is one in 29 Christians, and one person in 47 of the entire population of the area. \nSome 1.28 million people went to a Church of England service at Easter 2015. \nThis worked out as just one in 25 Christians, and one in 43 among England as a whole. \nIt was a similar story almost everywhere else in the country. \nRegular church attendance fell seven per cent across the Church of England so far this decade. \nHereford and Salisbury had the most Christians going to Anglican services as a share of the population. \nThe data does not count Christians from other denominations, such as Catholics and Methodists, who also would have been in church at Easter. \nIn a time when situations both at home and abroad seem desperate, the need for hope is stronger than ever. \nThis is the main message being put forward by Church of England leaders from across the North East in their Easter messages. The Right Reverend Christine Hardman, Bishop of Newcastle: Bishop of Newcastle Christine Hardman (Photo: Newcastle Chronicle) \n“I didn’t grow up in a church family. And that means that as a child I never really got the point of Easter . Yes, we got a holiday from school, but the weather was usually awful and it often seemed a rather boring and dreary time. \n“After the birth of our second child I started to think about the big questions in life, and on one August Sunday in 1978 I grabbed the hand of our four year old daughter and found the courage to go through the doors of our little local church; I will never forget the incredible experience of my first Easter just eight months later. For the first time I made the spiritual journey through Holy Week, and I experienced the full range of emotion – from the depths of sadness on Good Friday to the most extraordinary joy of Easter Day. \n“The message of the Cross and Resurrection of Jesus often comes home to us with greatest power when we are faced with the darkest and bleakest situations, either in our personal lives or in the life of the nation. \n“And that is no different this Holy Week and Easter. Whether we are facing particular challenges in our own lives or grieving the devastating attacks in Westminster and now this past week in Stockholm or facing the horror of the Sarin chemical attack in Syria - we are brought face to face with bleak and dark situations. We wonder how these things can be. \n“It is at times like this that we need to hear and receive again the profound message of hope that love triumphs over hatred, and life over death. In the death and Resurrection of Jesus Christ, the world to come breaks through into this world. In the darkest and bleakest situations, either in our personal or national lives, we need that deep hope and faith in the power of Christ to transform us and our world. \n“And so, in the midst of all that we face together and as individuals, this Easter may we know that deep hope – and may the light of Christ, rising victorious, banish all darkness from our hearts and minds. The Right Reverend Paul Butler, Bishop of Durham: Bishop of Durham Rt Rev Paul Butler (Photo: Newcastle Chronicle) \n“Funerals are very poignant. The dignified procession through the lined London streets of PC Keith Palmer this past week was testimony to how much we still value our police service. It speaks of how we honour someone laying down their life for the safety of others. The fact that he was also being remembered as ‘No.1 Daddy’ also touched all our hearts. \n“In Egypt, 44 very differently conducted Christian burials had to take place after two Coptic churches were blown up by suicide bombers, simply out to attack Christians, and deliberately on a Holy Day, Palm Sunday. These are the latest in ongoing attacks against Christians in that nation. The funerals take place rapidly due to the heat, and no provision for preserving the bodies for any length of time. \n“Jesus’ funeral was very different. It too was hurried at the end of the Friday, due to the imminent Passover festival. Two unexpected friends emerged and bravely stepped forward to take his body from the Cross. Joseph of Arimathea generously donates his unused family tomb. Nicodemus, who had secretly met with Jesus and tried to stand up for him amongst the Jewish leaders’ opposition, now puts his reputation, and possibly his life, on the line by assisting with Jesus’ burial. Jesus’ beaten up body is rapidly partially anointed (the custom of the time) by some of his women followers. They want to do the best for him. They are filled with sorrow. \n“Funerals should always be about honouring the person who has died. We should want to do the best for them. They should have time; time to remember, to weep, to give thanks and to commend into God’s hands. So in our day the reality of funeral poverty is a particular concern. So too are funerals that are not led well, or where respect is forgotten. We need to be a society that openly talks about death; whether that be the death of one who has had a long fulfilling life, or the sudden tragic, unexpected death of one caught up in a terror attack, or illness, or accident. Locally we have all been taken by the bravery of young Bradley Lowery’s fight with neuroblastoma. We rage against death but struggle to talk about it openly. \n“Jesus’ friends wanted to do the very best for their crucified friend and teacher. So the women returned to the tomb early on the Sunday morning to finish the task of anointing the body properly. But they were in for the biggest shock of human history. When they reached the tomb the stone was rolled back; the body was gone with the grave clothes left lying on the slab. An angel appeared to the women, telling them that Jesus was risen. It was too much to take in. The women fled back to tell the men, who were hiding in fear for their own lives, what they had found. Mary Magdalene, staying around the tomb, met the risen Jesus. Over the next hours many more met Jesus alive again. It became clear that Jesus was alive. Death had been defeated. \n“This is the Easter story, and the Easter hope. Death need not hold us in fear because it has been overcome. Jesus, in dying, defeated death. This is why Easter is so important. This is where hope in the face of death truly lies.” The Right Reverend Mark Bryant, Bishop of Jarrow Right Revd Mark Bryant, Bishop of Jarrow (Photo: Keith Blundy / Aegies Associates) \n“I am new to the North East - I have only been here just over nine years – but I love it. There is some wonderful scenery, there is often a real sense of community and of course, there is the warmth of the people. When I tell friends in other parts of the country that almost everybody thanks the driver when they get off the bus, they do not believe me. \n“The North East seems to me to be a wonderful place to live but there often seems to be a lot of negative talk. People talk about feeling neglected and unknown by people in London. People think Government and the South East know nothing about life in the North East. A lot of people are angry – the Brexit vote showed that – because they feel ignored and neglected. \n“There is a lot of talk – rightly I believe – about how difficult life is for so many people. New ways of running benefits and zero-hours contracts add to people’s unhappiness. \n“But all those things that are not good about life in the North East are not the end of the story. There are things going on which bring at least some people hope and help them to look forward. \n“Doing the job I do I am lucky enough to see many signs of hope. When I want to see some hope, I go to Oasis Aquila in Gateshead and see the support they are giving people without homes or with housing difficulties. People are helped with all the paperwork that comes through their letterbox, they are helped to get their benefits sorted and life, which seems impossible suddenly, at least for a while seems a bit more manageable. \n“Or I go to CAB in Gateshead were a survey recently showed that over 80% of people who visited felt less stressed and thus more hopeful after visiting for help. \n“Or I visit Depaul in Whitley Bay and listen to young people who have been given hope by having somebody to help them with their housing problems or help them patch up relationships at home. \n“Or I hear from the North East Chamber of Commerce about new full-time jobs being created and areas where the North East is leading the way. \n“This weekend over three days, I, and many thousands of other Christians across the North East, will be hearing the story of Jesus, the Son of God whose story appears to end in defeat because he is captured and put to death on a cross. However the story goes on to say that God brings Jesus back to life again so that we can know that hope can come out of despair and a sense that despair does not have to be the final answer. \n“There are lots of signs of hope coming out of despair in the North East. Perhaps our job is to believe that hope is always possible.” Like us on Facebook", "external_links": [], "published": "2017-04-16T01:00:00.000+03:00", "crawled": "2017-04-15T20:28:17.602+03:00", "highlightTitle": ""}