{"organizations": [], "uuid": "1e4661228889431bdd021d2305f5b2612b4111df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30267413/15953875.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/manufacturing-firm-moves-to-exeter-says-goodbye-to-plymouth/story-30267413-detail/story.html", "country": "GB", "title": "Concrete firm moves to Exeter, says goodbye to Plymouth", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Concrete firm moves to Exeter, says goodbye to Plymouth", "spam_score": 0.0, "site_type": "news", "published": "2017-04-13T00:00:00.000+03:00", "replies_count": 0, "uuid": "1e4661228889431bdd021d2305f5b2612b4111df"}, "author": "HannahFinch", "url": "http://www.devonlive.com/manufacturing-firm-moves-to-exeter-says-goodbye-to-plymouth/story-30267413-detail/story.html", "ord_in_thread": 0, "title": "Concrete firm moves to Exeter, says goodbye to Plymouth", "locations": [], "entities": {"persons": [{"name": "paul chadney", "sentiment": "none"}, {"name": "waycon", "sentiment": "none"}, {"name": "john hutchings", "sentiment": "none"}, {"name": "raymond gerson", "sentiment": "none"}, {"name": "hutchings", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "rockbeare", "sentiment": "none"}, {"name": "exeter airport", "sentiment": "none"}, {"name": "waycon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}], "organizations": [{"name": "plymouth concrete", "sentiment": "none"}, {"name": "university of plymouth", "sentiment": "none"}, {"name": "waycon precast", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Concrete firm moves to Exeter, says goodbye to Plymouth By HannahFinch | Posted: April 12, 2017 0 COMMENTS SHARES Pictured: John Hutchings, Paul Chadney and Raymond Gerson Concrete firm moves to Exeter, says goodbye to Plymouth X \nCopy link to paste in your message / Comments (0) \nA Plymouth manufacturing firm has relocated to a new £1.6million industrial estate near Exeter Airport, in a move which will safeguard 43 jobs. Concrete product manufacturer Waycon Precast made the move to a commercial site at Rockbeare after securing a £550,000 finance from specialist lender Together. \nWaycon Precast specialise in making concrete lift shafts \nRaymond Gerson, director of Waycon Precast, said the new site will mean the business will be able to expand to construct concrete frames for housing. \nHe said: \"This move will also save money in transport costs, since we will now be 53 miles closer to the main Exeter M5 hub than we were at their previous location. The company now has a really bright future and, importantly, jobs have been secured.\" \nRead next: There are more of us in work than anywhere else in the UK, official figures show \nWaycon, which specialises in making concrete lift shafts, had been operating from a rented site more than 50 miles away in Plymouth. But the freeholder won planning permission to build houses there – meaning the manufacturing business would have to find a new home. \nIt had already secured a £385,000 grant from the South West Growth Fund, part of the government's Regional Growth Fund, to create and protect jobs, by enabling the company to move to new premises, but no suitable property could be found as the deadline loomed for the company to vacate. \nTogether reviewed the case and with expertise in fast funding, ensured a quick completion on the 46,000 sq ft Old Concrete Products Factory - and continuation of employment for the manufacturer's 43 staff. \nPaul Chadney, Together's regional development director for the South West said: \"This was a great result for all concerned. Our investment – along with funds from the South West Growth Fund – meant Waycon could move quickly to secure the deal. It is a great example of how specialist short-term finance can deliver long-term solutions.\" \nRead next: Flybe boss fears Brexit may put travellers off flying \nTogether was introduced by John Hutchings, grant manager for the South West Growth Fund, a fund run by a partnership led by the University of Plymouth. Supported by the Regional Growth Fund, the £8.7million South West Growth Fund supports transformational projects in businesses, primarily in manufacturing, marine and digital industries and is set to create a total of 1,000 new jobs across the South West. \nMr Hutchings said: \"We were delighted to work with Together and provide our own funding to help Waycon Precast into their new home. The move will give Waycon much more flexibility, and secure jobs in the South West region.\"", "external_links": [], "published": "2017-04-13T00:00:00.000+03:00", "crawled": "2017-04-12T20:08:41.397+03:00", "highlightTitle": ""}