{"organizations": [], "uuid": "e9555e9725658b7cdd4acb9d9331f2c24c621bff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30255864/15945264.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/devon-mp-will-reveal-truth-of-army-life-in-gripping-new-book/story-30255864-detail/story.html", "country": "GB", "title": "Devon MP will reveal truth of Army life in gripping new book", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Devon MP will reveal truth of Army life in gripping new book", "spam_score": 0.0, "site_type": "news", "published": "2017-04-07T17:20:00.000+03:00", "replies_count": 0, "uuid": "e9555e9725658b7cdd4acb9d9331f2c24c621bff"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/devon-mp-will-reveal-truth-of-army-life-in-gripping-new-book/story-30255864-detail/story.html", "ord_in_thread": 0, "title": "Devon MP will reveal truth of Army life in gripping new book", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Devon MP will reveal truth of Army life in gripping new book By Zoe_Stevens   By Sam Blackledge Plymouth MP Johnny Mercer is planning to publish his autobiography in June Devon MP will reveal truth of Army life in gripping new book X \nCopy link to paste in your message / Comments (0) \nA new book will see a Devon MP tell the story of his journey from the battlefields of Afghanistan to the Houses of Parliament. Former Army captain, and current Plymouth MP Johnny Mercer has revealed that he is preparing to release his autobiography, entitled 'We Were Warriors', in June. \nThe book, which will be published by Pan Macmillan, provides an insight into the front line of the Afghan war, focusing on Mr Mercer's third tour and how the aftermath inspired him to run for office. \nMr Mercer told the Plymouth Herald : \"It's about my generation's experiences of going through ten years of either preparing for or conducting operations in the Army. \n\"It's not a traditional Army book – I did this and I did that – it doesn't make me look particularly good, but I hope it helps people who can't codify or put their experiences into words. \n\"Whether or not you agree with it is irrelevant. I hope it's something people read and understand, it's about what we've asked a generation of our young people to go through, and I hope people will find it helpful.\" \nMr Mercer, elected as Conservative MP for Plymouth Moor View back in 2015, admits he is nervous about how it will be received. \n\"It's quite exposing writing a book,\" he says. \n\"To be approached to write an autobiography at 35, you kind of feel like you haven't really done anything yet.\" \nDescribed as 'gripping and honest' by BBC Newsnight diplomatic editor Mark Urban, the book has given Mr Mercer a chance to reflect on what has been described as a difficult childhood, and he says readers may come to see him in a different light. \n\"A couple of people who have read it already would certainly say that,\" he said. \n\"It will be very interesting to see the reaction. It's nerve racking. \n\"I had a very interesting time at home. That will be focused on, but that's one chapter of a 37 chapter book. \n\"We are all a product of our youth and a product of our experiences, for good or bad. So it will be interesting to see what people think. \n\"There's nothing I can do about it now, once it's done you've just got to suck it up and see what comes down the line.\" \nMr Mercer says he has 'learned an awful lot' during his first two years in Westminster. \n\"I'm learning more every day,\" he says. \n\"This job is a terrific education, it has exposed me to a world I never really thought much about. \n\"You come from one profession and you see good people at work, but there are some amazing people who do amazing things without due reward and attention. \n\"A lot of it has been pretty humbling if you look at the work done in the NHS, local authorities and the voluntary sector who don't get the praise or newspaper coverage.\" \nAsked how he has changed as a person, he says: \"It's hard to answer that. I don't spend a lot of time in deep reflection. I don't think it's overly healthy. \n\"Being an MP isn't about me and how well I do. It is a vehicle to get things done. \n\"We have achieved some significant successes around public health, around the Iraq Historical Abuse Team, around veterans' care and mental health. \nRead next: Seven ways to make the most of the sunshine in Devon this weekend \n\"But there is so much more to do. You can't just say 'Oh I've done a great job and I'm really enjoying it'. \n\"We're doing ok but there are a lot of people to help, a lot of injustices to right in Plymouth around how we've been treated by national government over a generation. \n\"There's a long way to go and I will keep having that fight on a daily basis.\" \nBefore he was elected Mr Mercer set out a series of key campaign pledges. \nOne of them was a 'refusal to vote on UK transport schemes elsewhere until Plymouth's are sorted'. \n\"That has been the single issue I have struggled with most over the first two years of this Parliament,\" he says. \n\"On the last HS2 vote, I went to see the minister to tell him I was voting against the bill. \n\"But I also sat down with Gary Streeter and said 'You know my views on this, I think we should act as a collective bloc. We are going to be judged on this, in my view transport will be the single totemic issue in 2020.' \n\"He said to me 'Look Johnny, there are improvements. The money that's gone into Dawlish, the new trains, the station, the better connectivity. These things are happening. So you can't say we're not on a journey to getting it sorted out. But if you vote against it you will make us look like we're not operating as a team'. \nRead next: Woman's fear after man broken in and attacked her in the night \n\"At the end of the day it's not about me. It's about what we achieve as a group of Conservatives in Plymouth. \n\"I then made the decision that I was not going to vote against the Government, but I came away and I was not 100 per cent sure whether I'd made the right decision. \n\"Ultimately if I had voted against the Government it wouldn't have changed anything. Whereas now I'm in a better position.\" \nAnother of his pledges was on \"direct democracy\", giving constituents the chance to \"call the shots\". \nHis first attempt in 2015 saw 338 people vote in an online poll about changes to fox hunting laws. \nIn the end the bill was abandoned, and Mr Mercer tried again ahead of the EU referendum. \nAround 400 people responded, 74.1 per cent backing Brexit. \nBut Mr Mercer voted Remain; a decision he now feels was wrong. \n\"Based on the information I had at the time, which was given to me by people who had been in politics for a long time, they were absolutely clear that an economic downturn was coming. I was not prepared to vote for that. \n\"But it hasn't happened, so the basis on which I voted was not right, I got it wrong.\" \nHe still believes the direct democracy approach has potential. \n\"It's got to be the right issue,\" he says. \n\"People want different things from MPs. Some people want a delegate; some people want a representative; some people want you to just exercise your judgement. \n\"I firmly believe I am there to represent Plymouth, but I've got to represent those who are not as loud as other people. \n\"I've also got to provide leadership on certain issues around the economy and the welfare state. \nRead next: Yomper wants his statue moved to Plymouth or London \n\"When it's something that is not going to affect the economy, like foxhunting, I will do it. I never said I would do it on every issue, that's impossible, we have four or five votes a day sometimes. \n\"I expect opportunities to come up in the future. There are going to be 52,000 pieces of legislation in the Great Repeal Bill, and I am very aware that this is something I promised people. \n\"Some people hate it, they think it's a really stupid idea, but at the end of the day I said I would do it, so I am going to have to do it.\" READ NEXT: \nDevon man dies and teenager left fighting for his life after motorbike crash \nA man has tragically died and a teenager is left fighting for his life after a motorbike crash near Devon. Emergency services were called at 11.10pm on Thursday night after a crash between two motorbikes on the B3362 at Lezant in Launceston. One of the riders, a 49-year-old man from Beaworthy, sustained fatal injuries and was pronounced dead at the scene. The other motorcyclist, an 18-year-old man from the Tavistock area, was airlifted to Derriford Hospital with life-threatening injuries. \nComplete ban on energy drinks announced by South Devon school \nA South Devon school has announced a complete ban on energy drinks. From the start of the summer term, there will be a complete ban on 'energy drinks' being brought into Teign Schol in Kingsteignton. Parents were informed of the ban by a letter sent to them at the end of March. The letter informs parents that any student caught with energy drinks, such as Red Bull and Monster, inside the school, will be in breach of school rules and thus punished accordingly. \nWoman jailed for revenge arson attack on Torquay neighbour and four-year-old daughter \nA woman has been jailed for four years after setting fire to a neighbour's flat in a reckless \"revenge attack\" in Torquay. A four-year-old girl was rescued through an upstairs window and given oxygen by paramedics as a result of the fire, a court heard. Shelley Plater, 52, tipped and set fire to nail varnish remover outside the adjacent hallway door to a neighbouring flat on January 17, the hearing was told. \nAlmost one in five children living in poverty \nAround one in five children in Ilfracombe live in relative poverty according to data from the HMRC and Department for Work and Pensions. The figures are based on the number of families receiving either out-of work-benefits or tax credits whose income is less 60% of the average (median) income or £481 per week. Families below this baseline are classified by the government as 'low income' or living in relative poverty.", "external_links": [], "published": "2017-04-07T17:20:00.000+03:00", "crawled": "2017-04-08T00:19:43.552+03:00", "highlightTitle": ""}