{"organizations": [], "uuid": "dce2c5ac624489ae0d0d56809a6b7528d95a9743", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30255986/15945416.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/sturgess-cars-investing-in-the-future-as-it-marks-120-years/story-30255986-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Sturgess cars investing in the future as it marks 120 years", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Sturgess cars investing in the future as it marks 120 years", "spam_score": 0.0, "site_type": "news", "published": "2017-04-11T13:00:00.000+03:00", "replies_count": 0, "uuid": "dce2c5ac624489ae0d0d56809a6b7528d95a9743"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/sturgess-cars-investing-in-the-future-as-it-marks-120-years/story-30255986-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Sturgess cars investing in the future as it marks 120 years", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "sturgess", "sentiment": "negative"}, {"name": "barney sturgess", "sentiment": "none"}, {"name": "walter e sturgess", "sentiment": "none"}, {"name": "leyland", "sentiment": "none"}, {"name": "chris sturgess", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "suzuki", "sentiment": "none"}, {"name": "broughton astley", "sentiment": "none"}, {"name": "alfa romeo", "sentiment": "none"}], "locations": [{"name": "west end", "sentiment": "none"}, {"name": "abarth", "sentiment": "none"}, {"name": "simca", "sentiment": "none"}, {"name": "belsize", "sentiment": "none"}, {"name": "narborough road", "sentiment": "none"}, {"name": "charles street", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "aylestone road", "sentiment": "none"}, {"name": "broughton astley", "sentiment": "none"}], "organizations": [{"name": "fiat", "sentiment": "none"}, {"name": "mazda", "sentiment": "none"}, {"name": "sturgess", "sentiment": "none"}, {"name": "chevrolet", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "volvo", "sentiment": "none"}, {"name": "sturgess group", "sentiment": "none"}, {"name": "jaguar", "sentiment": "none"}, {"name": "hyundai", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sturgess cars investing in the future as it marks 120 years By TomPegden   0 COMMENTS SHARES Chairman Chris Sturgess and managing director Barney Sturgess are proud of the family firm's heritage Sturgess cars investing in the future as it marks 120 years   \nA family-owned car dealership is investing in the future as it marks 120 years in business. \nSturgess Group, which has showrooms across the city and county selling Jaguar-Land Rover (JLR), Abarth, Alfa Romeo, Fiat, Hyundai, Suzuki and Volvo, has spent more than £2.5 million on a new preparation facility and body shop near Broughton Astley. \nIt also has plans to expand Its JLR dealership in Narborough Road and invest in a former showroom it bought a couple of years ago in Aylestone Road. \nChairman Chris Sturgess said the business saw turnover exceed £140 million last year compared to £122 million in 2015, when pre-tax profits were £1.36 million. \nTotal head count is 280, compared to 271 in 2015. \nMr Sturgess – whose great-grandfather Walter E Sturgess started the business assembling bicycles in Leicester's West End in 1897 – said the company was looking forward to the anniversary year with further growth and job creation. \nHe said: \"We've got quite a lot of activity coming up over the next two years with all our brands, and we're looking at refreshing all our sites and rebranding. \n\"We've got a property we will be developing in the next 12-24 months – the old Mazda site in Aylestone Road. At this stage plans are in their infancy but it will be a fairly major development. \n\"We've also got plans to expand with JLR in Narborough Road. That's going to be starting towards the back end of this year. \n\"The JLR dealership is one of the jewels in our crown, and marked 15 years there at the end of last month. With the expansion of the product portfolio we have to enlarge it so there will be some reconfiguring of that site allied to further premises development. \n\"We've also just opened our preparation and body shop centre just outside Broughton Astley and we're now bringing it up to speed. \n\"That site will be carrying out work for the whole group, with a storage facility for new cars. \n\"It's a high-tech building with hi-tech equipment and security, and has led to more jobs. \n\"We've probably taken on half a dozen people, and have relocated some from within the city. \n\"The posts we have moved will eventually be filled with new people. We are increasing at the rate of around 10 people a year.\" \nOnly last week the Society of Motor Manufacturers and Traders, announced March had been a record month for overall car registrations – up 8.4 per cent year on year with 562,337 new cars registered. \nMr Sturgess said 2016 had been a particularly good year for the business and felt 2017 would see the rate of growth slow slightly. \nHe said: \"While something like Brexit might not necessarily affect the retailer, it can affect the people we are selling to. \n\"We are very, very much in uncharted waters with Brexit so have no idea how everything is going to be affected but I think one has to be cautious rather than bullish. \n\"Our primary focus for the coming months will be about organic growth with our current partners and seeing what opportunities they present. \n\"Having said that, if any opportunity came along with another brand we would certainly take a look at it.\" \nMr Sturgess said that as well as celebrating 120 years in business, they would be marking 70 years working with Jaguar this year – making them the YUk's oldest Jaguar dealer – and 70 years with Land Rover next year. \nAs far back as 1904 it was acting as an agent for Rover cycles and spent the first half of the 20th century in and around the West End area with further premises in the prestigious surroundings of Charles Street. \nBrands over the years included British Leyland, Singer, Simca, Maudslay Trucks and post-war Chevrolet and Belsize. \nHe said the longevity of the business was testament to the team, their focus and the brands. \nHe said: \"Everyone here works with a common goal and our sustainability is driven by what the customer wants.\"", "external_links": [], "published": "2017-04-11T13:00:00.000+03:00", "crawled": "2017-04-11T08:07:19.527+03:00", "highlightTitle": ""}