{"organizations": [], "uuid": "e4416a61c6bba5e078af488e736c6516fb2e56a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30269990/15955925.jpg", "site_section": "http://www.westernmorningnews.co.uk/travel.rss", "section_title": "Devon Live Travel RSS feed", "url": "http://www.devonlive.com/flight-or-fright-an-airline-journey-into-the-unknown/story-30269990-detail/story.html", "country": "GB", "title": "Flight or fright: an airline journey into the unknown", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Flight or fright: an airline journey into the unknown", "spam_score": 0.0, "site_type": "news", "published": "2017-04-14T01:07:00.000+03:00", "replies_count": 0, "uuid": "e4416a61c6bba5e078af488e736c6516fb2e56a0"}, "author": "Western Morning News", "url": "http://www.devonlive.com/flight-or-fright-an-airline-journey-into-the-unknown/story-30269990-detail/story.html", "ord_in_thread": 0, "title": "Flight or fright: an airline journey into the unknown", "locations": [], "entities": {"persons": [{"name": "dao", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mr cruz", "sentiment": "none"}, {"name": "latam", "sentiment": "none"}, {"name": "david dao", "sentiment": "none"}, {"name": "alex cruz", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "timbuktu", "sentiment": "none"}, {"name": "exeter airport", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "gatwick", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "states", "sentiment": "none"}], "organizations": [{"name": "british airways", "sentiment": "none"}, {"name": "united airlines", "sentiment": "none"}, {"name": "iberia", "sentiment": "none"}, {"name": "the sunday times", "sentiment": "none"}, {"name": "sunday times", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nThe last time I flew British Airways, seven or eight years ago, the airline did an admirable job of putting the plebs in their place. \nA leery passenger who tried to chat up a stewardess was warned: “Another remark like that and you will be wearing this coffee.\" \nA second, who politely asked a steward to identify the main meal (a scaled-up version of the starter) was told: “When you find out let me know.\" \nAs we found out this week, airlines have upped their game since then. \nIn the States, United Airlines were quite happy to drag Dr David Dao kicking, screaming and bleeding from his seat for no better reason than that their staff needed it. God help we mere plebs should we have the nerve to expect to fly when we've bought a ticket and occupied a seat. \nThe British Airways chief executive told The Sunday Times last week that he is considering binning the idea of free meals on longer flights. They have already gone on the company's short-haul routes. \nAlex Cruz, boss of BA, said that after “a rough start\", customers now welcomed the chance to buy M&S food on European services. Oh, really. I don't want to be rude, Mr Cruz, so I'll just say you're talking out of your baggage hold. \nIt appears that BA is going all budget on us. It is already adding 52 seats to its 777s from Gatwick to the Caribbean. \nMeanwhile, the company is giving its better-off passengers the full toff treatment, improving bedding and sleep quality in business class. \nShould you ever be accidentally upgraded to first class you can even look forward to fresh flowers and the free amuse-bouche, a bite-sized appetiser, just in case you feel peckish while flying over Timbuktu. \nTimes may be tough for the airlines, but some still manage to hack it. \nI read the Sunday Times article while on an Iberia flight back from Peru last week. Hats off to Iberia: they gave a comfortable flight with friendly service. \nDuring a two-week holiday we flew with five carriers. \nBy far the best was Latam (who? I hear you say) from Madrid to Peru, a 6,000-mile haul that could have been seriously painful, but wasn't. \nTheir legroom would not have troubled a basketball player; the free food and drink was exceptional; and the service was enough to make you fall in love with an air hostess. Flybe route cuts unlikely to impact on Exeter Airport jobs \nThe worst was ... British Airways. The short hop with our national carrier from Heathrow to Madrid left us feeling unloved, unfed and cramped. \nPundits reckon that many British people voted for Brexit because they have been ignored by an increasingly detached global elite, and the airline industry is a good metaphor for that. \nIf those voters believe that Brexit is going to be all cut flowers and amuse-bouche, they need to wake up and smell the over-priced coffee. \nAnd when Stewardess Theresa May comes to drag me from my seat in Europe, I'll take a leaf from Dr Dao's book and go kicking and screaming. \nREAD NEXT", "external_links": [], "published": "2017-04-14T01:07:00.000+03:00", "crawled": "2017-04-13T21:28:49.717+03:00", "highlightTitle": ""}