{"organizations": [], "uuid": "55d11d6e8b8b03bb1fd32b388b83699168576290", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30278058/15961592.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/theresa-may-calls-general-election-how-leicestershire-candidates-reacted-to-snap-election/story-30278058-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin commented Theresa May calls General Election: How Leicestershire candidates...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin commented Theresa May calls General Election: How Leicestershire candidates...", "spam_score": 0.0, "site_type": "news", "published": "2017-04-19T00:22:00.000+03:00", "replies_count": 0, "uuid": "55d11d6e8b8b03bb1fd32b388b83699168576290"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/theresa-may-calls-general-election-how-leicestershire-candidates-reacted-to-snap-election/story-30278058-detail/story.html", "ord_in_thread": 0, "title": "danjmartin commented Theresa May calls General Election: How Leicestershire candidates...", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "danjmartin", "sentiment": "negative"}, {"name": "tredinnick", "sentiment": "none"}, {"name": "david tredinnick", "sentiment": "none"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "michael mullaney", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "edward garnier", "sentiment": "none"}, {"name": "liz kendall", "sentiment": "none"}, {"name": "glenfield", "sentiment": "none"}, {"name": "jon ashworth", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "leicester south", "sentiment": "none"}, {"name": "leicester south  leicester south", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester west", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "north west leicestershire  conservative north west leicestershire", "sentiment": "none"}, {"name": "leicester west  labour leicester west", "sentiment": "none"}, {"name": "harborough  harborough conservative", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "bosworth  veteran bosworth tory", "sentiment": "none"}, {"name": "bosworth  bosworth liberal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May calls General Election: How Leicestershire candidates reacted to snap election   Comments (3) \nLeicestershire MPs and prospective candidates have had their say on the Prime Minister calling a shock snap General Election on June 8. \nTheresa May announced this morning that she was seeking to hold an election on that date - but, she needs the backing of two-thirds of MPs for the vote to go ahead. \nHowever, with Labour leader Jeremy Corbyn backing Mrs May's calls for a vote it seems very likely that people in Leicestershire will be casting their ballots in a General Election this summer. \nWe asked local MPs and prospective candidates what they thought about the Prime Minister's decision, and here is what they said: Nicky Morgan, Conservative MP for Loughborough \nThe former education secretary Nicky Morgan said she had spoken to people close to Mrs May about her u-turn on a snap election. \nThe Loughborough MP said: \"She genuinely was reluctant to make this decision and she did not do it lightly. \n\"She is not someone who likes to go back on what she said. \n\"Logically this is the only window of opportunity before the Brexit negotiations begin so it is a sensible time.\" \nShe said she was looking forward to defending her 9,183 majority. \nShe said: \"You can never take anything for granted but I hope people will recognise I have been a hard working constituency MP and a strong voice for Loughborough in parliament and government. \n\"I love getting out and knocking on people's doors and campaigning. \n\"I have already been out with our county council candidates so that work will continue up to the June election.\" Liz Kendall, Labour MP for Leicester West \nLabour Leicester West MP Liz Kendall said: \"I am looking forward to the campaign. \n\"I will be fighting for every vote on my track record of working to save the Glenfield heart unit and campaigning against school funding cuts. \n\"I believe I am the best person to represent the people of Leicester West and I can't wait to get out into the community on the campaign trail.\" Jon Ashworth, Labour MP for Leicester South \nLeicester South MP Jon Ashworth took the seat off the Liberal Democrats in a by-election in 2011. The Labour MP said he would not be taking his 17,845 majority from 2015 for granted. \nHe said: \"This election is a surprise because Theresa May specifically said she would not call it – and then she did. \n\"If she has broken her word in this what else might she break her word on? \n\"I will be asking the good people of Leicester South to put their faith in me for a third time. \n\"I'm looking forward to the campaign. I'll be working very hard and talking to people about the big issues that affect them – the state of the NHS, cuts to primary schools and the fact that even though the economy is in growth, that growth is not spreading downwards.\" Andrew Bridgen, Conservative MP for North West Leicestershire \nConservative North West Leicestershire MP Andrew Bridgen has welcomed the snap election. \nHe said: \"I've already called for this. \n\"I'm always on war footing. \n\"I said we should have had it on the same day as the county council elections (on May 4). \n\"But June 8 will do. \n\"We have a small majority and we have the opportunity to get one that allows Theresa May to carry through the Brexit negotiations. \n\"We have opposition parties trying to block the democratic will of the people.\" Sir Edward Garnier, Conservative MP for Harborough \nHarborough Conservative MP Sir Edward Garnier admits he was caught unawares by the announcement. \nHe said: \"I was surprised but having heard the Prime Minister's reasons I can see her logic.\" \nHe said 'on current form' he hoped to be defending the seat he has held since 1992. \nHe added: \"We have an on paper majority of 17 in the House. \n\"We need stability. \n\"Labour are all over the shop and the Liberal Democrats are an irrelevance in parliament.\" David Tredinnick, Conservative MP for Bosworth \nVeteran Bosworth Tory MP David Tredinnick has welcomed what will be his eighth election. \n\"I'm raring to go. \n\"I would have been happy with a May election but I think June 8 is more respectful of the electorate. \n\"May has done the right thing. She has broad appeal and we need to get a new mandate. \nHe added: \"I have always been against five year parliaments. \n\"The fixed term parliament act was an offer from David Cameron to give the Liberal a bit more time in (the Coalition) Government but it's too long.\" Michael Mullaney, Prospective Lib Dem candidate for Bosworth \nBosworth Liberal Democrat prospective parliamentary candidate Michael Mullaney will be seeking to overturn Mr Tredinnick's 11,000 majority. \nRead more: Theresa May calls General Election for June 8 - recap \nHe said: \"The blunt reality is the Tories will win this election. The issue will be if they can do it by a landslide that will allow them to continue to dismantle the NHS and other services. \n\"Labour cannot win. The British people will not elect someone as left wing as Jeremy Corbyn so only the Lib Dems can put a check on the Tories.\"", "external_links": [], "published": "2017-04-19T00:22:00.000+03:00", "crawled": "2017-04-18T23:53:51.000+03:00", "highlightTitle": ""}