{"organizations": [], "uuid": "48692d61a5546d951889461274a07535243e8a6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12830728.ece/ALTERNATES/s1200/pranks.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/20-years-april-fools-day-12830676", "country": "GB", "domain_rank": 21960, "title": "20 of this year's April Fools Day pranks that had Geordies baffled", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "20 of this year's April Fools Day pranks that had Geordies baffled", "spam_score": 0.0, "site_type": "news", "published": "2017-04-01T23:00:00.000+03:00", "replies_count": 0, "uuid": "48692d61a5546d951889461274a07535243e8a6a"}, "author": "Lisa Hutchinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/20-years-april-fools-day-12830676", "ord_in_thread": 0, "title": "20 of this year's April Fools Day pranks that had Geordies baffled", "locations": [], "entities": {"persons": [{"name": "paddy power", "sentiment": "none"}, {"name": "rodda", "sentiment": "none"}, {"name": "harding", "sentiment": "none"}, {"name": "bayliss", "sentiment": "none"}, {"name": "harry", "sentiment": "none"}, {"name": "meghan markle", "sentiment": "none"}, {"name": "cornish", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "daisy floral-op", "sentiment": "none"}, {"name": "marmite", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "après sail", "sentiment": "none"}, {"name": "tyne bridge towers", "sentiment": "none"}, {"name": "dover", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "marmite", "sentiment": "none"}, {"name": "royal albert hall", "sentiment": "none"}, {"name": "mount mast", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "chastity island", "sentiment": "none"}, {"name": "tyne bridge", "sentiment": "none"}], "organizations": [{"name": "geordies", "sentiment": "negative"}, {"name": "tyne bridge towers", "sentiment": "none"}, {"name": "pink news", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "clotted cream", "sentiment": "none"}, {"name": "royal caribbean international", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "university of dundee", "sentiment": "none"}, {"name": "burger king", "sentiment": "none"}, {"name": "sea life centre", "sentiment": "none"}, {"name": "davril developments", "sentiment": "none"}, {"name": "b&q", "sentiment": "none"}, {"name": "meatball marinara", "sentiment": "none"}, {"name": "shakespeare’s globe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "20 of this year's April Fools Day pranks that had Geordies baffled Here is a roundup of 2017 April Fools Day fake stories that had you duped Share The Tyne Bridge, Prince Harry and Marmite have all been part of April Fools' Day Share Get daily updates   \nHave you been fooled today? It’s April Fools Day and scores of jokes have swept across the country which have duped thousands of gullible Geordies . \nHere is a roundup of some of the April Fools stories that had us tricked. \n1. ChronicleLive even jumped on the bandwagon with an April Fool of our own. \nWe told how a bid to turn the Tyne Bridge Towers into student accommodation has been launched by a mysterious group of European developers. Plans to transform the Tyne Bridge Towers into luxury student accommodation \nLuxembourg-based Davril Developments has unveiled the audacious attempt to find a use for the iconic bridge towers which would see it cash in on the growing trend for converting city centre buildings into luxury digs for Newcastle’s growing student population. We had you baffled. \n2. The Daily Mail is trying to fool its readers by publishing fake photos from the imaginary wedding of Prince Harry and Meghan Markle in Las Vegas. Prince Harry (Photo: Getty Images Europe) \n3. Meanwhile, Pink News has provoked outrage by saying that Britain is pulling out of the Eurovision Song Contest in the wake of the Brexit vote. \n4. ITV2 has also teased fans by announcing that a new TV show Chastity Island is coming soon. There will be “sun, sea and absolutely no sex” on the fake show. \n5. The Stage has reported that “Shakespeare’s Globe has announced that it has appointed George Osborne as its new artistic director”. \nIt comes after the former Chancellor was controversially appointed as the editor of the Evening Standard last month. \n6. The Beano to drop words in favour of emojis. Kids these days have no need for conventional words put together using the boring old alphabet. It’s all about reading via emojis. \n7. Domino’s have jokingly announced a ‘door-livery’ innovation – a new supersized ‘Heatwave Letterbox’ that keeps orders fresh and piping hot for up to 12 hours. \nThe pizza company says: “The ‘Door-mino’s’ invention is a must for anyone who wants pizza waiting for them when they get home from a long day or night out – or for those who just don’t like answering the door.” \n8. Subway is pretending to launching their first ever ice cream range in three popular sandwich filling flavours - Meatball Marinara, Chicken Tikka and Tuna. \n9. Bayliss and Harding is launching a roast beef and Yorkshire pudding handwash. \n10. University of Dundee said it was offering Penguin Studies MSc and was now accepting applications. But the bets bit was “Each student will receive one adult penguin to raise over the year.” \n11. The London’s Sea Life Centre has brought out a pee-stinguisher to sooth jellyfish stings for staff working with jellies at the aquarium. \n12. Rodda’s Clotted Cream said it had “set a new precedent with local Cornish milk farmers, by setting contractual standards about the length of the grass used to feed their cows. \n13. B&Q in Dover said they sent a team to the white cliffs of Dover to give them its annual whitewash makeover. \n14. The London Eye introduced a loft-y new apartment plan with the top two capsules to become penthouse studios \n15. In another April Fool’s Day joke, Royal Caribbean International is launching the world’s first ski resort at sea - the Piste of the Seas. \nThe ship’s features include five real snow runs, a lift to the top of Mount Mast, the Après Sail bar and the Alpine Spa. Guests can also enjoy log cabin-styled rooms that come with a dedicated Chalet Host. \n16. For April Fool’s Day, the Royal Albert Hall has announced it will celebrate with ‘Tweets Live’ - the greatest tweets ever written, performed by the people who wrote them. \n17. Bookmaker Paddy Power is playing a prank on sports fans by releasing footage of what it claims is the world’s first successful seahorse race. \n18. Marmite is staging a fake launch of ‘Meh-Mite’ - a blander version of original Marmite that people either hate or love. A jar of marmite (Photo: PA) \nA spokesperson from Marmite, Daisy Floral-Op, commented: “As a brand, we were conscious that Marmite was causing a real rift amongst friends, family and lovers across the nation, and we no longer want to be responsible for such conflicts, inviting more people to enjoy the brand.” \n19. Iceland introduces frozen flowers. They advertised it as ‘Flowers fresh as the day they were picked #PowerofFrozen’. \n20. Burger King to introduce Whopper Toothpaste. Here is what the good people at Burger King had to say: “The iconic burger: the WHOPPER® from BURGER KING® is so generous and tasty, that its fans would do anything to make its unique flame grilled beef taste last longer. \n“To keep the tasty flavours lasting longer, BURGER KING® has created WHOPPER TOOTHPASTE TM, the first toothpaste with active WHOPPER® extracts.\" Like us on Facebook", "external_links": [], "published": "2017-04-01T23:00:00.000+03:00", "crawled": "2017-04-01T18:28:32.759+03:00", "highlightTitle": ""}