{"organizations": [], "uuid": "b85afd03841e6ea703cb3bf5b3abf1dd028204c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12886648.ece/ALTERNATES/s1200/1st-Test-South-Africa-v-Sri-Lanka-Day-3.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/sport/cricket/stephen-cook-i-thought-durhams-12885769", "country": "GB", "domain_rank": 21960, "title": "Stephen Cook: 'I thought Durham's problems were a fantastic opportunity to make a difference'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Stephen Cook: 'I thought Durham's problems were a fantastic opportunity to make a difference'", "spam_score": 0.0, "site_type": "news", "published": "2017-04-13T18:00:00.000+03:00", "replies_count": 0, "uuid": "b85afd03841e6ea703cb3bf5b3abf1dd028204c7"}, "author": "Stuart Rayner", "url": "http://www.chroniclelive.co.uk/sport/cricket/stephen-cook-i-thought-durhams-12885769", "ord_in_thread": 0, "title": "Stephen Cook: 'I thought Durham's problems were a fantastic opportunity to make a difference'", "locations": [], "entities": {"persons": [{"name": "stephen cook", "sentiment": "positive"}, {"name": "graeme fowler", "sentiment": "none"}, {"name": "jack burnham", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "stephen", "sentiment": "none"}, {"name": "scott borthwick", "sentiment": "none"}, {"name": "kolpak", "sentiment": "none"}, {"name": "paul collingwood", "sentiment": "none"}, {"name": "mark stoneman", "sentiment": "none"}, {"name": "keaton jennings", "sentiment": "none"}, {"name": "michael richardson", "sentiment": "none"}, {"name": "jon lewis", "sentiment": "none"}, {"name": "cook", "sentiment": "none"}, {"name": "jennings", "sentiment": "none"}, {"name": "jimmy", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "sri lanka", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}], "organizations": [{"name": "notts", "sentiment": "none"}, {"name": "surrey", "sentiment": "none"}, {"name": "lions", "sentiment": "none"}, {"name": "nottinghamshire", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "durham new-boy cameron steel", "sentiment": "none"}, {"name": "wales cricket board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa's Stephen Cook (Photo: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nStephen Cook arrived in the North East on Sunday to live a childhood dream, to teach, to lead, to acclimatise, to score the runs that can win back his place in the South Africa side and in a perfect world play in a Lord’s final. But most of all, the 34-year-old has come to do his bit for Durham . \nThe opener makes his debut at home to Nottinghamshire in their opening County Championship game, starting on Good Friday. \nThis time last year it would be a First Division fixture, but while Nottinghamshire were relegated for cricketing reasons, the Riversiders went down as part of a kneecapping from the England and Wales Cricket Board for running up debts they could not pay off. Durham start the season on minus 48 points, already 60 behind Notts, who played last week. \nCook knew what he was signing up to – his new county were still in Division One when Keaton Jennings first asked if he would be interested in joining, but the full extent of their treatment at the governing body’s hands was clear long before the signing was sealed and delivered. \nWith opener Mark Stoneman and No.3 Scott Borthwick – 1,000-run men in each of the last three summers – leaving for Surrey, top-order batsmen will bear the heaviest burden. \n“Throughout my career I’ve never looked for the easy way out so this fits in well with me,” smiles Cook. “I’m a bit of a scrapper, I’m that type of player. \n“Back home, my domestic side has also been through times where we’ve had a lot of challenges and difficulties and it’s brought out the best in myself and my team. I hope to do the same here. \n“It’s been well documented what’s happened with the points and the financial situation but I see that as a challenge. The day I saw that come out I thought it was a fantastic opportunity to come here and make a difference to the club. Read More Durham coach Jon Lewis: 'We need five or six to have their best season ever. It's quite do-able.' \n“I’ll really put in an effort because it’s not impossible to get promoted and what a story it would be. You always want to be a part of history, a part of something special, and I think this is going to serve as added motivation to the boys in the changing room.” \nYou can see in his piercing, darting eyes an intensity which has got Cook to this point. He is the son of former South Africa opener Jimmy, whose three years at Somerset left an impression. \n“Ever since I watched my old man play at Somerset as a young boy I really loved this idea of the county cricket circuit and the traditions that came along with the game here,” says Cook junior. “It’s really different from anywhere else in the world. \n“It was always on my bucket list and it’s a real honour to be able to do it for Durham.” \nThe relentless county treadmill should suit a player whose 40 First-Class hundreds include a top score of 390. \n“I like to play,” he says. “The more I can do that, the better. I’ve been blessed with the opportunity to play here and play as much as I can so hopefully I can score some runs and contribute to some wins.” \nCook has captained the Lions and South Africa A, and although Paul Collingwood will captain Durham’s four-day team and Jennings the 50-over side, that experience will be leant on. \n“I always take on the mantra that you should lead even if you don’t have the title,” he says. “That’s what I’ve tried to do, and with young guys like Jack Burnham in the side hopefully I can try and help them mentally and from a batting point of view. Read More Graeme Fowler says Durham new-boy Cameron Steel 'just needs to stick his head up and breathe' \n“I saw Jack bat in the nets on Tuesday and he’s off the back of a couple of hundreds. I’ve heard a lot of good things about him, so let’s hope that kicks on into the Championship on Friday. \n“Sometimes it’s quite nice to play without the captaincy and just throw some ideas into the pot. You want to add value in runs but in others way too – to the members and the players.” \nSouth Africa’s Apartheid era boycott meant Jimmy – an international team-mate of Jennings’ and Michael Richardson’s fathers – had to wait until the age of 39 to make his Test debut. A consistently prolific domestic record was not enough to see Stephen capped until he was 33. Little wonder then, that as South African internationals rush to England to cash in on Kolpak status before Brexit, he has not turned his back on his country. \n“I had that dream to play Test cricket,” he explains. “While you’d always be happy with one cap, once you’ve got it you want another one. I’ve thoroughly enjoyed the time I’ve played for South Africa. I just want to do everything possible to make that last as long as I can. When you’ve waited 17 years of your career (to play international cricket) you don’t want to just throw it away, you want to give it a full crack.” \nEleven caps in, he has a fight on for No.12. Cook lost his place after three poor Tests in New Zealand and Sri Lanka, and will want it back for July’s game against England at Lord’s. \n“That’s not my primary focus,” he insists. “I want to do well for the team I’m playing in and that means higher honours will take care of themselves. But it is better that I’m playing cricket rather than sitting at home in South Africa in the middle of winter waiting for the phonecall or not. At least the ball’s a little bit in my court and I can do something about it by putting a few hundreds on the board.” \nThe Saturday before the Lord’s Test, headquarters hosts England’s domestic 50-over final. \n“It wouldn’t be a bad way to end, would it?” says Cook. \nIt would be typical of Durham to do something like that. And to hear him speak, Cook sounds typically Durham. Like us on Facebook", "external_links": [], "published": "2017-04-13T18:00:00.000+03:00", "crawled": "2017-04-13T13:53:55.966+03:00", "highlightTitle": ""}