{"organizations": [], "uuid": "5a6f47337670e285fe46f255a4dac32edaa93259", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12956474.ece/ALTERNATES/s1200/JS118039510.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/omega-plastics-triumphs-company-year-12955279", "country": "GB", "domain_rank": 21960, "title": "Omega Plastics triumphs as Company of the Year at the North East Business Awards 2017", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Omega Plastics triumphs as Company of the Year at the North East Business Awards 2017", "spam_score": 0.0, "site_type": "news", "published": "2017-04-28T07:01:00.000+03:00", "replies_count": 0, "uuid": "5a6f47337670e285fe46f255a4dac32edaa93259"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/omega-plastics-triumphs-company-year-12955279", "ord_in_thread": 0, "title": "Omega Plastics triumphs as Company of the Year at the North East Business Awards 2017", "locations": [], "entities": {"persons": [{"name": "ingrid hagemann", "sentiment": "none"}, {"name": "bob cuffe", "sentiment": "none"}, {"name": "john pienaar", "sentiment": "none"}, {"name": "stephenson quarter", "sentiment": "none"}, {"name": "alfie joey", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "marmite", "sentiment": "none"}, {"name": "atomhawk", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "hardwick hall hotel", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "omega plastics", "sentiment": "negative"}, {"name": "cpd bodies ltd", "sentiment": "none"}, {"name": "karbon homes - middleton grange shopping centre  digital", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "business durham - transmission dynamics  manufacturing award", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "tees valley combined authority - tharsus group  company", "sentiment": "none"}, {"name": "invalid email  omega plastics group", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "trinity mirror north east", "sentiment": "none"}, {"name": "bbc news", "sentiment": "none"}, {"name": "metnor construction ltd", "sentiment": "none"}, {"name": "double eleven ltd", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "first square equipment ltd", "sentiment": "none"}, {"name": "virgin money - cleveland lgv training and transport  let", "sentiment": "none"}, {"name": "handelsbanken", "sentiment": "none"}, {"name": "newcastle international airport - double eleven ltd", "sentiment": "none"}, {"name": "cipd north east of england - egger uk ltd  best creative company", "sentiment": "none"}, {"name": "gentoo - daisy chain  services award", "sentiment": "none"}, {"name": "digital capital centre north east and tees valley - mediaworks", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "atom bank", "sentiment": "none"}, {"name": "university of sunderland - o’brien waste recycling solutions  heart", "sentiment": "none"}, {"name": "ithica films  not-for-profit organisation", "sentiment": "none"}, {"name": "tharsus group", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "cleveland lgv training and transport", "sentiment": "none"}, {"name": "omega plastics group", "sentiment": "none"}, {"name": "egger uk ltd", "sentiment": "none"}, {"name": "omega plastics group like", "sentiment": "none"}, {"name": "o’brien waste recycling solutions", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Omega Plastics triumphs as Company of the Year at the North East Business Awards 2017 Almost 600 people from the region's businesses attended the glittering grand final at Hardwick Hall Hotel Share North East Business Awards 2017 Grand Final. Company of the Year Omega Plastics Group Share Get business   Thank you for subscribing!   \nOmega Plastics Group topped a year of soaring success when it scooped the main prize at the grand final of the North East Business Awards 2017. \nThe cream of the region’s business community gathered at Hardwick Hall Hotel in Sedgefield to see Omega take the Company of the Year trophy, the final prize to be handed out at glittering event where winners also included Tharsus Group, Atomhawk and O’Brien Waste Recycling Solutions. \nWashington-based Omega Plastics - which was founded in Blyth , Northumberland , and also has a plant in Hartlepool – manufactures specialised equipment which is used throughout the healthcare, automotive and defence industries. \nThe award was the last of the night to be presented at the 15th annual event organised by the The Journal and its Teesside sister paper The Gazette, with Omega Plastics pipping Metnor Construction Ltd and CPD Bodies Ltd to the top prize. Read More Journal launches election manifesto to present business voice to candidates \nHeld in association with the North East England Chamber of Commerce, the awards shine a light on successes of companies large and small. \nThe marquee was packed around 600 people from businesses all over the region who came together to see 13 firms take away coveted trophies during a ceremony hosted by TV and radio presenters Ingrid Hagemann and Alfie Joey. Read More Saving the world one cup at a time - with help from a North East firm \nBob Cuffe, North East managing director for Trinity Mirror North East launched the night, telling guests: “These awards continue to be the biggest of their type in the country and are a celebration of our brilliant area and the great businesses that underpin it. It’s an absolute pleasure to recognise companies and the people who make them stand out in fiercely competitive marketplaces. \n“From Brexit to Trump, the falling pound to the rise in the price of Marmite, the last 12 months have been one of the most unpredictable times in recent memories. And we’re now faced with a General Election in 42 days. View gallery \n“North East companies are not immune to these unsettling factors, but they have typified the ‘Keep Calm, Carry On’ spirit made famous by a bookshop in Northumberland. \n“From Nissan committing to two new models in Sunderland to the development of Newcastle’s Stephenson Quarter, from the Teesside fightback to the launch of exciting new businesses like Atom Bank, the business community has got on with what it does best.” \nAfter entertainment from the guest speaker, BBC News’ deputy political editor John Pienaar, the awards ceremony began in earnest. Read More North East Business Awards LIVE: Updates from the 2017 grand final \nTwo of the categories - the Best Creative Award and Not-for-Profit Organisation of the Year - saw winners learn of their victory on the night, while all the other categories saw winners from the regional heats battle it out to win the overall prizes in their category. \nAmong the big wins was Cleveland LGV Training and Transport, which won Newcomer of the Year, and Middlesbrough-based Double Eleven Ltd, which won the Let’s Grow Award, while First Square Equipment Ltd took the Export Award and Egger UK Ltd triumphed in the Apprenticeship category. North East Business Awards 2017 Grand Final Full list of winners \nNewcomer of the Year, sponsored by Virgin Money - Cleveland LGV Training and Transport \nLet’s Grow Award, sponsored by Newcastle International Airport - Double Eleven Ltd \nExport Award, sponsored by Square One Law - First Square Equipment Ltd \nSmall Business Award, sponsored by Handelsbanken - Atomhawk \nApprenticeship Award, sponsored by CIPD North East of England - Egger UK Ltd \nBest Creative Company, sponsored by SMD - Ithica Films \nNot-for-Profit Organisation of the Year, sponsored by Gentoo - Daisy Chain \nServices Award, sponsored by University of Sunderland - O’Brien Waste Recycling Solutions \nHeart of the Community Award, sponsored by Karbon Homes - Middleton Grange Shopping Centre \nDigital and Social Media Award, sponsored by Digital Capital Centre North East and Tees Valley - Mediaworks UK \nInnovation Award, sponsored by Business Durham - Transmission Dynamics \nManufacturing Award, sponsored by Tees Valley Combined Authority - Tharsus Group \nCompany of the Year, sponsored by Sunderland City Council - Omega Plastics Group Like us on Facebook", "external_links": [], "published": "2017-04-28T07:01:00.000+03:00", "crawled": "2017-04-28T11:42:58.000+03:00", "highlightTitle": ""}