{"organizations": [], "uuid": "33a56da3dbc8be1641ab6fcda5e6046d6c91a5e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30247969/15939176.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/what-would-happen-if-i-spoke-the-truth-the-real-truth-opinion/story-30247969-detail/story.html", "country": "US", "title": "After my 45th birthday I got mugged on my way home: comment | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "After my 45th birthday I got mugged on my way home: comment | Devon Live", "spam_score": 0.212, "site_type": "news", "published": "2017-04-04T21:20:00.000+03:00", "replies_count": 0, "uuid": "33a56da3dbc8be1641ab6fcda5e6046d6c91a5e5"}, "author": "Devon Live", "url": "http://www.devonlive.com/what-would-happen-if-i-spoke-the-truth-the-real-truth-opinion/story-30247969-detail/story.html", "ord_in_thread": 0, "title": "After my 45th birthday I got mugged on my way home: comment | Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nDevonLive columnist Richard Monk is the owner of Saltcity - Exeter's first and last remaining surf shop. Last year he celebrated his 26th anniversary in business. Located in Fore Street, Saltcity has outlasted competition from both high street chains and other independents. \nThere have been plenty of highs and lows along the way, and you will get to hear about them and Richard's new adventures in his new monthly column told in his very own, and sometimes unique words. Here is his second offering... \nHere's my chance to speak again now that I've got a column with DevonLive, and to be honest, it's hard trying to the words when you have to. Finding something interesting and funny to talk about it seems is much harder than one thought. Little flippant comments, however, are far easier to come by. \nTalking about being honest, I wonder what the powers above would say if I spoke the truth – the real truth?! Or would my column be sent back with a, \"you can't say that!\", attached to me email? I wonder, if I could say how I feel about things on here like being truthful about events and happenings, whether you'd agree, disagree, or what type of response I'd get? \nI also wonder how many people really tell the truth? All of us, that I see, look like they're telling the truth, and I must look like I tell the truth, otherwise you wouldn't come through me Salty door. And you have been again and all it needed was for the sun to stick his head out, and what a time to spring himself upon us! \nThe day before Mother's Day, and the start of good ole BST – yipyar, where have ya bin, I missed ya – in you came, still bearing gifts. Jacki Lewis, bless her cottons, she brought me in a little tub of homemade bite sized cakes. I had one, me customers got the rest; nice on me lips, not so good for me hips. I've gotta be careful; the oceans getting warmer and I wanna climb outta that winter wetsuit and still fit into me summer suit. \nThere's still much kindness, thoughts and best wishes, regarding the amazing amount of support I received when Saltcity really did hit difficult times back in January, after a eight year period of the recession taking its toll. It looked like the end was indeed nigh, and then, courtesy of social media and many, many friends, loads of ya took over and steered me ship away from a very rocky coastline indeedy. I can't believe the nice things you're still saying after all this time and asking how things are going and if it's all gonna be okay? Well the answer is, as so many of you ask, is (I'm still ) in that cesspit, but you've given me a ladder, and I intend to use that ladder with utmost care, I can assure you. \nRead more : Keeping the Exeter salty ship afloat: comment \nAmong the acts of kindness was a while back someone sent though the post a John Lennon t-shirt. I've loved the Beatles from the age of when I can't remember not liking them ever o'clock. But Lennon's me man, he's ace. I was eight when he got shot, and I was living in Much Wenlock in Shropshire. I came downstairs and saw my mum upset and when I asked her what was wrong she told me John Lennon had been shot and killed. I remember asking who John Lennon was, and she said, 'one of the Beatles'. I was gutted because I loved the Beatles even before then, wishing that one day they'd get back together again. It was also the day I learned all of their names. From then I started to read about those four lads and Lennon shone from the very beginning. I don't know why. He just caught me and I've run with him ever since, and yes, I know, he wasn't the nicest of characters, but caught me he did. I wonder what he'd be making of it all now? Then again, I think I have a rough idea. \nSo when a Lennon t-shirt arrived for me in the post, from whom? I still do not know to this day, but not only did it make my day it also took me back to my childhood. \nThere's also been other gifts which have unexpectedly landed on my shop counter. On Wednesday, March 15, a pair of socks arrived with Mr Posty embroidered with Saltcity Surf Shop. Again, i do not know who sent them, but it's pretty crazy getting little gift sent to you, not that I'm moaning of course, but thank you, who ever you are!! \nI know the date was March 15, not just because it was the day after my 45th birthday, but because I got mugged on me way home. \nYup you wouldn't believe it. It happened to me, in broad daylight. I was walking down between the Post Office and Debenhams at around 5.15pm, and was consuming a veggie falafel wrap, merrily mindin' me own business when WHOOOSHHH!!!, it came right in from the right. BOSH!!! and exited to the left and stole me veggie wrap. I was not able to apprehend the culprit. Why? It was a bleedy seagull that's why! I've seen it happen on the telly and now it's happened to me. So I took one on the chin for ya. Keep your wits about you when yer eating out and you're walking thru de high street. You've been warned. \nRead next : 'Why I dumped horse s**t on my doctors' doorstep' \nI have also been walking past the Royal Clarence on a regular basis on the way to work to see what progress they make and I will continue to do so over the forthcoming months and years. It's gonna fascinate me watching her grow again from the ashes. Seeing the lorries reverse up there tho, to be filled with the blackened ashes of her soul, looking through the fencing, (which has some really interesting info on it about what they have done and gonna do, go and 'ave a read) seeing her windows, ancient oak beams charcoaled, chairs, tables and even mattresses slain over the floor is still a very sorry sight. Still, I'm hoping this time next month they will have finished the demolition period and it's back in the hands of the hoteliers and the rebuild will soon be starting. That's the bit that I'm looking forward to; Its regrowth as it rises up from the ashes. \nAnd that's also what I hope will happen to our country following Brexit. I personally voted to remain in, but we've left, so let's not panic and let's move on shall we? Why does it all have to be doom and gloom? it might be, just might be, the best thing that's happened to Great Britain in years. Surely if all the powers that be, that did all the knots up, can undo them as nicely as possible, it should all work out. After all, when we won the war in 1945 and most of Europe was on its knees, and Great Britain had the wotnots kicked out of her. We as a country didn't do too badly building ourselves back up, and helped rebuild much of Europe. Least we forget? \nSo it seems that after all, things ain't that bad. This is the perfect time of year for regrowth. Let's spring forward and keep watering the roots. \nBy Richard Monk ", "external_links": [], "published": "2017-04-04T21:20:00.000+03:00", "crawled": "2017-04-04T19:03:28.928+03:00", "highlightTitle": ""}