{"organizations": [], "uuid": "a47788d0fa7e2aa6a04f6818e9677693cf268e8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12944313.ece/ALTERNATES/s1200/CORBYN-NURSES.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-give-nurses-pay-rise-12943911", "country": "GB", "domain_rank": 21960, "title": "Labour will give nurses a pay rise if it wins the general election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Labour will give nurses a pay rise if it wins the general election", "spam_score": 0.0, "site_type": "news", "published": "2017-04-26T05:00:00.000+03:00", "replies_count": 0, "uuid": "a47788d0fa7e2aa6a04f6818e9677693cf268e8d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-give-nurses-pay-rise-12943911", "ord_in_thread": 0, "title": "Labour will give nurses a pay rise if it wins the general election", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jonathan ashworth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ashworth", "sentiment": "none"}], "locations": [{"name": "liverpool", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "news labour", "sentiment": "neutral"}, {"name": "labour", "sentiment": "neutral"}, {"name": "nhs", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour will give nurses a pay rise if it wins the general election Plans to give nurses a pay rise and restore bursaries for students if Jeremy Corbyn becomes Prime Minister Share Nurses on a hospital ward with Labour leader Jeremy Corbyn inset (Photo: PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNurses will get a pay rise under if Jeremy Corbyn becomes Prime Minister, Labour will announce. \nLabour would end the 1% cap on annual pay rises that has been in place since 2015 and followed years of pay freezes. \nBut Conservatives pointed out that their Government had increased health funding, and said only they could be trusted to grow the economy and raise the money the NHS needs. \nShadow Health Secretary Jonathan Ashworth will reveal the general election salary pledge at a speech to health workers an a Unison Health Conference in Liverpool. \nAnd he will also set out plans to introduce legislation requiring NHS trusts to consider patient safety when setting staffing levels in their hospitals. Labour says this would guarantee “safe staffing levels”. \nIt follows the government’s abolition of bursaries for student nurses and midwives, who were offered loans to help fund their training instead. \nMr Ashworth will say: “Our NHS staff are the very pride of Britain. \n“Yet they are ignored, insulted, undervalued, overworked and underpaid by this Tory government. \n“Not anymore. \n“Enough is enough. NHS protest march in Newcastle (Photo: Newcastle Chronicle) \n“NHS staff have been taken for granted for too long by the Conservatives. Cuts to pay and training mean hard working staff are being forced from NHS professions and young people are being put off before they have even started. Now Brexit threatens the ability of health employers to recruit from overseas. \n“What is bad for NHS staff is bad for patients too. Short staffing means reduced services and a threat to patient safety. Labour’s new guarantees for NHS staff will help keep services running at the standard which England’s patients expect. \n“I can pledge today that a Labour government will scrap the pay cap and give our NHS workers the pay they deserve.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-04-26T05:00:00.000+03:00", "crawled": "2017-04-26T00:15:52.000+03:00", "highlightTitle": ""}