{"organizations": [], "uuid": "51b6985b6094e250c8434abb120275944bf3af29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12951925.ece/ALTERNATES/s1200/jwr_mga_020215propnews.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-property-group-lsl-ahead-12951520", "country": "GB", "domain_rank": 21960, "title": "Newcastle property group LSL ahead of expectations despite sales dip", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle property group LSL ahead of expectations despite sales dip", "spam_score": 0.0, "site_type": "news", "published": "2017-04-27T18:18:00.000+03:00", "replies_count": 0, "uuid": "51b6985b6094e250c8434abb120275944bf3af29"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-property-group-lsl-ahead-12951520", "ord_in_thread": 0, "title": "Newcastle property group LSL ahead of expectations despite sales dip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "lsl", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "marsh & parsons", "sentiment": "none"}, {"name": "invalid email  newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle property group LSL ahead of expectations despite sales dip The group, which runs the Your Move and Reeds Rains brands, says the housing market has not seen any Brexit affect so far Share Reeds Rains providing advice and guidance (Photo: Publicity pic) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle property group LSL says it is trading ahead of expectations despite a drop in house sales in the last three months. \nThe group, which runs the Your Move and Reeds Rains brands, said it had seen a fall in sales in the first quarter of the year compared to the same period a year earlier, but that this was due to a surge in house sales in the first three months of 2016 in the run-up to a change in stamp duty regulations. \nIncome from the group’s estate agency division had dropped by 5.5%, LSL said, but there was growth in its lettings and financial services divisions. \nLSL said it was “too early” to say whether the vote to leave the EU would affect the housing market, but that it hadn’t seen any impact on its business so far. \nA company statement said: “LSL’s continuing estate agency strategy is to increase operating profit per branch; expand the number of Marsh & Parsons branches; grow recurring and where market conditions permit counter-cyclical income streams and evaluate selective acquisitions. \n“LSL’s continuing surveying strategy is to optimise contract performance and revenue generation from B2B customers, achieve further improvement in efficiency and capacity utilisation, use technology to target further improvements in customer satisfaction and performance and continue the graduate training programme. Read More Housing group to create 100 construction jobs as part of £32m new homes project \n“In addition to delivering on our stated strategy, as communicated at the 2016 Preliminary Results announcement and in the 2016 Annual Report and Accounts, we are also exploring options to capitalise on digital opportunities created by the growth in consumer acceptance of online and hybrid estate agency business models. We have made positive progress in Q1 2017.” Like us on Facebook", "external_links": [], "published": "2017-04-27T18:18:00.000+03:00", "crawled": "2017-04-27T14:43:12.000+03:00", "highlightTitle": ""}