{"organizations": [], "uuid": "52517a654747cca1637c21efe333b1c73aabe917", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11533015.ece/ALTERNATES/s1200/JS86940520.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mp-who-battled-12950495", "country": "GB", "domain_rank": 21960, "title": "North East MP who battled cancer returns to the Commons to take on Theresa May", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East MP who battled cancer returns to the Commons to take on Theresa May", "spam_score": 0.0, "site_type": "news", "published": "2017-04-27T15:00:00.000+03:00", "replies_count": 0, "uuid": "52517a654747cca1637c21efe333b1c73aabe917"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mp-who-battled-12950495", "ord_in_thread": 0, "title": "North East MP who battled cancer returns to the Commons to take on Theresa May", "locations": [], "entities": {"persons": [{"name": "grahame morris", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "negative"}, {"name": "david cameron", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "easington", "sentiment": "none"}, {"name": "church house", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "nestle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East MP who battled cancer returns to the Commons to take on Theresa May MP Grahame Morris attacks Conservative leader for refusing to take part in TV general election debates Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Theresa May was accused of “running scared” by failing to take part in TV election debates. \nEasington MP Grahame Morris l evelled the accusation at Conservative leader Theresa May in his first appearance in the House of Commons since receiving treatment for lymphatic cancer. \nHe has been away from Westminster since treatment began last year. \nThe question followed the Prime Minister’s refusal to follow the example of former Prime Minister Gordon Brown, who took part in debates with leaders of opposition parties in the 2010 general election. \nFormer Prime Minister David Cameron also participated in a TV debate with his opponents in the 2015 election, although he would only agree to appear in one. \nBut Mrs May has ruled out any TV debates alongside her rivals. She will take part in a “Question Time”-style televised debate where members of the public can ask her questions, but will not be appear alongside rival leaders such as Labour’s Jeremy Corbyn. British Prime Minister Theresa May \nMr Morris challenged her to take part in a debate at the Easington colliery miners welfare centre, saying she would see “the consequences of seven years of her policies on housing, of the cuts to policing and of 500 people at Walker’s losing their jobs”. \nHe said: “May I ask the Prime Minister why she is running scared of the televised leadership debates?” \nBut the Prime Minister said she regularly debated Mr Corbyn in the House of Commons, saying: “I have been in televised debates with the Leader of the Opposition week in and week out since I took over as Prime Minister, and I will be taking the fine record of this Conservative Government across all parts of this country.” \nThe exchange took place in the final session of Prime Minister’s Questions in Parliament before the general election on June 8. \nMrs May repeatedly highlighted her promise to provide “strong and stable leadership”, particularly when it comes to Brexit, if her Conservative Party wins the election. \nMr Corbyn replied: “Strong leadership is about standing up for the many, not the few. But when it comes to the Prime Minister and the Conservatives, they only look after the richest, not the rest. \n“They are strong against the weak and weak against the strong.” Labour leader Jeremy Corbyn speaks at an election campaign event in Church House, London (Photo: PA) \nBroadcasters may decide to go ahead without Mrs May, and hold debates involving the opposition party leaders. \nBut it now seems that Mr Corbyn could refuse to take part in any such broadcast. \nAsked whether Mr Corbyn would attend a TV debate which did not involve Mrs May, A Labour spokesman said: “Obviously, if you are talking about a debate about the possible outcomes of the election, you are talking about a debate between the Conservative Party and the Labour Party first and foremost. Read More Theresa May says the Government will help threatened Nestle staff find new jobs \n“To have a debate among the opposition parties doesn’t meet that objective at all. \n“I don’t think having a debate among opposition parties in any way meets the objective of giving the British people a chance of seeing what the real choices are in this election campaign. \n“Our challenge is to the Prime Minister to have the strength and guts to actually face a direct debate with Jeremy Corbyn on the issues facing the country and the issues of this election.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-04-27T15:00:00.000+03:00", "crawled": "2017-04-27T11:44:36.000+03:00", "highlightTitle": ""}