{"organizations": [], "uuid": "263a8348b781698b87a0198784e953af0026627f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12938584.ece/ALTERNATES/s1200/TONY-BLAIR.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tony-blairs-election-pledges-1983-12938528", "country": "IE", "domain_rank": 21960, "title": "Tony Blair's election pledges from 1983 re-emerge and show he has changed his tune on Brexit - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Tony Blair's election pledges from 1983 re-emerge and show he has changed his tune on Brexit - Chronicle Live", "spam_score": 0.167, "site_type": "news", "published": "2017-04-25T12:00:00.000+03:00", "replies_count": 0, "uuid": "263a8348b781698b87a0198784e953af0026627f"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tony-blairs-election-pledges-1983-12938528", "ord_in_thread": 0, "title": "Tony Blair's election pledges from 1983 re-emerge and show he has changed his tune on Brexit - Chronicle Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Blair's election campaign literature from Sedgefield in 1983 Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFormer Prime Minister Tony Blair hasn’t half changed his tune on Brexit since the heady days of 1983. \nA campaign leaflet from Mr Blair’s first election standing in Sedgefield in 1983 has resurfaced online. \nIn the Labour literature, the bouffanted Oxford University graduate declares he wants to leave the European Economic Community, which later became the EU. \nThe pamphlet said: “We’ll negotiate a withdrawal from the E.E.C. which has drained our natural resources and destroyed jobs.” \nThis is a contrast from his current anti-Brexit approach which has seen the famed politician come under fire. \nThe day Prime Minister Theresa May announced the snap election, Mr Blair, who is still a Labour party member, came out with a 1,200-word statement calling on voters to back any candidate who opposes Brexit. Tony Blair MP in June 1994 (Photo: Daily Mirror) \nMr Blair, who represented the Sedgefield constituency in County Durham from 1983 to 2007, has said he is “almost tempted” to return to politics amid the current situation. \nSpeaking to BBC Radio Four, Mr Blair said: “I look at the British political scene at the moment and I actually almost feel motivated to go back into it.” Read More Tony Blair: People should 'rise up' against Brexit \nStaunchly anti-Brexit, Mr Blair said the issue of leaving the EU is now “bigger than party allegiance” and warned Mrs May is on course for a “landslide” victory on June 8. \nA long serving Labour member, Mr Blair was parachuted into the safe Sedgefield seat when it was re-created in 1983 after being abolished in 1974. Tony Blair's election campaign literature from Sedgefield in 1983 (Photo: Unknown) \nThe working-class coal mining area of County Durham unsurprisingly elected Mr Blair as its MP with a majority of 47%. \nThis was the year before the miners’ strikes and Mr Blair won support with an election leaflet which declared: “Britain in general and the North East in particular have suffered appallingly under the misrule of Mrs Thatcher. Her hardline policies are both cruel and wrong.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now ", "external_links": [], "published": "2017-04-25T12:00:00.000+03:00", "crawled": "2017-04-25T07:39:13.000+03:00", "highlightTitle": ""}