{"organizations": [], "uuid": "ff98a24d120a32b9da56ad0b2a1c6a9f37ff335c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12825517.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/still-need-eu-migrants-north-12840135", "country": "GB", "domain_rank": 21960, "title": "We still need EU migrants in the North East after Brexit, MPs warn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "We still need EU migrants in the North East after Brexit, MPs warn", "spam_score": 0.0, "site_type": "news", "published": "2017-04-04T15:00:00.000+03:00", "replies_count": 0, "uuid": "ff98a24d120a32b9da56ad0b2a1c6a9f37ff335c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/still-need-eu-migrants-north-12840135", "ord_in_thread": 0, "title": "We still need EU migrants in the North East after Brexit, MPs warn", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mike kelly", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "staffordshire", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "negative"}, {"name": "state", "sentiment": "none"}, {"name": "commons committee", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "eu committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We still need EU migrants in the North East after Brexit, MPs warn Leaving the European Union won't necessarily mean cutting immigration because businesses still need EU workers, MPs claim Share An EU flag flying in front of the Houses of Parliament (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nBritish businesses will still need immigrants from EU countries after Brexit , according to MPs. \nA powerful Commons committee said the Government should consider rules which allow EU workers to bypass some immigration controls, so that it’s still easier to come here from an EU country than from other parts of the world. \nThe Commons Committee for Exiting the EU Committee said that leaving the EU would give the UK more control over immigration, but added: “The Government’s objective is to secure control of EU migration and this may not entail reducing numbers.” \nMPs said there could be regional immigration controls, so that migrants are invited to work in areas of the country where there are specific skills shortages. \nThey also slammed the Government’s claim that it would be better to walk away without an EU trade deal rather than accepting a bad deal. \nThe cross-party group said in a new report: “On our visits around the country, we have heard numerous requests from businesses for flexibility in a future immigration system to ensure that sectors currently reliant on EU workers do not face a sudden shortage of labour.” Prime Minister Theresa May in the cabinet signing the Article 50 letter (Photo: PA) \nThey added: “The impact of EU workers in the UK labour market has been profound, with significant employment of EU nationals in sectors as varied as seafood processing in Aberdeen, strawberry picking in Staffordshire, vets in Scottish abattoirs, digital skills in London, social care in Wales or daffodil pickers in Cornwall.” \nThe MPs said business leaders wanted it to be easy for EU workers to come here. \n“There was support for a ‘lighter touch’ immigration system for EU workers than for those from outside the EU. The Government would have to work out how it wished to introduce control of who came in and out.” Read More Brexit is not irreversible so don't let anyone tell you otherwise, says Mike Kelly \nThe MPs suggested there could be a specific work permit for EU migrants which employers, rather than migrants themselves, would apply for. \nAnd they said the immigration system for EU workers needed to be “flexible”, adding: “That flexibility should include considering whether immigration should be managed on a geographic basis.” \nThey highlighted comments from David Davis, the Secretary of State for Exiting the European Union , who have evidence to the inquiry last month and said migrant numbers would not necessarily fall as a result of Brexit. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-04-04T15:00:00.000+03:00", "crawled": "2017-04-04T10:37:57.152+03:00", "highlightTitle": ""}