{"organizations": [], "uuid": "7a28f1da7ebbfee6ce1582f5378154d9ecf9d0f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12964473.ece/ALTERNATES/s1200/ncjmedia-Tark-Library-2010.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/alan-lyddiard-returns-northern-stage-12962800", "country": "GB", "domain_rank": 21960, "title": "Alan Lyddiard returns to Northern Stage with a special theatrical production", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Alan Lyddiard returns to Northern Stage with a special theatrical production", "spam_score": 0.0, "site_type": "news", "published": "2017-04-30T01:00:00.000+03:00", "replies_count": 0, "uuid": "7a28f1da7ebbfee6ce1582f5378154d9ecf9d0f6"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/alan-lyddiard-returns-northern-stage-12962800", "ord_in_thread": 0, "title": "Alan Lyddiard returns to Northern Stage with a special theatrical production", "locations": [], "entities": {"persons": [{"name": "alan lyddiard", "sentiment": "positive"}, {"name": "joanna) holden", "sentiment": "none"}, {"name": "alan", "sentiment": "none"}, {"name": "tim wheeler", "sentiment": "none"}, {"name": "mind the gap", "sentiment": "none"}, {"name": "romeo", "sentiment": "none"}, {"name": "joyce nga yu lee", "sentiment": "none"}, {"name": "jez colborne", "sentiment": "none"}, {"name": "don quixote", "sentiment": "none"}, {"name": "mark calvert", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}, {"name": "denis darzacq", "sentiment": "none"}, {"name": "joey", "sentiment": "none"}, {"name": "juliet", "sentiment": "none"}, {"name": "jez", "sentiment": "none"}], "locations": [{"name": "northern stage", "sentiment": "none"}, {"name": "bradford", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "baltic", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "jerez de la frontera", "sentiment": "none"}, {"name": "louvre", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "hatton pavilion", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "twisting ducks", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "la visite", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle playhouse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Alan Lyddiard returns to Northern Stage with a special theatrical production The man who ran the Newcastle company for over a decade returns with Contained, featuring learning disabled performers Share Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA former boss of Northern Stage returns to his old stamping ground with a typically eye-catching production. \nContained, which combines live performance, film, music and dance, is directed by Alan Lyddiard. \nAlan spent 14 years as artistic director of Northern Stage, steering it out of the doldrums and putting on some shows that delivered a thump to the solar plexus (in particular I’m remembering Animal Farm, A Clockwork Orange and Nineteen Eighty-Four). \nContained, billed as “vibrant, compelling and personal”, comes from Mind the Gap, an acclaimed Bradford-based theatre company which provides a platform for performers with learning disabilities. \nDuring a rehearsal break in Bradford, I catch up with Alan on the phone. \nHe does a lot of work in that city these days, he says, and also in Leeds. But for much of each year he lives in southern Spain, in the city of Jerez de la Frontera, of which he paints an idyllic picture. \nWorrying a little about the effects of Brexit, he tells me: “I don’t want us to leave the (European) Union because I do love living in this city which is full of real Spanish people.” A scene from Contained (Photo: Northern Stage) \nFor the moment, though, these considerations have been pushed to the back of his mind as he fine-tunes his performers for yet another stop on this Arts Council-funded tour of Contained. \nThey have learning disabilities including Down’s syndrome and autism, says Alan, but clearly that doesn’t mean they can’t produce first class work for the theatre. \nHe gives special mention to keyboard player Jez Colborne who has a genetic condition called Williams syndrome but is a “fantastic musician”. \nJez was in a production of Don Quixote which sowed the seed for this latest production when Alan was still at Northern Stage. \n“It was a co-production with Mind the Gap, when it was run by Tim Wheeler, and it was a small scale touring show,” recalls Alan. \n“Both Mind the Gap and Northern Stage were ensemble companies and we thought it would be really interesting to develop work together, so we did this version of Don Quixote with three performers from each company. \n“It toured very successfully in 2003.” Read More The new Hatton Pavilion has begun a regional tour outside Baltic in Gateshead \nBut Alan says his interest in this kind of work began even earlier with a Northern Stage production of Romeo and Juliet in 1999. \n“It was a very controversial piece of work and I’m sure I nearly lost my grant as a result. \n“But I thought it would be interesting if there were two people playing Romeo and Juliet who had a learning disability and weren’t really allowed to fall in love. \n“I didn’t use people with a learning disability. I used Joey (Joanna) Holden and Mark Calvert but they played characters who were different. \n“Since that time, though, there has been a conversation with Mind the Gap and when Tim left I was asked to work with them on the next stage of their development. \n“I suggested they shouldn’t appoint a new artistic director but should work with a range of different artists. \n“They took that idea on board and asked me to produce a piece of theatre which turned out to be Contained.” A scene from Contained (Photo: Northern Stage) \nIt started, says Alan, with the performers at Mind the Gap talking about themselves. \n“We created a piece based on their stories and lives so it became a reflection of them. It was different to what Mind the Gap had done in the past, developing well known stories such as Don Quixote and Of Mice and Men.” \nThe conceit of this new piece, Alan explains, is that a group of people with learning disabilities is creating an art installation with music and a performance will mark its completion. \n“As they are assembling it and rehearsing, they tell stories about their lives and who they are. It’s all interwoven in a piece of narrative.” \nInput also came from the French film-maker and photographer Denis Darzacq who has worked closely with Mind the Gap, helping to make a piece of work called La Visite that was staged at the Louvre in Paris. \nAlan came to Northern Stage in 1991, just after a damning Arts Council revealed it was the most heavily subsidised theatre, per audience member, in the country. That’s because audiences had been so tiny. \nAlan made the company exciting, took some risks, had some flops but plenty more hits, and saw its name transferred to the theatre which had previously been called Newcastle Playhouse. He left in 2005 before the major refurbishment which turned it into the building you see today. \n“I’m really excited to be coming back and putting something in one of the new spaces,” he says. Read More Authors descend on the North East as two book festivals get under way today \n“There are lots of people in Newcastle that I remember very fondly and I hope they remember me a little bit as well. It’s a long time since I left but I like to think I made an impact there.” \nAs well as the Newcastle performances of Contained there’s a related programme of events. \nThis includes, on Friday, May 5, a morning workshop led by Alan and Mind the Gap resident director Joyce Nga Yu Lee looking at the techniques used in the show and an afternoon session called Tea and Trailers, showing the “brilliant diversity” of disability arts \nOn Saturday evening a Performance Platform offers the chance to see local aspiring learning disabled artists performing new work. They come from organisations like Lawnmowers, Twisting Ducks, Tin Arts and Headway Arts – all, according to Alan, doing great work. \nThe aim with Contained, says Alan, was to create “a beautiful piece of theatre”. \nHe adds: “It’s not about banging on about learning disabilities, it’s about producing a piece of quality theatre that anybody would like to see.” \nBack in 1991, when I interviewed Alan ahead of his arrival in Newcastle, he said: “You can actually create beautiful art and get people who in the past have perceived that it’s not for them heavily involved. It can enhance their lives.” \nMany times in Newcastle he proved that to be the case and it seems his tune hasn’t changed. \nSee Contained at Northern Stage from May 4-6 (Thursday to Saturday). Tickets: www.northernstage.co.uk or tel. 0191 230 5151. Like us on Facebook", "external_links": [], "published": "2017-04-30T01:00:00.000+03:00", "crawled": "2017-04-29T20:32:34.000+03:00", "highlightTitle": ""}