{"organizations": [], "uuid": "5bffaf6c1cc58206d64755bcd840b7d7086daaee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30295011/15973743.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/a-letter-from-ben-bradshaw-a-vote-for-me-will-not-affect-who-governs-nationally/story-30295011-detail/story.html", "country": "US", "title": "A letter from Exeter MP Ben Bradshaw: A vote for me will not affect who governs nationally | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "A letter from Exeter MP Ben Bradshaw: A vote for me will not affect who governs nationally | Devon Live", "spam_score": 0.009, "site_type": "news", "published": "2017-04-26T18:40:00.000+03:00", "replies_count": 0, "uuid": "5bffaf6c1cc58206d64755bcd840b7d7086daaee"}, "author": "Devon Live", "url": "http://www.devonlive.com/a-letter-from-ben-bradshaw-a-vote-for-me-will-not-affect-who-governs-nationally/story-30295011-detail/story.html", "ord_in_thread": 0, "title": "A letter from Exeter MP Ben Bradshaw: A vote for me will not affect who governs nationally | Devon Live", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "met office", "sentiment": "none"}, {"name": "party", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "medical school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (2) \nSo, here we go again. Another election, early and unnecessary, that some of us predicted, but the Conservatives promised repeatedly, including just before Easter, would never happen. \nThe Government already has a solid majority and can do what it likes, so the election-weary public have every right to ask why? \nThe simple brutal answer is the Conservatives see the chance to turn a working majority into a landslide. If the opinion polls are right (and remember, whenever they've been wrong before, they have underestimated the Conservative lead) we're looking at a rout. On the current national polling, the Tories would take back Exeter – leaving the South West a one-party state. \nIt is worth considering that for a moment. No MP from our region to challenge Government policy on the NHS, schools or other public services. No-one to hold them to account for all the promises they made in 2015 of lavish investment in the Westcountry, which they've failed to keep. No-one to stand up for jobs, investment and living standards and the importance of continued full access to the Single Market and Customs Union in any Brexit deal. \nRead more: Ben Bradshaw asks Exeter public to 'back his record' as he confirms he will stand for re-election \nIf you believe it's important for the health of our democracy to have at least someone at Westminster asking these vital questions and providing some challenge, I hope, that whatever your normal political colour, you will consider voting for me in Exeter in this election. \nI am extremely proud of what we have achieved together in the last 20 years. Great new schools, a massively improved college, a top university. The Met Office and new Medical School, flourishing businesses. Exeter's productivity has grown faster than any city in Britain. This hasn't happened by accident. It has been a huge privilege to represent this wonderful city and I'm asking for the chance to continue my work. \nWhen you vote on June 8 th you are electing the person you want to be your local MP for the next five years. You are not electing a Party leader or a Government. Exeter is not a seat the Conservatives need to win to stay in power or even to have a significantly increased majority. So supporting me in Exeter will not affect who governs nationally. \nIf I am re-elected I will continue to put Exeter's interests first. I will fight for the best possible Brexit deal that protects jobs, investment and living standards in our city. I will oppose the Conservatives' plans for even more cuts to our NHS, social care, schools and other public services. I will campaign for more social and affordable housing for local people to buy and rent. I will never take risks with our security or defence and will support the fight against terrorism. I will only support economic policies that are responsible and credible. \nYou know from my record that I keep my promises and am prepared to vote independently of my Party when I believe they are wrong. \nThis is my personal manifesto to Exeter and to you. ", "external_links": [], "published": "2017-04-26T18:40:00.000+03:00", "crawled": "2017-04-26T13:38:26.000+03:00", "highlightTitle": ""}