{"organizations": [], "uuid": "77a5639d9b946e3172592d8d10cb92ec0039b2b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12962273.ece/ALTERNATES/s1200/UKIP-Leader-Paul-Nuttall-Launches-Their-General-Election-Campaign.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/history-prove-right-burqa-ban-12962280", "country": "IE", "domain_rank": 21960, "title": "History will prove me right about the burqa ban, says UKIP leader Paul Nuttall - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "History will prove me right about the burqa ban, says UKIP leader Paul Nuttall - Chronicle Live", "spam_score": 0.049, "site_type": "news", "published": "2017-04-29T12:00:00.000+03:00", "replies_count": 0, "uuid": "77a5639d9b946e3172592d8d10cb92ec0039b2b7"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/history-prove-right-burqa-ban-12962280", "ord_in_thread": 0, "title": "History will prove me right about the burqa ban, says UKIP leader Paul Nuttall - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "paul nuttall", "sentiment": "negative"}, {"name": "david nuttall", "sentiment": "none"}, {"name": "kate hoey", "sentiment": "none"}, {"name": "steven woolfe", "sentiment": "none"}, {"name": "nigel [farage", "sentiment": "none"}, {"name": "mike hookem", "sentiment": "none"}, {"name": "james carver", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}, {"name": "david nuttal", "sentiment": "none"}], "locations": [{"name": "strasbourg", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "vauxhall", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "newcastle west end foodbank", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "invalid email  ukip", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News History will prove me right about the burqa ban, says UKIP leader Paul Nuttall UKIP leader tells the Chronicle that he has no regrets about calling for a ban on full face veils Share Click to play Tap to play The video will start in 8 Cancel Play now In 90 seconds: Corbyn v May in final PMQs before the election Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nUKIP leader Paul Nuttall has insisted history will prove him right over his proposal to ban full face coverings such as the burqa. \nAnd he predicted that a ban could be UK law within a decade. \nMr Nuttall has been criticised after announcing that a ban on full face veils would be a key plank in UKIP’s general election manifesto, with MEP James Carver resigning as the party’s foreign affairs spokesman in protest. \nBut speaking to the Chronicle , Mr Nuttall said he stood by the proposal - and insisted it would benefit women from Muslim communities. \n“My view is if you want to enjoy the full fruits of our great society then you have to show your face. \n“If you look at the statistics, for example, regarding the economic inactivity of Muslim women, its 58 per cent nationally. I think it’s 70 per cent for Pakistani and Bangladeshi women in the West Midlands. \n“So in effect they are being cut off in many ways from employment opportunities, by not being willing to show their faces. \n“Then of course there’s the security aspect surrounding the fact that people aren’t showing their faces as well, because whether we like it or not, there is more CCTV in Britain than anywhere else per head. And in order for that be effective you have to see people’s faces.” \nHe said his proposals would “help integration and help break down the divisions that we have at the moment”. UKIP Leader Paul Nuttall (Photo: Getty Images Europe) \nMr Nuttall said the UK was failing to integrate some ethnic minority communities. \n“There are particular people and particular communities who never come into contact with anyone else from a different community and don’t learn about different communities. \n“Demographically we are changing as a country, massively. And something has to be done now, otherwise we are cooking up a whole load of problems down the line. \n“We [UKIP] have been radical on this. We have been brave in many ways. But I don’t regret what I’ve said on these issues. I just think it’s an issue that either gets tackled now, or it gets tackled down the line. \n“And I suspect that what we’re saying will no doubt be either be the policies of the establishment parties or indeed government policy within the next decade.” \nMr Nuttall said UKIP would stand candidates across the country in this general election - but would focus resources on a small number of seats where it believed it could win, campaigning “like a by-election” in each target constituency. \n“What we have learned from the 2015 experience is that there are no prizes for second place. \n“So we will be targeting, and targeting ruthlessly, to ensure that we can get more people over the line than we did in 2015.” \nHe declined to reveal how many seats would be targeted in this way. \n“Of course there will be a limited number because we will focus our resources and manpower. I cannot give you an exact number on that. \n“We will be putting up candidates across the country. \n“But we will be really homing in on places where we are strong.” Read More Newcastle West End Foodbank opens new city centre collection point \nUKIP would win seats in the North, despite failing to do so in the 2015 election, he said. \nUKIP will refuse to stand candidates in seats where a Brexit-supporting MP from a rival party is standing for re-election and has a chance of losing to a pro-EU opponent, Mr Nuttall said. \nHe said decisions about where to stand aside would be taken by the party leadership in consultation with local activists. \nBut he named David Nuttall, Conservative MP in Bury North, and Kate Hoey, Labour MP in Vauxhall, both known for their opposition to the EU, as MPs UKIP would not oppose. \n“If there is a Brexiteer with a slender majority and there is the opportunity that they will lose the seat to a remainer, then the UKIP branch will indeed be asked if it is a good idea to stand aside. \n“We are talking tens of seats, not hundreds.” \nHe added: “Someone like David Nuttal in Bury North. I think it would be counterproductive if UKIP stood and stopped David Nuttall from being re-elected, or indeed someone like Kate Hoey.” \nMr Nuttall acknowledged that UKIP had been divided, saying it was a “young party” and was still “growing up”. \nIncidents have including a confrontation in Strasbourg last year, in which UKIP MEP Steven Woolfe was treated at hospital following a clash with fellow UKIP MEP Mike Hookem. \nMr Nuttall said: “UKIP hasn’t covered itself in glory, particularly in those months between Nigel [Farage] standing down [as leader] and me coming in.” \nHe added: “We had the altercation in Strasbourg, Which I missed. \n“I was the leader of the UKIP MEP group. I should have been chairing that meeting. \n“But unfortunately I was back in the UK having dental work. \nSo like all of you I was watching that on the telly, literally with my head in my hands asking ‘what are they doing?’ \n“Obviously it painted the party in a bad light, and we’ve got to sort that out, let’s be honest. \n“We are still a young party political, compared to the establishment parties, and I think it’s all been part of our growing up.” Like us on Facebook ", "external_links": [], "published": "2017-04-29T12:00:00.000+03:00", "crawled": "2017-04-29T07:23:42.000+03:00", "highlightTitle": ""}