{"organizations": [], "uuid": "f28991812cff550e7be8d45acd7dfb9b7ad38354", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12910641.ece/ALTERNATES/s1200/Theresa-May-Statement.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/early-election-theresa-mays-chance-12910654", "country": "GB", "domain_rank": 21960, "title": "Early election is Theresa May's chance to grind Labour into dust", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Early election is Theresa May's chance to grind Labour into dust", "spam_score": 0.0, "site_type": "news", "published": "2017-04-19T01:10:00.000+03:00", "replies_count": 0, "uuid": "f28991812cff550e7be8d45acd7dfb9b7ad38354"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/news-opinion/early-election-theresa-mays-chance-12910654", "ord_in_thread": 0, "title": "Early election is Theresa May's chance to grind Labour into dust", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Early election is Theresa May's chance to grind Labour into dust Theresa May claims election is to save Brexit but it's about destroying Labour, says our Political Editor Jonathan Walker Share Click to play Tap to play The video will start in 8 Cancel Play now Theresa May calls general election for June 8 Share this video Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nTheresa May is demanding an early general election in order, she says, to save Brexit . \nRevealing plans for a poll in her statement outside Downing Street, she suggested Brexit was under threat from Labour and Liberal Democrat MPs, as well as members of the House of Lords, who were out to overturn the result of last year’s EU referendum. \nAn election giving her a larger majority in the House of Commons would make it easier for her to ignore the “political game-playing” of the opposition parties, she said. \nAnd although she didn’t spell this out, it would also help her win battles against the House of Lords. \nThe convention at Westminster is that the Lords will not attempt to block any measure that a Government included in its general election manifesto. \nFor Mrs May , turning the election into a second Brexit referendum is appealing. Prime Minister Theresa May leaves no.10 Downing Street in London (Photo: PA) \nShe’s managed to make the Conservatives the party of Brexit - even though both Mrs May and the Tory leader at the time, David Cameron, campaigned to stay in the EU during the 2016 referendum. \nAnd we know that the country wants to quit the EU. \nPolls suggest that even many people who voted “remain” in the referendum now just want the whole thing over and done with. \nIt also suits the Liberal Democrats for this election to focus on Brexit. Read More Democracy is not seeing its finest hour - and that should alarm Remainers and Brexiteers \nThey have carved out a niche as the most pro-EU of the major parties in England (the SNP back EU membership for an independent Scotland). \nThe Lib Dem demand for a second EU referendum probably has the backing of a minority of voters, but it might be a sizeable enough minority for them to gain seats. \nMeanwhile, the challenge for Labour is to change the subject on to issues such as school funding, the NHS and the troubled state of our transport system. Labour party leader Jeremy Corbyn (Photo: Getty Images Europe) \nLabour’s position on Brexit may be sensible. It doesn’t exactly support leaving, but it accepts the result of the referendum and says the Government’s task now is to make the best of it. \nThere are voters who agree with that view. But it’s hard to explain, and uninspiring. \nOn other topics, however, Labour’s position is much stronger. \nSchool funding per pupil is being cut in real terms (ie, once you take inflation into account). Read More Beware the patriotism peddled by scoundrels at home and abroad \nAnd the National Audit Office, the official and independent spending watchdog, has warned that NHS “financial problems are endemic and this is not sustainable”. \nWhich party is best placed to deal with these problems is a matter of debate, of course. But the NHS faces a funding crisis which the present government has not so far solved. \nAnd is it really true, as Mrs May claims, that an election is needed because of Brexit? British Prime Minister, Theresa May, greets The President of the European Council, Donald Tusk, on the doorstep of 10 Downing Street (Photo: Getty Images Europe) \nMrs May said: “Our opponents believe because the government’s majority is so small, that our resolve will weaken and that they can force us to change course. They are wrong.” \nHowever, so far she’s had little problem winning key votes in Parliament. There’s been debate, and opposition parties have put down amendments to try to force changes, but the Government has won in the end. \nLabour argues that Mrs May’s real motive for calling the election is that she knows some bad news is coming, perhaps on the economy, and wants to go to polls before it arrives. \nBut it’s hard not to suspect that she simply thinks she’ll never get a better chance to grind Labour into the dust. Recent opinion polls suggest Labour is going to lose this election, and lose it heavily. \nI suspect the public may actually grow to like Labour leader Jeremy Corbyn a bit more once they see him in a general election campaign. \nThe broadcast media, in particular, will have to spend more time letting him explain what he stands for and what sort of policies he hopes to put into practice. \nEven if they grow to like him, however, it remains to be seen whether voters will come to regard Mr Corbyn as a credible candidate to be Prime Minister. \nIf they don’t, then this election could be very bad for Labour indeed. Like us on Facebook", "external_links": [], "published": "2017-04-19T01:10:00.000+03:00", "crawled": "2017-04-19T01:50:06.000+03:00", "highlightTitle": ""}