{"organizations": [], "uuid": "7199a336fea4d54e51534068493bdaad25082953", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.exeterexpressandecho.co.uk/images/localworld/ugc-images/276269/site/sitelogoimage-1391102248963.png", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/bid-to-create-regional-stem-base-at-exeter-science-park/story-30289750-detail/story.html", "country": "US", "title": "Bid to create regional STEM base at Exeter Science Park | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Bid to create regional STEM base at Exeter Science Park | Devon Live", "spam_score": 0.001, "site_type": "news", "published": "2017-04-24T18:58:00.000+03:00", "replies_count": 0, "uuid": "7199a336fea4d54e51534068493bdaad25082953"}, "author": "", "url": "http://www.devonlive.com/bid-to-create-regional-stem-base-at-exeter-science-park/story-30289750-detail/story.html", "ord_in_thread": 0, "title": "Bid to create regional STEM base at Exeter Science Park | Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bid to create regional STEM base at Exeter Science Park By HannahFinch | Posted: April 24, 2017 0 COMMENTS SHARES Bid to create regional STEM base at Exeter Science Park X \nCopy link to paste in your message / Comments (0) \nThree thousand of the region's best paid jobs could be created in ambition growth plans for Exeter Science Park . \nIn her first report as Chief Executive, Dr Sally Basker says that her first priority is to create a growth strategy to turn big ambitions into reality, making the park a major meeting point for STEM across the region. \nExeter Science Park is home top ambitious STEM companies \nShe said: \"This partnership foresees around 3000 people on the Science Park working in high-growth STEM-based companies with a combined turnover approaching £500million. Even at this early stage, everybody recognises that the Park has huge potential due to its geographical location, its transport links, its world renowned knowledge base, the existing business base across the region and the exciting tenants already on the Science Park. We need a strategy that realises this potential by working with existing and future partners and stakeholders.\" \nREAD NEXT: South West is ready to grow as new Brexit era dawns \nExeter Science Park is a result of a partnership between Devon County Council, Exeter City Council, East Devon District Council and the University of Exeter. \nThe construction of nearly 30,000 sq ft of office space is due to start in the next three months creating the first 'street' on the Science Park. \nShe said: \"We will be looking to ensure the right amenities are in place to support the culture and make this an attractive and enjoyable place to work. \n\"We're expecting significant demand given early interest, the lack of top quality accommodation in the region and the park's STEM focus.\" \nPlans are also underway to create a 'Global Environmental Futures' cluster for around 20,000 square feet of Open Innovation Building next to the Met Office's new supercomputer. the aim of open innovation is to maximise the value of a firm's intellectual property by making it available to others and accelerating business opportunities. \nREAD NEXT: How Exeter Airport is helping the region fly \n\"I hope that this is going to embed further a culture of collaboration and high-productivity on the park,\" she said. \nThe Exeter and East Devon Enterprise Zone opened this month offers business rate relief for new and growing businesses worth up to £55,000 year-on-year for a period of five years. It will also provide simplified planning, business support and investment in key infrastructure. NEWS", "external_links": [], "published": "2017-04-24T18:58:00.000+03:00", "crawled": "2017-04-24T13:40:01.000+03:00", "highlightTitle": ""}