{"organizations": [], "uuid": "b3712ced0b767abbb7b2dcfdca49eef196b913ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9966530.ece/ALTERNATES/s1200/JS53427425.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12835924", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: AkzoNobel boss defends rejecting takeover offer by PPG", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: AkzoNobel boss defends rejecting takeover offer by PPG", "spam_score": 0.0, "site_type": "news", "published": "2017-04-04T14:55:00.000+03:00", "replies_count": 0, "uuid": "b3712ced0b767abbb7b2dcfdca49eef196b913ca"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12835924", "ord_in_thread": 0, "title": "Business Breakfast LIVE: AkzoNobel boss defends rejecting takeover offer by PPG", "locations": [], "entities": {"persons": [{"name": "bill burkland", "sentiment": "none"}, {"name": "chris blaxall", "sentiment": "none"}, {"name": "blaxall", "sentiment": "none"}, {"name": "nick beighton", "sentiment": "none"}, {"name": "alistair wyse", "sentiment": "none"}, {"name": "paul fellows", "sentiment": "none"}], "locations": [{"name": "hamburg", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "baltimore", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "performance horizon", "sentiment": "negative"}, {"name": "ppg key event newcastle", "sentiment": "negative"}, {"name": "citi", "sentiment": "none"}, {"name": "barclaycard", "sentiment": "none"}, {"name": "emea", "sentiment": "none"}, {"name": "jonathon manning asos", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "amazon business uk", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "lloyds bank", "sentiment": "none"}, {"name": "asos", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "amazon business", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Newcastle tech firm Performance Horizon opens in Hamburg and considers China launch \nA Newcastle company tipped to become a $1bn tech ‘unicorn’ is opening its eighth office in Hamburg , and is considering a base in China. \nNewcastle’s Performance Horizon, which tracks online sales and pays third parties commission for transactions, has launched the office in Germany with two members of staff but expects to have grown the team to five or six by the end of 2017. \nThe companies, which was earlier this year included on the Future Fifty list of the country’s most promising tech firms, already has offices in New York, San Francisco, Baltimore, Sydney, Tokyo and London, as well as its base on Forth Banks. \nThe Hamburg office will be its first location in mainland Europe, while it operates in Brazil and China through sub-contracted teams. \nSpeaking to The Journal, CFO Chris Blaxall said: \nTo date our sales and marketing efforts is all based out of London in terms of the EMEA market as a whole. The vast majority of our customers are UK based and all of that has been managed out of the London office. \nIn terms of looking at where we should put additional sales, marketing, and customer success people to continue to grow our business we looked at all the markets around and we felt that Germany was a very sensible market in which to take the next step in terms of mainland Europe. \nAs the company looks to grow further, Mr Blaxall said that it is considering opening up its own office on the ground in China. \nHe said: \nChina is certainly a market we are looking at. \nWe are not committing to going there and putting people on the ground right at this stage, but it is certainly one we are looking at as another potential. L-R: Paul Fellows, Alistair Wyse and Chris Blaxall of Performance Horizon 8:24 Jonathon Manning Asos profits rise 14% amid international sales surge after Brexit pound collapse \nAsos has posted a jump in half-year profits, boosted by a significant surge in international sales following the collapse in sterling. \nThe online fashion retailer said pre-tax profits rose 14% to £27.3m in the six months to February 28, while revenue increased 37% to £911.5m. The Brexit-battered pound helped international sales soar 54% to £548.4 million. \nThe company said: \nAs a net exporter, sterling weakness has created a foreign exchange tailwind for the business which has enabled investment above previously planned levels into both price and proposition. \nAs a result, Asos has again upgraded its sales guidance for the full year, pencilling in growth in the 30%-35% range, up from 25%-30%. In the UK, where Asos flagged a “more promotional market”, retail sales rose 18% to £340.8m. \nChief executive Nick Beighton said: \nThese are a strong set of results, showing great progress across the business. International growth of 54% has been excellent and with the Rest of the World segment a stand-out performer. \nGiven the current momentum we are seeing, Asos is making good progress towards its ultimate goal of becoming the world’s number one destination for fashion-loving 20-somethings. Asos posted a jump in half-year profits, boosted by a significant surge in international sales following the collapse in sterling (Photo: Tim Goode/PA Wire) 8:18 KEY EVENT Amazon eyes slice of £96bn business-to-business market \nAmazon plans to claim a slice of a multibillion-pound marketplace by launching a new UK business-to-business venture. \nAmazon Business has set its sights on small companies, multi-nationals, hospitals, universities and not-for-profit organisations with an online hub offering millions of trade products. \nLaunching today, the procurement service will provide industry supplies, such as laptops, power tools, pressure washers and laboratory equipment. \nIt comes after online retail sales in the UK’s B2B market reached £96.5bn in 2015, according to figures from the Office for National Statistics. \nBill Burkland, head of Amazon Business UK, said the new store combined more than 100m products with a new set of business features, from reporting and analytics to spending limits and purchasing workflow approvals. \nAmazon plans to link up with UK companies behind specialist industry products, offering them the chance to export their goods overseas through the company’s vast distribution network. It means British companies with no export operation can capitalise on a growing global demand for British products triggered by the Brexit-hit pound. \nSterling’s slump since the EU referendum vote has presented an opportunity for British exporters by making UK goods cheaper on international markets. \nAmazon said the new B2B service would provide VAT invoices and VAT-exclusive prices, while allowing multiple users to take charge of a business account. The US retail giant will also offer more detailed transaction data - such as the name of the product bought by the business - when customers use a Visa Commercial Card issued by Barclaycard, Citi, HSBC, or Lloyds Bank. \nAmazon Business clocked up more than $1bn (£801m) in sales in its first year following the America launch in April 2015. The first European operation was rolled out in Germany at the end of 2016 and has more than 50,000 business customers and 10,000 business sellers. The Amazon logo (Photo: PA) 8:13", "external_links": [], "published": "2017-04-04T14:55:00.000+03:00", "crawled": "2017-04-04T10:38:03.720+03:00", "highlightTitle": ""}