{"organizations": [], "uuid": "6f5d73accfdf6e36b1cbcd33ddaf12f9638343df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12922525.ece/ALTERNATES/s1200/THERESA-MAY-NOT-POPULAR.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-build-up-live-12965682", "country": "GB", "domain_rank": 21960, "title": "General Election build-up LIVE: Sunday politics updates including North East local elections", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "General Election build-up LIVE: Sunday politics updates including North East local elections", "spam_score": 0.0, "site_type": "news", "published": "2017-04-30T16:05:00.000+03:00", "replies_count": 0, "uuid": "6f5d73accfdf6e36b1cbcd33ddaf12f9638343df"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-build-up-live-12965682", "ord_in_thread": 0, "title": "General Election build-up LIVE: Sunday politics updates including North East local elections", "locations": [], "entities": {"persons": [{"name": "kenton comprehensive", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tom eden may", "sentiment": "none"}, {"name": "fallon", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "marr  theresa may", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "tom eden more tory", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "marr", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "mike kelly", "sentiment": "none"}, {"name": "michael fallon", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "gibraltar", "sentiment": "none"}, {"name": "falkland islands", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "national audit office", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nThat’s all for today’s live coverage, thank you very much for joining me. \nFor all the day’s latest breaking news, click here. 13:24 KEY EVENT May slammed by nurses \nThe Royal College of Nursing (RCN) has criticised Theresa May’s answer about nursing pay and foodbanks on the Andrew Marr show. \nRCN chief executive and general secretary Janet Davies said: \n“Theresa May was explicitly asked to admit that it is wrong for nurses to be forced to use foodbanks in 2017. \n“Not only did she fail to acknowledge it is wrong, she failed to even mention nurses or their work in her reply. \n“Nurses should not have to fund the NHS deficit from their own pay packets. Too many are struggling to make ends meet, turning to foodbanks and hardship grants in desperation. \n“Every year that the government holds NHS pay below inflation, hundreds of thousands of nurses get another real-terms cut to their salary. \n“The government pay cap is fuelling a recruitment and retention crisis that is as damaging for patient care as it is for the nurses themselves. \n“A growing number feel they can no longer afford to work in the profession and others are deterred from joining by the meagre pay on offer. \n“After the election, for the sake of patient safety, the government must scrap the pay cap and fill the tens of thousands of vacant jobs.” \nWatch her answer here: Tom Eden Labour and Tories pledge not to raise VAT \nVAT looks set to stay at 20% or less until 2022 after the Conservatives and Labour promised not to increase the tax on goods and services if they win the General Election. \nBut the Prime Minister signalled she would scrap the Tories’ flagship “tax lock” pledge, which also rules out increases to income tax and national insurance. \nShe said it was her intention to cut taxes on “working families” while Mr McDonnell also promised to “protect middle and low earners”, although neither defined exactly who they meant. \nMrs May told ITV’s Peston on Sunday: \n“We have no plans to raise the level of tax. \n“In relation to specific taxes, we won’t be increasing VAT.” \nBut asked if she will maintain the Tories’ 2015 tax lock, which pledges no increases to income tax and national insurance as well as VAT, she told BBC One’s Andrew Marr Show: \n“We have absolutely no plans to increase the level of tax but I’m also very clear that we don’t want to make specific proposals on taxes unless I’m absolutely sure that I can deliver on those.” \nThe tax lock has proved troublesome for Chancellor Philip Hammond, who was forced into a humiliating U-turn after last month’s Budget when a revolt from backbench Tory MPs made him ditch planned national insurance increases for the self-employed. \nMr McDonnell said Labour is committed to a “fair taxation system” and suggested “giveaways” to corporations and the rich would be reversed if Jeremy Corbyn is PM, to pay for pledges to spend on the NHS and schools. \nHe told Peston: \n“Look, there’s going to be a barrage of attacks (over spending and tax increases), but the issue around fair taxation is that we will protect middle and low earners. \n“I will say also, we will not increase VAT and I want you to ask Theresa May that question as well because if you remember last time the Tories promised no increase in VAT and then they increased it afterwards and then that falls on, that’s a regressive tax, that falls on some of the poorest and middle earners as well, so that’s one guarantee we’re giving.” Election questions Tom Eden What is 'purdah'? \nSoon after Prime Minister Theresa May called the snap general election the word ‘purdah’ began being bandied about. What does it mean? \nThe term is used to describe the period between the election announcement and the date the election is held. \nWhat happens during that period? \nA ban is imposed on promotional material produced by central and local government that could affect how people vote. \nTo block any new or controversial government initiatives which could be seen to be advantageous to any candidates or parties in the forthcoming election, or which may commit any incoming new administration to policies which it wouldn’t support. \nWhen exactly did purdah start for the forthcoming election? \nGuidance for civil servants for the 2017 General Election was issued by the Cabinet Office on April 20. The pre-election period for the June 8 General Election started at midnight on April 21. 11:58 Tom Eden UKIP leader on TV this morning \nUKIp’s leader Paul Nuttall has announced he will be standing in the seat of Boston and Skegness. \nHe said: \n“The vast majority of MPs, I would suggest to you, do not actually come from the constituency they represent. This is about putting this area on the map. I am a national political figure, I am a national party leader. \n“When I stand up in the House of Commons to represent the seat of Boston and Skegness, people will listen.” 11:40 Tom Eden Labour react to May on VAT \nLabour are pointing out the Tories under Cameron and Osborne also refused to raise VAT, but did anyway: 11:35 Tom Eden John McDonnell on Peston on Sunday \nI didn’t manage to catch it live, but John McDonnell was on Peston on Sunday earlier, and you can watch the full interview here: \n(You may need to hit refresh or F5 to get the clip to appear.) 11:31 Tom Eden Theresa May on nurses using Food Banks \nTheresa May was skewered on live TV today as she tried to avoid taking the blame for the scandal of nurses using food banks. \nThe Tory leader stumbled and claimed “there are many complex reasons why people go to food banks” when questioned in a major BBC interview. \nA Sunday People investigation has shown how universities set up food banks for trainee nurses struggling to survive. \nA record 700 nurses and healthcare assistants applied for hardship grants last year while the number of nurses using payday loans has almost doubled in three years to 35,000. Brexit 'No deal is better than a bad deal' \nHere’s Theresa May discussing Brexit deals: 11:02 Will May do TV debates? \nErm, no: ", "external_links": [], "published": "2017-04-30T16:05:00.000+03:00", "crawled": "2017-04-30T12:43:29.000+03:00", "highlightTitle": ""}