{"organizations": [], "uuid": "9de829ac59bebf67a9a5673a8fd00255d21a69ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article6951706.ece/ALTERNATES/s1200/Newcastle-Uni.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-universities-warn-brexit-12942358", "country": "GB", "domain_rank": 21960, "title": "North East universities warn Brexit is putting off foreign staff and students", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East universities warn Brexit is putting off foreign staff and students", "spam_score": 0.0, "site_type": "news", "published": "2017-04-26T01:00:00.000+03:00", "replies_count": 0, "uuid": "9de829ac59bebf67a9a5673a8fd00255d21a69ba"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-universities-warn-brexit-12942358", "ord_in_thread": 0, "title": "North East universities warn Brexit is putting off foreign staff and students", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "North East universities warn Brexit is putting off foreign staff and students North East universities say Brexit makes it look like the UK doesn't want foreigners here Share Get daily   Thank you for subscribing!   \nNorth East universities fear quitting the European Union could deal them a massive blow unless the Government ensures EU students and academics can continue coming to the UK. \nThe heads of Newcastle and Sunderland universities warned MPs the UK was giving the impression it didn’t want foreign students or staff coming here. \nShirley Atkinson, Vice-Chancellor of the University of Sunderland, said: “There is a wider issue about the reputation of British universities in the world now as a result of the Brexit vote.” \nTheir comments were highlighted by the influential House of Commons Education Committee, which has issued a report urging the Government to provide guarantees to university staff from the EU and design a new immigration system that meets the needs of higher education. \nMPs on the committee visited the North East to meet academics. \nThey included Dr Atkinson, who warned that the UK was giving the impression EU students and staff were not welcome. \nShe told MPs: “Unfortunately, it is being played back in some quarters as Britain not being open and prepared to share, not interested in having mobility of students or staff, and the longer-term implications of that kind of reputational damage needs to be picked up.” \nProfessor Tony Stevenson, Deputy Vice-Chancellor of Newcastle University, told the inquiry: “If you look at the immigration policy and the mood music and the perception in markets out there that are receiving all of that, they do not see Britain at the moment as a welcoming place, despite the rhetoric from Government.” An EU flag flying in front of the Houses of Parliament (Photo: PA) \nHe added: “The Government have a narrative of global Britain open for business and we seem to be doing something different in the immigration space for students.” \nProf Stevenson highlighted the importance of ensuring the UK remains part of the Erasmus+ programme, which helps pay for EU students to study in other EU countries. \nHe pointed out that Newcastle University was a major employer in the region, with more than 5,500 staff including around 600 from EU countries. \nAnd he warned that the UK would lose influence over a European-wide research funding programme called Horizon 2020, as it is likely to become an associate member rather than being a full member. Read More Democracy is not seeing its finest hour - and that should alarm Remainers and Brexiteers \nProfessor Andrew Wathey, Vice-Chancellor of Northumbria University, said the Government needed to guarantee that EU students starting courses in the UK next year would be eligible for student loans - and that EU staff would be allowed to continue working in the UK. \nHe told the MPs: “There are some urgent things still to be resolved and can be quite easily resolved as part of the transition. Those would include confirming the right to reside and work in the UK for EU nationals who currently work here. That would be one. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-04-26T01:00:00.000+03:00", "crawled": "2017-04-25T20:29:45.000+03:00", "highlightTitle": ""}