{"organizations": [], "uuid": "ca29f8f0b54bba24db91135847f98b250e991dd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article9216376.ece/ALTERNATES/s1200/JS62995426.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-2017-could-labour-12909901", "country": "GB", "domain_rank": 21960, "title": "General Election 2017: Could Labour lose North East seats to the Tories?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "General Election 2017: Could Labour lose North East seats to the Tories?", "spam_score": 0.0, "site_type": "news", "published": "2017-04-18T23:47:00.000+03:00", "replies_count": 0, "uuid": "ca29f8f0b54bba24db91135847f98b250e991dd8"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-2017-could-labour-12909901", "ord_in_thread": 0, "title": "General Election 2017: Could Labour lose North East seats to the Tories?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhile recent opinion polls points towards a Tory majority government if as expected the June 8 general election gets the go ahead, the party could struggle to win more seats in the North East. \nIt currently hold Berwick-upon-Tweed and Hexham , both in Northumberland , and Stockton South. The Lib Dems have no seats in the region, and Labour holds 26 seats. \nHowever, the situation in the North East is particularly hard to predict because UKIP got 17% of votes in the region in 2015. \nIt remains to be seen if UKIP, known for its opposition to EU membership, will do better this time, or whether its share of the vote will fall following the loss of former party leader Nigel Farage and the Conservative Party’s success in taking on the role of the part of Brexit. \nAttention is also likely to focus on Berwick-upon-Tweed, where the Liberal Democrats will be fighting to try to unseat defending Conservative MP Anne-Marie Trevelyan. \nThe Liberal Democrats held Berwick from 1973 to 2015. The party has carved out a role as the most pro-EU major party while Mrs Trevelyan is an outspoken supporter of Brexit. Liberal Democrats leader Tim Farron (Photo: PA) \nShe said: “The Prime Minister has signalled her intention to go to the country on 8th June to give voters a clear choice between a stable Government, with a strong leader in Theresa May, or a weak, shambolic coalition Government with Jeremy Corbyn propped up by the Lib Dems and the SNP. \n“An election held before the negotiations with the European Union begins mean the country has the opportunity to vote for a stable future and certainty for a full five years, not just up to the point at which we leave the European Union but beyond it too. \n“In Theresa May, the Conservative Party and the nation has a trustworthy and proven leader intent on uniting the nation and strengthening our hand at the negotiating table with the European Union. Theresa May is the best person to get the right deal for the UK, with a strong, united government and country behind her.” Read More PM calls general election for June 8 'amid Westminster division' after Brexit \nLiberal Democrat leader Tim Farron said: “This election is your chance to change the direction of our country. \n“If you want to avoid a disastrous Hard Brexit. If you want to keep Britain in the Single Market. If you want a Britain that is open, tolerant and united, this is your chance. \n“Only the Liberal Democrats can prevent a Conservative majority.” Nick Brown (Photo: Carl Court/PA Wire) \nLabour’s Nick Brown, who will be defending Newcastle East, said: “It’s Theresa May’s choice to hold this election but my response is, bring it on. \n“The election will determine our approach to the European negotiations, which will be of huge significance for generations to come. \n“It’s important to vote, and to vote for those who want a decent working relationship with the European Union rather than a complete break. \n“The issues are complicated and very important.” Read More Prime Minister Theresa May calls for UK general election on June 8 \nOur analysis of ten recent opinion polls puts the Conservatives on 42.8%, Labour on 26.7%, the Liberal Democrats on 11% and UKIP on 9.6%. \nAssuming a uniform swing, with voters switching from Labour to Conservative at roughly the same rate across the country, the Tories would gain 44 seats from Jeremy Corbyn’s Labour Party. \nIt would leave Conservative leader Theresa May with a majority of 106. The Government currently has a working majority of 17. Jeremy Corbyn (Photo: PA) \nThis would mean that three seats in the wider North East region could change hands from Labour to Tory - Bishop Auckland, Darlington and Middlesbrough South and East Cleveland. \nIn Bishop Auckland, County Durham, Labour is defending a majority of 3,508 votes. \nAnd in Darlington, where the defending MP is Shadow Europe Minister Jenny Chapman, Labour won with a majority of 3,158 over the Tories at the last election. \nDefending Middlesbrough South and East Cleveland could be a particular challenge for Labour - after sitting MP Tom Blenkinsop announced he would not stand again. \nMr Blenkinsop, a critic of Labour leader Jeremy Corbyn, said: “I have made no secret about my significant and irreconcilable differences with the current Labour leadership. \n“It is because of these differences I feel I cannot in good faith stand as the Labour candidate for Middlesbrough South and East Cleveland.” \nLabour won this seat with a majority of 2,268 in the 2015 general election, with the Conservatives in second place. Like us on Facebook ", "external_links": [], "published": "2017-04-18T23:47:00.000+03:00", "crawled": "2017-04-19T01:50:08.000+03:00", "highlightTitle": ""}