{"organizations": [], "uuid": "a46d0d8220bf9f4cd98726548b6f8216583878e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12830119.ece/ALTERNATES/s1200/HSR_NEC_310317Arnott_07JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-mep-lib-dem-rival-12829965", "country": "GB", "domain_rank": 21960, "title": "UKIP MEP and Liberal Democrat rival in punch up over Brexit - kind of", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "UKIP MEP and Liberal Democrat rival in punch up over Brexit - kind of", "spam_score": 0.0, "site_type": "news", "published": "2017-04-01T23:00:00.000+03:00", "replies_count": 0, "uuid": "a46d0d8220bf9f4cd98726548b6f8216583878e2"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-mep-lib-dem-rival-12829965", "ord_in_thread": 0, "title": "UKIP MEP and Liberal Democrat rival in punch up over Brexit - kind of", "locations": [], "entities": {"persons": [{"name": "jonathan", "sentiment": "none"}, {"name": "toby", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}, {"name": "toby white", "sentiment": "none"}], "locations": [{"name": "north east ukip", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bethnal green", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "york hall", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "chessboxing", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "party", "sentiment": "none"}, {"name": "london chessboxing association", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates   \nA Brexit punch up between a North East UKIP MEP and a Lib Dem activist is to take place on Saturday night. \nThe clash is being staged at the iconic York Hall boxing venue in Bethnal Green, London. \nIn the blue corner will be UKIP’s Jonathan ‘The Tactician’ Arnott . And in the ‘yellow’ corner will be Toby ‘Slowby’ White. \nBut it is no ordinary fight - it’s a ‘Chessboxing’ challenge which is as much about brains as brawn. \nOpponents alternate between three minute sessions of speed chess and two minute rounds of boxing - with one minute in between to remove or put on their gloves - until there is a winner by checkmate or KO, whichever comes first. \nMr Arnott, a keen chess player who made the England Under-21 squad, is hoping to raise £3,000 for ACT for SMA (the Ally Cadence Trust for Spinal Muscular Atrophy) by taking part. Jonathan Arnott chessboxing (Photo: Handout) \nHe was inspired to look into doing it through Chessboxing after a chat with a pal about the unusual ‘sport’. \nMr Arnott said: “I had a brief phone call with the London Chessboxing Association, and it turns out they loved the idea of having a politician on their next show.” \nThat was in January and now just over two months later - and after losing at least two and half stone in weight because of his training regime - he will be stepping into the ring. \nHe said: “It’s been a big culture shock for me. I’m a mathematician by trade and more at home on the chess board.” Jonathan Arnott chessboxing (Photo: Handout) \nHis opponent, Toby White, is a veteran of two previous Chessboxing bouts and is reportedly looking for payback after campaigning unsuccessfully for the Remain campaign last Summer. \nMr Arnott added: “I suppose it’s a bit of a grudge match - but for a very good cause. I don’t think I’m favourite to win. Obviously I’m a bit apprehensive about the boxing side, but I’ll give it a go.” \nMr Arnott explained why he was raising money for his chosen charity. \nHe said: “ In October, one of my colleagues sadly lost their baby daughter to Spinal Muscular Atrophy. Jonathan Arnott chessboxing (Photo: Handout) \n“The charity helped the parents, as they have done many others before, through the last few months of their daughter’s life, enabling her to leave hospital and have the specialist equipment that was so desperately needed. \n“My Liberal Democrat opponent , in the spirit of mind games before a fight, has very kindly helped to raise funds for the same charity too. \n“It’s rare that I’ll agree with the Liberal Democrats on much but it’s great to be able to do something for once that transcends Party politics.” \n•If you want to donate to Mr Arnott’s chosen charity, visit his justgiving page on: www.justgiving.com/fundraising/arnott Like us on Facebook", "external_links": [], "published": "2017-04-01T23:00:00.000+03:00", "crawled": "2017-04-01T18:17:38.752+03:00", "highlightTitle": ""}