{"organizations": [], "uuid": "887d23926c3fc9be3c4c2578c8e4ff45cd6eecd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12229928.ece/ALTERNATES/s1200/JS105870740.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-exports-fall-second-12886430", "country": "GB", "domain_rank": 21960, "title": "North East exports fall for second quarter despite Brexit-hit pound", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East exports fall for second quarter despite Brexit-hit pound", "spam_score": 0.0, "site_type": "news", "published": "2017-04-13T01:00:00.000+03:00", "replies_count": 0, "uuid": "887d23926c3fc9be3c4c2578c8e4ff45cd6eecd4"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-exports-fall-second-12886430", "ord_in_thread": 0, "title": "North East exports fall for second quarter despite Brexit-hit pound", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ross Smith, the North East Chamber of Commerce director of policy   Thank you for subscribing!   \nExport sales in the North East have fallen for the second quarter in a row despite many manufacturers claiming the weak pound was boosting business. \nThe findings were made in the North East England Chamber of Commerce’s Quarterly Economic Survey, which tracks the growth of companies across the region. \nExport sales received a score of -3.6, which means that overall overseas sales fell marginally over the year. It is the first time since 2009 that export sales have fallen for two consecutive quarters. \nThe drop was mainly caused by service sector exports, although manufacturing exports remained flat. \nManufacturers in the North East were expected to see a boost to overseas sales after gaining a competitive edge from the decreased value of the Brexit-hit pound . \nOn the upside, domestic sales in the North East saw robust growth after achieving a score of +22.3. \nRoss Smith, the Chamber’s director of policy, said: “There is good news in this latest set of results with the UK order books in the best shape they have been for nearly two years. These improved figures are reflected in both the manufacturing and service sectors. Read More Pressure grows on big North East employer AkzoNobel to consider takeover \n“There are worrying trends in these results however, with export sales showing a negative score for the second successive quarter, the first time this has happened since 2009. \n“Export markets offer huge potential to our companies and we need to have more support for them to explore these marketplaces.” \nInflation proved to be the biggest growing concern for businesses and was cited by 52.5% of those involved in the survey. This was the highest level for five years. Read More Massive oil platform set to arrive at North East port - delivered by massive ship \nBusiness rates were also a major concern with 50.5% of companies highlighting the tax as worrying, the highest level in 10 years. This was largely due to the Government’s controversial reevaluation of the business rates system. \nMr Smith added: “This coincides with the revaluation so it is not surprising many businesses were concerned by changes even though this region fared relatively well. What it shows is the continuing need for fundamental reform of this outdated and inappropriate form of tax.” Like us on Facebook", "external_links": [], "published": "2017-04-13T01:00:00.000+03:00", "crawled": "2017-04-12T22:33:56.448+03:00", "highlightTitle": ""}