{"organizations": [], "uuid": "f6c4e9e3b79f499ddf1c963162de31d1c4c21be7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12573165.ece/ALTERNATES/s1200/SGP_NEC_080217A105JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-12953363", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "spam_score": 0.0, "site_type": "news", "published": "2017-04-29T16:00:00.000+03:00", "replies_count": 0, "uuid": "f6c4e9e3b79f499ddf1c963162de31d1c4c21be7"}, "author": "Katie Collings", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-12953363", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "katie collings", "sentiment": "none"}], "locations": [{"name": "durham  one lane", "sentiment": "none"}, {"name": "bradbury", "sentiment": "none"}, {"name": "bowburn", "sentiment": "none"}, {"name": "durham  highways england", "sentiment": "none"}], "organizations": [{"name": "met office", "sentiment": "none"}, {"name": "j60 bradbury interchange southbound", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Our reporter Sean is now at the rally: 11:39 Katie Collings Update from police about Winlaton incident \nA spokesman for Northumbria Police could not give further details about the incident in Winlaton where a man has been arrested after allegedly being seen with a knife. \nHe said: \n“I can confirm an incident has taken place in which there is an investigation ongoing.” \nWe are hoping to have an update from police later today. 11:27 Katie Collings Queues on the A1 \nHighways England says there is still heavy congestion on the A1(M) Southbound near Bowburn due to the earlier collision. \nOne lane is now open but there are expected delays of up to 50 minutes. 11:19 Katie Collings What is it about? \nCampaigners for peace and social justice are to join forces with trades unionists and Labour politicians. (Photo: PA) \nChi Onwurah is expected to comment on key issues in the general election campaign. \nSpeaking before the rally she said: \n“For the Labour Party, our historic mission is to defend and extend the rights of working people. This is especially important when the hard-won rights of working people are under threat. \n“Here in the UK, a Tory Government is pursuing a hard Brexit agenda that threatens to trade away our socio-economic birthright.” \nShe will be joined on the platform by Laura Pidcock, recently appointed Labour candidate for North West Durham, Craig Johnston from rail and maritime union RMT, Anne Stokle from the Burma Campaign UK and Jorge Garcia, political counsellor at the Cuban Embassy. \nOther speakers will address such issues as the NHS crisis, school under-funding and solidarity with Palestine. \nMay Day Committee chair Martin Levy says: \n“The announcement of the general election has made it all the more important that the issues affecting working people are heard. We expect a determined and colorful turnout, with the march led as usual by the Backworth Colliery Band.” 11:08 Katie Collings 'No to austerity' march in Newcastle \nCampaigners will march through Newcastle city centre today in a May Day rally to say: “No to war, poverty and racism”. \nThis year’s slogan couples “workers’ rights and internationalism” with opposition to “war, poverty and racism”, echoing the call made 50 years ago by Dr Martin Luther King Jr, when he was awarded an honorary degree by Newcastle University. \nNewcastle Central MP Chi Onwurah will be the keynote speaker. \nWe will be there bringing you live updates. 10:54 Katie Collings Breakdown on the A19 \nOne lane is closed on the A19 Southbound between the A184 Newcastle Road near Testo’s Roundabout and the A1290 due to a broken down vehicle. \nTraffic is said to be coping well. 10:47 Katie Collings Man arrested in Winlaton \nIf you’ve seen a lot of officers in Winlaton this is why. We’ll bring you updates when we have them: 10:36", "external_links": [], "published": "2017-04-29T16:00:00.000+03:00", "crawled": "2017-04-29T11:40:26.000+03:00", "highlightTitle": ""}