{"organizations": [], "uuid": "b35fc3843d19aa555ef0410c59a07677c882a3a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30281036/15963466.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/david-wheeler-column-exeter-city-winger-on-barnet-cambridge-and-the-snap-general-election/story-30281036-detail/story.html", "country": "GB", "title": "David_Byrom published David Wheeler column: Exeter City winger on Barnet, Cambridge and...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "David_Byrom published David Wheeler column: Exeter City winger on Barnet, Cambridge and...", "spam_score": 0.0, "site_type": "news", "published": "2017-04-19T23:17:00.000+03:00", "replies_count": 0, "uuid": "b35fc3843d19aa555ef0410c59a07677c882a3a7"}, "author": "David_Byrom", "url": "http://www.devonlive.com/david-wheeler-column-exeter-city-winger-on-barnet-cambridge-and-the-snap-general-election/story-30281036-detail/story.html", "ord_in_thread": 0, "title": "David_Byrom published David Wheeler column: Exeter City winger on Barnet, Cambridge and...", "locations": [], "entities": {"persons": [{"name": "david wheeler", "sentiment": "none"}, {"name": "leon legge", "sentiment": "none"}, {"name": "ryan harley", "sentiment": "none"}, {"name": "ethan", "sentiment": "none"}, {"name": "shaun derry", "sentiment": "none"}, {"name": "morecambe", "sentiment": "none"}, {"name": "ethan ampadu", "sentiment": "none"}, {"name": "luke croll", "sentiment": "none"}, {"name": "jake taylor", "sentiment": "none"}, {"name": "john akinde", "sentiment": "none"}, {"name": "lee holmes", "sentiment": "none"}, {"name": "christy pym", "sentiment": "none"}], "locations": [{"name": "exeter city", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "newport", "sentiment": "none"}, {"name": "jordan tilson", "sentiment": "none"}, {"name": "st james's park", "sentiment": "none"}, {"name": "morecambe", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "carlisle", "sentiment": "none"}, {"name": "bristol west", "sentiment": "none"}], "organizations": [{"name": "barnet", "sentiment": "none"}, {"name": "aston villa", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "sjp", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "exeter city  jordan moore-taylor", "sentiment": "none"}, {"name": "green", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nWhile we enjoyed mixed fortunes over the Easter bank holiday weekend, with just three games of the League Two season to go, we're hanging on to the play-off spot we've occupied since mid-January; the less good news is that there are just two points between us in sixth and 13th-placed Wycombe and there's much work still to be done if we're to extend our season beyond May 6, less still realise our goal of winning promotion. \nSuffice to say, we'll probably need to win at least two of our remaining games to make sure of a top-seven finish and, that being the case, it's imperative we beat Morecambe at St James's Park on Saturday. \nIn terms of the league table, the Shrimps don't appear to have a lot to play for – it's impossible for them to secure a play-off position and they're all but certain to avoid a bottom-two finish – which some will see as being to City's advantage, but, then again, all the pressure will be heaped on us. \nOne thing's for sure, with two of our remaining three fixtures at home – Morecambe on Saturday and Carlisle on the final day – our fans, who have been brilliant all season, can play a huge role in helping us over the line. \nI've no doubt there will be occasions when the going gets tough, and extremely nervy, but if we can look forward to the same levels of support as we've had over recent weeks at the Park it really could make all the difference. \nWe began Friday's game against Barnet as well as we've started a game for some considerable time and raced into a 2-0 lead inside the first five minutes. \nRead more: Lee Holmes on his return to fitness for Exeter City \nJordan Moore-Taylor put us ahead in the third minute after I headed a long ball from the impressive Ethan Ampadu into his path and Jake Taylor and Ryan Harley combined to present me with the opportunity to double our lead just a minute or two later. \nBefore the start of the season, I'd never have dreamt that I'd get anywhere near 17 goals and, as you might imagine, am thrilled that I've been able to do so; at the same time, the goals will mean a lot less if we're still in League Two next year and, with that in mind, I'd like to think I could bag one or two more before our season is done. \nDespite going 2-0 down so early on, Barnet refused to roll over and proceeded to put us under a lot of pressure. Indeed, Christy Pym had already made a couple of good saves before their star man John Akinde halved the deficit in the 69th minute. From thereon in it was real backs-to-the-wall stuff but, with the backing of an enthusiastic and noisy crowd, we hung onto secure the three points that, having lost at home to Newport the previous Saturday, we so desperately needed. \nAs I intimated earlier, I thought Ethan had another great game. It was the first time in a while the 16-year-old had featured in the starting line-up – and for such a critical game too – but he barely put a foot wrong all afternoon and he and Jordan Tilson in the centre of midfield provided the platform which allowed the forward players, such as myself, to perform in the way we did in the opening few minutes. \nI must also make mention of Luke Croll, who hasn't had it easy at times this season, but was, I thought, outstanding at the heart of our defence and, without a doubt, had one of his best games yet in an Exeter City shirt. \nRead more: The Exeter City starlet who turned down Aston Villa and walked away from a promising football career \nHaving beaten Barnet to climb to fifth in League Two, we were desperate to maintain our momentum when we travelled to Cambridge on Monday. Unfortunately, it wasn't to be – we started really well and had a few decent chances, which we failed to capitalise on, before the home side took the lead just before the half-hour mark. \nTruth be told, it was a disappointing goal to concede. Ahead of the game, we'd talked at some length about the aerial threat Leon Legge could pose from set pieces, only to switch off from a wide free kick and allow the U's skipper to peel off and score with a powerful header. \nFrom thereon in, it was tough; with Cambridge desperate for all three points to remain in with a chance of making the play-offs, they dug in and we struggled to break them down. While we saw plenty of the ball, Shaun Derry's side were extremely well drilled and we found it difficult to find gaps through them or in behind. Another election under FPTP won't represent the views of the people. 74% of votes were wasted in 2015. Only PR offers voters real democracy! pic.twitter.com/aiyFQTWDdy — David Wheeler (@djwheeler07) April 18, 2017 \nI'm pleased there's going to be a General Election on June 8, and looking forward to voting, but I'm not overly optimistic about how it might turn out. \nEven allowing for the fact the pollsters have made a few ricks over recent years, it's hard to imagine the outcome will be anything other than a Conservative majority, which, as a left-of-centre individual who's pro Europe and passionate about the environment, fills me with dread; I only hope it isn't the landslide plenty of people are predicting. \nMany commentators are saying that the Prime Minister is going to the country to secure a mandate for her Conservative vision of Brexit, but I don't think that suggestion stands up to scrutiny. As I've pointed out previously, the Tories' 2015 General Election victory was secured with little more than a third of the vote and, while it's conceivable that figure will increase in June, it's all but certain the number of people who vote for opposition parties will exceed the number who vote for the Tories. \nIn a similar vein, while I'm a Green supporter and fortunate to live in one of the few constituencies in the UK (Bristol West) where the party harbours realistic hopes of winning – they came a good second behind Labour in 2015 – and my vote might actually count for something, I'm not a fan of the first-past-the-post voting system. \nFrankly, I think it's ridiculous that the votes of so many people are, to all intents and purposes, meaningless and would welcome the introduction of some kind of proportional representation system, under which every vote mattered. \nAnyway, at least for the next few weeks, I shall endeavour not to spend too long worrying about what might lie ahead for the nation at large and instead concentrate my energies on helping us secure a play-off place. \nTo that end, if you've got a little piece of Exeter City in your heart then do, please, make every effort to get along to SJP and help us move a step nearer that goal by beating Morecambe on Saturday! ", "external_links": [], "published": "2017-04-19T23:17:00.000+03:00", "crawled": "2017-04-19T18:54:08.000+03:00", "highlightTitle": ""}