{"organizations": [], "uuid": "8c8dff67a6b090a69d9a90d073c99de56fcf480c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30293287/15973459.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/undefined-headline/story-30293287-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published Will gloom follow Brexit boom?", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published Will gloom follow Brexit boom?", "spam_score": 0.0, "site_type": "news", "published": "2017-04-26T16:50:00.000+03:00", "replies_count": 0, "uuid": "8c8dff67a6b090a69d9a90d073c99de56fcf480c"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/undefined-headline/story-30293287-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published Will gloom follow Brexit boom?", "locations": [], "entities": {"persons": [{"name": "thomas", "sentiment": "none"}, {"name": "chris hobson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jennifer thomas", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "sterling", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "eu", "sentiment": "negative"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "chamber's quarterly economic surveys", "sentiment": "none"}, {"name": "index", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Will gloom follow Brexit boom? X \nCopy link to paste in your message / Comments (2) \nLoss of EU workers would be huge blow to small businesses, according to the Federation of Small Businesses (FSB). \nAccording to latest FSB research, more than half of small businesses employing EU workers are worried about finding people with the right skills, or growing their business post-Brexit. \nThe research highlights the need for small firms to have continued access to labour and skills from the EU after Britain leaves the union. \nThe FSB said small businesses with EU workers mainly employed mid-skilled staff, such as care and construction workers, mechanics and office managers. \nIf Brexit created additional barriers to recruiting EU citizens, small firms that employ EU workers would consider moving their business abroad, reducing operations, or even closing down the business organisation said. \nRead more: Article 50 and Brexit: A simple guide to how Britain will leave the EU \nFSB regional development manager Jennifer Thomas, said: \"EU workers are a vital part of our local and national economy, helping to plug chronic skills gaps across a wide range of sectors, and filling jobs in an already tight labour market. \n\"From bakers to web builders, small employers in Leicestershire need to be able to hire the right person, for the right job at the right time. There is real concern among our local small firms with EU staff that they will lose access to the skills and labour their business needs to survive and grow. \n\"Ensuring that small businesses have enough time post-Brexit to prepare for any changes to immigration arrangements is also crucial. This means creating workable and business-friendly transitional arrangements at first, with a phased implementation of any new immigration system.\" Mrs Thomas said many small businesses also undertake cross-border business with EU countries, so \"there must not be barriers to those being able to travel for projects and assignments in the EU\". \nShe added: \"Our research shows that the consequences for small businesses if the new immigration system does not work for them could be severe, and as over 99 per cent of businesses are small businesses, this has far reaching implications for the UK economy. \n\"Small firms don't have HR departments to deal with complex and lengthy immigration procedures and paperwork, or extra costs associated with these. They are most at risk of repercussions of losing staff or burdensome applications from government to retain and hire new staff. \n\"Because small businesses will be most acutely affected by changing access to skills and labour, Brexit negotiations must also take into account those small firms who have important business relationships with the EU. Otherwise, as our research shows, the consequences for small business growth and survival could be severe.\" \nTHE FLIPSIDE \nAs the country awaits the outcome of a General Election and the ensuing negotiations with the EU, the local chamber of commerce said the Brexit mini-boom enjoyed by business has boosted the chamber's State of the Economy Index to its highest level in nearly two years. \nThe Index is based on the net results of responses given by businesses to repeat questions in the Chamber's Quarterly Economic Surveys. \nRead more: Theresa May calls General Election: How Leicestershire candidates reacted to snap election \nThe survey recorded a rise in the number of firms reporting increased sales in the UK and overseas. \nConfidence levels were also higher with an increase in the number of firms expecting improved performance in the next three months in the UK and abroad. \nThe number of East Midlands firms expecting turnover and profitability to increase this year was also higher in the first three months of 2017 than in the final quarter of 2016. \nThere was also a boost in employment with the net number of firms reporting increased staffing levels up from 19 to 23 and the variance of those expecting to take on more personnel rising from 20 to 38 net. \nHowever, in line with the FSB's findings, the availability of suitably skilled staff remained the single second-biggest issue for responding firms. \nChris Hobson, the Chamber's director of policy, said: \"What these figures confirm yet again is that the East Midlands economy has remained robust and far from falling into the mire of doom and despair predicted by many in response to Brexit has enjoyed nine months of mini-boom. \n\"We know there are inflationary pressures that can potentially hinder growth, especially coupled with the raft of new upfront costs for businesses introduced this month. \n\"Firms are already beginning to do report squeezed margins, but despite that we can see that, on the whole, business remains confident and plans to invest in equipment and training. \n\"Business in the East Midlands had all but conquered the initial fears over Brexit and coped with the fall in the value of Sterling, however, the recently called General Election on June 8 has the potential to create more short-term uncertainty. \n\"What is really important now is that all Parties clearly articulate what they stand for. \n\"There are a multitude of domestic issues that need to be managed and we would call on all candidates to make clear to business what their plans are for strengthening the economy now, during Brexit negotiations and post-Brexit.\" ", "external_links": [], "published": "2017-04-26T16:50:00.000+03:00", "crawled": "2017-04-26T12:50:32.000+03:00", "highlightTitle": ""}