{"organizations": [], "uuid": "75a9012558eded2a3b5fd77086a333e93eca68c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12828382.ece/ALTERNATES/s1200/CFR_NJL_300317joe_04.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/inventing-bike-grandson-seen-70-12827868", "country": "GB", "domain_rank": 21960, "title": "Inventing a bike for his grandson has seen a 70-year-old launch a business that is going global", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Inventing a bike for his grandson has seen a 70-year-old launch a business that is going global", "spam_score": 0.0, "site_type": "news", "published": "2017-04-02T20:00:00.000+03:00", "replies_count": 0, "uuid": "75a9012558eded2a3b5fd77086a333e93eca68c4"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/inventing-bike-grandson-seen-70-12827868", "ord_in_thread": 0, "title": "Inventing a bike for his grandson has seen a 70-year-old launch a business that is going global", "locations": [], "entities": {"persons": [{"name": "joe mulcahy", "sentiment": "negative"}, {"name": "mulcahy", "sentiment": "none"}, {"name": "pedibal", "sentiment": "none"}, {"name": "julie underwood", "sentiment": "none"}, {"name": "garry", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "adams powell", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}], "locations": [{"name": "pedibal", "sentiment": "none"}, {"name": "chester-le-street", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "sprinta", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "scampa", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "kevin gibson photography ltd", "sentiment": "negative"}, {"name": "department of international trade north east", "sentiment": "none"}, {"name": "chester-le-street", "sentiment": "none"}, {"name": "china-britain business council", "sentiment": "none"}, {"name": "pedibal ltd", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "erdf", "sentiment": "none"}, {"name": "department for international trade north east", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Joe Mulcahy, founder of Pedibal (Photo: Kevin Gibson Photography Ltd) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHelping his grandson has seen Joe Mulcahy develop a business that is taking on the world, four years after he retired and half a century after he was trained. Coreena Ford hears his remarkable story. \nYou’re never too old to learn and never too old to launch a new business - those are words that 70-year-old Joe Mulcahy takes very seriously. \nHe may have officially retired four years ago, but Joe is now firmly back in business, embarking on the most exciting venture of his life – and it’s all thanks to a very personal project and an apprenticeship he passed at a factory – on the day it closed – almost 50 years ago. \nThe Chester-le-Street grandfather is founder and director of Pedibal Ltd, creators and suppliers of three-in-one bikes which are selling all over the world and discovering new markets all the time. The Red Scampa bike by Pedibal (Photo: Pedibal) \nIt’s a niche market that Joe discovered while he was trying to find a special bike for his grandson. \nHe said: “This whole business evolved from a personal situation, which led to recognising an opportunity and then that magical moment of inspiration that delivers a great idea, an idea that became Pedibal.” \nJoe had been searching for a balance bike for his grandson, who has dyspraxia, a neurological condition which affects sufferers’ mobility and coordination, when the idea for a new enterprise took hold. \nUnable to find a suitable bike in the UK, he tracked one down in the US which his grandson took to straight away. \nJoe said: “My grandson has dyspraxia and has a few issues with his balance and co-ordination. Riding a bike was off limits for a long time and kids can be cruel so he used to get a lot of stick in the streets from other kids. \n“I could find the balance bikes for little kiddies, but couldn’t get a bigger, light-framed one for my grandson, who was six-and-a-half at the time, until I discovered this chap who sold a lightweight large version in the US and I bought one. Joe Mulcahy, founder of Pedibal Ltd (Photo: Kevin Gibson Photography Ltd) \n“He went from being unconfident and clumsy to flying down the sides of steep hills in less than an hour – the change in him was incredible, I even had a call from his head teacher to ask what I was doing differently because his whole demeanour had changed. \n“The new bike looked cool too, so he went from being a bit of a target for kids to being the coolest kid on the street, it was incredible to see.” \nIn 2010 Joe teamed up with the US supplier and started to import the bikes himself to sell to schools and other customers, before tapping into his experience as a design engineer to create his own, lightweight crossover bike. \nIronically, despite setting out on a career path to be an engineer in his twenties, he didn’t use those skills once until calling upon them to solve his grandson’s bike dilemma. \nJoe had served his time as an engineering apprentice at Adams Powell on the Team Valley, which used to manufacture parking meters. \nHe said: “At the age of 21, I got my indenture papers in one hand and my redundancy notice in the other - t he factory closed and I was left looking for new work.” \nAfter the factory closed he moved into a number of roles, starting several businesses including an office supplies company and several pubs and restaurants, but he didn’t use his engineering background until he and started Pedibal. \n“If my story has any sort of message, it’s that you’re never too old to learn and you’re never too old to start a business. I didn’t use any of my engineering knowledge from the age of 21 until I started designing the pedal bikes aged 70. \n“I suppose it says a lot about the quality of apprenticeships and also how they prepare for working life, whatever the industry you end up in. \n“I had been retired for four years, but I never really stopped working. I mainly concentrated on computer-driven products, but I don’t believe in sitting back and relaxing – you have to grab opportunity when it arrives and run with it. It doesn’t matter how old you are or what industry you have worked in.” \nHe and his son Garry designed and developed the bikes themselves, encompassing all facets of learning to ride on two wheels. \nJoe describes his son as a self-taught engineer, who can turn his hand to most things. \nTogether, they devised an exhaustive list of everything required to create their own three in one bike – everything from materials, weight and size to cost and suppliers, markets. \n“We designed a super-lightweight bike that converts simply from balance to seated scooter, then onto full pedal,” Joe said. \n“It only gains 2kg between balance to pedal, and we deliver it all as a single purchase. It’s ideal for all children, but particularly those with balance and coordination challenges who can progress without trauma. \n“We applied to patent the design and the next stage was to find a reliable quality manufacturer. After research and advice China-Britain Business Council, we travelled to China to visit the China Bike Fair and then on to visit manufacturers, and ensure whoever we worked with operated ethically and had a keen focus on quality.” \nPedibal was incorporated in 2014 and now there are several models of bike, from the Scampa to the Sprinta, and PediBal is opening up new markets across the world, supported by the Department of International Trade North East. \nThe company has moved quickly through the gears since it got started. \nMr Mulcahy has established markets in Denmark, and is distributing to Norway, France and Holland, but aims to crack more global markets with new links to overseas distributors. Working from his Chester-le-Street home, he manufactures the bikes in China, distributing from a Washington warehouse. \nPedibal is hoping to increase sales by £40,000 this year, resulting in the creation of one new job. Last week also saw the launch of the new website, developed with support from DIT, to suit international markets. \n“It was a real labour of love for us,” said Joe. \n“It started as a very personal project, but when we saw the impact the bike had for my grandson’s confidence, it opened our eyes to the benefits it could have for other kids with dyspraxia or other challenges, that impacted on balance or co-ordination. \n“So, the project progressed and soon the recognition hits us that the original balance bikes could be beneficial in main stream education - developing skills like spatial awareness, dexterity and core strength and building the confidence of a child. \n“That confidence can be transferred to the classroom for educational progress. \n“We have sold hundreds of balance bikes to schools, but there had to be a route for progression – we were being asked for pedal bikes to teach balance-ability, which is encouraged by government. \n“Here we are, we’ve cracked it with the balance bikes, only to be presented with a new challenge – mix it with the big boy bike manufacturers. \n“We thought that there are loads of pedal bikes on the market, but that ‘light bulb’ moment arrived again as we realised, unless you spend a fortune on a lightweight bike, most are made of heavy steel and it’s retrograde for progress when moving from balance to pedal because of the weight.” \nThe firm has a range of balance to pedal bikes for 18 months to five years, four years to around 11 years and a third for 11 years to adult, allowing older children in SEN education to improve balance and co-ordination. \nBut adults who have not learned to cycle also benefit from the “Three in One”, which helps them exercise and develop riding skills. \nJoe said: “This again pushed us on to develop new products – the older generation might want to cycle, but may be discouraged by the terrain… so we developed an eBike, “The Navigata”, which takes the strain and still allows the health benefits.” \nFrom the word go, Joe and Garry said they have been encouraged to consider the export market and received tremendous support from the Department for International Trade. \nJoe accessed Department for International Trade North East support via its ERDF programme to visit the China Bike Show gathering market intelligence and identifying potential distributors. \nHe said: “We have been encouraged from the outset when we were developing the Pedibal range to expand the business into Europe, despite Brexit. We are also setting our sights further afield to all markets and ever expanding healthy cycling markets.” \nNorth East England Chamber of Commerce director of international trade, Julie Underwood, is full of praise for the pair. \nShe said: “With one part inspiration and one part innovation, Pedibal has not only spotted a gap in the market, it has moved quickly to plug it with a fantastic new product. \n“Joe’s and Garry’s enthusiasm and drive for this amazing product is evident and it makes me incredibly proud to see something so exciting and innovative created in the North East.” Like us on Facebook", "external_links": [], "published": "2017-04-02T20:00:00.000+03:00", "crawled": "2017-04-02T16:35:43.251+03:00", "highlightTitle": ""}