{"organizations": [], "uuid": "7423221caf3d63b3c1c91ce1ca455ad6edfc0997", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12916294.ece/ALTERNATES/s1200/CFR_NJL_190417toon_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-future-responsible-city-comes-12916049", "country": "GB", "domain_rank": 21960, "title": "Newcastle's future as a responsible city comes up for public debate", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle's future as a responsible city comes up for public debate", "spam_score": 0.0, "site_type": "news", "published": "2017-04-20T00:46:00.000+03:00", "replies_count": 0, "uuid": "7423221caf3d63b3c1c91ce1ca455ad6edfc0997"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-future-responsible-city-comes-12916049", "ord_in_thread": 0, "title": "Newcastle's future as a responsible city comes up for public debate", "locations": [], "entities": {"persons": [{"name": "kevan carrick", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "heidi mottram", "sentiment": "none"}, {"name": "lucy winskell", "sentiment": "none"}, {"name": "christine hardman", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "sutherland building", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "great hall", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "newcastle business school", "sentiment": "none"}, {"name": "crest photography", "sentiment": "none"}, {"name": "nibe", "sentiment": "none"}, {"name": "jk property consultants", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "northumbrian water", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle's future as a responsible city comes up for public debate The forward-thinking debate is one of a series of seminars spearheaded by the Newcastle Business School Share Left to right: Kevan Carrick, chairman of JK Property Consultants and NIBE founder, councillor Nick Forbes, Leader of Newcastle City Council and Lucy Winskell, pro vice-chancellor of Northumbria University (Photo: Crest Photography) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLeading figures from business, local government, academia and the church are set to come together to debate Newcastle’s future as a responsible city. \nA panel has been pulled together for the public debate at Northumbria University , which is staging a Responsible Business Seminar series, run by Newcastle Business School in partnership with the North East Initiative on Business Ethics (NIBE). \nThe debate on April 25 is open to members of the public and panellists including The Right Reverend Christine Hardman, Bishop of Newcastle; councillor Nick Forbes, leader of Newcastle City Council; Heidi Mottram, chief executive of Northumbrian Water and Prince of Wales North East Business Ambassador, and Kevan Carrick, chairman of JK Property Consultants and NIBE founder member. \nLucy Winskell, Pro Vice-Chancellor of Northumbria University, who will chair the debate, said: “The pace and extent of political and economic change raise many questions for the UK’s major cities, including Newcastle. \n“The Brexit vote and President Trump’s election tell us populism is on the rise while moves to devolve power from central government will see decisions taken closer to where they will have an effect. \n“The purpose of our debate is to bring these issues to the fore and to begin a dialogue between various community leaders. \n“Newcastle has a strong cultural identity as an open, outward looking and diverse city but how prepared is it for a post-Brexit world where neighbouring cities and regions are seeking autonomy from traditional centres of power? And can the city remain tolerant and compassionate while competing on the world stage or will it have to sacrifice these characteristics for economic good? \n“I’m looking forward to a very frank exchange of views between the panellists and I’d encourage anyone with an interest in Newcastle’s future to join us and take part.” Read More Major North East employer AkzoNobel records record profits as it fights takeover bid \nNIBE founder Kevan Carrick added: “As leaders it is critical we hold a mirror up to see whether Newcastle really is an inclusive and responsible city and look at how we can use the changing political situation to create a stronger, more resilient place to live, work and invest. \n“With change comes opportunity and this debate will look at how we as a region are perceived externally and what we must do to make Newcastle a compelling place to do business if we are to become more financially independent and strengthen the economy.” \nNIBE was set up in May 2013 as an independent regional resource with an aspiration to become a focal point for good business behaviour. Read More \nThe public debate will be held in the Great Hall at the University’s Sutherland Building in Newcastle from 5pm until 6.30pm and tickets to the event are free of charge and can be ordered by visiting: www.northumbria.ac.uk/newcastles-future-as-a-responsible-city/ Like us on Facebook ", "external_links": [], "published": "2017-04-20T00:46:00.000+03:00", "crawled": "2017-04-19T20:36:45.000+03:00", "highlightTitle": ""}