{"organizations": [], "uuid": "b6d07b0b338da16d94811a64b8fb8e3fe03f0209", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12922525.ece/ALTERNATES/s1200/THERESA-MAY-NOT-POPULAR.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-announces-general-election-12931392", "country": "GB", "domain_rank": 21960, "title": "General Election countdown LIVE: Latest poll before the North East votes on June 8", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "General Election countdown LIVE: Latest poll before the North East votes on June 8", "spam_score": 0.0, "site_type": "news", "published": "2017-04-23T16:30:00.000+03:00", "replies_count": 0, "uuid": "b6d07b0b338da16d94811a64b8fb8e3fe03f0209"}, "author": "Kathryn Riddell", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-announces-general-election-12931392", "ord_in_thread": 0, "title": "General Election countdown LIVE: Latest poll before the North East votes on June 8", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Labour government could scrap Trident \nJeremy Corbyn has raised the prospect that a Labour government could scrap Britain’s Trident nuclear deterrent. \nIn his first major broadcast interview since the General Election was announced, the Labour leader refused to say whether maintaining the deterrent would be in the party’s manifesto. \nHe said that if he won power on June 8, he would order an immediate defence review which would look at “all aspects” of defence. \n“We will have a strategic defence review immediately which will include all aspects of defence. We would then look at the situation at that time,” he told BBC1’s The Andrew Marr Show. 11:19 Kathryn Riddell Could Tories win where Labour MPs have quit? \nConservatives believe Theresa May’s surprise General Election is their chance to make historic gains in the North of England - and demolish Labour’s claim to be the obvious choice for working class Northern voters. \nSitting Labour MPs in two of the seats under threat have already announced their intention not to stand again. \nMiddlesbrough South and Cleveland East MP Tom Blenkinsop quit with a broadside at Labour leader Jeremy Corbyn, saying; “I have made no secret about my significant and irreconcilable differences with the current Labour leadership.” Tom Blenkinsop \nHartlepool MP Iain Wright also said he was standing down. \nThey were joined by Pat Glass, MP in the safe Labour seat of North West Durham, and Dave Anderson, MP for Blaydon, bringing the number of quitting Labour MPs in the region to four. 11:05 KEY EVENT Half didn't vote last time \nJust half of voters went to the polls in one North East constituency at the last election . \nAnd the number of people who stayed at home was actually higher than the number who voted for the winning candidate in 25 out of 29 constituencies in the region. Postal ballot papers (Photo: Daily Record) \nOnly Stockton South, Tynemouth , Berwick-upon-Tweed and Hexham saw more people vote for the winning party than people who demonstrated their apathy or anger towards politics by not putting a cross next to any candidate’s name. \nTynemouth elected a Labour MP while the other three returned Conservative politicians. \nMiddlesbrough had the lowest turnout in the North East - only 52.9 per cent of voters in the area showed up to vote, eventually electing \nOnly four constituencies in the North East had a turnout figure of two voters in three or better at the last election. 10:50 Kathryn Riddell Ukip leader deciding whether to stand \nPaul Nuttall will decide within days if he will make another bid for Parliament, as he suggested Ukip will enter electoral pacts with “good Brexiteers”. \nThe Ukip leader endured a disastrous by-election campaign earlier this year as he failed to become MP for Stoke-on-Trent Central despite the constituency’s pro-Brexit leanings. Paul Nuttall (Photo: PA) \nHis party also lost its only MP in recent weeks after Douglas Carswell announced he would sit as independent. \nAsked if he will seek election at June’s general election, Mr Nuttall told the BBC’s Andrew Marr Show: “I will make a decision in the coming week as to where to stand.” 10:42 When will we know the result on June 9? \nOfficially the count goes through the night and finishes around 6am or 7am. Sunderland has been the first area to count its votes and declare its winners in the previous six elections (Photo: Getty Images Europe) \nHowever, unless it’s a very close run thing, the result can probably be called much earlier than that. \nBearing in mind the opinion polls at present, some are saying the result can be called right about now. \nHistorically Wearside constituencies tend to bring in the first results. The Houghton & Sunderland South result is expected to be the first one to come in at around 11pm. It was declared at 10.48pm in 2015 when Bridget Phillipson claimed the seat for Labour. 10:34 Kathryn Riddell Local elections in County Durham \nOf course it’s not just the General Election coming up...local elections are set to take place in a couple of weeks. \nVoters across County Durham are one area poised to head to the polls for the local elections on May 4. \nThe Labour-dominated council has been ruled by the party since it was established by the 1972 Local Government Act. \nThis year, all 126 councillors will be elected from 63 electoral divisions which will return either one, two or three county councillors each by first-past-the-post voting. County Durham local elections \nThe councillors will then serve a four-year term of office. \nLabour is fielding 126 candidates across every single division in the county, while the Liberal Democrats has put forward 49 candidates. \nThere are 74 independent candidates hoping for a seat on the council and the Conservative party has 76 candidates. \nUKIP has just 12 candidates standing across County Durham .", "external_links": [], "published": "2017-04-23T16:30:00.000+03:00", "crawled": "2017-04-23T11:57:34.000+03:00", "highlightTitle": ""}