{"organizations": [], "uuid": "4bbc447480e2f6a69e8ffa377e293a5eb0c38582", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11263538.ece/ALTERNATES/s1200/JS82876685.jpg", "site_section": "http://www.topix.com/rss/wire/tech", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12937083", "country": "US", "domain_rank": 21960, "title": "Business Breakfast LIVE: New jobs created at IT giant Accenture's North Tyneside base", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Business Breakfast LIVE: New jobs created at IT giant Accenture's North Tyneside base", "spam_score": 0.0, "site_type": "news", "published": "2017-04-25T14:05:00.000+03:00", "replies_count": 0, "uuid": "4bbc447480e2f6a69e8ffa377e293a5eb0c38582"}, "author": "", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12937083", "ord_in_thread": 0, "title": "Business Breakfast LIVE: New jobs created at IT giant Accenture's North Tyneside base", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT The Grind - maker of 'Newcastle's best burger' - plans Grainger Market opening \nIt’s been a good week for The Grind - and for the people of the North East it’s about to get even better. \nThe Grind won the People’s Champion award at the Battle of the Burger 2017 at Wylam Brewery two weekends ago, and it also won high praise from the Secret Diner in his latest review. \nNow the pop-up restaurant has set its sights on opening in Newcastle’s historic Grainger Market in its first permanent base. \nThe Grind was launched a year ago by three friends – Charlie Mair, Allan Hyslop and Tom Westman – who spent their careers working for leisure and catering firms in the North East before coming together with a mission to create a high-quality fast food venture. \nAfter testing recipes they launched The Grind, specialising in American-style cheeseburgers using locally sourced ingredients. \nA rapid rise in popularity has seen the venture go from a first outing at the Quayside Market, selling a small number of burgers, to becoming People’s Champion at last weekend’s Battle of the Burger 2017 at Wylam Brewery, having a pop-up restaurant at city centre bar No 28 and being named the producers of “Newcastle’s best burger” by the Secret Diner restaurant reviewer. \nNow, having built up a strong customer base at No 28, through Deliveroo and numerous festivals, markets and pop-up events, the trio are investing in a permanent base at The Grainger Market. \nNewcastle interiors firm Collective Design has signed up to draw up designs for The Grind’s unit at 87-88 Grainger Market, which will specialise in freshly-made takeaway food but include some counter seating for customers. \nCo-founder Charlie Mair said designs will be in keeping with the history of the market, with industrial and reclaimed materials, herringbone tiles and industrial lighting. \nHe said the Grainger Market unit will be operated in addition to everything else the firm currently runs, so there’ll be no change at No 28 and other pop-up appearances, where it has raised strong awareness of their brand and products. The Grind will soon be opening in The Grainger Market (Photo: The Grind) 9.06 Coreena Ford Major European deal for Newcastle's 'tweenage' haircare firm Shampooheads \nThey originally wowed the Dragon’s Den investors, have had two rounds of investments from NEL Fund Managers - and now Shampooheads are heading into Europe. \nThe Newcastle creators of the UK’s first range of haircare products for “tweenagers” has secured a contract to supply one of Europe’s leading haircare suppliers. \nAfter being trialled in a top hair salon chain, the Shampooheads Professional range of shampoos, conditioners and detanglers went on sale at the start of last year. \nNow Gieseke, a German company, has appointed a British haircare brand for the first time, marking a major leap forward in Shampooheads development and international expansion. \nGeoff Bell, owner of Shampooheads, said: “This is great news for Shampooheads and a major step in our growth plans and growing reputation across salons in Europe and the UK. \n“To work with Gieseke and to become the first UK supplier in their portfolio of leading worldwide brands is testament to the strength of our product range and the growing ‘tweenage’ hair care market we are aiming to dominate across the world. \n“We recently exhibited at Cosmorof Bologna in March and had a huge amount of interest from distributors around the world. We are therefore confident that we’ll be securing deals in the coming months that will see us making inroads into a wide range of new markets.” Shampooheads founders Colette and Geoff Bell with three of their young Brand Champions - their daughters Annie, Rosie and (centre) Lucy Wood (Photo: Shampooheads) 9.00 Coreena Ford Tech and finance companies dominate list of top-paying firms \nFinance and tech firms dominate a list of the highest paying companies in the UK, offering median salaries of between £80,000 and £110,000 a year, a study shows. \nUS cloud computing company Salesforce were found to be the best payers (£110,000), followed by Facebook (£95,600), consultants McKinsey (£92,800), Deutsche Bank (£90,000) and software firm SAP (£90,000). \nJobs site Glassdoor said its annual salary report found that most of the top payers had their global headquarters outside the UK. \nDr Andrew Chamberlain of Glassdoor said: “The big guns in tech and finance still dominate when it comes to large salaries in the UK. “Bankers tend to get pretty hefty bonuses, since successful traders can bring huge company returns, and tech salaries tend to be high because of a shortage in specialist skills such as data science and software engineering.” \nOther firms in the top 10 were the Royal Bank of Canada (£85,000), Macquarie Group (£83,000), Microsoft (£81,010), Nomura International (£80,000) and Credit Suisse (£80,000). Tech and finance firms top the list of highest paying companies in the UK 8.54 Coreena Ford Small firms raise fresh concerns over Brexit impact \nFresh concerns have been raised by smaller firms about the impact of Brexit on employing EU workers. \nA study showed that more than half of small businesses with EU workers are worried about accessing skilled staff. \nResearch among 1,200 members of the Federation of Small Businesses (FSB) found that one in five currently have EU staff. \nNearly three quarters recruited all of their EU workers when they were already living in the UK, and the vast majority of small firms have no experience using the UK’s points-based immigration system to recruit non-EU workers. \nThe FSB said its report highlighted the need for small firms to have continued access to labour and skills from the EU post-Brexit. If Brexit creates additional barriers to recruiting EU citizens, small firms that employ EU workers would consider moving their business abroad, reducing operations, or even closing down, said the FSB. \nChairman Mike Cherry said: \nThere is real concern among small firms with EU staff that they will lose access to the skills and labour their business needs to survive and grow. \nEU workers are a vital part of our economy, helping to plug chronic skills gaps across a wide range of sectors, and filling jobs in an already tight labour market. From packers to mechanics to graphic designers, small employers need to be able to hire the right person for the right job at the right time. \nSecuring the right to remain for EU workers in the UK must be a priority. Mike Cherry, chair of the Federation of Small Businesses 8.48 KEY EVENT Reaction to will.i.am joining Atom Bank as strategic director \nWill.i.am joining the board at Atom Bank was probably one of the most unexpected - and brilliant - sentences we had to write yesterday. \nAnd the Twittersphere was suitably impressed too. \nAtom Bank broke the news in a press release - and in this understated tweet. \nAnd the man himself tweeted his excitement first thing this morning. 8.35 Coreena Ford Life sciences companies in North do better than those in the South, despite funding gap \nLife sciences organisations in the North are outperforming their counterparts in the South when it comes to innovation, a new study suggests. \nThe research commissioned by the Northern Health Science Alliance (NHSA) – an grouping of eight universities and four science networks – found the North produces roughly the same number of patent applications despite receiving less than half the funding of that in the capital. \nOver the last 10 years, 386 patents were produced in the North’s life sciences sector – a figure second only to London, which produced 401. \nThat rate of innovation came despite the North receiving only 13.5% of health research funding, compared to London’s 32.1%. \nThe research has prompted NHSA – whose members include Newcastle and Durham universities – to call for more funding for life sciences companies in the North, both from public sources and venture capitalists. \nNHSA chief executive Dr Hakim Yadi said: “There is no doubt the North of England is an energised exciting place to do health research, and the fact that it outstrips Oxford or Cambridge in its ability to produce novel inventions, despite seeing much less support in terms of funding, demonstrates that irrefutably.” \nScotland also produces a high number of life science patents, at 304. This is almost the same number as those produced in Oxford and Cambridge combined. \nDr Yadi added: “To flourish as an innovation economy post-Brexit, the UK needs to wake up to the life science and health innovation opportunity in the North and unlock the full force of the Northern Powerhouse through supporting the development of new investment funds and ensuring the life science sector deal supports commercialisation beyond the golden triangle.” Quantum Pharma laboratories Coreena Ford \nNewcastle headquartered Virgin Money has hailed continuing strong performance in a trading update. \nThe firm issued an update for the first quarter of the financial year, citing a flourishing mortgages and savings business, new highs in customer satisfaction, and good progress in its strategy to create a digital bank. \nJayne-Anne Gadhia, chief executive officer said: \n“I am delighted with the ongoing momentum and performance of the business so far in 2017. Our customer-focused strategy of growth, quality and returns continues to deliver excellent results and demonstrates the benefits of our low-risk business model, strong balance sheet and ongoing focus on operational excellence. \n“Our mortgages and savings business continue to flourish with gross mortgage lending of £2.0 billion and a £0.9 billion increase in deposits during the quarter. Whilst maintaining our strong focus on asset quality, credit card balances grew by £0.2 billion to £2.7 billion. Our approach, including the strict and consistent application of underwriting standards, continues to support a low and stable cost of risk. \n“Our focus on customer service has led to new highs in customer satisfaction with our overall Net Promoter Score improving to +39, making us one of the best-rated retail banks in the UK. We remain committed to delivering growth, quality and returns and to ensuring our strategy delivers long-term success for the benefit of all of our stakeholders.” Jayne-Anne Gadhia, chief executive officer of Virgin Money (Photo: Chris Radburn/PA Wire) 8.25 Coreena Ford Will.i.am joins the board at Durham's Atom Bank \nRap superstar will.i.am has joined the board of Atom Bank in one of the more unusual business link-ups. \nThe Black Eyed Peas star, known for his role as a judge on ITV show The Voice, has signed with the Durham challenger bank as its first strategic board advisor, with the company saying he will provide the firm with an “external perspective on culture, philanthropy and technology”. \nThe deal, which was first rumoured earlier this year, is a huge coup for Atom, which is hoping to shake up the banking world with its mobile-based app and personalised services. \nNo financial details have been given on the partnership, though it was said the deal could be worth up to £4m for the rapper. \nAnnouncing the deal, Atom founder and chairman Anthony Thomson said, “Like us, will.i.am believes that technology can better and simplify our lives, which is at the heart of all that we are passionate about at Atom. As we develop the range of products and services on offer to customers, will.i.am’s unique view on the world and knowledge of future trends will be a great asset for us.” \nCommenting on the deal, will.i.am said: “Our lives are faster than ever before, but the banking industry hasn’t kept up. \n“The scale of Atom’s ambition to help people understand and manage their money better, and its clever use of technology to give people an entire bank on their phones is awesome. I’m looking forward to working with Atom to achieve success in everything we will do together.” \nAtom Bank was formed in April 2014 by Metro Bank founder Anthony Thomson, who chose to locate it in Durham. \n(And yes, we’ve asked about getting access to the new director at a forthcoming board meeting and been told: “Watch this space”) Will.i.am (left) and (right) Atom Bank staff and headquarters in Durham 8.20 Coreena Ford Tougher trading sees Carpetright issue profits warning \nRetailer Carpetright has warned over profits after seeing sales growth slow as consumer caution took its toll. \nThe flooring chain reported UK like-for-like sales rising by 1.4% in its final quarter to April 22, down from 1.9% in the previous three months, amid a “more difficult consumer environment”. \nChief executive Wilf Walsh cautioned that the tougher trading would leave annual underlying profits towards the lower end of expectations for between £13.9m to £16.2m in the year to April 29. \nThis is set to mark a sharp fall on the £17.3m posted the previous year. \nMr Walsh said: “In common with other retailers in the home improvement sector in the UK, we have experienced tougher trading conditions over the last three months. \n“Whilst we remain confident in our turnaround plan, the level of sales growth in our final quarter leads us to expect that full-year profits will be towards the lower end of the current range.” \nCarpetright’s slowing sales growth marks a wobble in its recovery after returning to positive UK sales in the previous three months. The group suffered a bumpy 2016 after the Brexit vote and collapse of the pound, with first half profits slumping 42% to £4.1 million after being hit by falling consumer demand, stiff competition and rising costs of imported goods. \nBut Mr Walsh plans to plough on with its overhaul, having refurbished 188 stores in its fourth quarter, more than the 150 expected. It also closed three stores and relocated two stores into smaller sites, leaving it with 414 in the UK and 13 concessions. Its 138-strong chain across Europe reported a 1.4% rise in like-for-like sales over the final quarter, with the boost from the lower pound helping total sales in the region jump 11% higher. A Carpetright store Coreena Ford Whitbread warn of tough times, despite Costa Coffee and Premier Inn profits rise \nCosta Coffee owner Whitbread has cheered a jump in annual profit, but said it remains “cautious” amid forecasts for a tougher year ahead. \nThe group reported a 6.2% rise in underlying pre-tax profits in the 52 weeks to March 2 to £565.2m, while total revenue increased by 8.2% to £3.1bn. \nIt comes as its Premier Inn and restaurants business chalked up a 7.4% rise in full-year underlying operating profit to £468 million, while the Costa unit saw a 5.3% rise to £158m. \nHowever, chief executive Alison Brittain said the company is steadying itself for the months ahead. \nIt comes as retailers start to prepare for a pullback in consumer spending due to rising inflation, caused by the post-Brexit vote collapse of the pound. \nUK inflation has risen to 2.3%, but forecasts by the Bank of England expect that number to rise to 2.7% by the end of 2017, before peaking at 2.8% in the first half of 2018 and easing to 2.4% by 2019. \n“Whilst we are only seven weeks into our new financial year, Premier Inn has had a good start to the year and Costa has also seen positive like-for-like sales growth, although we remain cautious and expect a tougher consumer environment than last year,” said Ms Brittain. Costa Coffee and Premier Inn profits are up at Whitbread (Photo: PA) 8.10 FTSE and pound latest \nThe FTSE-100 index opened at 7264.68. \nThe pound at 8am was 1.2809 dollars compared to 1.2784 dollars at the previous close. The euro at 8am was 0.8499 pounds compared to 0.8492 pounds at the previous close. 8.00 KEY EVENT Accenture creates new jobs at Cobalt Business Park base \nNorth East IT giant Accenture is creating 60 new jobs at its North East base as its seeks to expand its technology and consulting divisions. \nThe firm said it plans to take on the new starters by the end of this financial year - which ends on August 31 - at its Newcastle Deliver Centre at Cobalt Business Park. \nAccenture said the expansion reflects Accenture’s ongoing investment in the North East and its support for the Government’s plans to rebalance the national economy by establishing the North of England as a global economic powerhouse. \nThe new positions, in the company’s technology and consulting workforces, will range from entry-level to experienced executives and include support for clients of Accenture’s health and public service practice. \nThe firm said its recruitment drive, part of a strategy to broaden its consulting workforce outside London, will enable Accenture to deliver a broader set of consulting capabilities from its Newcastle Campus. \nMark Larsen, managing director for Accenture Newcastle, said: \nWe are looking for skilled and highly motivated individuals who share our commitment to helping clients succeed in the digital economy. \nAccenture already has a strong presence in the North East, with established links to its flourishing business and academic communities. \nOur new hires will enable us to further expand our local footprint and ensure that our strategic consulting advisory practice is well-positioned to take advantage of the wealth of talent and opportunities in the North East. \nIn the last few years, Accenture has doubled its Newcastle workforce across its Technology, Operations and Consulting workforces, including taking on more than 100 apprentices. \nNorma Redfearn, the elected mayor of North Tyneside, added: “Accenture’s strong growth and local job creation has contributed significantly to the regional economy in recent years. \n“The company’s commitment to the North East is helping our local tech sector to flourish, and we welcome the news that Accenture is expanding its consulting presence here, as that will support our drive to attract and retain more talent in the region.” Mark Larsen, MD of Accenture in North Tyneside Share ", "external_links": [], "published": "2017-04-25T14:05:00.000+03:00", "crawled": "2017-04-25T10:49:46.000+03:00", "highlightTitle": ""}