{"organizations": [], "uuid": "05e33f2fa0433401e426097915bbc987ed66b27b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12577814.ece/ALTERNATES/s1200/Prime-Ministers-Questions.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-announces-general-election-12911249", "country": "GB", "domain_rank": 21960, "title": "General Election vote LIVE: MPs to vote on allowing a snap election after Corbyn and May do battle at PMQs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "General Election vote LIVE: MPs to vote on allowing a snap election after Corbyn and May do battle at PMQs", "spam_score": 0.0, "site_type": "news", "published": "2017-04-19T18:30:00.000+03:00", "replies_count": 0, "uuid": "05e33f2fa0433401e426097915bbc987ed66b27b"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-announces-general-election-12911249", "ord_in_thread": 0, "title": "General Election vote LIVE: MPs to vote on allowing a snap election after Corbyn and May do battle at PMQs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BREAKING: MPs authorise 2017 general election by a landslide \nMPs have just authorised the 2017 general election by a landslide. (Photo: Getty Images Europe) \nThey voted 522-13 in favour of the poll on June 8 in a historic vote in the House of Commons. \nTheresa May needed the backing of two-thirds of MPs under the terms of the Fixed Term Parliaments Act. \nBut she easily won their approval after the Lib Dems and Labour both said they welcomed an election. \nLabour leader Jeremy Corbyn told MPs it was a chance for the British people to bring an end to Tory austerity. \n“The election gives the British people a chance to change direction,” he said, blasting the PM’s refusal to appear in TV debates. 14:29 MPs are now formally voting on a second general election \nMPs are now voting on the formal motion to hold an early general election. \nWe will have the result in 15 minutes. \nIt is expected to pass its threshold (434 MPs) by a landslide, but some MPs will vote against. \nThey include the SNP, who warned other party members are “turkeys ready to jump into the baking tin”. 14:29 Katie Collings MP is not buying Theresa May's \"ridiculous\" explanation for why Britain needs an election \nLabour MP Roger Godsiff is not happy we’re having an election - or for Theresa May’s claim it’s in the national interest. \n“The justification is quite frankly disingenuous,” he fumes. \n“To suggest she needs a mandate to negotiate Brexit is just ridiculous. She was given a mandate by the British people.” \nHe says the Prime Minister is being “purely opportunistic”. 14:15 KEY EVENT Tim Farron finally says being gay is NOT a sin \nLib Dem leader Tim Farron has finally said being gay is NOT a sin after dodging the question four times on national TV. (Photo: PA) \nHe was asked the question by Tory MP Nigel Evans in the House of Commons after facing attacks for his swerving last night. \nThe committed Christian, claimed it would be a “theological pronouncement” when confronted by Channel 4 News. \nFormer Great British Bake Off host Sue Perkins tweeted: “Tim Farron failing to clarify his views on the gay community. It’s 2017.” \nLabour activist Jack Slater added: “To hold the belief that homosexuality is sinful is disgusting. Tim Farron, you are no progressive.” \nAsked if he thought “being gay is a sin?” by Mr Evans today, Mr Farron finally said: \n“I do not. I do not. \n“I am very proud to have gone through that lobby… in the coalition government where the Lib Dems created gay marriage, equal marriage. \n“There is much more to be done. \n“If we campaign in this election as we will for an open tolerant united society then we need to make sure we do not in any way be complacent about LGBT rights.” \nHe tried to move on as a voice in the Commons chamber shouted: \n“Disgrace!” \nMr Farron added: \n“I’m flattered so many people want to know my views. \n“I will put myself up for a leader’s debate... You will have more chance to scrutinise me then.” 13:54 Farron refused to rule out Tory coalition \nLib Dem leader Tim Farron tells the House of Commons: \n“There is only one route to the Prime Minister losing this general election and it is a Liberal Democrat route. \nHe’s asked if he will rule out another coalition with the Tories if the prospect comes up. \nHe does not. He says MPs “need to be a little bit patient and their patience will be rewarded.” 13:50 Tom Eden Will the Lib Dems get into bed with the Tories? \nAsked by another MP (over and over and over again) if he will rule out a coalition with the Conservatives, Farron refuses to answer directly. He says he does not expect the election to result in a “balanced parliament” (Lib Dem-speak for a hung parliament) Tim Farron Tories destroying Corbyn will be “taking candy from a baby” \nSelf-described ‘Remoaner-in-chief’ Tim Farron , the Lib Dem leader, is speaking in the debate now. \nHe says \n“It’s hardly surprising that the PM has put party before country just like David Cameron did in calling the EU referendum. \n“She has pursued the hardest form of Brexit, driving division instead of cohesion. \n“Not because she needs a mandate... the Labour party have given her a mandate to deliver Brexit! \n“She looks across the despatch box and she could not resist the temptation of doing the political equivalent of taking candy from a baby and facing a Labour party in a general election. \n“She expects a coronation and not a contest.” 13:44 Tom Eden PM 'wont change her position' \nLaura Kuenssberg, the BBC’s political editor believed Theresa May will not take part in any debates. \nShe said: \nA Number 10 source says the prime minister won’t be changing her position on the TV debates, despite ITV announcing it will hold a leaders’ debate in the run up to the general election. TV debates Tom Eden May accused of 'bottling it' \nLiberal Democrat leader Tim Farron has accused Mrs May of “bottling” and said broadcasters had a “moral duty” to go ahead with the showdowns even if she fails to take part. \nAnd Plaid Cymru leader Leanne Wood - whose profile received a major boost from her involvement in two of the 2015 broadcasts - said: “Theresa May should be empty chaired if she doesn’t show up to any planned TV debates.” \nSNP leader and Scottish First Minister Nicola Sturgeon argued that TV debates should go ahead without Mrs May. \nMs Sturgeon tweeted: “If PM doesnt have the confidence to debate her plans on TV with other leaders, broadcasters should empty chair her and go ahead anyway.” TV debates Tom Eden Corbyn calls on May to take part \nWithin hours of the Prime Minister announcing her June 8 snap election, Labour leader Mr Corbyn threw down the gauntlet to Mrs May to agree to televised debates, which he said were “what democracy needs and what the British people deserve”. \nAnd at PMQs in the Commons, he told her: \n“She says it’s about leadership, yet is refusing to defend her record in television debates and it’s not hard to see why. \n“The Prime Minister says we have a stronger economy, yet she can’t explain why people’s wages are lower today than they were 10 years ago or why more households are in debt, six million people earning less than the minimum wage, child poverty is up, pensioner poverty is up. \n“Why are so many people getting poorer?” \nThe Scottish National Party’s leader in the Commons, Angus Robertson, also challenged Mrs May over debates, asking: “If the Prime Minister is so confident of her hard-Brexit, pro-austerity, anti-immigration case, why won’t she debate opposition leaders?” \nITV confirmed that it will stage a leaders’ debate as it did in 2010 and 2015. \nNo details of format or date have yet been released, but it is expected that Julie Etchingham will host the programme, as she did in 2015, when seven leaders including David Cameron, Ed Miliband and Nick Clegg took part in a two-hour showdown. 13:38 KEY EVENT TV debates WILL happen \nITV has confirmed it will host a leaders’ debate during the general election campaign, despite Theresa May’s insistence that she will not take part. \nMrs May faced taunts of “frit” from Labour backbenchers at Prime Minister’s Questions in the House of Commons, as leader Jeremy Corbyn accused her of running scared of scrutiny on her record. \nThe Prime Minister confirmed on Wednesday that she will not face Mr Corbyn and other party leaders in live TV debates in the run-up to the June 8 poll, insisting that campaigning should be about getting “out and about” meeting voters. \nThere have been calls for TV broadcasters to “empty chair” Mrs May in election-time leaders’ debates if she refuses to take part. \nBut she told BBC Radio 4’s Today programme: “We won’t be doing television debates.” \nMrs May added: \n“I believe in campaigns where politicians actually get out and about and meet with voters. \n“That’s what I have always believed in, it’s what I still believe and I still do it - as Prime Minister, as a constituency MP, I still go out and knock on doors in my constituency. \n“That’s what I believe in doing, that’s what I’m going to be doing around this campaign.” 13:28", "external_links": [], "published": "2017-04-19T18:30:00.000+03:00", "crawled": "2017-04-19T14:14:27.000+03:00", "highlightTitle": ""}