{"organizations": [], "uuid": "6aabd7a5f346db6ce55d887f24ca9897beba9f0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12009052.ece/ALTERNATES/s1200/JS64662097.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12884660", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Sainsbury's speeds up roll-out of Argos in supermarkets - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Business Breakfast RECAP: Sainsbury's speeds up roll-out of Argos in supermarkets - Chronicle Live", "spam_score": 0.001, "site_type": "news", "published": "2017-04-13T16:01:00.000+03:00", "replies_count": 0, "uuid": "6aabd7a5f346db6ce55d887f24ca9897beba9f0b"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12884660", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Sainsbury's speeds up roll-out of Argos in supermarkets - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "hays", "sentiment": "none"}, {"name": "john gill", "sentiment": "none"}, {"name": "gill", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "alan peterson", "sentiment": "none"}, {"name": "matt ridley", "sentiment": "none"}, {"name": "colin wood", "sentiment": "none"}, {"name": "viscount matt ridley", "sentiment": "none"}, {"name": "alistair cox", "sentiment": "none"}, {"name": "hollick", "sentiment": "none"}], "locations": [{"name": "north america", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "gentoo", "sentiment": "none"}, {"name": "coaley lane", "sentiment": "none"}, {"name": "houghton-le-spring", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "broomhill", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "doxford park", "sentiment": "none"}, {"name": "hetton-le-hole", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "gentoo", "sentiment": "negative"}, {"name": "sainsbury", "sentiment": "negative"}, {"name": "electricity market", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}, {"name": "office for budget responsibility", "sentiment": "none"}, {"name": "journal energy", "sentiment": "none"}, {"name": "coreena ford hays", "sentiment": "none"}, {"name": "coreena ford north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "gentoo homes", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "chamber of commerce’s quarterly economic survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nThe development wing of housing company Gentoo has increased profits by 10%. \nSunderland-based Gentoo, which derives the majority of its income from its social housing business, also builds new homes around the North East and that part of the business last year delivered 233 new properties and increased its turnover to £44m. \nThe company also received planning permission for more than 450 new properties, including developments at Coaley Lane in Houghton-le-Spring , High Usworth in Washington and Broomhill in Hetton-le-Hole that will between them deliver 312 new homes. \nThe success of the development wing comes at a time that Government support for social housing is falling, and the profits from Gentoo Homes have been reinvested back into Gentoo’s affordable housing programmes. \nGentoo Homes managing director Colin Wood said: “I’m immensely proud of our staff and what they have achieved over the past year. \nWe build high quality, spacious homes in desirable locations across the North East and based on consumer demand the business is on track to increase property sales by 25% in the coming financial year.” Homes at Doxford Park built by Gentoo 8.30 Coreena Ford New CEO hunt begins at HSS Hire \nThe boss of tool supplier HSS Hire is stepping down after eight years, triggering the hunt for a successor. \nChief executive John Gill will leave the company after a handover period once a permanent replacement has been found. \nThe firm said it will make a further announcement once his leaving date has been confirmed. \nChairman Alan Peterson said Mr Gill had made an “important contribution” since joining the firm in 2009. \nAs CEO from September 2015, he has led the company through a period of significant change as we implemented our new operating model. \nWith this work now largely complete, the focus shifts to driving sales growth through the new network and the board believes it is the right time to look outside the business for a new CEO who can lead this next phase of our recovery. 8.25 Coreena Ford Hays hikes profits forecast despite tough London market \nRecruitment firm Hays has unveiled record takings despite grappling with a slowdown in its UK and Ireland business as London trading remained tough. \nThe company said net fees for the third quarter had hit an all-time high, driven by an 18% leap in like-for-like growth across continental Europe and the rest of the world. \nThe recruiter said it now expected annual operating profit to be at the top range of market predictions of between £199m and £209m. \nHowever, the United Kingdom and Ireland slipped 4% for the three months to the end of March this year, as it was dragged down by an 8% decline in the capital. \nThe firm flagged earlier this year that the UK business had suffered a Brexit hit, as British companies applied the brakes to their hiring plans following the EU referendum vote. \nHays, which employs 9,600 people across 33 countries, said total net fees grew 10% on a like-for-like basis over the period thanks to a strong international trading. \nChief executive Alistair Cox said the record fee performance had given the firm confidence to lift its expectations for full-year profits. \nHe said: “Growth was broad-based and driven by strong performances in our international businesses. Europe delivered excellent results, led by an all-time record performance in Germany, as we continued to invest in additional headcount. \n“Growth in Australia accelerated further and was strong across all states. In the UK, while the public sector market remained tough, we saw continued signs of improvement in the private sector market. \n“Looking ahead, conditions remain good in the vast majority of our markets, notably Australia, Europe and North America. In the UK, market conditions remain in line with the underlying Q3 trends.” Recruitment firm Hays has unveiled record takings 8.20 Coreena Ford North East exports fall for second quarter despite Brexit-hit pound \nExport sales in the North East have fallen for the second quarter in a row despite many manufacturers claiming the weak pound was boosting business. \nThe findings were made in the North East England Chamber of Commerce’s Quarterly Economic Survey, which tracks the growth of companies across the region. \nExport sales received a score of -3.6, which means that overall overseas sales fell marginally over the year. It is the first time since 2009 that export sales have fallen for two consecutive quarters. \nThe drop was mainly caused by service sector exports, although manufacturing exports remained flat. \nManufacturers in the North East were expected to see a boost to overseas sales after gaining a competitive edge from the decreased value of the Brexit-hit pound. \nOn the upside, domestic sales in the North East saw robust growth after achieving a score of +22.3. \nRoss Smith, the Chamber’s director of policy, said: “There is good news in this latest set of results with the UK order books in the best shape they have been for nearly two years. These improved figures are reflected in both the manufacturing and service sectors. \n“There are worrying trends in these results however, with export sales showing a negative score for the second successive quarter, the first time this has happened since 2009. \n“Export markets offer huge potential to our companies and we need to have more support for them to explore these marketplaces.” Ross Smith, the North East Chamber of Commerce director of policy 8.15 Coreena Ford North East peer Matt Ridley calls for cheaper energy for consumers \nThis week the Government committed a further £300m in subsidies to the renewable energy as it continues to strive to reduce emissions from the electricity industry. \nThe current polices have been a success in one regard, with the UK now past halfway on the path to cut emissions by 80% by 2050. \nBut, earlier this year Office for Budget Responsibility highlighted how environmental levies will triple from £4.6bn last year to £13.5bn in 2021 - and account for 25% of domestic energy bills by then. \nMeanwhile, concerns are growing over the nation’s energy security with margins on the power grid at almost record lows, and the country unable to secure any new gas power stations since 2012. \nA damming new report from a cross-party group of Peers says the Government should shift focus from cutting emissions to energy security and cutting costs for homes and businesses. \nThe Price of Power: Reforming the Electricity Market sought views from some of the industry’s key payers and makes a series of recommendations to the Government. \nLord Hollick, the committee’s chair, said: “We are critical of the drift that’s taken place over the last 15 years or so, which has delivered on the decarbonisation agenda but very much at the expense of consumers paying 58% more than they were in 2003. On the affordability front we haven’t looked after consumers.” \nThe Government has yet to publish its response but last month we reported a senior Whitehall official tell a North East audience the Government’s focus will now be on cutting energy costs. \nThis has been further fuelled by reports from Bloomberg last week that the Government is seeking to abandon its EU commitment of securing 15% of energy from renewable sources by 2020. \nHe told Journal Energy: “There is a growing understanding in Government, and amongst economists, that messing about with the energy sector is a really dangerous thing to do, risking long term damage to prospects for economic growth. Viscount Matt Ridley ", "external_links": [], "published": "2017-04-13T16:01:00.000+03:00", "crawled": "2017-04-13T21:28:10.472+03:00", "highlightTitle": ""}