{"organizations": [], "uuid": "f1298d57bd3456e8b6edeeda0c9e81bcde5d11c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30264364/15951440.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/nature-s-defenders-demand-strategy-to-reverse-horrendous-wildlife-decline/story-30264364-detail/story.html", "country": "GB", "title": "Devon's defenders demand strategy to reverse 'horrendous'...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Devon's defenders demand strategy to reverse 'horrendous'...", "spam_score": 0.0, "site_type": "news", "published": "2017-04-12T00:17:00.000+03:00", "replies_count": 0, "uuid": "f1298d57bd3456e8b6edeeda0c9e81bcde5d11c8"}, "author": "Western Morning News", "url": "http://www.devonlive.com/nature-s-defenders-demand-strategy-to-reverse-horrendous-wildlife-decline/story-30264364-detail/story.html", "ord_in_thread": 0, "title": "Devon's defenders demand strategy to reverse 'horrendous'...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Devon's defenders demand strategy to reverse 'horrendous' wildlife decline X \nCopy link to paste in your message / Comments (0) \nEnvironmental groups are calling on the government to offer more than vague promises in its much-delayed 25-Year Strategy for Nature. \nA draft leaked to the BBC is “light on details\", according to Catherine Weller, head of biodiversity at environmental lawyers ClientEarth, who was shown the document. \n“They paint a great picture of an England that has a wonderful healthy environment, but don't explain what is going to change to make that possible,\" she said. \nHarry Barton, chief executive of Devon Wildlife Trust, called for a plan to restore nature, and not just to protect what we have left. \n“The majority of species in England are still in decline, and we need to reverse that,\" he said. \n“If you look at how much we have lost since the 1950s, the statistics are horrendous.\" \nHe said that as Britain leaves the EU, the government needs to have clear mechanisms \nthrough a new framework Act taking on European regulations. \nBritain should look at examples such as United States tax breaks and exemptions to incentivise environmental protection by landowners. \n“The South West is a really important area for the natural environment,\" Mr Barton said. “We are heavily dependent on tourism and on farming. \nWe have to ask ourselves why people come down here on holiday. It's because it is beautiful and the seas are clean. That is good for people's health and wellbeing. \n“If we want to care for our own future, let along the wildlife, then we need to invest in the natural environment.\" \nHe called on the government to set targets. Brexit could spell disaster for Devon wildlife \n“You can't hope to reverse the loss of tens of thousands of acres of ancient woodland in five years. You need to set long-term targets.\" \nMs Weller, from ClientEarth, agreed, saying the leaked document talked about environmental assets but did not set any targets for improving these. \n“They just say they need to be 'better'. The problem is that 'better' isn't measurable.\" \nShe said EU law formed the backbone of our environmental protection, but that there was still room for improvement during the Brexit process. \n“We need to ensure that EU laws are maintained and in the Great Repeal Bill (which will transpose EU law into domestic law) their status is such that they can't be overturned on a whim by ministers.\" \nShe said primary legislation was needed so that Parliament could debate any changes and the government would be held to account by the public. \nThe leaked document also failed to satisfy farmers. \nGuy Smith from the NFU told BBC Radio 4's today programme that if badly designed new environmental regulations “constrained or curtailed\" food production, Britain would have to start importing more food. \nThe imports “may well come from parts of the world where environmental standards are lower\", he said. \n“If you reforest vast tracts of British farm land, the net effect is probably to wipe out great amounts of rainforest in other parts of the world.\" Why Devon matters \nFragmentation of habitats is accelerating the decline of many threatened species across England. \nMost of Europe's last remaining greater horseshoe bats live in a small area on the southeast fringe of Dartmoor - a population Devon Wildlife Trust is committed to defending. \n\"You can see them disappearing year on year,\" Harry Barton, chief executive of the trust, said. \n\"As recently as the 1970s there were roosts of more than 15,000 bats. The largest now known in abut 4,000. \n\"Unless action is taken now, the greater horseshoe bat has a problem.\" \nThe trust is also working to save the freshwater pearl mussel. One of the mussels' few remaining populations is in the River Torridge, where it hasn't bred for a decade. \nREAD NEXT", "external_links": [], "published": "2017-04-12T00:17:00.000+03:00", "crawled": "2017-04-11T20:02:53.091+03:00", "highlightTitle": ""}