{"organizations": [], "uuid": "cf0e30eb993f24a769a0729d1b200ddcdae69471", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30277316/15960625.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/mps-react-to-snap-general-election-call/story-30277316-detail/story.html", "country": "US", "title": "Devon MPs react to snap General Election call | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Devon MPs react to snap General Election call | Devon Live", "spam_score": 0.151, "site_type": "news", "published": "2017-04-18T20:24:00.000+03:00", "replies_count": 0, "uuid": "cf0e30eb993f24a769a0729d1b200ddcdae69471"}, "author": "", "url": "http://www.devonlive.com/mps-react-to-snap-general-election-call/story-30277316-detail/story.html", "ord_in_thread": 0, "title": "Devon MPs react to snap General Election call | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon live devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "oliver", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}, {"name": "oliver newton colvile", "sentiment": "none"}, {"name": "sam blackledge", "sentiment": "none"}, {"name": "johnny", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "gary streeter", "sentiment": "none"}, {"name": "kevin foster", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}, {"name": "south west devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "plymouth sutton & devonport", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon MPs react to snap General Election call By DanielClark | Posted: April 18, 2017 1 COMMENTS SHARES Comments (1) \nPolitical figures across the South West have reacted to the shock news made this morning by UK Prime Minister Theresa May to call for a snap general election. \nShe made the surprise statement in Downing Street this morning after her cabinet meeting and explaining her decision, she said that when she became prime minister the country needed stability and that she has now delivered that. \nTorbay MP Kevin Foster has confirmed that he will be re-standing for election. @GrumpyDevonian Thanks. I will be standing.— Kevin Foster (@kevin_j_foster) April 18, 2017 \nKevin Foster said: \"It's quite a surprise. There was no pre-briefing. She made her statement to MPs at the same time as the rest of the country. But we need to have a positive debate across the country about how the country goes forward. I think people in Torbay will have strong views about having Jeremy Corbyn as their Prime Minister. \n\"I'm hoping to be re-elected but you can't take anything for granted. I hope people will think I have done good work and I will secure another term doing the job I have loved doing for the last two years. I will be hitting the campaign trail.\" \nTotnes MP Dr Sarah Wollaston has said that this would give her a full mandate for her policies. It will be for Parliament to decide given FTPA but the PM has called Corbyn's bluff in seeking a full mandate for her policies — Sarah Wollaston MP (@sarahwollaston) April 18, 2017 \nOliver Newton Colvile, MP for Plymouth Sutton & Devonport, said: \"I am as surprised as everybody else is, but I will most certainly be a candidate in the election, subject to the local party deciding they want to reselect me. \n\"I have a job to do, I am prepared to stand and hopefully win, but I am not taking anything as a foregone conclusion. I am all too aware how very important it is that Plymouth has a strong Conservative voice in the House of Commons. \n\"I think one of the differences is if the Labour Party were to form a Government under Jeremy Corbyn there would be a very big issue about the future of the nuclear deterrent, that would mean that jobs at the dockyard on submarines would be very much in danger. That would be one of the things I will be campaigning on. \n\"The wider issue is making sure we have improvements to our railway line. \n\"I will be setting our my vision for the future of Plymouth, delivering economic growth, I will produce another six-point plan which clearly sets out exactly my vision. \n\"Absolutely. I have never given that up since the day I first joined the Conservatives in 1976. I am determined to help my friend Theresa May make sure she has got the mandate to continue doing the work she's going to do and deliver on Brexit.\" Plymouth MP @olivercolvile tells me he will put dockyard submarine jobs at the heart of his re-election campaign pic.twitter.com/PXvt0FbRa1 — Sam Blackledge (@samblackledge) April 18, 2017 \nPeter Heaton-Jones, MP for North Devon, said; \"I welcome Theresa May's announcement that she will seek approval from the House of Commons for a general election on June 8th. \n\"At this vital time for our country, it's right to end the uncertainty and seek to renew the Conservative government's mandate. \n\"This election will be about one thing and one thing only: who do you want to lead Britain? It's a straight choice between Theresa May or Jeremy Corbyn. \n\"The maths is clear as well: if we don't have a Conservative MP in North Devon, it increases the risk of a far-left Labour government. Mr Corbyn would be Prime Minister, possibly propped up by the minor parties. That would be a disaster for the UK. \n\"I, and the Conservative government, will proudly stand on our record in seeking a renewed mandate. I look forward to campaigning hard for that in North Devon over the next six weeks.\" \nGary Streeter MP (South West Devon) said: \"I was shocked, I didn't expect it. I had hoped for an early election to try to increase our majority and stand us in good stead for the very difficult negotiations in the next two years. \n\"I was on my way to the train station when I heard the news, I went home and sought my wife's permission to stand for Parliament yet again, which she graciously gave. \n\"I am raring to go. I will be looking to campaign in South West Devon on the need for strong leadership and a clear and coherent plan.\" \nOn the two inner-city seats: \n\"I think they will be hard fought. I will be helping both Oliver and Johnny, they are both tremendous MPs. \n\"In those seats of course Labour are in second place. People are going to have to choose between the local candidates, but also between Theresa May and Jeremy Corbyn as Prime Minister.\" ", "external_links": [], "published": "2017-04-18T20:24:00.000+03:00", "crawled": "2017-04-18T15:03:53.446+03:00", "highlightTitle": ""}