{"organizations": [], "uuid": "6b7fd0bc446f94dd0cff15961df0a94c7b20ba7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30279781/15962247.jpg", "site_section": "http://www.westernmorningnews.co.uk/farming.rss", "section_title": "Devon Live Farming RSS feed", "url": "http://www.devonlive.com/new-name-and-look-revealed-for-beef-south-west-event/story-30279781-detail/story.html", "country": "GB", "title": "New name and look revealed for Beef South West event", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "New name and look revealed for Beef South West event", "spam_score": 0.0, "site_type": "news", "published": "2017-04-19T16:44:00.000+03:00", "replies_count": 0, "uuid": "6b7fd0bc446f94dd0cff15961df0a94c7b20ba7d"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/new-name-and-look-revealed-for-beef-south-west-event/story-30279781-detail/story.html", "ord_in_thread": 0, "title": "New name and look revealed for Beef South West event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New name and look revealed for Beef South West event   19,   Cattle exhibitors in the ring at Beef South West in 2015. Sheep will also be shown at this year’s event New name and look revealed for Beef South West event   Cattle exhibitors in the ring at Beef South West in 2015. Sheep will also be shown at this year's event Comments (0) \nBeef South West, one of the region's red-circled calendar events, will return this year with a new name, organisers have revealed. \nThe specialist one-day event, which traditionally kicks off the winter showing season, will from this year's event on Wednesday, November 8 be renamed Agrifest South West. \nIt comes as, in a bid to increase appeal to a wider audience, a sheep section will now be included in the programme of events at Westpoint near Exeter. \n\"Exhibitors have been asking for sheep classes, so we decided to add prime lamb classes to the primestock show,\" said event secretary Vicky Smith, who added that organisers will be working closely with National Sheep Association Sheep West to launch the new section. \"With the inclusion of sheep it was felt a new name was also needed, so Agrifest South West was born. \n\"We feel this will open up the event to another sector of the agricultural industry and as Westcountry beef and lamb have been awarded PGI (Protected Geographical Indication) status it made perfect sense to add them to the event, and with the name Agrifest South West there will be no limits on what can be included in the future.\" \nREAD NEXT: Cornish cauliflower destined for Finnish shelves \nKicking off the winter show season, the event's primestock show attracts pedigree and commercial exhibitors from across England and Wales. The 2017 schedule will also include breed classes within the already established pedigree calf show. \nIn previous years there have been classes for native and continental bull calves and heifer calves born in the year of the show, but again these classes have been very well supported and exhibitors have requested breed classes. \nThe event will continue with the yearling bull of the year competition, steak and burger awards, cattle and now also sheep handling equipment demonstrations and breed society area, which will now be open to sheep breed societies. \nSeminars will also take place throughout the day in the knowledge exchange area. The educational side to the event will include a 'Farmers of the Future' team challenge, open to teams of four young people under the age of 26. Vicky added: \"Among other things the competition will be a test of their stock judging abilities and how they work as a team.\" \nREAD ALSO: Philip Wolfgang: Plan ahead for retirement from farming \nLast year's event saw Devon MP Neil Parish, alongside other influential figures, speak in the Beef After Brexit debate and call on processors, retailers and consumers to show their support for the UK's beef industry. \nTrade stand bookings are now available on the website www.agrifestsouthwest.co.uk or for further information contact Vicky Smith NBA South West and Event Secretary on 01884 861352 or email natbeefsw@gmail.com READ NEXT:", "external_links": [], "published": "2017-04-19T16:44:00.000+03:00", "crawled": "2017-04-19T22:05:39.000+03:00", "highlightTitle": ""}