{"organizations": [], "uuid": "87966383d27f9b11449c2b4acbf0fb0e4931dbfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12829912.ece/ALTERNATES/s1200/2Faced-Dance-review.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/brexit-inspired-dance-triple-bill-12829910", "country": "GB", "domain_rank": 21960, "title": "A Brexit-inspired dance triple bill brought some unsettling sounds and sights to Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "A Brexit-inspired dance triple bill brought some unsettling sounds and sights to Newcastle", "spam_score": 0.0, "site_type": "news", "published": "2017-04-01T18:00:00.000+03:00", "replies_count": 0, "uuid": "87966383d27f9b11449c2b4acbf0fb0e4931dbfb"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/brexit-inspired-dance-triple-bill-12829910", "ord_in_thread": 0, "title": "A Brexit-inspired dance triple bill brought some unsettling sounds and sights to Newcastle", "locations": [], "entities": {"persons": [{"name": "tamsin fitzgerald", "sentiment": "negative"}, {"name": "jason boyle", "sentiment": "negative"}, {"name": "louis parker-evans", "sentiment": "negative"}, {"name": "tomáš vychytil", "sentiment": "none"}, {"name": "lenka vagnerová", "sentiment": "none"}, {"name": "fitzgerald", "sentiment": "none"}, {"name": "rebecca evans", "sentiment": "none"}, {"name": "luke evans", "sentiment": "none"}, {"name": "david whetstone", "sentiment": "none"}, {"name": "bachar mar-khalife", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "hereford", "sentiment": "none"}, {"name": "dance city", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "time", "sentiment": "none"}, {"name": "newcastle  dance", "sentiment": "none"}, {"name": "eu referendum", "sentiment": "none"}, {"name": "fallen angels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A moment from from Above by Tamsin Fitzgerald with dancers Louis Parker-Evans and Jason Boyle (Photo: Luke Evans) Share Get what's on     \nRun, 2Faced Dance Company, Dance City, Newcastle \nDance isn’t all pretty costumes and seductive rhythms and for proof you needed to look no further than this triple bill under the heading Run. \nIt was inspired, we learned at the customary post-show discussion, by the uncertainty and animosity generated by the EU Referendum last year . \nThree female choreographers, including 2Faced artistic director Tamsin Fitzgerald, each made a new piece of work for the admired all-male dance company based in Hereford. \nIt was an evening of muscle and grit and of strange and unsettling moments but there was tenderness too – an all-too-apt sense of stepping into the unknown. \nThere were also quite a lot of props. \nFitzgerald’s piece, From Above, opened proceedings and had four dancers performing beneath three giant lightboxes suspended from the ceiling whose angle and height from the floor were altered by means of rattling chains. \nTo me they resembled mobile phones – the way they glow blindingly in the dark. \nIt ended with one dancer almost pinned to the floor as the weight of this tiny dump bin of information pressed down on him. \nIn The Other, by Rebecca Evans, two dancers played with big lights on poles , like the 21st Century equivalent of flaming torches, at one point hurling them to each other. \nThe programme recorded a snippet of the rehearsal discussion: “We asked ourselves: How does fear take over when our world shifts and is full of unknowns?” \nWhen one of the big torches went out as the dancers were hurling them to and fro in the dark, I feared the worst. The men proved equal to the sudden setback - no damage was done. \nThe movements were as urgent and unsettling as the music by Lebanese composer Bachar Mar-Khalife. At one point one dancer stood on the other’s chest. You held your breath. Read More Kynren: Time is running out to volunteer for this year's epic pageant - here's how to get involved \nThere was little repite offered by the final piece, Fallen Angels by Lenka Vagnerová, in which all five dancers took us through various scenes of conflict. \nOne dancer opened proceedings by blowing on a mighty horn which was then manipulated to resemble a slithering serpent. \nWater bottles flew about the stage, two dancers swigged and sprayed water over another and at some points it resembled a brawl after pub chucking out time. \nMusic by Czech composer Tomáš Vychytil sent shivers up the spine, with one sequence sounding like someone munching giant crisps. \nIn the final scene an Icarus-like figure, face down and equipped with mighty bird-like wings, struggled to get off the ground. \nIt was not an optimistic note on which to end but it sent us away replete with sounds and images to trouble the hours of sleep. Read More \nDance City, currently programming a lot of great dance in its perfectly proportioned theatre, is pushing this often marginalised artform centre stage in the North East and it’s good to see. \nFor the coming list of performances visit www.dancecity.co.uk . \nDavid Whetstone", "external_links": [], "published": "2017-04-01T18:00:00.000+03:00", "crawled": "2017-04-01T13:13:10.673+03:00", "highlightTitle": ""}