{"organizations": [], "uuid": "e03e28f75a2eb709685194578f0c3a0c2ee3f772", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12909461.ece/ALTERNATES/s1200/Sterling-Rates-To-Fluctuate-During-Brexit-Negotiations.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/whats-on/travel-tourism/how-general-election-could-land-12909376", "country": "IE", "domain_rank": 21960, "title": "How the General Election could land you with more holiday money - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "How the General Election could land you with more holiday money - Chronicle Live", "spam_score": 0.156, "site_type": "news", "published": "2017-04-18T22:35:00.000+03:00", "replies_count": 0, "uuid": "e03e28f75a2eb709685194578f0c3a0c2ee3f772"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/whats-on/travel-tourism/how-general-election-could-land-12909376", "ord_in_thread": 0, "title": "How the General Election could land you with more holiday money - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "simon phillips", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "neil wilson", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "etx capital", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On How the General Election could land you with more holiday money Announcement leads to a strong pound which will help holiday spending and give you more cash for your breaks abroad Share The new £1 pound coin is seen alongside US dollar bills and euro notes (Photo: Getty Images Europe) Share Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA snap general election should be good news for the pound in your pocket and the cost of holidays. \nThe pound rose sharply after Theresa May’s shock announcement on Tuesday. \nSterling jumped nearly 0.9% against the dollar, and was also up against the euro. \nIt could mean cheaper holidays although experts say not to expect too much. \nSimon Phillips, retail director of Number 1 Currency, said: “For everyday Brits, the recovery of the pound has a long way to go before holidaying overseas becomes cheaper, but this is another overall positive for sterling. \n“With this turnaround election taking place in just six weeks now is the time to be increasingly savvy when shopping for foreign currency.” \n“Always make sure to shop around for the best currency deals, as getting the best rate on your holiday money can sometimes be a question of the right timing. \n“Alternatively, if you’re yet to book a holiday, you could consider going somewhere further afield than the Eurozone where your pound will stretch further.” \nHere are FairFX’s top seven tips on getting the best exchange rate you can: A UK passport is seen besides US Dollar bills (Photo: Getty Images Europe) Track currency: Set up a currency tracker which will alert you to good rates. Lock-in rates: If you know you’re travelling later this year, plan ahead. Pre-load a prepaid currency card to lock in rates and protect yourself from any potential further decline. If you’re happy with the current rate on offer, buy your currency now to guarantee that rate for your future holiday. Buy wisely: Don’t leave changing your travel money until the last minute. Exchange rates at airports can be over 10% more expensive meaning you could lose £100 of cash for every £1,000 you change. Stay alert: Once you’re abroad, beware of the double exchange rate dupe. If you let the seller in a shop or restaurant covert the price back into pounds, they can choose their own exchange rate and you’re more likely to be on the less favourable end of the deal. Cards: Debit and credit cards are good backups but beware of ATM and transaction fees as well as what exchange rate you’ll be forced to use. Instead, use a specialist currency card or a card designed for overseas spending. Always use local currency: If you have the option of paying – or withdrawing cash – in pounds rather than the local currency, always say no. This allows the other party to decide the exchange rate, a process known as Dynamic Currency Conversion, and it’s unlikely the rate will be in your favour. Different money habits: Check out any travel money anomalies before you travel. In America, for example, you definitely need to remember your PIN – outlets are migrating from swipe &amp; sign to chip &amp; pin so don’t get caught out. Prime Minister Theresa May makes a statement in Downing Street, London, announcing a snap general election on June 8 (Photo: PA) \nNot everyone was happy with Theresa May’s announcement. \nMore than £32billion was wiped off the value of Britain’s 100 biggest companies. \nThe FTSE 100 dived more than 125 points in reaction to the rise in the pound. Read More \nA stronger pound dents the overseas earnings of UK-listed companies when they are converted back into sterling. \nNeil Wilson, senior market analyst at ETX Capital, said business might suffer. \nHe said: “For investors it adds another layer of complexity to an already uncertain picture for UK and European assets. \n“Volatility is likely to remain elevated over the coming weeks. \n“And as elections are so unpredictable, there is always the outside risk it could spark a reversal in the entire Brexit process.” Like us on Facebook ", "external_links": [], "published": "2017-04-18T22:35:00.000+03:00", "crawled": "2017-04-19T08:50:48.000+03:00", "highlightTitle": ""}