{"organizations": [], "uuid": "0859cffdb14feba4f8f0ab329055bede63b5581f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12940292.ece/ALTERNATES/s1200/ECP_NEC_071015leader_047JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-virgin-money-keeping-eye-12940285", "country": "GB", "domain_rank": 21960, "title": "Newcastle's Virgin Money keeping an eye on consumer debt levels", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle's Virgin Money keeping an eye on consumer debt levels", "spam_score": 0.0, "site_type": "news", "published": "2017-04-25T17:51:00.000+03:00", "replies_count": 0, "uuid": "0859cffdb14feba4f8f0ab329055bede63b5581f"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-virgin-money-keeping-eye-12940285", "ord_in_thread": 0, "title": "Newcastle's Virgin Money keeping an eye on consumer debt levels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle's Virgin Money keeping an eye on consumer debt levels Credit card balances jumped by 8% in the first quarter of Virgin Money's financial year and the firm is taking a cautious approach to lending Share Jayne-Anne Gadhia Chief Executive of Virgin Money (Photo: Newcastle Chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East challenger bank Virgin Money said it is keeping a close eye on rising consumer debt levels as credit card balances jumped 8% in the first quarter. \nThe Newcastle-headquartered lender said credit card debt rose to £2.65bn in the three months to March 31, but said that it was seeing “stable customer behaviour and arrears levels” despite the jump. \nIt comes after the Bank of England’s Financial Policy Committee warned earlier this month that the recent surge in consumer borrowing could pose a risk to the UK financial system, leaving banks exposed if their lending rules are too loose and people cannot make their repayments. \nVirgin Money said in a trading update for the first quarter of the financial year that it was taking a cautious approach to lending and while credit card competition had increased, it was not following rivals “into top of the table pricing”. \nThe company said: “We watch the increase in consumer indebtedness closely and continue to lend responsibly to our prime books of mortgage and credit card customers who are showing no signs of strain in the current environment. \n“We prioritise asset quality over balance growth, despite which we remain confident of achieving £3bn of prime credit card balances by the end of 2017.” \nVirgin Money said that the UK economy has “remained stronger than expected” following the Brexit vote , cheering rising employment and the “continued, if slower growth” in house prices since June. \nBut it also noted strong competition in certain segments of the mortgage market. Read More Major European deal for Shampooheads range of 'tweenage' haircare products \nVirgin Money’s latest results show that net mortgage lending - which accounts for redemptions - dropped by around 18% to £900m from the £1.1bn reported in the same period last year. \nThe lender also saw a 4.8% drop in gross mortgage lending to £2bn in the first quarter, but managed to maintain its 3.4% market share. \nThe mortgage pipeline - which counts the mortgages approved but not yet released - was £2.3bn at the end of the first quarter, which is 14% higher than the end of the fourth quarter. \nMortgage balances also grew to £30.7bn as of March 31, up 3% from the end of December. Read More Virgin Money boss speaks out about challenge of battling mental health \nThe lender also said the development of a new digital banking platform in partnership with 10x Future Technologies is progressing according to plan and expectations. \nChief executive Jayne-Anne Gadhia said: “I am delighted with the ongoing momentum and performance of the business so far in 2017. \n“Our customer-focused strategy of growth, quality and returns continues to deliver excellent results and demonstrates the benefits of our low-risk business model, strong balance sheet and ongoing focus on operational excellence.” Like us on Facebook ", "external_links": [], "published": "2017-04-25T17:51:00.000+03:00", "crawled": "2017-04-25T13:30:05.000+03:00", "highlightTitle": ""}