{"organizations": [], "uuid": "0df488cbd009199f4b9d5bbb1fc7a29c4a92b929", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12941459.ece/ALTERNATES/s1200/TMP_NEC_270814NestleFawdon01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nestle-fawdon-newcastle-job-losses-12941418", "country": "GB", "domain_rank": 21960, "title": "110 jobs at risk at Nestle Newcastle factory after production is moved to Poland", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "110 jobs at risk at Nestle Newcastle factory after production is moved to Poland", "spam_score": 0.0, "site_type": "news", "published": "2017-04-25T20:14:00.000+03:00", "replies_count": 0, "uuid": "0df488cbd009199f4b9d5bbb1fc7a29c4a92b929"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/nestle-fawdon-newcastle-job-losses-12941418", "ord_in_thread": 0, "title": "110 jobs at risk at Nestle Newcastle factory after production is moved to Poland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business 110 jobs at risk at Nestle Newcastle factory after production is moved to Poland Jobs are at risk at Nestle factory in Fawdon with plans to switch production of the Blue Riband to Poland Share 110 job losses are expected at the Nestle factory in Fawdon Share Get business   Thank you for subscribing!   \nMore than 100 jobs are at risk at one of the region’s best known factories with proposals to move production of one of its main products to Poland. \nThe 110 job losses are expected at the Nestle factory in Fawdon, Newcastle , after the company put forward plans to switch production of the Blue Riband biscuit to one of its plants in Poland. \nA 45-day consultation has begun on the proposals with trade union and other employee representatives, with the company saying it hopes to achieve all of the job losses through voluntary redundancies. \nThe Fawdon factory , which was previously operated by Rowntree, is almost 50 years’ old and much of its machinery is old, though workers said there had been investment recently in the Blue Riband production line. \nNestle said the move would simplify production procedures at Fawdon, which produces a wide range of products, including Rolo, Fruit Pastilles, Caramac and Breakaway. \nThe company said: “The proposed changes include amended and standardised shift patterns at each factory and, at Fawdon, the most complex of Nestlé’s UK confectionery sites, the transfer of Blue Riband production to a Nestlé factory in Poland. This would mean being able to simplify and focus Fawdon’s operation. \n“These proposals are being made by Nestlé UK to ensure that these sites operate more efficiently and remain competitive in a rapidly changing external environment.” \nNestle said the proposed changes, which also affect plants in York, Halifax and Girvan, would take place over the next two years. Read More Rap star will.i.am joins Durham company Atom Bank as 'strategic advisor' \nThe Blue Riband dates back to 1936 and is thought to have been launched to coincide with the unofficial accolade given to the passenger liner crossing the Atlantic Ocean in the quickest time. \nNewcastle North MP Catherine McKinnell said: “This is absolutely devastating news for Fawdon , and I am urgently writing to the Business Secretary asking him to work with me, Nestle and the GMB union to try and find a way of retaining these good jobs here in Newcastle where they belong. \n“The Government cannot allow its single-minded focus on Brexit to distract from the need to protect British jobs now, and I will be doing all I can to support all the families affected by this extremely disappointing decision.” Read More Accenture creates 60 new jobs at its Newcastle Delivery Centre at Cobalt Business Park \nTim Roache, GMB General Secretary, said: “To shift the production of an iconic British brand like Blue Riband to Poland is completely unacceptable. \n“Nestle are throwing people’s lives, and those of their families, into turmoil for the sake of increasing profit margins. These factories should be exporting chocolate – not people’s jobs. \n“The Government needs to step in before it’s too late – and reassure millions of workers across the country this is not just the tip of the Brexit iceberg.” Like us on Facebook", "external_links": [], "published": "2017-04-25T20:14:00.000+03:00", "crawled": "2017-04-25T15:34:31.000+03:00", "highlightTitle": ""}