{"organizations": [], "uuid": "4f30422a4b8dc7a825b823b79e74c4c0d1526fb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12895564.ece/ALTERNATES/s1200/BESTPIX-UK-Prime-Minister-Meets-With-The-European-Council-President-Donald-Tusk.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/democracy-not-seeing-finest-hour-12895575", "country": "GB", "domain_rank": 21960, "title": "Democracy is not seeing its finest hour - and that should alarm Remainers and Brexiteers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Democracy is not seeing its finest hour - and that should alarm Remainers and Brexiteers", "spam_score": 0.0, "site_type": "news", "published": "2017-04-15T01:00:00.000+03:00", "replies_count": 0, "uuid": "4f30422a4b8dc7a825b823b79e74c4c0d1526fb5"}, "author": "Thom Brooks", "url": "http://www.chroniclelive.co.uk/news/news-opinion/democracy-not-seeing-finest-hour-12895575", "ord_in_thread": 0, "title": "Democracy is not seeing its finest hour - and that should alarm Remainers and Brexiteers", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "bill", "sentiment": "none"}, {"name": "thom brooks", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tim barrow", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "brexit britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "houses of parliament", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "new labour", "sentiment": "none"}, {"name": "durham law school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IN FULL: Theresa May's statement as she triggers Article 50 Share this video Watch Next \nHowever, the reality is that Cameron’s and May’s governments have seen the highest net migration into Britain ever recorded – and higher than at any time under New Labour. They say one thing, but the reality can look very different. \nSo too with Brexit. May claimed that she was fully supportive of the result and ‘respected’ the public’s decision. So what did she do? She set a short timetable for triggering Brexit and - instead of actually doing it – wasted tens of thousands of taxpayer money bringing a case to court over whether the government or Parliament could trigger Brexit. \nThe conclusion was known to any first year law student – since Brexit would mean repealing an Act of Parliament, only Parliament could do this so Parliament’s approval is necessary. \nIf Theresa May wanted the will of the people to come to life, she could have triggered Brexit much earlier and spent more time developing a plan rather than fighting a humiliating lost cause in the courts. And, of course, the government lost big. \nIt’s not like they didn’t know already that Brexit means repealing Acts of Parliament and would require Parliament’s approval. After all, the government is championing a so-called ‘Great Repeal Bill’ to start this work. Or maybe they thought we wouldn’t notice. An EU flag flying in front of the Houses of Parliament (Photo: PA) \nBut why delay triggering Brexit by contesting a lost cause in the courts? Simple. It was an attempt to blame delays or a possible end to making Brexit happen on anyone or place than the government. May’s lost cause was to make the judiciary a scapegoat – and with some of the hateful language around judges applying the most basic rules of UK constitutional law the government almost succeeded. \nNext was Parliament where virtually all business ground to a halt so both Houses could rush through a changed Bill. This was outrageous by conventional standards. The government made several reassurances about the status of EU national already in Britain and on a vote in Parliament prior to sign-off on the final deal with regular updates throughout the process. Normally, this is added to the Bill as amendments. Their purpose is to hold the government to account and keep them to their word. \nYet these official reassurances were kept off the amendment list. The result is that promises made to Members of Parliament voted into office by their constituents can be broken. Gone are the more serious consequences of violating their own law. This is not a shining example of respecting the ‘will of the people’ either. \nThe government’s insistence on no amendments was a clear indication of how worried they are about the next year or so ahead. Other than threats to deport EU nationals who may have been here for years or to leave without a trade deal in place, the government has precious little in its hand to play. Tim Barrow, the UK Permanent Representative to the EU (Photo: AP Photo/Thierry Monasse) \nNow the government is in a real pickle. There are by some counts 53,000 European laws we’re a party to that we will need to sift through and determine which to keep, revise or scrap. This could cause serious problems for Parliament to address anything but what Brexit might mean. \nAt the moment, Brexit doesn’t mean a Britain all that much different from where we are now. We’re told EU free movement is set to continue for several years in a ‘transitional’ arrangement without any end date in stone. \nWhen asked which laws might be changed, the answer is usually something close to about none – what will be changed is that our courts, not European courts, will determine final outcomes. Oh, and we’ll ‘take back control’. \nBut we will also have to abide by every EU regulation for trading goods with the EU that they require – our red tape and more will not reduce, only our influence over what this red tape is as we’ll no longer be at the table. \nFour brief lessons follow from this look at where Brexit has brought us. The first is that if we’re concerned about ensuring we respect the referendum’s outcome, then we should become a lot more concerned by how far Theresa May’s Brexit plan is from what voters were told when casting ballots. Prime Minister Theresa May in the cabinet signing the Article 50 letter \nThe second lesson is taking back control is unlikely to be half as revolutionary as some of its defenders have claimed. Brexit Britain may remain (apologies) little changed. All sceptics should make a note of all EU arrangements the UK is a part of starting with the common market and see how many we are still a part of when we’re told that we’re achieved what the government will claim is ‘Brexit’. We are very likely to remain in counterterrorism and security programmes and much more. \nThirdly, the government’s strategy seems more Project Fear than anything else we’ve seen before. When the SNP called for Scotland’s independence, they were never for no deal on trade. But May seems to have little more than threats to offer her European counterparts. This undermines the aspirational optimism of a better future we saw from some parts of the campaign that seemed to win many over. \nThe final lesson is the PM is short on possible scapegoats. She can’t blame the UK courts or Parliament. She has a free hand to negotiate a deal, but will she end up with a deal worth having? \nWe should not rule out the possibility that we can’t agree a deal we’d want with the EU in the short time we have to forge something – and that no deal is the worst deal we could receive. The PM would surely blame the EU for any problems rather than her failures at negotiation and it would raise thorny issues about what comes next if not moving ahead with Brexit. A Brexit that exists more in theory as a series of deals to be made than something made flesh are very different things. The more the government looks at the sheer enormity at the task in hand, the more likely it will make changes more symbol than substance – and the ‘will of the people’ may well want something different. \nThom Brooks is Head of Durham Law School @thom_brooks Like us on Facebook", "external_links": [], "published": "2017-04-15T01:00:00.000+03:00", "crawled": "2017-04-14T21:08:17.948+03:00", "highlightTitle": ""}