{"organizations": [], "uuid": "b72864880ef03086774cd75cf64f6495b5437843", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12914789.ece/ALTERNATES/s1200/MPS.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-how-north-east-12914622", "country": "GB", "domain_rank": 21960, "title": "General Election: How the North East voted last time - and where June's battles will be fiercest", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "General Election: How the North East voted last time - and where June's battles will be fiercest", "spam_score": 0.0, "site_type": "news", "published": "2017-04-19T23:59:00.000+03:00", "replies_count": 0, "uuid": "b72864880ef03086774cd75cf64f6495b5437843"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-how-north-east-12914622", "ord_in_thread": 0, "title": "General Election: How the North East voted last time - and where June's battles will be fiercest", "locations": [], "entities": {"persons": [{"name": "brown", "sentiment": "none"}, {"name": "alan beith", "sentiment": "none"}, {"name": "hexham guy opperman", "sentiment": "none"}, {"name": "pat glass", "sentiment": "none"}, {"name": "grahame morris", "sentiment": "none"}, {"name": "julie elliott", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "kevan jones", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}, {"name": "jarrow stephen hepburn", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}, {"name": "dave anderson", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "ian mearns", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "mary glindon - labour", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "roberta blackman-woods", "sentiment": "none"}, {"name": "david miliband", "sentiment": "none"}, {"name": "mary glindon", "sentiment": "none"}, {"name": "ed miliband", "sentiment": "none"}, {"name": "blaydon dave anderson", "sentiment": "none"}, {"name": "north durham kevan jones", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "stephen hepburn", "sentiment": "none"}, {"name": "emma lewell-buck", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "alan campbell", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "lavery", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "tyne north catherine mckinnell", "sentiment": "none"}, {"name": "stefan", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}, {"name": "pat glass - labour", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "wansbeck", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "shadow northern ireland", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}], "organizations": [{"name": "berwick anne-marie trevelyan  current", "sentiment": "none"}, {"name": "bishop auckland labour", "sentiment": "none"}, {"name": "easington grahame morris  current", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sunderland west", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "grahame morris - labour", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "tyne central newcastle central", "sentiment": "none"}, {"name": "alan campbell - labour", "sentiment": "none"}, {"name": "tynemouth tynemouth", "sentiment": "none"}, {"name": "num", "sentiment": "none"}, {"name": "city of durham cllr roberta", "sentiment": "none"}, {"name": "easington labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "shadow cabinet", "sentiment": "none"}, {"name": "sunderland central  current", "sentiment": "none"}, {"name": "commons public accounts committee", "sentiment": "none"}, {"name": "south tyneside borough council newcastle", "sentiment": "none"}, {"name": "tyne east newcastle east", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "sunderland central fire station", "sentiment": "none"}, {"name": "commons backbench business committee", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "north west durham pat glass", "sentiment": "none"}, {"name": "mirrorpix", "sentiment": "none"}, {"name": "sunderland south wearside", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "blyth valley blyth", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "cabinet office", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe race for Number 10 is underway. \nTheresa May has called a General Election for June 8. \nThe Prime Minister said she believed she needs a stronger mandate ahead of the country’s Brexit negotiations. \nThe election will be strongly contested in the North East - which could see the area’s political map redrawn again. Here’s how the seats are currently held - and what could happen next. Berwick-upon-Tweed Conservative MP for Berwick Anne-Marie Trevelyan \nCurrent MP: Anne-Marie Trevelyan - Conservative (majority 4,914) \nThis Northumberland seat we held by the Liberal Democrats for decades. At the last election, the Lib Dems were hit by the loss of well-known local MP Alan Beith, who retired and went to the House of Lords, and the collapse in the party’s vote following five years in coalition government with the Conservatives. \nThe Lib Dems will hope to win Berwick back in June, and it’s probably their best hope in the North East. But sitting Conservative MP Anne-Marie Trevelyan has developed a high profile as an outspoken and independent-minded MP. \nShe’s a staunch Brexiteer, so it will be interesting to see whether voters in this beautiful and historic constituency back her or the pro-EU Lib Dems. Bishop Auckland Labour candidate Helen Goodman (Photo: Mirrorpix) \nCurrent MP: Helen Goodman - Labour (majority 3,508) \nConservatives came a close second in this County Durham seat in 2015, and it should be one of the region’s key battlegrounds this time around. If the polls are right then Theresa May’s party could have a chance of winning, providing a boost to their claim to be a party for the whole country including the north of England. \nHelen Goodman has been the MP since 2005. She was a Minister in the last Labour government, led by Gordon Brown, and a shadow minister in opposition under Ed Miliband. Blaydon Dave Anderson \nCurrent MP: Dave Anderson - Labour (majority 14,227) \nLabour is defending a solid majority in this Tyne and Wear seat. UKIP came second here last time, just ahead of the third-place Tories. \nMP Dave Anderson, a former president of trade union UNISON, is on the left of the party. He’s been steadfastly loyal to Jeremy Corbyn since Mr Corbyn became leader, and currently serves as Shadow Northern Ireland Secretary and Shadow Scottish Secretary in Labour’s shadow cabinet. Blyth Valley Blyth MP Ronnie Campbell (Photo: Newcastle Chronicle) \nCurrent MP: Ronnie Campbell - Labour (majority 9,229) \nAnother seat where UKIP came second in 2015, and the Conservatives were just behind in third place. \nRonnie Campbell, a former miner and NUM official, has been the MP since 1987. He planned to retire if the election took place in 2020, as previously expected, but has announced he will stand again in the early election on June 8 this year. \nHe’s on the left and has been pretty blunt in his criticism of Labour MPs who refuse to support Jeremy Corbyn, City of Durham Cllr Roberta Blackman-Woods \nCurrent MP: Roberta Blackman-Woods - Labour (majority 11,439) \nConservatives are in second place here, but a long way behind Labour . Defending MP Roberta Blackman-Woods is a shadow housing minister. although she was one of a number of shadow ministers to resign in 2016, saying she had no confidence in the party leader, and return to a front bench role after Mr Corbyn won a second leadership campaign. Easington Labour MP for Easington Grahame Morris \nCurrent MP: Grahame Morris - Labour (majority 14,641) \nThis County Durham seat is a Labour stronghold. UKIP came second here in 2015. \nMP Grahame Morris, a left-winger, was shadow local government secretary in Mr Corbyn’s top team. He has left this role after suffering ill health but his office confirmed he would stand as Labour’s candidate in June’s election. Gateshead \nCurrent MP: Ian Mearns - Labour (majority 14,784) \nGateshead is another safe Labour seat. UKIP were second here in 2015. \nSitting MP Ian Mearns has campaigned against cuts to council funding, which has hit services such as social care. \nHe has an important role at Westminster as chair of the Commons Backbench Business Committee, which helps decide what gets debated in Parliament. Hexham Guy Opperman \nCurrent MP: Guy Opperman - Conservative (majority 12,031) \nThis Northumberland seat is the safest Conservative seat in the North East. Sitting MP Guy Opperman , a former barrister and amateur jockey, is a Tory moderate with a key government role as a whip. Houghton and Sunderland South Wearside MP Bridget Phillipson \nCurrent MP: Bridget Phillipson - Labour (majority 12,938) \nBridget Phillipson has been the MP here since 2010. She is a member of the Commons Public Accounts Committee, which scrutinises spending, and a former opposition whip. \nUKIP came second here in 2015. Jarrow Stephen Hepburn MP \nCurrent MP: Stephen Hepburn - Labour (majority 13,881) \nThis Tyne and Wear seat should be safe for Labour. UKIP came second here in 2015. \nMP Stephen Hepburn is a former Deputy Leader of South Tyneside Borough Council Newcastle upon Tyne Central Newcastle Central MP Chi Onwurah \nCurrent MP: Chi Onwurah - Labour (majority 12,673) \nMP Chi Onwurah is a shadow business minister, and kept this role despite rebelling against the Labour whip and voting against triggering Article 50 in the House of Commons. She argued that she was not opposed to allowing Brexit to go ahead, following last year’s referendum, but said Conservative Prime Minister Theresa May had failed to provide assurances that the North East economy would be protected. \nShe’s an engineer who is an expert on issues relating to the internet and technology. \nConservatives came second in this seat in 2015. Newcastle upon Tyne East Newcastle East MP Nick Brown \nCurrent MP: Nick Brown - Labour (majority 12,494) \nNick Brown has a distinguished career, serving three times as Labour’s chief whip and as Minister for the North East, among other senior roles. \nHe was a close ally of former Prime Minister Gordon Brown and comes from a different Labour Party tradition to party leader Jeremy Corbyn. \nHowever, he agreed to take on the difficult task of Shadow Chief Whip at Mr Corbyn’s request in 2016, taking responsibility for discipline among Labour MPs, and this is the post he holds today. \nThere had been reports that Mr Brown planned to retire at the 2020 general election but he could choose to stand again in the early election in June this year. Newcastle upon Tyne North Catherine McKinnell (Photo: Newcastle Chronicle) \nCurrent MP: Catherine McKinnell - Labour (majority 10,153) \nCatherine McKinnell has been an MP since 2010. She was something of a rising star, as a shadow Treasury minister under Labour leader Ed Miliband and Shadow Attorney General under Jeremy Corbyn’s leadership, a post that gave her a seat in the Shadow Cabinet. \nHowever, she quit this role in 2016, citing the pressure of being a mum to young children and a desire to speak out more on issues affecting her constituency. North Durham Kevan Jones (Photo: Stefan Rousseau/PA Wire) \nCurrent MP: Kevan Jones - Labour (majority 13,644) \nLocal MP Kevan Jones was a defence minister in the last Labour government and served as shadow minister for the armed forces when Labour went into opposition. \nHe has clashed with Labour leader Jeremy Corbyn over nuclear weapons, arguing that the UK must maintain a credible nuclear deterrent, while working to advance global nuclear disarmament, \nMr Jones is also a campaigner for better mental health services. North Tyneside \nCurrent MP: Mary Glindon - Labour (majority 17,194) \nSitting MP Mary Glindon, a former North Tyneside councillor , is a shadow environment minister. \nLiberal Democrats came second in North Tyneside in 2010, falling to fourth place behind Labour, the Conservatives and UKIP in 2015. North West Durham Pat Glass MP (Photo: Ian Forsyth/Getty Images) \nCurrent MP: Pat Glass - Labour (majority 10,056) \nPat Glass is to stand down at this election, so North West Durham will be getting a new MP however constituents vote. Read More General Election 2017: Could Labour lose North East seats to the Tories? \nShe is a former Shadow Europe Minister who briefly served as Shadow Education Secretary. Mrs Glass was also one of the leaders of Labour’s official “remain” campaign in the 2016 referendum. \nNorth West Durham is likely to be a safe Labour seat. Liberal Democrats came second here in 2005 and 2010, but Conservatives were second in 2015. South Shields South Shields MP Emma Lewell-Buck \nCurrent MP: Emma Lewell-Buck - Labour (majority 10,614) \nEmma Lewell-Buck won this Tyne and Wear seat in a 2013 by-election after former MP David Miliband chose to leave the House of Commons. \nShe is currently a shadow education minister. \nUKIP came second here in 2010. Sunderland Central Julie Elliott, Labour MP for Sunderland Central \nCurrent MP: Julie Elliott - Labour (majority 11,179) \nJulie Elliott is a former shadow energy minister. She has campaigned against zero hour contracts and the closure of Sunderland Central Fire Station. Tynemouth Tynemouth MP Alan Campbell \nCurrent MP: Alan Campbell - Labour (majority 8,240) \nAlan Campbell has been Labour’s deputy chief whip since 2010, which means he served under both former leader Ed Miliband and Jeremy Corbyn. He was a Home Office Minister when Gordon Brown was Prime Minister. Wansbeck Wansbeck MP Ian Lavery (Photo: Daily Mirror) \nCurrent MP: Ian Lavery - Labour (majority 10,881) \nIan Lavery, the sitting MP in this Northumberland seat, is a former President of miners’ union the NUM. \nHe’s the Shadow Minister for the Cabinet Office, which means he has a place in Jeremy Corbyn’s Shadow Cabinet, but perhaps even more significant is his role as Labour’s national elections and campaign co-ordinator. \nMr Lavery is on the left of the party and has been a staunch supporter of Mr Corbyn. \nLiberal Democrats came second in Wansbeck in elections from 1997 to 2010, but Conservatives were in second place here in 2015. Washington and Sunderland West Sharon Hodgson (Photo: 2011 Getty Images) \nCurrent MP: Sharon Hodgson - Labour (majority 13,157) \nSharon Hodgson, a shadow public health minister, has campaigned in favour of free school meals and for action to stop ticket touts. \nUKIP came second in this seat in 2015. Like us on Facebook ", "external_links": [], "published": "2017-04-19T23:59:00.000+03:00", "crawled": "2017-04-19T19:13:59.000+03:00", "highlightTitle": ""}