{"organizations": [], "uuid": "19f3cf125c2177197f8103963635c8bdfe67fe10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12814526.ece/ALTERNATES/s1200/CFR_NJL_290317petards_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12941045", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Team Valley tech firm Petards' £21m order book, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Team Valley tech firm Petards' £21m order book, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2017-04-26T15:05:00.000+03:00", "replies_count": 0, "uuid": "19f3cf125c2177197f8103963635c8bdfe67fe10"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12941045", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Team Valley tech firm Petards' £21m order book, plus latest news", "locations": [], "entities": {"persons": [{"name": "raschid abdullah", "sentiment": "none"}, {"name": "stadler", "sentiment": "none"}, {"name": "abdullah", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "guildford", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "surrey", "sentiment": "none"}], "organizations": [{"name": "petards", "sentiment": "none"}, {"name": "agm", "sentiment": "none"}, {"name": "stadler bussnang ag", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle University has appointed a new director at its business school. \nProfessor Sharon Mavin currently runs the business school at the University of Roehampton, which has seen significant growth and 60% of its research ranked as “internationally excellent”. \nProf Mavin is an expert in gender, leadership and organisation studies, and is a fellow of the British Academy of Management. She also holds a number of national roles, including chair of the Chartered Association of Business School’s diversity committee and the University Forum for Human Resources and Development. \nProf Mavin will be known to some within the North East business community, having previously been associate dean of research at Northumbria University’s business school, where she was responsible for business engagement, research capacity and securing international and professional accreditations. \nShe will join Newcastle University Business School in September. \nShe said: “I am delighted to be joining a world-class civic university and leading the business school at such an exciting time in its development. \n“I’m looking forward to working with colleagues to build on the business school’s success in academic excellence, innovation and in developing open-minded and socially responsible graduates. I am thrilled to be working with colleagues and organisations in the region, where the business school is at the forefront of positive economic and societal impact, as well as enhancing our exceptional global reach.” \nNewcastle University Business School is one of 21 triple accredited business schools in the UK and has a strong track record for world-leading research and teaching in entrepreneurship and sustainability, business history, economics, workforce demographics, and industrial logistics. \nIt places a particular focus on developing links with regional, national and international organisations to further its research and teaching and to benefit its 3,500 students through placements and work experience. Prof Sharon Mavin, Newcastle University Business School 8.45 Coreena Ford Santander profits fall \nHigh street lender Santander warned of a “changeable and potentially more challenging” economic outlook amid the fallout from the Brexit-hit pound as it revealed lower first- quarter UK profits. \nThe pound’s plunge since the Brexit vote left its Spanish owner Banco Santander nursing an 8% fall in UK profits when translated into euros, at 416 million euros (£354.5 million). \nIn the UK arm, reported profits were 1% lower at £525 million for the first three months of 2017 as it took a further £32 million charge to cover claims for payment protection insurance (PPI) compensation. \nIt added that net mortgage lending fell by £400 million after withdrawing some of its most competitive rates at the end of last year. \nChief executive Nathan Bostock said the group was bracing for a tougher 2017 as Brexit-fuelled inflation from the weak pound hits consumer spending power. He said: “Looking ahead, we anticipate a changeable and potentially more challenging macro environment.” A Santander high street bank 8.40 KEY EVENT Teesside tech firm Stadium grows order book to £28m \nTeesside tech firm Stadium Group has issued a trading update revealing a £28m order ahead of an important investor event in London. \nThe Hartlepool-headquartered electronics manufacturer said the first quarter of the year has traded in-line with management expectations, and that the company’s order book has continued to grow and now exceeds £28m, up from £25.8m at the year end. \nThe board said it remains confident that the company’s offering of complementary electronic technologies and bespoke engineering expertise continues to be attractive to customers. \nThe growing demand already seen in the first quarter is expected to continue too, further underpinning 2017 expectations. \nThe update comes ahead of the Technology Day for institutional and other investors being held at the London Capital Club in London. \nPresentations are set be given by CEO, Charlie Peppiatt, and other key members of the senior management team covering the company’s Technology Products divisions, the successful execution of its Regional Design Centre strategy and the opportunity presented by the growing Single Board Computing market. Chief executive of Stadium Group, Charlie Peppiatt 8.25 Coreena Ford The Jockey Club boosts prize money during record year \nThe Jockey Club, which runs 15 racecourses including Aintree, has reported record full-year revenues and profits. \nThe group saw turnover increase 4.5% to £191.5m in 2016, its eight consecutive year of growth. Operating profit came in at £22.6m as its venues attracted 1.92 million people. \nThe Jockey Club, which stages a number of high-profile racing events such as the Grand National, the Cheltenham Festival and The Derby, also boosted its prize money contribution to a record £20.8 million. \nChief executive Simon Bazalgette said the results mean British racing can “kick on”. \nHe said: \nIt is fantastic to stage events that see the best horses and the experiences we offer bring enjoyment to so many millions of people each year. \nThat helped make 2016 a good year financially and meant we were able to support our sport even more than the year before. \nNow with reforms to racing’s funding, a settled governance structure and a committed partner in ITV, British racing can kick on, matter to more people in this country and ensure the sport has the best possible future at all levels, including its grass roots. \nThe performance was also driven by commercial partnerships, media licence fees and record numbers of horses using Jockey Club Estates’ training facilities. The Jockey Club owns Cheltenham racecourse, which staged the Cheltenham Festival and the Gold Cup, which was won by Sizing John 8.20 Coreena Ford Metro Bank within reach of one million customers \nMetro Bank is inching closer to the one million customers mark as profits and deposits continue to rise at the challenger bank. \nThe lender - which launched in 2010 - signed up 72,000 people in the first quarter to take its total to 987,000. \nChief executive Craig Donaldson has said reaching the one million mark would make it a “proper player” in the banking sector. \nThe bank added that it saw a 13% increase in deposit growth to £9bn quarter on quarter, while underlying pre-tax profits rose from £1.5m to £2m. \nMetro Bank said it is confident about delivering a full year of profitability in 2017, and achieving its 2020 guidance. \nMr Donaldson wants to expand Metro Bank’s branch network to 100 by 2020, creating 2,500 extra jobs and doubling the staff roster in the process. \nChairman and founder Vernon Hill said of the results: “What a superb start to the year for Metro Bank. \n“Our combination of great online and mobile banking and an exceptional in-store experience is making a positive difference to our customers. A Metro Bank branch - the lender has inched closer to the one million customers mark 8.15 What's the FTSE latest? \nThe FTSE-100 index opened at 7275.64. \nThe pound at 8am was 1.2820 dollars compared to 1.2836 dollars at the previous close. The euro at 8am was 0.8522 pounds compared to 0.8521 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) 8.10 Coreena Ford Boohoo fashion retailer hails momentous year \nProfits at online fashion retailer boohoo.com have almost doubled as the firm booked an increase in international sales and hailed a “momentous” year. \nThe group said pre-tax profits rose 97% to £30.9m in the year to February 28, while revenue also soared 51% to £294.6m. \nJoint chief executives Mahmud Kamani and Carol Kane pointed to strong growth in the UK and the US, where Boohoo’s performance “exceeded expectations”. “It has been a momentous year for us. \n“The Boohoo brand has achieved outstanding revenue growth and increased profitability margins during the year. \nWe continued to grow strongly in the UK, our largest market, whilst international growth exceeded our expectations, particularly in the USA,” they said. \nSales in the US rose 140% at constant exchange rates, while in Europe they increased 50%. \nLate last year, the group upped its profit outlook following bumper Black Friday trading, and then in January upgraded its full-year revenue forecasts following booming Christmas sales. \nBoohoo also recently revealed plans to acquire US fashion firm Nasty Gal and rival fashion website Pretty Little Thing. \nThe chief executives added: “Both brands have huge potential and the acquisitions represent a step-change in the size, structure and operation of the group. “We are confident that our expertise combined with the strength and following of our new complementary brands will greatly enhance the group’s future growth and profitability.” Boohoo.com, which showed this TV advert over winter, has had a strong year 8.05 KEY EVENT Rail order tops up £21m forward order book at Gateshead's Petards \nThe chairman of Team Valley tech operation Petards will tell shareholders of his confidence in the future of the business today when the firm hosts its AGM. \nAIM-listed Petards creates advanced security and surveillance systems for defence, rail and emergency services, and recent years have seen the firm target the new-build train sector, in tandem with the introduction of new franchises and new train fleets. \nAnd at this morning’s meeting, held in Guildford, Surrey, Petards chairman Raschid Abdullah will detail how the firm’s latest deal has now been secured, bringing in £4.3m from a Swiss train manufacturer that is building trains for new UK services. \nMr Abdullah will also detail the significant opportunities ahead within the rail sector for the business, as well as how work within defence is picking up. \nThe firm also entered the new financial year with a £21m forward order book, giving the senior team confidence in good results for the year. \nAt the AGM Mr Abdullah will say: \n“I am pleased to advise you that since my Chairman’s statement in the Report and Accounts, we have been successful in securing a £4.3 million order from Stadler Bussnang AG for the provision of Petards eyeTrain CCTV and Automatic Selective Door Opening Systems (‘ASDO’). Stadler is a quality Swiss based global train builder and a new customer. This represents an excellent opportunity for Petards to develop internationally. \n“Investment in UK rolling stock is at record levels giving rise to significant opportunities for Petards. I am pleased to report we are presently in active negotiations with existing customers over new contracts. \n“Whilst our defence business has been slow on order intake during the first quarter, indications are that there is further MOD, NATO and third party business in the pipeline. The renewal last December of the three year MOD Systems Adaptive Counter Measures Dispensing Systems Contract is anticipated to bring additional business throughout its duration. \n“We entered 2017 with an order book of £20 million. At the 31 March this year, it stood at £21 million of which £13 million is scheduled for delivery by the end of the year. \n“The strength of the order book gives the Board confidence of a good outcome for the year and I look forward to reporting further progress in the interim results in September.” Petards eyeTrain systems will be used on Stadler trains in the UK Share", "external_links": [], "published": "2017-04-26T15:05:00.000+03:00", "crawled": "2017-04-26T10:15:13.000+03:00", "highlightTitle": ""}