{"organizations": [], "uuid": "c5d016bddc542bce8348b1e7adc5995721227525", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12547561.ece/ALTERNATES/s1200/LAP_NEC_240816airport_12JPG.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/better-transport-links-north-east-12916304", "country": "IE", "domain_rank": 21960, "title": "Better transport links in North East could be worth £5.5bn, business group says - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Better transport links in North East could be worth £5.5bn, business group says - Chronicle Live", "spam_score": 0.18, "site_type": "news", "published": "2017-04-20T07:01:00.000+03:00", "replies_count": 0, "uuid": "c5d016bddc542bce8348b1e7adc5995721227525"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/better-transport-links-north-east-12916304", "ord_in_thread": 0, "title": "Better transport links in North East could be worth £5.5bn, business group says - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "sarah glendinning", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "teesport", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "cbi", "sentiment": "negative"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "invalid email  better", "sentiment": "none"}, {"name": "cbi north east  cbi north east", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Better transport links in North East could be worth £5.5bn, business group says CBI report finds 60% of businesses in the North East are dissatisfied with the state of transport infrastructure in the region Share Two planes parked at Newcastle International Airport (Photo: Newcastle Chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBetter infrastructure that allowed North East businesses to fulfill their potential could see the region deliver £5.5bn in higher productivity, a leading business organisation has said. \nThe CBI wants better links for firms to get to the region’s two airports and has warned that 60% of companies in the North East are dissatisfied with the state of their infrastructure. \nAn even higher proportion - 63% - believe devolution to the North East would improve the situation, with upgrades to the A69 and A66 roads, better links to the Port of Tyne and Teesport, and better quality public transport on the wishlist for local businesses. Read More Chinese rail giant eyes £500m contract to new fleet on Tyne and Wear Metro \nThe call for better infrastructure has come in the CBI report Shaping Regional Infrastructure, which says that improving links between different regions will give firms access to a broader labour market pool and better connections to supply chains. \nCBI analysis shows that if productivity across the North East grew at the same pace as the region’s best performing area did between 2004 and 2014, the gain to its economy could be £5.5bn by 2024. \nAs well as calling for improvements to infrastructure, the CBI study found that 94% of firms in the region believed technology will be a crucial driver of increased productivity. Sarah Glendinning, director, CBI North East \nCBI North East director Sarah Glendinning said: “England’s infrastructure is the arteries and veins without which the country its economy and businesses function. But with 60% of North East firms dissatisfied with the state of our region’s roads, rails and ports, it’s vital the pace of taking action and delivering improvements is stepped up. \n“Infrastructure is a key driver of productivity. By making it easier for staff to get to work and by better connecting companies to their customers, markets overseas and supply chains, we could do a great deal to lift England’s productivity. \n“Moreover, ramping up trade with international partners – old, new and in all corners of the world – will be crucial to making a success of Brexit. This makes it doubly important to better connect firms to these markets, particularly through the Government’s commitment to a long-term aviation strategy and giving our regional airports a new lease of life. Read More Labour promises new Metro trains in £1.4bn investment for North East \n“A strategic plan for delivery, tailored for each region, will also be needed for firms to feel devolution will truly make a difference when it comes to infrastructure.” \nAt the end of 2016, the CBI called on the Government to fully dual the A1 north of Newcastle, saying public investment in the region’s main road routes would help companies cope with the uncertain economic outlook. \nEarlier this year, the Transport for the North group also called for more investment in the region’s infrastructure, saying Newcastle Airport should develop links to America, China and India to take advantage of its potential in growing the region’s economy. Like us on Facebook", "external_links": [], "published": "2017-04-20T07:01:00.000+03:00", "crawled": "2017-04-20T02:24:17.000+03:00", "highlightTitle": ""}