{"organizations": [], "uuid": "33e0baa48a72dba0d18db0cc1c907efce1e80644", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12895506.ece/ALTERNATES/s1200/The-north-needs-to-look-north-to-Scotland.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/business-chiefs-say-north-east-12895095", "country": "GB", "domain_rank": 21960, "title": "Business chiefs say the North East must forge greater links with Scotland so the region can develop", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business chiefs say the North East must forge greater links with Scotland so the region can develop", "spam_score": 0.0, "site_type": "news", "published": "2017-04-14T23:00:00.000+03:00", "replies_count": 0, "uuid": "33e0baa48a72dba0d18db0cc1c907efce1e80644"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/business-chiefs-say-north-east-12895095", "ord_in_thread": 0, "title": "Business chiefs say the North East must forge greater links with Scotland so the region can develop", "locations": [], "entities": {"persons": [{"name": "reay atkinson", "sentiment": "none"}, {"name": "john bridge", "sentiment": "none"}, {"name": "aidan ruff", "sentiment": "none"}, {"name": "mo o’toole", "sentiment": "none"}, {"name": "jeremy middleton", "sentiment": "none"}, {"name": "holyrood", "sentiment": "none"}, {"name": "viscount ridley mark stephenson", "sentiment": "none"}, {"name": "alastair balls  alastair balls", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "john hall", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "news business chiefs", "sentiment": "negative"}, {"name": "international centre for life", "sentiment": "none"}, {"name": "north east infrastructure commission", "sentiment": "none"}, {"name": "invicta public relations michael stephenson chair helena biosciences richard swart md berger group paul woolston former chair", "sentiment": "none"}, {"name": "north of england development council", "sentiment": "none"}, {"name": "development bank", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "dti alastair balls chair international centre for life tony bradley ceo public relations consultancy john bridge chair carillion academies trust mark bridgeman vice chair country landowners association lord callanan dennis clark former md ogn group offshore engineering sir peter carr former chair nhs trust development authority tony henfrey chair north star foundation chris lendrum former deputy chair barclays plc richard maudslay chair perseus global ltd advisory board jeremy middleton chair middleton enterprises miles middleton former chair rural development commission andrew mitchell chair ne social investment company", "sentiment": "none"}, {"name": "carillion academies trust", "sentiment": "none"}, {"name": "middleton enterprises", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Business chiefs say the North East must forge greater links with Scotland so the region can develop Leading figures have responded to a Government Green Paper on industrial strategy, and say we need to look north Share The north needs to look north to Scotland Share   Thank you for subscribing!   \nBusiness leaders say the North East needs to forge closer links with Scotland and form a joint development council if the region is to grow. \nKey North East entrepreneurs and executives have written to the Government outlining their response to the Industrial Strategy Green Paper. \nThe Industrial Strategy is a blueprint for developing Britain until 2040. \nIn its Green Paper, Whitehall says it is committed to working with the regions to help them flourish, develop specialisms and build on their existing strengths. Read More North East firms could see a 10% business rates cut, Communities Secretary Sajid Javid has announced \nProminent North East business figures have combed through the paper and come up with ideas for how the North East can embrace the opportunities which the Government envisions. By 2040, the letter’s signatories aim for the North East to be a region which ranks above its rivals within Britain. \nInstead of only looking to London, the businesses leaders say the North East has to forge greater links with Scotland if the region is to push forward in a post-Brexit Britain. \nThey suggest creating a Scotland and North of England Development Council, and say the North East has to be ready to respond positively when Holyrood says it wants to improve road and rail links between Scotland and Northumberland . Alastair Balls \nAlastair Balls, chairman of the International Centre for Life, who signed the letter, said: “Despite the progress the North East has made, we are concerned that on a wide range of social and economic indicators the North East is one of the poorest performers of all the UK regions. \n“We believe that there are a number of key issues which must be tackled, especially in the context of a post-Brexit economy, if we are to bring about a major shift in the relative economic fortunes of our region over the next 20 years.” \nCurrently, the North East has the highest unemployment rate in the country, according to the letter, and 30% of the region live in areas which are among England’s top 20% for deprivation. The response outlines key challenges the North East faces if it is going to tip the scales in its favour. These include: Developing a quality provision of education and technical training which will bear international comparison Ensuring that our universities are able to make a greater contribution to developing an enterprise economy in the North East Enhancing all aspects of the North East’s infrastructure against a clear long-term plan Implementing a competitive inward investment marketing capability Establishing financial capacity based on locally-based institutions Cultivating a climate of encouragement for enterprise Developing a cadre of individuals able to straddle the public and private sectors who can offer the region the long-term leadership it needs Read More Freddy Shepherd promises to back devolution as business makes £7.5m profit \nA wish list has been drawn up of schemes aimed at overcoming the challenges. These include the creation of an education ‘Think and Do’ tank; a joint Business-Universities taskforce; an independent North East Infrastructure Commission; a regional Development Bank; and a North East Leadership Development Programme. \nJeremy Middleton, chairman of Middleton Enterprises, who signed the letter, said: “Some of these proposals will require government involvement or financial support, others a supportive and facilitative approach from Whitehall. \n“However, all will require the active engagement of the private sector, not only businesses but social entrepreneurs, third sector organisations and investors.” \nJohn Bridge, Carillion Academies Trust’s chairman, added: “The group has come together to formulate a response as we determined to take this agenda forward and hope to do so with Ministerial support and within the framework of the broader national Industrial Strategy.” Sir John Hall (Photo: Newcastle Chronicle) Who has signed the letter? Reay Atkinson Former Regional Director DTI Alastair Balls Chair International Centre for Life Tony Bradley CEO Public Relations Consultancy John Bridge Chair Carillion Academies Trust Mark Bridgeman Vice Chair Country Landowners Association Lord Callanan Dennis Clark Former MD OGN Group Offshore Engineering Sir Peter Carr Former Chair NHS Trust development Authority Tony Henfrey Chair North Star Foundation Chris Lendrum Former Deputy Chair Barclays PLC Richard Maudslay Chair Perseus Global Ltd Advisory Board Jeremy Middleton Chair Middleton Enterprises Miles Middleton Former Chair Rural Development Commission Andrew Mitchell Chair NE Social Investment Company Mo O’Toole Professor of Practice in the Cultural & Creative Economy The Viscount Ridley Mark Stephenson Partner Invicta Public Relations Michael Stephenson Chair Helena Biosciences Richard Swart MD Berger Group Paul Woolston Former Chair of the North East LEP Aidan Ruff NE Entrepreneur", "external_links": [], "published": "2017-04-14T23:00:00.000+03:00", "crawled": "2017-04-14T18:20:28.820+03:00", "highlightTitle": ""}