{"organizations": [], "uuid": "aa375795ac7c4750c62f59cfd61ce3849a17da00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12950043.ece/ALTERNATES/s1200/Nestle-job-cuts.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-says-government-help-threatened-12950009", "country": "GB", "domain_rank": 21960, "title": "Theresa May says the Government will help threatened Nestle staff find new jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May says the Government will help threatened Nestle staff find new jobs", "spam_score": 0.0, "site_type": "news", "published": "2017-04-27T01:55:00.000+03:00", "replies_count": 0, "uuid": "aa375795ac7c4750c62f59cfd61ce3849a17da00"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-says-government-help-threatened-12950009", "ord_in_thread": 0, "title": "Theresa May says the Government will help threatened Nestle staff find new jobs", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "greg clark", "sentiment": "none"}, {"name": "maskell", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "girvan", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "rachael maskell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew matthews/pa wire", "sentiment": "none"}, {"name": "anita lower", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "york", "sentiment": "none"}, {"name": "fawdon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "halifax", "sentiment": "none"}], "organizations": [{"name": "nestle", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "department for business", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle north labour", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May says the Government will help threatened Nestle staff find new jobs Prime Minister promises help, and insists the job cuts at Nestle's Newcastle factory are nothing to do with Brexit Share Nestle factory in Newcastle, the confectionery giant is planning to cut almost 300 jobs and move production of the Blue Riband chocolate biscuit to Poland, unions said (Photo: PA) Share Get daily   Thank you for subscribing! Could   \nTheresa May has pledged to help get Nestle workers at risk of redundancy back into work. \nIt follows the announcement that 110 job losses are expected at the Nestle factory in Fawdon , Newcastle, after the company put forward plans to switch production of the Blue Riband biscuit to one of its plants in Poland. \nSites in York, Halifax, and Girvan, Scotland, are also likely to be hit, and nearly 300 roles are set to be lost in total. \nShe told the House of Commons that Business Secretary Greg Clark would meet Nestle representatives. A Department for Business spokesperson later confirmed that the meeting had taken place, but said the Department was not releasing further details. \nBut it appears the Government’s response will focus largely on helping staff who lose their jobs to find new work. \nMrs May told MPs: “DWP (Department for Work and Pensions) of course stands ready to put in place their rapid response service to support any workers made redundant, by helping them back into employment as quickly as possible. \n“There are various ways in which JobCentre Plus can help. \n“I think what is important is that we ensure the support is there and, as I said, the Business Secretary will be speaking to Nestle representatives later today.” Prime Minister Theresa May speaks during Prime Minister's Questions in the House of Commons, London (Photo: PA) \nShe also rejected claims by some opposition politicians that the job cuts were caused by Brexit. \nMrs May said: “We should be clear that Nestle have themselves been clear that this is not a decision that was affected by leaving the European Union. They said they’d made it irrespective of that. \n“But of course it’s a worrying time for the workers and their families at Nestle in both York and Newcastle , and I can assure her that we’re already in contact with the company to understand their plans and the next steps.” Read More 1,300-job development in Sunderland likely to be turned down after it puts larger scheme at risk \nA 45-day consultation has begun on the proposals with trade union and other employee representatives, with the company saying it hopes to achieve all of the job losses through voluntary redundancies. \nThe Prime Minister was responding to questioning from Labour MP Rachael Maskell, who suggested the Government should ensure Nestle continued investing in the UK after Ministers apparently offered carmaker Nissan a deal to ensure it maintained investment at its plant in Sunderland as the UK leaves the EU. Nissan (Photo: Andrew Matthews/PA Wire) \nMs Maskell asked: “Jobs, not products, being exported to the EU and, as ever, York’s skilled jobs replaced by low wage, insecure work. \n“In the light of the special deal at Nissan in Sunderland, will the Prime Minister meet with me, trade unions and the company to strike a special deal to save these jobs, avert the losses both now and in the future.” \nThe Prime Minister did not directly respond to this, but by insisting that Nestle’s move is nothing to do with Brexit she made it clear that she does not think the situation is comparable to the one at Nissan. \nLiberal Democrats insist Brexit is to blame. Anita Lower, Leader of the Opposition on Newcastle City Council and the Liberal Democrats candidate for Newcastle North, where the Fawdon factory is located, said: “The falling value of the pound following the Brexit decision has made imported raw materials prices more expensive. We believe that by moving to Poland, the company is seeking to protect its market position within the EU, as we have previously warned companies would do.” \nNewcastle North Labour MP Catherine McKinnell has demanded action from the Business Secretary to save jobs. \nShe said: “I am urgently writing to the Business Secretary asking him to work with me, Nestle and the GMB union to try and find a way of retaining these good jobs here in Newcastle where they belong. \n“The Government cannot allow its single-minded focus on Brexit to distract from the need to protect British jobs now, and I will be doing all I can to support all the families affected by this extremely disappointing decision.” Like us on Facebook", "external_links": [], "published": "2017-04-27T01:55:00.000+03:00", "crawled": "2017-04-26T21:55:03.000+03:00", "highlightTitle": ""}