{"organizations": [], "uuid": "39ea4c83f1b6680dc4f768820bdcf5b96c7e432e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9011899.ece/ALTERNATES/s1200/JS60869826.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/dont-expect-agree-100-partys-12949847", "country": "GB", "domain_rank": 21960, "title": "I don't expect to agree with 100% of my party's manifesto; no politician should", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "I don't expect to agree with 100% of my party's manifesto; no politician should", "spam_score": 0.0, "site_type": "news", "published": "2017-04-27T01:05:00.000+03:00", "replies_count": 0, "uuid": "39ea4c83f1b6680dc4f768820bdcf5b96c7e432e"}, "author": "Jonathan Arnott", "url": "http://www.chroniclelive.co.uk/news/news-opinion/dont-expect-agree-100-partys-12949847", "ord_in_thread": 0, "title": "I don't expect to agree with 100% of my party's manifesto; no politician should", "locations": [], "entities": {"persons": [{"name": "kate hoey", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "south", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "spitfire", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion I don't expect to agree with 100% of my party's manifesto; no politician should North East Ukip MEP Jonathan Arnott says every disagreement within a party does not signal an existential crisis Share The region's MEP Jonathan Arnott Share Get daily   Thank you for subscribing! Could   \nThanks to Theresa May, we have a General Election coming up. It’s the strangest election in living memory, taking almost everyone by surprise. \nI was trying to take a holiday for a week in Spain when the news came through; being involved with politics, well let’s just say that the remaining time wasn’t much of a holiday at all (though I have to say that working from a balcony in the sun is much more relaxing than working from my office). \nSince then, there’s been an emotional rollercoaster. It’s made me think a lot about political parties, tribal loyalties and what it means to be active in politics. Anyone who gets involved should be doing this for the good of the country: we should put country first, principles second, political party third and personal ambition (if any) last. \nThat means different things to different people though. There are dilemmas left, right and centre - and I don’t just mean on the political spectrum. \nFrom UKIP’s perspective , we’ve become the ‘guard dogs of Brexit ’, but then how can we do that if our votes help to knock out good, honest, hard-working MPs (even if they happen to wear a different-coloured rosette)? \nCan we really justify fielding a candidate against (say) the Conservatives ’ Anne-Marie Trevelyan or Labour’s Kate Hoey? Both have been principled campaigners for a reasonable, fair Brexit and have been staunchly loyal to that cause, leaving aside political divides. \nYet we know that other parties won’t do us the same courtesy. The Conservatives will do UKIP no favours in Hartlepool, where UKIP needs just a 4% swing to take the seat, even though it would stop Corbyn’s candidate. Nor would Labour do us any favours in seats down South where the shoe is on the other foot. There are questions of principle everywhere. Jonathan Arnott \nPolitical parties are broad churches. We don’t all agree with every policy that our parties put forward. I know that I won’t be able to agree with absolutely 100% of the UKIP manifesto. Conservatives, Labour and Liberal Democrats doubtless feel the same about their parties’ manifestos. \nThere’s a saying that if you agree with 50% of a party’s policies, you should vote for it. If you agree with 60%, you should join it. If you agree with 70% you should campaign for it. If you agree with 80% you should stand for election, and if you agree with 90% you should stand for leader But if you agree with 100%, you must be mad. \nWe’re all individuals after all; our views (unless we’re some major-party careerist who goes straight from a politics degree to working in a spin doctor’s office to a think tank to standing for a Parliamentary seat without ever doing a real day’s work) don’t come from focus groups and they don’t change just because a national party produces some new diktat. \nWe all believe in things, there are issues and principles that drive us. I’ve always been in favour of low taxes, for example, because I believe that we can spend our money better than the government can. I want us to be tougher on crime because I put victims’ rights above the rights of criminals. I want us to end the scandal of thousands of homeless veterans sleeping on the streets every night of the year. \nIf those views sound a little glib, it’s because I can’t explain my driving beliefs in just a few words. It so happens that, on the majority of issues, they fit better with UKIP than they do any other party. Jonathan Arnott \nThis isn’t about persuading you to vote UKIP. It’s important to engage fully in the democratic process, even if some people feel a bit fatigued and a bit let down by politics. Your vote can change the nation. Whether you agree or disagree with me, the right to vote is something that has been fought for tooth and nail - from the Suffragettes to Spitfire pilots. \nI know it’s often difficult to want to vote when politicians lie to us, or say things we disagree with. I’ve vocally disagreed with my own party on many occasions; some in private, some in public. Theresa May promised repeatedly that she wasn’t going to call a snap General Election, then looked at the opinion polls and called one anyway. That kind of thing doesn’t create trust in people. \nSo if there’s one thing I want to see more of in this election campaign, it’s honesty: I want people to be able to trust politicians again. And if there’s one thing I’d like to see from the media, it’s recognising grown-up disagreement within parties without blowing it up into an existential crisis. \nI might disagree with this policy or that, and that’s healthy - but at my core I agree with UKIP’s fundamental principles of freedom, independence and democracy, putting power back in the hands of the people. \nJonathan Arnott is Ukip MEP for the North East. Read More", "external_links": [], "published": "2017-04-27T01:05:00.000+03:00", "crawled": "2017-04-26T21:00:42.000+03:00", "highlightTitle": ""}