{"organizations": [], "uuid": "5a5a6f203e0c86f709e8ab9d769bcb2ae8fd0672", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12876662.ece/ALTERNATES/s1200/Price-increases.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12934326", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Sterling slump boosts dividend payments, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Sterling slump boosts dividend payments, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2017-04-24T15:10:00.000+03:00", "replies_count": 0, "uuid": "5a5a6f203e0c86f709e8ab9d769bcb2ae8fd0672"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12934326", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Sterling slump boosts dividend payments, plus latest news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Meet the residents of Newcastle's first dog cafe \nIt’s Monday, and many of you will be returning to work after a week off..so to ease you back here’s the best small business news you’ll read all day - if you’re a dog lover. \nNewcastle’s Pudding Chare is getting its second animal-related business late next month when Dog and Scone - the city’s first dog cafe - opens right next door to Mog on the Tyne. \nOwner Shi Shi, who spent a year hunting for suitable premises in the city centre, is busy fitting out the empty unit, which has been empty for some time. \nAnd he’s now revealed the stars of the show. Meet the furry dog family - all the Monday motivation you’ll need. Lucky the Bichon Frise, of the Dog and Scone dog cafe 8.56 Coreena Ford Durham mother's baby weaning invention gets global attention \nA Durham mother who grew frustrated at messy mealtimes with her baby daughter has seen her solution grab worldwide attention. \nDawn Elizabeth Howe created a long-sleeved weaning bib for little Emily to protect against spillages and stains – and within weeks of launching it for sale on MessyLittleThing.com she is already generating interest from as far away as Europe, South Africa and the US. \nA Durham mother who grew frustrated at messy mealtimes with her baby daughter has seen her solution grab worldwide attention. \nDawn Elizabeth Howe created a long-sleeved weaning bib for little Emily to protect against spillages and stains – and within weeks of launching it for sale on MessyLittleThing.com she is already generating interest from as far away as Europe, South Africa and the US. \nHaving started just making a handful, she’s now receiving a steady stream of orders from across the UK, Germany and the US, as well as a distribution request to South Africa. \nThe 39-year-old from Durham City, whose day job is head of marketing at Sunderland online bingo operators tombola, launched her own online business at MessyLittleThing.com last summer, through which she sells the long sleeved weaning bib and a range of other products to help keep mealtimes clean. \nOrders are growing every month for the bibs, mess mats, aprons and coveralls. Dawn Elizabeth Howe of MessyLittleThings.com with her daughter Emily (Photo: MessyLittleThings) 8.54 Coreena Ford Search for £100m Newgate Centre's new shops and leisure firms begins \nThe search to find retailers and leisure firms keen to be a part of the multi-million pound regeneration of the Newgate Centre is under way . \nNewcastle-based chartered surveyor and property consultancy Sanderson Weatherall has been appointed as letting agent on 22,000 sq ft of retail and leisure space which will be available at the new centre, which is currently under construction. \nMcAleer and Rushe purchased the two-acre city centre site for £18.2m in 2006, but the existing 1960s Newgate Shopping Centre was only flattened last year to make way for a new £100m mixed use development. \nDue to be completed in spring 2018 , the development will include a 575-bed student residential scheme and 269-bed hotel, as well as the planned shops and leisure space. \nSanderson Weatherall wants to hear from companies who want to come on board in the remaining space. \nMark Convery, retail agent at Sanderson Weatherall said: “This is a fantastic opportunity for retail and leisure brands to become part of a landmark development in the heart of Newcastle city centre. The current construction site at the former Newgate Shopping Centre (above) and a CGI of the proposed new building (below) 8.46 Coreena Ford Jobs in jeopardy as two Burger King franchisees call in administrators \nThree Burger King restaurants in the North East are facing closure after administrators were called in to two firms which run outlets across the UK. \nAround 1,000 jobs are at risk at 36 franchises after advisory firm AlixPartners was enlisted by Millcliffe Ltd and CPL Foods Ltd following cash flow problems. \nThose at risk include three North East franchises, in Shaftesbury Avenue, South Shields , Bedford Street in North Shields , and the Forum Shopping Centre in Wallsend . \nNick Cropper, Ryan Grant and Catherine Williamson of business advisory firm AlixPartners were appointed joint administrators over Millcliffe Ltd and CPL Foods Ltd on April 7, when delays in developing and opening new stores, part of their growth strategy, triggered financial issues. \nAll 36 branches are remaining open and trading while administrators said they are looking into all possible options, for a sale of all or parts of the business. The Burger King, on Bedford Street, North Shields 8.42 Coreena Ford The Word in South Shields is judged the North East's best new building \nA new national centre for the written word has been hailed at the region’s best building, winning three trophies at the North East’s main property awards. \nMore than 50 of the North East’s most impressive property schemes battled it out for top honours at the 2017 RICS Awards North East, where the centre, in South Shields and known as The Word, was named overall Project of the Year. \nThe annual awards, held at the Civic Centre in Newcastle, celebrate inspirational initiatives in the region’s land, property and construction sectors. \nThe One Show TV presenter Angellica Bell was the host for the sell-out ceremony, which attracted more than 300 local property professionals. \nThe highly acclaimed Project of the Year accolade is presented to the scheme which demonstrates overall outstanding best practice and an exemplary commitment to adding value to its local area. \nThe Word scooped the top title after winning three categories earlier in the evening – community benefit, design through innovation and tourism and leisure. \nRICS judges praised the team behind The Word – FaulknerBrown Architects, Muse Developments and Rex Proctor & Partners – for creating an inspiring and interactive community-led centre with exemplary facilities. \nFacilities include a 21st Century library, a media studio complete with a green screen and video production facilities, and a ‘StoryWorld’ room designed to bring stories to life through images projected on the walls to an accompanying soundtrack. \nThe Word, part of first phase of the £100m South Shields regeneration masterplan, has welcomed more than 116,000 visitors in its first three months and allowed South Tyneside Council to create a calendar of exhibitions, workshops and events to encourage new visitors to the town. The Word, South Shields (Photo: RICS) 8.36 Coreena Ford Employment laws change backed by some firms \nFew businesses want to see a dramatic shift in employment laws as a result of Brexit, but some would like changes in areas such as sick leave and discrimination legislation, a study shows. \nA survey of over 40 firms by GQ Employment Law found a minority backed a cap on discrimination and equal pay awards. \nSpokesman Paul Quain said: “Our survey backs the widely reported view that business wants stability post-Brexit.” 8.35 Coreena Ford Goals Soccer Centres in merger talks with Powerleague \nFive-a-side football business Goals Soccer Centres has confirmed that it is in preliminary discussions with rival Powerleague over a potential merger. The company said a tie-up was one of a number of “strategic opportunities” being assessed by the board. \nIn a statement the firm said: “The board of Goals notes the recent press speculation concerning discussions with Powerleague and the possibility of combining the two businesses. \n“The preliminary discussions with Powerleague are but one of the strategic opportunities currently being assessed by the Goals board. \n“Furthermore, at this stage, no commercial or financial terms have been agreed and no decision on any course of action has been made by the board. There is therefore no certainty that any transaction will proceed.” \nGoals, which has centres in Newcastle, Sunderland and Middlesbrough, returned to profit last year after posting a loss in 2015 and has been boosted by a new strategy under boss Mark Jones. \nPart of his five-year plan includes a refurbishment programme, which has seen upgraded ProTurf pitches, new LED lighting systems and renewed stadia boards at pitches across its estate \nThe East Kilbride-based firm posted pre-tax profit of £3.7 million in the year to December 31, compared with a £6.2 million loss in 2015. Sales rose 1.6% to £33.5 million. \nPowerleague, which is owned by private equity firm Patron Capital, operates over 700 pitches. Goals soccer centres logo 8.30 Coreena Ford Gateshead company which closed with loss of 240 jobs had made big losses for two years \nA Tyneside company that closed in January with the loss of 250 jobs had made big losses for the last two years, new accounts show. \nAEI Cables, which had a history dating back more than 175 years, shut its factory in Birtley, Gateshead, earlier this year when Dubai-based parent company was unable to find a buyer for the business. \nThe firm went into a Company Voluntary Administration (CVA), but now accounts published for the first time for 2015 and 2016 reveal the company had been making annual losses above £4m in the last two years of its operations. \nAccounts for the year ended December 31 2016 showed that the company made a £4.9m loss on revenues of £25.6m. Delayed accounts for the year previously had AEI making a £4.2m loss on a £27.2m turnover. \nA note on the latest accounts said: “Throughout the year the company continued to have a strong order book but was unable to execute orders on a timely basis due to manufacturing difficulties. \n“To address these issues there has been continued financial support in 2016 from our parent company. The manufacturing constraints have impacted sales during the year and lead times and service levels were affected.” \nDetails for the CVA, which happened after the end of the accounts period, will see creditors receiving a minimum of 28p in the pound on their debts. Main creditors include Emirates Bank, HMRC, Dubai Cable Company and Gateshead Council. \nThe accounts go on to say that the “company has been restructured following the CVA and will no longer manufacture cable in the current site but will source it from elsewhere”. AEI cables based in Birtley, Gateshead 8.25 Coreena Ford From a childhood dream to a £1m business: How Jordan McCabe realised her ambitions \nThis week’s big interview is with Jordan McCabe, the founder of Atzec Diamond Equestrian , who spent most of her childhood preparing for her career. \nShe was 10 when she started designing outfits for horse riders - and her ponies - and stuck to her plans...resulting in today’s growing, global business that will hit £1m in sales for the first time this year. \nAnd she’s got big plans the future. Jordan McCabe, founder of Aztec Diamond Equestrian, with some of her designs (Photo: Aztec Diamond Equestrian) 8.20 Coreena Ford Cath Kidston boss says strength of 'Brand Britain' vital post-Brexit \nThe chief executive of Cath Kidston has said it is essential for “brand Britain” that businesses continue to have access to key markets and fresh talent and that the rights of EU nationals are protected following Brexit. \nKenny Wilson said that the “strength of brand Britain” is tied up in a view of the country as “open minded”. \nHe said: “The strength of brand Britain is really important to us, and I would like to see access to countries from a trading perspective, whether that’s the EU or otherwise. \n“We have a lot of EU colleagues and I want to make sure those people are protected, are able to stay here and flourish and help us grow. And I want to make sure there is still a fresh supply of talent open to this country.” \nThe clothing and homewares retailer employs more than 1,400 people and Mr Wilson’s comments come as Theresa May faces down Cabinet colleagues who want the Prime Minister to abandon her pledge to limit net migration to the tens of thousands. \nBut Mr Wilson added that Cath Kidston’s popularity in Asia, and brand Britain generally, has not been tarnished as a result of the Brexit vote. \n“People don’t believe that because of Brexit the country is now an inward-looking and backward place. \n“I believe this is an open-minded country, whatever policies the government ends up with. \n“The reason Cath Kidston has been successful is because of Britishness. People have a view of Britain as an open-minded country, as a creative country, where there’s good education.” \nMr Wilson said the chain, which has 77 stores in the UK including in Newcastle and the Intu Metrocentre in Gateshead, has seen a steep rise in tourist spending since the Brexit vote, with the collapse in sterling boosting. Cath Kidston's Intu Metrocentre store 8.15 Coreena Ford FTSE and pound latest \nThe pound at 8am was 1.2784 dollars compared to 1.2782 dollars at the previous close. The euro at 8am was 0.8482 pounds compared to 0.8371 pounds at the previous close. \nThe FTSE-100 index opened at 7114.55. 8.14 Coreena Ford Jimmy CHoo on the market \nThe board of luxury shoe brand Jimmy Choo has put the business up for sale as part of a strategic review. \nThe company said that it has decided to conduct a review of the various options open to it, including a sale, in order to “maximise value for its shareholders”. Jimmy Choo said: \nThe board of Jimmy Choo announces today that it has decided to conduct a review of the various strategic options open to the company to maximise value for its shareholders and it is seeking offers for the company. \nThe brand’s largest and controlling shareholder, JAB Luxury, has thrown its weight behind the sale process, although the company added that it is not yet in receipt of any approaches. \nThe board is working with Bank of America Merrill Lynch and Citi on the deal. \nIn March, Jimmy Choo cheered record revenues and profits thanks to a boost from the Brexit-hit pound and strong sales across Asia. \nThe designer firm saw annual revenues climb 15% to £364m in the year to the end of December, while earnings lifted 16% to £59m over the period. \nJimmy Choo, which has more than 150 stores worldwide, also cheered growing sales from its men’s division, which accounts for 9% of revenue. Silver Abel glitter shoes by Jimmy Choo - these were actually on show at the Bowes Museum last year (Photo: Victoria and Albert Museum London) 8.10 KEY EVENT Brexit-hit pound results in bumper boost for dividend payments \nInvestors have seen their dividend payments jump 16% since the start of the year thanks to a lift from the Brexit-hit pound, a report said. \nDividends reached £15.3bn for the first quarter as multinationals enjoyed an exchange rate boost on their overseas earnings when converting them back into pounds, according to Capita Asset Services. \nThe report said dividends also rose 9.5% to £15.4 billion on a headline basis for the first three months of the year, with growth impacted by a steep decline in special dividends. \nJustin Cooper, chief executive of Shareholder Solutions, part of Capita Asset Services, said the “sugar rush” of exchange rate gains would not be enough to satisfy investors in the long term. \nHe said: “It’s going to wear off quickly in the third quarter, unless there is a second leg downwards in the pound. \n“That cash is of course real, at least in sterling terms, but only long-term profit growth can deliver sustainable increases in the income from shares. “Unfortunately, profit growth has been rather meagre from UK plc of late.” \nThe report found that sterling’s slump had bolstered payments by 12 percentage points year-on-year. \nThe rise was also underpinned by a stronger-than-expected payout from BHP Billiton - the world’s biggest miner by market capitalisation - which added 3.5 percentage points to the headline growth rate. \nIt said telecoms firms and consumer goods businesses, coupled with energy and commodities firms, had chalked up the best performance, while healthcare and pharmaceuticals suffered. \nMr Cooper added: “Global growth is picking up strongly, however, and that should spur expansion in company earnings. \n“Dividends will benefit in concert, though they tend to lag profit growth by about six months. \n“That bodes well for the top 100, but in the meantime the exciting story rests with the mid-caps. \n“They depend most on the prospects for the domestic economy, while those in the top 100 are more related to global economic trends and the exchange rate.” \nThe report has forecast underlying dividends to climb by 7.7% to £84.6bn for this year, but expects headline dividend growth to ease to 2.8% on the back of weaker special dividends. (Photo: PA)", "external_links": [], "published": "2017-04-24T15:10:00.000+03:00", "crawled": "2017-04-24T11:07:48.000+03:00", "highlightTitle": ""}