{"organizations": [], "uuid": "a9fe1d10c484b0576dcad279d7f898474cf650e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article10464195.ece/ALTERNATES/s1200/JS76876689.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/energy-policy-set-battle-ground-12947656", "country": "GB", "domain_rank": 21960, "title": "Energy policy set to be a battle ground in the General Election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Energy policy set to be a battle ground in the General Election", "spam_score": 0.0, "site_type": "news", "published": "2017-04-27T01:00:00.000+03:00", "replies_count": 0, "uuid": "a9fe1d10c484b0576dcad279d7f898474cf650e9"}, "author": "Peter McCusker", "url": "http://www.chroniclelive.co.uk/business/business-news/energy-policy-set-battle-ground-12947656", "ord_in_thread": 0, "title": "Energy policy set to be a battle ground in the General Election", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Energy policy set to be a battle ground in the General Election The cost of energy and policies on climate change will come under the spotlight as the UK goes to the polls Share Ratcliffe-on-Soar power station (Photo: PA Archive/PA Images) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAS the decade-long political consensus on UK energy policy fractures, Peter McCusker hears certainty is an industry priority after next month’s Election. \nTHE Climate Change Act, which was approved by all but five of Britain’s 650 MPs, set the UK on the path to decarbonisation and a decade later the UK leads global efforts to cut emissions. \nJust last week the UK became the first major industrialised nation to generate power without coal for a 24 hour period - but, since the Conservative election win in 2015, there have been signs of a policy shift. \nSubsidies have been drastically reduced for solar power and onshore wind and we recently reported a senior civil servant say the Government’s new Industrial Strategy would put the emphasis on keeping prices down. \nMeanwhile Climate Change Minister Nick Hurd last week said the Government’s Clean Growth Plan remains ‘on hold’ due to the ‘fantastically complex and challenging’ nature of the process, Brexit and the Election. \nThis uncertainty has spooked investors, says Rachel Anderson, head of policy and representation at the North East England Chamber of Commerce. \n“To replace our ageing energy infrastructure and invest in new technologies it will require investment from both the public and private sectors. \n“There is evidence to suggest that private sector investment is there but the uncertainty of Government policy over the past few years has made it difficult to plan for investment and calculate returns. \n“A settled policy which identifies a clear approach to the development of generation policy and clear replacements for Feed in Tariffs would be welcome,” she said. Jon Ferris, Utilitywise strategy director \nJon Ferris, strategy director at Tyneside firm Utilitywise , expects the diverging political priorities to be reflected in the Manifesto commitments. \nHe said: “While the Conservative Government has been talking about making energy prices the key element of the trilemma, we would expect more of a focus on energy efficiency from the other main parties.” \nPaul Verrill, director of Teesside-based energy data monitoring specialist EnAppSys, says the Conservative focus on price ‘will be detrimental to renewables and emerging technologies’. \nHe said: “It implies that there is a cost limit to how far they are prepared to go to meet their climate change commitments. \n“We believe this will be at odds with other parties that will see as false economy a softening of commitments on climate change on economic grounds. Wholesale prices are only 50% of the cost of energy, network costs are a significant part of the cost but have yet to be tackled in a comprehensive manner.” \nHe wants to see the main parties commit to further decarbonisation. “Renewable energy and storage technology cost decreases are driving change in the market. The regulatory and political framework finds it difficult to keep up with the pace of this technology change. \n“The energy industry needs stable policy in renewables that provides clarity into the future. This needs to be backed up by a clear energy infrastructure plan that allows investors surety that they can achieve returns on projects built to support this plan,” he said. \nMr Ferris says the Paris Climate Change agreement, the continuing cost reductions in wind and solar generation, and the increasing use of batteries, are now driving the global electricity market. \nHe continued: “We would like to see the commitment to decarbonisation of the UK economy reaffirmed, particularly the targets set out in the 2008 Climate Change Act, even if the EU 2020 renewables targets are abandoned, and clarity on the trajectory for the Carbon Price Floor beyond 2020. \n“Without this certainty, and the instability caused by a reversal of the existing policy, any long term investment in the UK energy sector will be affected.” \nMrs Anderson said it wants to see all parties support efforts to boost training and skills, whilst Durham-based NOF Energy wants to see measures to support the UK offshore supply chain - especially in the emerging offshore wind and decommissioning industries. \n“Investment in skills in the energy sector will be vital and something the North East is well placed to specialise in. Further consideration should be given to creating centres of excellence closely linked to sector development much like the Oil and Gas skills centre in Aberdeen but for renewables and energy generation,” said Mrs Anderson. George Rafferty \nGeorge Rafferty, chief executive of NOF Energy, said: “There are increasingly positive opportunities across the energy sector, including improving conditions in the North Sea and the steadying of the oil price, together with an active offshore wind market and developments in the new nuclear industry. \n“Therefore, whatever party wins the election, they all have to make a commitment to supporting and not hindering the positive direction the industry is currently taking. \n“I’d also like to see a greater commitment to ensuring greater local content on UK based projects. Whatever your views on Brexit, leaving the EU presents the best opportunity Britain has had for some time to help high quality UK suppliers gain a greater share of the market. \n“This includes decommissioning, which will be a significant part of the offshore industry for the next few decades and can benefit from the already well-established UK supply chain, including several companies based in the North East.” \nOne of the first blows in next month’s Election campaign has been landed by the Conservatives with their promise to slash £100 off the energy bills of 17m families - mimicking a Labour Party policy from the last Election. \nFollow Peter McCusker on Twitter @mccusker60 Like us on Facebook", "external_links": [], "published": "2017-04-27T01:00:00.000+03:00", "crawled": "2017-04-26T21:00:47.000+03:00", "highlightTitle": ""}