{"organizations": [], "uuid": "30ebc9d3b70f2fe0eeb238dc816b6e7cb505417c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.7920545.1492547189!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "http://www.bostonstandard.co.uk/news/boston-and-skegness-mp-backs-prime-minister-s-general-election-call-1-7920546", "country": "GB", "title": "Boston and Skegness MP backs Prime Minister’s General Election call", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "Boston and Skegness MP backs Prime Minister’s General Election call", "spam_score": 0.0, "site_type": "news", "published": "2017-04-18T22:33:00.000+03:00", "replies_count": 0, "uuid": "30ebc9d3b70f2fe0eeb238dc816b6e7cb505417c"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/boston-and-skegness-mp-backs-prime-minister-s-general-election-call-1-7920546", "ord_in_thread": 0, "title": "Boston and Skegness MP backs Prime Minister’s General Election call", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boston and Skegness MP backs Prime Minister’s General Election call Boston and Skegness MP Matt Warman Daniel Jaines Have your say \nThe MP for Boston and Skegness Matt Warman has backed Prime Minister Theresa May’s call for a General Election on June 8. \nConservative Mr Warman will be voting in favour of his party leader’s decision to call a General Election when it is put to the House of Commons tomorrow (Wednesday). \nMr Warman said he had heard ‘fractional inklings’ about Mrs May’s plans but added: “The joy of Westminster is that sometimes, appropriately, things are revealed to all of us at the same time. \n“Mrs May is right to say the way we get the best possible deal is to make sure we have a strong Government, a strong majority and a strong leader.” \nMr Warman said he believed that sort of result would ‘endorse the position of Theresa May’. \nIn the European Referendum last June, Boston saw 75.6 per cent of the turnout vote leave. East Lindsey, which includes Skegness, saw 70.7 per cent of voters tick the leave box. \n“The way we get the best possible deal from Brussels and to negotiate the way out is to have a Government in place that has the conviction and confidence to deliver that negotiation and that is the Conservative Government led by Theresa May,” said Mr Warman. \nHe said no-one else had the ‘ability or opportunity’ that Mrs May had to deliver negotiation with the European Union. \nMr Warman retained the Boston and Skegness seat for the Tories in May 2015, taking over from his predecessor and fellow Conservative Mark Simmonds, with 18,981 votes, gaining a majority of 4,336 over second-placed United Kingdom Independence Party (UKIP) candidate Robin Hunter-Clarke (14,645 votes). \nIn that election the historical main Government opposition parties of Labour (Paul Kenny) and the Liberal Democrats (David Watts) took 7,145 votes and 1,015 votes respectively. \nMr Warman indicated that he was confident he would continue to hold the seat in June. \nHe said: “The previous campaign is still relatively fresh in everyone’s memory and I’m looking forward to being able to go out and say what we’re going to get all the things Theresa May has promised. It’s a strong platform to campaign on.” \nGetting the best possible deal is the message the party has got to campaign on, he said, adding: “It’s not about talking about the other parties but talking about the Conservatives and Theresa May. \n“I’m genuinely looking forward to putting the case for a Prime Minister who’s going to deliver a strong and stable Government and who is going to negotiate with the EU in not only the best way for Britain, but also for Boston, Skegness and Lincolnshire.” \nThe Prime Minister announced her intentions during a surprise press conference this morning, in which she said she hoped the election would bring a ‘strong leadership’ ahead of Brexit talks. \nShe accused opposition parties of ‘political game playing’ and causing difficulties in future negotiations. Sign in", "external_links": [], "published": "2017-04-18T22:33:00.000+03:00", "crawled": "2017-04-19T02:32:36.000+03:00", "highlightTitle": ""}