{"organizations": [], "uuid": "bf72fc7a3ef1632c17f9a15b91049aa9f5f1d5c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12916266.ece/ALTERNATES/s1200/VRR_JNL_300616_akzonobel_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/major-north-east-employer-akzonobel-12916011", "country": "GB", "domain_rank": 21960, "title": "Major North East employer AkzoNobel records record profits as it fights takeover bid", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Major North East employer AkzoNobel records record profits as it fights takeover bid", "spam_score": 0.0, "site_type": "news", "published": "2017-04-20T00:39:00.000+03:00", "replies_count": 0, "uuid": "bf72fc7a3ef1632c17f9a15b91049aa9f5f1d5c2"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/major-north-east-employer-akzonobel-12916011", "ord_in_thread": 0, "title": "Major North East employer AkzoNobel records record profits as it fights takeover bid", "locations": [], "entities": {"persons": [{"name": "ton buchner", "sentiment": "none"}, {"name": "antony burgmans", "sentiment": "none"}, {"name": "akzonobel", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}, {"name": "azkonobel", "sentiment": "none"}, {"name": "maelys castella", "sentiment": "none"}, {"name": "henderson", "sentiment": "none"}], "locations": [{"name": "felling", "sentiment": "none"}, {"name": "gateshead  focusing", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "elliott advisor", "sentiment": "none"}, {"name": "akzonobel", "sentiment": "none"}, {"name": "ppg", "sentiment": "none"}, {"name": "columbia threadneedle", "sentiment": "none"}, {"name": "akzo nobel", "sentiment": "none"}, {"name": "egm", "sentiment": "none"}, {"name": "elliott advisors", "sentiment": "none"}, {"name": "dulux", "sentiment": "none"}, {"name": "ppg industries", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dutch authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Major North East employer AkzoNobel records record profits as it fights takeover bid The firm, which has major plants at Gateshead and Ashington, is resisting attempts by a US rival to buy its business Share AkzoNobel's Ashington paint manufacturing facility (Photo: Handout) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA major North East employer battling a takeover attempt has beaten expectations with record profits and unveiled plans to overhaul its business. \nDulux paint maker AkzoNobel - which employs more than 1,000 people at Felling and Ashington - chalked up a 13% rise in earnings to €376m (£314m) in the first quarter of this year, with revenues climbing 7% to €3.7bn (£3.1bn) over the period. \nThe announcement came as the Dutch firm said it would return €1.6bn (£1.3bn) to shareholders in 2017 through a new strategy that will lead to the creation of two separate firms by hiving off its Specialty Chemicals business from its paints and coatings arm. \nAkzoNobel, which employs 3,000 staff across the UK, is hoping the new plan will win the favour of investors left disgruntled by the firm’s decision to snub talks with US rival PPG Industries following its second takeover tilt worth €22.4bn (£19.5bn). \nMaelys Castella, AkzoNobel’s chief financial officer, said the company was committed to increasing returns to shareholders and had launched a €150m (£125m) share repurchase plan during the first quarter. \nShe said: “Our record performance continued this quarter, showing the substantial growth momentum we have across the business. \n“Significant progress continues across all our business areas, reflecting both our strong customer focus and great portfolio of brand.” \nThe company also hiked its full-year outlook, with earnings now expected to be €100m (£84m) higher than 2016. Akzo Nobel factory in Gateshead \nFocusing on the new strategy, chief executive Ton Buchner said: “Our commitment to substantial shareholder returns reinforces our belief that the plan we are outlining today will create a step-change in value creation, generating significant shareholder value in the short, medium and long term. \n“It will be delivered at pace, with a clear timeline and is in the best interest of all stakeholders.” \nIn an open letter on Monday, Pittsburgh-based chemicals manufacturer PPG ramped up the pressure on AkzoNobel, claiming its vision to stay independent was risky and would create less value than if the two companies combined. Read More Pressure grows on big North East employer AkzoNobel to consider takeover \nIt follows calls from activist investor Elliott Advisor, which holds more than 3% of the Dutch firm, for an extraordinary general meeting (EGM) where investors can vote to remove AkzoNobel chairman Antony Burgmans. \nKnown for its strong-arm tactics, Elliott has previously warned it would attempt to oust AkzoNobel’s managers if the company refused to commence talks with PPG. \nThe Dutch company rejected the request for the EGM earlier this month in a bullish response that saw it accuse Elliott Advisors of sharing “price sensitive information”. \nThe Polycell manufacturer reported the investment company to the Dutch Authority for the Financial Markets (AFM) and urged Elliott to outline its relationship with PPG Industries. Read More North East exports fall for second quarter despite Brexit-hit pound \nElliott and other shareholders, including Columbia Threadneedle and Henderson, have urged the paint maker to engage with PPG, but AzkoNobel has said the offer undervalues the company. \nAkzoNobel announced plans earlier this year to build a £10.7m innovation hub at Felling, Gateshead, safeguarding 270 jobs. \nThe firm is also close to launching a £93.7m Dulux paint factory in Ashington, Northumberland. Like us on Facebook ", "external_links": [], "published": "2017-04-20T00:39:00.000+03:00", "crawled": "2017-04-19T19:54:10.000+03:00", "highlightTitle": ""}