{"organizations": [], "uuid": "c85860778b92e3de96452510ba6ef67dfa6961e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30254684/15944848.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/sponsored-making-tax-digital-what-you-need-to-know/story-30254684-detail/story.html", "country": "US", "title": "Sponsored: Making Tax Digital - What you need to know | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Sponsored: Making Tax Digital - What you need to know | Devon Live", "spam_score": 0.012, "site_type": "news", "published": "2017-04-07T01:41:00.000+03:00", "replies_count": 0, "uuid": "c85860778b92e3de96452510ba6ef67dfa6961e9"}, "author": "Devon Live", "url": "http://www.devonlive.com/sponsored-making-tax-digital-what-you-need-to-know/story-30254684-detail/story.html", "ord_in_thread": 0, "title": "Sponsored: Making Tax Digital - What you need to know | Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsored: Making Tax Digital - What you need to know By Devon Live | Posted: April 06, 2017 By Dale Simpson, of Thomas Wescott 0 COMMENTS SHARES \nWhilst not creating huge headlines, there's a good chance that by now you will have heard of HMRC's new tax regime, called Making Tax Digital (MTD), writes Thomas Westcott Chartered Accountants Partner and MTD Expert Dale Simpson, pictured below . \nAnd, if you haven't, you need to start thinking about it, as it launches in less than a year and will eventually impact all UK businesses, landlords and taxpayers. \nSome people have described MTD as \"the most significant change to the UK's taxation system in recent years\". \nI would go further, I believe it's the biggest shake up of our taxation system in a generation! So, what is MTD and how will it affect you? \nIn essence, MTD brings UK businesses' tax affairs into the digital age, primarily via online filing of quarterly updates and a year-end statement to replace the current annual tax return. For individual taxpayers they will each have a digital tax account which will be pre-populated by HMRC and third parties. This will include payroll details; interest receipts from banks or building societies and dividends from companies. \nOnce fully implemented there will be no more self-assessment tax returns (apart from exceptional circumstances). Businesses and their accountants will need to invest in specialist software, together with new accounting systems. \nAs ever with such sweeping changes there will be bumps; already HMRC has announced that whilst MTD launches in April 2018, smaller businesses with turnovers beneath VAT thresholds (£85,000) have another year to prepare. \nRight now the concern is that businesses, already disrupted due to factors like Brexit, will hunker down and focus on their day to day operations rather than face MTD's implementation – a national trade organisation's survey found 65 per cent of SMEs did not currently use software to manage their accounts, making them poorly-prepared for MTD. \nThomas Westcott are fully aware of the problems their clients will be facing to comply with MTD and are providing a range of cost effective services. These include helping clients choose and implement MTD compliant software, with training for its use, through to a full service of recording transactional details and submitting quarterly returns for those who find themselves challenged by the requirements of MTD. \nDuring week beginning 24 April Thomas Westcott are holding a series of eight seminars at various locations in Devon and Somerset to help businesses and taxpayers understand what MTD will require from them and how to best deal with this. Full details can be found on our website at www.thomaswestcott.co.uk ", "external_links": [], "published": "2017-04-07T01:41:00.000+03:00", "crawled": "2017-04-06T22:23:23.421+03:00", "highlightTitle": ""}