{"organizations": [], "uuid": "1979ef55183342d8318192cb7d6ede9f0e409641", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11240964.ece/ALTERNATES/s1200/JS88250285.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12876715", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: New Premier Inn for Whitley Bay funded by LXi REIT investors", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: New Premier Inn for Whitley Bay funded by LXi REIT investors", "spam_score": 0.0, "site_type": "news", "published": "2017-04-11T15:30:00.000+03:00", "replies_count": 0, "uuid": "1979ef55183342d8318192cb7d6ede9f0e409641"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12876715", "ord_in_thread": 0, "title": "Business Breakfast LIVE: New Premier Inn for Whitley Bay funded by LXi REIT investors", "locations": [], "entities": {"persons": [{"name": "mrs miles", "sentiment": "none"}, {"name": "simone lee", "sentiment": "none"}, {"name": "whitley bay share", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "robert walters", "sentiment": "none"}, {"name": "les stoker", "sentiment": "none"}, {"name": "dawn miles", "sentiment": "none"}, {"name": "simon miles", "sentiment": "none"}, {"name": "peter cowgill", "sentiment": "none"}, {"name": "miles", "sentiment": "none"}, {"name": "simon", "sentiment": "none"}, {"name": "michael mcgrorty", "sentiment": "none"}, {"name": "whitley bay", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "whitley bay", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "robertson north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "spanish city dome", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "coreena ford", "sentiment": "negative"}, {"name": "jd sports", "sentiment": "none"}, {"name": "whitehouse farm centre", "sentiment": "none"}, {"name": "anarchy brew company", "sentiment": "none"}, {"name": "premier inn hotels limited", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "recruitment", "sentiment": "none"}, {"name": "pii pipeline solutions", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "coreena ford recruitment", "sentiment": "none"}, {"name": "anarchy brew company limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Northumberland brewery set for expansion after winning bank backing \nAn award-winning brewery based in Northumberland has announced expansion plans after securing investment in new equipment from Barclays. \nMorpeth based business Anarchy Brew Company Limited, which is based at the Whitehouse Farm Centre, was set up by local entrepreneurs Simon and Dawn Miles and has won a number of awards, most notably for its flagship stout Sublime Chaos, \nWith demand for its growing, Mr and Mrs Miles are investing in the brewery and continuing to develop new, exciting, award winning craft beers in bottle, keg, cask and can. \nMr Miles said: “We need to continue with our investment programme to meet the increasing demand for our beers and to ensure that product quality remains the key focus of our business. \n“We’ve invested in eight new vessels together with a production line which will increase capacity and production. \n“Barclays has provided a term loan which will provide the flexibility for us to continue on our growth journey.” Anarchy Brew Company. Front to back Simon Miles, Michael McGrorty, Les Stoker (Photo: Handout, Anarchy) 8.50 Coreena Ford Recruitment firm Robert Walters signals upturn in financial sector \nRecruitment firm Robert Walters has pointed to an upturn in financial services hiring in London following a Brexit-linked slowdown after last year’s referendum. \nThe company said net fee income in the UK rose 27% to £23.9m in the first quarter, boosted by what it described as a “notable upturn in financial services recruitment activity” in the capital. \nIt comes after the firm, along with other recruiters, said June’s vote saw hiring in Britain’s powerhouse financial services sector fall away last year. Robert Walters also flagged a good performance in legal recruitment. \nOverall the firm, which also has international operations in Europe, Asia and North America, said net fee income was up 20% to £78.3m in the period. \nChief executive Robert Walters said: “It’s been a positive start to the year with group net fee income increasing by 20%. “We remain confident about the group’s prospects for the full year.” 8.45 FTSE and pound latest \nThe FTSE-100 index at 8:15am was up 4.60 at 7353.54. \nThe pound at 8am was 1.2415 dollars compared to 1.2417 dollars at the previous close. The euro at 8am was 0.8527 pounds compared to 0.8537 pounds at the previous close. 8.40 Coreena Ford JD Sports expecting further growth despite Brexit pressures \nJD Sports has reported a record set of annual results as the retailer hailed an “exceptional year” and pointed to further growth, despite Brexit-linked inflationary pressures. \nPre-tax profits at the sports-to-fashion chain rose by 81% to £238m in the year to January 28, while revenue grew 31% to £2.3bn. \nLike-for-like sales grew 10% over the period and executive chairman Peter Cowgill said, in spite of rising inflation linked to the collapse in the pound following last year’s vote, the firm is well placed for growth. \n“Whilst we must recognise that there are external influences which may impact the latter part of the year, notably inflationary pressures arising from Brexit, the board remains confident in the robustness of the JD proposition and believes that the group is well positioned for further profitable growth,” he said. \nThe pound’s demise has ramped up costs for British businesses, many of which are having to raise prices for consumers as a result. \nThe group added that while the UK’s vote to leave the European Union means there will be “some uncertainties for the immediately foreseeable future”, its international expansion will have a “clear strategic focus”. \nThe group opened 54 stores across Europe last year and opened a further two stores in Malaysia. The first JD store in Australia is due to open shortly. JD also flagged that its Blacks and Millets brands delivered positive results for the first time. A JD Sports store KEY EVENT Spanish City's Premier Inn development snapped up by London investors \nLondon investment fund LXi REIT has cemented its confidence in the region with a second multimillion-pound property investment in less than a month. \nThe firm has exchanged contracts to forward purchase the new Premier Inn hotel and Beefeater restaurant currently under construction at Spanish City Promenade, Whitley Bay, North Tyneside. \nThe purchase price is £6.26m for the Premier Inn, a deal reflecting a yield of 5%, and the company has paid the vendor a 10% deposit with the balance of the price to be paid on completion of the purchase, which is set for early June. \nThe Company is not assuming development risk or funding the construction works. \nThe hotel and restaurant have both been fully pre-let to Premier Inn Hotels Limited and the lease, which covers both the hotel and restaurant, will run for a term of 25 years from completion of the building works. \nConstruction company Robertson North East England are building the three-storey, 68 bedroom hotel and adjoining single-storey 190 cover Beefeater restaurant, which forms part of the Whitley Bay seafront regeneration masterplan, which includes the redevelopment of the Spanish City Dome. \nLXi floated back in January with a plan to raise £200m to put into raft of property investments, and it was only last month that the firm announced it was putting £11m into a new HQ for Cramlington’s PII Pipeline Solutions . \nSimone lee. partner of LXi REIT Advisors ltd said: \n“We are pleased to be forward purchasing this new Premier Inn hotel and Beefeater restaurant at an attractive yield. \n“The hotel and restaurant sectors are performing very well and the property, which represents our fifth acquisition since listing on 27 February, will provide the Company with a very long, inflation-linked income fully underpinned by the strong Premier Inn covenant. \n“We are also at an advanced stage on the acquisition of a number of additional forward funding and built assets, across a wide range of property sectors, which meet the Company’s investment objective and which should exchange shortly.” Artist's impression: How the new Premier Inn could look in Whitley Bay Share", "external_links": [], "published": "2017-04-11T15:30:00.000+03:00", "crawled": "2017-04-11T11:08:17.508+03:00", "highlightTitle": ""}