{"organizations": [], "uuid": "2bb74b4e4aba60da56b76ca8d5d93e9dc4dafc3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30295989/15974931.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/leicester-election-digest-dogs-vs-doorstepping-politicians/story-30295989-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Leicester General Election news: Dogs vs doorstepping politicians", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published Leicester General Election news: Dogs vs doorstepping politicians", "spam_score": 0.0, "site_type": "news", "published": "2017-04-27T20:13:00.000+03:00", "replies_count": 0, "uuid": "2bb74b4e4aba60da56b76ca8d5d93e9dc4dafc3e"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/leicester-election-digest-dogs-vs-doorstepping-politicians/story-30295989-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Leicester General Election news: Dogs vs doorstepping politicians", "locations": [], "entities": {"persons": [{"name": "jack hickey", "sentiment": "none"}, {"name": "lynn senior", "sentiment": "none"}, {"name": "mrs morgan", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "stephen dorrell", "sentiment": "none"}, {"name": "peter soulsby", "sentiment": "none"}, {"name": "dorrell", "sentiment": "none"}, {"name": "deborah sangster", "sentiment": "none"}, {"name": "patrick kitterick", "sentiment": "none"}, {"name": "jim cunningham", "sentiment": "none"}], "locations": [{"name": "westminster hall", "sentiment": "none"}, {"name": "clarendon park", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicester general election", "sentiment": "negative"}, {"name": "general election", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "coventry south", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "leicester conservative association", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european movement", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (1) \nElection fever is gripping the country - or at least the media. \nOnce parliament dissolves on May 3 campaigning for the General Election will begin in earnest with the somewhat overshadowed county council election to take place the next day. \nHere are a few of the latest election stories and issues from the political battle ground in Leicester and Leicestershire \nGeneral Election 2017: Click HERE for everything you need to know 'Who let the dogs out?' \nLoughborough MP Nicky Morgan has been using the last few days of parliament to raise the issue of dangerous dogs - particularly sentencing for canine on canine attacks. \nIt is of course a serious subject but there were knowing smiles around Westminster Hall as the debate took a brief detour into the risks posed by angry hounds with an taste for election canvassers. \nMrs Morgan said: \"As candidates, I suspect we have all been in situations, and perhaps will be in the next few weeks, where we are walking up a path, intending to knock on the door or deliver a leaflet, and are faced with a rather angry looking dog. The owner may say it is friendly, but we are never entirely sure whether it really is friendly or has a particular appetite for canvassers. \n\"The hon. Member for Coventry South (Jim Cunningham) speaks from personal experience.\" \nFollowing the debate Mrs Morgan said she had never been bitten while out on the stump but admitted to the Mercury she had one sacrificed a potential vote by giving a house the swerve because only a rickety gate was holding back a large and agitated dog. \nStay safe out there people. 'City council by-election after Labour resignation' \nA city council by election will be held on June 8, the day of the General Election, after the resignation of a Labour councillor. \nLynn Senior has stepped down so she can focus on recovery from a long term health issue. \nShe has represented the Castle ward on the council since 2009. \nHer resignation leaves an open seat on the council which officials have indicated will be filled after a June 8 election. \nThree city councillors represent the ward which covers most of the city centre and Clarendon Park. \nThe other two seat are held by Labour's Patrick Kitterick and Deborah Sangster. \nRead more: Councillor questions need for her own £2,866 job after committee meets for first time in 13 months \nLabour city mayor Sir Peter Soulsby said: \"I was really sorry to hear she was stepping down. She has been a sensible and intelligent representative for the Castle ward and I wish her well with her recovery.\" \nIt is so far unclear who Labour will choose to defend the seat or who the other parties will select to try to take it. \nLeicester Conservative Association chairman Jack Hickey has confirmed the Tories will contest the seat but said a candidate had yet to be selected. \nFollowing Coun Senior's resignation, the council has 51 Labour members, one Tory and one Lib Dem. \nThe next city wide council election is scheduled for 2019. Remember Stephen Dorrell? \nThe former Tory MP may have stepped away from Leicestershire politics in 2015 but he could yet play a key role in the upcoming election. \nMr Dorrell is chairman of pro-EU campaign group European Movement which has teamed up with like-minded Open Britain to try to unseat 20 Brexit supporting MPs on June 8. \nThe groups want to reduce the number of MPs supporting a hard Brexit. \nNone of the 20 seats are in Leicestershire. \nMr Dorrell quit as MP for Charnwood in 2015 having represented the area for 29 years. ", "external_links": [], "published": "2017-04-27T20:13:00.000+03:00", "crawled": "2017-04-27T16:08:28.000+03:00", "highlightTitle": ""}