{"organizations": [], "uuid": "be24204ba627625e2eee8556a67c27ec0598e595", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30245752/15937645.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/don-t-know-what-ebitda-capex-and-roce-means-you-re-not-alone/story-30245752-detail/story.html", "country": "GB", "title": "HannahFinch published Don't know what EBITDA, CAPEX and ROCE means? You're not alone", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "HannahFinch published Don't know what EBITDA, CAPEX and ROCE means? You're not alone", "spam_score": 0.0, "site_type": "news", "published": "2017-04-03T19:09:00.000+03:00", "replies_count": 0, "uuid": "be24204ba627625e2eee8556a67c27ec0598e595"}, "author": "HannahFinch", "url": "http://www.devonlive.com/don-t-know-what-ebitda-capex-and-roce-means-you-re-not-alone/story-30245752-detail/story.html", "ord_in_thread": 0, "title": "HannahFinch published Don't know what EBITDA, CAPEX and ROCE means? You're not alone", "locations": [], "entities": {"persons": [{"name": "hannahfinch", "sentiment": "none"}, {"name": "peter alderson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "exeter airport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "capex", "sentiment": "none"}, {"name": "roce", "sentiment": "none"}, {"name": "ldf", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Don't know what EBITDA, CAPEX and ROCE means? You're not alone By HannahFinch | Posted: April 03, 2017 0 COMMENTS SHARES South West businesses are not put off by jargon, says a new report Don't know what EBITDA, CAPEX and ROCE means? You're not alone X \nCopy link to paste in your message / Comments (0) \nSouth West SME owners are the least likely in the UK to be deterred from applying for business finance because of the jargon used.Of those surveyed, 70% say that it hasn't put them off compared to a national average of 52.2%. When confronted with the terminology, however, half still didn't understand the meaning of EBITDA, followed by CAPEX and ROCE (46.7%). Know your terms: \n1. Capital expenditure, or CapEx, are funds used by a company to acquire or upgrade physical assets such as property, industrial buildings or equipment. \n2. Return on capital employed (ROCE) is a financial ratio that measures a company's profitability and the efficiency with which its capital is employed. \n3. EBITDA stands for earnings before interest, taxes, depreciation and amortization. EBITDA is one indicator of a company's financial performance and is used as a proxy for the earning potential of a business, although doing so has its drawbacks. \nThe latest survey by LDF, the largest independent provider of finance to small businesses, shows that the approval of, or time taken to receive money, or both has had a negative impact for 63.3% of South West SMEs. This has manifested itself in 36.8% not paying themselves and 21.1% having to make some staff redundant.This wait for and approval of finance has also taken an emotional toll with almost two thirds (63.2%) of South West SME owners feeling stressed and 36.8% feeling depressed. \nPeter Alderson, Managing Director of LDF, said: \"It's disappointing, but perhaps not surprising, that 30% of SMEs in the South West are deterred from applying for finance by the terminology used. \nRead next: What sectors would be most affected by Brexit? \n\"Despite them being among the least likely in the UK to be put off, the number is still too high. \n\"For many, running a SME is a challenging, all consuming activity, so complicated financial jargon and acronyms are just extra barriers in the way of their success. At LDF, we are committed to making not just the terminology of finance, but access to it, as easy and trouble-free as possible.\" \nThe research also shows that just 33.4% of South West SMEs have been turned down for finance, bettered only by Welsh SMEs (30.4%). Half of South West SME decision makers see business finance as a necessary part of business growth, but worryingly 13.3% say that it's the only way to keep their business afloat at the moment. \nWhen asked about any negative opinions around taking out business finance, the SME owners in the region were most likely to say that it made it sound like they were struggling to make ends meet or were a business failure. \nRead next: How Exeter Airport is helping the region fly \nOver 70% also said that they saw it as a last resort when fighting cash flow issues. \nLDF's research also revealed that South West SMEs were the most likely (43.3%) to have made a poor financial decision in the last 12 months, with a lack of knowledge (46.2%) and bad advice (30.8%) being the top reasons. The research was conducted for LDF by Opinion matters between 27.01.17 and 06.02.17 and sampled 506 SME decision makers in construction, professional services, administrative services, wholesale & retail, human health/medical and manufacturing. News", "external_links": [], "published": "2017-04-03T19:09:00.000+03:00", "crawled": "2017-04-03T15:59:10.889+03:00", "highlightTitle": ""}