{"organizations": [], "uuid": "aba7a0366f83b8a8361deeac2408c2646ea1c7e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30282666/15964462.jpg", "site_section": "http://www.westernmorningnews.co.uk/rugby.rss", "section_title": "Devon Live Rugby RSS feed", "url": "http://www.devonlive.com/chris-bentley-column-exe-s-win-over-quins-shows-how-good-rugby-can-be/story-30282666-detail/story.html", "country": "GB", "title": "Chris Bentley column: Exe's win over Quins shows how good rugby...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Chris Bentley column: Exe's win over Quins shows how good rugby...", "spam_score": 0.0, "site_type": "news", "published": "2017-04-20T17:43:00.000+03:00", "replies_count": 0, "uuid": "aba7a0366f83b8a8361deeac2408c2646ea1c7e0"}, "author": "Devon Live", "url": "http://www.devonlive.com/chris-bentley-column-exe-s-win-over-quins-shows-how-good-rugby-can-be/story-30282666-detail/story.html", "ord_in_thread": 0, "title": "Chris Bentley column: Exe's win over Quins shows how good rugby...", "locations": [], "entities": {"persons": [{"name": "exe", "sentiment": "none"}, {"name": "chris bentley", "sentiment": "none"}, {"name": "dafydd james", "sentiment": "none"}, {"name": "jack nowell", "sentiment": "none"}, {"name": "danny grewcock", "sentiment": "none"}, {"name": "wayne barnes", "sentiment": "none"}, {"name": "ollie woodbury", "sentiment": "none"}, {"name": "sarries", "sentiment": "none"}, {"name": "jack maunder", "sentiment": "none"}, {"name": "chris robshaw", "sentiment": "none"}, {"name": "dave ewars", "sentiment": "none"}, {"name": "steeno", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ben foden", "sentiment": "none"}, {"name": "henry", "sentiment": "none"}, {"name": "neil back", "sentiment": "none"}, {"name": "mike tindall", "sentiment": "none"}, {"name": "danny care", "sentiment": "none"}, {"name": "joe marler", "sentiment": "none"}, {"name": "iain balshaw", "sentiment": "none"}, {"name": "lee mears", "sentiment": "none"}, {"name": "chris budgen", "sentiment": "none"}, {"name": "campo", "sentiment": "none"}, {"name": "mark tainton", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "lachie turner", "sentiment": "none"}, {"name": "geoff parling", "sentiment": "none"}], "locations": [{"name": "sandy park", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "steeno", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "quins", "sentiment": "none"}, {"name": "saints", "sentiment": "none"}, {"name": "exeter chiefs", "sentiment": "none"}, {"name": "tigers", "sentiment": "none"}, {"name": "northampton saints", "sentiment": "none"}, {"name": "harlequins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nExcitement and pressure continue to build with the prize of a home semi-final still very much in Exeter Chiefs' hands with only two to play. Some big questions were answered over the weekend, not least whether Bristol could defy the odds and keep their place at the top table. \nIn truth, Mark Tainton's men have disappointed and failed to live up to Premiership expectations. I hear the pundits waxing lyrical about how they are travelling in the right direction and getting a lot of things right. That's as maybe, but they got it wrong on the field, failed to address the issues and are being relegated. \nI concede that it is difficult for the newly-promoted team to bridge the gap from Championship to the elite level but, at the end of the day, ours is a results- driven business. Bristol are a proud club with a great past and potentially sleeping giants. I wish them well and will be watching with interest to see what changes they make in the next chapter of their history. \nWhat a mighty weekend of Premiership action. With a 15-point lead, Northampton Saints had the game in the bag against Sarries and needed to do nothing other than play the percentages to see out the final 10 minutes. In the event, Saints' nerves were shredded as Sarries, with a little help from the referee (check out the 'non intervention' on Ben Foden), broke their hearts with two tries, a penalty and conversion in just eight minutes of play. With two minutes left for Saints to respond, Sarries put the ball up their shirt and that was it, a 27-25 win for the champions. \nBoth games, Bristol versus Wasps and Saints against Sarries, kicked off at 3pm. It was interesting to note Sarries were still stuffing the ball up their shirts to see off Saints well over 10 minutes after proceedings in Bristol had ended. The ball-up-shirts is not a bad description as Sarries play the laws to the limit and seem to suck the referees under their spell of the stop, stop, slow, slow affair that suits their juggernaut power game plan. \nRead next: Four Exeter Chiefs players included in England squad for Argentina tour \nThey are not the only ones – Leicester are able to do it too. But I see no reason why scrums should take three minutes to set, nor do I see any justification in allowing time for on field committee meetings when the ball should be coming back into play. Interplay, celebrations, water stops and scrums that last so long means the forwards are in danger of sprouting roots, and it needs to be refereed out of the game. Fans pay to watch rugby, and I respectfully suggest the referees have a duty to see that players deliver as close to 80 minutes with the ball in play as is reasonably possible. \nNow to the big one – Harlequins v Exeter Chiefs. Wow! What a heart-stopping, nerve-jangling explosion of power, pace, ambition and rugby of the highest order. In all honesty, Quins were immense – Friday's performance would have seen off most teams. Danny Care was as irritating as usual, Chris Robshaw and Joe Marler were colossal and Quins' back line ambitious, fast and threatening. \nYes, Quins were good, but Chiefs were better. We made mistakes, prompting criticism from commentators, but our tsunami offence just kept coming and coming and coming. This was no stop, stop, film the coaches and water boys while players have a meeting affair like Sarries or Tigers, this was ball in play fast, furious and highly entertaining rugby. \nI am delighted to report that Wayne Barnes entered into the ambition of both teams to play rugby with an efficient yet empathetic use of the whistle. It was a thriller. \nSo many of our players were stand out. Quite why Ollie Woodbury has not figured on the international stage is something of a mystery to me. Eat your heart out Bath! Lachie Turner did more for Anglo-Aussie trade than Brexit will ever achieve! He was quite magnificent, but so was Shorty, Jack Maunder, Campo and indeed all our backs. Henry! What can you say, questionable decisions, a few wayward kicks, but also moments of sheer brilliance that is King Henry returning to his best. \nRead next: England legend Neil Back on Exeter Chiefs' Jack Nowell and the British & Irish Lions squad \nLet me not forget Steeno, whose return from injury is sure to prove of great significance as we face the pressure cooker of big games to come. Up front, my favourite Geordie, Geoff Parling, again showed the qualities that earned him that coveted Lions shirt. I'm thinking that just maybe our young powerhouse forward Dave Ewars will one day pull on that same red shirt, there being little doubt that the Red Rose and White shirt is close. \nMoving on to Steeno's testimonial, the Championship-winning super team will potentially face some serious names in the Classic Lions game to be played at Sandy Park on August 12. \nIf rumours are to be believed, I've heard former Lions Iain Balshaw, Danny Grewcock and Dafydd James mentioned in dispatches as the big names put their hands up to support Steeno's day, joining Lee Mears and Mike Tindall. Talking 'big', they do not come much bigger than the legendary corporal Chris Budgen, who is planning to line up in Steeno's colours on what promises to be a famous day in Chiefs cultural history. Word is an L jersey is being crafted at time of writing. Watch this space! \nIt's European rugby next week and a chance for the lads to address cuts, bruises and niggles before the Saints are in town the following Saturday. Bring it on. Until next time, stay safe and enjoy your rugby. ", "external_links": [], "published": "2017-04-20T17:43:00.000+03:00", "crawled": "2017-04-20T13:45:31.000+03:00", "highlightTitle": ""}