{"organizations": [], "uuid": "e180d3541dc96cbf3aac17f40095988e1985309b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12889733.ece/ALTERNATES/s1200/CFR_NJL_120417wood_01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/family-firm-nordstrom-timber-creates-12889573", "country": "GB", "domain_rank": 21960, "title": "Family firm Nordstrom Timber creates jobs after move to city centre", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Family firm Nordstrom Timber creates jobs after move to city centre", "spam_score": 0.0, "site_type": "news", "published": "2017-04-13T20:09:00.000+03:00", "replies_count": 0, "uuid": "e180d3541dc96cbf3aac17f40095988e1985309b"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/family-firm-nordstrom-timber-creates-12889573", "ord_in_thread": 0, "title": "Family firm Nordstrom Timber creates jobs after move to city centre", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Family firm Nordstrom Timber creates jobs after move to city centre Nordstrom Timber has been a family business in Sunderland for almost 65 years, creating everything from porches to staircases Share Alan Nordstrom, David Nordstrom, Coun Harry Trueman of Sunderland City Council and Lynne Nellis (Photo: Ian McClelland) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA family firm which has been running for almost 65 years has doubled in size after moving into a new city centre base. \nSunderland-based Nordstrom Timber recently moved into a 60,000 sqft site on Woodbine Street, Hendon, which is almost double the size of its former home nearby. \nThe business has also invested significantly in developing its new headquarters, creating a larger timber yard, joiner shop and showroom and creating new jobs in the process. \nIt has opened a four-bedroom showhome inside the showroom, showcasing many of its products including kitchens and bedrooms, as well as the company’s trademark handmade timber staircases and windows. \nThe joinery shop has been substantially expanded to make products from stairs and windows to porches and frames. \nSeveral new pieces of equipment have also been installed at the site, with more to follow this year, to support Nordstrom’s bespoke timber machining service. \nNordstrom was originally founded on Sunderland’s Nile Street by Herman Nordstrom in 1953 and today remains the largest independent timber merchant in the city. Read More North East exports fall for second quarter despite Brexit-hit pound \nAlan Nordstrom, Herman’s son, continues to work in the business alongside his own son David Nordstrom and daughter, Lynne Nellis. \nMr Nordstrom said: “The move was essential to the business and its customers’ needs, with the new showhome playing a vital role its ongoing success. \n“Everything displayed in the house is either made here on site or can be purchased from our timber yard and sales counter. \n“Customers can now see all our products in one place, be inspired and see how versatile timber can be. Trade customers also appreciate the fact that all our timber products are under cover and they can drive in and load up.” \nCoun Harry Trueman, deputy leader of Sunderland City Council, who visited the company recently, said: “Nordstrom is a fantastic business, manufacturing high quality products and committed to its future in Sunderland after 65 years of doing business in the city. It’s a great vote of confidence from a thriving business.” Like us on Facebook", "external_links": [], "published": "2017-04-13T20:09:00.000+03:00", "crawled": "2017-04-13T16:12:41.473+03:00", "highlightTitle": ""}