{"organizations": [], "uuid": "64d18fa588ef3dabea8a59b92ab412190156aa7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30295369/15974220.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/county-labour-leader-stands-down-replacement-to-take-role-with-immediate-effect/story-30295369-detail/story.html", "country": "GB", "title": "Devon Labour leader quits - replacement takes up role with...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Devon Labour leader quits - replacement takes up role with...", "spam_score": 0.0, "site_type": "news", "published": "2017-04-26T19:44:00.000+03:00", "replies_count": 0, "uuid": "64d18fa588ef3dabea8a59b92ab412190156aa7c"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/county-labour-leader-stands-down-replacement-to-take-role-with-immediate-effect/story-30295369-detail/story.html", "ord_in_thread": 0, "title": "Devon Labour leader quits - replacement takes up role with...", "locations": [], "entities": {"persons": [{"name": "devon labour", "sentiment": "none"}, {"name": "thomas", "sentiment": "none"}, {"name": "rob", "sentiment": "none"}, {"name": "cllr richard westlake", "sentiment": "none"}, {"name": "cllr hannaford", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "st thomas", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "rob hannaford", "sentiment": "none"}], "locations": [{"name": "brexit britain", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "exwick & st thomas", "sentiment": "none"}, {"name": "west exe children's centre", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "exwick", "sentiment": "none"}], "organizations": [{"name": "devon labour", "sentiment": "none"}, {"name": "cowick first school", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "redhills school", "sentiment": "none"}, {"name": "bowhill school", "sentiment": "none"}, {"name": "county council", "sentiment": "none"}, {"name": "montgomery school", "sentiment": "none"}, {"name": "county labour party group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon Labour leader quits - replacement takes up role with immediate effect By Alex_Richards | Posted: April 26, 2017 0 COMMENTS SHARES County Labour Leader Cllr Richard Westlake has stood down after four years ahead of the forthcoming County Council elections. Devon Labour leader quits - replacement takes up role with immediate effect X \nCopy link to paste in your message / County Labour Leader Cllr Richard Westlake has stood down after four years ahead of the forthcoming County Council... Comments (0) \nCounty Labour Leader Cllr Richard Westlake has stood down ahead of the forthcoming County Council elections. \nExeter councillor Rob Hannaford has been officially elected by the County Labour Party Group as the new Labour Party Leader on Devon County Council. \nHe will take to the role with immediate effect to include this weeks full council meeting of the authority. \nCllr Hannaford last year was resoundingly re-selected by Labour Party members as the Labour candidate in Exwick & St Thomas for the County Council Elections. \nReturn to Devon Live home page or read next: A letter from Exeter MP Ben Bradshaw: A vote for me will not affect who governs nationally \nRob has been a City Councillor for St Thomas since 2003 and the County Councillor for Exwick and St Thomas since 2005. \nHe has previous experience as a Town and District Councillor going back to 1995, when he first became a Councillor. \nIn these roles he has served on many committees taken on the roles of chair, been Deputy Lord Mayor, and has served in a range of executive and leadership roles. \nHe has been a Governor at the Cowick First School, Montgomery School, Redhills School and Bowhill School, and a founder governor of the West Exe Children's Centre. \nCllr Hannaford adds: \"Firstly I want to say a big thank you and also pay tribute to Cllr Richard Westlake for his long and distinguished service on the county council. Indeed he was first elected way back in 1985. \n\"Including the last four years as leader, and all my other colleagues that are stepping down and retiring , after many years of hard work and dedication.\" \n\"Since 2005 it's been a great privilege to represent Exwick and St Thomas on the County Council . Over the years I have done my best to dedicate my time, energy and efforts to represent and care for our community. \n\"We all know that our local area is a very special part of Exeter , and that despite often being a busy urban environment , we still have a real sense of community pride and strong neighbourhoods. \n\"This is all strengthened by our various schools, neighbourhood watch groups, churches, charities, sports teams, and local associations - together we are a community. \n\"However, with that said there is sill much more that needs to be done and working upon in partnership with others.\" \n\"In an historic first, the Labour Party has this time put up a full slate of candidates across the whole of Devon in every division. \n\"We feel that its very important local people, wherever they live, have the opportunity to be able to vote for our progressive and positive local manifesto that has good quality public services, strong communities and thriving economic activity as its key drivers.\" \nCllr Hannaford added: \"In Devon 'austerity' has meant a reduction of £208m over the last six years, a cut of 64% in real terms with a further cut of £23.3m for next year. \n\"Specifically the crisis in funding for adult social care grows daily more disturbing. Overall services are disappearing, handed to often struggling charities, or privatised, with massive school cuts effecting pupils in every local community. \n\"It is therefore essential that the new County Council secures fairer funding for Devon from central government to ensure that we looking after people properly and so that we can crucially invest more money strategically in infrastructure and economic growth & jobs to the keep the county moving forward for all. \n\"In a post Brexit Britain its also absolutely vital that we invest more in our education and skills base, to make sure we can effectively compete on the global economic stage.\"", "external_links": [], "published": "2017-04-26T19:44:00.000+03:00", "crawled": "2017-04-26T16:06:37.000+03:00", "highlightTitle": ""}