{"organizations": [], "uuid": "fbf8b5749d7d2e9ccf849a733d00fc0a36a6163d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12829540.ece/ALTERNATES/s1200/Sean-Seddon.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/meet-man-tasked-overseeing-regeneration-12829488", "country": "GB", "domain_rank": 21960, "title": "Meet the man tasked with overseeing the regeneration of Sunderland", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Meet the man tasked with overseeing the regeneration of Sunderland", "spam_score": 0.0, "site_type": "news", "published": "2017-04-01T12:00:00.000+03:00", "replies_count": 0, "uuid": "fbf8b5749d7d2e9ccf849a733d00fc0a36a6163d"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/meet-man-tasked-overseeing-regeneration-12829488", "ord_in_thread": 0, "title": "Meet the man tasked with overseeing the regeneration of Sunderland", "locations": [], "entities": {"persons": [{"name": "sunderland peter mcintrye", "sentiment": "negative"}, {"name": "mcintrye", "sentiment": "none"}, {"name": "mcintyre", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "cllr paul watson", "sentiment": "none"}, {"name": "peter mcintyre", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "peter mcintrye", "sentiment": "none"}, {"name": "irene lucas", "sentiment": "none"}], "locations": [{"name": "new wear crossing", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "sunderland news meet", "sentiment": "negative"}, {"name": "arch", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "invalid email", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Meet the man tasked with overseeing the regeneration of Sunderland Peter McIntrye will oversee ambitious long-term projects such as the Vaux site, New Wear Crossing and the IAMP business zone Share Peter McIntyre, executive director of economy and place, Sunderland City Council (Photo: Hand in from Sunderland City Council) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA new executive has been appointed tasked with overseeing ambitious regeneration plans in Sunderland. \nPeter McIntrye will take up the post of executive director of economy and place at Sunderland City Council , a role which is expected to promote economic growth. \nMr McIntrye previously served as the chief executive of Arch, the development arm of Northumberland County Council , set up in 2012. \nIn that role, he oversaw the building of hundreds of homes and commercial spaces and a portfolio of projects worth £300m. \nBut the company was criticised in February 2017 for leaving rural parts of the vast county “neglected”. Read More Sunderland - a city still divided over Brexit as the UK enters the unknown \nHe’ll be paid between £130,000 and £140,000 a year. \nSunderland City Council has already committed to a wide-ranging revenue programme, including the redevelopment of the Vaux site, the New Wear Crossing and the International Advanced Manufacturing Park. \nMr McIntrye said: “I’m really excited about coming to Sunderland , although it will be a huge wrench to leave Northumberland and all the fantastic people I’ve worked with in my time here. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Drone footage of New Wear Crossing pylon being raised Share this video Watch Next \n“Having seen the developments currently under way in Sunderland and, having read about plans for the International Advanced Manufacturing Park and a whole raft of other development sites, this is a great time to join Sunderland. \n“I’m really looking forward to helping them achieve their aims.” Read More \nMr McIntyre cut his teeth in Newcastle, first in a number of regeneration and planning roles on the council and then as director of planning and programme management at 1NG, the city development company for Newcastle and Gateshead. \nAs well as looking at long-term growth projects, his role will cover some front-line service provision. Sunderland City Council leader, Cllr Paul Watson (Photo: The Chronicle) \nPaul Watson, the leader of Sunderland City Council, said: “I’m delighted Peter is joining us. He has an outstanding track record in regeneration and a reputation for going into areas and transforming them. \n“I’m particularly pleased that he is joining us at a time when there are so much going on in Sunderland. We’re already well advanced with the new Wear Crossing but there is so much more in store. \n“Peter will be leading the work on important projects like the International Advanced Manufacturing Park, the Vaux site, seafront developments, continued investment in the city centre and the other £1.2bn worth of investment to come to Sunderland over the next four years.” \nIt’s not the first high-profile appointment to the council in recent days. \nIrene Lucas was formally appointed as the chief executive of the council after spending nearly a year serving in the role on an interim basis. \nShe has 25 years experience working in the city, as well as having served as chief executive of South Tyneside Council and in various senior Whitehall civil service posts. Read More", "external_links": [], "published": "2017-04-01T12:00:00.000+03:00", "crawled": "2017-04-01T09:49:43.174+03:00", "highlightTitle": ""}