{"organizations": [], "uuid": "e96b845e05a4be9da6c124dbd8b818e62d7bba12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12861911.ece/ALTERNATES/s1200/TMP_NEC_300516CountyShow_10JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/rare-breed-sheep-category-added-12861902", "country": "GB", "domain_rank": 21960, "title": "Rare breed sheep category added for this year's Northumberland County Show", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Rare breed sheep category added for this year's Northumberland County Show", "spam_score": 0.0, "site_type": "news", "published": "2017-04-07T20:58:00.000+03:00", "replies_count": 0, "uuid": "e96b845e05a4be9da6c124dbd8b818e62d7bba12"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/rare-breed-sheep-category-added-12861902", "ord_in_thread": 0, "title": "Rare breed sheep category added for this year's Northumberland County Show", "locations": [], "entities": {"persons": [{"name": "slaley", "sentiment": "none"}, {"name": "kerry hills", "sentiment": "none"}, {"name": "rebecca wilson", "sentiment": "none"}, {"name": "mrs wilson", "sentiment": "none"}, {"name": "adam henson", "sentiment": "none"}, {"name": "rachel raine", "sentiment": "none"}, {"name": "robert raine", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "boreray", "sentiment": "none"}], "locations": [{"name": "northumberland county", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "west woodfoot", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "whiteface woodlands", "sentiment": "none"}, {"name": "bywell", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "teeswaters", "sentiment": "none"}, {"name": "northumberland county show", "sentiment": "none"}], "organizations": [{"name": "cornwall longwool", "sentiment": "none"}, {"name": "rare breeds survival trust", "sentiment": "none"}, {"name": "bywell", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "arla", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "herdwicks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rare breed sheep category added for this year's Northumberland County Show New category is being added for the show, which takes place at Bywell on May 29 Share Huge crowds attended the Northumberland County Show at Bywell in 2016   business updates   \nThe North East’s premier agricultural show is adding a new category to recognise some of the rare breed sheep being farmed in the region. \nThe British Rare Breed Sheep section at the Northumberland County Show will be sponsored by Slaley’s Tynedale Rare Breeds, which specialises in Teeswaters, Herdwicks, Cheviots, Kerry Hills and Llanwenog sheep. \nShow vice chairman Robert Raine said: “We’re excited by this development as we’ve had a growing number of requests for this class. \n“With the location of the show being close to Herdwick breeding heartlands of Cumbria , the Wensleydales from Yorkshire, plus the Northumbrian Cheviots, we expect some of the entrants will represent local sheep. \n“Hopefully however we’ll see some really unusual sheep. It would be marvelous for the public to see all these rare breeds.” \nThe winner of the category will receive the Joe Henson Trophy, named in honour of the founder member of the Rare Breeds Survival Trust, whose daughter Rebecca Wilson runs Tynedale Rare Breeds. \nA former TV producer whose brother Adam Henson is the well-known Countryfile presenter, Mrs Wilson said: “When our daughter left home to go to university we decided to move house and bought West Woodfoot. We were supposed to be down-sizing, but we have more land and less house! \n“I got back to my roots and decided to get some sheep. My hobby has progressed into a business and I now breed rare breed pedigree stock for sale and plan to start selling my meat, in packs. Read More Dairy giant Arla warns of dangers to farmers from botched Brexit negotiations \n“I have been concentrating on getting interest from local restaurants and pubs, and now have quite a list of interested buyers. I just have to breed them now! \n“I am absolutely delighted that the show committee have agreed to run a British Rare Breed Sheep section, I’m sure Dad would have approved. \n“I have been spreading the word to breeders and I hope that we will see Manx Loaghtans, originally from the Isle of Man, they are a primitive breed with multiple horns; Boreray, Devon and Cornwall Longwool; Whiteface Woodlands and Castle Milk Moorits.” \nThe County Show takes place at Bywell on May 29. Schedules for competitors have been released with a closing date for entries on April 29. \nRachel Raine, who recently took the reins as the sheep section’s chief steward, said “I would encourage anybody who wants to show off their sheep to come to the Northumberland County Show. Read More Hexham young farmers' competition aims to find the stockmen of tomorrow \n“Not only is it a brilliant advertisement for your flock but it is an incredible social occasion. After the stresses of lambing time it is a day to show, and be proud of, what you have worked so hard to achieve.” Like us on Facebook", "external_links": [], "published": "2017-04-07T20:58:00.000+03:00", "crawled": "2017-04-07T16:31:47.761+03:00", "highlightTitle": ""}