{"organizations": [], "uuid": "1f16f1a565abce678a00af4144f7b1bbfafaf812", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30247908/15939750.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/new-range-of-artisan-sausages-launched-in-tesco/story-30247908-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published Love sausages but looking to lose weight? Leicestershire firm...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Lauren_Mills published Love sausages but looking to lose weight? Leicestershire firm...", "spam_score": 0.0, "site_type": "news", "published": "2017-04-04T18:08:00.000+03:00", "replies_count": 0, "uuid": "1f16f1a565abce678a00af4144f7b1bbfafaf812"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/new-range-of-artisan-sausages-launched-in-tesco/story-30247908-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published Love sausages but looking to lose weight? Leicestershire firm...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Love sausages but looking to lose weight? Leicestershire firm launches new product at Tesco By Lauren_Mills | Posted: April 04, 2017 0 COMMENTS SHARES Love sausages but looking to lose weight? Leicestershire firm launches new produ... X \nCopy link to paste in your message / Comments (0) \nA new range of healthier sausages are set to get your taste buds tingling. \nThe tasty bangers are being made in Leicestershire by Walkers Sausage Co and were launched in Tesco stores this week. \nWhether sizzling away in a spitting hot pan or served freshly charred from a summer barbecue, sausages are a comforting staple of the British diet. \nBut while they might be well-loved, sausages are often high in fat, which can contribute to raised cholesterol and heart conditions. \nWalkers' new MOR brand has been carefully crafted to be just as succulent, juicy and delicious as traditional sausages, while introducing new flavours with less sugar and fat content. \nThe Walkers sausage specialists have worked hard to bring something just a little bit different to the table. Each of the four unique MOR recipes blend high-quality British meat with nutritious vegetables, fragrant herbs, and delicate spices, creating lower-fat sausages without compromising on taste. \nRead more: Samworth Brothers boss in shock departure \nWith flavours such as chicken, with sundried tomato and basil, Moroccan spiced pork and pork with super green vegetables and lentils, MOR can be served with everything from mashed potato to herby pesto or simply salad. \nMOR is the latest creation from the county's biggest private company, Samworth Brothers, which owns the Walkers sausage brand, \nAlan Richardson, head of category and marketing at Walkers Sausage Co, said: \"At Walkers Sausage Co we are really proud of our history and heritage but we are always looking at new trends in the market. \nRead more: Melton Mowbray pork pies could be under threat - because of Brexit \n\"We know that people are eating differently and are looking to experiment with new tastes. This is the idea behind MOR, to provide consumers with a new premium sausage product that is a bit different. \n\"With the addition of vegetables, herbs and spices to the recipes, the MOR sausages are very tasty and versatile, suitable for use in traditional cooking but also for use in all sorts of dishes from tagines to pasta.\"", "external_links": [], "published": "2017-04-04T18:08:00.000+03:00", "crawled": "2017-04-04T17:54:16.893+03:00", "highlightTitle": ""}