{"organizations": [], "uuid": "ace5054ff176fa7fb039b618cb4584bd51d54722", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12921265.ece/ALTERNATES/s1200/CORBYN-VS-ASHLEY.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-mike-ashley-should-12921213", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn on why Mike Ashley should be worried about him becoming Prime Minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Jeremy Corbyn on why Mike Ashley should be worried about him becoming Prime Minister", "spam_score": 0.0, "site_type": "news", "published": "2017-04-21T01:00:00.000+03:00", "replies_count": 0, "uuid": "ace5054ff176fa7fb039b618cb4584bd51d54722"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-mike-ashley-should-12921213", "ord_in_thread": 0, "title": "Jeremy Corbyn on why Mike Ashley should be worried about him becoming Prime Minister", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Jeremy Corbyn on why Mike Ashley should be worried about him becoming Prime Minister The Labour leader vowed to take on the rich and powerful - including the Newcastle United owner - and to stand up for ordinary people Share Jeremy Corbyn and Mike Ashley (Photo: Getty Images) Share Get daily   Thank you for subscribing!   \nLabour leader Jeremy Corbyn came out fighting in his first major speech of the 2017 General Election - and said Sports Direct boss Mike Ashley should be “worried” about a Labour Government. \nHe said the election was a battle of the rich establishment represented by the Tories versus ordinary people represented by Labour. \nAnd he named Newcastle United owner Ashley and former BHS boss Philip Green as the type of people he had in his sights. \nIt follows criticism of Sports Direct’s employment practices and the use of zero-hour contracts. Sir Philip has been criticised for the way he sold off BHS, which later collapsed. \nIn a passionate speech presenting himself as the anti-establishment candidate to be Prime Minister, Mr Corbyn pledged take on fat cats who don’t pay their fair share in taxes and exploit workers. \nHe said: “Britain is the sixth richest economy in the world. The people of Britain must share in that wealth. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Best bits of Mike Ashley grilling from MPs Share this video Watch Next \n“If I were Southern Rail or Philip Green, I’d be worried about a Labour Government. \n“If I were Mike Ashley or the CEO of a tax-avoiding multinational corporation, I’d want to see a Tory victory. \n“Why? Because those are the people who are monopolising the wealth that should be shared by each and every one of us in this country. \n“Everyone, and I mean everyone, has a contribution to make and a life to lead. Poverty and homelessness are a disaster for the individual and a loss to all of us. Read More General Election 2017: Theresa May claims it's needed because of 'division' over Brexit \n“It is wealth that should belong to the majority and not a tiny minority. \n“Labour is the party that will put the interests of the majority first, while the Tories only really care about those who already have so much.” Labour party leader Jeremy Corbyn (Photo: Getty Images Europe) \nHe added: “We will no longer allow those at the top to leach off of those who bust their guts on zero hours contracts or those forced to make sacrifices to pay their mortgage or their rent.” \nMr Corbyn dismissed reports in the media that Labour is doomed to lose when the nation goes to the polls on June 8. \nHe said people mocked him because he wouldn’t play by the rules, but he was going to prove them wrong. \nGeneral Election 2017: What time will we know who has won? \nMr Corbyn insisted: “The dividing lines in this election could not be clearer from the outset. It is the Conservatives, the party of privilege and the richest, versus the Labour Party, the party that is standing up for working people to improve the lives of all. \n“It is the establishment versus the people and it is our historic duty to make sure that the people prevail.” \nThe media were wrong to think Labour can’t win, he said. \n“Much of the media and establishment are saying that this election is a foregone conclusion. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-04-21T01:00:00.000+03:00", "crawled": "2017-04-20T20:09:13.000+03:00", "highlightTitle": ""}