{"organizations": [], "uuid": "c1cd7b0e07b01bb463dae3612b053cbe43a3a5a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30246399/15938780.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/what-do-you-think-of/story-30246399-detail/story.html", "country": "US", "domain_rank": 48128, "title": "'Cyber crime and fraud can have a devastating impact on companies and individuals' | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "'Cyber crime and fraud can have a devastating impact on companies and individuals' | Leicester Mercury", "spam_score": 0.987, "site_type": "news", "published": "2017-04-04T17:05:00.000+03:00", "replies_count": 0, "uuid": "c1cd7b0e07b01bb463dae3612b053cbe43a3a5a4"}, "author": "", "url": "http://www.leicestermercury.co.uk/what-do-you-think-of/story-30246399-detail/story.html", "ord_in_thread": 0, "title": "'Cyber crime and fraud can have a devastating impact on companies and individuals' | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "vw golf", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Cyber crime and fraud can have a devastating impact on companies and individuals' By Lauren_Mills | Posted: April 04, 2017 0 COMMENTS SHARES 'Cyber crime and fraud can have a devastating impact on companies and individual... X \nCopy link to paste in your message / Comments (0) \nWhat car do you drive and what do you think of it? \nI drive a VW Golf for the simple reason it is well-made, efficient, reliable and it is worth the value. \nWill the positives of Brexit outweigh the negatives? \nThere are equal amounts both. One of the main positives is the UK will no longer need to contribute to the costs of the EU membership – money that could be used for other priorities. Brexit will have a negative impact on employment in the UK though, as there are over three million jobs here linked to trade. However, this could also be a positive with lower migration and less regulation in a workplace which would create more jobs and increase wages. The outcome of the whole process is uncertain. It is down to how the Government implements the changes. \nHow concerned are you about cyber crime? \nI have not personally experienced cyber crime, nor have any clients experienced this. The increase in cyber crime and fraud can have a devastating impact on companies and individuals. It is very concerning that the majority of these victims are elderly and vulnerable people. \nHow bad is weekday parking in Leicester? \nI think 9-5 parking in Leicester has improved, however for those who work in the city centre it can still be an issue. Parking in the city centre is not cheap, another multi storey car park such as the Highcross Shopping Centre car park could assist in improving this issue. \nWould Scottish independence be good for Scotland and for England, Wales and Northern Ireland? \nScottish independence would have a negative and positive impact on England. It can cause an uncertain future for the financial markets in the UK as the pound has already dropped compared to the dollar and euro. However, it raises further concerns for Scotland as to what currency will be used – do they keep the pound, join the euro or have their own currency? \nHow did you react to the front page Daily Mail story about Theresa May and Nicola Sturgeon's legs? \nThe Daily Mail could have chosen a different title for the front page as it has been significantly criticised as sexist and offensive. Some individuals have taken an element of humour from this all by taking pictures of their own legs, which has led to an outburst of images on social media. ", "external_links": [], "published": "2017-04-04T17:05:00.000+03:00", "crawled": "2017-04-04T11:30:46.484+03:00", "highlightTitle": ""}