{"organizations": [], "uuid": "7ec76b203dff0f218a479cf1ab72cfbf8b0640f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12843690.ece/ALTERNATES/s1200/2006-photo-transferred-from-Citrix.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/dairy-giant-arla-warns-dangers-12843542", "country": "GB", "domain_rank": 21960, "title": "Dairy giant Arla warns of dangers to farmers from botched Brexit negotiations", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Dairy giant Arla warns of dangers to farmers from botched Brexit negotiations", "spam_score": 0.0, "site_type": "news", "published": "2017-04-04T23:00:00.000+03:00", "replies_count": 0, "uuid": "7ec76b203dff0f218a479cf1ab72cfbf8b0640f9"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/dairy-giant-arla-warns-dangers-12843542", "ord_in_thread": 0, "title": "Dairy giant Arla warns of dangers to farmers from botched Brexit negotiations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dairy giant Arla warns of dangers to farmers from botched Brexit negotiations Talks with the EU must protect the ability of British farmers to export their goods, Arla says Share Holstein dairy cows grazing (Photo: Daily Post Wales) Share Get business   Thank you for subscribing!   \nThe future of dairy farming could be jeopardised if the Government mis-handles the upcoming Brexit negotiations , the country’s leading farm co-operative has said. \nArla Foods, which is owned by 12,000 farmers in Britain and Europe, has commissioned research from the Centre for Economics and Business Research (Cebr), which warns that its business in the UK would come under severe pressure if Brexit negotiations lead to significant restrictions on free trade and quotas. \nAccording to the report, Arla’s total economic footprint in the UK is valued at more than £6bn in Gross Value Added (GVA), with every pound generated by Arla’s dairy business in the UK stimulating nearly £15 in the company’s supply chain and the wider rural economy. \nArla exports to 21 countries in the EU and 48 outside of it and says it relies on free trade. \nManaging director Tomas Pietrangeli said: “Our business and our farmer owners make a major contribution to the UK economy, playing a key role in the UK food and farming sector, which is estimated to be worth over £100bn. \n“While it’s true that Brexit will bring opportunities that we are ready to embrace, ending tariff-free trade should be seen as a major risk. \n“We need assurances that the transitional arrangements we are likely to require before a free trade agreement between the UK and the EU is agreed are tariff- and barrier-free. To do otherwise will be detrimental not only to us but to many other organisations. \n“That’s why we’re calling on Government to protect the health of the British dairy industry and its broader benefits to the wider UK economy and, in doing so, ensuring agriculture and food and drink production are front and centre of its negotiation efforts.” Read More Utilitywise founder Geoff Thompson steps into non-executive chairman role \nMr Pietrangeli said the loss of EU subsidies is also a “significant risk” to UK dairy farming and added that access to European labour can also be important to some farmers. \nOliver Hogan, director at Cebr and principal author of the report said: “The true extent of Arla’s economic ‘footprint’ in the UK cannot be underestimated. \n“It’s a business that is deeply embedded in the British economy, not only through its farmer owners and core dairy business, but also through a large and wide-ranging domestic supply chain and through its downstream links with the distributive trades (retail and wholesale).” \nArla, whose brands include Lurpak, Cravendale and Arla milk, is responsible for almost a third of the UK dairy industry. Like us on Facebook", "external_links": [], "published": "2017-04-04T23:00:00.000+03:00", "crawled": "2017-04-04T18:59:59.132+03:00", "highlightTitle": ""}