{"organizations": [], "uuid": "8f09a0b4dc74f994d62b780373cd1a0612379680", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12921618.ece/ALTERNATES/s1200/New-Tory-leader-Theresa-May-leaves-Downing-Street.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/welcome-election-no-one-wants-12921644", "country": "GB", "domain_rank": 21960, "title": "Welcome to the election no-one wants: The battle to avoid cynicism as the country votes", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Welcome to the election no-one wants: The battle to avoid cynicism as the country votes", "spam_score": 0.0, "site_type": "news", "published": "2017-04-21T01:00:00.000+03:00", "replies_count": 0, "uuid": "8f09a0b4dc74f994d62b780373cd1a0612379680"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/welcome-election-no-one-wants-12921644", "ord_in_thread": 0, "title": "Welcome to the election no-one wants: The battle to avoid cynicism as the country votes", "locations": [], "entities": {"persons": [{"name": "david cameron", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Opinion Theresa May leaves Downing Street after Prime Minister David Cameron hosted his final cabinet meeting at 10 Downing Street, London (Photo: Daily Mirror) Share Get business   Thank you for subscribing!   \nAs I have boulevarded the streets of Newcastle over the last few days, I have noticed a strange giddiness gripping the population at large. \nWith broad grins on their faces, strangers are stopping each other in the street and saying things like: “Have you heard?” and “Isn’t it wonderful?” \nWhat is it that has brought this uplift in the general wellbeing of the British public? Why, the wonderful decision of our wonderful Prime Minister to give us the wonderful surprise gift of a General Election. \n“Yay, more politics!” the people have cried. “More chances to hear what Nigel Farage is ‘thinking’! Live TV debates featuring the leader of Plaid Cymru! Spotty herberts getting angry on Twitter!” \nOf course, none of the above. The vast majority have muttered “oh heck” and I have been plunged to hitherto unplumbed levels of sarcasm by the thought that the arguments of the 2015 election, the Scottish independence vote and the EU referendum are going to be played out again and again, with only the sight of Michael bleedin’ Gove to offer light relief. \nDemocracy, of course, is a good thing, certainly an improvement on any of the alternatives. But I can’t help wondering whether we’re exercising it a little too much these days. \nIt’s hard, after all, not to be cynical about an election called by a woman who repeatedly said she wouldn’t call an election for a mandate she already has to do something she campaigned against. \nCynicism is the thing we must ward against, or so I keep telling myself. \nAt the last election, the Conservatives took power on 37% of the vote, or around 25% of the people eligible to vote. In hundreds of constituencies, the number of people who didn’t bother to vote outnumbered the party taking the seat. \nThis is something we must change and I am begging like I have never begged before for young people to register to vote. \nWhat makes it hard to say that with any conviction is that I can’t remember an election where even the few things I want to see happen will be so little represented. \nI suspect I’m not alone. Many people in this region will vote Labour but know that the best thing to happen to the party might be electoral disaster that finally brings an end to the Jeremy Corbyn experiment/nightmare. \nThe problem with that is that any swing to the Conservatives will be taken as approval for a deranged hard Brexit that many people don’t want. \nIn summary: oh heck. \nGraeme Whitfield is business editor of The Journal Read More", "external_links": [], "published": "2017-04-21T01:00:00.000+03:00", "crawled": "2017-04-20T20:09:14.000+03:00", "highlightTitle": ""}