{"organizations": [], "uuid": "1b5fdeca3c0e76986cb1f4327e98d09d3e54e399", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12922858.ece/ALTERNATES/s1200/Hexham-Book-Festival.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ex-mp-chris-mullin-labour-12921482", "country": "GB", "domain_rank": 21960, "title": "Ex-MP Chris Mullin on why Labour can still win in places like Sunderland", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Ex-MP Chris Mullin on why Labour can still win in places like Sunderland", "spam_score": 0.0, "site_type": "news", "published": "2017-04-23T15:00:00.000+03:00", "replies_count": 0, "uuid": "1b5fdeca3c0e76986cb1f4327e98d09d3e54e399"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ex-mp-chris-mullin-labour-12921482", "ord_in_thread": 0, "title": "Ex-MP Chris Mullin on why Labour can still win in places like Sunderland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \n“I quite enjoyed being the only MP in the country for about 45 minutes.” \nThat was a pleasure Chris Mullin, MP for Sunderland South between 1987 and 2010, got to enjoy on four occasions. \nEvery year, the council is overcome with a single-minded determination to make sure the city is the first to declare its’ election results. \nAn so, for a few minutes, Sunderland is the only place in the country with parliamentary representation. \nThey lost the race on one of Mr Mullin’s election nights but the result was as it was always going to be. \nWhy? Because Labour win in Sunderland. Always. \nIt doesn’t matter how quickly the ballot boxes make it to the count, they’re always stuffed with Labour votes. \nBut this time round, political pundits and soothsayers are going to take a lot of interest in Sunderland for another reason. \nIt perfectly embodies the awkward dynamic Labour need to wrestle with: a red town which voted Leave. \nIn truth, the majorities of the sitting MPs are so healthy they should be unassailable - but let’s not fall into that old trap of “ruling things out”. \nLike all good former MPs, he keeps his distance and allows his successors to get on with their job. \nBut he does think they, along with their colleagues, have already made a big error. \nThe 69-year-old, who now lives in Northumberland, said: “I’m surprised Labour voted so enthusiastically to hold a general election. \n“In my view, it’s wholly unjustified. Theresa May has called it to avoid trouble with her hard-Brexiteer backbenchers down the line. \n“If I had been in parliament, I would have been inclined to vote against it. \n“Going along with it is a high risk strategy - they would have been accused of being frit for not supporting it, but given what else they’ve been called it would have been a small issue. \n“We’ve fallen into a trap.” Read More MP for Blaydon and shadow cabinet member Dave Anderson is standing down, we can reveal \nThis an analysis which comes from a place which is gripping countless current and former MPs: doubt. \nHe admits he is “not optimistic” about the party’s chances nationally, although he insists “its survival is not in question” as some have suggested. \nMr Mullin has been openly sceptical about Jeremy Corbyn’s leadership in the past but says those debates must be parked for now. \nHe said: “I didn’t vote for him but he is leader and we must unite. There’s no point in playing internal politics now.” \nAsked if he believes Mr Corbyn is equipped to be Prime Minister, he replied “the country will decide if he is equipped”. \nHe has also called for a pact between centre-left parties to prevent the possibility of a Tory rout. \nBut the doubt runs out where Wearside starts and he is certain Labour’s grip on Sunderland will not be broken. \nHe said: “We’ve got good Labour candidates in Sunderland and the Tories are widely discredited there. \n“I’ve even heard Tories in Sunderland admitting a Conservative government wouldn’t be a good thing for the city over the years. \n“The challenge might come from UKIP but I think they are receding as a force - but that shouldn’t be taken for granted.” \nGeneral Election 2017: What time will we know who has won? \nMr Mullin, a Remain supporter, saw the city he represented for more than two decades vote against the party it has always chosen to represent it. \nIf he had been the sitting MP, he says, he “wouldn’t have done any better” in terms of swinging the vote for the pro-EU camp. \nLabour candidates should not be lulled into accepting Theresa May’s insistence that this election is all about Brexit, he said. \n“The EU question is, I’m sorry to say, resolved for the foreseeable future.This election is going to be about wider issues than that. \n“I think it will be about the widening gap between the rich and the poor - that’s the real challenge. \n“Sunderland voters won’t necessarily ‘put the Brexit issue in a box’ but the argument has peaked.” Chris Mullin (Photo: liv.chapman@hotmail.com) \nThere is one voguish theory that the New Labour governments are responsible for neglecting places like North East. \nThe festering resentment that caused, the theory goes, ultimately manifested itself as a populist backlash in the referendum. \nAlthough Mr Mullin was always viewed as a slightly awkward fellow traveller in the New Labour caravan - including voting against the Iraq war - he has always spoke highly of Tony Blair’s abilities and served in various roles in his governments. \nHe gives short shrift to the left-behind-by-Labour” theory, saying “I can hand on heart say that life for the poor got better under that government”. Read More Cancer, Brexit and austerity: the leader of Sunderland Council reveals all \nHis five election wins in Sunderland were“nothing personal”, he says - locals simply “figured out Labour was better for them”. \nTo that end, he warns MPs against the temptation of trying to distance themselves from the Corbyn/Labour brand in an effort to win votes from those who might be considering straying from the party. \nHe said: “I’m sure that Sunderland’s three Labour candidates will fight it on a Labour manifesto. It would be the height of folly for any candidate to disassociate from the Labour party.” \nMr Mullin’s belief that the connection between the people of Sunderland and Labour will endure is resolute. \nForget Brexit, forget Corbyn, forget it all - Labour win in Sunderland. Always. \nHis instincts will be tested to their limits on June 8.", "external_links": [], "published": "2017-04-23T15:00:00.000+03:00", "crawled": "2017-04-23T10:22:54.000+03:00", "highlightTitle": ""}