{"organizations": [], "uuid": "fde9e4a17a2f537f509ed8c888fee09e340821e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30249009/15940169.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/pied-piper-of-hamelin-wants-to-come-to-twin-town-torbay/story-30249009-detail/story.html", "country": "US", "title": "Pied Piper of Hamelin wants to come to twin town Torbay | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Pied Piper of Hamelin wants to come to twin town Torbay | Devon Live", "spam_score": 0.173, "site_type": "news", "published": "2017-04-04T23:25:00.000+03:00", "replies_count": 0, "uuid": "fde9e4a17a2f537f509ed8c888fee09e340821e9"}, "author": "", "url": "http://www.devonlive.com/pied-piper-of-hamelin-wants-to-come-to-twin-town-torbay/story-30249009-detail/story.html", "ord_in_thread": 0, "title": "Pied Piper of Hamelin wants to come to twin town Torbay | Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pied Piper of Hamelin wants to come to twin town Torbay By Colleen_Smith | Posted: April 04, 2017 0 COMMENTS SHARES Pied Piper of Hamelin wants to come to twin town Torbay X \nCopy link to paste in your message / Comments (0) \nThe Pied Piper of Hamelin wants to come to Devon for the first time in 40 years of twinning between Torbay and the German home of the fairytale piper. \nBecause of Brexit the twinning committee in Hamelin says they want to make the connections between the twin towns stronger than ever. And the man who has played the part of the Pied Piper for the last 15 years says he would like to come to the Bay for the first time. \nEvery Easter since the Seventies parties have been travelling to Torbay. This year about 30 young people and their leaders arrive on Saturday April 8 to stay at Grenville House, in Brixham. \nYouth group leader Thomas Haeckel,on behalf of the Stadtjugedring Hameln, as well as the twin town committee, said: \"Perhaps especially because of Brexit we would like to hold on to this twinning partnership and strengthen and renew it because it has been fading a bit.\" \nFor the last 40 years there have been regular groups, including scout and church groups, who have been linking the two towns. \nThomas said: \"The Pied Piper, who is a good friend of mine, has never been to Torbay and he would like to come. \nRead more: UPDATE: BMW car rolled on way to driver training session \n\"He has been to Nottingham to Sherwood Forest to meet with Robin Hood. If there are any sport groups, clubs and youth groups who might be interested in contacting their opposite groups in the twintown, then Hamelin people would like to improve the contact more than it was in the last years.\" \nIf you are interested to meet Thomas in Torbay in the week befor Easter, please contact him at . \nThe legend of the Pied Piper is an important part of the tourism industry in Hamelin, drawing people from all over the world. Many Japanese and Asian visitors to Germany come especially because of the eerie story of the Rat-Catcher of Hamelin. The legend dates back to the Middle Ages, describing a piper, dressed in multicoloured clothing, who was a rat-catcher hired by the town to lure rats away with his magic pipe. When the citizens refuse to pay for this service, he retaliates by using his instrument's magical power on their children, leading them away as he had the rats. ", "external_links": [], "published": "2017-04-04T23:25:00.000+03:00", "crawled": "2017-04-04T19:03:29.848+03:00", "highlightTitle": ""}