{"organizations": [], "uuid": "0bf2965bc64b49270d66eb0b2cfad3e29853df87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14362162.ece/ALTERNATES/s1200/Mothercare-results.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14667122", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Mothercare to close 50 stores and bring back ousted chief executive", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-17T10:25:00.000+03:00", "replies_count": 0, "uuid": "0bf2965bc64b49270d66eb0b2cfad3e29853df87"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14667122", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Mothercare to close 50 stores and bring back ousted chief executive", "locations": [], "entities": {"persons": [{"name": "jake berry", "sentiment": "none"}], "locations": [], "organizations": [{"name": "mothercare", "sentiment": "negative"}, {"name": "coreena ford northern powerhouse", "sentiment": "negative"}, {"name": "northern powerhouse business summit", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Northern Powerhouse business summit announced as part of Great Exhibition of the North\nA three-day business summit which aims to forge the future of the Northern Powerhouse has been announced as part of the Great Exhibition of the North.\nThe Northern Powerhouse Business Summit will take place at Newcastle’s Boiler Shop from July 4-6, with ministers attending to hear from the region’s business leaders.\nMore than 300 delegates are expected to attend each day for a mix of learning, networking and commercial opportunities.\nThe event will also feature speakers, workshops and showcases, with full details expected to be announced in the coming weeks.\nNorthern Powerhouse Minister Jake Berry said: “The Northern Powerhouse is a top priority for our government and it is right that it should be central to the Great Exhibition of the North.\n“The last Great Exhibition was in 1851, when the North was powering the Industrial Revolution. This summit is about making sure that the Northern Powerhouse is creating a northern economy fit for the future with the North at the forefront of a fourth industrial revolution.”\nThe business summit forms a key part of the Great Exhibition of the North, which is being held from June 22 to September 9. The Exhibition is expected to attract more than a million visitors to Tyneside, generating £184m for the local economy. Images of what the fountain set to be installed in the Tyne will look like 9.15 Coreena Ford Science and engineering firms are counting the cost of skills shortages\nScience and engineering businesses are suffering a shortage of more than 170,000 skilled workers, costing them £1.5 billion a year in recruitment, temporary staffing and extra training, according to a report.\nMost firms in the so-called Stem (science, technology, engineering and maths) sector have found it difficult to hire staff in the past year, with companies now having an average of 10 unfilled posts.\nAlmost half of businesses are looking to recruit suitably qualified staff from overseas, according to the study by STEM Learning.\nChief executive Yvonne Baker said:\nWe are heading towards a perfect storm for Stem businesses in the UK - a very real skills crisis at a time of uncertainty for the economy and as schools are facing unprecedented challenges.\nThe shortage is a problem for employers, society and the economy, and in this age of technological advancement the UK has to keep apace.\nWe need to be in a better position to home-grow our talent but it cannot be left to Government or schools alone - businesses have a crucial role to play too. Research among 400 businesses found that recruiting skilled workers is taking an average of 31 days longer than expected Science and engineering businesses are suffering a shortage (Image: GDGOLD) 9.10 Coreena Ford New jobs to come at gluten-free biscuit maker in Gateshead after major acquisition\nTyneside biscuit baker Northumbrian Fine Foods is poised to taste sweet success in the European free-from food sector after being snapped up by a European firm .\nThe Team Valley firm – the UK’s largest gluten free and milk-free sweet biscuit manufacturer – is being acquired by Biscuit International, a major player in the private label biscuit market, from CriSeren Foods Ltd.\nThe move marks a big leap forward for the Northumbrian Fine Foods (NFF), which was first founded in 1936 and is now generating turnover in excess of £27m thanks to its position as a leader in the gluten free market, with supermarket own-label biscuits and the Prewett’s brand products.\nNow the firm will gain access to a market which is predicted to be worth more than £8bn within three years following the undisclosed acquisition, which will lead to investment in expansion of production and new job creation as it targets new markets.\nThe acquisition comes less than two years after the Gateshead business invested £1.2m in its facilities, also creating 40 jobs to take the workforce to around 200. One of the ovens at Northumbrian Fine Foods in Team Valley (Image: Northumbrian Fine Foods) 9.05 Meet the North East firm protecting bees around the world\nA County Durham company has joined the frontline fight to protect bees around the globe.\nFor the last eight years, Arnia has been producing cutting edge beehive monitoring equipment that can track and record bee health and behaviour, before sending it to beekeepers.\nNow the firm is getting support in exporting its technology around the world, working with governments, universities, farmers and beekeepers to protect bees and combat disease and invasive species which are all a threat to worldwide bee numbers.\nThe business was originally founded by electronics expert Huw Evans and his wife Sandra in 2010, and together they have helped grow the business to six employees, including a cutting-edge R&D department.\nBacking from the Department for International Trade funded a trip to the International Bee Research Conference, which led to the company working in New Zealand.\nThe company’s technology allows hives to be monitored from anywhere in the world, on any device at any time and also delivers alerts if anything changes within colonies. As well as helping maintain strong, productive and healthy bee colonies, it provides an insight to life inside a hive.\nHives are fitted with scales, thermometers and numerous other sensors with data transmitted wirelessly to a central gateway unit in the apiary.\nThe firm also shares data and knowledge from its global network of monitored hives, which it continuously analyses to identify new health or behaviour signatures.\nArnia commercial director George Clouston, who is also a beekeeper himself, said: “Bees are everywhere and essential to world food production, so protecting them and making sure they have the correct environment to thrive is essential across the globe. 9.00 Coreena Ford North East tech sector is worth almost £1bn and growing faster than rest of the economy\nThe North East tech sector is worth almost £1bn and growing more than twice as fast as the rest of the economy, a new report says.\nThe annual state of the nation report from Tech Nation says tech companies in the region have a combined turnover of £995m, with the sector growing 2.6 times as fast as the rest of the economy while job numbers have risen five times as quickly.\nThe tech sector’s workforce is older than commonly perceived and more ethnically mixed than the average UK workplace but it still predominantly male, despite efforts to attract more women to tech companies, the report says.\nTech Nation - which was formed by the merger of Tech North and Tech UK - has also praised initiatives in the North East, such as the formation of the Newcastle Tech Trust to help start-ups in the sector and the imminent opening of the North East Futures UTC.\nGerard Grech, chief executive and co-founder of Tech Nation says: “Tech Nation 2018 is the first major milestone of Tech Nation, the organisation now working across the country to build networks that support ambitious entrepreneurs and shine a light on the achievements of our tech sector.\n“The UK’s tech sector is growing almost three times faster than the rest of the economy. What started as Tech City is increasingly Tech Nation. London is the world’s second most connected hub after Silicon Valley.\n“We need to make the most of that, as our new relationship with the EU will undoubtedly force us to be even more adaptive, innovative and ambitious.” Gerard Grech, chief executive of Tech City UK 8.55 Coreena Ford Playtech suffers investor revolt\nPlaytech’s shareholders have revolted against the board at the company’s annual general meeting, voting against the firm’s pay plans and its chairman. Playtech, which specialises in the development of gambling technology, has proposed raising the pay of its chief executive Mor Weizer by 78%.\nMr Weizer’s pay rose to £4.2m in 2017, up from £2.3m the year before, despite the firm issuing a profit warning.\nOn Monday, shareholders criticised the pay package, with 59% of votes cast at the AGM coming out against the firm’s remuneration report.\nInvestor advisory groups Institutional Shareholder Services and Glass Lewis both recommended that shareholders rebel over Mr Weizer’s pay.\nShareholders also lashed out at Playtech’s chairman Alan Jackson, who sits on the company’s remuneration committee, and John Jackson, chairman of the remuneration committee, for their role in setting pay.\nA total of 43% of votes cast went against John Jackson while 35% of votes opposed the re-election of Alan Jackson.\nIn a statement, the company said it will review who sits on its remuneration committee, and that it is looking at potential candidates for non-executive positions on the board. 8.50 Coreena Ford Foxtons sales drop amid London housing slump\nFoxtons has seen first-quarter sales slide as the estate agent bears the brunt of a prolonged slump in the London property market.\nThe group saw revenue drop nearly 15% to £24.5 million in the period, with Foxtons bemoaning “very challenging” trading.\nSales revenues dropped from £11.1 million to £8.2 million while lettings revenues came in at £14.3 million, down from £15.5 million in the same period last year. Mortgage revenue dipped from £2.1 million to £2 million.\nThe group said: “Conditions in the London property market remain very challenging with sales volumes lower than prior year.\n“Foxtons entered 2018 with a lower sales pipeline compared to the same point last year and this resulted in lower levels of activity in the quarter.” Performance in lettings was impacted by a “slow start” to January and the timing of Easter, it added. A branch of Foxtons in London 8.47 Coreena Ford Royal Mail declares 'successful year', despite plummeting profits\nRoyal Mail has reported a 37% fall in bottom-line pre-tax profits to £212 million for the year to March 25, down from £212 million a year earlier.\nOn an underlying basis, pre-tax profits rose 1% to £565 million, from £559 million the previous year.\nAdjusted operating profits rose 1% to £694 million on revenues 2% higher at £10.2 billion.\nMoya Greene, outgoing chief executive of Royal Mail, said:\nIt has been another successful year, despite the challenging environment.\nGroup revenue is now over £10 billion, a significant milestone, thanks to our geographical diversification and focus on growth.\nParcel volume growth in UKPIL (UK parcels, international and letters) was our best for four years. We delivered a resilient letters performance. We continue to focus on cost avoidance and parcel revenue growth in the UK and through GLS (General Logistics Systems). Outgoing Royal Mail CEO Moya Greene 8.40 Coreena Ford Thomas Cook narrows its losses\nLosses at Thomas Cook narrowed in the first half of the year but the travel giant flagged that the UK is still causing it a headache.\nThe group posted a £303 million loss in the six months to March 31, which compares to a £314 million loss in the same period last year.\nRevenue rose 5% to £3.2 billion, driven by growth to Egypt and long-haul destinations.\nThomas Cook boss Peter Fankhauser said that the firm continues to experience “margin pressure” in the UK, due to a combination of “hotel cost inflation in Spain, currency impact and capacity increases in the market”.\nShares were down over 3% in morning trading.\nNevertheless, the travel firm’s summer programme is 59% sold, with Thomas Cook seeing strong demand for Turkey, Greece and Egypt.\nBookings to Spanish islands are lower than last year following a decision to reduce capacity.\nMr Fankhauser added: “Thomas Cook has had a good first six months of the year, delivering improved financial results combined with tangible strategic progress.\n“The work we’ve done in the past two years to improve customers’ experience of our flights and our holidays is bearing fruit with revenue growth of 5%, and a positive booking position for the summer. “As we enter our busiest period, I see positive momentum across all of our markets.” Thomas Cook Airlines plane (Image: Publicity Picture) 8.35 Ocado flies into US market in latest overseas foray\nOnline grocer Ocado has announced its fifth international deal, with US grocery retailer Kroger.\nUnder the terms of the agreement, Ocado’s technology will be used in the US exclusively by Kroger, with the US firm also taking a 5% stake in the London listed group.\nThe duo are working to identify the first three sites in 2018 for the development of new “automated” warehouses in the US and will ramp it up to a total of 20 over the first three years of the agreement.\nHere’s hoping the North East’s Tharsus has some involvement - the Northumberland robotics firm designed and manufactured the robot at the centre of Ocado’s revolutionary grocery handling system, after all.\nOcado expects the earnings impact of the announcement to be neutral this year.\nShares in Ocado rocketed nearly 40% following the announcement.\nNew York listed Kroger has about 2,800 retail food stores under a variety of brands and serves nine million customers a day. The US group will pay a monthly exclusivity and consultancy fees to Ocado as part of the tie-up. An Ocado home delivery van (Image: Katie Collins/PA Wire) 8.30 Coreena Ford 'Proposal will accelerate Mothercare transformation', says KPMG restructuring partner\nMothercare needs to secure at least 75% creditor approval for the CVA for it to proceed. A detailed proposal document is expected to be made available to creditors via a website today. The creditors will vote on the CVA on 1 June 2018.\nJim Tucker, restructuring partner at KPMG and a proposed supervisor of the CVA, said:\nFor over 50 years, Mothercare has been one of the UK’s most trusted and familiar brands.\nBut like many other traditional retailers, in recent years the Group has been adversely affected by the consumer shift to online shopping, as well as the trend of declining footfall.\nIn addition, the business has been adversely impacted by other pressures impacting the retail sector as a whole including rising costs of labour, product, rent and business rates.\nToday’s comprehensive proposals to create a fully refinanced, restructured business will allow an accelerated transformation of the business and are a crucial part of Mothercare’s drive to a viable and sustainable future.\nAs seen with similar successful CVAs, this proposal is one facet of a wider financial and operational restructuring plan. If approved, and with the support of the company’s lenders, shareholders and landlords, the business will be able to move forward across a smaller, more profitable estate, with a business model more suited to today’s multi-channel retail environment.\nWill Wright, restructuring partner at KPMG and second proposed supervisor of the CVA, said Mothercare currently operates 134 leased stores across the UK. The company is proposing Company Voluntary Arrangements in respect of its three lessee entities, Mothercare UK Limited, Early Learning Centre Limited and Children’s World Limited, which will divide the company’s sites into three categories.\nFor 64 ‘Category 1’ stores, the leases will be retained at current rents. For a further 21 ‘Category 2’ sites, a reduced rent, equivalent to 50%, will be paid for three years.\nFinally, for a total of 49 ‘Category 3’ stores, a reduced rent, equivalent to 35%, will be paid for 12 months while the company engages with landlords to agree the basis of any continued trading from these premises.\nHe added: “It is important to stress that no stores will close on day one, and suppliers will continue to be paid on time and in full.” 8.25 KEY EVENT Mothercare swings axe on 50 stores - and brings back ousted chief executive\nMothercare is to swing the axe on 50 underperforming stores and re-hire the chief executive it sacked just weeks ago as part of a wide-ranging shake-up.\nThe closures, which will result in hundreds of job losses, will be carried out through a company voluntary arrangement (CVA) - a move which allows companies to close loss-making shops and secure rental discounts.\nMothercare employs about 3,000 people across 137 outlets.\nIn a move that will stun many observers, Mark Newton Jones, who was given the elbow as chief executive last month, will return to the fold and once again take the top job.\nThe man that had been brought in to replace him, David Wood, will now become managing director.\nAs part of the restructuring, Mothercare also announced a refinancing package worth up to £113.5 million.\nIt comprises £28 million through an equity capital raising, an extension of its existing debt to £67.5 million, £18 million in shareholder and trade partner loans.\nChairman Clive Whiley said: “The recent financial performance of the business, impacted in particular by a large number of legacy loss-making stores within the UK estate, has resulted in an unsustainable situation for the Mothercare brand, meaning the group was in clear need of an appropriate resolution.\n“These comprehensive measures provide a renewed and stable financial structure for the business and will drive a step change in Mothercare’s transformation.\n“These measures provide a solid platform from which to reposition the group and begin to focus on growth, both in the UK and internationally.”\nRetailers across the board have been battered by weak consumer confidence off the back of soaring Brexit-fuelled inflation.\nThey have also had to contend with surging wage costs and eye-watering business rate hikes.\nSince January, Toys R Us and Maplin have filed for administration while fashion retailers such as New Look and Select have embarked on radical store closure programmes. A Mothercare store.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14667122;"], "published": "2018-05-17T10:25:00.000+03:00", "crawled": "2018-05-17T11:28:11.142+03:00", "highlightTitle": ""}