{"organizations": [], "uuid": "1a0aba72ba730b33b46b44de94a956ca183999c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14615789.ece/ALTERNATES/s1200/SGP_NEC_040518NTCOUNT25JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tyneside-council-local-election-14615882", "country": "GB", "domain_rank": 21960, "title": "North Tyneside Council local election results in full - here's how the candidates scored", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-04T15:53:00.000+03:00", "replies_count": 0, "uuid": "1a0aba72ba730b33b46b44de94a956ca183999c6"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tyneside-council-local-election-14615882", "ord_in_thread": 0, "title": "North Tyneside Council local election results in full - here's how the candidates scored", "locations": [], "entities": {"persons": [{"name": "sarah day", "sentiment": "none"}, {"name": "monkseaton north", "sentiment": "none"}, {"name": "ian grayson", "sentiment": "none"}, {"name": "norma redfearn", "sentiment": "none"}], "locations": [{"name": "monkseaton south", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "invalid email labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLabour are two seats better off in North Tyneside after a straightforward election for the party.\nThey took Monkseaton North and Cullercoats from the Conservatives and Northumberland ward from the Liberal Democrats.\nThe only bump in the road for the red side in this election, which attracted a turnout off 35.5%, was losing Monkseaton South to the Tories.\nIan Grayson, cabinet member for children, young people and learning, narrowly lost by 62 votes to the Tories, meaning a mini-reshuffle is on the cards. Sarah Day (Image: Newcastle Chronicle)\nThe election was a reminder that every vote can count: Labour’s three wins came courtesy of a combined total of 93 votes.\nLabour’s elected mayor Norma Redfearn said: “I’m sad to have lost a colleague but over all I’m pleased to see the people of North Tyneside have put their faith in us.\n“Nationally it has been a frustrating night for us and I worry people don’t always know what we stand for, we need to be clearer. (Image: Newcastle Chronicle)\n“In North Tyneside, people know what we stand for - local issues and jobs.”\nDeputy mayor Bruce Pickard, who maintained his Riverside seat, said: “From our perspective the big issue on the doorstep was telling people how we’ve managed to maintain good council services despite Government cuts.\n“We’ve got a good track record here and this election was all about telling people about that.”\nConservative leader Judith Wallace said: “I would like to pay tribute to the two colleagues we’ve lost today and welcome a knee strong voice to team.\n“We are fighters in North Tyneside and we’ll keep going.\n“Nationally what tonight has shown is that people know they are better off with a Conservative council and we will work to make sure the people of North Tyneside can have that.”\nThis race also saw a new party entering the stage in Renew.\nThe anti-Brexit party launched earlier this year and picked North Tyneside as one of its first battlegrounds, fielding candidates on Monkseaton South and Tynemouth. Read More Newcastle City Council local elections 2018 results IN FULL - how every candidate scored\nTynemouth candidate Tom Bailey, who came fourth with 142 votes but beat the Lib Dems, Greens and UKIP, said: “We’re happy to have been through this process and got our name out there and I think we have a real future here.”\nA possible push from the Lib Dems in Wallsend did not materialise but chair John Appleby said he was confident the party still had a future in the area.\nThe make-up of the council is now: Labour 53 (+2), Conservative 6 (-1), Lib Dem 1 (-1) Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-04T15:53:00.000+03:00", "crawled": "2018-05-04T17:03:38.014+03:00", "highlightTitle": ""}