{"organizations": [], "uuid": "82766388c6abf818131bf4c5859f565fc2993758", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14614616.ece/ALTERNATES/s1200/Ukip-leadership.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ukip-collapse-party-loses-almost-14614509", "country": "GB", "domain_rank": 21960, "title": "UKIP collapse as party loses almost every council seat in the local election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-04T12:37:00.000+03:00", "replies_count": 0, "uuid": "82766388c6abf818131bf4c5859f565fc2993758"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ukip-collapse-party-loses-almost-14614509", "ord_in_thread": 0, "title": "UKIP collapse as party loses almost every council seat in the local election", "locations": [], "entities": {"persons": [{"name": "gerard batten", "sentiment": "none"}], "locations": [{"name": "derby", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "invalid email ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News UKIP collapse as party loses almost every council seat in the local election UKIP had 44 councillors contesting seats in the local elections - it lost all but one and has won only one other at the latest count Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nUKIP has lost almost all of its council seats leading to its former chairman openly discussing the possible end of the party.\nA total of 44 UKIP candidates’ seats were contested in the local elections, but the party lost almost all of them.\nAs of 9am, UKIP lost 43 council seats, held one in Derby and gained another in the East Midlands city. It now has three councillors in Derby, as not all of the city’s seats were contested.\nIn the North East, it did not even field candidates in Sunderland and has failed to win any seats in Newcastle or South Tyneside. Gateshead and North Tyneside’s results will be called later this morning. UKIP leader Gerard Batten (Image: PA)\nThe results are a huge contrast to the party’s 2014 high point, when it took 17% of the vote and 166 council seats, as calls ramped up for the EU referendum which led to Britain voting to leave the bloc. Read More Local election results: Newcastle, Sunderland and South Tyneside elections at a glance\nThe collapse comes a year after UKIP lost 114 of its 115 county council seats in the previous local elections.\nFormer deputy chairman Suzanne Evans has admitted the Euro sceptic party could “crumble” - although at the same time hailed UKIP as “one of the most successful political parties in history”. UKIP Health spokesperson Suzanne Evans (Image: Getty Images Europe)\nShe said: “I have to say, three councillors in Derby, one of them actually unseating the leader of the Labour council, it might not be UKIP’s night but my goodness me when we do win we do it with style and we really put the cat among the pigeons.”\nShe added: “If UKIP does crumble I think you could still arguably make the case that it’s been one of the most successful political parties in history.” Read More Newcastle City Council local elections 2018 results IN FULL - how every candidate scored\nThe demise could be because post-Brexit referendum, voters think UKIP’s purpose has been served.\nOther factors could be new leader Gerard Batten’s impact. Mr Batten sparked controversy with his views about Islam’s influence on Britain. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-04T12:37:00.000+03:00", "crawled": "2018-05-04T14:11:38.005+03:00", "highlightTitle": ""}