{"organizations": [], "uuid": "63f7a744f762d5d16b5e870048674029b9e4049c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1372618.ece/ALTERNATES/s1200/MarkTurnbull.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/cambridge-analytica-closing-operations-after-1527087", "country": "US", "title": "Cambridge Analytica is closing operations after Facebook data scandal - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-05-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "63f7a744f762d5d16b5e870048674029b9e4049c"}, "author": "Mikey Smith", "url": "https://www.devonlive.com/news/devon-news/cambridge-analytica-closing-operations-after-1527087", "ord_in_thread": 0, "title": "Cambridge Analytica is closing operations after Facebook data scandal - Devon Live", "locations": [], "entities": {"persons": [{"name": "mark turnbull", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "alex richards", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "cambridge analytica", "sentiment": "none"}, {"name": "devon live cambridge analytica", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "invalid email consultancy cambridge analytica", "sentiment": "none"}, {"name": "exeter university strategy and security institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cambridge Analytica is closing operations after Facebook data scandal The University of Exeter recently severed ties with one of its directors of CA Share Alex Richards Deputy News Editor 22:22, 2 MAY 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nConsultancy Cambridge Analytica is shutting down and its employees are being ordered to 'turn in their computers.'\nIt comes after an ongoing data scandal over their use of the private data of 87 million Facebook users to target political adverts for their clients.\nLocally, it led to the University of Exeter cutting ties with one of the firms directors and public condemnation from Exeter MP Ben Bradshaw.\nMark Turnbull's fellowship at the university was revoked in March, at the height of the scandal.\nIt was revealed by DevonLive.com that the company's managing director Mark Turnbull was an honorary fellow at the Exeter University Strategy and Security Institute. Read More Former Exeter University MPs on the rise following Amber Rudd's resignation\nThe Wall Street Journal, citing an unnamed source today, said the decision to close Cambridge Analytica was taken because the companies were losing clients and facing mounting legal fees in the Facebook investigation.\nThe firm had claimed credit for delivering Donald Trump's unlikely presidential victory and reported to have been involved in the Leave EU campaign in the build up to the Brexit referendum. Cambridge Analytica's managing director Mark Turnbull (Image: Channel 4 News)\nThe firm is shutting down effective Wednesday and employees have reportedly been told to turn in their computers.\nThe business had $15 million in U.S. political work in the 2016 election cycle and their chief executive, Alexander Nix, has already departed in an effort to contain the crisis - without apparent success.\nFacebook have said its own probe into the sharing of its users data would continue.\nA Cambridge Analytica statement said it had \"unwavering confidence that its employees have acted ethically and lawfully\" but \"the siege of media coverage has driven away virtually all of the Company's customers and suppliers.\"\nIt added: \"As a result, it has been determined that it is no longer viable to continue operating the business, which left Cambridge Analytica with no realistic alternative to placing the Company into administration.\" Read More Heart scan reveals bleak news for mum dying of two terminal illnesses - but once again there is hope\nIn secret filming by Channel 4 News released in March, CA executives boasted about profiling voters to help politicians target them with social media adverts.\nFormer CA employees Christopher Wylie and Brittany Kaiser have claimed the company helped Donald Trump and Ted Cruz's 2016 election campaigns, as well as the Brexit campaign group Leave.EU.\nLeave.EU denies the claims but pro-Brexit groups Vote Leave and BeLeave, as well as the DUP and Veterans for Britain, spent large portions of their campaign budgets with Aggregate IQ, a company linked to CA which carries out similar work.\nToday Facebook boss Mark Zuckerberg has described 2018 as an \"intense year\" for the social network, but promised to take a \"broader view\" of the company's responsibilities. Cambridge Analytica whistleblower Christopher Wylie gives evidence to the House of Commons Digital, Culture, Media and Sport Committee's inquiry into fake news (Image: PA Wire)\nMr Zuckerberg was speaking at the company's annual F8 developer conference, where he referred to the recent data privacy scandal involving the site and Cambridge Analytica as a \"major breach of trust\".\nHe announced the social media platform was to introduce a new Clear History tool, which would enable Facebook users to see the information third party sites and apps collected on them via Facebook and delete this data.\nThe new tool will also allow users to turn off Facebook's ability to store this information in the future.\n\"We need to make sure this doesn't happen again\", he said of the Cambridge Analytica incident, adding that it was important for the company to keep building new privacy tools as the issue would never fully be solved, calling it an \"arms race\". Read More Exeter University students expelled following racist and sexist messages\nThe Facebook founder also spoke about the company's wider plans to introduce new tools to find and remove malicious content and accounts, as it looked to \"protect election integrity\" as well as data privacy among users.\n\"We need to take a broader view of our responsibilities. It's not enough to just make powerful tools, we need to make sure that these tools are used for good,\" he said.\n\"We're hard at work making sure people don't misuse our platform.\"\nA spokeswoman for the Information Commissioner's Office said: \"The ICO has been investigating the SCL Group and Cambridge Analytica as part of a wider investigation into the use of personal data and analytics by political campaigns, social media companies and others. Facebook CEO Mark Zuckerberg speaks during the F8 Facebook Developers conference (Image: Getty Images)\n\"We will be examining closely the details of the announcements of the winding down of Cambridge Analytica and the status of its parent company.\n\"The ICO will continue its civil and criminal investigations and will seek to pursue individuals and directors as appropriate and necessary even where companies may no longer be operating.\n\"We will also monitor closely any successor companies using our powers to audit and inspect, to ensure the public is safeguarded.\"\nAfter Trump won the White House in 2016, in part with the firm's help, Cambridge Analytica CEO Alexander Nix went to more clients to pitch his services, the New York Times reported last year. Read More Devon city house for sale has a gorgeous country garden\nThe company boasted it could develop psychological profiles of consumers and voters which was a \"secret sauce'' it used to sway them more effectively than traditional advertising could.\nOne unanswered question in Special Counsel Robert Mueller's ongoing investigation into whether there was any collusion between Trump's campaign and Russia is whether Russia's Internet Research Agency or Russian intelligence used data Cambridge Analytica obtained from Facebook or other sources to help target and time anti-Hillary Clinton, pro-Trump and politically and racially divisive messages during the election.\nFormer White House aide Steve Bannon was a former vice president of the London-based firm, and Mueller has asked it to provide internal documents about how its data and analyses were used in the Trump campaign, according to sources familiar with the investigation. The full statement by Cambridge Analytica:\n\"Over the past several months, Cambridge Analytica has been the subject of numerous unfounded accusations and, despite the Company’s efforts to correct the record, has been vilified for activities that are not only legal, but also widely accepted as a standard component of online advertising in both the political and commercial arenas.\n\"In light of those accusations, noted Queen’s Counsel Julian Malins was retained to conduct an independent investigation into the allegations regarding the Company’s political activities. Read More\n\"Mr Malins report, which the Company posted on its website today, concluded that the allegations were not “borne out by the facts.”\nRegarding the conclusions set forth in his report, Mr Malins stated:\n“I had full access to all members of staff and documents in the preparation of my report. The offices of London-based political consulting firm Cambridge Analytica (Image: REX/Shutterstock)\n\"My findings entirely reflect the amazement of the staff, on watching the television programmes and reading the sensationalistic reporting, that any of these media outlets could have been talking about the company for which they worked.\n\"Nothing of what they heard or read resonated with what they actually did for a living.”\nDespite Cambridge Analytica’s unwavering confidence that its employees have acted ethically and lawfully, which view is now fully supported by Mr. Malins’ report, the siege of media coverage has driven away virtually all of the Company’s customers and suppliers.\nAs a result, it has been determined that it is no longer viable to continue operating the business, which left Cambridge Analytica with no realistic alternative to placing the Company into administration. Read More New 'first of its kind' cycle route being built in Exeter\nWhile this decision was extremely painful for Cambridge Analytica’s leaders, they recognize that it is all the more difficult for the Company’s dedicated employees who learned today that they likely would be losing their jobs as a result of the damage caused to the business by the unfairly negative media coverage.\nDespite the Company’s precarious financial condition, Cambridge Analytica intends to fully meet its obligations to its employees, including with respect to notice periods, severance terms, and redundancy entitlements. Like us on Facebook ", "external_links": [], "published": "2018-05-02T03:00:00.000+03:00", "crawled": "2018-05-03T00:45:46.002+03:00", "highlightTitle": ""}