{"organizations": [], "uuid": "5338303b17b6b3a9720ebb437c0c2d4449d30be6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14467340.ece/ALTERNATES/s1200/Newcastle-Airport-1.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/major-expansion-plans-announced-newcastle-14641464", "country": "GB", "domain_rank": 21960, "title": "Major expansion plans announced for Newcastle Airport - here's everything you need to know", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T19:10:00.000+03:00", "replies_count": 0, "uuid": "5338303b17b6b3a9720ebb437c0c2d4449d30be6"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/major-expansion-plans-announced-newcastle-14641464", "ord_in_thread": 0, "title": "Major expansion plans announced for Newcastle Airport - here's everything you need to know", "locations": [], "entities": {"persons": [], "locations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle international airport", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily\nNewcastle International Airport has set out its ambitious vision for the future.\nTimed to coincide with the airport’s 100th birthday in 2035, the masterplan provides a framework for a period of rapid growth.\nFrom new transport links and parking to the potential for a major runway expansion, there’s a lot going on.\nHere’s everything you need to know. So, what is a masterplan and why is it important?\nThe airport publishes a wide-ranging strategy every five years setting out its plans and goals for the future.\nThis one is designed to coincide with the 100-year anniversary of the opening of the airport in 2035.\nAlthough it doesn’t contain firm commitments or planning decisions, the masterplan gives a broad overview of what the coming years could have in store for one of the North East’s most important assets. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Why is Newcastle International Airport so important to the North East?\nOne word: money. As well as giving us all an easy way to go on holiday, the airport attracts tourism and investment to the region.\nThere are currently 3,500 people employed on site and 18,900 more employed indirectly, adding £1.16bn to the region’s economy every year.\nBy 2035, that could balloon to more than 4,700 on site and 27,800 indirectly, contributing more than £2bn to the North East’s economy.\nAnd with Brexit looming, having quick access to the global markets is going to be essential for the North East.\nIn 2006, £20m of flown exports went through Newcastle compared to £350m in 2018, and that’s a trend which needs to continue after we leave the European Union.\nThe plan forecasts passenger numbers could be set to rocket from 5.35 million in 2017 to 9.4 million in 2035. Passengers board a plane at Newcastle International Airport Is the airport getting a new runway?\nThis would be a major move for the airport but it’s a long way from being confirmed.\nAirport bosses would prefer not to have to do this because they’re aware it would be controversial and very expensive.\nThey also believe that it will be possible to achieve the airport’s goals without it as long as expected improvements to aircrafts come through - but that’s not a given. Read More More passengers and new destinations: Newcastle Airport reveals major expansion plans\nTo keep all options open for the future, 700m of land has been safeguarded for potential extension and assessments of how the extra noise would impact on the surrounding area have been carried out.\nDon’t expect this to happen anytime soon but it could become a big issue down the line. Newcastle International Airport's summer getaway Will we be able to fly to more places from the airport?\nNothing has been confirmed yet but adding to the list of destinations you can reach from the airport is always a focus.\nTransport for the North, the region’s new transport investment body, has set out cities where the airport should be targeting.\nInternational long-hauls to Canada, India, China and the US are on the cards and more European links to cities like Berlin, Athens and Budapest are also on the agenda. Will it be easier to get to the airport?\nBrave the traffic or risk the Metro? It’s every North East tourist’s holiday conundrum.\nBut planned transport improvements could make it significantly easier to get to the airport in coming years.\nIt’s already been confirmed new Metro trains will start to be rolled out by 2021, making the service a lot more reliable, and upgrades to the roundabout on the A696 are being looked at. Read More Residents furious after being kept up at night due to 'increased noise' at Newcastle Airport\nBut the real game-changer would be a main line rail link to the airport, an idea which is gathering support.\nAlthough this is very much in its early stages, Transport for the North say having a direct rail connection linked to Newcastle Central Station could attract customers from around the country. Video available Newcastle International Airport's summer getaway. More than 55,000 passengers are expected to pass through the terminal this weekend as the school holidays prepared to get underway, with people from across the North East heading for sunnier climates. Is there going to be more parking to accommodate extra passengers?\nAlthough the plan focuses on getting more people to the airport on public transport, the number of parking spaces will inevitably need to be increased.\nOne solution being looked at is a new multi-storey car park, adding thousands of new spaces.\nAn improved taxi pick-up and drop-off point is also being considered. Is the terminal going to change?\nNot immediately, but the plan includes provisions for some modest extensions in the future.\nThe authors of the plan have calculated the current footprint, complimented by the new arrivals lounge, will be able to cope with the expected levels of growth.\nBut what is certain is that the people running the airport are continually looking at how to improve shopping and leisure facilities and using technology to get people in and out of the airport faster. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-10T19:10:00.000+03:00", "crawled": "2018-05-10T19:30:49.028+03:00", "highlightTitle": ""}