{"organizations": [], "uuid": "e29dc8d84bbb4cb5008950fea0be6b2c9bb45340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1578666.ece/ALTERNATES/s1200/IMG_1695JPG.jpg", "site_section": "http://www.middevongazette.co.uk/theatre-news.rss", "section_title": "Devon Live - What's On News", "url": "https://www.devonlive.com/whats-on/whats-on-news/11-best-things-you-can-1577840", "country": "GB", "title": "11 of the best things you can eat and drink at the Devon County Show 2018", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-17T17:21:00.000+03:00", "replies_count": 0, "uuid": "e29dc8d84bbb4cb5008950fea0be6b2c9bb45340"}, "author": "Abbie Bray", "url": "https://www.devonlive.com/whats-on/whats-on-news/11-best-things-you-can-1577840", "ord_in_thread": 0, "title": "11 of the best things you can eat and drink at the Devon County Show 2018", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "abbie bray", "sentiment": "none"}], "locations": [{"name": "devon county", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "11 of the best things you can eat and drink at the Devon County Show 2018 There's load to choose from ranging from chocolate fondues, vegan cheeses and marshmallow liqueur Share Abbie Bray What's On Reporter 15:21, 17 MAY 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe first day of the Devon County Show 2018 is in full swing - and there are plenty of amazing food and drinks stalls for visitors to enjoy - ranging from chocolate fondues, vegan cheeses and Westcountry cider.\nMore than 90,000 visitors are expected to flock to the 123rd Devon County Show this weekend as the county's best livestock, local food and drink, country life and entertainment is showcased. Read More These are Devon's eight cleanest beaches\nOrganisers say that celebrity chefs will be demonstrating their skills in the food and drink pavilion alongside a huge variety of local food and drink plus a host of entertainment.\nThere'll be plenty of familiar attractions and faces at the show, but also some new stages and events and possibly the biggest Royal Wedding party in the county. (Image: Devon County Show)\nShow President and South Devon farmer Edward Darke said: “I think everyone in Devon farming will be looking forward to the County Show even more than usual this year, after the winter and spring that we’ve had.”\n“What with the weather and all the Brexit uncertainty it will be a relief to be reminded of all the good things about farming in Devon - the quality of our livestock, the strength of our supply industry, the wonderful food and drink that we produce and the incredibly strong sense of community that there is among the family farms of Devon,” he added.\n“That doesn’t mean that we’ll be forgetting the bigger picture, by any means. There’ll be plenty of talk about farming politics and the problems caused by the weather. But it will help to put all of that in its proper context, and allow us to have a thoroughly good time in the process.” Read More How can I get to the Devon County Show, where can I park and what is on the site map?\nFor Show Secretary Ollie Allen this will be her 22nd County Show and final year at the helm but she said that no two shows were ever the same: “My passion to be part of an event which appeals to every strand of the Devon community only gets stronger year on year. And this year I’m certain we’re going to pull it off yet again!\n“Of course, there will be an abundance of wonderful local food from a county bursting with a huge variety of local produce thanks to Devon’s two coastlines, moorland, rich rolling pastures and sheltered south-facing estuaries.\nDevon County Show 2018 - all you need to know including traffic, weather, line-up and the site map\n“And this year we are introducing two major new attractions; the Watering Hole, where visitors will savour street food, drink from Exeter Brewery, live music and plenty of seats housed in a huge red and blue marquee, and the Ocean Discovery Zone which embraces the magic and threats to our seas.\n“It will be a Show of mixed emotions for me but the star is the Show itself, so if there are plenty of happy people, enjoying themselves, whether competing or visiting, then – ‘job done’ for the last time.\" Here are 11 of the best food and drink stalls at the Devon County Show 2018\nVIP Nuts\nJean Goldman has brought VIP Nuts to the Devon County Show for the first time and they do lots of flavours of nuts including hot toffee, wasabi and lemon chilli. Find them here https://www.newyorkdelhi.com/vipnuts/ VIP Nuts Read More\nIcandy fudge\nShaun Hawkins has brought his Bournemouth-based fudge company to the show for the first time.\nAll the fudge on offer is both gluten and wheat-free. Flavours include gin and lime, Ferrero Roche, salted caramel, rhubarb, Mint Aero and Oreo. Find them here https://www.facebook.com/icandyfudge/ Icandy Fudge\nEnglish Spirit\nHayley Perring has brought her spirits to the Devon County Show (and they are amazing). She has lots of different spirits on offer including apple brandy, marshmallow, chocolate liqueur, cucumber, rhubarb gin and plum gin (plus many more). Find them here https://www.facebook.com/englishspirituk/ Try the chocolate liqueur - it's delicious Read More\nBig Bakes Bakery\nCharlie Deeley from Torquay-based bakery, Big Bakes has brought her sweet treats to the Devon County Show.\nShe is serving up giant Gingerbread men, giant cookies, 14 different tray bakes including Billionaire shortbread and chocolate brownies as well as lots of different flavoured cupcakes. Find them here https://www.facebook.com/Bigbakesbakery/ Big Bakes Bakery\nFeniton Foods\nHelen Evans has brought a selection of gluten-free, vegan and vegetarian dishes to the show including hummus falafels and wraps as well as vegan cheese. Find them here https://www.facebook.com/fenitonfoods/ Homemade Hummus, falafels, wraps and drinks Read More Shock closure of Exeter's Tony Pryce blamed on 'pressures of online shopping'\nThe Chocolate Fondue\nStefan Overberry from The Chocolate Fondue has been coming to the Devon County Show for 14 years - and we can see why.\nHis stall located in the food and drinks tent and they serve up strawberries, waffles and marshmallows covered in both milk and white chocolate. Find them here https://www.facebook.com/chocolatefonduecompany/ The Chocolate Fondue\nSandford Orchards Cider\nDanny Elston has brought the Crediton-based cider company to the show and they are located in the food and drinks tent.\nYou can choose from 15 types of cider including Fanny's Bramble, Shaky Bridge, Devon Red and Devon Mist.\nDanny says that the most popular cider is the Devon Red. Find them here https://www.facebook.com/sandfordorchards/ Sandford Orchards Cider Here's everything you can eat and drink at the Devon County Show 2018\nWestaways\nThe family business, which is based in Newton Abbot, has been making sausages for 120 years, and are planning to branch out into foreign territory, opening sites in Hong Kong and China.\nIt’s fresh, succulent and juicy and have gone on to win a plethora of awards. Moving forward, they are working hard to reduce their plastic usage. In 10 days’ time, their plastic packaging will be replaces by a recyclable cardboard tray. Find them here: https://www.facebook.com/Westaways/ Westaways\nQuince Honey Farm\nThis company has been trading at the County Show since 1992, pleasing visitors with their range of honeys all made from their own bees from their farm in South Molton. Go and see Jean Wallace at the stall in the food and drinks tent to find out about all the different honey they haveon offer. Find them here: https://www.facebook.com/quincehoneyfarm/ Quince Honey Farm Read More How can I get to the Devon County Show, where can I park and what is on the site map?\nCurworthy Cheese  \nBased at Stockbeare Farm near Okehampton, Curworthy Cheese have been producing their own products for the last 25 years. The milk is sourced from local dairy farmers in the area - delivered overnight and pasteurised the next morning to make the award-winning cheese. They offer a number of different variations too, such as spring onion, chilli, mustard and spring onion. They will also be offering cheese scones and toasties especially for the Devon County Show. Find them on Facebook, here: https://www.facebook.com/Curworthy-Cheese-1596165627288208/ Curworthy Cheese\nOddfellows\nYvan and Faye from Oddfellows have brought a selection of gins to the County Show for the first time this year.\nThey have lots of gins from the south west on offer ranging from Salcombe gin to Wrecking Coast gin. Find them here https://www.facebook.com/theoddfellows1/ Video Loading Click to play Tap to play The video will start in 8 Cancel Play now ", "external_links": ["https://www.facebook.com/theoddfellows1/", "https://www.facebook.com/icandyfudge/", "https://www.facebook.com/englishspirituk/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.facebook.com/sandfordorchards/", "https://www.facebook.com/fenitonfoods/", "https://www.facebook.com/chocolatefonduecompany/?ref=br_rs", "https://www.facebook.com/chocolatefonduecompany/", "https://www.facebook.com/Curworthy-Cheese-1596165627288208/", "https://www.newyorkdelhi.com/vipnuts/", "https://www.facebook.com/Westaways/", "https://www.facebook.com/Bigbakesbakery/", "https://www.facebook.com/quincehoneyfarm/"], "published": "2018-05-17T17:21:00.000+03:00", "crawled": "2018-05-17T17:36:42.000+03:00", "highlightTitle": ""}