{"organizations": [], "uuid": "b183c22763bd8a7551640503c2cf42148d0cae75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1049838.ece/ALTERNATES/s1200/Mothercare.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicester Mercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/mothercare-announces-plans-close-50-1576739", "country": "GB", "domain_rank": 48128, "title": "Mothercare announces plans to close 50 UK stores - what we know so far", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-17T10:18:00.000+03:00", "replies_count": 0, "uuid": "b183c22763bd8a7551640503c2cf42148d0cae75"}, "author": "Rachel Lee", "url": "https://www.leicestermercury.co.uk/news/business/mothercare-announces-plans-close-50-1576739", "ord_in_thread": 0, "title": "Mothercare announces plans to close 50 UK stores - what we know so far", "locations": [], "entities": {"persons": [{"name": "david wood", "sentiment": "none"}, {"name": "mark newton jones", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "mothercare", "sentiment": "negative"}, {"name": "cva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nStruggling retailer Mothercare has announced it is to close 50 under-performing stores and re-hire the chief executive it sacked just weeks ago as part of a wide-ranging shake-up.\nWith hundreds of job losses predicted, the closures will be carried out through a company voluntary arrangement (CVA) - a move which allows companies to close loss-making shops and secure rental discounts.\nMothercare employs almost 3,000 people across 137 outlets.\nIn a move that will stun many observers, Mark Newton Jones, who was given the elbow as chief executive last month, will return to the fold and once again take the top job.\nThe man that had been brought in to replace him, David Wood, will now become managing director.\nAt this stage it is unclear which stores will be affected.\nAs part of the restructuring, Mothercare also announced a refinancing package worth up to £113.5 million.\nIt comprises £28 million through an equity capital raising, an extension of its existing debt to £67.5 million, £18 million in shareholder and trade partner loans.\nChairman Clive Whiley said: \"The recent financial performance of the business, impacted in particular by a large number of legacy loss-making stores within the UK estate, has resulted in an unsustainable situation for the Mothercare brand, meaning the group was in clear need of an appropriate resolution. Read More Asda design special shopping trolley for mum of triplets\n\"These comprehensive measures provide a renewed and stable financial structure for the business and will drive a step change in Mothercare's transformation.\n\"These measures provide a solid platform from which to reposition the group and begin to focus on growth, both in the UK and internationally.\"\nRetailers across the board have been battered by weak consumer confidence off the back of soaring Brexit-fuelled inflation. Read More McDonald's urgent warning to allergy sufferers after supply issue\nThey have also had to contend with surging wage costs and eye-watering business rate hikes.\nSince January, Toys R Us and Maplin have filed for administration while fashion retailers such as New Look and Select have embarked on radical store closure programmes. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-05-17T10:18:00.000+03:00", "crawled": "2018-05-17T10:37:34.023+03:00", "highlightTitle": ""}