{"organizations": [], "uuid": "58eec0f2a46dd57168fdacfacb70ec1ab6d34652", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14607857.ece/ALTERNATES/s1200/Ballot-box.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/alternative-candidates-who-might-appear-14607696", "country": "GB", "domain_rank": 21960, "title": "The alternative candidates who might appear on your voting slip this Thursday", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-02T21:22:00.000+03:00", "replies_count": 0, "uuid": "58eec0f2a46dd57168fdacfacb70ec1ab6d34652"}, "author": "Nicole Morley", "url": "https://www.chroniclelive.co.uk/news/north-east-news/alternative-candidates-who-might-appear-14607696", "ord_in_thread": 0, "title": "The alternative candidates who might appear on your voting slip this Thursday", "locations": [], "entities": {"persons": [{"name": "blaydon", "sentiment": "none"}, {"name": "lisabela", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "parliamentary", "sentiment": "none"}, {"name": "gateshead space navies party", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The alternative candidates who might appear on your voting slip this Thursday Who will be appearing on your ballot alongside Labour, Conservatives and the Lib Dems? Share The alternative candidates who might appear on your voting slip this Thursday (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAs voters head to the polls to cast their ballot on Thursday they’ll notice that some things never change.\nThe big three political parties in the UK; Labour , Conservative and Lib Dems, are bound to appear on almost everyone’s voting slip.\nHowever, there might be a few unusual parties that voters won’t recognise. Read More\nHere’s a roundup of some of the lesser-known parties putting candidates up across Tyneside; Gateshead\nSpace Navies Party - Blaydon - Lisabela Zxywhiddm Marschild\nThe Space Navies on their website claim they are an anti-oppression party in the North East. Lisabela has previously stood as a Parliamentary candidate under the party banner ‘We demand a future now’ where she won just 81 votes.\nMost of the party’s local election manifesto isn’t publishable here because of libel law, but it’s fair to say she isn’t fan of the current councillors.\nSave Us Now - Dunston Hill and Whickham East - Graham Steele\nThe Save Us Now party is a party of law and order, peace and prosperity and lower taxes, businessman Graham Steele, 58, says.\nIt also believes that 5G transmitters are being secretly trialled in Gateshead by the Government and that they are making people ill.\nGateshead council have dismissed the conspiracy theories and reassured residents that the street lights in the Borough are not negatively impacting the health of residents. Read More North Tyneside\nRenew - Tynemouth - Tom Bailey and Monkseaton South - Alex Jacobs\nThe newly founded anti-Brexit party has fielded 200 candidates in this year’s local elections, including two in North Tyneside.\nSome of the party’s key policies include; aggressive housebuilding, scrapping student loans and a second referendum on Brexit. Newcastle\nIt’s time to put Newcastle First - Benwell and Scotswood - Adam Mitchell - Callerton and Throckley - William Joseph Jobes - Lemington - Sarah Jane Armstrong and John Alan Gordon - West Fenham - Ian Alfred ose Fraser\nAlthough the party was established in 2011, it won’t be that well known with most voters, especially anyone who has recently moved to the area. The party wants to move away from party politics in Newcastle City Council and say they put communities first. Like us on Facebook", "external_links": ["https://www.gazettelive.co.uk/all-about/local-elections", "https://www.gazettelive.co.uk/all-about/conservative-party", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://www.gazettelive.co.uk/all-about/labour-party"], "published": "2018-05-02T21:22:00.000+03:00", "crawled": "2018-05-03T00:53:46.003+03:00", "highlightTitle": ""}