{"organizations": [], "uuid": "f732b2dfb14ae9230de962caa5ce40f4c9c6ccb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10224824.ece/ALTERNATES/s1200/JS74044756.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/sunderland-software-city-signs-partnership-14641693", "country": "GB", "domain_rank": 21960, "title": "Sunderland Software City signs partnership to help tech firms sell in China", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T19:19:00.000+03:00", "replies_count": 0, "uuid": "f732b2dfb14ae9230de962caa5ce40f4c9c6ccb6"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/sunderland-software-city-signs-partnership-14641693", "ord_in_thread": 0, "title": "Sunderland Software City signs partnership to help tech firms sell in China", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "tuspark newcastle", "sentiment": "none"}, {"name": "david dunn", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "china business sunderland software city", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sunderland software city", "sentiment": "none"}, {"name": "east", "sentiment": "none"}], "organizations": [{"name": "sunderland software city", "sentiment": "negative"}, {"name": "mou", "sentiment": "none"}, {"name": "tuspark newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Sunderland Software City signs partnership to help tech firms sell in China The SSC has signed a memorandum of understanding with TusPark Newcastle, which has links with business parks across China Share Click to play Tap to play The video will start in 8 Cancel Play now Get business Thank you for subscribing!\nA partnership between two north East business groups is aiming to change the way technology is used across the world while helping companies from the region expand into China.\nSunderland Software City has signed a memorandum of understanding (MOU) with TusPark Newcastle to explore how tech can be used to improve the way UK firms sell their products to China.\nOne of the main projects the two organisations will be working on is discovering how software such as artificial intelligence (AI) can be improved for use in foreign markets.\nDavid Dunn, CEO of Sunderland Software City, said: “The bit I’m most interested about, and where we can do something with TusPark Newcastle, is understanding how, after Brexit, the UK and China can use digital technology. Part of that is understanding critical biases in AI. Sunderland software city\n“When you use AI there is a bias depending on who is writing it. We want to know if AI made in the UK will work as well in China.\n“You imagine AI is there and it just does what it learns, but when things are programmed, we programme in biases. There is highly likely to be a male bias in most programmes as the vast majority of tech developers are male. This is something we need to explore.\n“Will it work across difference values or across different boundaries?”\nThe MOU will also see the two business groups attempt to improve how intellectual property (IP) is protected in the Chinese and Asian markets. Western companies are often reluctant to sell their products in China for fear of their IP being stolen, pirated, or copied. Software City is hoping to prevent this using Blockchain technology. TusPark Newcastle, on Grainger Street (Image: NCJ Media)\nBlockchain works by tracking where information, such as financial transactions or specific pieces of software, are downloaded and sent. Mr Dunn believes Blockchain could be used to track whether a UK company’s software is being downloaded or pirated illegally.\n“The other thing we are going to do is understand how to use tech to benefit tech,” said Mr Dunn, “and how we might share IP across technology in different countries.\n“There is a natural resistance to selling products in China because of IP, but imagine if you could remove that by using other technology to managed software locations and IT in different markets. That could open up different export markets.”\nThe MOU was signed at the official opening of TusPark Newcastle, which took place on May 8. TusPark is one of the biggest science and technology park networks in the world and has more than 160 locations across the world.\nTusPark Newcastle has already helped a number of UK businesses access the Chinese market through its Forge accelerator programme. Through its Newcastle office, 10 UK businesses were sent to China to network and pitch their products to local investors and manufacturers. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-10T19:19:00.000+03:00", "crawled": "2018-05-10T23:26:07.025+03:00", "highlightTitle": ""}