{"organizations": [], "uuid": "c999f3f2bfc338acf8767b910f23cbd4febc8e79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14613878.ece/ALTERNATES/s1200/JS72902775.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14613886", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Ex-Volkswagen boss faces charges over diesel emissions cheating scandal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-04T10:00:00.000+03:00", "replies_count": 0, "uuid": "c999f3f2bfc338acf8767b910f23cbd4febc8e79"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14613886", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Ex-Volkswagen boss faces charges over diesel emissions cheating scandal", "locations": [], "entities": {"persons": [{"name": "winterkorn", "sentiment": "none"}, {"name": "martin winterkorn", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ex-volkswagen", "sentiment": "negative"}, {"name": "volkswagen", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Shock and sadness as Campus North in Newcastle announces decision to close\nA co-working space that has helped launch and grow hundreds of tech businesses in the North East has made a surprise decision to close.\nCampus North, in Newcastle’s Carliol Square, has announced that it will close at the end of the year so that its founders can concentrate on their Tech for Life initiative.\nThe office space, which was started by the Ignite business accelerator programme and has grown to gain a national reputation, offered hot-desking, co-working, offices, meetings and events space.\nIt attracted dozens of start-up businesses to the North East and has also held initiatives on issues including tech skills and improving the number of women working in the region’s technology industry.\nTwo years ago it was named the best workspace in the UK, winning praise for its “genuine sense of community”.\nThe offices, which were set up after a crowdfunding campaign that hit its target within 24 hours and went on to raise almost £20,000, had a five-year lease that runs out at the end of the year.\nAfter housing more than 200 tenants since 2012, it has decided not to renew its lease, saying that the creation of other co-working spaces means there is no longer a need for its services.\nCo-founder Lyndsey Britton said:\nWe’re a tiny team, there’s only five of us and we also run Tech for Life. Running two businesses has been pretty challenging and though Campus North has been brilliant, Tech for Life is growing and we think it’s got the ability to scale up.\nWhen we started Campus North there was nothing like it. Now there’s a lot of co-working spaces popping up in the city - that’s brilliant and we’re thrilled to have played a big part in creating that culture. Campus North has created so many connections for start-ups and growing companies and it was really needed.\nIt will be missed and there will be a gap but these other facilities can hopefully take its place. The value of Campus North is its community, not the bricks and mortar, so if that can transfer to somewhere else in the city, we’ll still have everything we worked so hard for in the first place. Newcastle's tech hub Campus North 9:10 Jonathon Manning Scientists to track tiny plastic pieces from tyres and clothes to the ocian\nScientists are due to track how tiny plastic particles from tyres, polyester clothing and fishing gear enter oceans and affect marine life, the Government said.\nMinisters have pledged £200,000 for scientists at the University of Plymouth to research how the particles known as microplastics end up in the seas.The project comes after the Government introduced a ban on miniature plastic beads or ‘microbeads’ in the manufacture of wash-off cosmetic and personal care products where the plastics can be washed down the drain.There are many other sources of small plastic particles - found in places as remote as the Arctic sea ice - including from car tyre friction on roads or through fibres from synthetic clothes released during washing.The 11-month project will build on research already under way, with scientists estimating that tyres contribute 270,000 tonnes of plastics per year while a single wash load of acrylic clothing could release more than 700,000 microfibres into the ocean, the Government said.Environment Minister Therese Coffey said:\nThe impact of plastic pollution on our oceans is one of the greatest environmental challenges of our generation.\nThe UK is already leading the way in this area, but we want to go further - and faster.\nRobust scientific evidence should support our policy proposals, and through this exciting project we will build on work under way to better understand how microplastics end up in the marine environment and what we can do to tackle this in the future. Exfoliating daily wash containing micro-beads (Image: Yui Mok/PA Wire) 9:05 KEY EVENT Drivers report decline in condition of UK roads over last decade\nNine out of 10 (88%) drivers say the condition of UK roads has declined over the last decade, a new survey suggests.The AA poll of 17,500 motorists also found that two-thirds (67%) say roads have “considerably deteriorated” in the past 10 years.Some 42% of drivers rated residential streets as “poor” last month, compared with 34% in March 2017.A recent survey by the Asphalt Industry Alliance found that local authorities in England and Wales needed £9.3bn to bring their roads up to scratch.The harsh winter led to a spike in pothole-related breakdowns, such as damaged shock absorbers, broken suspension springs and distorted wheels.AA president Edmund King said:\nIt is clear that despite all the talk from central and local government, not enough is being done to fix our increasingly dangerous streets.\nOur potholed roads are in a perilous state. AA breakdown operations are rescuing record numbers of drivers whose tyres or wheels are damaged by potholes.\nThe current lack of proper investment on local roads means highway authorities are doing little more than papering over the cracks.”Transport Secretary Chris Grayling announced in March that councils would be given a further £100 million to tackle potholes and repair storm damage in England.\nMartin Tett, transport spokesman for the Local Government Association, said:\nIt is wrong that funding for local roads is miles behind that of the strategic road network.\nVery few journeys begin and end on a motorway or trunk road yet government funding on the strategic road network is 52 times higher than for local roads.\nA Department for Transport spokeswoman said the Government is investing £23bn on roads.She added:\nWe have listened to the concerns of road users and are already providing councils in England with over £6bnto help improve the condition of our local highways. This funding includes a record £296 m through the Pothole Action Fund - enough to fix around six million potholes.\nWhile it is for councils to identify where repairs should be undertaken, we are also looking at how innovative technology can help them keep their roads in the best condition and save money. A pot hole (Image: Copyright Unknown) 8:55 Games Workshop ups full-year profit forecast\nFantasy miniatures maker Games Workshop has upgraded its profits forecast for the full year.The Nottingham-based group said that a solid few months of sales in the three months to April 30 will help full-year profits to come in “slightly above expectations”.Stellar results have been helped by online sales and the continued popularity of tabletop game Warhammer.In a stock market announcement, the firm said:\nFollowing on from the group’s update on February 5 2018, the good growth trends have continued to the end of April.\nSales and, given the high operational gearing of the business, profits for 2017/18 to date are therefore slightly above expectations. Games Workshop, Lorne Arcade, Ayr. 8:45 Jonathon Manning Sales rise at Pearson as turnaround continues\nEducational publisher Pearson eked out a rise in sales over the first quarter as the firm presses ahead with a sweeping cost-saving programme.The group, which is embarking on a restructuring, reported a 1% rise in underlying revenues in the period, with growth in North America making up for declines elsewhere.Pearson said its “cost efficiency programme” is on track to deliver £300m of annualised savings by 2020.North American revenues grew 3% and sales in its core unit, which incudes the UK, Australia and Italy, rose 6%.In the UK, the group has inked a partnership with the University of Sussex to launch a programme of postgraduate online degrees from September.Turnover plummeted 12% across Pearson’s so-called “growth segment”, where it trades in Brazil, China, India and South Africa.Trading at publisher Penguin Random House is in line with expectations, Pearson said.Chief executive John Fallon said:\nWe have made a good start to 2018, performing in line with our expectations.\nWe continue to make good progress against our strategic priorities including our digital transformation, and we expect to grow underlying profit in 2018.\nThe group maintained its operating profit guidance for 2018 of £520m to £560m. 8:40 Jonathon Manning Boldon firm Faltec's turnover suffers during year of recovery and discontinued car models\nFaltec Europe saw its turnover fall by 8% last year after spending 2017 “in recovery” from supply issues and plant breakdowns the previous year.\nTurnover at the company, which produces car parts for automotive firms such as Nissan and Honda, fell from £39.4m to £36.4m for the year ending December 2017.\nAlong with supplying parts to Nissan’s factories in Europe, Spain and Russia, the Boldon firm supplies a brightwork beltline system for two BMW models, as well as injection moulding parts for Renault vehicles.\nHowever, Faltec said the dip in turnover was largely due to the production of certain car models coming to an end.\nIn the firm’s financial accounts, deputy managing director Keith Wakley, said:\nHonda Europe (HUM) business is transiting to the new Civic, the parts for which are not manufactured by Faltec Europe. This will result in more available capacity in our injection moulding, paint and assembly facilities, and will allow Faltec Europe to pursue opportunities for supply localisation with HUM.\nMr Wakley added:\nFaltec Europe is looking to expand its relationship with the Renault-Nissan alliance. Historically, Nissan Motors have been the largest customer for Faltec Europe, and as the Renault-Nissan group look to increase synergies across models and platforms, Faltec Europe will see increased opportunities for expansion of business with Renault.\nThe company also warned that it was concerned about the reputation of diesel powered vehicles, and was monitoring the situation. Faltec Europe Ltd factory (Image: Newcastle Chronicle) 9:35 KEY EVENT Whisky industry 'faces £50m tariffs bill if trade deals are lost'\nWhisky bosses have warned the industry could be facing £50m a year in tariffs after Brexit if the UK Government fails to deliver on trade deals.Scotch Whisky Association (SWA) chief executive Karen Betts said trade deals with 24 nations - including Colombia and South Korea - were “very important” to the sector.With the UK having to negotiate new trade agreements as part of the process of leaving the European Union, she stressed these must be on “as good or better terms” as the existing arrangements.Ms Betts, speaking at the the SWA members’ day conference in Edinburgh, also insisted there should be “zero tariffs” on whisky sales to Europe post-Brexit.Overseas sales of whisky amounted to almost £4.4bn in 2017 - and with a third of exports going to Europe each year, the SWA has highlighted the importance of the continent for its products.Ms Betts said:\nWe continue to call on government to ensure that, after Brexit, we can trade as easily with Europe as we did as an EU member.\nAt a minimum, we want to see agreement on zero tariffs, a minimum of regulatory divergence and mutual recognition of geographical indications.\nTurning to sales of Scotch outside of Europe, she stressed the need for “proper attention” to be given to these markets.Ms Betts added:\nThe EU currently has agreements in place with more than 100 countries which govern trade, one way or another. Twenty-four of these agreements are very important to Scotch whisky, such as the EU’s agreements with South Korea and Colombia.\nThe loss of these agreements would directly, negatively impact Scotch whisky. We are urging the UK Government to swiftly put in place similar agreements with those 24 countries - on as good or better terms - to ensure Scotch can continue to be exported with a minimum of extra cost and complication.\nWe have calculated that the loss of these 24 agreements would cost the industry over £50m annually in tariffs, and would reduce our competitiveness in market. Karen Betts Jonathon Manning Grant Thornton expands North East tax practice\nBusiness advisory firm Grant Thornton has boosted its tax practice after making six hires across its regional offices.\nThe hires, which were made over the last nine months, include two strategic market-facing senior hires.\nAssociate director Douglas Tailby and senior manager Michael Stacey have been brought in to strengthen the tax team in the North East and Yorkshire. Their respective focuses will be on growing the firm’s private and corporate tax specialisms, as well as providing senior level support for the local team’s growing client portfolio.\nCommenting on the appointments, Rachel Engwell, Head of Tax at Grant Thornton in Yorkshire & the North East, said:\nOur tax practice is going from strength-to-strength and I’m delighted to welcome these latest additions to the team. It’s been a fantastic year of new client wins and vibrant growth. This hasn’t gone unnoticed and has allowed us to attract some of the best talent in the market which, combined with the recent appointment of Tom Klouda as Director, will enable us to continue on this positive and exciting journey.\nDrawing on his extensive knowledge of advising large and complex businesses Douglas Tailby will focus on developing the firm’s footprint in the North East whilst private client and partnership tax specialist Michael Stacey will provide valuable expertise to support the teams’ mid-market initiatives in the Sheffield city region. Grant Thornton's new hires Jonathon Manning Two North East businesses make Top 10 of UK's most innovative firms\nTwo North East businesses have been named among some of the most innovative firms in the UK , according to a report ranking businesses on their intellectual property (IP).\nRadiation detection company Kromek placed third in the IP100 list, while Newcastle’s Grid Smarter Cities came in at number seven.\nThe list, which is collated by intellectual property consultancy Metis Partners, ranks UK companies based on their IP assets and value. A total of 150 firms submitted applications to be part of the list.\nSedgefield’s Kromek produces a range of equipment that can detect everything from cancer to dirty bombs. As well as placing third in the overall league table the company also came fourth for brand reputation, sixth for its patents, seventh for its software, and 18th for trade secrets.\nArnab Basu, CEOof Kromek:\nOur radiation detection technology is a game changer, one that enables new, relevant and exciting products to make a real difference to people’s lives and their health.\nRecently, Kromek announced an important step in breast screening for cancer by teaming up with the Newcastle-upon-Tyne Hospitals. This project will develop for wide-scale adoption the use of an ultra-low dose of radiation in molecular breast imaging, a cutting-edge technology which uses a radioactive tracer to provide clearer images that identify cancerous tumours at an earlier stage than current methodology.\nThe technology and patents that we have created and been recognised for are for these type of projects, ones that make a real difference.\nGrid Smarter Cities specialises in making city centres more accessible to businesses. The tech firm offers concierge style city services, discounts and rewards for its partners, and parking solutions for local firms.\nThe company, which is headquartered at The Core in Newcastle, also ranked in the top 20 nationally for brand reputation, patents, trade secrets and software development. Chief executive of Kromek, Arnab Basu (Image: Publicity Pic) 8:20 Jonathon Manning British Airways owner sees first quarter profits soar\nBritish Airways owner International Airlines Group (IAG) has reported a sharp increase in first quarter profit, helped in part by the timing of Easter.IAG saw operating profit in the three months to March 31 rise 75% to €280m (£247m), traditionally the weakest quarter of the year for airlines.Revenue grew 2.1% to €5bn (£4.4bn) as the group benefited from Easter falling within the reporting period.IAG also said sales were boosted by service improvements, with a particularly strong showing in North America, Europe and Latin America.Chief executive Willie Walsh said:\nWe’re reporting another strong quarter performance with an operating profit of €280m before exceptional items, up from 160 million euros last year.\nOur positive passenger unit revenue trend continued with an increase of 3.5% at constant currency.\nThis trend benefited partially from the timing of Easter. Despite higher market prices, our fuel unit costs have gone up by just 0.6% in euros. The tail fins of British Airways aircraft (Image: PA) 8:15", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14613886;"], "published": "2018-05-04T10:00:00.000+03:00", "crawled": "2018-05-04T10:26:04.002+03:00", "highlightTitle": ""}