{"organizations": [], "uuid": "0fa56c4bdeeb15db8c2d9790de2698e2c010c5c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article347019.ece/ALTERNATES/s1200/BSW222.jpg", "site_section": "http://www.westernmorningnews.co.uk/education-news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/business/backthesouthwest-campaigners-say-devon-cornwall-1603694", "country": "GB", "title": "#BackTheSouthWest campaigners say Devon and Cornwall risk 'laggard of the UK' tag", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-28T02:00:00.000+03:00", "replies_count": 0, "uuid": "0fa56c4bdeeb15db8c2d9790de2698e2c010c5c1"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/backthesouthwest-campaigners-say-devon-cornwall-1603694", "ord_in_thread": 0, "title": "#BackTheSouthWest campaigners say Devon and Cornwall risk 'laggard of the UK' tag", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "sarah davy", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "pennon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "government’s industrial strategy", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News #BackTheSouthWest campaigners say Devon and Cornwall risk 'laggard of the UK' tag The #BackTheSouthWest campaign is two years old and more needs to be done to secure the prosperity that Devon and Cornwall deserves Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBack The South West campaigners have issued a rallying cry for the region to pull together or risk being left behind in the race for post-Brexit prosperity.\nWith a year to go before we are set to leave the EU, business leaders across the region say that Devon and Cornwall risk becoming the ‘laggard of the UK’ plagued by digital not-spots, poor road and rail infrastructure and the brain drain to more vibrant economic areas.\nSusan Davy, Chief Finance Officer at Pennon, a key partner in the #BTSW campaign and Chairman of CBI South West, said that the Government’s Industrial Strategy recognises local economies have a good supply of skilled labour, connectivity, with land available for homes, offices and factories, innovation built around a university, and an attractive cultural environment.\nShe said: “In recent years, the South West has developed and made progress in each of these areas.\n“Yet, despite its many attributes and pockets of brilliance, the South West continues to under perform when it comes to productivity.” Three things that will improve lives in the South West\n\"After decades of underinvestment there is a real danger the South West could be left behind more than it already has been unless decisive action is taken and a roadmap put in place for sustainable growth, at a pace and scale appropriate to the region’s increasing needs. Central to this are skills and infrastructure.\"\nSusan Davy, Chief Finance Officer at Pennon and Chairman of CBI South West\n\"It is vital that housing is seen as a priority for the South West, both in terms of supply and to make sure that the right mix of tenures and that genuine affordable homes are built. Planning is key. Local authorities and LEPS need to take strategic action to ensure we have enough homes in the long term and that necessary development sites are made available.\"\nPaul Crawford, Chief Executive at Liverty\n\"With the vision to dream up the next big ideas, investing more in research and development and the willingness to work together across the region, the South West will have the recipe to drive the growth it needs, and make the rest of the UK sit up and take note.\"\nMichael Beadel, partner and chairman at Stephens Scown LLP\nIt is almost two years since the Western Morning News launched the #BTSW campaign with Pennon and a host of the region’s biggest employers including Stephens Scown, Liverty, Foot Anstey and Devon Colleges Group.\nIt has held two South West Growth Summits and produced the South West Growth Charter setting out a series of priorities for the region, including road, rail and digital infrastructure investment, skills and talent retention. Business leaders, politicians and academics pledge to #BackTheSouthWest\nPaul Crawford, Liverty Chief Executive said that the provision of quality affordable housing is as important to create a prosperous economy.\nHe said: “The government is clear about its intention to build 300,000 homes a year across the UK. However, with the average house price in Devon and Cornwall around 10 times the average salary, there are huge challenges we have all got to get to grips with: Where is the next generation going to live and more importantly, can they afford it? Read More Ten multi-million pound projects tha...\n“There’s a double whammy in the South West where the average wages are lower than the national average and house prices are higher than the national average – ultimately, that means that most people who wish to get on the housing ladder with an average salary cannot afford homes in their communities, near their families or where they work. Read More A new village for Teignbridge? Nine things we learned from the Local Plan Review\n“I want housing to be properly recognised as being part of the infrastructure that is integral to economic growth. Local authorities, government agencies, housing associations and other businesses all have a part to play in recognising that homes are just as important as roads and rail in allowing that growth.”\nThe growth charter outlines the need to forge a stronger partnership between education, business, public sector partners and LEPs to boost productivity, attract high-quality direct investment and to nurture high-value businesses to retain skilled people. Turf cutting at the Grow on Building at Exeter Science Park. Pictures show: Dr Sally Basker, CEO of Exeter Science Park; Professor Sir William Wakeham, Chairman Exeter Science Park Board; Brian Rice, Kier Operations Director for Devon and Cornwall; and Steve Hellier, Associate Director at NPS.\nMs Davy said: “The #BTSW campaign has shown that the private sector is ready and committed to helping deliver a better future for the region.\n“With less than a year until the UK leaves the EU we now need concerted action on the part of business, education, local leaders, LEPs and politicians to secure a meaningful new deal with central Government. Our fate is in our hands and we cannot sit idly by as others prosper at our expense.”\nOver the past two years, there has been encouraging signs for infrastructure investment with £93million funding for the North Devon Link Road and a nod by Network Rail that it is hoping to progress a £500million plan to move the railway line at Dawlish as part of resilience plans. Flashback to Dawlish rail line damage in 2014\nBut there is still a long way to go, said Ms Davy.\nShe said: “The South West needs to be better connected; physically and digitally. The South West could well become the UK’s answer to Silicon Valley but to make this happen we need a new partnership between Government and the private sector, with a view towards delivering ultrafast 5G mobile, fibre and wireless broadband.\n“Without significantly greater investment in skills and infrastructure our region risks becoming the laggard of the UK, especially as other regions – for example the Northern Powerhouse – forge ahead with Government support.” Exeter Quay\nExeter is forecast to be one of the UK’s fastest growing cities over the next three years and across the wider region there are world-class businesses in industries such as marine and hi-tech manufacturing all the way from Bournemouth to Bodmin and beyond.\nMichael Beadel, partner and chairman at law firm Stephens Scown LLP, a partner in the #BTSW campaign, said the continuing growth and prosperity of the South West depends on innovation.\nHe said: “In the past the South West has definitely been guilty of selling itself short and not setting its aspirations high enough.” Goonhilly Earth Station\nHe said that the burgeoning space industry in Cornwall centred around Goonhilly Earth Station should be seen as a beacon for regional goals. “What could be more ambitious than reaching for the moon?,” he said. Read More Cornwall's tech sector highlighted in national report for growth that shows 'no sign of slowing down' and for creating hundreds of new well-paid jobs\nSean Fielding, Director of Innovation, Impact and Business at the University of Exeter, said innovation is critical to driving productivity, but in the UK we currently invest much less on R&D than many of our competitors and therefore it takes five days for a Brit to deliver the same output as a German produces in four.\nProductivity in Cornwall and the Isles of Scilly is the lowest in the UK with workers generating almost a third less gross value per hour than the national average.\nIt is a situation that could deteriorate with the potential loss of Cornwall’s EU funding post-Brexit and the expectation that the population of the South West as a whole will increase significantly in future years.\nMr Fielding said: “If our productivity is low then there will be fewer great technology breakthroughs and people will have less chance of having great, fulfilling jobs.”\nMs Davy called for a decisive action. She said a roadmap should be put in place for sustainable growth, at a pace and scale appropriate to the region’s increasing needs.\nShe said: “After decades of under investment there is a real danger the South West could be left behind more than it already has been.” How can I support #BackTheSouthWest?\nThere's a few easy things you can do to help spread the message Tweet your using the #backthesouthwest hashtag Work with with other groups and organisations across the region Tell others why the South West is a great place to live and work Continue to put pressure on our MPs to promote the South West to ensure we get our fair share of Government investment Like us on Facebook ", "external_links": ["https://www.cornwalllive.com/news/business/cornwall-tech-sector-technation-report-1581450", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-28T02:00:00.000+03:00", "crawled": "2018-05-29T11:34:23.000+03:00", "highlightTitle": ""}