{"organizations": [], "uuid": "10ffb62f8ff2caadcaf617f5363a9c9fac9b9b5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14639799.ece/ALTERNATES/s1200/BT-jobs-cut.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-jobs-risk-bt-14639370", "country": "GB", "domain_rank": 21960, "title": "North East jobs at risk as BT reveals it will axe 13,000 posts around the world", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T15:23:00.000+03:00", "replies_count": 0, "uuid": "10ffb62f8ff2caadcaf617f5363a9c9fac9b9b5d"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-jobs-risk-bt-14639370", "ord_in_thread": 0, "title": "North East jobs at risk as BT reveals it will axe 13,000 posts around the world", "locations": [], "entities": {"persons": [], "locations": [{"name": "gosforth business park", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East jobs at risk as BT reveals it will axe 13,000 posts around the world Thousands of jobs are being cut by BT at the same time as the firm announced it would exit its London headquarters Share A BT sign (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBT is to axe around 13,000 jobs as part of a revamped cost-cutting drive, but it will not say how many posts will go in the North East.\nThe company said it was making the changes as part of efforts to simplify its business, with thousands of back office and middle management roles set to be cut.\nTwo-thirds of the job losses will be made in the UK, meaning around 8,600 roles have been put at risk. In total BT employs 106,400 staff globally, including 82,800 in the UK.\nBT employs thousands of workers across the North East, including around 1,000 workers at its call centre at Gosforth Business Park in Newcastle. However, the company has declined to say how many jobs will be lost in the region. Read More North East MPs call for SECOND Brexit vote, splitting from Jeremy Corbyn\nA BT spokesperson said: ​“There are no details at this stage of either the reduction in roles, or the new jobs we have announced today, or what this means for individual locations around the country.\n“We have been clear, however, that the changes will represent an investment in the jobs and skills needed to strengthen our networks and customer service.”\nDespite the cuts it is possible that the North East will receive new jobs through BT’s restructure, as the firm is planning on creating 6,000 new roles “to support network deployment and customer service”. BT Group CEO Gavin Patterson (Image: Gian Ehrenzeller/Keystone)\nThe changes are being made as part of efforts to cut costs by around £1.5bn by the third year of its revamped strategic plan. The cost cutting plan is facing criticism after BT splashed out £885m on securing the rights to broadcast 32 Premier League football games.\nGavin Patterson, BT chief executive, said: “BT is uniquely positioned to be a leader in converged connectivity and services. We are a clear market leader in terms of the scale of our customer relationships. We have the UK’s leading fixed and mobile access networks, a portfolio of strong and well segmented brands, and close strategic partnerships. Read More 175,000 jobs if North embraces new technologies, says Siemens boss\n“We provide products and services that are essential to both consumers and businesses, delivered through multiple channels to suit their needs. This position of strength will enable us to build on the disciplined delivery and risk reduction of the last financial year, a period during which we delivered overall in-line with our financial and operational commitments whilst addressing many uncertainties.\n“I am really excited to be delivering the next stage of BT’s transformation and have put in place the team that will support me in achieving these objectives.”\nAlong with the changes BT said it will be closing its London headquarters, choosing instead to focus on 30 “modern strategic sites” in an effort to create a more “customer focused working culture”. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-10T15:23:00.000+03:00", "crawled": "2018-05-11T04:30:49.009+03:00", "highlightTitle": ""}