{"organizations": [], "uuid": "9d1b2a7aecefabc52ebc9c96b1a313c0b2447426", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1509958.ece/ALTERNATES/s1200/call.png", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/business-leaders-hope-sway-brexit-1520401", "country": "GB", "domain_rank": 48128, "title": "Business leaders hope to sway Brexit debate after meeting Minister for Exiting the EU - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.101, "site_type": "news", "published": "2018-05-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "9d1b2a7aecefabc52ebc9c96b1a313c0b2447426"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/business-leaders-hope-sway-brexit-1520401", "ord_in_thread": 0, "title": "Business leaders hope to sway Brexit debate after meeting Minister for Exiting the EU - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "callanan", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "leicester mercury news business", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "brexit advisory group", "sentiment": "none"}, {"name": "rsm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Business leaders hope to sway Brexit debate after meeting Minister for Exiting the EU Concerns raised over trade deals, exporting post-Brexit, Irish border and whether UK firms need to establish European bases Share Get Business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nLocal business leaders hope they are strarting to influence the Brexit debate following a round-table discussion with Lord Callanan, Minister of State at the Department for Exiting the European Union.\nDiscussions during the two hour East Midlands Chamber session included trade deals, the future of exporting post-Brexit, the Irish border and questions over whether UK firms need to establish European bases.\nConcerns were also raised about delays at ports, particularly around the import of construction materials and perishable goods.\nThe meeting was arranged at the offices of accounting firm RSM in Grove Park, Enderby, by the chamber’s new Brexit Advisory Group.\nRepresentatives from more than a dozen businesses attended along with Justin Homer from the Department for Business, Energy and Industrial Strategy, East Midlands Tory MEP Emma McCLarkin and Ian Harrison, Midlands director of export at the Department for International Trade.\nFollowing the meeting Emma McCLarkin said: “I wanted to bring the Department for Exiting the European Union so that business people could directly feed their concerns, suggestions for the negotiations, and for Lord Callanan to give some reaction to how the negotiations are going.” East Midlands Tory MEP Emma McCLarkin\nLord Callanan said it was a worthwhile discussion.\nHe said: “I outlined the steps we have taken in the Brexit process so far and the agreements with the EU, and they were able to ask questions about issues such as customs arrangements and immigration.\n“I think it was a very positive meeting and it’s good to get out of London to talk to people at the sharp end.”\nThe chamber was represented by chief executive Scott Knowles and director of policy Chris Hobson.\nMr Knowles said: “Lord Callanan’s visit gave us and members another very good opportunity to deliver to the heart of Government the concerns and asks of regional businesses over Brexit.\n“It gave us another chance to reiterate the message that the East Midlands contributes more to the national economy than anywhere else in the UK outside London and the South and that as the creators of jobs and wealth it is vital that the views of regional businesses are taken into consideration at all level of Brexit debate. Lord Callanan is Minister of State at the Department for Exiting the European Union (Image: Chris Gordon)\n“I talked to members after the event and they expressed a general opinion that they felt more confident about Britain’s future relationship with the EU and global trading after hearing from Lord Callanan than they did before.”\nThe Chamber’s Brexit Advisory Group was set up in collaboration with chamber strategic partner RSM to help regional businesses navigate their way through the Brexit process, starting with the publication of a checklist of things firms should be considering now to ensure a seamless transition.\nMr Knowles said: “Despite there being only a year to go, considerable doubt remains over what the future holds for business, with things to consider ranging from customs arrangements through employing EU nationals to contracts and Intellectual Property rights.\n“In business terms, a year is a very short time in which to go through all the documents, processes and programmes currently in use and revise all those that need it so that trading can continue post-Brexit.” Click here for checklist of things businesses should be focusing on to minimise risks of Brexit\nThe group is chaired by Dr Nik Kotecha, chief executive at Loughborough’s Morningside Pharmaceuticals, which has supplied pharmaceuticals and medical devices around the world for more than 25 years.\nIt will shape and help deliver the chamber’s wider Brexit influence and support programme, including lobbying activities, leading MPs briefings regionally and at Westminster, helping to shape the chamber’s 2018 Manifesto on Brexit, and providing up-to-date information to businesses through seminars, workshops and the media.\nOn Monday, Theresa May’s Brexit plans suffered a blow as the House of Lords voted to give Parliament a decisive say on the final terms of the Brexit deal. Read More\nFormer deputy prime minister Lord Heseltine and ex-ministers Lord Patten of Barnes and Lord Willetts were among 19 Tory rebels to support the cross-party amendment. Read More\nShadow Brexit secretary Sir Keir Starmer urged the Prime Minister to accept the cross-party amendment, warning that there was “no majority in Parliament for a no-deal Brexit”. Like us on Facebook", "external_links": [], "published": "2018-05-01T03:00:00.000+03:00", "crawled": "2018-05-01T19:29:51.059+03:00", "highlightTitle": ""}