{"organizations": [], "uuid": "7370d972323707fd209c590a38f9b23bf8358275", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/sport/football/article1590205.ece/ALTERNATES/s1200/Ricardo-Pereira-13.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicester Mercury - frontpage", "url": "https://www.leicestermercury.co.uk/sport/football/transfer-news/revealed-10-stages-transfer-deal-396817", "country": "GB", "domain_rank": 48128, "title": "The 10 stages of a Leicester City transfer deal", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-24T20:00:00.000+03:00", "replies_count": 0, "uuid": "7370d972323707fd209c590a38f9b23bf8358275"}, "author": "James Sharpe", "url": "https://www.leicestermercury.co.uk/sport/football/transfer-news/revealed-10-stages-transfer-deal-396817", "ord_in_thread": 0, "title": "The 10 stages of a Leicester City transfer deal", "locations": [], "entities": {"persons": [{"name": "claude puel", "sentiment": "negative"}, {"name": "harry maguire", "sentiment": "none"}, {"name": "aleksandar dragovic", "sentiment": "none"}, {"name": "jonny evans", "sentiment": "none"}, {"name": "jamie vardy", "sentiment": "none"}, {"name": "james sharpe", "sentiment": "none"}, {"name": "wilfred ndidi", "sentiment": "none"}, {"name": "riyad mahrez", "sentiment": "none"}, {"name": "ricardo pereira", "sentiment": "none"}], "locations": [{"name": "leicester city", "sentiment": "none"}, {"name": "new leicester city", "sentiment": "none"}, {"name": "porto", "sentiment": "none"}, {"name": "belvoir drive", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "getty images", "sentiment": "none"}, {"name": "atletico madrid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The 10 stages of a Leicester City transfer deal Claude Puel will hope to be completing more deals after the arrival of Ricardo Pereira Share James Sharpe Leicester City correspondent 18:00, 24 MAY 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily\nIt's the most exciting, frustrating and dramatic periods of the year: the summer transfer window.\nLeicester City have already made their first signing of the summer with Ricardo Pereira joining in a £22million deal from Porto, and more could soon follow with the club looking to wrap up permanent moves for Jonny Evans and Aleksandar Dragovic.\nMeanwhile, the club are expected to lose Riyad Mahrez to Manchester City , are braced for bids for the likes of Harry Maguire and Wilfred Ndidi, while Atletico Madrid are interested in Jamie Vardy .\nBut how does a transfer deal actually work? New Leicester City signing Ricardo Pereira outside the club's Belvoir Drive training ground (Image: Plumb Images/Leicester City FC via Getty Images)\nWe've all been in charge of Leicester on Football Manager, we've all done our homework and decided that this player is the one. We've scouted him, checked out his stats, worked out our budget and slapped in a bid.\nWe've heard his club's demands, heard the player's demands, matched both and finalised the deal.\nEasy.\nReal life, though, tends to be a little more complex, especially when your side is in the Premier League, and looking to sign world-class players.\nHow are football transfers actually conducted, then? Here we bring you the 10 stages of a modern transfer deal. 1. The scouting Leicester City bagged Riyad Mahrez for just £400,000 after scouts watched him play for Le Havre (Image: Plumb Images/Leicester City FC via Getty Images)\nPossibly the most mysterious element, but absolutely crucial. After all, if you want to make sure a transfer is a success, it helps to start by having the right player involved.\nFootball scouting is an evolving industry. The days of the old-school scout, making instinctive judgements from the stands, are not quite over, but they are fading, particularly at the top level.\nMany clubs now use computer programs, with Leicester using Wyscout to scour video footage and statistical analyses of players.\nIt enables manager Claude Puel , head of recruitment Eduardo Macia , his team of analysts, and director of football Jon Rudkin to run the rule over a player from the comfort of his office. Read More Mahrez: the saga in full\nBut there is still much more than just computers. There is still the need for scouts in the field, watching with their own eyes, trusting their own gut.\nCity have a vast scouting network in England and abroad, with a strong relations in France – how else do you snap up Mahrez from the second tier for just £400,000?\nThere is also the personal element. Scouts in the field now spend almost as much time gathering intelligence; speaking to agents, forging relationships with a player's family and friends, and doing their best to stay a step ahead of their rivals. Few industries are more competitive, or, in football terms at least, more important. Read More Riyad Mahrez transfer saga in full as move to Manchester City nears 2. The bid Leicester City signed right-back Ricardo Pereira from Porto for a deal worth around £22m (Image: Plumb Images/Leicester City FC via Getty Images)\nSo once a player has been identified, the next step is the transfer (or loan) offer. Pretty straightforward, you would think, but there is more than one way to start a transfer.\nThe most obvious is for a buying club to submit a formal written offer for a player, seemingly by fax even in this day and age, which will then be considered by the selling club. Read More No Newcastle United switch for Leicester City's Islam Slimani\nBut it is just as common for clubs to contact trusted agents to act on their behalf, either in finding an available player from another club, or finding a buyer for their own unwanted player.\nThese agents act as intermediaries between the buyers and the sellers, and can set the wheels in motion for a deal that otherwise may not have been struck. 3. Tapping up? Riyad Mahrez has said he wants to leave Leicester City (Image: Plumb Images/Leicester City FC via Getty Images)\nPremier League rules state that \"a player under contract shall not directly or indirectly make any approach to another club without having obtained the prior written consent of the existing club to who he is contracted.\"\nBasically, that all transfer deals should be started from scratch.\nReality, of course, is different. Rarely will a bid be submitted for a player, without the buying club having contacted the player's representatives to see if he would be interested in a move, and if so what kind of wages he would be after.\nFrowned upon? Certainly, but it is pretty much common practice across the game, although Liverpool did get into a spot bother over their pursuit of Southampton defender Virgil van Dijk .\nThe bulk of a deal is often set up before a fee has been agreed between the buying and selling clubs. For example, the conversations between Leicester and Man City have been ongoing since their bid in January was rejected. 4. The negotiations Director of football Jon Rudkin, left, is the man in charge of negotiating Leicester City's transfer deals (Image: Plumb Images/Leicester City FC via Getty Images)\nTransfer stories provide stock cliches. \"Preliminary talks,\"\"advanced discussions\", \"talks ongoing\", \"personal terms\", \"showdown talks\" - the list goes on.\nSuch phrases evoke images of a group of people – players, agents, chairmen, managers – sat around a table sliding pieces of paper with figures on them to each other, to be greeted by a shake of the head and an 'add a nought on to that and come back, matey.'\nAgain, the reality is very different.\n'Negotiation' meetings are often brief, with an agent laying out a player's demands, and an official (usually the chief executive, the head of recruitment or the director of football) giving the club's side of things. Read More Vardy podcast\nMany discussions nowadays take place via Whatsapp.\nIssues which arise during negotiations often relate to, of course, salary, bonuses an signing-on fees, as well as personal and social considerations.\nPlayers often leave the negotiations to their agents, and are kept abreast of the situation from afar. They usually meet with a manager before a deal goes through to discuss how he would fit in at his potential new club - and if they don't, then they're taking a huge risk - but in terms of sitting round a negotiating table discussing figures? That is rarely the case. 5. The player's dilemma Harry Maguire has gone on to become an England international after choosing Leicester City last summer (Image: Plumb Images/Leicester City FC via Getty Images)\nThis is the age of 'player power' in football, and there is little doubt that in transfer deals, it is they who hold the key.\nFair enough, some would say. After all, it is their lives who will change. Considerations for a player prior to a transfer include how much playing time they would get if they moved clubs, whether they would need to re-locate (or learn a new language), whether they would be happy to work for the buying club's manager and, particularly as you go down the leagues, the length of contract. Players, like anyone, want security.\nAnd, of course, there is also the financial aspect. Wages play a big part in any job decision, and in football the sums are vast, and still on the up. Read More Leicester City want Jonny Evans and Aleksandar Dragovic transfers 6. The agents Kelechi Iheanacho arriving at Belvoir Drive with his agents to complete his move to Leicester City (Image: Plumb Images/Getty Images/Leicester City)\nBoo. Often held up as the enemy of football, agents in truth suffer from a familiar problem; the conduct of a few bad apples ruining the whole batch.\nIn reality, agents are an important part of the game, particularly at this time of year, and good ones are valued, by both players and clubs. As we said, agents can be used by clubs to identify players, or to find clubs for players they are looking to sell. Their network of connections is often a valuable tool for managers, from the highest level down. Read More Riyad Mahrez to Manchester City deal delayed by agent fees\nThey also, theoretically at least, should ensure players are able to focus on their football, without having to concern themselves with contract negotiations and discussions. A good agent should be as much a mentor and a confidante as a negotiator.\nThey earn a pretty penny, mind. So much so, that both the Mahrez and Jonny Evans deals are being held up by disagreements over how much the agents should be paid. In the case of Evans, his agent is reported to want more than what Leicester are actually paying West Brom for the player. 7. The media Leicester City unveil new signing Eldin Jakupovic (Image: Plumb Images/Leicester City FC via Getty Images)\nThe relationship between the media and the transfer window is very much love-hate. They love it because the stories keep them knee-deep in copy, but hate it because sifting through the garbage is an arduous and often disheartening process.\nRegularly, reporters will receive tip-offs about potential transfers, often via agents but sometimes from other sources. The infamous 'taxi driver from the airport' is usually prevalent at this time of year, while any number of elite international players can be spotted heading towards Belvoir Drive, at Leicester train station or buying a coffee at the Highcross. Read More Martin 'Mad Dog' Allen's unique approach to transfer announcements 8. The medical and the work permit Kelechi Iheanacho under goes his medical with club doctor Ian Patchett at King Power Stadium (Image: Plumb Images/Leicester City FC via Getty Images)\nThe final hurdles in a deal are the medical and, for some players, the work permit. Medicals at top-level clubs are stringent, carried out at the training ground or a private hospital.\nBut as time ticks away on deadline day clubs, naturally, have been known to take gambles. Islam Slimani picked up a thigh injury in training just before he joined Newcastle on loan in January. If both club and player want a deal to go through, then it will.\nThen there's the work permit, international clearance and registration. Don't Leicester know only too well about that! Adrien Silva missed months of action after his registration was blocked due to the now-infamous 14-second delay last summer.\nWork-permits, meanwhile, are needed for any player over the age of 16 who does not own an EU passport. Well, until Brexit ticks around anyway. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "http://www.mirror.co.uk/sport/football/transfer-news/liverpool-klopp-van-dijk-transfer-10573311"], "published": "2018-05-24T20:00:00.000+03:00", "crawled": "2018-05-24T20:03:13.008+03:00", "highlightTitle": ""}