{"organizations": [], "uuid": "4426eeadcf4ac7bbf55c44eb79c10f38fd111554", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14692314.ece/ALTERNATES/s1200/Nissan-LEAF-Electric-Avenue.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nissan-ready-help-uk-lead-14692093", "country": "GB", "domain_rank": 21960, "title": "Nissan ready to help the UK lead the electric car revolution ahead of petrol and diesel ban", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-22T18:43:00.000+03:00", "replies_count": 0, "uuid": "4426eeadcf4ac7bbf55c44eb79c10f38fd111554"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nissan-ready-help-uk-lead-14692093", "ord_in_thread": 0, "title": "Nissan ready to help the UK lead the electric car revolution ahead of petrol and diesel ban", "locations": [], "entities": {"persons": [{"name": "gareth dunsmore", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "nissan europe", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "invalid email nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan ready to help the UK lead the electric car revolution ahead of petrol and diesel ban Upbeat carkmaker Nissan says its Sunderland plant will continue to sell electric cars across Europe Share Nissan Leaf electric car (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNissan is ready to help the UK lead the world in the production of electric vehicles, managers say.\nThe carmaker, which has a major plant in Sunderland, is poised to meet growing demand for environmentally-friendly cars as Governments across Europe impose bans on petrol and diesel vehicles.\nGareth Dunsmore, electric vehicle director of Nissan Europe, said: “We are very focused on the UK. We have our plant up in Sunderland. We are building more electric vehicles than ever before in Sunderland and will continue to do so, to meet not just British demand for electric vehicles but also European demand.”\nA ban on the sale of petrol and diesel cars and vans will be introduced in the UK in 2040.\nSome European countries are moving faster, and Norway will have a ban in place by 2025. Nissan (Image: Andrew Matthews/PA Wire)\nIt means there are opportunities for carmakers which lead the way in the production of electric vehicles which do not produce air pollution.\nThe Nissan Leaf, manufactured in Sunderland since 2013, was the first all-electric, zero-emission five-door family hatchback to be produced for the mass market from a major carmaker. It is also produced in Japan and the US.\nMr Dunsmore was speaking to the House of Commons Business, Energy and Industrial Strategy Committee, which is holding an inquiry into electric vehicles. Read More\nNissan has previously raised concerns abut the impact of Brexit in the car industry, but Mr Dunsmore had an upbeat message as he spoke to MPs.\nHe said Nissan was innovating, adding: “A lot of it can be driven out of Britain”.\nAnd he hinted that new models would be introduced. Customers wanted a range of different vehicles to choose from, and Nissan wanted to “start introducing a broader range of electric vehicles to meet that demand,” he said.\nBut Mr Dunsmore said Government had an important role to play in making the switch to electric vehicles a success, for example by providing incentives for motorists to switch and ensuring drivers had easy access to charging facilities.\nReferring to Norway’s 2025 target, he said the Norwegian government had shown what was possible.\n“In Norway, at 2025, we are already a long way to being able to achieve that. Nearly 50 per cent of Nissan’s volume in that market is electric.\n“We are ready to ramp up, we are ready to meet demand. Read More Over 100,000 North East students demand new Brexit referendum\n“But what we need is a clear pathway to that.\n“Norway has always been very good at setting out this vision, and setting out the steps both on infrastructure and on incentives hard and soft, monetary incentives and incentives that make customers feel the move to electric is easier.”\nNissan could help the UK meet its 2014 target, he said.\n“As long as there is a pathway to that then we are ready to work with you to deliver that.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-22T18:43:00.000+03:00", "crawled": "2018-05-23T00:21:46.001+03:00", "highlightTitle": ""}