{"organizations": [], "uuid": "c02b62a82d305854546038faf8913a58771b2eea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1534156.ece/ALTERNATES/s1200/Beef-cows.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/british-farmers-ready-brexit-challenge-1534026", "country": "GB", "title": "British farmers ready for Brexit challenge as productivity soars to record high", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-04T16:25:00.000+03:00", "replies_count": 0, "uuid": "c02b62a82d305854546038faf8913a58771b2eea"}, "author": "Athwenna Irons", "url": "https://www.devonlive.com/news/devon-news/british-farmers-ready-brexit-challenge-1534026", "ord_in_thread": 0, "title": "British farmers ready for Brexit challenge as productivity soars to record high", "locations": [], "entities": {"persons": [{"name": "colin higgs", "sentiment": "none"}, {"name": "george eustice", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}], "organizations": [{"name": "rural affairs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "British farmers ready for Brexit challenge as productivity soars to record high Farming incomes are also on the rise, according to the latest estimates Share Livestock outputs for meat and other products rose by 1.8% from 2016 Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nProductivity on British farms has risen to the highest level ever recorded for the sector, according to new estimates.\nThe latest set of Total Factor Productivity (TFP) figures from Defra (Department for Environment, Food and Rural Affairs) show productivity is estimated to have increased by 2.9% between 2016 and 2017.\nThe figures also show that farming’s profitability has seen an upsurge, growing by £1,683 million (41%) to £5,743m – with increases in crop production and higher farmgate prices cited as the main drivers for this change. Farming Minister, George Eustice, believes farmers are ready to make the most of Brexit (Image: Colin Higgs)\nFarming Minister George Eustice said: “Estimates show 2017 was a good year for the farming industry, in particular those in the arable and livestock sectors. Whilst the increase in farm gate prices has helped, it’s also encouraging to see signs that productivity is on the up.”\n“Farming is a volatile business and individual businesses will face many different challenges in a year, but these estimates show an industry that is ready to make the most of the opportunities leaving the EU will present.”\nA strong harvest helped to drive productivity higher for 2017, with a 7.3% increase in the volume of all crops estimated. Livestock outputs for meat and other products also rose by 1.8% from 2016. Read More When can a dog be legally shot by farmers?\nMore productive farming across all sectors is directly benefitting farmers’ bank balances, the figures reveal, as the total income from farming per person engaged in entrepreneurial labour in the sector rose by 41% in real terms to £29,794 a year.\nThe estimates also show that farming contributed a total of £10.3bn to the UK economy in 2017, an increase of £1,698m (20%).\nResponding to the figures, the National Farmers’ Union (NFU) said farming’s growing contribution to the economy was further evidence the sector needs to be properly valued by the Government post-Brexit. A strong harvest helped to drive productivity higher for 2017. Cereal volumes rose by 4.6% according to the figures, with oats being the only crop to see a fall of 1.7%\nGuy Smith, NFU Deputy President, said: “This is positive news for the farming sector and very clearly demonstrates the significant contribution agriculture makes to the wider economy.\n“As the NFU prepares to submit its consultation response to government on a future farming policy, these newly released figures provide further evidence that a new agricultural policy must allow farm businesses to be productive, profitable and progressive.\n“The increased profitability of our sector is particularly good news, as farmers have experienced a full year of higher commodity prices due to the devaluation of the pound which occurred after the EU referendum.\" Read More Culm grassland could be saved thanks to lottery funding\nBut Mr Smith also stressed the need to address market volatility in future agricultural policies, so increased profitability within the sector can be maintained.\n“It is important to remember that this rise comes after three years of falling profits and margins, and increased price volatility for many across the industry,\" he said. \"However, the NFU is concerned whether this performance can be sustained in future years.\n“In addition to the effects of the recent wet weather, the cost base of the industry has been rising. Some farm commodity sectors are also witnessing falls from the recent historic highs seen in 2017. Milk price, for example, has fallen nearly 8% in the past three months. Guy Smith, Deputy President of the National Farmers' Union (NFU) (Image: Simon Hadley / NFU)\n“Lower farm gate prices will feed through to a lower bottom line for 2018 and it would be reckless to draw from these figures that farming is entering a period of sustained profitability.\n“In order to put farmers in the best position to continue producing food for the nation, this sort of volatility needs to be addressed in future agricultural policies.\n\"The NFU believes that with the right government policies, Britain’s farmers can continue this impressive performance.” Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-04T16:25:00.000+03:00", "crawled": "2018-05-04T16:46:18.025+03:00", "highlightTitle": ""}