{"organizations": [], "uuid": "f508038e39fc3cc3d1a270e447dc424c1b482593", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1593729.ece/ALTERNATES/s1200/fireplace-195296_1280.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/log-burner-ban-cut-air-1593731", "country": "US", "title": "Log burner ban to cut air pollution - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "f508038e39fc3cc3d1a270e447dc424c1b482593"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/log-burner-ban-cut-air-1593731", "ord_in_thread": 0, "title": "Log burner ban to cut air pollution - Devon Live", "locations": [], "entities": {"persons": [{"name": "neil shaw", "sentiment": "none"}], "locations": [], "organizations": [{"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Log burner ban to cut air pollution Bad news if you like curling up in front of a cosy fire. Good news if you like being able to breathe Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 07:51, 22 MAY 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNew laws are to be brought in curbing the use of certain fuels on stoves and wood burners in a bid to reduce pollution, the Government has announced.\nOn top of tough new national rules council's will be allowed to be ecen tougher - creating 'clean-air zones' where all burning is banned and rolling out 'no-burn days' across their area.\nAs well as hitting open fires, log burners and stoves the rules will also apply to diesel-power machines and generators.\nNew legislation will mean that only cleaner fuels and stoves will be sold for domestic heating, curbing polluting smoke and soot, under plans being put out for consultation.\nThe clean air strategy is intended to cut the cost of air pollution to society by £1 billion a year by 2020, and by £2.5 billion a year by 2030. Read More Warning petrol and diesel prices could go over 140p per litre\nThe aim is to halve, by 2025, the number of people living in areas where tiny particles known as particulate matter or PM2.5 are above safe levels set by the World Health Organisation.\nThese tiny particles can be breathed into the lungs and get into the bloodstream, causing health problems including heart disease, strokes and lung cancer.\nOfficials say almost two-fifths (38%) of PM2.5 comes from domestic wood burners and open fires, which just 7.5% of homes have.\nThe strategy also aims to tackle another part of the problem, ammonia from farming, by requiring farmers to invest in equipment and measures to reduce emissions from things such as slurry spread on fields.\nUnder the plans, farmers will get support to bring in the equipment through the new system of agricultural payments for delivering public benefits, which is being devised to replace European subsidies after Brexit. Read More This is how much your parking has gone up in Exeter from today\nBut campaigners say more action is needed on other major sources of air pollution, in particular transport, to curb illegal levels of air pollution.\nThe Government is being taken to court by the European Commission over its failure to meet legal limits for harmful pollutant nitrogen dioxide, which should have been met by 2010, and has faced repeated legal action over the issue.\nDuring a visit to Imperial College London to meet air quality researchers, Environment Secretary Michael Gove admitted the Government had to \"do better\" on pollution and said it was important to tackle \"all sources\" of dirty air.\nThe latest strategy comes after Government announcements on measures to tackle pollution from transport, including phasing out the sale of new conventional petrol and diesel cars and vans by 2040.\nMr Gove said: \"It's critically important we make progress there, but it's also important we deal with other sources of air pollution, whether that's from slurry and manures spread on agricultural land or whether it's from wood burning or other ways people generate domestic fuel and power. Read More\n\"I don't imagine many people will be aware of the way in which wood burning or the way in which agricultural pollution contributes to material in the air which doesn't just cause health problems, but limits life expectancy.\n\"For that reason I think it's important we act in all of these areas.\"\nHe added: \"I don't think it's an either or, I think we need to deal with both nitrogen dioxide and particulate matter in our air, which affects human health and we need to tackle if the next generation are going to grow up healthy and we're going to have a healthy environment as well.\"\nHe said he did not think the Government would be subject to a middle-class backlash over curbing wood burners, as everyone wanted the best for their children. Read More South West Water fined £50,000 for sewage breaches at two popular Devon tourist towns\nUnder the plans, the Government will also provide a personal air quality messaging system to inform the public, particularly vulnerable to air pollution, about the air quality forecast.\nAlison Cook, director of policy at the British Lung Foundation, welcomed better monitoring and alerts for people, but warned: \"Most importantly we can't lose focus on transport as a main culprit for air pollution.\"\nMeeting the WHO pollution limits will require further action including a diesel scrappage scheme and investment into cleaner travel alternatives such as walking, cycling and public transport, she said. Like us on Facebook ", "external_links": [], "published": "2018-05-22T03:00:00.000+03:00", "crawled": "2018-05-22T10:00:45.002+03:00", "highlightTitle": ""}