{"organizations": [], "uuid": "e64934cfc980a5f36ab1fd7f638ae07c255508da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1472916.ece/ALTERNATES/s1200/mEL-STRIDEPNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/hard-border-inorthern-reland-brexit-1575109", "country": "GB", "title": "There will be no hard border between the north and south in Ireland", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-16T17:50:00.000+03:00", "replies_count": 0, "uuid": "e64934cfc980a5f36ab1fd7f638ae07c255508da"}, "author": "Mel Stride", "url": "https://www.devonlive.com/news/news-opinion/hard-border-inorthern-reland-brexit-1575109", "ord_in_thread": 0, "title": "There will be no hard border between the north and south in Ireland", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "irish sea", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion There will be no hard border between the north and south in Ireland Mel Stride MP says the government has made it clear a defacto border down the Irish Sea won't be created after Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now\nMEL STRIDE IS THE CONSERVATIVE MP FOR CENTRAL DEVON AND HAS BEEN SINCE 2010 I have been very busy last week not just in Westminster but also in Northern Ireland and on the media over the weekend.\nIn Northern Ireland I spent some time talking to local organisations and businesses about the border and how this will potentially be accommodated within the Brexit negotiations.\nWe have made it clear that there will be no return to the borders of the past – ie no hard border between the north and south. This is vital as to erect any kind of hard border would inevitably lead to a renewed flare up in the troubles. The government has made it clear that the solution will not be to create a defacto border down the Irish Sea with Northern Ireland effectively remaining in the Customs Union with the EU and the rest of the UK outside of that arrangement. Read More Sometimes when it comes to tax changes, less is more\nThere are two possible approaches being considered at the moment. One known as the Max Fac option would see technology and various facilitations brought in to ensure that goods flow across our borders with minimum friction. The other is the New Customs Partnership in which the UK would act as an agent for the EU collecting customs duties on those goods crossing our border and that were destined for the EU. Mel Stride\nThis latter approach is the one that would suit the Irish situation the best as it would largely remove the need for customs borders between ourselves and the remaining 27 EU members including Ireland.\nThe Prime Minister has set up two working groups to examine each approach and consider the best way forward. It is right that we look at these options very closely – each has its challenges but neither should be dismissed out of hand. Read More I will be keeping up the pressure on health service changes and Okehampton to Exeter rail plans\nOn Sunday I gave interviews to LBC, Five Live and to Sophie Ridge on Ridge on Sunday to discuss these issues. You can watch the Sky interview in full at http://youtu.be/EfL0xKDuE4I . As the Minister responsible for customs I am looking forward to working on helping to shape our final position. Like us on Facebook", "external_links": ["http://youtu.be/EfL0xKDuE4I", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-16T17:50:00.000+03:00", "crawled": "2018-05-16T18:30:40.014+03:00", "highlightTitle": ""}