{"organizations": [], "uuid": "5e8f4573eb2c30b007c5f503ff375bc5f88edd7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14649697.ece/ALTERNATES/s1200/Graduations.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/over-100000-north-east-students-14685895", "country": "GB", "domain_rank": 21960, "title": "Over 100,000 North East students demand new Brexit referendum", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-22T07:00:00.000+03:00", "replies_count": 0, "uuid": "5e8f4573eb2c30b007c5f503ff375bc5f88edd7f"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/over-100000-north-east-students-14685895", "ord_in_thread": 0, "title": "Over 100,000 North East students demand new Brexit referendum", "locations": [], "entities": {"persons": [{"name": "megan croll", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "northumbria university", "sentiment": "none"}, {"name": "university of durham students’ union", "sentiment": "none"}, {"name": "teesside university", "sentiment": "none"}, {"name": "share university", "sentiment": "none"}, {"name": "university of durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Over 100,000 North East students demand new Brexit referendum North East students say they want to be consulted about their future Share University students (Image: UGC TNE) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nStudent leaders from five universities representing over 100,000 students across North East England are calling for a referendum on the final Brexit Deal .\nIn the letter, elected student representatives from University of Durham, Northumbria University and Teesside University called for a “people’s vote” on Brexit.\nThey said: “The world is a different place to 2016. Promises made during the campaign have not been kept.”\nIt’s part of a nationwide campaign backed by 122 elected student leaders from 60 students’ unions representing 980,000 students across the length and breadth of the UK.\nMegan Croll, President of University of Durham Students’ Union, said: “The North East is one the regions with the most to lose out of Brexit, and young people in particular have legitimate concerns about their future prospects.\n“I’m so proud to be backing this campaign for a People’s Vote because the young people I represent deserve a say on the final terms of the deal - the world is a very different place to 2016 and we deserve a chance to say what we want our futures to look like.” The EU and Union flags (Image: PA)\nAmanda Chetwynd Cowieson, Co-Director of the campaign behind the letter, called For our Future’s Sake, said: “The Campaign For our Future’s Sake was created by students and young people, who have passed the point of frustration with the Government’s complete lack of progress or success with the Brexit negotiations, and the Labour Party’s inability to oppose them.\n“Brexit is the biggest threat facing future generations, and we believe that a People’s Vote on the terms of the deal will show that this is not the future that young people want. The youth are revolting.”\nWhile the campaign is calling for a public vote on the deal agreed with the EU, if the deal was rejected then in practice it would mean Brexit did not take place.\nThe letter states: “We believe that the European Union has been a force for good for UK Society. The ability to travel, work and study abroad freely and easily is something our students value. Our members are passionate about the environment, LGBTQ+ rights and Women’s rights, all furthered by the EU. We believe the pursuit of peace through dialogue and trade, is a noble one.” Read More Northern Rail comes under fire over train cancellations and delays\nIt continues: “We are firmly of the belief that it is in our member’s interests to retain the benefits of European Union membership. We are concerned that this will not happen, and that the public and our members have a far greater understanding of what the UK outside of the EU will look like.\n“We also note that a significant number of our members were unable to vote in 2016, and have not been able to have any meaningful say on the biggest issue affecting their futures.\n“Because of this, we call on our elected leaders to deliver on a people’s vote on the Brexit Deal so that young people can once and for all have a say on their futures.”\nBoth Labour and the Conservatives currently oppose any second referendum on Brexit. Read More Being a cleaner is as 'bad for you as smoking 20 cigarettes-a-day'\nThe student campaign is a particular challenge for Labour leader Jeremy Corbyn. Supporters of Mr Corbyn say he is particularly popular among young people.\nLabour faces a difficult balancing act maintaining support among young people who oppose Brexit while also appealing to older voters in areas such as the North East who support leaving the EU.\nConservatives are concerned about their failure to win support among younger people and graduates, who tended to oppose Brexit.\nEnvironment Secretary Michael Gove and Scottish Conservative leader Ruth Davidson are backing a new Tory think tank called Onward which will look at ways of winning more support for the Conservative Party beyond its core voters. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-22T07:00:00.000+03:00", "crawled": "2018-05-22T08:29:15.001+03:00", "highlightTitle": ""}