{"organizations": [], "uuid": "17d38ed1cbf78518000ec174baf382a582ec03dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article361746.ece/ALTERNATES/s1200/Anne-Marie-Morris-MPppPNG.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/keeping-countrys-streets-clean-cost-1522059", "country": "US", "title": "Keeping the country’s streets clean cost councils £700 million last year", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-02T11:40:00.000+03:00", "replies_count": 0, "uuid": "17d38ed1cbf78518000ec174baf382a582ec03dd"}, "author": "Anne Marie Morris", "url": "https://www.devonlive.com/news/devon-news/keeping-countrys-streets-clean-cost-1522059", "ord_in_thread": 0, "title": "Keeping the country’s streets clean cost councils £700 million last year", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Keeping the country’s streets clean cost councils £700 million last year This is a waste of funds being spent on avoidable litter and could be better spent elsewhere on community services, says Anne Marie Morris MP Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nANNE MARIE MORRIS IS THE CONSERVATIVE MP FOR NEWTON ABBOT AND HAS BEEN SINCE 2010\nThe Government is working to protect and improve our environment within a generation through the 25 Year Environment Plan. The plan aims to deliver cleaner air and water, protect threatened species and habitats, and use resources more sustainably. It sets out a comprehensive and long-term approach to looking after our environment and tackling the scourge of waste plastic that is polluting our countryside and oceans.\nThe Environment Secretary is considering a four point plan to tackle plastic waste. This includes reducing the number of plastics that are in use to make it easier for recycling firms, cutting single-use plastics such as straws and coffee cups, improving the recycling rate and making it easier for families to tell what can be recycled and what has to go in the general rubbish bin. Single use, disposable plastics such as straws and takeaway containers are a waste of resources and a problem for future generations. Anne Marie Morris MP\nHaving banned microbeads and dramatically cut plastic bag use by over 80%, this month the Government announced plans for a deposit return scheme to further crack down on plastic pollution. It is expected to increase recycling rates and slash the amount of waste polluting our land and seas. The UK goes through an estimated 13 billion plastic drinks bottles a year, with billions ending up in landfill or littering our streets, countryside, and beaches. Read More A major opportunity in leaving the EU is withdrawal from the Common Fisheries Policy\nDiscarded food and drink containers make up at least a fifth of rubbish on our beaches. Litter is both left by beach goers and brought in by the tide. During the recent Beach Clean on Dawlish Warren Beach, organised with Surfers Against Sewage, many ‘single use’ plastic items such as bottles, cotton bud sticks, and cutlery were recovered along with thousands of nurdles. Plastic nurdles found on Dawlish Warren beach\nNurdles, nicknamed “mermaids’ tears”, are plastic pellets from which nearly all our plastic goods are made. Whilst the community is aware of nurdles being washed up on the beach, the challenge is locating the source of the pollution. Manufacturers that use plastic need to take greater responsibility and ensure nurdles are not being spilt in their supply chains and ending up polluting the oceans.\nLocally, Dawlish are taking part in the ‘Last Straw Challenge’ in response to a call from the Marine Conservation Society, and almost all restaurants, pubs, takeaways, and cafes are in the process of signing a pledge to ensure that the town is ‘plastic straw free’ by 27 May. Read More Brexit is an opportunity to improve and invest in the skills of our domestic workforce\nOn that date, the Marine Conservation Society will have a stall on the lawn in Dawlish and will be bringing their inflatable monster complete with a waistcoat made from plastic straws supplied by Trail Art in Teignmouth. The local organisation, Dawlish Against Plastic, is also planning to have a stall and this event will run alongside Dawlish Cycle and Heritage Day. Anne Marie Morris MP\nIn a further move to discourage littering and pollution, as part of England’s first ever Litter Strategy launch in Spring last year, Environment Minister Thérèse Coffey has announced a doubling of maximum on-the-spot fines for littering and graffiti. Councils will be able to fine anyone caught dropping litter up to £150 on-the-spot. Read More Many thousands of plastic 'nurdles' have washed up on Dawlish Warren beach\nThe previous maximum penalty was an £80 fine. Councils will also now be able to fine motorists who throw rubbish from their cars onto the roadside for the first time. These powers are part of plans to reduce the amount of rubbish left on our streets. Keeping the country’s streets clean cost local councils almost £700 million last year. This is a waste of funds being spent on avoidable litter and could be better spent elsewhere on community services.\nEveryone can be more mindful and make small changes to reduce their consumption of single use plastics. We can reduce, reuse and recycle to tackle the marine litter problem and make a difference. We live in one of the most beautiful parts of the country and it is important we look after our environment so we can all spend more time outdoors enjoying our beaches and countryside. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-02T11:40:00.000+03:00", "crawled": "2018-05-02T12:08:40.003+03:00", "highlightTitle": ""}