{"organizations": [], "uuid": "c29d8ed9dba2db5435bd0739485045b3f9f36325", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14677116.ece/ALTERNATES/s1200/CFR_NJL_180518fund_01.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/regions-relationship-european-investment-bank-14677064", "country": "GB", "domain_rank": 21960, "title": "Region's relationship with European Investment Bank could continue after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-20T18:00:00.000+03:00", "replies_count": 0, "uuid": "c29d8ed9dba2db5435bd0739485045b3f9f36325"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/regions-relationship-european-investment-bank-14677064", "ord_in_thread": 0, "title": "Region's relationship with European Investment Bank could continue after Brexit", "locations": [], "entities": {"persons": [{"name": "jeremie", "sentiment": "none"}, {"name": "andrew mitchell", "sentiment": "none"}, {"name": "jonathan taylor", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east fund", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "brexit business region", "sentiment": "negative"}, {"name": "european investment bank", "sentiment": "negative"}, {"name": "eib", "sentiment": "negative"}, {"name": "north east fund limited", "sentiment": "none"}, {"name": "crest photography", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Region's relationship with European Investment Bank could continue after Brexit The EIB's vice president has visited the region to help launch a rallying call to businesses to tap into investment opportunities Share Andrew Mitchell, chief executive of The North East Fund Limited (left) and Jonathan Taylor, Vice President of the European Investment Bank (Image: Crest Photography - supplied for free) Share Get business Thank you for subscribing!\nThe North East’s rewarding relationship with the European Investment Bank could continue following Brexit, the bank’s UK vice president has clarified.\nThe European Investment Bank (EIB) has supported transformational investment across the UK since 1973, including providing finance for key regional projects such as Nissan’s car plant and battery production facility, and a £100m loan to Newcastle University to fund building projects.\nAnd this year the bank pledged half of the £120m pot for the North East Fund – also known as Jeremie – a pot of cash with the potential to support 600 firms and create 3,500 jobs, while also generating up to £80m in legacy funds to be ploughed into the region far into the future.\nThe scheme is the second of its kind to receive EIB backing and is managed by the North East Fund Limited (NEFL), delivered through four specialist fund management organisations and made up of five separate funds which are now ready to be accessed by firms.\nThere have been fears this would be the last successful funding collaboration between the North East Fund Ltd and the EIB, as the UK will have broken away from the EU at the end of the fund’s cycle. South Tyneside Council Leader Coun Iain Malcolm, Andrew Griffiths MP, Stephen Hepburn MP and South Tyneside Council Chief Executive Martin Swales at the North East Fund event at Jarrow Hall (Image: TIM RICHARDSON)\nJonathan Taylor, UK vice president of the EIB, however, says that may not be the case.\nHe said: “Not necessarily. The position on that is that the UK continues to be a shareholder of the bank until March next year and, as part of the interim agreement, the UK Government has indicated there could be mutual benefit from a continuing arrangement between the UK and the EIB, and that the UK wishes to explore these possible arrangements in the second phase of negitiations.\n“That will be clarified in the coming months. Beyond that, it’s literally beyond speculation.”\nMr Taylor’s comments followed an event in Jarrow, South Tyneside, to raise awareness of the North East Fund among SMEs alongside Andrew Griffiths MP, Minister for Small Business, as well as Andrew Mitchell, CEO of North East Fund Limited.\nThe event is one of several being held around the region to get the message out of the fund’s benefits.\nWhile a question mark remains over the EIB’s future involvement with the North East Fund, Mr Mitchell says the success of this fund could help to drive the region’s businesses forward in the future, regardless of outside support.\nHe said: “From our perspective, we can’t predict if the EIB will be involved in the UK in five, six years’ time but the best thing we can do locally is to make sure we continue to run this fund well, to find really good companies to invest in, continue to demonstrate that we can make good commercial decisions and that we are able to repay our loan to the EIB.\n“Crucially, as we have in the past, once the bank is repaid we can start to generate legacy money that we can use again in the region because other sources of funding are uncertain.\n“If we were in a position in five years’ time where the EIB were able and willing to get involved in similar funds we would want to make sure that they would want to because the North East has demonstrated yet again the success of these funds.\n“None of us can tell what’s going to happen six months down the road, let alone five years down the road, but we should always plan on the basis that we are in a good position locally to take advantage of whatever opportunities there might be, whatever route that might come through with international organisations such as EIB.\n“Let’s see what happens in five years’ time, but what we can do best is make sure we make a success of what we have in hand.\n“I think this fund is more important than Jeremie 1 - we are conuident we will generate a sizeable legacy. We have the ability if we make a success of the programme to start to generate resources that the region can then use itself to secure the future.”\nHe added: “The fact that the EIB have chosen to put money again into a fund in the North East of England is a good vote of confidence in the North East. It’s a great testament to the North East.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-20T18:00:00.000+03:00", "crawled": "2018-05-20T18:24:58.019+03:00", "highlightTitle": ""}