{"organizations": [], "uuid": "d34e063563c385890f539809cd18203b542b8ba5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14615375.ece/ALTERNATES/s1200/The-Black-Death.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ukip-secretary-compares-party-deadly-14615263", "country": "GB", "domain_rank": 21960, "title": "UKIP secretary compares party to the deadly plague after local election losses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-04T14:15:00.000+03:00", "replies_count": 0, "uuid": "d34e063563c385890f539809cd18203b542b8ba5"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ukip-secretary-compares-party-deadly-14615263", "ord_in_thread": 0, "title": "UKIP secretary compares party to the deadly plague after local election losses", "locations": [], "entities": {"persons": [{"name": "paul oakley", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "news ukip", "sentiment": "negative"}, {"name": "ukip", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News UKIP secretary compares party to the deadly plague after local election losses Paul Oakley said the Black Death plague - which killed millions - had positive outcomes like the Renaissance and led to people starting businesses Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nWhat’s the best way to convince the electorate that your party isn’t dying after it loses almost all of its seats in an election ?\nSome clever political spin? Blame it on a conspiracy? Pretend it never happened?\nAll are (probably) better ideas than comparing your own party to the PLAGUE, which killed millions of Europeans in 14th Century, and then trying to justify the comparison by arguing the pandemic was sort of a good thing. Which is exactly what UKIP general secretary Paul Oakley has done, in the 2018 Local Elections’ best The Thick of It moment so far.\nUKIP shed council seats over night, having lost 44 as of 9am this morning. Many think this could be the end for the party, which has had five leaders since the Brexit vote was secured. Read More Local elections results 2018 LIVE: Newcastle, Gateshead, North Tyneside, South Tyneside and Sunderland results\nHere’s how general secretary Paul Oakley insisted it was not “all over” for the UKIP.\nHe likened UKIP to the plague, or Black Death, which claimed the lives of an estimated 25% to 60% of England’s population in the 14th Century. (Image: GetSurrey)\n“It’s not all over at all,” Mr Oakley told BBC Radio 4’s Today programme.\n“Think of the Black Death in the Middle Ages. It comes along and it causes disruption and then it goes dormant, and that’s exactly what we are going to do. Our time isn’t finished because Brexit is being betrayed.”\nWhen asked if it’s a good idea to compare a political party to a pandemic which wiped out around half of the country, Mr Oakley chose to back himself and double down, by pointing out the Black Death’s apparently positive effects. Read More UKIP collapse as party loses almost every council seat in the local election\nHe said: “It also led to economic growth and the Renaissance. It got rid of the whole issue of servitude, basically, and allowed people to go into the towns and escape their landlords and create their own businesses.”\nMr Oakley said UKIP had been hit by the failure of former leader Henry Bolton to start campaigning early enough and by a court order to pay £175,000 to Labour MPs as a result of a libel case.\n“We were never going to do brilliantly in these elections, we knew that,\" Mr Oakley told BBC.\n\"We accepted that some time ago. If we had the money to campaign, we would have done a lot better. We are never going to take over councils all over the country. Four years ago was our high point.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-04T14:15:00.000+03:00", "crawled": "2018-05-04T17:03:54.003+03:00", "highlightTitle": ""}