{"organizations": [], "uuid": "ef254d9888429189fab0d5a18238652f79f83416", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13911247.ece/ALTERNATES/s1200/Jeremy-Corbyn-visit-to-County-Durham.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-loyalist-laura-pidcock-14620576", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn loyalist Laura Pidcock laughs off criticism of Labour leader following local elections", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-06T07:00:00.000+03:00", "replies_count": 0, "uuid": "ef254d9888429189fab0d5a18238652f79f83416"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-loyalist-laura-pidcock-14620576", "ord_in_thread": 0, "title": "Jeremy Corbyn loyalist Laura Pidcock laughs off criticism of Labour leader following local elections", "locations": [], "entities": {"persons": [{"name": "laura pidcock", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "pidcock", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "windrush", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "tories", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Jeremy Corbyn loyalist Laura Pidcock laughs off criticism of Labour leader following local elections The North West Durham MP says calls for Mr Corbyn to go are 'absurd' as Labour gained seats and the Tories lost seats Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nJeremy Corbyn loyalist Laura Pidcock laughed off criticism of the Labour party leader after the local election results.\nIn the North East the party lost two seats overall while nationally it gained 82.\nIn the region the Conservatives gained two seats while across the country they have 96 fewer councillors.\nHowever, these inroads into a beleaguered party struggling with Brexit, the Windrush scandal and Home Secretary Amber Rudd’s recent resignation are not enough, say Corbyn critics .\nIt has resulted in some demanding he step down while one Labour MP called for an inquiry into the campaign.\nHowever Ms Pidcock , Labour MP for North West Durham, said: “I think we did really well.\n“The campaign was vibrant and we gained seats and the Tories lost seats. How that can be positioned as some kind of defeat is quite absurd to me.” Labour leader Jeremy Corbyn and MP Laura Pidcock (Image: PA)\nReferring to talk of Mr Corbyn standing down because of the results, Ms Pidcock said: “Theresa May went into a general election hoping to get an increased majority. They lost seats and she’s still Prime Minister.\n“This idea that Jeremy Corbyn after having gained seats should not be leader is an unbelievable twist on what has happened in the country.”\nAmong Mr Corbyn’s critics was Tony Blair’s former spin doctor Alastair Campbell who told Radio 4’s Today programme: “We are in mid-term in the middle of these disastrous Brexit negotiations against a Government that is reaching new definitions of incompetence. We should be destroying this Tory party.”\nIt was another critic, Labour MP Chuka Umunna, who said in an interview the party should hold an internal inquiry into the local campaign, warning that the results cannot leave the party confident of success at the next national poll.\nDeputy Labour leader Tom Watson acknowledged the Jewish community had “sent us a message” and said the party had to learn lessons when it came to dealing with anti-Semitism in its own ranks.\nHowever, Mr Corbyn claimed the local election results left Labour “well placed” to win the next general election despite the party’s failure to capture key targets from the Tories. Read More Hundreds armed with flags march through Newcastle for Tyne and Wear May Day rally\nThe mixed set of results left both Labour and the Tories claiming success, with the Conservatives holding on to “crown jewel” authorities in London including Wandsworth.\nFor Labour, despite the ongoing row over anti-Semitism - which may have damaged the effort in key target Barnet, which was won by the Tories - there were signs of progress and analysis suggested the two main parties were neck-and-neck overall in terms of national vote share.\nIn a video message, Mr Corbyn hailed victories in Plymouth and Kirklees, and added: “We have made progress in the places we need to win in the next general election.\n“We are well placed to fight and win the next general election whenever it comes.”\nThe polarisation within British politics was laid bare by an analysis for the BBC conducted by election guru Professor Sir John Curtice. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nVotes in the local elections equated to a 35% share for both Labour and the Conservatives, which could leave Mr Corbyn as the leader of the largest party in a hung parliament if repeated at a general election.\nIn the North East there were 175 seats up for grabs on councils in Newcastle, Gateshead, North Tyneside, South Tyneside, Sunderland and Hartlepool.\nAnd when the results came in on Friday morning, it was almost a case of ‘as you were’ for the main parties.\nOverall. While Labour lost two seats and the Conservatives gained two, there was no change in the number of Lib Dem seats while Independent candidates gained two.\nMeanwhile UKIP lost its two seats in Hartlepool, part of a national collapse of its vote which led its own general secretary to compare the party with the Black Death.\nWhile there was no change in the seats held by the Liberal Democrats in this region, nationally it enjoyed success, ousting the Tories in Richmond upon Thames in south-west London - leader Sir Vince Cable’s back yard - and neighbouring Kingston, while a more unexpected victory came for the party in South Cambridgeshire.\nIn all the party put on an extra 76 seats and gained control of four extra councils.\nFor Theresa May the results came as a relief despite the loss of scores of councillors.\nOn a visit to Wandsworth she praised campaigners’ efforts in seeing off a Labour challenge, saying: “Labour thought they could take control, this was one of their top targets and they threw everything at it, but they failed.” Read More\nThe North East council results:\nNewcastle - 78 seats up for grabs\nLab 56 (+1)", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-06T07:00:00.000+03:00", "crawled": "2018-05-06T08:25:32.006+03:00", "highlightTitle": ""}