{"organizations": [], "uuid": "83bcba2c635419b304dc9fc5879cabc4361aed41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14685924.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-car-dealerships-say-14685855", "country": "GB", "domain_rank": 21960, "title": "North East car dealerships say Brexit woes have hit sales", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-21T16:06:00.000+03:00", "replies_count": 0, "uuid": "83bcba2c635419b304dc9fc5879cabc4361aed41"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-car-dealerships-say-14685855", "ord_in_thread": 0, "title": "North East car dealerships say Brexit woes have hit sales", "locations": [], "entities": {"persons": [{"name": "mike pulman", "sentiment": "negative"}, {"name": "jennings", "sentiment": "negative"}, {"name": "harley davidson", "sentiment": "none"}, {"name": "ian buckle", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "volkswagen", "sentiment": "none"}, {"name": "kia", "sentiment": "none"}, {"name": "share nas khan of jennings motor group", "sentiment": "none"}, {"name": "skoda", "sentiment": "none"}, {"name": "mazda", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "mitsubishi", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East car dealerships say Brexit woes have hit sales Mike Pulman and Jennings both cite Brexit, alongside other factors, that are hitting the UK automotive sector Share Nas Khan of Jennings Motor Group (left) and Mike Pulman director Ian Buckle (right) Share Get business Thank you for subscribing!\nTwo of the North East’s best known car dealers have provided more evidence of a difficult time in the automotive sector.\nDurham’s Mike Pulman and Washington-based Jennings both cited uncertainty around Brexit as one of the main causes for difficult trading in their accounts for 2017.\nMike Pulman - which operates Volkswagen, Seat and Skoda dealerships in Durham and Sunderland - saw turnover fall 5% to £53m while operating profit almost halved to £259,000.\nMeanwhile, Jennings, which has Ford dealerships around the North East and also has Seat, Mazda, Kia, Mitsubishi and Harley Davidson sites, reported a £3.6% rise in turnover to £216.6m and a 9% increase in operating profit to £1.6m.\nJennings said it had cancelled plans for a new dealership in Stockton due to uncertainty in the market.\nThe automotive sector has been experiencing turbulence as a combination of factors, especially doubts over the future of diesel vehicles and a squeeze on consumer spending, have hit sales. Read More Night on the town inspires Wallsend firm to sell 'kinky boots' to drag queens\nJennings’ CEO Nas Khan said “there was a feeling the market was beginning to tighten”, with more challenging targets to achieve sales necessary for bonus payments from manufacturers.\nHe added: “We have decided not to go ahead with the Stockton development as a Ford store. As in my report last year, due to the uncertainty caused by Brexit, diesel cars, the slow-down of the new market etc, we did not feel that spending close to £6m was the right thing to do.\n“The plan now is to refurbish Stockton at a cost of £1m in order to meet all standards for retail look and style. This work should commence during October/November 2018. There are no other developments planned for 2018.”\nJennings increased staff numbers over the accounting period, from 470 to 519, with the biggest rise in mechanics. Read More AIS Training targeting major growth after 'multimillion pound' investment\nIn its accounts, Mike Pulman director Ian Buckle pointed to slow growth in the UK as a factor in the company’s sales fall.\nHe said: “It was generally accepted that the market for new cars shrunk somewhere between 4% and 8% in 2017. Subsequent oversupply and shrinking consumer spending power led to a squeeze on margins in the second half which, married with targets which became unrealistic, spoiled what had begun as a very positive year.”\nMr Buckle said “it remains hard to understand the logic of leaving the EU” and added that the first quarter of 2018 had seen shrinking demand and manufacturers selling more in the Eurozone, where returns are higher. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-21T16:06:00.000+03:00", "crawled": "2018-05-21T18:04:20.000+03:00", "highlightTitle": ""}