{"organizations": [], "uuid": "adbdbc2d2f03bcccecc3c6b3a803295e4a2a0c3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article316104.ece/ALTERNATES/s1200/Ben-BradshawJPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/tory-mps-anything-avoid-election-1599640", "country": "GB", "title": "Tory MPs will do anything to avoid an election because they don’t want a Labour Government", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-23T15:05:00.000+03:00", "replies_count": 0, "uuid": "adbdbc2d2f03bcccecc3c6b3a803295e4a2a0c3e"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/news-opinion/tory-mps-anything-avoid-election-1599640", "ord_in_thread": 0, "title": "Tory MPs will do anything to avoid an election because they don’t want a Labour Government", "locations": [], "entities": {"persons": [{"name": "brexiteers boris johnson", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "jacob rees mogg", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "eu refe", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "labour government news", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Tory MPs will do anything to avoid an election because they don’t want a Labour Government Ben Bradshaw MP says there’s still a long way to go in this damaging Brexit saga and is getting an increasing postbag over the handling of Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nBEN BRADSHAW IS THE LABOUR MP FOR EXETER AND HAS BEEN SINCE 1997\nThe governor of the Bank of England told MPs this week that households are at least £900 a year worse off and the economy £40 billion smaller as a result of the Brexit vote.\nMark Carney said the economy is two percent lower than it would have been and has been damaged by uncertainty, which has deterred business investment, and inflation, which has squeezed household incomes.\nHis comments were immediately rubbished by Conservative hard Brexiteers Boris Johnson and Jacob Rees Mogg. The Chancellor, Philip Hammond, however, did not contest them. Ben Bradshaw MP\nWe are nearly two years on from the EU Referendum with less than a year to go before we are scheduled to leave. But we still don’t know what the Government actually wants. Mr Rees Mogg described Mrs May’s preferred “Customs Partnership” idea as “cretinous”. Mr Johnson said it was “crazy”. Read More There will be no hard border between the north and south in Ireland\nMeanwhile, I’m getting an ever growing postbag from Exeter businesses and other organisations worried about the Government’s handling of Brexit.\nExeter Federation of Small Businesses tells me their most pressing problem is the worsening labour shortage. Exeter’s neighbouring Conservative MP, Neil Parish, has warned of a serious shortage of seasonal workers from Eastern Europe to pick crops. Marsh Barton car dealerships, local florists and other business who rely on the quick and easy flow of goods or services are worried about new trade barriers. Green groups and health organisations fear the watering down of existing environmental and food safety laws. The Royal College of Nursing is so worried about the staffing crisis in the NHS and Social Care that it has called for a Referendum on the terms of any Brexit deal. Ben Bradshaw after increasing his majority in May\nVery soon Mrs May will have to spell out what she wants. If she caves in to the hard Brexiteers, she won’t get her deal through the Commons. If she faces them down, they have threatened to get rid of her and even force another general election. Read More No surprise that record numbers of European nurses and midwives are quitting Britain\nThey’re bluffing. Tory MPs will do anything to avoid an election because they don’t want a Labour Government. And, if Mrs May were ousted by a hard Brexiteer, her successor would find it even harder to assemble a Commons majority to get a hard Brexit through.\nHowever, that does not mean the Government is out of the woods. It could well lose important votes in the next few weeks on a Customs Union and other parts of its Brexit legislation. Then there’ll be the all-important crunch vote on any deal, supposedly in the autumn, although there are reports that the Government might try to delay this to the New Year. If the Government loses that vote, all bets are off. There’s still a long way to go in this damaging Brexit saga, I’m afraid.\nExeter City have sold more than 9,000 tickets for Monday's play-off final (Image: Pinnacle) Read More As Exeter City prepare to meet Coventry City, is it time to move the League Two play-off final from Wembley?\nOn a happier note, very best of luck to Exeter Chiefs as they defend their Premiership Rugby title on Saturday and to Exeter City for next Monday’s Play-Off Final at Wembley. Both teams have done our city proud again this year and we’ll all be rooting for you. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-23T15:05:00.000+03:00", "crawled": "2018-05-23T15:23:54.006+03:00", "highlightTitle": ""}