{"organizations": [], "uuid": "4553e238affcf28f91f21a783427b0a02664c5d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1564397.ece/ALTERNATES/s1200/jgjghkgghkJPG.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/killer-dennis-nilsen-penned-final-1564177", "country": "US", "title": "Killer Dennis Nilsen penned 'final letter' to Devon man before death - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-05-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "4553e238affcf28f91f21a783427b0a02664c5d2"}, "author": "Paul Greaves", "url": "https://www.devonlive.com/news/devon-news/killer-dennis-nilsen-penned-final-1564177", "ord_in_thread": 0, "title": "Killer Dennis Nilsen penned 'final letter' to Devon man before death - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon live news killer dennis nilsen", "sentiment": "none"}, {"name": "killer dennis nilsen", "sentiment": "none"}, {"name": "george bamby-salvador", "sentiment": "none"}, {"name": "dennis nilsen", "sentiment": "none"}, {"name": "charles bronson salvador", "sentiment": "none"}, {"name": "nilsen", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}], "organizations": [{"name": "invalid email a paignton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Killer Dennis Nilsen penned 'final letter' to Devon man before death The note signed in what appears to be ‘Den’ Nilsen’s signature and he talks of his links to the Westcountry Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA Paignton man claims he was sent the final letter written by serial killer Dennis Nilsen before his death in prison – and he’s put it on public display at his crime museum.\nGeorge Bamby-Salvador says he entered into a correspondence with ‘lunatic’ Nilsen after the murderer found out he was the son of notorious prisoner Charles Bronson Salvador.\nIn the letter Nilsen writes about his links to the Westcountry, in particular the time he spent in the army on Dartmoor and a friendship he made with a Paignton man. Read More 'Honeycomb of caves' fears under Torbay's main seafront road after storm collapse\nThe note is signed in what appears to be ‘Den’ Nilsen’s signature and also contains a long verse ‘poem’, nostalgic memories of the area, seagulls, the decline of the fishing industry, and even Brexit.\nNilsen says in the letter: “As a boy soldier in the early 1960s I spent three Summer Camps at Fort Tregantal in Cornwall and also completed ‘exercises’ in Devon [usually on Dartmoor where I often route-marched past the prison, but didn’t go in]. Nilsen letter\n“Later, in 1968-69 I was posted, with the Argyll and Sutherland Highlanders, to Plymouth at Seaton Barracks in Crownhill, after I had returned from Aden in South Yemen where a rebellion had just ended with its independence.”\nHe goes on to reminisce about serving as a boy soldier with ‘a couple of West Country lads’ and ‘one comrade having been from Paignton itself.\n“I grew fond of the ambiance of the West Country character in all my 11 years in the army.”\nThe letter then makes light-hearted remarks about seagulls ‘bombing’ tourists and helpful advice to ‘city folk’ to hold on to their pasties.\nHe even leaves room at the end for a cryptic reference to Brexit – his views on the issue appearing to favour withdrawal and a Francis Drake inspired response. George Bamby and Charles Bronson\nThere is little in the letter to link its mild mannered tone to the exploits of the notorious killer who murdered at least 15 men between 1978 and 1983. Nilsen’s grisly exploits included luring victims to his flat, strangling or drowning them, and finally keeping the bodies for extended periods of time before dissecting them.\nHe was serving a life term in prison when he died on Saturday.\nGeorge says the letter is 100 per cent genuine.\nHe says it came about because of a TV appearance he made in January claiming to be the son of Charles Bronson Salvador – another notorious prisoner once dubbed the most dangerous man in Britain. Read More\nGeorge says Nilsen contacted him out of the blue after hearing the news and over the several months the pair exchanged about eight letters.\nThe final one is dated February 28, 2018.\nGeorge says the letter is extremely rare because Nilsen was not known to share his thoughts freely with many people.\nIt is now on public display at the George’s Real Crime Museum in Torquay. Crime Museum Torquay\nHe said: “At the end of the day he was a murderer, necrophile and complete lunatic and there is no hiding from that but with my interest in crime to be able to communicate directly with probably the most infamous serial killer was a fascinating experience. Read More\n“When he sent a letter I replied because I just wanted to find out a little bit more about him. He mentions his links to Plymouth and I wanted to know who his friend was in Paignton.”\nGeorge says Nilsen reveals more about his crimes in other letters.\n“He tried to portray to me that what he did was just that – something he did – and he didn’t mean anything by it. It was really peculiar and he is almost blasé about it. It was like me or you just explaining about going out to the cinema or down the pub.”\nGeorge says the letter gave little indication Nilsen was dying. He says he did mention a stomach complaint and not being able to write for a while but nothing to indicate it was terminal.\nThe Real Crime Museum was opened in Torquay about three months ago and is located at Torquay harbour. Like us on Facebook ", "external_links": [], "published": "2018-05-14T03:00:00.000+03:00", "crawled": "2018-05-14T13:58:51.054+03:00", "highlightTitle": ""}