{"organizations": [], "uuid": "26e18ec619864bda0c32380907c50dc9925b023d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14692378.ece/ALTERNATES/s1200/CFR_NJL_220518tea_02.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-alcoholic-tea-firm-noveltea-14692255", "country": "GB", "domain_rank": 21960, "title": "Newcastle alcoholic tea firm Noveltea named one of the hottest startups in the UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-22T18:51:00.000+03:00", "replies_count": 0, "uuid": "26e18ec619864bda0c32380907c50dc9925b023d"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-alcoholic-tea-firm-noveltea-14692255", "ord_in_thread": 0, "title": "Newcastle alcoholic tea firm Noveltea named one of the hottest startups in the UK", "locations": [], "entities": {"persons": [{"name": "vincent efferoth", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "lukas passia", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "asia share lukas passia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "noveltea", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "invalid email boozy", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle alcoholic tea firm Noveltea named one of the hottest startups in the UK The firm has also been named as one of the most innovative products in Europe at a top trade fair in Asia Share Lukas Passia and Vincent Efferoth, second and third left, are named in the Startups 100 index (Image: Noveltea) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBoozy beverage firm Noveltea has toasted two wins in a week after being named as one of the most innovative firms in Europe, and making a list of the hottest UK startups of 2018.\nNewcastle University pals Vincent Efferoth and Lukas Passia have been serving up a modern twist on how to take tea through their creation Noveltea - alcoholic brews of tea, infused with gin and rum.\nThe pair both originally come from Germany, but have settled in the North East to launch their business after being set on their business path by the British fascination for craft beers, spirits and afternoon tea traditions.\nNow the brand has become the only British name to scoop a Sial innovation award in Shanghai, which saw their unique blend of cold-brewed tea infused with spirit presented as the most innovative product from Europe.\nThe product triumphed in a competition where more than 600 brands competed at the world’s third largest food and drink trade show. Noveltea co-founder Vincent Efferoth, centre, at the Sial Shanghai event (Image: Noveltea)\nFor 2018, Sial China received a record number of submissions from brands vying for the awards. Of these, only the top 10, which included Noveltea, were shortlisted and awarded by a panel of industry experts and representatives from XTC World Innovation.\nNoveltea, which launched their first two products The Tale of Earl Grey and The Tale of Tangier in April 2017, scooped the bronze award, placing them as the only UK brand to be shortlisted at the finalist ceremony.\nJudges praised the product for being “worldwide unique”.\nMr Efferoth said: “Noveltea presents a versatile and unusual option for consumers looking to enjoy a different tasting experience and we are delighted that our creation has been recognised at such a high-profile event.”\nIn recognition of their award, Noveltea will be showcased across all Sial trade shows in Brazil, Canada, Philippines, Abu Dhabi and Paris, opening up opportunities for overseas trade.\nThe award comes at the same time as the business was named in a list of the hottest startups of 2018. The company was the sole North East entry in the Startups 100 list, coming in at number 98.\nRun by Startups.co.uk and sponsored by global marketing company DCMN, the list shines a light on emerging businesses which demonstrate innovation, solid financials, economic impact and the ability to scale.\nThe longest running annual index of its kind, the Startups 100 has previously identified up and coming businesses like BrewDog, Moshi Monsters, Purplebricks, and Deliveroo.\nStartups.co.uk projects editor Megan Dunsby said: “Every year The Startups 100 index shines a light on the game-changing new businesses shaping new innovations, products and services while simultaneously helping to drive the economy.\n“Even in an uncertain climate with Brexit and GDPR considerations, these start-ups are flourishing with big plans for growth over the next 12 months. The UK’s entrepreneurial landscape is thriving, as evidenced by the Startups 100 2018.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-22T18:51:00.000+03:00", "crawled": "2018-05-23T00:41:56.029+03:00", "highlightTitle": ""}