{"organizations": [], "uuid": "44fe8a99a85041fc11ef85af03903069614c88ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13157105.ece/ALTERNATES/s1200/collage-today.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/local-news/dogs-polling-stations-generalelection-newcastle-12986578", "country": "GB", "domain_rank": 21960, "title": "Your dogs at polling stations photos from Newcastle & the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-03T09:13:00.000+03:00", "replies_count": 0, "uuid": "44fe8a99a85041fc11ef85af03903069614c88ca"}, "author": "Lesley Oldfield", "url": "https://www.chroniclelive.co.uk/news/local-news/dogs-polling-stations-generalelection-newcastle-12986578", "ord_in_thread": 0, "title": "Your dogs at polling stations photos from Newcastle & the North East", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle & the north east news your", "sentiment": "negative"}, {"name": "electoral commision", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Your dogs at polling stations photos from Newcastle & the North East It's become an election tradition on Twitter to snap patient dogs waiting outside polling stations for owners to vote Share Readers' photographs of their dogs at polling stations in the North East Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nPolling days now have a lighter side thank to the Twitter hashtag #dogsatpollingstations which often trends all day on election days.\nWe always ask readers to send in photographs of their dogs at a polling stations and have created a gallery of all those patient pooches for dog lovers to enjoy. Our thanks to all taking part!\nBut did you know that in Newcastle you can actually take your dog into the polling station with you? Though you can't take your photo inside!\nA spokesman for Newcastle City Council said: \"As long as the dog is on a lead or under control there's no issue.\" View gallery\nA spokeswoman for the Electoral Commision, said: \"It's the decision of the acting returning officer. If the building rules say no, then it's no. But they might say no due to possible distraction or possible destruction of ballot papers. Most say no.\" Read More\nHere are the hounds snapped by owners casting their votes at the local elections last May. Weimaraner Murphy waits in North Tyneside below. Owner Sarah Jeffery tweeted: \"Murphy wasn't very keen on voting\" #dogsatpollingstations (Image: UGC TNE)\nAnd Alan Patrickson tweeted: \"Rusty goes early at Durham\" #dogsatpollingstations \"An important day for many communities up and down the country, yes, it's #dogsatpollingstations day.\" (Image: UGC TNE)\nMark Grant took his dog Millie with him in Prudhoe. \"Millie at Prudhoe!\" Sent in by Mark Grant (Image: UGC TNE)\nBabsi took Oscar with her when she went to vote. \"This is Oscar at Hunwick Primary School. He came to vote with me.\" Sent in by Babsi (Image: UGC TNE)\nMac the Bedlington Terrier went to support Fiona when she voted. \"This is Mac the Bedlington Terrier at Shanklea School polling station, Cramlington.\" Sent in by Fiona (Image: UGC TNE) Read More\nThe hashtag also trended during the EU referendum, when Mary Shaw was among the first in the region to tweet from Gosforth’s All Saints Church Hall polling station in Newcastle. Read More\nSolicitor Mary said: “Marv the Lurcher was up early today and got a warm welcome. His full name is MarvIN ...” Marv the lurcher tweeted by Mary Shaw from Gosforth on the hashtag #dogsatpollingstations\nOn that day, at least they had a nice sunny day to be waiting outside. Mind you, Marv got a great welcome inside too!\nHere's Finn. Vicki Deritis @Cutofherjib tweeted: \"Finn is worried about what Brexit could mean for both the economy and his EU pet passport.\" #dogsatpollingstations Vicki Deritis @Cutofherjib tweeted: \"FINn is worried about what Brexit could mean for both the economy and his EU pet passport.\"\nAnd Mito was out too, as you can see. Owner Laura Johnson @laurathwench tweeted: \"Mito helping me vote in sunny Stanley.\" Laura Johnson @laurathwench tweeted: \"Mito helping me vote in sunny Stanley.\"\nRobin Son said: \"Drax has just been and had his say in Heaton.\" Voter Robin Son @geekuneek took Drax along\nPaul Graham @PaulGrahamPharm said: \"Ahh, thank goodness they've voted and we can relax.\" Paul Graham's dog has done his bit for #dogsatpollingstations Follow us on Twitter @chroniclelive - the official Chronicle Twitter account - real news in real time.\nWe’re also on Facebook/NewcastleChronicle - your must-see news, features, videos and pictures throughout the day from the Chronicle Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://www.facebook.com/NewcastleChronicle", "https://twitter.com/ChronicleLive"], "published": "2018-05-03T09:13:00.000+03:00", "crawled": "2018-05-03T16:22:02.008+03:00", "highlightTitle": ""}