{"organizations": [], "uuid": "cee3d6571fc32e148528d9bafc7d453874519891", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article8666086.ece/ALTERNATES/s1200/JS54851628.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14653498", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: British Gas owner loses 110,000 customers in four months amid competition", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-14T10:30:00.000+03:00", "replies_count": 0, "uuid": "cee3d6571fc32e148528d9bafc7d453874519891"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14653498", "ord_in_thread": 0, "title": "Business Breakfast LIVE: British Gas owner loses 110,000 customers in four months amid competition", "locations": [], "entities": {"persons": [{"name": "lawrie", "sentiment": "none"}, {"name": "lawrie barratt", "sentiment": "none"}, {"name": "lewis greensitt", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "darras hall", "sentiment": "none"}, {"name": "ponteland", "sentiment": "none"}], "organizations": [{"name": "barratt developments", "sentiment": "none"}, {"name": "greensitt brothers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "One of the region’s best-known businesses is celebrating its 60th anniversary .\n was formed by Sir Lawrie Barratt in 1958 and has grown to become the UK’s largest housebuilder, constructing more than 17,300 homes last year.\nThe company – originally called Greensitt Brothers, from a partnership with local builder Lewis Greensitt – grew out of a project in which Sir Lawrie built his own home.\nHaving left school at 14 with no qualifications, he became an accountant and worked hard to save £1,000 to enable him to buy five acres of land at Darras Hall.\nWith little knowledge of the building industry he built his own four-bedroom detached house and found the project to be satisfying, creative – and also profitable, with the house being valued at £3,000 when completed.\nWith money earned from the sale of that first house, Sir Lawrie built two more houses nearby to sell and then moved into larger-scale development, building the Parklands estate in Ponteland.\nAs continued to grow it expanded across the North and into Scotland, as well as into the South, where he saw the company have a national impact on the accessibility of homes for first-time buyers.\nAs he had struggled to buy his first home in 1953, he wanted to make the house-buying process as affordable and easy as possible for those looking to get on the property ladder. To strengthen its ability to help buyers in the UK, the introduction of the a part-exchange scheme in 1971 set Barratt apart from any other housebuilder. The house that Sir Lawrie Barratt built at Darras Hall (Image: Barratt) 8.55 Coreena Ford Newcastle Startup Week: Eight events you must not miss\nThe second Newcastle Startup Week is springing into life, unleashing five days and nights of inspiring discussion and networking.\nOrganised by Plan Digital founder Paul Lancaster, the festival of innovation and entrepreneurship will take place in a range of venues – including The Boiler Shop and The Core – and is expected to receive its biggest ever crowd, with ticket buyers coming from as far afield as France, Ghana and the US.\nNewcastle’s Nebula Labs has designed a free app which showcases all the events and speaker schedules, called simply Newcastle Startup Week, but here’s eight of the key events delegates won’t want to miss : Launch of last year's Newcastle Startup Week at The Boiler Shop (Image: Trinity Mirror) 8.53 Coreena Ford Church of England's £8.3bn investment fund falls short\nThe Church of England’s £8.3 billion investment fund fell short of targets last year as it was stung by the recovery in sterling against the dollar.\nAccording to the latest financial report from the Church Commissioners, the body which manages the Church of England’s assets, figures show a total return on investments in 2017 of 7.1%.\nIt represents a sharp fall on last year’s 17.1% and below its 9.1% target.\nThe Commissioners said that while buoyant equity markets helped the fund - which booked returns of 15.9% - other areas faced challenges.\n“Fixed income markets were more challenged; yield curves flattened as shorter maturity bond yields rose.\n“Another important dynamic in 2017 was the recovery in sterling, mainly against the US dollar, following the collapse in 2016.\n“This was a headwind for all our US dollar-based strategies and had a material impact on our overall return in the multi-asset strategies, private equity and private credit.”\nIn 2017, non-pension support for the Church by the Commissioners totalled £144 million, up from £108.5m. Overall expenditure was at £226.2m, down from last year due to lower pensions obligations.\nFirst Church Estates Commissioner Loretta Minghella said: “The macro economic environment is changing and anticipating muted returns in the future we will continue to develop our focus on non-traditional asset classes.\n“Our perpetual endowment and long-term horizon is well suited to maximising returns from less liquid markets including venture capital.” 8.47 Coreena Ford Smiggle boss laments UK 'ghost towns'\nAustralian stationery retailer Smiggle reported soaring UK sales and profits last year, but the group’s chief executive has bemoaned the wider turmoil on Britain’s high streets for creating “ghost towns”.\nThe company’s British arm posted a 92% increase in revenues to £55.7m in the year to July 2017, according to accounts filed at Companies House.\nPre-tax profit rose from £3.8m to £10.8m, with Smiggle’s group managing director John Cheston lauding the firm’s online performance.\nHe said: “We’ve seen incredible growth online, something we didn’t anticipate, which has been driving sales.\n“It’s not easy, we’ve had to work bloody hard.”\nThe group has around 130 UK outlets, including four in the North East in Newcastle, the Metrocentre, Durham and Sunderland, and it had been targeting 200 stores as part of efforts to hit 200 million Australian dollars (£112m) in revenue by 2019.\nHowever, Mr Cheston said Smiggle may now not need that many, partly because of the growth of online sales.\nHe also flagged the recent spate of store closures on Britain’s high streets through Company Voluntary Arrangements (CVA), a form of insolvency that allows retailers to shut loss-making outlets.\nSeveral retailers - including New Look, Carpetright, Prezzo, Byron and Jamie’s Italian - have undertaken the process this year, with more on the way.\nCVAs, along with the administrations of Toys R Us and Maplin, have left in their wake hundreds of vacant properties on the high street, as well as a devastating trail of job losses.\nMr Cheston said: “CVAs are creating ghost towns, there is a real sentiment issue in UK retail, you have Brexit, macro issues and political uncertainty.\n“We are in some respects immune, but not completely immune.\n“We’re a pocket money business and if parents are cutting back on spending, then it has an impact on us too.” A Smiggle store packed with goodies 8.42 KEY EVENT Petards completes acquisition of RTS\nGateshead tech firm Petards has acquired a specialist software firm in Leeds in a deal worth up to £2.1m.\nThe Aim-listed firm, which develops advanced security and surveillance systems, has snapped up the entire issued share capital of RTS Solutions (Holdings) Limited and RTS Solutions (UK) Limited, a transportation software engineering company.\nRTS’ main clients are currently Network Rail and its Tier 1 contractors and last year it generated revenues of £778,000 and reported a profit before tax of £262,000.\nPetards said the business is debt free and has a history of excellent cash generation and that the acquisition comprises an initial cash payment of £1m and deferred consideration of up to £500,000, conditional upon RTS meeting certain financial and other targets during the 12 months ending 31 March 2019.\nA payment of £600,000 will also be made on a pound for pound basis for surplus cash in RTS’s balance sheet.\nRTS will operate as an independent company within the Petards Group from its offices at Holbeck Rail Depot in Leeds and all staff will be retained within the business as part of the acquisition.\nIn a stock market announcement, Petards directors said they believe that the acquisition will strengthen the group’s software solutions offering and that it will provide the Group with an entry into the UK rail infrastructure market complementing the group’s existing eyeTrain on-board train systems\nRaschid Abdullah, Petards Chairman said:\n“We are delighted to welcome RTS and its staff to the Petards Group and look forward to working with them to further develop and grow its business. This acquisition marks a further step in the broadening of the Group’s portfolio of products, providing the opportunity to expand its earnings and enhance shareholder value.” The Petards factory in Team Valley (Image: Google maps) 8.36 Coreena Ford Dignity posts strong first quarter results\nRevenue at funerals firm Dignity nudged up in the first quarter, helped by a higher death rate and a better-than-expected take-up of premium services.\nThe under-pressure group, which has been embroiled in a price war, booked sales of £95.1m in the 13 weeks to March 30, up from £93.3m last year.\nDignity reported earnings of £37.5m, in line with the previous year, but well ahead of what the board had pencilled in.\nThe figures come as the absolute number of deaths increased by 8% to 181,000, with Dignity forecasting that the full year will record “at least” the same number of deaths as last year, which was 590,000.\nEarlier in 2018, Dignity warned that it was seeing lower-than-expected take-up of its “no frills” funeral option, despite slashing prices.\nBut the firm has since said that “simple funerals” only account for 15% of all funerals, lower than the 20% originally anticipated, indicating demand is still strong for its premium option.\nThe firm performed a total of 21,400 funerals in the quarter, up from 20,100.\nBut chief executive Mike McCollum struck a cautious note.\nWhile the first quarter produced a much stronger result than we had anticipated when implementing the price changes in January, the current year is all about completing our review of our funeral business and ensuring we provide the excellent service our clients expect from us. 8.30 KEY EVENT British Gas owner loses 110,000 customers in four months\nBritish Gas owner Centrica lost more than 100,000 accounts in the first four months of the year as increased competition continues to see customers desert bigger energy firms.\nCentrica revealed it lost a total of 110,000 UK energy supply accounts in the period, partly due to what it called “competitive intensity”.\nHowever, the company claimed that “net consumer customer account losses” in the year to date “slowed materially”, relative to the average over 2017.\nThe group also saw increased demand for energy during the cold snap brought on by the Beast from the East.\nIn a trading update, the group said that “colder than normal weather has increased energy demand”.\nThe cold snap in February and March saw an “exceptionally” high number of central heating boiler breakdowns, with British Gas fixing 145,000 breakdowns in one week.\nIt was the firm’s busiest week ever, and the cold weather also contributed to an increase in services customer complaints.\nCentrica boss Iain Conn said: “2018 has begun well and overall financial performance in the year to date has been good, despite high competitive intensity in all our markets.\n“Our customers continue to see new products and propositions and stable service levels, other than in UK Home Services, which was impacted by extreme weather.”\nAdditional call-out costs due to the cold weather will also result in a hit to adjusted operating profit for UK services in the first half, which are set to come in lower than the same period last year.\nMr Conn added that the firm is making good progress on its cost-cutting programme.\nEarlier this year Centrica said it would axe 4,000 roles under a ramped-up efficiency programme following a 17% drop in annual profits. The group confirmed that the majority of the cuts will affect both its UK home and business units over the next three years, as it looks to meet a higher cost-cutting target of £1.25bn per year by 2020.\nIt comes as the energy market prepares for a government-enforced price cap set to be introduced on standard variable tariffs (SVTs) later this year amid anger over rising bills. (Image: PA)", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14653498;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-05-14T10:30:00.000+03:00", "crawled": "2018-05-14T11:46:34.007+03:00", "highlightTitle": ""}