{"organizations": [], "uuid": "758914cb16312a1dbe08533a58e60aa2aed9d012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14640136.ece/ALTERNATES/s1200/House-of-Fraser-future.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/house-fraser-reports-44m-loss-14640024", "country": "GB", "domain_rank": 21960, "title": "House of Fraser reports £44m loss as troubles mount for department store chain", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T16:08:00.000+03:00", "replies_count": 0, "uuid": "758914cb16312a1dbe08533a58e60aa2aed9d012"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/house-fraser-reports-44m-loss-14640024", "ord_in_thread": 0, "title": "House of Fraser reports £44m loss as troubles mount for department store chain", "locations": [], "entities": {"persons": [{"name": "house of fraser", "sentiment": "negative"}, {"name": "fraser", "sentiment": "none"}], "locations": [{"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "gateshead metrocentre", "sentiment": "none"}], "organizations": [{"name": "house of fraser", "sentiment": "negative"}, {"name": "hamleys", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "House of Fraser reports £44m loss as troubles mount for department store chain The company, which has a major store in the Gateshead Metrocentre, is considering a closure programme Share A House of Fraser store (Image: PA) Share Get business Thank you for subscribing! Could\nHouse of Fraser swung to a staggering £43.9m loss in 2017 as Brexit , terrorist attacks and increased online competition took its toll on the beleaguered British department store.\nFigures released as part of a takeover of the firm by C.Banner, the owner of Hamleys, also show the retailer’s sales fell from £840.9m to £787.8m, a drop of 6.3%.\nThe pre-tax loss for the twelve months to December 31 2017 compares to a profit of £1.5m the year before.\n“The Brexit referendum and the UK’s resultant decision to leave the European Union and the terrorist attack in London, combined with a rapidly evolving retail market, produced a period of uncertainty and volatility that resulted in a difficult trading environment for the whole retail industry in the UK,” C.Banner said.\nThe losses come at a perilous time for House of Fraser and its Chinese owner Sanpower.\nIn a desperate bid to save the business, Sanpower is selling a majority stake in the business while pursuing store closures.\nThe chain has stores in the Metrocentre and at Middlesbrough and Darlington , but has now said which it is looking to close.\nHouse of Fraser is also in dispute with Mike Ashley’s Sports Direct, which owns an 11% stake but is taking court action over allegations that is being denied information about its corporate plan.\nC.Banner is taking a 51% stake in the group by acquiring shares in Sanpower affiliate Nanjing Cenbest and subscribing to new shares as part of an investment in the business.\nC.Banner is spending a total £141m to complete the acquisition, according to calculations based on a Hong Kong stock exchange release.\nDespite the poor financial showing, C.Banner said House of Fraser would become “more stable” when it completed its restructuring plan, the details of which will be released in June.\n“Nevertheless, the directors believe that as a leading department store chain in the UK, the target group will be able to take advantage of its well-known brand to capture growth potential,” the firm said.\nThe retailer, which has 59 department stores, is struggling under the cost of its property portfolio.\nIt rents 4.4m square feet of retail space, and is stuck in long-term leases, with the average remaining lease life on its stores standing at 29 years.\nC.Banner is hoping a tie-up with House of Fraser will create cost savings in its footwear and toys businesses, as well as in back-office functions such as IT.\nHouse of Fraser and Hamleys could also negotiate better deals with suppliers, and widen their appeal with high-income customers, C.Banner said.\nThe Chinese retailer also said the acquisition could open up opportunities to buy other brands, and form strategic links with other retailers. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-10T16:08:00.000+03:00", "crawled": "2018-05-10T19:06:48.018+03:00", "highlightTitle": ""}