{"organizations": [], "uuid": "a38a4ec58ddfae2bb2079ff12503eec42daf8128", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1311581.ece/ALTERNATES/s1200/Neil-ParishJPG.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/its-really-important-food-farming-1554323", "country": "US", "title": "It’s really important that food and farming are not left by the wayside", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T19:04:00.000+03:00", "replies_count": 0, "uuid": "a38a4ec58ddfae2bb2079ff12503eec42daf8128"}, "author": "Neil Parish", "url": "https://www.devonlive.com/news/news-opinion/its-really-important-food-farming-1554323", "ord_in_thread": 0, "title": "It’s really important that food and farming are not left by the wayside", "locations": [], "entities": {"persons": [], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion It’s really important that food and farming are not left by the wayside Neil Parish MP says he will fight to make sure that food, farming and the environment will be at the centre of our new farming policy Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010\nThe May Day bank holiday weekend was one of the hottest in 40 years. It showed all of us and our beautiful country in our finest light.\nAnd with the heat of the bank holiday, it was great to see Britain come to life again. I saw all sorts of wildlife. But it was great to see bees out in force. Pollinators play such an important part in looking after our environment. Without them, plants would not be able to reproduce. And without plants, we would not have the Great British countryside.\nThat’s why any measures which enhance are environment should be welcomed. But I believe it’s really important that food and farming are not left by the wayside. Neil Parish MP\nThere were over 44,000 responses to the Government’s consultation on the Agricultural Command Paper (“Health and Harmony: the future for farming and the environment in a Green Brexit”). I consider this to be a disappointingly low number. It’s especially low when you consider this is the first time in 40 years the Government has ever been able to consult on farming policy. It is upsetting that more people simply refuse to take an active interest in looking after our beautiful countryside or having a say on where their food comes from. Read More A deposit return scheme will encourage more people than ever to recycle\nIn the Agricultural Command Paper, the Government pledged to put environment at the centre of farming. But this is a total contradiction. Food and food production must be at the centre of any farming policy. In ensuring that we can produce food, the Government can also ensure that the environment is protected. Yet food security was not mentioned once in the consultation.\nFarmers are the stewards of our countryside. They are its fiercest protectors. And they know that in order to get the best out of their land, they need to look after it. This includes making sure there are insects and other animals which can pollinate and look after soil health. Neil Parish\nBut they also feed us. Farmers make sure we have access to delicious and nutritious food 12 months of the year. From turkeys at Christmas time through to strawberries in the summer. And it’s a tough job too. I would know – I used to be a farmer. Yet they receive very little thanks for the work they do in looking after us and our countryside. Read More We need to fix our broken housing market\nThat is why I want to make a pledge to you. I will fight to make sure that food, farming and the environment will be at the centre of our new farming policy. As part of this pledge, the Environment, Food and Rural Affairs Select Committee, which I chair, has just closed an inquiry into the Command Paper.\nYou can watch this space for our findings. In the meantime, mind your bees and peas. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-10T19:04:00.000+03:00", "crawled": "2018-05-10T19:10:31.049+03:00", "highlightTitle": ""}