{"organizations": [], "uuid": "52e6abd98c6ac27cb4069a394da4bdad7ad2feb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1575169.ece/ALTERNATES/s1200/Link-Road-main-image.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/government-announce-83m-improve-notorious-1573911", "country": "US", "title": "One of Devon's most dangerous roads is about to get a massive £83m upgrade", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-17T02:01:00.000+03:00", "replies_count": 0, "uuid": "52e6abd98c6ac27cb4069a394da4bdad7ad2feb0"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/government-announce-83m-improve-notorious-1573911", "ord_in_thread": 0, "title": "One of Devon's most dangerous roads is about to get a massive £83m upgrade", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "south molton", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "bideford", "sentiment": "none"}, {"name": "north devon link road", "sentiment": "none"}], "organizations": [{"name": "transport", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News One of Devon's most dangerous roads is about to get a massive £93m upgrade \"The extra lane will help provide safer overtaking opportunities and make average journeys on the route more reliable.\" Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nImprovements worth more than £93million will be carried out on one of Devon's most notorious roads, the Government has announced.\nTransport Secretary Chris Grayling has approved a series of works to the North Devon Link Road to better connect the area to the rest of the country.\nThis morning more than £83million of government funding has been confirmed to pay for upgrades on the A361 between South Molton and Bideford.\nThe extra £10 million for the project will come from Devon County Council's Highways department. An image from the outline business case for improving the North Devon Link Road (Image: Devon County Council)\nThe announcement comes less than a week after a 27-year-old man from Barnstaple was killed in a crash on the road involving a car and a lorry.\nThe plans include widening three sections of the A361 between Barnstaple and South Molton, with two lanes of travel in one direction and a single lane in the opposite direction. Read More All the fatal crashes on the North Devon Link Road since 2000 mapped\nA press statement from the Department for Transport (DfT) said the extra lane will \"help provide safer overtaking opportunities and make average journeys on the route more reliable\".\nUpgrades to a number of junctions and improved connections will also provide \"a much needed boost to North Devon as a place to do business\". Chris Grayling MP\nTransport Secretary Chris Grayling said: “This Government is investing record amounts in our roads, spending £6 billion to improve journeys in our towns and cities and boost their economies.\n“Devon County Council’s plans to widen the A361 will ease traffic on the road and improve every day journeys for residents and businesses in North Devon. Read More Dashcam footage shows yet another dangerous overtake on notorious Devon road\n“Our commitment of £83.1million to the scheme will help improve access to towns in the region.”\nCouncillor Andrea Davis, Devon County Council cabinet member for infrastructure, development and waste, said: “The North Devon Link Road is a vital route for the region, and this announcement confirms that the government has recognised the issues of getting in and out of North Devon. Devon County Councillor Andrea Davis\n\"The improvements to this main route will give a huge boost to our economy, the benefits will be felt by our local residents, businesses and visitors.\n\"We’ve worked closely with the local MP Peter Heaton-Jones and DfT officials. Devon County Council officers have been tireless in their support for this important route, and today the result of all this activity has paid off for our beautiful area of Devon.\"\nThe funding comes from the Government’s Large Local Majors Fund, which aims to provide \"the infrastructure that is vital for economic growth\".\nPeter Heaton-Jones MP (Conservative, North Devon) said:\n\"This is a landmark day for North Devon. Put simply, it's brilliant news. It's the biggest investment in our area by any government for many years.\n\"The North Devon Link Road has had no significant improvements since it was first built 30 years ago. It is no longer fit for purpose, with long delays and a high accident rate. It's holding back job creation and stifling economic investment in North Devon. Since first being elected in 2015, I've made it my top priority to get something done. Read More Police consider arming rural cops - but decide it isn't necessary\n\"Devon County Council have done a fantastic job putting together this bid for government funding. We have worked together to make sure the Transport Secretary was fully aware of the vital importance of this project. I've raised it many times in Parliament, and there has been extensive lobbying behind the scenes.\n\"We'd asked for £83million to fund the first tranche of the project, and I was always hopeful we'd get most of it. But to get all of it is a brilliant result.\n\"This is proof that North Devon really is on the government's radar in a way it hasn't been for many, many years. I'm thrilled, and look forward to work getting underway on this project, which is vital for North Devon's future. That future looks a lot brighter today\". Read More Dashcam catches car forcing four drivers off road in dangerous overtake\nBarnstaple North Lib Dem County Councillor Brian Greenslade said “It feels like Christmas for North Devon. Firstly the news of the Tour of Britain cycle race coming to North Devon again and within a couple of days confirmation that the Government will help fund major improvements to the North Devon Link Rd is super news for our area and when delivered will make a significant contribution to improving safety on this road and also help regenerate the local economy.\n\"I have long campaigned for improvements to the Link Rd which has a bad reputation for road safety. I know this will please our former MP Nick Harvey who secured a commitment from senior Cabinet Members for improving the Link Rd prior to the 2015 general election. Also thanks to the Journal for their campaigning in support of winning funding for these improvements.\n\"Having also raised this at County Council I have been very pleased that DCC took this forward and put up a bid for funding which clearly won the day in Whitehall. This work was led by Dave Black the senior officer responsible for infrastructure and North Devon thanks him and his team for helping to bring this about.\nLet’s now get to work!”. Map shows all the fatal crashes on the Link Road since 2000\nLast week DevonLive published this interactive map showing all of the fatal crashes to have occurred on the North Devon Link Road since 2000.\nThe map shows 18 crashes on the 25-mile stretch of road between Barnstaple and Tiverton - in which 29 people lost their lives. Read More Click to play Tap to play The video will start in 8 Cancel Play now\nLast year, shortly after two fatal crashes which killed a woman and three children, DevonLive launched its \"We Need It Now\" campaign to lobby for funding for improvements to the Link Road.\nWithin days the petition had been signed by thousands of people.\nSpeaking last year, DevonLive.com editor Patrick Phelvin said: “We don’t yet know what caused these recent tragic accidents but we do know that the proposed improvements have been a very long time coming and they will make the road safer.\n“With Brexit and plenty of other demands for public money there are concerns that the project will slip, as attention is focused elsewhere.\n\"We want to remind central Government of the importance of this project and ensure it is completed in a timely manner.” Time Line Fatal crashes on A361 link road FATAL: 11/05/2018\nA 27-year-old man from Barnstaple lost his life after a crash on the A361 North Devon Link Road.\nPolice were called to the A361 at Stoodleigh, near Tiverton, around 3.15am on Friday, May 11 to reports of a crash between a car and a lorry.\nA police spokesman said: \"His next of kin have been informed. The lorry driver was uninjured.\" FATAL: 07/08/2017\nAn elderly man from Winkleigh died in January 2018 following injuries sustained in a serious collision on the A361 in August 2017.\nEmergency services were called on August 7, 2017, to a collision between a Vauxhall Zafira and a Scania tipper lorry at North Molton junction near South Molton.\nJohn Pope, 82, the driver of the Vauxhall Zafira, sustained life-threatening chest and head injuries and was taken to North Devon District Hospital. Mr Pope died on January 10 in Worcestershire as a result of the injuries caused in the collision. FATAL: 31/07/17\nA mother and two children died following a head-on crash between a car and a lorry on Monday, July 31.\nThe crash occurred at around 8.25am when the woman was driving her two children towards Barnstaple, between Aller Cross and Landkey.\nThe mother and one of her children died at the scene and the other child was taken by helicopter to hospital but died shortly afterwards.\nIt is believed the woman and her family were on holiday in Devon and the woman's husband witnessed the crash take place from a vehicle in front. FATAL: 30/07/17\nA nine-year-old girl died after a two-vehicle collision on the A361 link road near the West Buckland junction on Sunday, July 30.\nA Vauxhall Vectra car travelling towards Barnstaple was involved in a collision with a Ford Ranger 4x4 towing a trailer travelling in the opposite direction.\nA charity auction was organised to raise money for the family of nine-year-old Keira Ball who tragically died from her injuries. FATAL: 04/07/15\nFaye Marie Evans was killed by a man driving dangerously on the A361 link road on July 4, 2015.\nJacob Thomas appeared in court accused of causing her death by dangerous driving and two drug offences. He initially pleaded not guilty, but was later found guilty and jailed for five years.\nThomas lost control of his Peugeot on the A361 North Devon Link Road near South Molton and hit a Kia travelling in the opposite direction.\nVictim Faye Marie Evans, from Manchester, suffered serious injuries and died in hospital 36 days later on August 9.\nMore than a dozen members of her family travelled to Exeter Crown Court where the case was listed for a three-day trial until Thomas changed his plea.\nThomas admitted causing death by dangerous driving and possession of cannabis with intent to supply. FATAL: 14/06/14\nAn elderly holidaymaker drove head first into oncoming traffic at more than 60mph, killing herself and another driver on the A361 link road.\nMavis Gallant, 73, from Billericay in Essex, drove into retired police staff member Marion Leach, 63, from Exeter, on June 14, two-and-a-half miles north of South Molton.\nMiss Leach, who served with Devon and Cornwall Police for 25 years, died instantly from extensive injuries, including to the neck and a fracture of the spine.\nMs Gallant suffered head and chest injuries and was treated for a heart attack at the scene.\nShe was airlifted to Derriford Hospital, Plymouth, where she suffered a second heart attack and died at 1.35pm. FATAL: January 2013\nSteven Tolly, a 48-year-old road worker, was killed by a delivery driver who crashed his van through cones and signs.\nAnthony Tompkins admitted killing Mr Tolly when he veered across a coned off area and hit a group of men as they were fixing potholes.\nMr Tolly was one of a crew repairing damage to the dual carriageway section of the A361 link road near Tiverton in January 2013 when he suffered fatal injuries.\nAnother driver had seen Tompkins’ white van being driven erratically shortly before the crash and police found he had an eBay app open on his phone, which was mounted on the dashboard.\nHis van was travelling at around 55mph when it veered for no apparent reason into the coned-off area and hit a large cauldron full of hot tar where Mr Tolly and two other men were working.\nOne of the others jumped clear, another suffered less serious injuries but Mr Tolly took the worst of the impact and died six days later at Derriford Hospital in Plymouth. FATAL: 21/06/10\nTwo holidaymakers visiting the Westcountry were killed in a car crash which left two young children injured.\nFour people, including two seven-year-old boys, were taken to hospital following the two-car smash on the North Devon link road.\nA man and a woman died in the collision involving a silver Vauxhall Corsa and a silver Renault Scenic on the A361 link road at Moortown Cross.\nThe male driver of the Corsa was a Chinese national while his female passenger was from the Philippines. Both lived in Hong Kong, say police.\nPolice said the holidaymakers were travelling towards Barnstaple just before 4.20pm on Monday when the car crashed with a Scenic travelling the other way. FATAL 02/01/10\nStephen and Melanie Potter died on January 2 after their car skidded on ice on the A361 North Devon Link Road.\nSteve and Mel, from South Molton, were killed in the crash near Rackenford Moor just after 8am. It is thought their Vauxhall Corsa skidded on ice into the path of a lorry. The lorry driver was uninjured. No other vehicles were involved. FATAL: 10/03/08\nA young child died after an accident on the A361 North Devon Link Road. Ashton Lee Rothwell from Barnstaple suffered fatal injuries in the crash.\nThe 22-month-old had been taken to the Royal Devon and Exeter Hospital after the accident, which involved several vehicles.\nPolice said initially only one car, a blue Vauxhall Corsa, was involved in the crash on the A361 near Gornhay Cross.\nThe driver was taken to hospital with minor injuries for a check-up. But while police were dealing with debris, which was strewn across both carriageways, a further collision involving three cars occurred on the motorway-bound carriageway. Ashton was travelling in a yellow Peugeot 306. The other cars involved were a blue Ford Mondeo and a blue Land Rover.\nA woman involved in the second collision was taken to hospital with a broken leg. FATAL: 16/07/07\nFour people died in a horrific crash on the A361 North Devon Link Road.\nThe three men and a teenage girl all came from South Molton. They were named by police as Michela Rebecca Jones, 17, brothers Michael and Matthew Gratton, aged 20 and 22 respectively, and Darren Body, aged 34. Michela died as a result of her injuries at Derriford Hospital, Plymouth. She had originally been taken to North Devon District Hospital with life threatening injuries.\nTwo of the other victims had been declared dead at the scene of the accident, which happened on Monday night around 8pm on the Portmore Straight between Barnstaple and Landkey. The other man died from his injuries in North Devon District Hospital. The four who died were all travelling in a red Renault 5 car heading towards South Molton. It is believed the car went out of control and collided with a silver Vauxhall Astra Estate before breaking into pieces.\nThe driver of the Vauxhall was a 65-year-old Barnstaple man. He has not been named and is believed to have suffered minor physical injuries and shock.\nFirefighters used hydraulic cutting equipment to cut the victims from the vehicles. FATAL: 02/04/07\nA 31-year-old Plymouth man was arrested and released on police bail after this three-vehicle accident on the A361 when two men died.\nThe driver of an Iveco box van, Andrew Booth, was arrested on suspicion of causing death by dangerous driving. The two men who died were believed to be a 25-year-old from Dorset and a 25-year-old from Somerset.\nBooth was behind the wheel of a 6.5 tonne delivery van and had been on duty for eight hours when the fatal accident happened. He careered across double white lines on the North Devon link road at Bishops Nympton and smashed into a Renault car. Surfers Christopher Andrews, 25, and Daniel Bates, also 25, were killed instantly.\nBooth was convicted and jailed for 28 months. FATAL: 14/08/06\nJayne Moss, 43, from Bristol, died when her blue Ford Ka collided with a white camper van near the Bolham roundabout.\nThe accident happened just after 11am, and police officers believed the Ka had been driven down the A38, crossing the M5 at junction 27 before entering the North Devon Link Road. They were particularly keen to speak to anyone who may have been concerned as to how the Ka was being driven, and issued an urgent appeal for witnesses. FATAL: 29/03/06\nA MAN who died in a fatal car crash on the North Devon link road near Tiverton was identified as a Willand pensioner.\nKenneth Martin, who was in his 80s, died after his silver Vauxhall Astra collided with a white Ford Transit van on the northbound lane of the A361 just before Gornhay Cross. The driver of the van was treated in hospital for shock and a minor leg injury.\nPolice press officer Sgt Alan Mobbs said on Friday that the police were investigating the possibility that Mr Martin had suffered a heart attack just before the crash, which occurred at 10.30am. FATAL: 15/08/04\nA four-vehicle crash on the A361 link road at South Molton resulted in two deaths.\nA 16-year-old passenger and a 39-year-old driver in a Renault Clio were reported dead by police after the crash at New Town Cross.\nFour other people were reported to have received serious injuries in the accident. The accident involved an Audi, the Renault Clio, a Peugeot 405 and a VW. FATAL: 09/04/04\nA woman was killed in a three-car crash on the North Devon link road. Five other people were taken by two Devon Air Ambulance helicopters to the Royal Devon and Exeter Hospital.\nThe crash happened half a mile from the Stonelands Cross junction. The 26-year-old woman from Melksham, Dorset, was travelling in a light blue Peugeot 206 towards Tiverton when her car was in collision with a dark blue Audi coming in the opposite direction.\nA silver Vauxhall Cavalier was also struck in the crash, causing it to veer off the road into a ditch. The impact strewed wreckage over a 50-metre area.\nAt the time of the crash, which happened at the height of the Easter bank holiday rush, the North Devon Journal reported: \"Since 1999, 160 people have been seriously injured in crashes on the road. Friday's crash brought the total killed to five.\" FATAL: November 2002\n18-year-old Elizabeth Tucker died after her Volkswagen Polo was in a three-vehicle accident near Barnstaple.\nHer father, Stuart, made an emotional appeal to the authorities to take steps to avoid future tragedies on the A361 and backed calls to see the route fully dualled.\nMr Tucker, a beef and dairy farmer from Landkey, near Barnstaple, said: \"It's too late for us. We have lost our sunshine. We are still devastated and our lives are no longer in colour – it's all just black and white.\n\"I'm slightly doubtful about any effect this 'pressure' will have, but if it stops one family going through what we have been through, it must be a good thing.\"\nDespite calls for the A361 to be fully dualled when it was completed in the mid-1980s, the Government at the time said that it would be too expensive, and that use of the road didn't justify the cost.\" FATAL: January 2000\nTwo people died in a crash on the North Devon Link Road on the outskirts of Tiverton.\nTwo cars were involved in a head-on collision near to the junction at Moortown Cross, six miles west of Tiverton, at 3.10pm.\nThe drivers of a red Vauxhall Cavalier and a blue Mazda 626 died.\nPolice later arrested a man in Tiverton and he was helping police with their inquiries. Like us on Facebook ", "external_links": ["https://www.change.org/p/the-ministry-of-publish-a-timetable-for-improvements-to-the-north-devon-link-road?recruiter=328659513&utm_source=share_petition&utm_medium=copylink&utm_campaign=share_petition&utm_term=recruit_notification", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-17T02:01:00.000+03:00", "crawled": "2018-05-17T02:15:04.000+03:00", "highlightTitle": ""}