{"organizations": [], "uuid": "307a7099961722a8ef5b8d9ed65097baf7adda37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10820291.ece/ALTERNATES/s1200/JS81643103.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14726943", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: FTSE firms accused of 'pitiful and patronising' excuses for lack of women directors", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-31T11:05:00.000+03:00", "replies_count": 0, "uuid": "307a7099961722a8ef5b8d9ed65097baf7adda37"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14726943", "ord_in_thread": 0, "title": "Business Breakfast RECAP: FTSE firms accused of 'pitiful and patronising' excuses for lack of women directors", "locations": [], "entities": {"persons": [{"name": "po", "sentiment": "negative"}, {"name": "kevin", "sentiment": "none"}, {"name": "ferrero rocher", "sentiment": "none"}], "locations": [{"name": "poundland", "sentiment": "none"}], "organizations": [{"name": "govia thameslink railway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Accountancy watchdog begins disciplinary action over Autonomy and Deloitte Money (Image: PA) 9.46 Poundland threatens legal action against Thameslink over 'chocolate' tweer\nA train company has been threatened with legal action after comparing its service to Poundland chocolate.Thameslink said it was “very sorry” for making the comment in response to a disgruntled passenger.The operator has suffered major disruption following the introduction of a new timetable on May 20.Thameslink’s parent company Govia Thameslink Railway (GTR) saw more than 450 of its trains either cancelled or at least half an hour late on Wednesday, representing 13% of total services.On some of its routes as many as half of all trains were cancelled.A passenger named Kevin tweeted an image of a departures board showing cancellations trains with a sarcastic caption which read:\nWhy, Ambassador @TLRailUK, with this fine service you are really spoiling us.\nThameslink replied:\nVery sorry Kevin. Appreciate at the moment the service is less Ferrero Rocher and more Poundland cooking chocolate.\nThe budget store’s retail director Austin Cooke issued a scathing response to GTR chief executive Charles Horton.Mr Cooke wrote that GTR has “no right to use our name to describe poor service”, stating that Poundland served eight million shoppers last week and has a “pretty good idea about what great customer service is”.He added:\nIf you don’t want to hear from our extremely twitchy legal team, we suggest you remove your tweet.\nThameslink deleted its original message and sent another tweet which read:\nVery sorry team for using your name here. I have removed the offending tweet. Poundland shop Coreena Ford Watchdog begins crackdown on high-cost credit and bank overdrafts\nBritain’s financial watchdog has launched a sweeping crackdown on high-cost credit as part of efforts to protect vulnerable consumers.\nFollowing a wide-ranging review into the sector, the Financial Conduct Authority is proposing reforms to bank overdraft charges, rent-to-own operators, door-step lending and catalogue credit and store cards.\nFCA chief executive Andrew Bailey said: “High-cost credit is used by over three million consumers in the UK, some of who are the most vulnerable in society. “Today we have proposed a significant package of reforms to ensure they are better protected including the possibility of a cap on rent-to-own lending.\n“The proposals will benefit overdraft and high-cost credit users, rebalancing in the favour of the customer.”\nThe FCA estimates that banks raked in an estimated £2.3bn in revenue from overdraft charges in 2016, arguing that the system needs “fundamental reform”. The FCA is proposing reforms to bank overdraft charges (Image: PA) 9.30 KEY EVENT Gateshead's De La Rue absorbs £3.7m costs following failed passport contract bid\nGateshead’s passport and bank note printer De La Rue absorbed write-off costs of £3.7m following its failed bid to renew its UK passport printing contract , full year results reveal.\nThe figure is revealed in full year results for the business, the world’s largest banknote printer, which learned it had lost its bid to make the iconic blue passport for the UK Government earlier this year.\nThe company has printed UK passports from its Team Valley factory for the last 10 years but the Government contract for future printing was issued to Franco-Dutch firm Gemalto.\nThe decision caused widespread controversy as the contract will involve EU-headquartered Gemalto printing the first batch of blue passports after Brexit, and the move could also put around 200 Gateshead jobs at risk.\nThe business initially planned to appeal the decision, but then dropped those plans, with boss Martin Sutherland telling how “as a business what we have to do is we have to act in the interests of our staff, of our customers, of our shareholders and we have to focus our efforts and our energies elsewhere”.\nNow, De La Rue says it is continuing with the current Government contract, working towards transitioning the work to the new supplier, and looking at ways to be more competitive in this sector.\nIn full year results for the business, for the year ended March 31, Mr Sutherland said the business remains in a strong position despite losing the bid. The De la Rue plant in the Team Valley (Image: newcastle chronicle) 9.25 Coreena Ford FirstGroup CEO resigns after transport giant sinks to loss\nFirstGroup chief executive Tim O’Toole has resigned with immediate effect as the bus-to-train firm swung to a mammoth full year loss.\nExecutive chairman Wolfhart Hauser will take the hot seat while a new boss is found, with finance chief Matthew Gregory to be appointed interim chief operating officer.\nMr O’Toole admitted that the “time is right” to step aside, as the firm posted a dismal set of figures.\nThe company, which is behind Great Western Railway, booked a £327m loss in the year to March 31, which compares to a profit of £152.6 million in 2017. First Group was dragged down by a £277m impairment charged linked to America’s Greyhound bus service, which it also operates.\nGreyhound has been struggling amid the rising popularity of low-cost airline competition, the firm said. “Greyhound’s significant short haul and express growth was more than offset by declines in long haul demand as a result of intensifying competition from the ultra low cost airlines, which are bringing significant additional aircraft capacity into operation while also connecting to a growing number of secondary airports.” FirstGroup CEO Tim O'Toole who has resigned 9.22 KEY EVENT Bank of England governor Mark Carney to speak at Great Exhibition of the North's business summit\nBank of England governor Mark Carney will be one of the main speakers at the business summit planned as part of the Great Exhibition of the North.\nThe business summit, which will take place from July 4 to 6, was announced earlier this month and billed as an opportunity for companies in the region to shape the future of the Northern Powerhouse.\nMr Carney will be the main speaker on the second day of the event, while renowned educationalist Sugata Mitra and Collette Roche, COO of Manchester United, will address the event at Newcastle’s Boiler Shop on the first and final days respectively.\nThere will also be workshops and discussions on the some of the country’s ‘Grand Challenges’, which include growing the artificial intelligence and data-driven economy, clean growth, the future of mobility and an ageing society.\nDetails on how to get tickets can be found in the full story here . Mark Carney (Image: PA) Coreena Ford New car models drive production growth in April\nThe number of cars built in UK factories increased by over 5% last month compared to a year ago, with four out of five vehicles being exported, new figures show.\nA total of 127,952 cars rolled off production lines in April, boosted by a number of new and updated models, said the Society of Motor Manufacturers and Traders (SMMT).\nManufacturing was 7.3% up for the home market and 4.7% for overseas sales. Exports accounted for 81% of total output. Despite the increase, production in the first four months of the year was down by 3.9% compared to a year ago, to 568,378 cars.\nMike Hawes, SMMT chief executive, said:\nWhile April’s growth isn’t altogether surprising given the significant decline in output this time last year, it is good to see earlier planned investment into new models delivering results. “However, given such investment was made on the basis of the free and frictionless trade afforded by our EU membership, the ability of UK plants to attract the next wave of new models and drive future growth depends upon maintaining these competitive conditions after Brexit. That’s why it is critical that government acts to safeguard our participation in the EU customs union and single market. The Nissan plant - new car production has driven growth in April (Image: PA) 9.16 Coreena Ford Consumer confidence is up . .\nConsumers have reported an increase in confidence in May but remain “resolutely downbeat” about the general state of the economy.\nGfK’s long-running Consumer Confidence Index rose two points this month, but concerns about the wider economy moderated upbeat figures for personal finances to keep the overall score in negative territory at minus seven.\nThe index measuring confidence in personal finances for the year ahead increased by four points to positive eight, four points higher than May last year.\nThe measure for the general economic situation of the country during the last 12 months also increased, by five points to minus 24, but remains four points lower than May last year.\nExpectations for the general economic situation over the next year have risen three points to minus 21 - the same level as last May. Meanwhile, a two point drop in the major purchase index suggests consumers are feeling little motivation to spend on big ticket items. Joe Staton, client strategy director at GfK, said: “These negative economic scores are depressing the overall index and preventing it from breaking out into positive territory. Consumer confidence is on the rise - but people are 'downbeat' about the economy (Image: PA) 9.10 One in eight people turn hobbies into careers\nOne in eight people has turned a hobby into a career in industries including technology and music, according to new research.A study by Microsoft Windows showed that younger adults were finding work as professional vloggers, coders or in the computer games industry.A survey of more than 2,200 adults found that photography and cooking were also popular hobbies people would like to turn into a career.One in five people aged between 25 and 34 has started a job thanks to a hobby, rising to two fifths among under 25s. (Image: PA)", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14726943;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-05-31T11:05:00.000+03:00", "crawled": "2018-05-31T14:24:32.003+03:00", "highlightTitle": ""}