{"organizations": [], "uuid": "bf41e74ea35ae3a5d7e7ce196c496c22e67c6c02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14654884.ece/ALTERNATES/s1200/EU-referendum.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/david-miliband-brexit-jeremy-corbyn-14654820", "country": "GB", "domain_rank": 21960, "title": "Former North East MP David Miliband returns to British politics to warn against 'hard Brexit'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-14T13:57:00.000+03:00", "replies_count": 0, "uuid": "bf41e74ea35ae3a5d7e7ce196c496c22e67c6c02"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/david-miliband-brexit-jeremy-corbyn-14654820", "ord_in_thread": 0, "title": "Former North East MP David Miliband returns to British politics to warn against 'hard Brexit'", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "david miliband", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "brexiteers", "sentiment": "none"}, {"name": "miliband", "sentiment": "none"}, {"name": "milband", "sentiment": "none"}, {"name": "steve bainbridge", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Former North East MP David Miliband returns to British politics to warn against 'hard Brexit' David Milband was a leading member of the 'New Labour' governments and his comments got short shrift from supporters of Jeremy Corbyn Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nFormer South Shields MP David Miliband has made a return to British politics by warning against a “ hard Brexit ” and urging the UK to stay in the single market once it leaves the European Union.\nThe Labour politician joined forces with Conservative former Education Secretary Nicky Morgan and ex-Liberal Democrat leader Nick Clegg to warn that the country is being “held to ransom” by hard-line Brexiteers who are threatening jobs and living standards.\nHe said: “The greatest source of division and betrayal will be a Brexit that impoverishes the country.” Jeremy Corbyn (Image: Steve Bainbridge - 2017)\nMr Miliband was once a leading Labour figure and served as Foreign Secretary in Gordon Brown’s Government.\nHe has been absent from British politics since narrowly losing a contest to choose the Labour Party leader in 2010, when he was defeated by brother Ed Miliband, and is currently based in New York as head of the International Rescue Committee.\nSome supporters believe he would still make a good Labour leader one day. But his return to the spotlight met with a lukewarm response from supporters of Jeremy Corbyn such as Ronnie Campbell, Labour MP for Blyth Valley, who said Mr Miliband’s “Blairite” approach was no longer popular. Brexit 0 Seconds\nSpeaking to BBC Radio 4, Mr Miliband said: “The truth is that Britain is being held to ransom by the demand for hard Brexit, for severing the links with the customs union and the single market that is at the heart of the debate going on at the moment.\n“It think that it is significant that people should come together, frankly out of alarm at the prospects for the UK.\n“The prospects of a hard Brexit are very high now and, what’s worse, the prospect of no deal is rising too.\n“It does not need to be like this. It is very, very important that the country is not held to the kind of ransom that at the moment threatens living standards as well as the political influence of the UK in a very fundamental way.” Read More 'There's no need' - calls from five North East MPs for a second EU referendum come under fire\nMr Miliband said currently the Government has no settled position on what kind of future relationship it wants with the EU.\n“The negotiation is not with Europe at the moment; the negotiation is in the Cabinet room. This isn’t funny. We are less than 120 days away from the final negotiation,” he said.\n“There are matters of trade, there are also, frankly, very fundamental matters of conflict on the island of Ireland. These need to be addressed and they should be addressed in a cross-party way.”\nMr Miliband was also sharply critical of Mr Corbyn over Labour’s refusal to support a Lords amendment for Britain to become part of the European Economic Area after it leaves the EU like countries such as Norway.\n“The warning for Jeremy Corbyn is that, if he is not very careful, he will be the midwife of a hard Brexit that threatens the living standards of the very people that he says he wants to stand up for and represent,” he said. Read More Bringing Channel 4 to Newcastle would showcase city's 'working class culture', MPs say\nMr Campbell said Labour should press ahead with Brexit because it was what people voted for in the 2016 referendum.\nAnd he said Mr Miliband represented the approach taken by the Government led by Tony Blair, which was not what people wanted today.\nMr Campbell said: “He’s not a saviour.\n“Hundreds of thousands of people came to the Labour Party because they saw a socialist leader get elected. If he comes in, I can see thousands leaving.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-14T13:57:00.000+03:00", "crawled": "2018-05-14T19:08:31.011+03:00", "highlightTitle": ""}