{"organizations": [], "uuid": "bbf4cbf357bc7aebe7b11614426f06419af22036", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/uk-world-news/article1224244.ece/ALTERNATES/s1200/EU-flag-outside-parliament.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/huge-increase-eu-nationals-devon-1618499", "country": "GB", "title": "Huge increase in EU nationals in Devon applying for British citizenship", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-29T15:23:00.000+03:00", "replies_count": 0, "uuid": "bbf4cbf357bc7aebe7b11614426f06419af22036"}, "author": "Anita Merritt", "url": "https://www.devonlive.com/news/huge-increase-eu-nationals-devon-1618499", "ord_in_thread": 0, "title": "Huge increase in EU nationals in Devon applying for British citizenship", "locations": [], "entities": {"persons": [], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "devon share click", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "freedom of information", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Huge increase in EU nationals in Devon applying for British citizenship The number of applications by EU citizens refused by the Home Office has decreased across Devon Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nMore than twice as many EU nationals in Devon are applying for British citizenship than before the referendum.\nExclusive figures obtained from a Freedom of Information request to the Home Office show that the number of EU nationals applying for British citizenship has considerably increased since the Brexit vote.\nIn Devon, the number of citizenship applications by EU nationals increased from 75 in 2015, to 165 in 2017 - the equivalent of an increase of 120 per cent. Read More\nIn 2015, EU applicants made up 17 per cent of the total applications, while in 2017 they made up 40 per cent of all applications.\nMeanwhile, the number of applications by EU citizens refused by the Home Office has decreased across Devon.\nIn 2015, 10 applications were refused compared to just five in 2017.\nA spokesperson for the 3million - a not for profit organisation formed after the Brexit referendum to protect the rights of EU citizen living in the UK - said: \"I'm not surprised by the statistics ,but despite the decrease in refusals, I think the Hostile Environment is alive and kicking (out).\n\"Those Europeans who apply for citizenship already have Permanent Residence, which means they fulfil most criteria for citizenship already. Union Flag of the United Kingdom and a European Union flag Read More\n“These will be people who have been in the UK for many years and whose cases are pretty straightforward.\n\"More people who have Permanent Residence and qualify currently apply so that drives down the refusal rate.\n“It is the quality, not the quantity of applications, that will drive the rejection and refusal rate.\n“Hundreds and thousands of people are currently barred from taking the first hurdle to citizenship - to qualify for Permanent Residence.\n“This disproportionately affects stay-at-home carers, self-employed, students, disabled and elderly people. Read More Nearly 100 Carphone Warehouse stores to close\n\"The figures show that people who can easily get Permanent Residence are increasingly applying for British citizenship, often as an insurance policy as their rights are still not guaranteed.\n“So those who can afford the high fees and jump through all the bureaucratic hurdles will go for citizenship.\n“At the same time, the Hostile Environment - or \"death by bureaucracy\" as one commentator called it - grips those who don't qualify for Permanent Residence under current Home Office rules.\" Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-29T15:23:00.000+03:00", "crawled": "2018-05-29T15:28:46.000+03:00", "highlightTitle": ""}