{"organizations": [], "uuid": "d6a43d5948b91b3c27c80dea66ba8accc34b1ccb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "https://res.cloudinary.com/jpress/image/fetch/w_620,f_auto,ar_3:2,q_auto:low,c_fill/https://www.bostonstandard.co.uk/webimage/1.8485169.1525339541!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "https://www.bostonstandard.co.uk/news/health/health-campaigners-organise-public-meeting-over-children-s-services-1-8485171", "country": "GB", "title": "Health campaigners organise public meeting over Children’s Services", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-03T12:25:00.000+03:00", "replies_count": 0, "uuid": "d6a43d5948b91b3c27c80dea66ba8accc34b1ccb"}, "author": "", "url": "https://www.bostonstandard.co.uk/news/health/health-campaigners-organise-public-meeting-over-children-s-services-1-8485171", "ord_in_thread": 0, "title": "Health campaigners organise public meeting over Children’s Services", "locations": [], "entities": {"persons": [{"name": "phillip bosworth", "sentiment": "none"}, {"name": "bosworth", "sentiment": "none"}, {"name": "elaine baylis", "sentiment": "none"}], "locations": [{"name": "sleaford", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "children’s services health", "sentiment": "none"}, {"name": "children’s services pilgrim hospital", "sentiment": "none"}, {"name": "boston grammar school", "sentiment": "none"}, {"name": "united lincolnshire hospitals trust", "sentiment": "none"}, {"name": "children’s services", "sentiment": "none"}, {"name": "sos pilgrim hospital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Health campaigners organise public meeting over Children’s Services Pilgrim Hospital Published: 10:25 Thursday 03\nA public meeting has been arranged in Boston for residents to express their concerns and try to get answers about the current crisis which could see Children’s Services ‘temporarily’ stopped by hospital bosses.\nSOS Pilgrim Hospital chairman Phillip Bosworth has organised the meeting at Boston Grammar School next Thursday (May 10), from 7-9pm.\nMr Bosworth has emailed health bosses, local authority leaders and the local MP to invite them to the meeting.\nIn a letter to interim chairman of the board of United Lincolnshire Hospitals Trust Elaine Baylis, Mr Bosworth writes: “I am sure you and your board, especially following the recent meeting at Sleaford and the latest public announcements must share our residents’ serious concerns of the risks to children when and if, and from the on-air interviews, the writing looks to be ‘on the wall’ for children’s ward closure.\n“Certainly you have made many thousands of parents extremely anxious, worried and wondering how in the hell this has ‘suddenly’ come to crisis level!”\nIn a letter to Lincolnshire County Council leader Martin Hill, he says: “Consultants currently employed and retired are now publicly coming out in support and showing their (grave) concerns at the knock-on effect at Pilgrim should children’s wards and paediatrics services cease.... temporary means permanent in ULHT language, we have seen that, as you have seen over Grantham A&E. This has worsened since beds were reduced against CQC advice and recommendations in their report reduced from 19 to eight in February and the dire effect ripples throughout the associated main clinical services should a paediatrics consultant not be available at Pilgrim for all other operations in associated services at Pilgrim.\n“This is now a very serious matter and severe worry for residents you serve as leader, all, more than 240,000 people, at least and probably more than a third of Lincolnshire’s 750,000 residents, served by Pilgrim District General Hospital! Not to mention the patients - children and maternity - sent to Pilgrim from Peterborough too!”\nAn extraordinary meeting of Skegness Town Council is set to take place tonight (Thursday) and will see a peaceful protest held outside the town hall.\nLast Friday, the Trust Board for Lincolnshire’s main hospitals spent three hours deliberating before opting to defer their decision on whether to temporarily close children’s services at Pilgrim Hospital in Boston on Friday.\nThe United Lincolnshire Hospitals NHS Trust board meeting in Sleaford called for further research into all four of the proposed temporary options to maintain safe paediatric services at Boston, after it was felt that there were still too many unanswered questions, and insufficient detail.\nThe Board agreed that a task and finish group be set up to fully develop all the options, taking advice from other organisations, the Clinical Commissioning Groups and neighbouring hospital trusts as well as NHS monitoring bodies. The more detailed report would be brought back to the next meeting on May 25 at 10.30am in Sleaford.\nThey have also sought independent reviews from experts in the East Midlands Clinical Senate on May 21 and the Royal College of Paediatrics and Child Health on June 14 to provide safe parameters within which any temporary closure could work.\nThis follows a Trust review of temporary options for children’s services at the hospital due to concerns raised by paediatricians and senior nurses, who have said that although current services are safe, they may struggle in the future if things remain as they are.\nInterim chairman Elaine Baylis said: “We want to see something much more detailed in terms of equality of access. This is about being very clear and open.\n“We are in a situation I would prefer us not to be in. A lot of work has gone on over months to avoid this situation, but things have deteriorated to where we have had to consider what we need to do next.\n“I don’t want to be bounced into taking a wrong decision before we have got all the information, because it is such an important decision to take.”\nShe wondered if there might be more that could be done to fill the staff roles.\nBoard members were concerned about the struggle that parents may face travelling from the south and east of the county, especially if they have children with conditions cared for at home.\nBoard members were told of all the methods the managers have tried to recruit more doctors. This has been hampered by it becoming harder to get overseas doctors due to the prospect of Brexit and hold-ups in securing work visas as well as having to pass competency and language tests.\nULHT bosses say that without more staff, from June there will not be enough paediatric doctors to provide emergency and non-urgent care on the children’s ward, A&E, maternity and neonatal units 24 hours a day, seven days a week\nFor this to happen there should be eight middle grade doctors at the hospital. In June, the Trust is forecast to have 3.5 middle grade doctors, and only one middle grade doctor in July.\nThey were told by doctors and nursing managers that the service had run up until now using locums and consultants working as lower grade staff, as well as staff filling in extra shifts where needed but the situation had become unsustainable with the impending departure of more doctors.\nMedical Director Dr Neill Hepburn said they had even sought help and advice from the medical college supplying their trainee doctors and been warned that it could pull out all its trainees if a suitable learning environment was not maintained. The Trust says it is very reliant on short-term agency doctors and nurses, many of whom only work occasional shifts.\nDr Hepburn said: “A temporary decision will be made for one reason and one reason only and that is to ensure our children’s services remain safe, as in July we forecast that we will only have one substantive middle grade doctor working at Pilgrim. This isn’t about saving money, it’s about safety. All options being discussed will cost more money than now.\n“We have had a long-standing shortage of children’s doctors and nurses at ULHT and have carried out extensive worldwide recruitment.\n“Since November 2017, we have received 54 applications from international doctors. Of those, we interviewed 23 doctors but just four people have accepted a job offer and don’t yet have visas to work in the UK. These efforts haven’t resulted in the numbers of doctors needed to maintain current services.”\nA petition launched by Sharon Poulton on 38degrees.org.uk has already had more than 4,300 signatures.\nFor more from Dr Hepburn see page 18.\nThe four options are:\nOption One\n○ Maintain current services at Pilgrim hospital, this is reliant on finding additional multi-professional staff from agency to cover children’s, maternity and neonatal services and getting the right balance between substantive and temporary staff.\n○ Following advice, the trust is currently unable to identify nationally that a middle grade tier run solely by locums is safe and whether it could carry a bigger risk and therefore need to seek assurance as to whether it is safe to do so.\nOption Two\n○ Temporary closure of the children’s inpatient ward at Pilgrim with effect from 4 June (providing additional staffing cannot be secured)\n○ Temporary redirection of paediatric emergencies transported by ambulance to Pilgrim – redirected to nearest A&E or urgent care centre\n○ Temporary re-direction of urgent GP paediatric referrals to neighbouring organisations\n○ Paediatric support with emergencies in A&E at Pilgrim hospital\n○ Increase gestational age for delivery within the high risk birthing unit from 30 weeks to 34 weeks.\nOption Three\n○ Temporary closure of paediatric inpatient services at Pilgrim with effect from June 4 (providing additional staffing cannot be secured)\n○ Temporary redirection of paediatric emergencies transported by ambulance to Pilgrim – redirected to nearest A&E or urgent care centre\n○ Temporary re-direction of urgent GP paediatric referrals to neighbouring organisations\n○ Paediatric support with emergencies in the A&E department at Pilgrim hospital up until July 1\n○ Retaining consultant led obstetrics and neonatology at Pilgrim until July 1 when medical staffing reduces beyond the ability to support neonatology. From July 1 temporary closure of consultant led obstetrics and neonatology at Pilgrim until the staffing gaps could be addressed\n○ Increase gestational age for delivery within the high risk birthing unit from 30 weeks to 34 weeks\n○ Establish midwifery led birthing unit at Pilgrim hospital and a co-located midwifery led birthing unit at the Lincoln hospital to facilitate increased activity on the consultant led unit.\nOption Four\n○ Maintain current paediatric inpatient services, consultant led obstetrics and neonatology services at Pilgrim and Lincoln, temporary transfer of staff (medical and nursing) from Lincoln to Pilgrim.\n○ Stop all paediatric inpatient and day case elective (planned) activity for all paediatric specialities at both Lincoln and Pilgrim hospitals. (This will require adjustment to bed numbers at Lincoln and cancellation of some elective activity at Lincoln)\n○ Stop all general paediatric outpatient appointments Follow Us On", "external_links": [], "published": "2018-05-03T12:25:00.000+03:00", "crawled": "2018-05-03T17:17:10.090+03:00", "highlightTitle": ""}