{"organizations": [], "uuid": "d949461539eb060eba836fb3af3c874342999e7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14553020.ece/ALTERNATES/s1200/image1.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theres-no-need-calls-five-14639301", "country": "GB", "domain_rank": 21960, "title": "'There's no need' - calls from five North East MPs for a second EU referendum come under fire", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T14:17:00.000+03:00", "replies_count": 0, "uuid": "d949461539eb060eba836fb3af3c874342999e7a"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theres-no-need-calls-five-14639301", "ord_in_thread": 0, "title": "'There's no need' - calls from five North East MPs for a second EU referendum come under fire", "locations": [], "entities": {"persons": [{"name": "arnott", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nA North East MEP has hit back at calls for a new EU referendum.\nFive North East MPs have joined forces to demand a second referendum on Brexit, claiming that the region could suffer more harm than any other part of the country from leaving the European Union.\nBut the proposal was criticised by North East MEP Jonathan Arnott, a supporter of Brexit.\nHe said there had been numerous public votes already, including the 2016 referendum in which voters backed leaving the EU. Jonathan Arnott (Image: Getty Images Europe)\nMr Arnott, an independent MEP, said: “We have already had a referendum. We had a general election in 2015 where the Conservatives said that if they won we would have a referendum.\n“Before that in 2014 we had European elections that were won by an anti-EU party.\n“In the 2017 general election only one party, the Liberal Democrats, campaigned on the platform being set out by these MPs, and they did very badly.\n“So it seems to me to be pretty settled. There’s no need to have yet another vote on Brexit.” MP Phil Wilson (Image: Parliamentlive.TV)\nIn a joint article, Sedgefield MP Phil Wilson, Houghton and Sunderland South MP Bridget Phillipson, Newcastle North MP Catherine McKinell, Redcar MP Anna Turley and Stockton South MP, Paul Williams, called for a referendum on the final Brexit deal agreed between the Government and the EU.\nThe MPs said: “Companies such as Nissan in Sunderland, Hitachi in County Durham and those in the chemical processing industry on Teesside provide thousands of jobs and see their future as part of the EU customs union and single market. Read More Theresa May told: Your Brexit chaos is destroying jobs in Newcastle\n“We would hate to see the growth and employment opportunities they offer be undermined by a bad deal.”\nThey did not spell out what would happen if the deal was rejected by voters. But it would probably mean staying in the EU.\nHowever, the proposal The MPs, all Labour, pointed out that the Government’s analysis showed that the North East’s economy will lose growth once we leave the EU, whatever type of deal is signed. Hitachi Plant, Merchant Park, Newton Aycliffe. Co Durham (Image: Evening Gazette)\nThis would hit living standards of families throughout the region and mean less money to invest in public services, they said.\nAnd they said the NHS might struggle to recruit staff if the UK leaves the EU.\nThe MPs insisted that voters were not told exactly what Brexit would mean, during the original referendum in 2016.\nWriting in The Independent, they said: “The British people were asked to make the original decision in June 2016 without knowing in reality what the final Brexit deal would look like. Read More How the Government's divisions over Brexit threaten the North East\n“Nobody was sure what the options were. They did not appear on the ballot paper.\n“As each day goes by new facts emerge that weren’t placed before the voters at the time of the referendum.”\nAnd the MPs added: “We believe the British people should have their say on the final Brexit deal.\n“Just as the people had their say in the referendum in 2016, we believe the final decision on this country’s destiny should lie with the British people in a people’s vote.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-10T14:17:00.000+03:00", "crawled": "2018-05-10T20:06:51.012+03:00", "highlightTitle": ""}