{"organizations": [], "uuid": "aa91e09ef6766e18fd6e3a701d38e7e68aea05db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1627742.ece/ALTERNATES/s1200/Nigel-Lawson-Delivers-Speech-On-Leaving-The-EU.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/brexit-campaigner-lord-lawson-blaby-1627700", "country": "GB", "domain_rank": 48128, "title": "Brexit campaigner Lord Lawson of Blaby applies for residency - in France", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-31T16:55:00.000+03:00", "replies_count": 0, "uuid": "aa91e09ef6766e18fd6e3a701d38e7e68aea05db"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/brexit-campaigner-lord-lawson-blaby-1627700", "ord_in_thread": 0, "title": "Brexit campaigner Lord Lawson of Blaby applies for residency - in France", "locations": [], "entities": {"persons": [{"name": "getty", "sentiment": "negative"}, {"name": "nigel lawson", "sentiment": "negative"}, {"name": "lawson", "sentiment": "negative"}, {"name": "margaret thatcher", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "blaby", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "best", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former cabinet minister Nigel Lawson delivers a speech on leaving the EU back in 2016 (Image: Getty Images Europe) Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nFormer Leicestershire MP Lord Lawson of Blaby - a leading campaigner to get Britain out of Europe - is applying for a French residency card.\nThe ex-Conservative chancellor, who chaired the Vote Leave campaign during the EU referendum, has started the \"tiresome\" paperwork required for a carte de sejour.\nHe insisted he is not applying for French nationality.\nLord Lawson was Blaby MP for 18 years from 1974 to 1992 and served in Margaret Thatcher's Cabinet between 1981 to 1989.\nIn an interview with The Connexion - an English language newspaper for Brits living in France - he said he expects an agreement between the UK and EU regarding expats and security, but believes there will initially be no trade deal and accused the UK Government of being weak.\nA trade deal will follow after Britain is \"fully out\" of the EU and when \"passions have cooled\", Lord Lawson added.\nPro-EU campaign group Best for Britain accused him of wanting the best of both worlds.\nA carte de sejour shows a person is legally resident in France, and could help avoid complications after Brexit. Nigel Lawson with ex-wife Therese pose for a Budget day photo outside 11 Downing Street in 1989\nAsked if he had applied for one of the documents, Lord Lawson said: \"Yes, I've just started, and don't know how it will work out but am not particularly worried.\n\"It comes under the category of 'tiresome' rather than 'serious'.\n\"I understand some people are worried about healthcare cover and hope it will be sorted out.\n\"Speaking as a Brit in France - and I'm not applying for French nationality - I am not worried.\"\nSpeaking about the wider Brexit debate, the 86-year-old said: \"I think the issue could be no trade deal.\n\"There will be agreement on expats and security.\n\"It's not helped by the fact the current Government is weak and is not doing a particularly good job. But that's a fact of life.\n\"I think the most likely outcome is initially no trade deal, then after Britain is fully out of the EU and passions have cooled there will be agreement at a future date. Holidaymakers may have to pay to get into EU countries such as Spain after Brexit (Image: Getty images)\n\"I don't think there would be a bilateral deal just with France as I don't think EU law would allow it.\n\"It's one of the problems with the EU and why it will be easier for the UK to do deals with countries around the world, as it's easier to negotiate with one country than with the EU where different member states have different views.\"\nLord Lawson also remained defiant that Brexit will provide benefits but warned it depended how the Government of the day runs the country. Read More\n\"There are things we'd like to do that we can't now because we don't have the autonomy,\" he said.\n\"But that control can be used competently or not.\n\"If it is, I believe the UK will benefit increasingly over the years, if not, we'll suffer.\" Read More\nBest For Britain spokesman Paul Butters said the thought of Lord Lawson applying for a French residency card \"takes the biscuit\". Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-05-31T16:55:00.000+03:00", "crawled": "2018-05-31T17:35:38.050+03:00", "highlightTitle": ""}