{"organizations": [], "uuid": "2a995ecebdc60ef92378dfef289811fff80b65f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1545715.ece/ALTERNATES/s1200/Avocet.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/whats-on/whats-on-news/heres-everything-you-can-eat-1574635", "country": "GB", "title": "Here's everything you can eat and drink at the Devon County Show 2018", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-16T19:18:00.000+03:00", "replies_count": 0, "uuid": "2a995ecebdc60ef92378dfef289811fff80b65f1"}, "author": "Abbie Bray", "url": "https://www.devonlive.com/whats-on/whats-on-news/heres-everything-you-can-eat-1574635", "ord_in_thread": 0, "title": "Here's everything you can eat and drink at the Devon County Show 2018", "locations": [], "entities": {"persons": [{"name": "devon live", "sentiment": "none"}, {"name": "abbie bray", "sentiment": "none"}, {"name": "edward darke", "sentiment": "none"}], "locations": [{"name": "devon county", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Here's everything you can eat and drink at the Devon County Show 2018 From chocolate fondues to gin bars and a hog roast stall - there is plenty to enjoy at the Devon County Show Share Abbie Bray What's On Reporter 17:18, 16 MAY 2018 Click to play Tap to play The video will start in 8 Cancel Play now Thank you for subscribing!\nThe first day of the Devon County Show 2018 starts tomorrow, and Devon Live had a sneak preview of what you can expect when the gates open - including what you can eat and drink.\nMore than 90,000 visitors are expected to flock to the 123rd Devon County Show this weekend as the county's best livestock, local food and drink, country life and entertainment is showcased.\nOrganisers say that celebrity chefs will be demonstrating their skills in the food and drink pavilion alongside a huge variety of local food and drink plus a host of entertainment.\nThere'll be plenty of familiar attractions and faces at the show, but also some new stages and events and possibly the biggest Royal Wedding party in the county. (Image: Devon County Show)\nShow President and South Devon farmer Edward Darke said: “I think everyone in Devon farming will be looking forward to the County Show even more than usual this year, after the winter and spring that we’ve had.”\n“What with the weather and all the Brexit uncertainty it will be a relief to be reminded of all the good things about farming in Devon - the quality of our livestock, the strength of our supply industry, the wonderful food and drink that we produce and the incredibly strong sense of community that there is among the family farms of Devon,” he added.\n“That doesn’t mean that we’ll be forgetting the bigger picture, by any means. There’ll be plenty of talk about farming politics and the problems caused by the weather. But it will help to put all of that in its proper context, and allow us to have a thoroughly good time in the process.”\nHow can I get to the Devon County Show, where can I park and what is on the site map?\nFor Show Secretary Ollie Allen this will be her 22nd County Show and final year at the helm but she said that no two shows were ever the same: “My passion to be part of an event which appeals to every strand of the Devon community only gets stronger year on year. And this year I’m certain we’re going to pull it off yet again!\n“Of course, there will be an abundance of wonderful local food from a county bursting with a huge variety of local produce thanks to Devon’s two coastlines, moorland, rich rolling pastures and sheltered south-facing estuaries. Read More Devon County Show 2018 - all you need to know including traffic, weather, line-up and the site map\n“And this year we are introducing two major new attractions; the Watering Hole, where visitors will savour street food, drink from Exeter Brewery, live music and plenty of seats housed in a huge red and blue marquee, and the Ocean Discovery Zone which embraces the magic and threats to our seas.\n“It will be a Show of mixed emotions for me but the star is the Show itself, so if there are plenty of happy people, enjoying themselves, whether competing or visiting, then – ‘job done’ for the last time.\"\nAs always there will be a huge selection of food and drink stalls for visitors to enjoy including hog roasts, cream teas, pancakes and a chocolate fondue.\nHere's the full line up of what you can eat and drink this weekend", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-16T19:18:00.000+03:00", "crawled": "2018-05-16T19:31:49.066+03:00", "highlightTitle": ""}