{"organizations": [], "uuid": "03d1a538315ff269d8b00e508c477c99fb1f8a10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14637392.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-told-your-brexit-chaos-14636714", "country": "GB", "domain_rank": 21960, "title": "Theresa May told: Your Brexit chaos is destroying jobs in Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T10:00:00.000+03:00", "replies_count": 0, "uuid": "03d1a538315ff269d8b00e508c477c99fb1f8a10"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-told-your-brexit-chaos-14636714", "ord_in_thread": 0, "title": "Theresa May told: Your Brexit chaos is destroying jobs in Newcastle", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "ms onwurah", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nPrime Minister Theresa May has been told uncertainty over Brexit is destroying jobs in Newcastle.\nNewcastle Central MP Chi Onwurah used Prime Minister’s Questions to demand an end to the Brexit chaos which she said is costing jobs in her constituency.\nBrexit is due to take place in March 2019 but the Cabinet is divided over plans for a “Customs Partnership” with the EU after Brexit , and was defeated this week in the House of Lords over whether the UK should stay in the single market.\nHighlighting what she said were problems caused by ongoing uncertainty, Ms Onwurah told the Prime Minister: “A successful start-up forced into bankruptcy by Government delays in paying out European regional development funds, and a tech company’s expansion plans stalled because the Government will not guarantee it access to the native European language speakers that it needs - these are businesses that I have spoken to in Newcastle in the last few weeks. Prime Minister Theresa May (Image: Getty Images Europe)\n“In the absence of any guidance from Government on businesses preparing for Brexit, will the Prime Minister agree that Tory infighting is costing us jobs in Newcastle?”\nMrs May told her: “No. The hon. Lady has raised a number of points. We have been clear about the support that we are giving in terms of the funds that have previously come from the European Union.\n“We have also been clear about the issue of citizens’ rights for people who are currently here in the United Kingdom from the European Union, and for those who will come here during the implementation period up to the end of December 2020.\n“If she wants to be worried about policies that will affect jobs in Newcastle and the North East, I will tell her the policies that would affect jobs in Newcastle and the North East: the policies of her Front Benchers and her party.”\nThe Government has suffered 14 defeats over its flagship Brexit legislation in the Lords. Newcastle Central MP Chi Onwurah (Image: Newcastle Chronicle)\nIn the sixth and final report stage debate on the EU (Withdrawal) Bill, peers backed retaining key aspects of the single market by continued participation in the European Economic Area (EEA).\nThe vote by 247 to 218, majority 29 - two more than officials originally reported, came in defiance of both the Government and Opposition frontbenches.\nWhile the Opposition’s official stance was to abstain, 83 Labour peers rebelled against the frontbench and 17 Tories rebelled against the Government by supporting the amendment.\nThe EEA allows for the free movement of persons, goods, services and capital within the European single market.\nLabour’s Lord Alli said continued membership of the EEA was vital to ensure the future profitability of the UK’s export business.\nMoving the successful amendment, he said: “It is the EEA that deals with services, services like retail, tourism, transport, communications, financial services and aerospace where we have a £14bn trade surplus in these services.\n“The Customs Union only will benefit our European neighbours in their imports and without an EEA equivalent it will damage our profitable export business and therefore the jobs and livelihoods of many thousands of people. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-10T10:00:00.000+03:00", "crawled": "2018-05-10T10:46:36.024+03:00", "highlightTitle": ""}