{"organizations": [], "uuid": "4ab519de6de863e0f3cddefdbdb438ce8fef612d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1577513.ece/ALTERNATES/s1200/Cllr-Ian-Thomasjpeg.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/new-leader-east-devon-district-1577526", "country": "GB", "title": "A new leader of East Devon District Council has been elected", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-17T13:26:00.000+03:00", "replies_count": 0, "uuid": "4ab519de6de863e0f3cddefdbdb438ce8fef612d"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/new-leader-east-devon-district-1577526", "ord_in_thread": 0, "title": "A new leader of East Devon District Council has been elected", "locations": [], "entities": {"persons": [{"name": "ian thomas", "sentiment": "none"}, {"name": "cllr paul diviani", "sentiment": "none"}, {"name": "paul diviani", "sentiment": "none"}, {"name": "cllr ian thomas", "sentiment": "none"}, {"name": "daniel clark", "sentiment": "none"}], "locations": [], "organizations": [{"name": "east devon district council", "sentiment": "none"}, {"name": "exeter science park company", "sentiment": "none"}, {"name": "trinity ward", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A new leader of East Devon District Council has been elected Ian Thomas was elected unanimously to replace Paul Diviani who has stepped down from his role Share Daniel Clark Local Democracy Reporter 11:26, 17 MAY 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nEast Devon District Council’s new leader, elected on Wednesday night, has been called a ‘solution finder’.\nCllr Ian Thomas was elected to become the new leader of the council unanimously elected to the position at the annual council meeting on Wednesday, May 16.\nThe Conservative, who has represented Trinity Ward, since 2009 and is a Director of the Exeter Science Park Company, replaces Cllr Paul Diviani, who has led the council since 2011 but announced earlier in the year that he was stepping down from his post. Cllr Ian Thomas, new leader of East Devon District Council\nHe said: “This is a great honour and a humbling experience. We are in times of challenges, but that brings great opportunity, and I won’t let you down.\n“The first challenge is to focus Portfolio resources and responsibilities more closely on council priorities and aspirations. Since I joined East Devon District Council, in 2009, Portfolio structure and responsibilities have remained largely unchanged. “Yet the environment in which we deliver services and the way our funding is secured, have changed beyond recognition. In 2010 we received approximately a third of our General Fund income via Government Revenue Support Grant – we now receive…. nothing.“Further pressure on Public Sector finance is inevitable, an imminent end to austerity unlikely and Brexit the focus of our national leaders.”Change would accelerate, he said, driven by advances in technology and communication, central government priorities, and economic and demographic pressures. He added: “It is therefore essential our Member organisation is focussed, yet flexible and nimble, that we understand risk and maintain sound governance.” Read More BMW crashes into five parked cars outside shop\nProposing him to be the leader, Cllr Mark Williamson said: “We all know that the next ten years will be the most difficult and challenging for local government, and we need someone with financial acumen and creativity to lead us, and in his business career, he has demonstrated that each day. He is a solution finder, and that is exactly what we need now and for the forthcoming year.”\nCllr Philip Skinner was elected unanimously to be the new deputy leader of the council.\nThe council also paid tribute to outgoing leader Cllr Diviani, with Cllr Thomas saying: “The council’s achievements owe and enormous amount to his leadership and we should not forget the breadth of what he has done. Seven years ago, Paul stood on this same stage to appoint his first portfolio team. How much has East Devon changed since then?“Our Growth Point has made great strides. Cranbrook has become home to over 3,500 people in just six years. The Science Park is rapidly expanding, well on the way to achieving employment targets, within a valuable Enterprise Zone. Seaton and Exmouth regeneration projects continue to attract investment. Yet the East Devon District Council element of our council tax has barely changed. Our council achievements owe much to Paul’s leadership.” Cllr Paul Diviani\nCllr Diviani said: “It has been a great honour to serve as leader of the council and it is absolutely vital that people come forward to serve their fellow citizens.”\nCllr Thomas also his appointed his new cabinet for the forthcoming year, and said: “We want to focus more closely on the council’s future priorities and aspirations and it is essential that the organisation is flexible.”\nCllr Thomas said: “Lead Members now work within a Portfolio team, rather than in isolation, to further build member experience and enhance council resilience, through the sharing of knowledge and skills.“The structure proposed is an interim step. During the next council year, we will review both Member and officer organisation structures, to ensure that resources are focussed on key council priorities, mandatory services, and the discretionary services our residents’ value.” Read More Police consider arming rural cops - but decide it isn't necessary\nHis cabinet consists of Cllr Diviani, who has a new strategic development portfolio, Cllr Skinner has the economy portfolio, Cllr Jill Elson has the sustainable homes and communities portfolio, Cllr Tom Wright has the environment portfolio, Cllr Alan Dent has the corporate services portfolio, Cllr Iain Chubb has the transformation portfolio, Cllr Geoff Pook has the asset management portfolio and Cllr Dean Barrow has the finance portfolio. Cllr Ian Thomas and Cllr Phil Skinner\nThe council also unanimously elected Cllr Andrew Moulding to remain as the chairman of the council for a second year.\nProposing him, Cllr Tom Wright said: “He has as a genuine passion to do all he can to improve the lives of all the residents, particularly those who are less fortunate. He represents the council with great dignity and retains an exceptional good humour, sense of fairness and wants to do the right thing. He is a very worthy representative for East Devon and I propose he represents us as the chairman for another year.” Read More\nCllr Moulding, upon accepting the position, said that he has really enjoyed his year as chairman and is looking forward to a second year.\nThe following councillors have been appointed to the Cabinet: Cabinet member for Strategic Development: Cllr Paul DivianiCabinet member for Economy: Cllr Philip SkinnerCabinet member for Sustainable Homes and Communities: Cllr Jill ElsonCabinet member for the Environment: Cllr Tom Wright (deputy Cllr Marcus Hartnell)Cabinet member for Corporate Services: Cllr Alan DentCabinet member for Transformation: Cllr Iain Chubb Cabinet member for Asset Management: Cllr Geoff PookCabinet member for Finance: Cllr Dean Barrow. Chairmen and Vice Chairmen of East Devon District Council’s committees are: Overview Committee: Cllr Graham Godbeer (Chair) and Cllr Ian Hall (Vice Chair)Scrutiny Committee: Cllr Roger Giles (Chair) and Cllr Cherry Nicholas (Vice Chair)Housing Review Board: Cllr Pauline Stott (Chair), Vice Chair to be appointed by Housing Review BoardStrategic Planning Committee: Cllr Paul Diviani (Chair) and Cllr Mike Allen (Vice Chair)Development Management Committee: Cllr Mike Howe (Chair) and Cllr Colin Brown (Vice Chair)Audit and Governance: Cllr Mark Williamson (Chair) and Cllr John Dyson (Vice Chair)Standards: Chairman of the Council – Cllr Andrew Moulding (Chair)Interviewing (Chief Officers): Cllr Ian Thomas (Chair) and Cllr Philip Skinner (Vice Chair)Employment Appeals: Cllr Philip Skinner (Chair)Licensing and Enforcement: Cllr Steve Hall (Chair) and Cllr John O’Leary (Vice Chair). Lead councillors Culture – Cllr John O’LearyExmouth – Cllr Bill NashBusiness and Employment – Cllr Mike AllenFlooding – Cllr Susie BondHealth and wellbeing – Cllr Cherry NicholasMember development and engagement – Cllr Maddy ChapmanNeighbourhood planning – Cllr Bruce De SaramBuilding design and heritage – Cllr Helen Parr Procurement – Cllr Colin BrownRural economy – Cllr Paul CarterSport and recreation – Cllr Mark Evans-MartinTourism – Cllr Jenny Brown Community safety - Cllr Brian BaileyNPPF – Cllr Mark WilliamsonEnvironmental Health – Cllr Maddy ChapmanCouncil housing – Cllr Pauline StottAffordable homes – Cllr Simon GrundyParks and open spaces – Cllr John HumphreysConsultation – Cllr Helen ParrBranding and marketing – Cllr Jenny BrownCustomer services – Cllr Pauline StottEstates and property services – Cllr Bill NashCommercial Property – Cllr Mike Allen. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-17T13:26:00.000+03:00", "crawled": "2018-05-17T13:39:56.027+03:00", "highlightTitle": ""}