{"organizations": [], "uuid": "7ebc0f43022a020b274372ca673f528c364d96be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12194444.ece/ALTERNATES/s1200/JS105281762.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14688660", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Nationwide's profits fall amid 'intense competition'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-22T10:30:00.000+03:00", "replies_count": 0, "uuid": "7ebc0f43022a020b274372ca673f528c364d96be"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14688660", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Nationwide's profits fall amid 'intense competition'", "locations": [], "entities": {"persons": [{"name": "jeremie", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east fund", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "coreena ford region", "sentiment": "negative"}, {"name": "european investment bank", "sentiment": "negative"}, {"name": "north east fund limited", "sentiment": "none"}, {"name": "nefl", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "eib", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Region's relationship with European Investment Bank could continue after Brexit\nThe North East’s rewarding relationship with the European Investment Bank could continue following Brexit, the bank’s UK vice president has clarified .\nThe European Investment Bank (EIB) has supported transformational investment across the UK since 1973, including providing finance for key regional projects such as Nissan’s car plant and battery production facility, and a £100m loan to Newcastle University to fund building projects.\nAnd this year the bank pledged half of the £120m pot for the North East Fund – also known as Jeremie – a pot of cash with the potential to support 600 firms and create 3,500 jobs, while also generating up to £80m in legacy funds to be ploughed into the region far into the future.\nThe scheme is the second of its kind to receive EIB backing and is managed by the North East Fund Limited (NEFL), delivered through four specialist fund management organisations and made up of five separate funds which are now ready to be accessed by firms.\nThere have been fears this would be the last successful funding collaboration between the North East Fund Ltd and the EIB, as the UK will have broken away from the EU at the end of the fund’s cycle.\nJonathan Taylor, UK vice president of the EIB, however, says that may not be the case.\nHe said: “Not necessarily. The position on that is that the UK continues to be a shareholder of the bank until March next year and, as part of the interim agreement, the UK Government has indicated there could be mutual benefit from a continuing arrangement between the UK and the EIB, and that the UK wishes to explore these possible arrangements in the second phase of negotiations.” Andrew Mitchell, chief executive of The North East Fund Limited (left) and Jonathan Taylor, Vice President of the European Investment Bank (Image: Crest Photography - supplied for free) 9.40 Coreena Ford Newcastle University graduates Lixir drinks business is just the tonic\nAn enterprising pair of Newcastle University graduates have set out to refresh the growing beverage market with the launch of a new brand of tonic water .\nLixir Tonic founders Matt Mahatme and Jordan Palmer have developed a range of five tonics — blood orange and cinnamon, rhubarb and ginger, elderflower and lemon as well as the classic Indian and a refreshingly light tonic water.\nThe duo say the Lixir drinks can be paired with spirits but are just as good on their own.\nNow they have been given the green light for a first production run after smashing their crowdfunding target, raising over £16,000 to help them take Lixir to the UK market.\nThe graduate entrepreneurs have been backed by and partnered with established companies that have bought into their brand and concept, including The Lakes Distillery, Slingsby Gin, Burleighs Gin, Newcastle Gin and Westerhall Rum. Matt Mahatme and Jordan Palmer of Lixir with their advisor Jackie Wade (Image: Lixir) 9.25 Coreena Ford AIS Training targeting major growth after 'multimillion pound' investment\nAn award-winning Tyneside company is targeting major growth after multi-million pound investment from a national private equity firm and a link-up with another player in the offshore training market.\nNorth Shields-based AIS Training, which offers training for people working in the offshore sector, has joined forces with global simulator developer Drilling Systems to form 3T Energy Group, with backing from equity house Blue Water Energy.\nThe new company wants to transform the global energy skills sector by bringing together two of the leading players in industrial training and simulation.\nWith backing from Blue Water Energy, “significant investment” will see 3T Energy open three new UK training centres in the next two years and make strategic global acquisitions.\nAIS founder and managing director Paul Stonebanks has become group president of the new company while Drilling Systems CEO Ian Hudson is chief executive. The AIS training centre on the Tyne Tunnel Trading estate (Image: The Chronicle) 9.14 Coreena Ford Fresh Arriva strikes to cause more commuter disruption\nFresh strikes in the long-running dispute over the role of guards on trains will cause more disruption in the coming days.\nThe Rail, Maritime and Transport union confirmed its members at Arriva Rail North (Northern Rail) will walk out for 24 hours on Thursday and Saturday.\nThe row has been raging for over a year on Northern and two years on Southern, with three other train operators also involved in the same dispute - South Western Railway, Merseyrail and Greater Anglia.\nNorthern’s services will be disrupted on both strike days.\nRMT general secretary Mick Cash said: “It is a tribute to the determination and professionalism of RMT members on Arriva Rail North that they have remained rock solid for over a year now in what is a battle to put public safety before private profit.\n“The next phase of action on Thursday and Saturday goes ahead exactly as planned as the company refuse point blank to engage in talks.” Members of the RMT union on a picket line (Image: PA) 9.08 Coreena Ford Topps Tiles posts a 32% plunge in profits\nRetailer Topps Tiles has posted a 32.6% plunge in pre-tax profits to £6.4 million for the six months to March 31.\nIt said like-for-like sales rose 0.6% over the half-year, with strong growth of 3.4% in the first quarter offset by a 2.2% decline in the second quarter after the Beast from the East and the timing of Easter knocked trading.\nTopps said like-for-like sales had continued to fall in the seven weeks to May 19, down 0.2%. It said it continued to “take a prudent view” of trading over the rest of its financial year, but stuck by full-year profit guidance. 9.02 Coreena Ford Newcastle aims to boost trade links with India as it hosts consul general\nRepresentatives from the North East’s business community have played host to one of India’s most senior diplomats as part of efforts to boost trade with the country .\nThe visit of the Indian consul general, Dr Aman Puri, was arranged by North East entrepreneur Kami Kundi, a member of the British Asian Chamber of Commerce.\nDr Puri met with representatives of Newcastle business improvement district NE1 Ltd, prominent Asian businessmen in the North East and a number of cutting edge companies in the life sciences and technology sectors.\nBusinesses involved with the visit included some who already have trade links with India, but others who are hoping to work with the consul general’s office to boost exporting to the country.\nMr Kundi said: “We are privileged to welcome the new consul general to the North East and are delighted to showcase all the city and the region has to offer.\n“The trip offers a great opportunity to provide an insight into existing trading links between North East businesses and India as well as exploring the potential to develop new ones.”\nOn his visit, Dr Puri visited automotive technology company Zerolight and diagnostics company QuantumMDx. The Consul General of India, Dr Aman Puri pictured with members of the local community and local businesses at Ury Restaurant during his visit to Newcastle (Image: © North News & Pictures - northnews.co.uk) 8.50 Coreena Ford Pets at Home profits fall as investment costs bite\nProfits at Pets At Home fell last year as the group counted the cost of an investment drive, with its new chief executive pressing ahead with a turnaround plan.\nThe retailer booked a 16.6% decline in pre-tax profits to £79.6m in the year to March 29, while revenue grew 7.8% to £898.9m.\nThe group shelled out £13 million on lowering prices, which Pets said was getting a “positive reaction” from customers and resulting in rebounding merchandise sales.\nPets also outlined a £5m increase in the provision held for practice loans in its veterinary business, which dragged on the bottom line.\nNew chief executive Peter Pritchard, who is overseeing a turnaround at the group, said: “Our plans to reposition retail are working, more customers are coming back to shop with us, and we are committed to returning the business to profit growth. But it hasn’t been easy.\n“We took decisive action, threw passion and energy into it, and delivered targeted pricing changes to give customers the products that mattered most to them, with the service and value they expect from us.”\nMr Pritchard added that he will focus the group on digital transformation, tapping into the “vast potential” of customer and pet data.\nLike-for-like sales were up 5.5% over the year, with Pets At Home describing the market as “resilient”.\nDuring the recent bank holiday weekend heatwave, sales of pet cooling products jumped 447%, with doggy paddling pool sales up a whopping 1,239%.\nThe company will open up to five superstores, 20-25 vet practices and 10-20 “grooming salons” this year.\nPets also flagged the crisis in the supply of veterinarians following the Brexit vote, which is influencing the pace of growth of new practices.\n“The challenging supply of veterinarians has long been a feature of the UK market and was exacerbated after the Brexit vote (around 30% of vets in the UK are thought to be EU domiciled).\n“The supply of veterinarians is unlikely to change in the short term and our priority is to open practices in quality locations for the best vet partners.” Pets at Home saw profits fall despite growing revenues (Image: PR) 8.47 Coreena Ford Travelodge wants to open two more hotels in Newcastle\nHotel chain Travelodge says it wants to open two more hotels in Newcastle as it seeks to benefit from a rise in cruise tourism.\nNewcastle – where Travelodge already has four hotels – is one of 10 UK cruise destinations where the firm wants to expand after a record 2m people in the UK went on cruises in 2017, a 6% increase from the year before.\nTravelodge only opened its most recent site in the region – a 120-bed hotel on Newcastle’s Quayside – at the end of last year and has also signalled its intent to open sites in Hexham, Durham, North Shields and South Shields.\nTravelodge property director Tony O’Brien said: “The cruise boom is still under way and predicted to grow from strength to strength therefore we are getting on board now and looking for 10 new hotel sites at UK’s growing ports, which includes Newcastle.\n“This overall expansion represents an investment of £60m for third party investors and will create around 300 new jobs. With more Britons taking to the waves, our port-based hotels are benefiting from holidaymakers stopping over before embarking and returning from their voyage.”\nAs well as Newcastle, Travelodge wants to build hotels at Glasgow, Harwich, Edinburgh, Liverpool, Hull, Portsmouth, Southampton, Poole and Tilbury.\nThe expansion would boost Travelodge’s presence to 42 hotels at the UK’s busiest ferry and cruise ports and six in Newcastle. The new Travelodge Hotel on the Newcastle Quayside - and now Travelodge is planning two more in the city (Image: JOHN MILLARD 2017) 8.40 Coreena Ford Harry Potter and Tom Kerridge boost Bloomsbury sales\nPublisher Bloomsbury posted a solid rise in sales and profits last year as chef Tom Kerridge’s new cooking book and Harry Potter served up a boost.\nThe group reported a 13% rise in sales to £161.5m in the year ended February 28, with pre-tax profits jumping from £9.4m to £11.6m.\nThe company, best known for publishing the Harry Potter series of books, said that titles such as Kerridge’s Lose Weight For Good drove sales.\nThe weight loss book sold over 70,000 copies in one week, more than any book has ever sold in the UK in a seven-day period in January, according to the Nielsen BookScan records.\nBloomsbury said it expects results for this year to be “well ahead” of previous expectations, which has resulted in shares bouncing up 5.8%. Chef Tom Kerridge (Image: BBC) 8.35 Coreena Ford Halfords profits take a hit from rising costs\nHalfords has posted lower annual profits after being forced to stomach rising costs linked to the Brexit-hit pound.\nThe car parts-to-bikes group booked a 6% fall in full-year pre-tax profit to £67.1m in the year to March 30, while revenue rose 3.7% to £1.13bn.\nThe firm outlined £25m in additional costs as a result of the weaker pound against the US dollar.\nSterling’s decline against the US dollar following the referendum has pushed up import prices for retailers.\nHalfords has attempted to mitigate the impact through “supplier negotiations, operational efficiencies and pricing”.\nBut investors were not impressed, and shares are currently 13.6% down.\nDespite the currency headwinds, like-for-like sales grew 2%, with retail motoring sales were up 1.9% and cycling by 2.9% on a comparable basis. Halfords has booked lower profits 8.30 KEY EVENT Nationwide sees profits fall for a second year amid competition\nNationwide Building Society has posted falling profits for the second year in a row as “intense competition” hit demand for savings and mortgage lending. The mutual reported a 7.3% drop in bottom line profits to £977m for the year to April 4 after net mortgage lending slumped to £5.8bn from £8.8bn the previous year.\nSavings deposits also grew more slowly, up by £3.5bn against growth of £5.8bn the previous year. Underlying profits fell 0.8% to £1.02bn in the year.\nIt comes after Nationwide saw annual profits tumble 23% last year as it moved to protect savers from rock-bottom interest rates.\nThe lender said it continued to put member interests first, by looking to offer competitive pricing rather than focusing on increasing profits. It said it gave members a £560m boost by offering better rates, fees and incentives.\nMark Rennison, chief financial officer of Nationwide, said: “Nationwide continues to trade strongly in spite of intense competition in our core markets, in a number of cases choosing to protect value for members through more competitive pricing rather than taking the opportunity to enhance margin.”\nThe group said the UK economy would remain “resilient”, although it forecasts growth to remain modest at between 1% to 1.5% over the next two years.\nIt also cautioned over a “subdued” housing market, predicting house price growth to slow to 1% over the next year.\nChief executive Joe Garner said: “We anticipate modest growth in our core product markets, reflecting the outlook for the economy as a whole.\n“With employment growth expected to slow and pressure on household budgets fading only gradually, mortgage lending is likely to rise at a fairly pedestrian pace.”\nHe added the mortgage market will remain “extremely competitive”. Nationwide is coming up against intense competition for savings and mortgage lending. (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14688660;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-05-22T10:30:00.000+03:00", "crawled": "2018-05-22T13:59:48.013+03:00", "highlightTitle": ""}