{"organizations": [], "uuid": "f964203ff711156c442c73368dbc553b10df37f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14401357.ece/ALTERNATES/s1200/CFR_NJL_120318justin_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/bannatyne-group-ponders-stock-market-14624828", "country": "GB", "domain_rank": 21960, "title": "Bannatyne Group ponders Stock Market flotation as it goes upmarket", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-07T12:25:00.000+03:00", "replies_count": 0, "uuid": "f964203ff711156c442c73368dbc553b10df37f0"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/bannatyne-group-ponders-stock-market-14624828", "ord_in_thread": 0, "title": "Bannatyne Group ponders Stock Market flotation as it goes upmarket", "locations": [], "entities": {"persons": [{"name": "duncan bannatyne", "sentiment": "none"}, {"name": "matt roberts", "sentiment": "none"}, {"name": "justin musgrove", "sentiment": "none"}, {"name": "musgrove", "sentiment": "none"}, {"name": "duncan", "sentiment": "none"}], "locations": [{"name": "darlington", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "stock market", "sentiment": "negative"}, {"name": "bannatyne group", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bannatyne Group ponders Stock Market flotation as it goes upmarket Darlington firm owned by Dragons' Den star Duncan Bannatyne is investing in its gym network Share Justin Musgrove, CEO of Bannatyne Group (Image: Matt Roberts)\nGym and health club chain The Bannatyne Group has revealed it could rekindle plans for a stock market flotation within the next few years as it limbers up for expansion into Europe.\nChief executive Justin Musgrove said an initial public offering (IPO) remains on the table for the Darlington firm, which is owned by Dragons’ Den star Duncan Bannatyne.\nThe chain had planned to raise £300m by floating in 2016, but later pulled the plug on the IPO amid tumultuous market conditions sparked by the shock Brexit vote.\nMr Musgrove said while an IPO was not an immediate priority, he “can’t rule it out” as an option over the next three or four years.\nHe said: “Duncan has always said it remains an opportunity for us.”\n“We have got some work to do and still have a lot of acquisitions to complete, but it’s very much an option that remains open,” he added.\nIn the meantime, the 71-strong chain is focusing on expanding further across the UK under aims to have around 100 clubs nationwide.\nIt completed four acquisitions in 2017, including its first club in Northern Ireland, and has more “careful” deals planned for 2018. It has its sights set on Europe further down the line.\nMr Musgrove said a European launch could be possible within the next five years, with the market on the Continent driven by the low cost gym model and leaving a gap for Bannatyne’s affordable, premium offering.\nHe said its focus on this market has helped differentiate the chain in the UK and kept profits growing at a healthy clip despite stiff competition.\nNo-frills rivals are growing aggressively in the UK, with The Gym Group planning to add 20 sites this year.\n“We had a dilemma three or four years ago when the low cost sector had polarised the market - the likes of Pure Gym created a vacuum in the market,” said Mr Musgrove.\n“We had a decision to take the group low cost or upmarket.”\nIt has firmly focused on its niche, with a £50m investment drive to upgrade existing health clubs, add new spa facilities and expand through acquisition.\nThe decision has paid off, with the firm recently posting a 57% surge in underlying pre-tax profits to £14.3m for 2017 thanks to record turnover of £117.6m as it increased its membership by 7.4% to nearly 212,000.\nIt saw spa revenues increase by more than 13% last year as it has opened nine spas to take the total to 46.\nThe group wants to have around 55 spas by the end of next year, with aims to boost revenues further by cross-selling treatments and facilities to existing gym members.\n“The big prize in this sector is retaining your members - if more members are making use of the pool, and gym and having treatments as well, we believe we can keep these members for years to come,” said Mr Musgrove.\nFor the year ahead, there will also be further refurbishments, with £2.8m being spent revamping changing rooms alongside further cafe bar upgrades.\nMr Musgrove said with the consumer market hammering players in the retail and restaurant sector, “it’s about making sure we don’t get complacent”. Read More Seed firm looks to plant roots in hotter countries to grow and flourish\nAs more people are using online work-outs to get fit at home, Bannatyne is hoping to encourage members to keep coming into gyms, with state-of-the-art equipment, as well as “virtual classes” in its studios on demand.\nIt is also soon to launch a tie-up with Hatton Academy - run by former boxing champion Ricky Hatton - to offer fitness programmes for its members.\nBannatyne Health Clubs was founded by chairman Mr Bannatyne in 1997, with the first site opened in Teesside in 1997.\nThe 69-year-old entrepreneur still owns 99% of the chain. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-07T12:25:00.000+03:00", "crawled": "2018-05-07T18:41:46.013+03:00", "highlightTitle": ""}