{"organizations": [], "uuid": "0945a3cefccf5a9cbaafa86d3a36c6f20d9d67bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10715567.ece/ALTERNATES/s1200/JS76757977.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/more-passengers-new-destinations-newcastle-14640286", "country": "GB", "domain_rank": 21960, "title": "More passengers and new destinations: Newcastle Airport reveals major expansion plans", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T17:17:00.000+03:00", "replies_count": 0, "uuid": "0945a3cefccf5a9cbaafa86d3a36c6f20d9d67bc"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/more-passengers-new-destinations-newcastle-14640286", "ord_in_thread": 0, "title": "More passengers and new destinations: Newcastle Airport reveals major expansion plans", "locations": [], "entities": {"persons": [{"name": "graeme", "sentiment": "none"}, {"name": "graeme mason", "sentiment": "none"}], "locations": [{"name": "north east england", "sentiment": "none"}, {"name": "central station", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle airport", "sentiment": "negative"}, {"name": "newcastle interna", "sentiment": "negative"}, {"name": "metros", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAn ambitious plan to expand and improve Newcastle International Airport in time for its 100th birthday has been unveiled.\nBy 2035, passenger numbers could balloon from 5.35 million to 9.4 million thanks to better transport links and, potentially, an extended runway.\nMore parking, new destinations and even a main line rail link are all on the cards as the airport eyes a period of rapid growth.\nWhile no major extension to the terminal is planned, airport bosses want to improve shopping and leisure outlets and use technology to make getting through the airport faster.\nThe plan forecasts the expansion will create more jobs, eventually supporting more than 4,700 on site, 27,800 indirectly across the region, and that it will add over £2bn to the North East’s economy annually. Graeme Mason (Image: North East England Chamber of Commerce)\nA new multi-storey car park could be built and, with road improvements, new Metros and the potential for main line rail links from Central Station, getting to the airport in 2035 might be a whole lot easier.\nGraeme Mason, planning and corporate affairs director, said: “Newcastle Airport is one of the North East’s great success stories.\n“The airport has enjoyed ten years of sustained growth, including in the last two years strong passenger growth, providing air services to over 80 destinations, amongst them a number of major global hubs.\n“Passenger numbers are expected to continue to grow and the masterplan will provide a framework to allow the delivery of improved connectivity to ensure passengers don’t need to travel to airports outside of the region. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n“It also sets out aims to support an increase in inbound tourism.\n“In order to ensure that all possible impacts are considered, the masterplan is based upon a high forecast growth scenario of up to 9.4 million passengers by 2035.”\nTransport for the North has identified the airport as being the “international gateway for the North East” and it will need to play a crucial role in the post-Brexit economy.\nNew links to the US, China, Canada and India have been identified as priorities for the future, building on the success of the Emirates service to Dubai.\nThe masterplan comes with a pledge to be “good neighbours” and to “address community impact, minimise environmental impact and boost public transport”. Newcastle International Airport\nRetaining the option of extending the runway is the most eye-catching feature of the masterplan, with a 700m stretch at the eastern end safeguarded for potential future development.\nAirport bosses would prefer not to use the option, which would doubtless be costly and controversial, but say if promised aircraft improvements don’t come through as expected then it might be necessary. Read More Here are four new holiday destinations you can travel to from Newcastle Airport this summer\nDetailed assessments of areas which would be impacted by increased noise if an extension were to go ahead have been carried out to inform housing development plans.\nMr Mason said: “We hope that future improvements in aircraft performance will boost the range of destinations that can be served from the Newcastle Airport runway.\n“It is prudent, however, for the masterplan to safeguard for a possible runway extension in case aircraft performance improvements beyond those that we already know about do not materialise.\n“We are also safeguarding for this in order to help prevent new housing being built in areas of future noise impact that could result in restricting the airport’s growth in the future. Read More Residents furious after being kept up at night due to 'increased noise' at Newcastle Airport\n“Limiting the airport’s growth would damage the future competitiveness of the North East.”\nA public consultation on the plans has been launched, which closes on September 13 and will be supported by a series of public meetings. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-10T17:17:00.000+03:00", "crawled": "2018-05-10T19:06:48.000+03:00", "highlightTitle": ""}