{"organizations": [], "uuid": "b0b101b52b2c2f72b754d186cd708fbb6db7653a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1394662.ece/ALTERNATES/s1200/drugs.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/true-extent-devons-drug-problem-1590058", "country": "GB", "title": "The true extent of Devon's drug problem has just been revealed - and it will shock you", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-21T15:00:00.000+03:00", "replies_count": 0, "uuid": "b0b101b52b2c2f72b754d186cd708fbb6db7653a"}, "author": "Anita Merritt", "url": "https://www.devonlive.com/news/devon-news/true-extent-devons-drug-problem-1590058", "ord_in_thread": 0, "title": "The true extent of Devon's drug problem has just been revealed - and it will shock you", "locations": [], "entities": {"persons": [{"name": "benjamin wilkins", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "cornwall police", "sentiment": "none"}, {"name": "devon & cornwall police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Suicide was the verdict of Benjamin Wilkins' inquest Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nParts of Devon have more than twice the national average for deaths by drugs each year.\nAnd there were more than 4,000 drug cases reported and investigated by Devon & Cornwall Police in the last 18 months, according to new statistics.\nThe amount of money being pumped into the drug business is vast, with an Exmouth-born drug user admitting to DevonLive he spends about £350 a month on cannabis. Having too much makes you anxious, paranoid or panicky (Image: Christopher Furlong/Getty Images)\nIt is the most used drug in the South West with one in 14 people admitting to having used the illegal substance at least once in their life, adding to the 9.7million cannabis users in England and Wales.\nIn Devon 29.6 per cent of people aged between 16 and 59 said they have smoked cannabis.\nSince September 2016, Devon and Cornwall Police have dealt with an average of more than 100 cannabis cases every month. Read More Bank Holiday weekend set to be a scorcher\nUse of the plant-based drug has increased in the past few months with 77 more cannabis cases reported to the police in first two months of 2018, in comparison to the first two months the previous year.\nOne Devon born resident told how most people use cannabis to “socialise” and stated the drug helps “calm him down”.\nHowever, cannabis isn’t the only drug being used in Devon, with the amount of class A drug cases being reported to the police on the rise as well. Around 15 million Brits take recreational drugs regularly, according to a survey (Image: Christopher Furlong/Getty)\nHeroin cases have more than doubled in quantity, while the amount of cocaine cases have also increased.\nWith the rise of both class B cannabis and a variety of class A drugs, the rate of fatalities by drugs is increasing too.\nThe death rate in Devon is almost five times the national figure with 79 recorded deaths by drugs in two years between 2014 and 2016.\nA 16-year-old from Exmouth said: “People use harder drugs to feel good. I use them for the enjoyment, but they’re drugs and they’re illegal for a reason.” Read More League table shows how long your flight will be delayed at Exeter Airport\nWhen asked if he feels class A drugs should be legal, he said: “Not really. They kill and that is obviously why they’re illegal”.\nBut when it comes to cannabis he said he believed the popular drug has more positives than negatives.\n“It’s scientifically proven that there have been positives from doing weed,” he said. “Obviously it can cause depression in the longer term, but at the end of the day it’s just a plant, and it hasn’t been tampered with at all.” Some people believe taking cannabis leads to using harder drugs\nOpinions like this one are putting more pressure on the government to follow in America’s footsteps and start to make cannabis legal in parts of the UK.\nCannabis is legal for both medical and recreational use in nine states, including Alaska, California, Colorado and Washington.\nWith nearly 10 million people using the drug illegally, the British government are predicted to be spending billions of pounds in the battle to stop the use of cannabis; money that many feel could be better used elsewhere.\nAnd with the estimated value of the British cannabis industry being £7 billion per year, many feel that the money raised could be used to improve the finical state of the NHS or fund the Brexit bill. Read More Marks & Spencer to close 100 stores with fears for Devon branches\nIn America, Colorado made $200 million in cannabis tax, which was then used to improve other aspects of the state.\nHowever, despite cannabis being scientifically proven to help a wide range of different illnesses and its potential to raise astronomical amounts of money by the mass selling of the substance, many people still believe that keeping cannabis illegal is the best scenario.\nA Devon resident said: “Cannabis is the doorway into other drugs. Relaxing the laws on the drug would put people onto a slippery slope.” Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-21T15:00:00.000+03:00", "crawled": "2018-05-21T15:11:04.000+03:00", "highlightTitle": ""}