{"organizations": [], "uuid": "ac2a2486e603f3390c5a31b5dd3576e66f6a6db9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1545715.ece/ALTERNATES/s1200/Avocet.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/whats-on/whats-on-news/heres-everything-you-need-know-1544724", "country": "US", "title": "Here's everything you need to know about the Devon County Show 2018 - including how to get tickets, avoid the traffic, site map and weather", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-08T19:42:00.000+03:00", "replies_count": 0, "uuid": "ac2a2486e603f3390c5a31b5dd3576e66f6a6db9"}, "author": "Abbie Bray", "url": "https://www.devonlive.com/whats-on/whats-on-news/heres-everything-you-need-know-1544724", "ord_in_thread": 0, "title": "Here's everything you need to know about the Devon County Show 2018 - including how to get tickets, avoid the traffic, site map and weather", "locations": [], "entities": {"persons": [{"name": "edward darke", "sentiment": "none"}], "locations": [{"name": "devon county", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nMore than 90,000 visitors are expected to flock to the 123rd Devon County Show as the county's best livestock, local food and drink, country life and entertainment is showcased.\nOrganisers say that celebrity chefs will be demonstrating their skills in the food and drink pavilion alongside a huge variety of local food and drink plus a host of entertainment. (Image: Devon County Show) All you need to know about Exeter Pride 2018: Times, route, what's on and when\nShow President and South Devon farmer Edward Darke said: “I think everyone in Devon farming will be looking forward to the County Show even more than usual this year, after the winter and spring that we’ve had.”\n“What with the weather and all the Brexit uncertainty it will be a relief to be reminded of all the good things about farming in Devon - the quality of our livestock, the strength of our supply industry, the wonderful food and drink that we produce and the incredibly strong sense of community that there is among the family farms of Devon,” he added. (Image: Devon County Show) Here's 14 great outdoor pools and lidos in Devon to visit this Bank Holiday weekend\n“That doesn’t mean that we’ll be forgetting the bigger picture, by any means. There’ll be plenty of talk about farming politics and the problems caused by the weather. But it will help to put all of that in its proper context, and allow us to have a thoroughly good time in the process.”\nFor Show Secretary Ollie Allen this will be her 22nd County Show and final year at the helm but she said that no two shows were ever the same: “My passion to be part of an event which appeals to every strand of the Devon community only gets stronger year on year. And this year I’m certain we’re going to pull it off yet again!\n“Of course, there will be an abundance of wonderful local food from a county bursting with a huge variety of local produce thanks to Devon’s two coastlines, moorland, rich rolling pastures and sheltered south-facing estuaries.\n“And this year we are introducing two major new attractions; the Watering Hole, where visitors will savour street food, drink from Exeter Brewery, live music and plenty of seats housed in a huge red and blue marquee, and the Ocean Discovery Zone which embraces the magic and threats to our seas.”\n“It will be a Show of mixed emotions for me but the star is the Show itself, so if there are plenty of happy people, enjoying themselves, whether competing or visiting, then – ‘job done’ for the last time.\" Read More More acts announced for Ocean City Sounds on Plymouth Hoe When and where is the Devon County Show?\nThe show is held at Westpoint, Exeter, and runs from Thursday, May 17, to Saturday, May 19. The competitions open at 7am each day with the trade stands open from 9am to 6.30pm on Thursday and Friday and to 6pm on Saturday. (Image: Devon County Show) New American-styled grilled cheese sandwich shop opens in Devon How do I get there and where do I park?\nIf you're arriving by car the showground is one mile from junction 30 of the M5 on the A3052 Exeter to Sidmouth road. Just follow the road signs. Parking is free with shuttle buses operating from the overflow car parks to the showground entrances. Traffic is likely to be especially heavy on the roads around Westpoint on Saturday as Exeter Chiefs are playing at Sandy Park at 2.30pm. Public transport is advised.\nBy bus from Exeter, Sidmouth, Seaton, Honiton and Lyme Regis the 9/9A service runs up to every half hour and goes right past Westpoint. From Exeter bus station there will also be a 9W shuttle that will go between the bus station and Westpoint only. From Exmouth take the 59 service which leaves on the half hour from Exmouth and on the hour from Westpoint. The first service leaves Exmouth at 8.30am and Westpoint at 9am. The last service leaves Exmouth at 5.30pm and from Westpoint at 6pm.\nThere is a free bike park at every entrance and the showground is six miles from St David's Station in Exeter. The site map Site map Read More Restaurant chain Cote could be closing a number of sites as the dining sector's woes continue Can I still get tickets?\nTickets at advance sale prices can be purchased online here . On the show days you can still buy tickets online or at the gate. Advance tickets cost £19 for adults and £7.50 for children aged 5-15. Adult tickets cost £21.50 on the gate with child tickets costing £8 on Thursday and Friday and £4 on Saturday.\nHowever on Saturday one adult can two children between the age of five and 15 FREE of charge. (Image: Devon County Show) New Spanish restaurant told huge flag signage must come down What do I get for the entry price?\nOnce inside the showground you don't need to spend another penny. All demonstrations, exhibitions and arena entertainment are free for all to enjoy. You may need to buy something to eat or drink, take a visit to the fairground or be tempted by all the shopping. Visitors are allowed to bring picnics. (Image: Devon County Show) We met the Devon musician with Tourettes who is starring in a new BBC documentary What is on display at the show?\nMore than 90,000 visitors are expected to see some of the best livestock, taste fabulous local food and drink, experience country life and enjoy a wealth of entertainment.\nIn the massive food and drink pavilion visitors will be able to sample from stands offering everything from artisan cheese to local gin, spelt bread to honey and charcuterie.\nCelebrity chefs will be demonstrating their skills in the demonstration kitchen. Those wanting to eat there and then will be able to tuck in at the new Olive Tree eatery within the pavilion or enjoy tasty snacks around the showground which will be selling food to suit all tastes from caterers.\nIn the craft and gardens feature, many of the county's most skilled crafts people will be selling their wares while there will be demonstrations of handicrafts including lacemaking, spinning, felt making, knitting and weaving.\nYou can view the full programme here Download What is new at the show this year? The NEW Watering Hole is a huge red and blue marquee accommodating street food, live music and plenty of seats. For the first time, music will spill on into the evening with Queen tribute band Rhapsody on Thursday and a Sparks tribute act on Friday. The NEW Ocean Discovery Zone is major marine conservation area bringing together organisations involved in conservation, education and research. There will be life-sized inflatable ocean creatures plus hands-on activities. The Royal Wedding takes place on Show Saturday and we’ll be throwing the biggest party in the county (probably!). The Watering Hole will show live TV coverage, there will be a mass confetti throw and a head gear competition. In the Crafts and Gardens feature and the BBC marquee, there will be two wedding trees for visitors to write their good wishes; after the Show, the messages will be collected and sent to the Royal couple together with a Devon tree sapling to reflect the wedding day and also the Queen’s Commonwealth Canopy project (thercs.org/our-work/campaigns/the-queens-commonwealth-canopy) . NEW attractions in the Crafts and Gardens feature: Displays to commemorate the centenary of the First World War including how the Women’s Land Army in Devon helped to feed the nation; some of the 30,000 poppies, hand-made last year to remember the lives lost from the South West, will be sold in aid of the Royal British Legion.\nA glorious church flower competition to mark the hard work of the unsung church flower arrangers with a pedestal competition in the entrance section to the marquee. Pedestal displays from Devon churches will be judged by Show visitors. NEW zorb football competitions between local sports teams and groups will be held in the Rathbones Main Arena. The game is hilarious and heats will be held on Thursday afternoon and the semi-final and final will take place on Saturday afternoon. Also, in the Rathbones main arena, will be the Monster Trucks (Friday and Saturday), show jumping competitions, the Grand Parades of Livestock (Friday and Saturday) and a Massey Ferguson tractor parade. NEW Mini-Monster Trucks will be driving around in the area next to the Show Office and will enable the children who are in awe of the Monster Trucks to drive a replica model. Read More", "external_links": ["https://devoncountyshow.ticketsrv.co.uk/?_ga=2.186613609.1556151362.1525777262-1697552390.1525777262", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-08T19:42:00.000+03:00", "crawled": "2018-05-08T20:03:10.004+03:00", "highlightTitle": ""}