{"organizations": [], "uuid": "c8c123fa029c59395360f370cffcbe501c6e06aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14638226.ece/ALTERNATES/s1200/north-east-mps.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-mps-call-second-14637941", "country": "GB", "domain_rank": 21960, "title": "North East MPs call for SECOND Brexit vote, splitting from Jeremy Corbyn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T11:41:00.000+03:00", "replies_count": 0, "uuid": "c8c123fa029c59395360f370cffcbe501c6e06aa"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-mps-call-second-14637941", "ord_in_thread": 0, "title": "North East MPs call for SECOND Brexit vote, splitting from Jeremy Corbyn", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "anna turley", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "paul williams", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "jeremy corbyn five", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "invalid email five", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East MPs call for SECOND Brexit vote, splitting from Jeremy Corbyn Five North East MPs have said voters should be given a final say on the Brexit deal Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nFive prominent Labour MPs have broken ranks with Jeremy Corbyn by suggesting that the UK should have a second Brexit referendum .\nWriting in the Independent MPs Catherine McKinnell (Newcastle North), Bridget Phillipson (Houghton and Sunderland South), Phil Wilson (Sedgefield), Paul Williams (Stockton South), and Anna Turley (Redcar) said that the North East’s status as an exporting powerhouse could be put at risk if a bad Brexit deal is agreed.\nThe MPs pointed to some of the region’s biggest manufacturers - which employs thousands in the region - and said these firms see their future within the EU customs union and single market.\nDuring the referendum the majority of the North East voted in favour of Brexit. But the group said that most people voted “without knowing in reality what the final Brexit deal would look like”. Read More One in 10 people in North East are in 'insecure work', new research suggests\nWriting in The Independent the MPs said: “How do we decide if the deal we are offered on Brexit is the right one for the Northeast?\n“Will it be good enough for the exporters who provide so many of the jobs on which our regional economy depends?\n“Companies such as Nissan in Sunderland, Hitachi in County Durham and those in the chemical processing industry on Teesside provide thousands of jobs and see their future as part of the EU customs union and single market.\n“We would hate to see the growth and employment opportunities they offer be undermined by a bad deal.” North East Labour MPs clockwise from top-left: Phil Wilson, Bridget Phillipson, Catherine McKinnell, Anna Turley and Paul Williams\nThe North East MPs also raised the question of whether the NHS would be able to find the vital staff it needed if the UK cut itself off from Europe.\nThe open letter added: “The outcome of the negotiations will affect the Northeast of England and the United Kingdom for decades to come. Because this is so important, we believe the British people should have their say on the final Brexit deal.\n“Just as the people had their say in the referendum in 2016, we believe the final decision on this country’s destiny should lie with the British people in a people’s vote.” Read More 175,000 jobs if North embraces new technologies, says Siemens boss\nThe group’s comments echoed those made by fellow Labour MP Gareth Thomas earlier on Wednesday.\nThe Harrow West MP told the Commons that “the terms on which we leave and Britain’s future relationship with the EU were never clearly defined or put to the public in 2016”.\nOn Tuesday night 83 Labour peers rebelled against orders to abstain from an amendment to the EU (Withdrawal) Bill in the House of Lords.\nInstead the peers - and 17 rebel Tories - backed retaining key aspects of the single market by continued participation in the European Economic Area (EEA) by 247 to 218, a majority of 29. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-10T11:41:00.000+03:00", "crawled": "2018-05-10T13:58:08.024+03:00", "highlightTitle": ""}