{"organizations": [], "uuid": "167c473eea5bacdb9a9d89b6712315ccc4d8e69e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1085344.ece/ALTERNATES/s1200/BJDaniella-Glynn-1-USE.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/what-happens-eu-workers-after-1564207", "country": "US", "title": "What happens to EU Workers after Brexit?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-17T02:00:00.000+03:00", "replies_count": 0, "uuid": "167c473eea5bacdb9a9d89b6712315ccc4d8e69e"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/what-happens-eu-workers-after-1564207", "ord_in_thread": 0, "title": "What happens to EU Workers after Brexit?", "locations": [], "entities": {"persons": [{"name": "daniella glynn", "sentiment": "none"}, {"name": "browne jacobson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu workers", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "browne jacobson llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What happens to EU Workers after Brexit? Daniella Glynn , HR Consultant at law firm Browne Jacobson LLP, explains Share Daniella Glynn, HR consultant at Browne Jacobson LLP Share\nThe UK gave formal notice to exit the EU on 29 March 2017, with a leave date of 29 March 2019.\nWith phase 1 of Brexit negotiations complete, we have a clearer idea of the arrangements that will be put in place for EU nationals working in the UK. This includes a reciprocal arrangement for the movement of workers between the UK and EU. So far we know: All EEA workers and their families living in the UK continuously and lawfully for 5 years as at 29 March 2019 will be required to apply for settled status to be able to live and work in the UK permanently EEA workers who are in the UK on the leave date but have not yet reached 5 years in the UK will need to apply for temporary residency until they have attain the required 5 years for settled status All EEA nationals have a grace period of 2 years from the leave date to make an application Those who have permanent residency before the leave date will be required to swap to settled status Those who already have British citizenship will not need to do anything. Read More Do you know what your employees are doing with your data?\nThe system for registering is intended to be digital, streamlined and user friendly. Applications will consist of 6 – 8 questions, will be quick to complete and require minimal supporting documentation. The cost is expected to be the same as obtaining a passport (less than £80) and free of charge for those who have permanent residency. The decision on applications is expected to be made in a two week timeframe. We understand the on-line system will open in the latter part of this year.\nAs an employer you should communicate with your EEA workers to inform them of the arrangements that will be in place so they are up to date as to requirements under the negotiations and offer reassurance that systems are being put in place to allow them to remain in the UK after 29 March 2019. Read More How to manage the challenges of staff absence\nWith reports of the biggest annual reduction in EEA migrants since the referendum, as employers you should aim to retain your EU workers in addition to thinking about how to fill any future gaps. Consider what percentage of your staff is from the EU, whether they are employed in keys roles / areas and whether they will be eligible to remain in the UK after Brexit. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-17T02:00:00.000+03:00", "crawled": "2018-05-17T02:15:11.003+03:00", "highlightTitle": ""}