{"organizations": [], "uuid": "5e92bcbe0e562dc535392370b7a4097769678273", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13714038.ece/ALTERNATES/s1200/MKR_NEC_021017postcodes_06.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/your-say-plans-protect-northumberland-14697296", "country": "GB", "domain_rank": 21960, "title": "The scourge of the holiday home: The hidden threat 'killing' some of Northumberland's best-loved beauty spots", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-24T07:00:00.000+03:00", "replies_count": 0, "uuid": "5e92bcbe0e562dc535392370b7a4097769678273"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/your-say-plans-protect-northumberland-14697296", "ord_in_thread": 0, "title": "The scourge of the holiday home: The hidden threat 'killing' some of Northumberland's best-loved beauty spots", "locations": [], "entities": {"persons": [{"name": "beadnell", "sentiment": "none"}], "locations": [{"name": "bamburgh", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "beadnell", "sentiment": "none"}, {"name": "north sunderland", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bamburgh village with the castle as a backdrop Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nCommunities are dying in Northumberland beauty spots because they are overrun by second homes, locals say.\nBut Thursday is D-Day for a plan which people hope could save towns like Beadnell, where less than 20% of homes are lived in full-time.\nThe North Northumberland Coastal Plan, which will be put before locals for a referendum on Thursday, proposes a radical measure to restore permanent communities: banning the construction of new holiday houses in the area.\nUnder the scheme, which is around four years in the making, developers in the parishes of Beadnell, North Sunderland and Bamburgh would only be able to create new homes if they were restricted for primary occupation “in perpetuity”.\nIt also includes restrictions on the design of any new builds to ensure they fit with the character of the area, which is noted for its beauty, as well as plans to address issues like car parking, traffic and the availability of community facilities.\nNorthumberland County Councillor Guy Renner-Thompson, who represents Bamburgh , said the plan won’t be able to do anything about existing levels of second homes, but could make it easier for families and working people to live in the area in future. View of Beadnell Harbour Picture: Cottages in Northumberland (Image: UGC TNE)\n“Take Bamburgh, which is one of the most expensive places to live in the region, the average house price is half a million pounds,” he said.\n“But the only real opportunities for work for young people are in the bar or the pub, or on farms.\n“The average salary is £16-20,000 a year so for young working people there’s nowhere on the coast they can buy.\n“There’s just a lack of hope in the area. In Beadnell, the shop shuts down over the winter, the place is like a ghost town in winter months.\n“Will this solve it completely? Possibly not - it’s still an attractive, desirable place to live, which pushes prices up.\n“But if you can’t rent out a property to tourists for £40,000 a year, that’s going to bring the value down by default, people won’t be able to just let them out by the week.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nGeoffrey Stewart, chairman of the North Sunderland parish council, said the number of holiday homes has a real impact on the community he loves.\n“I live where the herring yards are - me and the person across from me are the only people in the street who aren’t in a second home,” he said.\n“What’s missing now is the community, we don’t have the community spirit we had before, when the life was fishing.” Read More Business park purchase to bring 'hundreds of jobs' to Ashington - but is it enough for residents?\nMr Stewart, 72, has lived in Seahouses all his life and said he hopes the plan will restore the quality of homes in the town, and enable families to return year-round.\nThe plan also offers boosts for enterprise, with support for plans which boost local employment, or developments which could consist of entirely affordable housing.\nFor Mr Stewart, there’s no reason industry couldn’t thrive at the North Northumberland coast - so long as employees have somewhere to live.\nHe said: “It’s completely possible - we’ve got an industrial park in North Sunderland and that’s pretty full.\n“The problem is people can’t afford to buy and live here. They’ve got to have somewhere to live before they can work in the businesses.”\nCoun Renner-Thompson added: “Tourism is not the only industry we can have here.\n“We’re unlikely to get the old industries back - although with Brexit there could be a revival of fishing - but there’s no reason we can’t have new industries.\n“With the internet and improved connectivity, you can run your business just as well in Seahouses as you can in London or Newcastle .”\nBoth acknowledge that the plan can’t do everything and Mr Stewart said improvements to the A1 are also vital to give the area a boost. Read More Weeping Window, the moving First World War poppies sculpture, is opening in Carlisle\nHowever, they both said that it’s a vital first step to end the reliance on tourism at the coast.\nBut Coun Renner-Thompson said the scheme won’t destroy tourism, which is likely to remain a key part of the coast’s industry.\nIn fact, he believes, checks on the quality and character of new builds could actually help preserve the industry, by ensuring towns like Bamburgh and Seahouses remain attractive places to visit.\n“This should be a desirable place for young families, and a great place to visit,” he said.\n“We want everyone to have the opportunity to live here.”\nThe full plan can be viewed at: www.northumberland.gov.uk/NorthumberlandCountyCouncil/media/Planning-and-Building/planning%20policy/Neighbourhood%20Planning/North-Northumberland-Coast-NP-Referendum-Version.pdf Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "http://www.northumberland.gov.uk/NorthumberlandCountyCouncil/media/Planning-and-Building/planning%20policy/Neighbourhood%20Planning/North-Northumberland-Coast-NP-Referendum-Version.pdf"], "published": "2018-05-24T07:00:00.000+03:00", "crawled": "2018-05-24T08:35:35.008+03:00", "highlightTitle": ""}