{"organizations": [], "uuid": "a2ce1a6a3e73f1eb93379f8310d836569842b703", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14643172.ece/ALTERNATES/s1200/Zoopla_SAP_logo_white.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14640654", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Owner of property site Zoopla to be sold for £2.2bn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-11T10:30:00.000+03:00", "replies_count": 0, "uuid": "a2ce1a6a3e73f1eb93379f8310d836569842b703"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14640654", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Owner of property site Zoopla to be sold for £2.2bn", "locations": [], "entities": {"persons": [], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "bedlington", "sentiment": "none"}], "organizations": [{"name": "tt electronics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT World class centre of excellence coming to Northumberland, triggering job creation\nA world class centre for engineering and manufacturing is to be built in Northumberland by a growing electronics company, creating a raft of new jobs.\nTT Electronics, a global provider of engineered electronics, has announced plans to plough £3m into its Bedlington base, to transform it into a centre of excellence for the growing business.\nThe Bedlington facility is home to the design and manufacture of TT Electronics’ products used by customers in the aerospace market, including global aircraft engine manufacturers, such as hybrid circuits.\nNow the growing firm wants to create the centre of excellence to support its anticipated growth plans, working in partnership with customers to deliver smarter solutions.\nThe ambitious new plans will trigger the demolition of some buildings and redevelopment of others, creating improved space for efficient engineering and manufacturing operations. The site currently employs around 310 people in Bedlington, up more than 25% since 2015, and headcount is expected to continue to increase in the next few years to support the anticipated growth for TT Electronics in the North East.\nThe company also runs a successful apprenticeship programme, creating opportunities for the next generation of engineers and developing future leaders in support functions.\nCommenting on the centre of excellence, Richard Tyson, the firm’s chief executive officer, said:\nI am pleased to announce our investment to create a centre of excellence in the North East of England.\nThe team in Bedlington continue to work hard to delight our customers and have delivered strong growth for TT; we are further investing to support the success of the site. TT Electronics are investing at their Bedlington site (Image: Google Earth) 9:10 Hargreaves Services announces board shake-up\nHargreaves services has appointed Roger McDowell as a its new chairman and non-executive director.\nMr McDowell has previously worked as managing director of building services firm Oliver Ashworth for 18 years before it was sold to St Gobain.\nHe currently serves as Non-Executive Chairman of Avingtrans plc and is also a Non-Executive Director of Augean plc, Tribal Group plc, Proteome Sciences plc, Swallowfield plc, ThinkSmart plc and D4t4 Solutions plc.\nMr McDowell replaces David Morgan, who has served as chairman since 2015. Mr Morgan will step down from the board following the publication of the company’s half year results on August 1 2018. Hargreaves Services Jonathon Manning Healthy chocolate? Newcastle firm says it is making treats that can be enjoyed every day\nA Newcastle entrepreneur is hoping to take the market in ‘healthy’ chocolate bars after featuring on a popular BBC programme.\nWajeeha Hussain, from Newcastle, spent eight years working at the Nissan plant in Sunderland after graduating from Northumbria University with a degree in computer science.\nBut her true passion lay in making sweet treats, albeit sweets with a difference – healthier chocolate bars which are vegan, dairy free and soy free.\nWajeeha has a history of diabetes in her family, so she has concocted a chocolate company called Chocolateeha, which makes bars from raw cacao nibs that have fewer calories.\nAnd they are already flying off the shelves thanks to her appearance on the BBC’s latest foodie competition Top of the Shop, presented by Tom Kerridge.\nWajeeha said:\nIt was a great experience. For the BBC Two programme I had to turn out 1,000 bars every two days, and each one takes 36 hours to make from scratch, from nibs as this is the only way to ensure chocolate is clean and free from nasties.\nAnd the business is so new so the exposure Top of the Shop has given me has been amazing. I’ve already had lots of interest from retailers. Wajeeha Husain and some of her Chocolateeha bars (Image: Chocolateeha) 9:00 KEY EVENT Darlington cycle firm acquires French rival\nDarlington cycling parts distributor Zyrofisher has made its first move into the continental Europe market after acquiring a French firm.\nThe North East firm has acquired Royal Velo France (RVF) from the EXXEMM group.\nRVF which is based in Troyes, distributes leading brands such as Sidi, Giro, Bell and CamelBak in the French market.\nMatthew Barker, CEO of ZYROFISHER, said:\nThis acquisition is the first step in ZYROFISHER’s strategy of utilising our substantial experience and market leading proposition to support growth in markets where we see huge potential. We are thrilled to have the opportunity to work with Christophe Soenen and the RVF team to maximise RVF’s potential.\nZyrofisher was formed in 2016 through the merger of distributors Zyro and Fisher Outdoor Leisure. The acquisition has been made after Palatine Private Equity and LDC invested in the firm last year.\nEd Fazakerley, Partner at Palatine Private Equity, said:\nZyroFisher has established itself as a leading provider of cycling equipment in the UK, and the acquisition of Royal Velo France will enable the company to build its footprint further in Europe.\nPeter Hughes, president of EXXEMM and former President of RVF, said:\nWe are proud to have been involved in the recovery of RVF since our takeover in 2013 and the company is in great shape for the future. This acquisition will allow RVF to begin a new phase of its development for the benefit of its customers and brand partners. I see a great fit between ZYROFISHER and RVF and wish the enlarged group the best of success for the future. SPORTPULSION, which has always operated entirely independently of RVF will continue its own development in its current categories. 8:55 See Sunderland Software City's CEO sign the memorandum of understanding 8:50 Jonathon Manning Sunderland Software City signs partnership to help tech firms sell in China\nA partnership between two north East business groups is aiming to change the way technology is used across the world while helping companies from the region expand into China.\nSunderland Software City has signed a memorandum of understanding (MOU) with TusPark Newcastle to explore how tech can be used to improve the way UK firms sell their products to China.\nOne of the main projects the two organisations will be working on is discovering how software such as artificial intelligence (AI) can be improved for use in foreign markets.\nDavid Dunn, CEO of Sunderland Software City, said:\nThe bit I’m most interested about, and where we can do something with TusPark Newcastle, is understanding how, after Brexit, the UK and China can use digital technology. Part of that is understanding critical biases in AI.\nWhen you use AI there is a bias depending on who is writing it. We want to know if AI made in the UK will work as well in China.\nYou imagine AI is there and it just does what it learns, but when things are programmed, we programme in biases. There is highly likely to be a male bias in most programmes as the vast majority of tech developers are male. This is something we need to explore.\nWill it work across difference values or across different boundaries?\nThe MOU will also see the two business groups attempt to improve how intellectual property (IP) is protected in the Chinese and Asian markets. Western companies are often reluctant to sell their products in China for fear of their IP being stolen, pirated, or copied. Software City is hoping to prevent this using Blockchain technology. Sunderland Software City (Image: NCJ Media) 8:45", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14640654;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-05-11T10:30:00.000+03:00", "crawled": "2018-05-11T12:12:41.007+03:00", "highlightTitle": ""}