{"organizations": [], "uuid": "7a189a11ae36f37d6f42d805361514ff4b2a0fcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13381540.ece/ALTERNATES/s1200/IBP_NEC_241116lifesavers_02JPG.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14627933", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Virgin Money confirms takeover approach from CYGB", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-08T10:00:00.000+03:00", "replies_count": 0, "uuid": "7a189a11ae36f37d6f42d805361514ff4b2a0fcf"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14627933", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Virgin Money confirms takeover approach from CYGB", "locations": [], "entities": {"persons": [{"name": "npower", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "innogy", "sentiment": "none"}], "organizations": [{"name": "npower", "sentiment": "negative"}, {"name": "cygb coreena ford sse", "sentiment": "negative"}, {"name": "sse", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Delivery firm DPD promises drivers real living wage\nDelivery firm DPD has announced all of its drivers will be paid the real living wage following a review launched after the death of one of its self-employed contractors.\nThe parcel courier company said its 6,000 UK delivery drivers will be able to choose if they want to be employed directly, be a self-employed franchisee or become a self-employed worker.\nA new contract for the latter will offer a pension, paid holiday and sick pay in a move DPD said will set the “benchmark” for the industry. The changes, which are due to come into force on July 2, follow an internal review launched after the death in January of Don Lane, who suffered from diabetes.\nMr Lane, who worked for DPD as a self-employed franchisee, had months earlier been fined £150 for missing work to attend a medical appointment.\nAs part of the review, the company, which operates more than 8,000 vehicles, confirmed it is scrapping the so-called “breach system”, which will be replaced by a points-based system.\nIts “driver code” will offer drivers the choice to switch their employment status, with a “try before you buy” contract to help them decide. 8.55 Manufacturers need help to increase productivity, government told\nUrgent action is needed to boost productivity in manufacturing, according to a business group.\nThe EEF said manufacturing productivity in the UK grew by 4.7% between 2000 and 2007 but has since “flatlined” at less than 1% a year.\nThe manufacturers group called on the Government to create an Industrial Strategy Council.\nLee Hopley, chief economist at the EEF, said: “We’ve known about the productivity problem for some time, with various attempts made to try and fix it across the whole economy.\n“Productivity growth matters for wages and international competitiveness, yet 10 years on from the start of the financial crisis these attempts have not delivered a major shift and we need to tackle the challenge in a different way.\n“Manufacturing offers a good area to get gains on productivity growth.\n“An Industrial Strategy Council should now be created urgently and put to task to identify how the overall strategy can improve productivity in those industrial sectors where it has lagged.”\nA Business Department spokesman said: “Britain has a proud manufacturing heritage and through our modern Industrial Strategy we are committed to growing our productivity and improving people’s earning power.\n“Our plans for the Made Smarter Commission, a joint government-industry body responsible for driving up manufacturing productivity, will be revealed in the coming weeks.” Nissan's plant in Sunderland (Image: PA) 8.50 Coreena Ford Bannatyne Group ponders Stock Market flotation as it goes upmarket\nGym and health club chain The Bannatyne Group has revealed it could rekindle plans for a stock market flotation within the next few years as it limbers up for expansion into Europe.\nChief executive Justin Musgrove said an initial public offering (IPO) remains on the table for the Darlington firm, which is owned by Dragons’ Den star Duncan Bannatyne.\nThe chain had planned to raise £300m by floating in 2016, but later pulled the plug on the IPO amid tumultuous market conditions sparked by the shock Brexit vote.\nMr Musgrove said while an IPO was not an immediate priority, he “can’t rule it out” as an option over the next three or four years.\nHe said: “Duncan has always said it remains an opportunity for us.”\n“We have got some work to do and still have a lot of acquisitions to complete, but it’s very much an option that remains open,” he added.\nIn the meantime, the 71-strong chain is focusing on expanding further across the UK under aims to have around 100 clubs nationwide. Justin Musgrove, CEO of Bannatyne Group (Image: Matt Roberts) 8.45 Coreena Ford Sunderland decorating firm Fred Williamson sold to national player\nA long-established decorating supplies and interior design business in the North East has been acquired by a national player .\nSunderland’s Fred Williamson & Son, which was founded in 1884 and has been in the Oliver family since the 1960s, has been bought by C. Brewer & Sons, which operates more than 150 decorating stores around the country.\nFred Williamson has stores in Newcastle, Morpeth, Durham, Sunderland, Darlington and Middlesbrough, employing 50 people. It will trade as Williamsons by Brewer after the takeover.\nOriginally founded in 1884 by Fred Williamson in Sunderland as a paint and wallpaper merchant, the business was acquired by Joseph Randle Oliver in 1961. His sons Chris and Anthony Oliver, who joined the business in 1974, have run it since then.\nThe company’s shareholders were advised on the sale by Newcastle law firm Square One Law. Ian Gilthorpe (Square One Law), Chris Oliver, Anthony Oliver, Catherine Hambleton (Fred Williamson & Sons Ltd) and Ashraf Ali (Square One Law) (Image: Copyright unknown) 8.40 US stock close higher following boost from banks and tech firms\nUS stocks closed modestly higher last night, extending the market’s gains from last week.\nTechnology companies and banks accounted for much of the latest gains, outweighing losses among beverage makers and other consumer goods companies. Energy stocks got a boost from US crude oil prices, which closed above 70 a barrel for the first time since November 2014.\nThe S&P 500 index rose 9.21 points, or 0.3%, to 2,672.63.\nThe Dow Jones industrial average gained 94.81 points, or 0.4%, to 24,357.32.\nThe Nasdaq added 55.60 points, or 0.8%, to 7,265.21.\nThe Russell 2000 index of smaller-company stocks picked up 13.34 points, or 0.9%, to 1,578.95. Traders and financial professionals work on the floor of the New York Stock Exchange 8.35 Coreena Ford Newcastle condiment company The Sweet Beet prepares for expansion\nA young entrepreneur is poised to see her Texas-inspired condiment company grow after investing in a new website and new branding.\nTwo years ago Lizzy Hodcroft - who grew up in Dallas, Texas, before moving here when she was 17 - was launching a crowdfunding bid to help take her fledgling street food business The Sweet Beet north of the border.\nNow Ms Hodcroft is gearing up for expansion for her firm, which takes its name from two of her most popular ingredients, sweet potato and beetroot, after unveiling a new-look website and products as it looks to transform and disrupt the nation’s food industry this summer.\nThe company expects to turnover £200,000 at the end of the financial year, despite only trading for eight months, and will look to recruit up to three new members of staff to fulfil its ambitious growth plans.\nMs Hodcroft – a former chef who was awarded Young Entrepreneur of the Year by the North East Business Woman of the Year Awards in 2017 – has overseen massive demand for Sweet Beet products, which are now available in more than 60 farm and deli stores nationwide as well as through online supermarket, Ocado.\nWith plans to export into Europe, the Middle East and China on the horizon and aspirations to appear on the shelves of leading speciality food stores in the next 12 months, Ms Hodcroft says the future is looking bright. Lizzy Hodcroft has set up her own Texan inspired street food business called 'The Sweet Beet' drawing on her own Texan roots (Image: Newcastle Chronicle) 8.30 Coreena Ford Mike Ashley's firm takes House of Fraser to court to increase company's troubles\nMike Ashley’s Sports Direct has launched legal action against House of Fraser , casting further doubt on the embattled department store chain’s future.\nThe sports retailer owns an 11.1% stake in House of Fraser, and Newcastle United owner Mr Ashley is claiming that his firm has been “repeatedly denied information to which it is legally entitled”.\nAccording to a petition lodged with the High Court in London by Sports Direct subsidiary West Coast Capital, the billionaire is seeking an injunction requiring House of Fraser to provide a copy of its corporate plan.\nIt comes after a tumultuous few weeks for House of Fraser, which last week confirmed that C.banner, the Chinese owner of Hamleys, is to take majority ownership of the group and will oversee a sweeping store closure programme.\nThe stake sale is conditional on House of Fraser shutting a portion of its 59 stores, which will be carried out through a Company Voluntary Arrangement (CVA).\nBut the move has infuriated Sports Direct.\nLiam Rowley, head of strategic investments at the retailer, said: “We have been frozen out by House of Fraser. Their dealings in China are opaque, and it is blatant that we have been unfairly prejudiced.\n“We have no option other than litigation to protect the interests of Sports Direct and its shareholders.” Mike Ashley (Image: PA) Coreena Ford Deliveroo spends £10m on driver insurance but stops short of extra benefits\nDeliveroo is spending £10m to equip 35,000 riders with free accident insurance, but said further benefits risk classifying self-employed workers as staff. Riders in 12 countries will be automatically enrolled in an insurance package that will cover them for up to £7,500 of medical expenses as well as up to 75% of average gross income if they are injured while working - at no cost to themselves.\nIt is being touted as an improvement on the “exclusive” accident and personal sickness and injury cover made available to its UK food delivery riders in December for £1.85 per week, and is expected to cost the company nearly £10 million at the outset.\nDeliveroo said it would like to offer more benefits to drivers but risks being forced to count riders as staff rather than as self-employed workers.\nChief executive and founder Will Shu said: “We know riders value the flexibility of being able to fit their work around their life, but they also deserve security if they’re involved in an accident.” He added: “We would like to go further, but are currently constrained by the law.\n“Deliveroo will continue arguing for the law to be updated so on-demand companies can offer both flexibility and security.”\nBut union representatives said the company needs to go further.\nMick Rix, a national officer for the GMB union, said: “Deliveroo finally appears to be taking the safety of its workers seriously.\n“But the company, along with other gig economy employers, must wake up to its other responsibilities and pay the national living wage for all time worked along with holiday and sick pay.” A Deliveroo rider (Image: © Mikael Buck / Deliveroo) 8.20 Coreena Ford Takeda reaches takeover deal that values Shire at £46bn\nJapanese pharmaceutical firm Takeda has reached a takeover deal with Shire that values the firm at £46bn.\nThe boards of both firms have finally agreed on the terms of the deal, settling on an offer of £49.01 per Shire share.\nTakeda said it represents a premium of around 64% compared to the price of its shares in late March, when rumours of Takeda’s interest began to swirl. It ends weeks of wrangling, with a string of previous offers having been rejected by the Irish firm.\nShire chairman Susan Kilsby said: “We firmly believe that this combination recognises the strong growth potential of our leading products and innovative pipeline and is in the best interests of our shareholders, our patients and the communities we serve.”\nTakeda has agreed that up to three Shire directors will join the company’s board once the acquisition is completed. The takeover is set to come into effect in the first half of 2019. Handshake (Image: iStockphoto) Coreena Ford SSE and Npower merger plan referred for full investigation\nThe deal to merge Npower and SSE’s retail operations has been referred for a full investigation after the two energy giants failed to address concerns, the competition watchdog has announced.\nThe Competition and Markets Authority (CMA) said the deal would now face a so-called stage two in-depth inquiry after its initial probe found the tie-up could reduce competition, potentially leading to higher prices for households.\nIt said Innogy’s Npower and SSE had failed to offer measures to address its competition fears, having earlier set a deadline of May 3 for the pair to put forward proposals.\nA decision on the merger will now be made by a group of independent panel members, with a deadline for their final report of October 22.\nThe two energy giants announced in November that their British household energy supply and services businesses would join forces, reducing the Big Six energy suppliers to five.\nThe CMA said late last month its initial inquiry found the reduction in the number of large players in the UK energy market caused by the merger could impact competition and leave some customers worse off.\nAlex Neill, managing director of home products and services at Which?, welcomed the CMA’s decision to investigate the merger further.\nShe said: “Mergers of big players in essential markets such as energy risk reducing competition and harming consumers.\n“As both these big suppliers struggle with providing good customer service, coming in the bottom half of our satisfaction survey, it’s only right that the competition authorities investigate further before allowing any venture to go ahead.” (Image: PA) KEY EVENT Virgin Money and CYBG could provide a \"powerful banking offer\"\nThe board of CYBG says it recognises the appeal of the Virgin Money brand, and the opportunities for the combined group, which could provide a “powerful full-service banking offer.”\nIn a statement issued this morning, the banking giant confirmed it has made a preliminary approach regarding a potential all share combination of CYBG and Virgin Money.\nThe group said: “The proposal provides the Virgin Money shareholders with an attractive up-front premium and the opportunity to participate in the continuing progress of the combined group, including sharing in the opportunity for value creation from the substantial synergy potential resulting from the combination.\n“CYBG recognises the strength and appeal of the Virgin Money brand. Our proposal would ensure that the Virgin Money brand would play a significant role in the combined group, subject to reaching agreement with Virgin Group Holdings Limited.\n“CYBG believes the combination would create the UK’s leading challenger bank offering both personal and SME customers a genuine alternative to the large incumbent banks.\n“The combination would provide a powerful full-service banking offer, including leading digital and mobile banking services, for 6 million personal and business customers, bringing together the complementary strengths of CYBG and Virgin Money. With this further strengthened customer franchise and national reach, CYBG believes the combination would deliver increased value for shareholders and wider benefits to other stakeholders.\n“Further announcements will be made in due course as appropriate, but there can be no certainty that a formal offer will be made. The Board will only proceed with a transaction if it is in line with CYBG’s strategic objectives and is in the best interests of CYBG shareholders. Yorkshire Bank logo KEY EVENT Virgin Money confirms takeover approach\nNewcastle bank Virgin Money has received a takeover approach from a major player in the UK banking scene.\nThe bank, which took over most of the assets of the former Northern Rock and is one of the largest employers in Newcastle, announced last night that it had received a “preliminary and conditional” takeover approach from CYGB, the owners of the Clydesdale and Yorkshire banks.\nThe board is now reviewing the approach, which would result in shareholders receiving 1.1297 shares in CYGB in return for each share they currently own in Virgin Money.\nThat bid would value Virgin Money at around £1.6bn, a 15% premium on its current share price.\nIn a statement issued this morning, the Newcastle challenger bank said: “Virgin Money Holdings (UK) plc notes the press speculation, and confirms that on the evening of May 7 2018, it received a preliminary and conditional proposal from CYBG to acquire the entire issued and to be issued share capital of Virgin Money.\n“Under the terms of the proposal, Virgin Money shareholders would receive 1.1297 new CYBG shares for each Virgin Money share. The Board of Virgin Money is in the process of reviewing this proposal.\n“There can be no certainty either that an offer will be made nor as to the terms of any offer, if made. Accordingly, shareholders are advised to take no action in relation to this proposal.\n“A further announcement will be made in due course.”\nUnder City rules, CYGB has until June 4 to make a firm offer for Virgin Money.\nThe announcement of a potential bid will be unsettling for Virgin Money’s staff in Newcastle and its other centres in Edinburgh and Norwich, with many of the staff on Tyneside having been through the collapse of Northern Rock and having helped the bank recover from that crisis.\nIt not known how any takeover from CYGB – should an offer materialise – would affect jobs on Tyneside.\nIn its most recent accounts, published earlier this year, Virgin Money recorded a 28% increase in pre-tax profits and income of £666m. A Virgin Money branch (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14627933;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-05-08T10:00:00.000+03:00", "crawled": "2018-05-08T10:20:14.000+03:00", "highlightTitle": ""}