{"organizations": [], "uuid": "249fc56205ef1c53d07b008f4dd46c94d1f8493b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/article1169925.ece/ALTERNATES/s1200/House-of-Fraser-1jpeg.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/house-fraser-bosses-crisis-talks-1574321", "country": "GB", "title": "House of Fraser bosses crisis talks get off to a terrible start", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-16T17:46:00.000+03:00", "replies_count": 0, "uuid": "249fc56205ef1c53d07b008f4dd46c94d1f8493b"}, "author": "William Telford", "url": "https://www.devonlive.com/news/business/house-fraser-bosses-crisis-talks-1574321", "ord_in_thread": 0, "title": "House of Fraser bosses crisis talks get off to a terrible start", "locations": [], "entities": {"persons": [{"name": "fraser", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "house of fraser", "sentiment": "none"}, {"name": "house of fraser chiefs", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "hamleys", "sentiment": "none"}, {"name": "cva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "House of Fraser bosses crisis talks get off to a terrible start Summit between department store and landlords goes badly, say sources Share Click to play Tap to play The video will start in 8 Cancel Play now Thank you for subscribing!\nUnder pressure House of Fraser bosses have started talks with landlords about closing dozens of stores – but the dis.\nBuilding owners are reported to be “furious” about the retailer's radical store closure plan.\nThe department store chain, which has outlets in Exeter and Plymouth, is seeking approval for a restructuring known as a Company Voluntary Agreement (CVA), which will allow it to shut stores and cut rents.\nIt has now emerged House of Fraser chiefs have met landlord representatives who were infuriated by the retailer's proposal. Exeter's House of Fraser store\nThat was because the company simultaneously announced an injection of capital from a new Chinese investor: the Hamleys owner C.banner.\nLandlords were outraged House of Fraser would argue it was financially distressed as a pretext for ditching its rent obligations, despite having won new backing from China. Read More Newton Abbot newlyweds and daughter, 2, in miracle horror crash escape\nAt the crunch meeting, which was brokered by House of Fraser's restructuring adviser KPMG, the retailer's representatives expressed surprise at the strength of the response from landlords, and said they were keen to address any outstanding issues, sources said.\nHouse of Fraser also explained it had not engaged landlords in discussions earlier, which is considered best practice when pursuing a CVA, because the rules of the Hong Kong Stock Exchange prevented it from making a formal announcement.\nThe discussions between the two sides have been described as constructive, but it is not known whether House of Fraser will arrange a further meeting to formally put its proposal to landlords, or whether the company will consider their concerns. House of Fraser, Plymouth\nSources said a more formal meeting about the CVA proposal could take place in June 2018, but discussions were likely to be tense, given the way the restructuring process had been handled so far.\nThe CVA is due to be launched in June 2018, but will only go ahead if 70 per cent of landlords back the plan.\nHouse of Fraser has 59 stores in the UK, and it is thought dozens could close.\nBut the firm says it will not make any announcement until the CVA details are announced.\nHouse of Fraser made a £43.9million pre-tax loss – blaming Brexit, terrorist attacks and increased online competition – for the 12 months to December 31 2017.\nThis compared to a profit of £1.5million in 2016.\nFigures released as part of the takeover of the firm by C.Banner, the Chinese owner of Hamleys, also show the retailer's sales fell from £840.9million to £787.8million in 2017 – a drop of 6.3 per cent.\nThe retailer has been struggling under the cost of its property portfolio. Read More Retail crisis hits Topshop, Dorothy Perkins, Burton, Miss Selfridge and more\nIt rents 4,400,000sq ft of retail space, and is stuck in long-term leases, with the average remaining lease life on its stores standing at 29 years.\nC.Banner is hoping a tie-up with House of Fraser will create cost savings in its footwear and toys businesses, as well as in back-office functions such as IT.\nHouse of Fraser and Hamleys could also negotiate better deals with suppliers, and widen their appeal with high-income customers, C.Banner said.\nThe Chinese retailer also said the acquisition could open up opportunities to buy other brands, and form strategic links with other retailers.\nBut some commentators think it is too late to save House of Fraser, and another department store chain: Debenhams.\nStockbroker and TV finance expert Justin Urquhart Stewart said the retail chains are “doomed”, when he gave to talk to about 100 business leaders in Plymouth in May 2018. Read More House of Fraser endures fresh fears as it announces £44m loss\nHe said the chains were facing extinction because they have not kept up to date with the latest shopping trends and have saddled themselves with too much debt.\nMeanwhile, a string of retailers and restaurant groups have undertaken CVAs, including New Look, Byron, Jamie's Italian and Carpetright.\nWhile landlords have voted through all of the CVAs proposed this year, the process is controversial because it leaves landlords out of pocket.\nInstitutional investors, which own commercial properties through property funds, are also affected by CVAs, meaning pension funds are impacted by rent reductions and store closures. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-16T17:46:00.000+03:00", "crawled": "2018-05-16T18:30:40.001+03:00", "highlightTitle": ""}