{"organizations": [], "uuid": "782fd421658451378bafe07e21dea30649316603", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14672388.ece/ALTERNATES/s1200/DMR_NEC_290716wed_01.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/history/how-thousands-partied-north-east-14672310", "country": "GB", "domain_rank": 21960, "title": "How thousands partied in the North East when Charles and Diana married in 1981", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-18T15:00:00.000+03:00", "replies_count": 0, "uuid": "782fd421658451378bafe07e21dea30649316603"}, "author": "David Morton", "url": "https://www.chroniclelive.co.uk/news/history/how-thousands-partied-north-east-14672310", "ord_in_thread": 0, "title": "How thousands partied in the North East when Charles and Diana married in 1981", "locations": [], "entities": {"persons": [{"name": "harry", "sentiment": "neutral"}, {"name": "charles", "sentiment": "neutral"}, {"name": "diana", "sentiment": "neutral"}, {"name": "meghan markle", "sentiment": "none"}, {"name": "lady diana spencer", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}, {"name": "byker", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "windsor", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "raby street", "sentiment": "none"}], "organizations": [{"name": "diana share seaton place", "sentiment": "none"}, {"name": "royals", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News How thousands partied in the North East when Charles and Diana married in 1981 As Prince Harry and Meghan Markle tie the knot, recalling how the North East celebrated the marriage of Charles and Diana Share Seaton Place, Walker. Street party celebrating the wedding of Prince Charles and Lady Diana Spencer, July 29, 1981 (Image: Newcastle Chronicle) Share Get daily\nSo, who’s tuning in to watch the Royal wedding on TV this weekend?\nAs Prince Harry and Meghan Markle tie the knot in Windsor, a new poll carried out by YouGov suggests the folk of Britain have mixed feelings about the whole thing.\nOf the 1,615 people asked, 66% said they were “not very interested” or “not interested at all” in the ceremony, while 60% planned on having a normal weekend.\nAlso, of those questioned, 57% thought the Royals should pay the full cost of the wedding, including stumping up for policing and security. Raby Street, Byker. Street party celebrating the wedding of Prince Charles and Lady Diana Spencer, July 29, 1981 (Image: Newcastle Chronicle)\nMeanwhile, in the opposite camp, thousands of Royal watchers are descending on Windsor.\nAfter the hour-long ceremony, the couple are due to proceed through the town’s ancient streets in a 19th century Ascot Landau carriage pulled by four Windsor Grey horses.\nThe fact Meghan Markle is a photogenic, American, former TV actress with a black mother has sparked huge interest, with this weekend’s Royal wedding arguably the most high-profile since Charles and Diana’s in 1981.\nIf today’s domestic news is dominated by Brexit and our polarised nation, back then the headlines told of serious rioting breaking out on the streets of the UK - in London, Liverpool, Manchester and elsewhere. The wedding of Prince Charles and Lady Diana Spencer, July 29, 1981 (Image: Newcastle Chronicle)\nThe number one single in the pop charts at the time, Ghost Town by the Specials, eerily mirrored the urban decay, rising unemployment and street violence of Margaret Thatcher’s Britain.\nAgainst this grey backdrop, the wedding of Prince Charles and 20-year-old Lady Diana Spencer provided a splash of colour.\nIt was the first royal wedding of the global television age, with 750 million people around the planet tuning in to watch the ancient rituals and pageantry unfold.\nIt was also, for some, a seemingly fairy-tale union between the heir to the throne and a young rose of England.\nFor a while all seemed well, but the marriage was fatally flawed and ultimately doomed. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nThe House of Windsor would be rocked over the following fifteen years as scandal, betrayal and ultimately tragedy were all played out on the front pages of the tabloid press.\nBut, on a blazing hot Wednesday, July 29, 1981, the marriage provided a moment of optimism across the country, when times were tough for many.\nThe Chronicle’s page one headline declared ‘Isn’t She Lovely!’ as the beaming couple were photographed on the steps of St Paul’s Cathedral. Read More North Shields Fish Quay on this day 80 years ago - and the story of a vibrant town\nOur report read: “Prince Charles married Lady Diana Spencer in history’s most public wedding.\n“But, for a few moments, the couple forgot the pageantry, the vast crowds, the millions watching television, and the sadly necessary security screen as they exchanged the simple but solemn vows at the heart of the marriage service.\n“It was a day when the nation seemed determined to put aside its cares and rejoice with the Royal Family in a show uniquely British.”\nThe North East played its own part in the celebrations.\nWe reported: “The region caught Royal wedding fever and it was parties all the way.\n“After eyes spent glued to television screens for the spectacle of the year, thousands poured on to the streets for their own joyful celebrations. Read More A nostalgic view of Gateshead High Street in 1976 - see how this scene looks today\n“With a fervour not seen since the Queen’s Silver Jubilee in 1977, hundreds of street parties basked in the warm sunshine on one of the warmest days of the year.\n“There was dancing in the streets, a colourful variety of fancy dress costumes, party games and singsongs, which to the older residents brought back memories of the end of the war.”\nThese photographs capture just some of the celebrations on Tyneside, 37 years ago this summer. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-18T15:00:00.000+03:00", "crawled": "2018-05-18T17:27:28.013+03:00", "highlightTitle": ""}