{"organizations": [], "uuid": "14aaa21912d6868ca87f8ac168e202f2bd3a3982", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14619352.ece/ALTERNATES/s1200/President-Trump-Attends-National-Day-Of-Prayer-Event-In-The-Rose-Garden.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/donald-trump-should-invited-durham-14619345", "country": "GB", "domain_rank": 21960, "title": "Why Donald Trump should be invited to the Durham Miners Gala", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-06T07:00:00.000+03:00", "replies_count": 0, "uuid": "14aaa21912d6868ca87f8ac168e202f2bd3a3982"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/donald-trump-should-invited-durham-14619345", "ord_in_thread": 0, "title": "Why Donald Trump should be invited to the Durham Miners Gala", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "durham miners gala news", "sentiment": "negative"}, {"name": "durham miners gala", "sentiment": "none"}, {"name": "durham miners’ association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Why Donald Trump should be invited to the Durham Miners Gala The US President has been told he is not welcome but is it a wasted opportunity for a bit of fun at least? Share President Donald Trump (Image: Getty Images North America) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nI suggest that organisers of the Durham Miners Gala could do worse than invite US President Donald Trump to this year’s event.\nAfter all, he’s in the country at the time meeting the Queen and his various right-wing sycophants which, although agreeable to his monstrous ego, might lack in the ‘fun’ department.\nAnd I suspect Trump might turn up if the Durham Miners’ Association were to give him a call and broach their offer correctly.\nAll they would have to tell him is he is the first ever US President they have invited as the rigorous selection procedure is based on very strict levels of health and humility. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nAnd, as Trump by his own admission is the healthiest US President there has ever been, and let’s not forget the most humble, how could he refuse?\nIf he did turn up he would of course be guaranteed to give the best speech anyone has ever heard there so it’s a win-win situation for all.\nAnd, unlike his inauguration as President in Washington, I bet he would not have to tell fibs about the ‘record’ attendance numbers either.\nIt’s not going to happen of course. For his trip Trump will be steered as far away as possible from all those with a bone to pick with him - ie anyone with a brain. Durham Miners' Gala (Image: Durham Miners' Association online)\nAfter the hermetically sealed event is over no doubt in the subsequent Diary of Donald Trump aged 71 and 3/4 he will recall how he brought Britain to a standstill, stopped the clocks, found Shergar, raised the dead and most unbelievably of all, sorted Brexit out to the satisfaction of all.\nIt’s an odd thing with Trump that while his erratic and unstable behaviour, not to mention his quixotic approach to politics, will probably hasten the end of the world, you have to admit he is comedy gold.\nIn this respect in some ways it’s a waste if all people did was catcall or boo him.\nActually listening to him can offer both unintended comedic entertainment and a unique insight into the mind of a man whose name has become so synonymous with vanity and self aggrandisement that Mr Trump could usurp the place of Mr Marvelous as a Mr Man character. Read More Donald Trump UK visit: Protests planned in Newcastle and at Durham Miners' Gala\nEverywhere he goes an ever growing band of comedians and mimics follow to get fresh material.\nNot unrelated to this point is the fact that to coincide with his visit, Newcastle Stand Up To Trump is organising a rally in Newcastle city centre on Thursday, July 12 at 5pm and will march at Durham Miners’ Gala on Saturday, July 14.\nHappy to plug the event but can’t help feeling it’s a bit of a wasted opportunity. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-06T07:00:00.000+03:00", "crawled": "2018-05-06T07:09:28.026+03:00", "highlightTitle": ""}