{"organizations": [], "uuid": "55ed82041eb06920efe689b02ae697c1aee0a2a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article459274.ece/ALTERNATES/s1200/Ben-Bradshaw-2PNG.png", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/exeter-mp-says-party-must-1532144", "country": "GB", "title": "Exeter MP says party 'must do more' despite Labour success in Devon", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-04T13:42:00.000+03:00", "replies_count": 0, "uuid": "55ed82041eb06920efe689b02ae697c1aee0a2a8"}, "author": "Rom Preston-Ellis", "url": "https://www.devonlive.com/news/devon-news/exeter-mp-says-party-must-1532144", "ord_in_thread": 0, "title": "Exeter MP says party 'must do more' despite Labour success in Devon", "locations": [], "entities": {"persons": [{"name": "devon ben bradshaw", "sentiment": "none"}, {"name": "st loye", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "pinhoe", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "devon exeter", "sentiment": "none"}, {"name": "topsham", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "devonlive.com", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter MP says party 'must do more' despite Labour success in Devon Ben Bradshaw praised the party locally but said Labour must improve at national level Share Ben Bradshaw after increasing his majority in May Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nExeter MP Ben Bradshaw has called on his party to 'learn its lessons' and 'do more' across the country despite a successful night for Labour in Devon.\nMr Bradshaw, who has represented the city since 1997, praised the work of local campaigners as Labour held its majority on Exeter City Council and won control of Plymouth from the Conservatives.\nBut he said his party had to have a clear position on Brexit following a night of mixed fortunes nationally.\n\"It's very good result in Exeter as we were defending such a high position,\" Mr Bradshaw, the former culture secretary, told DevonLive.com on Friday morning. Read More\n\"I'm very pleased that we increased our majority in places like Pinhoe and won Pennsylvania.\n\"The Tories have been pushed back out to places like Topsham and St Loye’s.\n\"It's also very pleasing to see us winning in Plymouth - everyone has worked very hard that area. Labour leader Jeremy Corbyn\n\"Another Devon city has gone to Labour.\n\"For all the grumbles we have, people realised that a Labour council is a very well run council.\n\"Plymouth has been reenergised by the recent election of Luke Pollard who is fighting very hard for the city.\n\"The Tories have promised the earth for the South West but have delivered nothing - just look at the lack of funding for the rail network.\"\nDespite success in Devon, Labour lost control of key councils in local elections across England. Read More This is why police were called to an incident at a polling station in Exeter last night\nThe party failed to take several targets from the Tories, including Wandsworth in London, but along with winning back Plymouth, became the largest party in Trafford.\nThe Tories won Barnet and gained from a collapse in UKIP's vote, celebrating wins in Basildon and Peterborough.\nJeremy Corbyn met Plymouth Labour group leader Tudor Evans and winning councillors on Plymouth Hoe on Friday morning to congratulate them on gaining control of the city . Election count in Exeter\nMr Corbyn said he hoped the “whole country” would be “proud of what Labour have achieved” adding: “I love Plymouth Hoe and it’s wonderful to be here on this beautiful morning.”\nAsked about the national situation, Mr Bradshaw added: \"I think expectations we set too high.\n\"It's never very sensible to raise expectations, we need to be doing better nationally for us to win the seats we need at the next General Election. Read More Labour leader Jeremy Corbyn is in Plymouth to celebrate local election victory - live\n\"I would like us to be taking a stronger position on Brexit, the fact that the Lib Dems and Greens improved reinforces that the people of Exeter think about the issue when voting.\n\"With the Government in complete disarray, on not just Brexit but also with the social care system ,we need to be doing very well nationally and lessons should be learnt from these results.\" Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-04T13:42:00.000+03:00", "crawled": "2018-05-04T14:12:19.008+03:00", "highlightTitle": ""}