{"organizations": [], "uuid": "1cc5a50b6f2c22356906552b02acd0012a6c7768", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14603433.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-city-council-elections-labour-14603376", "country": "GB", "domain_rank": 21960, "title": "Newcastle City Council elections: Labour vs Lib Dems vs Conservatives and other parties standing", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-02T15:00:00.000+03:00", "replies_count": 0, "uuid": "1cc5a50b6f2c22356906552b02acd0012a6c7768"}, "author": "Daniel Holland", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-city-council-elections-labour-14603376", "ord_in_thread": 0, "title": "Newcastle City Council elections: Labour vs Lib Dems vs Conservatives and other parties standing", "locations": [], "entities": {"persons": [{"name": "duncan crute", "sentiment": "none"}, {"name": "tom gordon", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "negative"}, {"name": "labour labour", "sentiment": "none"}, {"name": "invalid email voters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nVoters heading to the polls in Newcastle on Thursday have the opportunity to shape the future of the city for years to come.\nWith every seat on the council up for grabs - rather than the usual one third - the outcome of this week’s elections will be crucial in deciding how the city responds to issues such as Brexit and the North of Tyne devolution.\nAhead of the election, here are some of the key manifesto pledges from the major parties battling it out. Duncan Crute, Nick Forbes and Tom Gordon Labour\nLabour has controlled Newcastle City Council since 2011 and currently holds 53 of the city’s 78 seats. The party’s manifesto includes pledges to:\n• Invest in infrastructure (transport, broadband and regeneration schemes) to make the city an attractive place to locate and grow a business or charity\n• Become the first ‘Heart Start City’ by ensuring defibrillators are available in a range of places, including businesses, schools and public buildings and encouraging people of all ages to learn basic life support\n• Run a high profile ‘anti-littering’ enforcement campaign, handing out on-the-spot fines to offenders, and aim for Newcastle to be the first UK city to eliminate single-use plastics\n• Work with developers and the Government to accelerate the rate of housebuilding in Newcastle, prioritising the use of brownfield sites\n• Invest in innovative pilots to test new ways of providing social care support and explore the financial viability of developing ‘in house’ adult care services\nCouncil leader Nick Forbes said: “We are guided, in the tough decisions we have to make, by our values of fairness, inclusion and social justice. We are inspired by the spirit of the communities in our city, the commitment of our businesses, the professionalism of our public sector partners.\n“Our team of Labour councillors comes from all walks of life - but we have one thing in common. We are working hard to make Newcastle a great place to live, work and visit, despite the challenges we face.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Liberal Democrats\nThe Lib Dems were in control from 2004 to 2011, and will see this year’s ‘all out’ elections as a huge opportunity to reduce Labour’s majority. Their policies include:\n• Improving street cleaning, bin collections, recycling rates, and grass cutting\n• Halting plans to turn over control of the city’s parks and allotments to a new independent charitable trust\n• Restoring school crossing patrols city-wide\n• Reviewing all council spending in order to put more money into front line services\n• Campaigning for local policing that responds to community needs\nNewcastle Liberal Democrats party chair Tom Gordon said: “We believe the city deserves a better, more responsive council than it has at present. Residents are increasingly frustrated with this council’s lack of interest in local neighbourhoods, failure to prioritise basic services, rising council tax, and poor customer service.\n“We are finding considerable disillusionment with the Labour council on the doorsteps and as the main opposition to Labour on the city council we expect to make progress and take a number of Labour seats.”\nOut of the picture in Newcastle for more than 20 years without a seat on the council, the Tories have made four key promises in a bid to appeal to voters in the city:\n• Reversing the 100% increase on garden waste collection charges\n• Reinstating school crossing patrols\n• Looking at ways parking in Newcastle can be improved\n• Cleaning and tidying the city\nDuncan Crute, who is standing in the Chapel ward, said: “Every ward we have targeted has said that the bins situation is a disaster. There has been a big increase in litter under Labour.\n“People are up in arms about school crossing patrols being cut too, even people who don’t have children.\n“At the same time that the council did that, they gave out pay increases to council executives. Labour’s slogan should be, ‘for the few, not the many’. Read More Gateshead local elections 2018: Candidates, wards, how to vote and other essential information Newcastle upon Tyne Community First Party\nThe independent campaigning organisation is fielding eight candidates in five wards in the west of the city. Its manifesto includes:\n• Tackling potholes and improving bin collections\n• Reintroducing school crossing patrols or, in locations where this is not possible, establishing a zebra or pelican crossing\n• Creation of a publicly-owned energy company giving cheaper and more sustainable energy to local residents\n• Creating four or five new Local Area Committees to make key decisions at a more local level.\nParty leader Jason Smith, who is standing in Denton and Westerhope, said: “The Newcastle Community First Party cannot pretend we can control the council after May 3 but we can provide a strong voice for our communities in the council chamber and, in the event of a hung council, independent and community councillors could hold the balance of power.\n“If elected, every one of our councillors will be far more accountable to local people than current Labour and Lib Dem councillors. Our manifesto sets out our plans to change Newcastle for the better and the priorities that Newcastle First councillors will campaign for.” Read More Have you registered to vote in the local elections? The deadline is approaching FAST Green Party\nThe Greens are fielding 28 candidates across Newcastle, but are particularly hopeful in Heaton after coming second to Labour in a South Heaton by-election last year. Their manifesto pledges include:\n• Raising standards for private rented tenants\n• Tackling litter and improving the city’s recycling rates\n• Support high streets and local businesses\n• Heaton candidate Andrew Gray said: “There are a lot of people talking about the Greens and we have had really positive feedback. I think there are a lot of people who might not normally vote for us but are quite conflicted about who to vote for, so they may use one of their three votes for a Green candidate.\n“The key Green policy is around the local economy and resisting austerity by building up our local neighbourhood economies.” UKIP\nUKIP is fielding eight candidates in Newcastle and has been approached for a comment on its policies for the city.\nThere are a further 10 independent candidates standing, one member of the Trade Unionist and Socialist Coalition, and a Communist Party of Britain candidate. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-02T15:00:00.000+03:00", "crawled": "2018-05-02T16:19:32.000+03:00", "highlightTitle": ""}