{"organizations": [], "uuid": "e71e92c77668914fcaa546f982f80fd9c4607f13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1522130.ece/ALTERNATES/s1200/RBS-LoughboroughPNG.png", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicester Mercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/leicester-news/royal-bank-scotlands-loughborough-branch-1522100", "country": "GB", "domain_rank": 48128, "title": "Royal Bank of Scotland's Loughborough branch to close in national high street cull", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-01T20:14:00.000+03:00", "replies_count": 0, "uuid": "e71e92c77668914fcaa546f982f80fd9c4607f13"}, "author": "Dave Owen", "url": "https://www.leicestermercury.co.uk/news/leicester-news/royal-bank-scotlands-loughborough-branch-1522100", "ord_in_thread": 0, "title": "Royal Bank of Scotland's Loughborough branch to close in national high street cull", "locations": [], "entities": {"persons": [], "locations": [{"name": "loughborough", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "devonshire square", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "market street", "sentiment": "none"}], "organizations": [{"name": "royal bank of scotland", "sentiment": "negative"}, {"name": "google maps", "sentiment": "none"}, {"name": "rbs group", "sentiment": "none"}, {"name": "natwest", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "royal bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Royal Bank of Scotland's Loughborough branch to close in national high street cull It is closing as part of a national cull Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Loughborough branch of the Royal Bank of Scotland is among 162 branches set to close across England and Wales in the next few months.\nAlmost 800 jobs will go as a result of the closures, including staff at the Devonshire Square branch in Loughborough town centre, announced today by RBS Group, which also owns NatWest.\nLeicester's city centre branch, in Market Street, is one of just 105 branches being spared.\nThe lender, which is still 72 per cent owned by the taxpayer after the Government bailed it out following the 2008 financial crisis, said too many of its high street banks were too close together, resulting in \"overlap\". The Royal Bank of Scotland branch in Devonshire Square, Loughborough (Image: Google Maps)\nA statement from the group read: \"Following a review of the branch network in England and Wales a decision has been taken to close 162 Royal Bank of Scotland branches.\n\"As a result of this process, around 792 roles will be made redundant, and we will seek to support our colleagues with the option to leave on a voluntary basis.\"\nNone of the 650 NatWest branches in England and Wales will be affected.\nA total of 109 branches will close in late July and August 2018. These branches are within 0.6 miles of another Royal Bank of Scotland or NatWest branch, the group said.\nA further 53 branches will close in November 2018, all of which are between 0.6 and 2.5 miles of another Royal Bank of Scotland or NatWest branch. Read More Business leaders hope to sway Brexit debate after meeting Minister for Exiting the EU\nAn RBS spokesman said: \"We now have two branch networks operating in close proximity to each other; NatWest and Royal Bank of Scotland, in England and Wales.\n\"As a result we have had to review our overall branch footprint in England and Wales and we've made the difficult decision to close a number of Royal Bank of Scotland branches. Customers of Royal Bank of Scotland in England and Wales will be able to use NatWest branches instead for their everyday banking needs.\n\"We now provide our customers with more ways to bank with us than ever before - customers can choose from a range of digital, face-to-face and local options to suit their needs.\"\nRBS also said that since 2014, branch transactions across its English and Welsh operations were down 30 per cent, while there has been a 53 per cent increase in the number of customers using mobile banking, and mobile transactions have increased by 74 per cent. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-05-01T20:14:00.000+03:00", "crawled": "2018-05-01T23:35:57.052+03:00", "highlightTitle": ""}