{"organizations": [], "uuid": "13339204f3404a1859540129dc4730ba695133e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1599655.ece/ALTERNATES/s1200/General-Data-Protection-Regulation.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/what-gdpr-how-affect-me-1599612", "country": "GB", "domain_rank": 48128, "title": "What is GDPR and how does it affect me? - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "13339204f3404a1859540129dc4730ba695133e0"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/what-gdpr-how-affect-me-1599612", "ord_in_thread": 0, "title": "What is GDPR and how does it affect me? - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "steve walker", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "peritus learning", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What is GDPR and how does it affect me? Too many businesses \"yet to register with the Information Commissioner in time this week’s new data protection laws\" Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nToo many businesses have yet to register with the Information Commissioner in time this week’s new data protection laws, says one industry expert.\nIt means many could be at risk of fines for holding private information on people and clients illegally.\nThe boss of one Leicester training company that is helping firms prepare for the change said the limited number of firms registering to lawfully collect, hold, share and use personal information about clients or private customers reflected a general degree of non-compliance among UK businesses.\nSteve Walker, managing director of Peritus Learning in Leicester’s Dock workspace , said lack of registration meant many businesses could be breaking the law when they collect personal information.\nAnd he said that meant past and present customers could have an automatic claim for compensation, with claims management companies already lining up to pursue offenders.\nThe new EU data protection laws which come into effect on Friday May 25 are proving to be a headache for members of the public as well as businesses.\nFor the past few weeks many people have been getting e-mails from businesses asking if they can hang onto our electronic data.\nLikewise office workers are being made to tidy up the information they store on their computers, phones, and even on their desks. (Image: iStockphoto)\nThe General Data Protection Regulation (GDPR) is an EU-wide law giving greater power to regulators to penalise companies that mishandle personal data or are not transparent about how their business uses it.\nFor members of the public, it brings new powers that require firms to obtain clear consent from them before processing their data.\nIt also grants users the right to easily access the data collected from them and find out how it is being used. Everything you need to know about GDPR\nWhen does it kick in?\nThis week. Friday, May 25 will be the day that the new laws come into force. This is why your inbox has been spammed full of companies asking you to sign up before the laws change.\nWhat will happen?\nCurrently, businesses collect personal data once customers sign up to updates or create an account with them.\nTick-boxes, which are pre-selected, are largely ignored and need to be unselected to prevent personal data being retained. These will become a thing of the past and, therefore, making storing personal data more difficult.\nWhat do members of the public need to do?\nThe law will also stop e-mail updates coming in from some of the businesses you have previously been subscribed to.\nTo keep receiving these e-mails, you’ll need to opt-in. This is again due to the pre-selected tick-boxes.\nThe crux of the matter is, customers must now opt-in to receive updates or allow personal data to be stored, rather than opt-out as it previously was.\nSo, if you ignore tick-boxes in the future, your inbox and personal data remains safe.\nWhat impact will it have on businesses?\nAs well as what has already been mentioned, the changes will ensure a few more things.\nIt will make sure that businesses and public-sector organisations have consent to store individual data and that it is treated with respect.\nThat they are transparent with data and show customers exactly what personal information they have on file when requested to do so.\nIt will also make sure that businesses can justify exactly why they have personal data, and what they are using it for.\nWhy is it changing?\nIt is to ensure greater control over private data and will make data protection laws across the EU come in line.\nThe government revealed at the time of the announced changes that Research shows that more than 80 per cent of people feel that they do not have complete control over their data online.\nWhat are the government saying?\nMatt Hancock, Minister of State for Digital, said at the time of the announced changed last summer: “Our measures are designed to support businesses in their use of data, and give consumers the confidence that their data is protected and those who misuse it will be held to account.\n“The new Data Protection Bill will give us one of the most robust, yet dynamic, set of data laws in the world.\n“The bill will give people more control over their data, require more consent for its use, and prepare Britain for Brexit.\n“We have some of the best data science in the world and this new law will help it to thrive.”\nCurrently businesses and public bodies can charge £10 to release personal information.\nGDPR means requests for personal information can be made free-of-charge and must be released within one month.\nFollowing Brexit, organisations in the UK who process data of individuals in the EU will still need to be compliant with the GDPR.\nIt is also anticipated that UK data protection laws will remain broadly in line with the GDPR.\nMr Walker said any suggestion that a company was criminally or unlawfully collecting personal information by failing to apply the new rules could put it out of business, with the register of compliant companies free for everyone to see on the Information Commissioner’s website.\nHe said training was a prerequisite for any business to ensure it was covered, and a package his business offered, for instance, provided up to £250,000 worth of insurance cover against any fines or data claims for businesses with fewer than 250 employees.\nHe said: “For any organisations who are unsure the first thing the ICO will ask for in the event of a reported data breach is your training records.\n“They will also want to talk to a designated GDPR lead person in your business with an expectation that they have a good understanding of the legislation.\n“The ICO will have a fair and transparent process to work to, however being non-compliant and having no formal plan to introduce compliance to your organisation will result in potential fines.\n“This is essentially the first global law and needs to be taken as seriously as the Health and Safety Act when it came in all those years ago.” Read More\n“So many organisations appear to be confused – and attending seminars, training frontline staff, or just updating your IT infrastructure is not enough to become compliant. Read More Business leaders hope to sway Brexit debate after meeting Minister for Exiting the EU\n“Too many directors are also not taking enough interest and passing responsibility to junior members of staff. Directors could be personally responsible for data breaches in their organisations, so why would they not take this seriously?\n“Nobody is expecting all organisations to be 100 pert cent compliant on May 25, however you need to have an intended plan and start to work towards this.” Like us on Facebook ", "external_links": [], "published": "2018-05-24T03:00:00.000+03:00", "crawled": "2018-05-24T09:24:07.000+03:00", "highlightTitle": ""}