{"organizations": [], "uuid": "a92eeffd98f51b7904cbb6565a2efb9c7406ebd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1570032.ece/ALTERNATES/s1200/european-union-eu-project-united-states-of-europe-brexit-juncker-958718.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/devon-mp-explains-cracks-eu-1570039", "country": "US", "title": "Devon MP explains cracks in EU unity that could tear block APART over Brexit - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-05-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "a92eeffd98f51b7904cbb6565a2efb9c7406ebd3"}, "author": "Alessandra Scotto Di Santolo", "url": "https://www.devonlive.com/news/devon-news/devon-mp-explains-cracks-eu-1570039", "ord_in_thread": 0, "title": "Devon MP explains cracks in EU unity that could tear block APART over Brexit - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}], "organizations": [{"name": "brexit eu", "sentiment": "none"}, {"name": "brexit - devon live news devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tiverton & honiton", "sentiment": "none"}, {"name": "tiverton con club", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "daily express", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Devon MP explains cracks in EU unity that could tear block APART over Brexit EU will be faced by increasing rebellions from many of its citizens if it continues to pursue its unification dream says Neil Parish Share Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nThe “EU will have a problem in the long run” Tiverton’s MP has claimed.\nFormer MEP and now Tiverton & Honiton MP Neil Parish claimed the European Union will suffer from increased challenges post-Brexit as member states' citizens will continue to oppose to its unification project.\nSpeaking to the Daily Express , the Tory MP claimed the EU will be faced by increasing rebellions from many of its citizens if it continues to pursue its unification dream.\nMr Parish argued that the prospect of a rising anti-European sentiment in the bloc will also push EU key negotiators to continue to play hard in the Brexit negotiations. Read More Tiverton Con Club the best in the west after plethora of awards\nHe said: “One of the problems of getting a deal with the EU is that they are concerned about contagion and that's why they will not want to give Britain a very good deal because they don't want us to have a better deal out than in.\n“On the other hand they still have to look at the prosperity of the whole of the EU, so it's a balancing act.\n“Although I was a Remainer, I also had ten years in the European Parliament, where I saw the Commission driving towards this unified states of Europe.\n“Britain never wanted to go there but nor do quite a lot of the population of France, Germany, and others.\n\"But the political elite sees this as a driving force and I think that's going to be a problem for the EU in the long run.\n“But of course that's not a British problem, that's an EU problem, but it may be a problem for us as we leave to get the deal.”\nA rising anti-European sentiment across the Continent has already led to the success of populist parties in Hungary, Austria and Italy. Read More Leaving EU a concern in Tiverton say Devon for Europe volunteers\nThe soon-to-be-announced Italian government was confirmed on Thursday by Lega leader Matteo Salvini and Five Star Movement eurosceptic leader Luigi di Maio as the pair agreed to form a coalition following the inconclusive result of the March 4 Italian election.\nBoth leaders have pledged to renegotiate the EU's fiscal rules to allow Italy to spend more. 5-Star has rowed back on a primise to hold a referendum on Italy's membership of the eurozone, but the League still calls the euro a \"flawed currency\" and wants to exit it as soon as is politically feasible.\nSetting up a possible institutional clash in Italy, President Mattarella made clear on Thursday that he did not want to see any confrontation with Brussels.\n\"To think that one can go-it-alone in Europe is knowingly deceptive in front of public opinion,\" Mattarella said in a pointedly pro-European speech at a conference on the state of the European Union in the central town of Fiesole.\nReferring to the euro, he said: \"We have a currency that is capable of being a concrete anchor in international relations, a role that no national currency can perform.\" Like us on Facebook ", "external_links": [], "published": "2018-05-15T03:00:00.000+03:00", "crawled": "2018-05-15T22:33:48.002+03:00", "highlightTitle": ""}