{"organizations": [], "uuid": "2f3596d686febaf4acc49ae425a48c205ef374b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14716393.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/how-brexit-affected-eu-immigration-14716319", "country": "GB", "domain_rank": 21960, "title": "This is how Brexit has affected EU immigration in the North East - and it might surprise you", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-29T07:00:00.000+03:00", "replies_count": 0, "uuid": "2f3596d686febaf4acc49ae425a48c205ef374b0"}, "author": "Sophie Doughty", "url": "https://www.chroniclelive.co.uk/news/north-east-news/how-brexit-affected-eu-immigration-14716319", "ord_in_thread": 0, "title": "This is how Brexit has affected EU immigration in the North East - and it might surprise you", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThere are more people from the European Union living in the North East now than there were in the year of the Brexit referendum.\nLatest figures from the Office for National Statistics have revealed there were around 60,000 Europeans living in our region in 2017.\nThat’s up by 15% from the estimated 52,000 EU nationals that called the North East home in 2016.\nThe rise in EU residents in the North East is largely down to County Durham, which has seen numbers more than double from 4,000 to 9,000 over the course of the year. European Union and Union flags outside the Houses of Parliament in Westminster (Image: PA)\nThis is a much sharper increase than that seen nationally.\nAcross the UK, the number of EU nationals has gone up by 5%, from 3.5 million in 2016 to 3.7 million last year.\nIt means people from the EU now make up 6% of the total population of the country - one in every 17 people.\nHowever, despite the increase in numbers seen in the North East, EU residents only make up a very small proportion of the total population.\nThe 60,000 EU nationals living in our region make up just 2% of all people living here - a third of the proportion seen across the UK.\nBritain voted to leave the EU in June 2016. Patrycja Charlton, of ABS Service Accountancy and Bookkeeping Ltd in Fenham, Newcastle, who is originally from Poland\nFollowing the referendum vote some immigrants told how they had been made to feel unwelcome in the region.\nPatrycja Charlton, who moved to Consett from Poland in 2007 and is married to a British man, said that the atmosphere for Polish people in the UK changed as the referendum debate intensified.\nAnd she told of her fears that her young daughter would be targeted for speaking Polish.\nShe said: “I don’t know how to explain to her that we can use Polish just as much as English.\n“I would love her to be proud of both her nationalities but the situation at the moment doesn’t make that easy. Read More North East MP slams Tories after she becomes target of Brexit campaign\n“I would love her to have two languages, but right now, if I were to speak in Polish to her on the bus, I can’t guarantee I would feel safe.\n“After the vote, friends rang me up trying to show me that it’s only extremists who think this way.\n“They said, Great Britain is your country too, you paid your taxes and you’ve earned your right to be here.\n“But I don’t want to live somewhere where it’s starting to feel difficult to leave my house, difficult to go to the shop.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-29T07:00:00.000+03:00", "crawled": "2018-05-29T07:21:17.020+03:00", "highlightTitle": ""}