{"organizations": [], "uuid": "d093249524f5f64e3ee87694b282c1dcd1b0470f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1574218.ece/ALTERNATES/s1200/Devon-County-Show.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/whats-on/whats-on-news/join-devon-county-show-2018-1576640", "country": "US", "title": "Join us at Devon County Show 2018 as the county's premier show gets underway - live updates - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.199, "site_type": "news", "published": "2018-05-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "d093249524f5f64e3ee87694b282c1dcd1b0470f"}, "author": "Richard Amofa", "url": "https://www.devonlive.com/whats-on/whats-on-news/join-devon-county-show-2018-1576640", "ord_in_thread": 0, "title": "Join us at Devon County Show 2018 as the county's premier show gets underway - live updates - Devon Live", "locations": [], "entities": {"persons": [{"name": "edward darke", "sentiment": "none"}], "locations": [{"name": "devon county", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now\nMore than 90,000 visitors are expected to flock to the 123rd Devon County Show this weekend as the county's best livestock, local food and drink, country life and entertainment is showcased.\nOrganisers say that celebrity chefs will be demonstrating their skills in the food and drink pavilion alongside a huge variety of local food and drink plus a host of entertainment.\nThere'll be plenty of familiar attractions and faces at the show, but also some new stages and events and possibly the biggest Royal Wedding party in the county. Read More What is the weather forecast for the Devon County Show 2018?\nShow President and South Devon farmer Edward Darke said: “I think everyone in Devon farming will be looking forward to the County Show even more than usual this year, after the winter and spring that we’ve had.”\n“What with the weather and all the Brexit uncertainty it will be a relief to be reminded of all the good things about farming in Devon - the quality of our livestock, the strength of our supply industry, the wonderful food and drink that we produce and the incredibly strong sense of community that there is among the family farms of Devon. (Image: Devon County Show)\n“That doesn’t mean that we’ll be forgetting the bigger picture, by any means. There’ll be plenty of talk about farming politics and the problems caused by the weather. But it will help to put all of that in its proper context, and allow us to have a thoroughly good time in the process.” Read More\nJoin us for live updates throughout the day, including all the best pictures, things to eat and goings on at one of the showcase events of the county calendar. 14:02 Check out our Facebook Live!\nWe’ve just been on a tour of the Devon County Show. Check it out, here: https://www.facebook.com/devonlivenews/videos/1890699400976713/ 12:27 This is what people are saying about the Devon County Show 10:26 Try the chocolate liqueur - it's delicious 10:26 ", "external_links": [], "published": "2018-05-17T03:00:00.000+03:00", "crawled": "2018-05-17T10:00:54.006+03:00", "highlightTitle": ""}