{"organizations": [], "uuid": "25582854dd4f3420a02b6a2581e2d4da4184d82a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14640147.ece/ALTERNATES/s1200/Frank-Recruitments-new-offices-in-Tampa-Florida.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-firm-frank-recruitment-opens-14640067", "country": "GB", "domain_rank": 21960, "title": "Newcastle firm Frank Recruitment opens office in Florida to continue global growth", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-10T16:10:00.000+03:00", "replies_count": 0, "uuid": "25582854dd4f3420a02b6a2581e2d4da4184d82a"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-firm-frank-recruitment-opens-14640067", "ord_in_thread": 0, "title": "Newcastle firm Frank Recruitment opens office in Florida to continue global growth", "locations": [], "entities": {"persons": [{"name": "james lloy", "sentiment": "none"}, {"name": "james lloyd-townshend", "sentiment": "none"}, {"name": "frank recruitment", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "frank recruitment", "sentiment": "negative"}, {"name": "netsuite", "sentiment": "none"}, {"name": "frank recruitment group", "sentiment": "none"}, {"name": "share frank recruitment", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "microsoft dynamics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle firm Frank Recruitment opens office in Florida to continue global growth The software recruitment firm is looking to create 100 jobs in Tampa following its move Share Frank Recruitment's new offices in Tampa, Florida (Image: Unknown) Share Get business Thank you for subscribing!\nNewcastle software recruitment firm Frank Recruitment has continued its US expansion after opening an office in Tampa, Florida.\nThe company , which primarily searches for talent for Microsoft, has created 100 jobs in Tampa ahead of its official opening on June 4.\nThe opening is Frank Recruitment’s sixth office launch in the US, adding to sites in Philadelphia, Dallas, San Francisco, and two in New York City.\nThe team in Tampa will focus on delivery in the NetSuite, Microsoft Dynamics, and Cloud recruitment markets, and will be recruiting for a number of jobs ranging from graduate-level roles to experienced sales and recruitment professionals positions.\nJames Lloyd-Townshend, chief executive of Frank Recruitment Group, said: “We’re very proud to open a new office location in Florida. James Lloyd Townshend, CEO of Frank Recruitment Group\n“Tampa is a great location due to a fast-growing technology workforce and a millennial population looking for exciting career opportunities. It’s a fantastic location, and we’re excited to bring the best local talent on board to help us build our presence in the Americas.”\nFrank Recruitment’s expansion in the US has helped the firm continue to grow its revenue by 40% year-on-year. It has also been recognised as the fastest growing recruitment consultancy firm in Europe by the Financial Times. Read More North East MPs call for SECOND Brexit vote, splitting from Jeremy Corbyn\nIn March the recruitment specialist announced it was creating 100 jobs in Newcastle after moving into new headquarters in the city centre. The firm moved into the St Nicholas Building opposite the historic Black Gate, allowing it to house all of its North East staff under one roof.\nSimilarly to the North East, Tampa is looking to become a major player in the tech landscape. Recent figures showed the US city increased the size of its tech workforce by 55% between 2011 and 2016. Read More Northumberland developer Arch buys Ashington business park to create hundreds of jobs\nBob Buckhorn, major of the City of Tampa, said: “We’re excited to have Frank Recruitment Group opening an office in Tampa.\n“They recognise that this city is becoming a magnet for some of the best talent in the country, and that the potential for growth here is outstanding. We thank them for choosing Tampa and wish them a prosperous future in this market.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-10T16:10:00.000+03:00", "crawled": "2018-05-10T19:06:48.001+03:00", "highlightTitle": ""}