{"organizations": [], "uuid": "78045ce4b3924943678e56bdce73d5249579771d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1366360.ece/ALTERNATES/s1200/mothercarePNG.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/mothercare-closing-50-stores-devon-1577776", "country": "US", "title": "Mothercare is closing 50 stores - will Devon outlets be axed?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-17T13:57:00.000+03:00", "replies_count": 0, "uuid": "78045ce4b3924943678e56bdce73d5249579771d"}, "author": "William Telford", "url": "https://www.devonlive.com/news/business/mothercare-closing-50-stores-devon-1577776", "ord_in_thread": 0, "title": "Mothercare is closing 50 stores - will Devon outlets be axed?", "locations": [], "entities": {"persons": [{"name": "david wood", "sentiment": "none"}, {"name": "mark newton jones", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "drake circus", "sentiment": "none"}], "organizations": [{"name": "mothercare", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "cva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nMothercare has announced it is closing 50 under-performing stores as it embarks on a £113.5million rescue plan.\nThe company, which has outlets in Exeter, Torquay and Plymouth says it will reveal exactly which shops will shut on Thursday afternoon.\nThe closures, which will result in hundreds of job losses, will be carried out through a company voluntary arrangement (CVA) – a move which allows companies to close loss-making shops and secure rental discounts.\nThe Plymouth store in Drake Circus is already earmarked for shutting because the company is opening a huge new out-of-town store in October 2018. The store has slashed the prices of hundreds of toys for little ones\nBut in April 2018 Mothercare said the Drake Circus mall outlet may still be trading too because its lease does not expire until September 2021.\nIn total Mothercare employs about 3,000 people across 137 outlets.\nAnd, sensationally, Mark Newton Jones, who was given the elbow as chief executive in April 2018, will return to take the top job.\nThe man that had been brought in to replace him, David Wood, will now become managing director. Read More Luxury car consumed by water after owner parks on tidal road\nAs part of the restructuring, Mothercare also announced a refinancing package worth up to £113.5million.\nIt comprises £28million through an equity capital raising, an extension of its existing debt to £67.5million, £18million in shareholder and trade partner loans.\nThe troubled pram and pushchair company, which has seen sales plummet has confirmed it still has plans to open in a 15,000sq ft unit at the multi-million pound Plymouth Gateway Retail Park, under construction at Marsh Mills, however.\nThe retail chain has already said it will move out of its 6,877sq ft unit on the ground floor of Drake Circus mall.\nBut the company said it can’t confirm when that store will close.\nIt has put the lease on the mall unit on the market and is inviting offers.\nBut with the lease expiring at the end of September 2021 it means Plymouth may have two Mothercare stores come October 2018.\nThe spokesperson said: “Unfortunately we do not have a closure date (for the mall unit). We have no confirmed plans at the moment.”\nMothercare was also tight-lipped about the future of the Early Learning Centre in Cornwall Street, Plymouth.\nThe company owns that brand too and has put the lease for the 2,542sq ft store on the market.\nThe lease expires in December 2020.\nThe spokesperson said: “There are currently no confirmed plans.” Read More House of Fraser holds crucial talks on plan to close stores\nIt is understood Mothercare will reveal the 50 stores that will close in a full statement today, May 17.\nChairman Clive Whiley said: \"The recent financial performance of the business, impacted in particular by a large number of legacy loss-making stores within the UK estate, has resulted in an unsustainable situation for the Mothercare brand, meaning the group was in clear need of an appropriate resolution.\n“These comprehensive measures provide a renewed and stable financial structure for the business and will drive a step change in Mothercare's transformation.\n“These measures provide a solid platform from which to reposition the group and begin to focus on growth, both in the UK and internationally.”\nRetailers across the board have been battered by weak consumer confidence off the back of soaring Brexit-fuelled inflation.\nThey have also had to contend with surging wage costs and eye-watering business rate hikes.\nSince January, Toys R Us and Maplin have filed for administration while fashion retailers such as New Look and Select have embarked on radical store closure programmes. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-05-17T13:57:00.000+03:00", "crawled": "2018-05-17T14:10:37.070+03:00", "highlightTitle": ""}