{"organizations": [], "uuid": "8241e56cc36db3bc9516ddc2ceaffe279b580b08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14562194.ece/ALTERNATES/s1200/Sunderland-v-Burnley-Premier-League.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/ellis-shorts-1257m-gift-sunderland-14613962", "country": "GB", "domain_rank": 21960, "title": "Ellis Short's £125.7m gift to Sunderland - Black Cats make £9.9m loss in latest accounts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-04T11:00:00.000+03:00", "replies_count": 0, "uuid": "8241e56cc36db3bc9516ddc2ceaffe279b580b08"}, "author": "Stuart Rayner", "url": "https://www.chroniclelive.co.uk/sport/ellis-shorts-1257m-gift-sunderland-14613962", "ord_in_thread": 0, "title": "Ellis Short's £125.7m gift to Sunderland - Black Cats make £9.9m loss in latest accounts", "locations": [], "entities": {"persons": [{"name": "ellis short", "sentiment": "negative"}, {"name": "jordan pickford", "sentiment": "none"}, {"name": "stewart donald", "sentiment": "none"}, {"name": "ricardo alvarez", "sentiment": "none"}, {"name": "martin bain", "sentiment": "none"}, {"name": "short", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "sunderland - black cats", "sentiment": "negative"}, {"name": "sunderland afc", "sentiment": "negative"}, {"name": "eastleigh", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "everton", "sentiment": "none"}, {"name": "black cats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Sunderland AFC updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe size of Ellis Short’s parting gift to Sunderland has been hinted at in the club’s latest accounts.\nShort has handed over control of the Black Cats to an “international consortium” fronted by Eastleigh chairman Stewart Donald. As part of the deal, Short will wipe out the club’s existing debt.\nIt is not expected to have moved far from the £125.7m in the latest accounts, which run from August 1, 2016 to July 31, 17 – when the Black Cats were relegated from the Premier League.\nThey made a £9.6m pre-tax loss, a big improvement on the previous year’s £33m as chief executive Martin Bain’s cost-cutting tenure began, but not enough to stop the debt rising by £15.3m.\nThe loss was mitigated by the sale of home-grown goalkeeper Jordan Pickford to Everton for £25m, rising to £30m depending on performances, but offset by the £9.7m fee for Ricardo Alvarez.\nShort injected an extra £19.5m over the 12 months to keep borrowing to the banks relatively stable. He was owed around £73m by the summer of 2017. Even at that stage he had written off more than £100m loaned to the club.\nSunderland paid nearly £8m interest on their bank loans in 2015-16.\nShort first became involved with the Black Cats as part of Niall Quinn’s Drumaville consortium and took a controlling interest in 2008. He took ownership the following year, and installed himself as chairman in 2011. Sunderland owner Ellis Short (Image: Sunderland AFC)\nThe American financier had been actively looking to sell for at least 18 months, and was in talks with interested parties in the summer of 2017. He called a halt when nothing was resolved by June 30, the day the Black Cats returned for pre-season training.\nBain took over as chief executive on July 1, 2016, with a brief to reduce costs as Short began to lose interest in it, but wages increased slightly from around £83.8m to £84.4m, the 13th highest in the league.\nThe wages to turnover ratio did improve, however, from 77.6% to 66.8%. The threshold for Uefa’s financial fair play regulations is 70%. Read More £1.24m - Martin Bain's reward for Sunderland's Premier League relegation is revealed\nSunderland’s players took a 40% wage cut on relegation, with the exception of Jack Rodwell, who had the reduction to his £70,000-a-week pay deferred by a year. The fall in wages is roughly proportional to the expected post-relegation drop in revenue.\nThe 2016-17 season was the first of a new record-breaking television deal and despite finishing bottom of the table and appearing on live TV less often than their rivals, the Wearsiders still received £95.6m in broadcast fees and prize money. Newcastle United banked less than £8m in winning the Championship that season.\nThe blow was softened by a £45m “parachute payment”. They will receive £35m next year and £16m in 2019-20.\nThe club has lost around £600,000 a week in the Championship. Short covered those costs, but provided only £1.25m for transfer fees. The club signed 15 players in the Championship.\nPlayer trading and amortisation costs for 2016-17 totalled £10.6m and includes instalments on previous transfers.\nGiven that Pickford pulled off a clean sweep of the main prizes at Everton’s end-of-season awards and has a good chance of being England’s first-choice goalkeeper at this summer’s World Cup, the odds of receiving the full £30m are in the Wearsiders’ favour.\nAt the time of Pickford’s transfer, the world record fee for a goalkeeper was £33m, though days later Manchester City extended it to £35m with the purchase of Ederson.\nAlvarez’s transfer fee is listed as an “exceptional operating expense”.\nSunderland signed the Argentinian on a season-long loan in 2014-15, and agreed to buy him if they avoided relegation. They tried to back out of the arrangement, citing a knee injury, and spent two years going through the courts while Alvarez was allowed to join Sampdoria as a free agent. The Court of Arbitration for Sport ruled the Black Cats had to pay the full fee, increased by the falling post-Brexit value of the pound against the euro.\nSunderland’s debt was a major millstone around their neck as they dropped from the Premier League to League One in two seasons – interest rates on the bank loan and banking facilities were higlighted in the club’s strategic report as “the main market risk to the business”. In wiping it out, Short has given Donald a relatively free hand to rebuild. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-04T11:00:00.000+03:00", "crawled": "2018-05-04T14:11:48.010+03:00", "highlightTitle": ""}