{"organizations": [], "uuid": "2c322c8dee371d942c6705ad2824eb0d4a7de109", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10058294.ece/ALTERNATES/s1200/JS47095524.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/ricardo-alvarez-almost-difference-between-14613963", "country": "GB", "domain_rank": 21960, "title": "Ricardo Alvarez almost the difference between Sunderland breaking even and making pre-tax loss", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-04T11:17:00.000+03:00", "replies_count": 0, "uuid": "2c322c8dee371d942c6705ad2824eb0d4a7de109"}, "author": "Stuart Rayner", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/ricardo-alvarez-almost-difference-between-14613963", "ord_in_thread": 0, "title": "Ricardo Alvarez almost the difference between Sunderland breaking even and making pre-tax loss", "locations": [], "entities": {"persons": [{"name": "ricardo alvarez", "sentiment": "negative"}, {"name": "alvarez", "sentiment": "none"}, {"name": "ellis short", "sentiment": "none"}], "locations": [{"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "court of arbitration for sport", "sentiment": "none"}, {"name": "inter milan", "sentiment": "none"}, {"name": "football league", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "black cats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ricardo Alvarez of Sunderland (Image: 2014 Getty Images) Share Get Sunderland AFC updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nSunderland were not kidding when they listed Ricardo Alvarez’s transfer fee as “an exceptional operating expense” in their annual accounts.\nThe unwanted playmaker was the difference between the Black Cats breaking even and making a loss in 2016-17.\nThe Wearsiders recorded a pre-tax loss of £9.6m for their final Premier League season before dropping into the Football League.\nThat was the year they wasted £9.6m on a player they never took receipt of. With a two-year court battle which ended in defeat at the Court of Arbitration for Sport in Switzerland, the real cost will have been much higher.\nThere was no better unwitting symbol of Ellis Short’s failed regime than Alvarez.\nSunderland loaned the Argentinian playmaker from Inter Milan in 2014-15 with an agreement to make the deal permanent if they avoided relegation that season.\nAlvarez’s impact was minimal, only starting five league games, and scoring his solitary goal in an FA Cup replay at Championship Fulham.\nWith the coach who signed him, Gustavo Poyet, replaced by Dick Advocaat, the Black Cats did not want him back, and nor did Inter. Sunderland tried to back out of the deal, claiming Alvarez’s knee injury made him damaged goods, and that the Italian club refused to allow an operation.\nRather than take their medicine, the Wearsiders headed to the courts, telling Alvarez not to return. It took so long to resolve that Fifa took the player out of his limbo, allowing him to join Sampdoria as a free agent. Read More Ricardo Alvarez's £9m non-transfer sums up why Sunderland are loaded and skint at the same time\nSo by the time the bill – plumped up because the value of the pound has fallen sharply against the euros it was set in since Brexit – came in, Short had to write a cheque for the thick end of £10m for a player that was never his. Plus, of course, the legal fees on top.\nIt was the worst of many mistakes Short had to swallow before passing ownership of the club over to an “international consortium” led by Stewart Donald on Sunday.\nWhile the latest accounts only show the financial picture nearly 12 months before the handover, the club’s debt is not expected to have changed dramatically.\nThe accounts cover the first year of chief executive Martin Bain’s cost-cutting, yet the wage bill and bank debt are relatively unchanged, with Short putting in an extra £19.5m in loans to keep them that way.\nAlthough relegation clauses saw wages drop by 40% in 2017-18, it is only expected to be in proportion with falls in other sources of revenue, such as Premier League money minus parachute payments.\nOver £100m of debt to Short had been written off before the latest accounting period, but borrowing was still at £125.7m on July 31, 2017 – £73m owed to the American financier, the rest to the bank.\nNo one epitomises the wastefulness of Short’s time more than Alvarez, but at least the financier had the decency to foot the bill. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-04T11:17:00.000+03:00", "crawled": "2018-05-04T14:11:44.012+03:00", "highlightTitle": ""}