{"organizations": [], "uuid": "1221008c5ec9309e776c653b20b8816af0088ca7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14442920.ece/ALTERNATES/s1200/ruemain.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14718605", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: De La Rue's failed British passport bid cost company £3.7m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-30T10:10:00.000+03:00", "replies_count": 0, "uuid": "1221008c5ec9309e776c653b20b8816af0088ca7"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14718605", "ord_in_thread": 0, "title": "Business Breakfast LIVE: De La Rue's failed British passport bid cost company £3.7m", "locations": [], "entities": {"persons": [{"name": "currentl", "sentiment": "none"}], "locations": [], "organizations": [{"name": "coreena ford shop", "sentiment": "negative"}, {"name": "brc", "sentiment": "none"}, {"name": "retail consortium", "sentiment": "none"}, {"name": "coreena ford company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Shop prices fall again in May\nShop prices fell again in May as retailers were forced to compete in a “challenging” environment, figures show.\nOverall shop prices fell by 1.1% compared with the same time last year to mark up the 61st month of deflation, the deepest since January 2017, according to the BRC-Nielsen Shop Price Index.\nPrices of non-food items were 2.5% lower than in May last year, their deepest deflation since August 2016.\nHowever the increase in food prices picked up to 1.2% from 1% in April as weather and oil prices influenced global agricultural markets. Ambient food inflation accelerated to 1.7% in May from 1.2% a month earlier but fresh food inflation was unchanged at 0.9%.\nThe British Retail Consortium (BRC) said it expected overall food prices to fall in coming months. Shops prices are falling again (Image: Free editorial use) 9.11 Coreena Ford Company bosses could face big fines amid nuisance call\nThe bosses of companies that make nuisance calls could be fined up to £500,000 under proposals to make them personally liable for breaking the law. Currently only businesses are liable for fines of up to £500,000, and some directors try to avoid paying the penalty by declaring bankruptcy, only to open up again under a different name, the Department for Digital, Culture, Media and Sport said. Under new proposals, the Information Commissioner’s Office (ICO) will be given stronger powers to hold company directors directly responsible with further fines of up to £500,000. The person calling you may not be who they say they are (Image: PA) 9.00 KEY EVENT Greggs rebrands to Gregory + Gregory?\nEither the social media managers at Greggs are having fun with their 141,000 followers - or Greggs is undergoing a name change.\nThe Newcastle firm posted a cryptic tweet an hour ago, showing a new logo, saying they had “something to share with you”.\nIt comes as the firm launches a series of new salads, as revealed by CEO Roger Whiteside in the firm’s most recent update . 8.55 Coreena Ford\nHopes that a thriving town centre can be created at Newcastle Great Park have taken a step forward after a Newcastle property agent was put in charge of bringing in leisure and retail firms.\nThe Great Park, at Gosforth, Newcastle, is the North East’s largest housing development and will eventually provide 4,500 new homes alongside its new primary school, private nursery, community centre and playing fields.\nProgress is also being made to create a second primary school, a secondary school and more playing field space at the development, where Sage Group also has its international headquarters.\nBut plans for a vibrant town centre have stalled, despite initial hopes it would be open by 2010. The units have now been completed but they currently empty, much to the frustration of some residents who moved to the area several years ago.\nHousebuilders Persimmon and Taylor Wimpey have said they are committed to delivering a full range of services to the community. And it is now hoped the vision for the town centre will be accelerated, following the appointment of property consultancy @retail, which has been enlisted to seek out businesses to take up space, which has been constructed to provide up to 19 retail and leisure units to serve residents and workers.\nOperators are being hunted for the high street-style shops, cafes and restaurants and there is also scope for a nursery, the property company said. A CGI of the Great Park town centre development (Image: @Retail) 8.50 Coreena Ford Harry Potter and The Cursed Child boosts Broadway takings\nBroadway has booked a record-breaking season, as hits including Harry Potter And The Cursed Child helped to serve up $1.7bn in sales.\nBox office receipts rose 17.1% compared to last season and attendances were up 3.9%, according to figures released by the Broadway League, the national trade association for the industry.\nFor the 53-week season, beginning on May 22 2017 and ending on May 27 2018, total attendance reached 13,792,614, according to the figures.\nAs well as Harry Potter, the bumper year was fuelled by other big-hitters such as Tina Fey’s Mean Girls, Dear Evan Hansen and Bruce Springsteen’s Springsteen On Broadway.\nCharlotte St Martin, President of The Broadway League, said:\nIt’s been a remarkably diverse season with a wide variety of outstanding musicals and plays on Broadway that have attracted a record number of theatregoers proving once again that there really is something for everyone on Broadway in a wide range of price points.\nOver 80% of the shows on Broadway had an average paid admission of under 130 dollars (£98) and more than half of the shows that played this season (60 per cent) had an average paid admission of less than 101 dollars (£76). Harry Potter and the Cursed Child at the Palace Theatre, London - it is now boosting takings on Broadway (Image: Joel Ryan/Invision/AP, File) 8.45 Coreena Ford Telford Homes books record revenue\nLondon-focused housebuilder Telford Homes is celebrating record annual revenues and soaring profit on the back of continued demand in the capital.\nTelford said pre-tax profit was up 35% to £46m in the year to March 31, while revenue rose from £291.9m to £316.2m.\nThe group added that it is well placed to top £50m in pre-tax profit next year, which would represent a 100% increase over four years.\nTelford described the London market as “robust” with strong demand from build-to-rent investors, individual purchasers, owner-occupiers and housing associations.\nThe housebuilder also attributed its success to the under-supplied housing market in London, and its decision to sell homes at relatively affordable price points. Builders on a building site (Image: PA) 8.41 Coreena Ford Kromek wins new five-year medical deal\nSedgefield tech firm Kromek has announced a new five-year deal with an existing customer, worth more than $1m.\nThe NETPark film is a radiation detection technology company, focusing on the medical, security and nuclear markets.\nIt has been awarded a new five-year contract renewal by an existing customer in the gamma detection market for the supply of its detector modules. The contract is worth $1.2m (around £840,000) across the five years and starts immediately.\nThe Durham University spin-out firm is a leading developer of high-performance radiation detection products based on the chemical compound cadmium zinc telluride (CZT).\nUnder the terms of the contract, Kromek will supply its CZT detector modules to be incorporated in the customer’s products. The density of CZT means that it significantly improves the sensitivity of positive detection of cancerous tumours.\nDr Arnab Basu, CEO of Kromek, said: “I am pleased to receive this long-term contract from our existing customer reaffirming their commitment for the next five years. This is a result of the high-quality products and services we have provided them throughout the last few years.\n“We are continuing to develop new business opportunities in our core markets while serving our existing customers, which are important for the continuing growth of the business.” Arnab Basu, ceo of Kromek 8.35 Coreena Ford B&M soars as shoppers flock to discount chain\nB&M has reported a sharp rise in full year profits as cash-strapped consumers continue to flock to the discount retailer. The group posted a 25.4% increase in pre-tax profit to £229.3m in the year to March 31, with revenue jumping 22.4% to £3bn.\nSoaring inflation caused by the collapse of the Brexit-hit pound has pushed up the price of everyday items for hard-pressed shoppers and, in these conditions, B&M has thrived.\nBoss Simon Arora said: “The B&M model is highly relevant for the current difficult economic environment, with its strong position in the value and convenience areas of retailing where physical stores are winning.\n“The business is well placed for continued profitable, long-term growth. In a retail sector beset by structural challenges B&M’s unique, disruptive model stands out as a success story.”\nB&M also described first quarter trading as “pleasing”, with the group booking a 3.1% increase in like-for-like sales so far.\nLast year B&M, which is chaired by former Tesco boss Sir Terry Leahy and mainly sells general merchandise, splashed out £152m to take over Heron Food Group, which also boosted the group’s numbers. “B&M has delivered another set of strong results by doing what we do best, which is providing great value week-in, week-out on the things customers buy regularly for their homes and families,” Mr Arora added. B&M stores are proving a major hit with hard-pressed shoppers (Image: Liverpool Echo) 8.30 Coreena Ford\nAround 12,000 staff employed by food-on-the-go leader Pret A Manger will receive a £1,000 bonus once the acquisition of the firm is completed.\nAs outlined in yesterday’s blog , the company is to be sold by its private equity owners Bridgepoint to Luxembourg-based JAB Holdings.\nThe value of the deal was not disclosed but it has been reported that the value of the deal is £1.5bn.\nLuxembourg-headquartered JAB is the investment vehicle of Germany’s wealthy Reimann family and is also behind Krispy Kreme donuts, Kenco coffee and Dr Pepper.\nPret a Manger chief executive Clive Schlee, said: “The £1,000 bonus will be paid to all employees who are on the payroll during the week the deal completes. It’s serendipity for those who have just joined.”\nThe deal is expected to complete this summer. A Pret A Manger sign (Image: PA) 8.25 Coreena Ford\nRoyal Bank of Scotland has announced that finance chief Ewen Stevenson has resigned from his role. The state owned bank said that he will “take up an opportunity elsewhere”. While it is unclear when Mr Stevenson depart, he will remain in his position to oversee an “orderly handover” of his responsibilities. The search for a successor will begin immediately.\nChairman Howard Davies said:\nThe board and I are sorry to learn that Ewen has decided to move elsewhere. He will go with our thanks for a job well done and our good wishes.\nChief executive Ross McEwan added:\nFor the past four years Ewen has worked tirelessly with me and my executive team to make RBS a much simpler, safer and more customer-focused business and to resolve a number of major legacy challenges. When Ewen leaves RBS he will go with my enormous thanks and best wishes. He has been a fantastic CFO. 8.20 Coreena Ford Sir Martin Morell confirms comeback\nSir Martin Sorrell’s return to the London stock market has been confirmed, with the former WPP boss to head up a newly formed “multi-national communication services business”.\nThe advertising guru will pump £40m into the shell company Derriston, which will then acquire S4 Capital, a firm established by Sir Martin and through which he will launch his comeback.\nAs part of the reverse takeover, Derriston will be renamed S4 Capital.\nEarlier this year Sir Martin exited WPP, the company he founded over 30 years ago, following allegations of personal misconduct.\nS4 has raised a total of £51m and institutional investors have signalled they are willing to provide over £150 million of further equity funding to support acquisition plans. The group said its new corporate strategy is to “build a multi-national communication services business, initially by acquisitions”, much the same way that WPP did. Sir Martin Sorrell Coreena Ford\nA skincare company is attempting to raise £20,000 through crowdfunding to create a product that can protect nurses’ hands and save the NHS millions.\nMany nurses suffer from a condition known as contact dermatitis in which their hands become severely irritated, dry and cracked – due to the number of times they are required to wash their hands while at work.\nThe painful condition leads to many NHS workers being forced to take time off work as they are not allowed to use hand creams while on the job.\nHusband-and-wife team Jonny and Antonia Philp came up with the idea to create a product that can be used by nurses after Antonia – a trained nurse herself – was forced to take two weeks off work because of the condition.\nThe duo worked with a panel of British nurses and Newcastle Science City to develop a range of skincare products under the brand Nursem.\nThey are now looking to raise £20,000 on crowdfunding site Crowdfunder to produce their first batch of products.\nThe ultimate aim is to provide Nursem products to nurses free of charge. Jonny and Antonia Philp (Image: Unknown) 8.10 Coreena Ford Heather Mills buys former Walkers Crisps factory in County Durham and vows to 'bring jobs back'\nEX-model and TV personality Heather Mills says she has bought the former Walkers Crisps factory in Peterlee , promising to bring jobs back to the site which closed last year.\nAround 355 jobs were lost when PepsiCo, which owns Walkers, revealed it was closing the factory to make “significant productivity and efficiency savings” within the business.\nBut jobs could be about to return to the site after Ms Mills, originally from Washington, revealed she acquired the site after hearing that a friend who had worked at Walkers had lost their job.\nIt is thought the factory has been acquired through Ms Mills’ vegan food company VBites. The company sells a range of plant-based meals designed to replace meat, fish, and dairy products.\nSpeaking on ITV’s This Morning, Ms Mills said: “I am pleading with the supermarkets to buy British. We have Brexit on the way, we are in this situation, love it or hate it. The manufactures are leaving for Germany left, right and centre.\n“I go back to my home town – and I am about to build a factory in Austria – and I find out my friend has lost her job. So I bought the Walkers Crisps factory to bring all the jobs back again.”\nMs Mills Twitter account later said: “Heather has bought six hectares – old Pepsico/Walkers factory to expand VBites vegan food range and bring jobs back to her hometown.” Heather Mills KEY EVENT De La Rue hit by £3.7m costs of failed passport bid\nGateshead’s passport and bank note printer has had to absorb write-off costs of £3.7m amid the failed UK passport retender.\nThe figure is revealed in full year results for the business, the world’s largest banknote printer, which lost the bid to renew its contract to make the iconic blue passport for the UK Government earlier this year.\nThe company has printed UK passports from its Team Valley factory, in Gateshead, for the last 10 years but last month the Government contract was issued to Franco-Dutch firm Gemalto.\nThe decision caused wide-spread controversy as the contract will involve EU-headquartered Gemalto printing the first batch of blue passports after Brexit. It could also put around 200 Gateshead jobs at risk.\nThe business initially planned to appeal the decision, but then dropped those plans , with boss Martin Sutherland telling how “as a business what we have to do is we have to act in the interests of our staff, of our customers, of our shareholders and we have to focus our efforst and our energies elsewhere”.\nIn full year results for the business for the year ended March 31 2018, Mr Sutherland says the business remains in a strong position despite losing the bid.\nHe said: “Solid growth in all segments has been offset by strategically focused increases in investment in R&D and sales, which will drive long term sustainable growth. While losing the new UK passport tender was disappointing, it does not change our goals, nor does it detract from the underlying performance of the Group which remains strong.”\nGroup revenues were up 7% at £493.9m and adjusted operating profit was down 11% at £62.8m.\nMr Sutherland added: “Adjusted operating profit was 11% lower at £62.8m. A significant reduction in the profitability of the paper business was the major factor causing the profit decline, with the write off of the UK passport bid costs as well as planned investments in R&D and sales being offset in part by additional margin from increased sales and certain provision and accrual releases, where we now have additional information as to the likelihood and amount of potential liabilities.\n“Identity Solutions performed as expected. After the £3.7m write off of the bid costs associated to the failed UK passport retender, adjusted operating profit was 27% lower than the prior year.” De La Rue in Gateshead, which has lost the contract to make British passports (Image: Daily Mirror) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14718605;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-05-30T10:10:00.000+03:00", "crawled": "2018-05-30T11:53:16.013+03:00", "highlightTitle": ""}