{"organizations": [], "uuid": "0875a97b77b1e1f6cfd96e9b01dbaf601d08080a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14729017.ece/ALTERNATES/s1200/CFR_NJL_310518barclays_02.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/barclays-ceo-visits-north-east-14728942", "country": "GB", "domain_rank": 21960, "title": "Barclays CEO visits North East to launch £500m fund to help North SMEs grow and create jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-31T18:00:00.000+03:00", "replies_count": 0, "uuid": "0875a97b77b1e1f6cfd96e9b01dbaf601d08080a"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/barclays-ceo-visits-north-east-14728942", "ord_in_thread": 0, "title": "Barclays CEO visits North East to launch £500m fund to help North SMEs grow and create jobs", "locations": [], "entities": {"persons": [{"name": "staley", "sentiment": "none"}, {"name": "jes staley", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "barclays group", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "invalid email barclays", "sentiment": "none"}, {"name": "thornton brothers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Barclays CEO visits North East to launch £500m fund to help North SMEs grow and create jobs Jes Staley was in Ashington to launch the new pot of cash, which is particularly aimed at manufacturers, transport and logistics firms Share Barclays CEO Jes Staley during his visit to bank customer Thornton Brothers in Ashington where he launched a new growth fund for SMEs Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBarclays’ group CEO Jes Staley has travelled to the North East to launch a new £500m growth fund specifically aimed at helping SMEs in the North of England to flourish and create jobs.\nThe banking giant has set in motion the substantial pot of cash as part of its commitment to support the Government’s Northern Powerhouse initiative.\nMr Staley, Barclays Group chief executive, chose to announce the fund in Northumberland , outlining how it has a particular focus on certain sectors and will serve up favourable terms for companies within the manufacturing, transport and logistics sectors.\nHe said: “Barclays has been helping businesses across the North to succeed since the dawn of the Industrial Revolution, when we financed the world’s first steam locomotive passenger railway between Stockton and Darlington.\n“Today, we face new economic challenges and opportunities posed by the digital revolution, the growth in competition from emerging markets, and of course, Brexit.\n“The Northern Powerhouse is an initiative which, if delivered, would help the whole country to meet that challenge and take those economic opportunities. That is why I’m delighted to announce our £500m Northern Powerhouse Growth Fund, enabling businesses across the North to invest in jobs and growth.\n“As the UK prepares for Brexit, it’s vitally important that businesses, civic leaders and Government work together to make the Northern Powerhouse a reality. That means supporting entrepreneurs and businesses to succeed, but it also means providing more ways into high quality work.\n“We are looking at providing credit to SMEs in a way that makes it easier to draw down on that credit; we’re not asking for collateral but are focused on providing credit in an easily accessible way to grow.\n“It’s important for this part of England and we’re recognising the history and legacy of Barclays here - the bank started in Newcastle in 1774 so we are recognising our particular obligation to Newcastle and the wider North of England.\n“Manufacturing and logistics are particular strengths in the North and that’s something we want to support. There’s a lot of money flowing into the tech industry at the moment and we want to put it into other parts of the economy.” Barclays CEO Jes Staley during his visit to bank customer Thornton Brothers in Ashington where he launched a new growth fund for SMEs (Image: Barclays)\nHe launched the fund at Thornton Brothers Limited, in Ashington, Northumberland.\nThe business was founded by brothers George and Keith Thornton in 1979, who started out with a £25,000 loan from their local branch. They now employ more than 70 highly-skilled engineers who modernise fleets of buses for major transport providers across the UK, including Transport for London, Go-Ahead and First Group Ltd.\nGeorge Thornton said: “Our family-run business was founded 40 years ago with the help of a loan from Barclays, which is why it’s so fantastic to see a growth fund of this size being launched to help other entrepreneurs just like us.\n“This fund will be a real boost to businesses just like ours. Gaining access to finance over the years has enabled us to grow our business, hire a number of skilled engineers and build a new state of the art garage with some of the best specialist facilities of their kind in the UK.”\nSmall Business Minister Andrew Griffiths added: “This Government is fully behind the entrepreneurs delivering jobs, growth and greater choice for consumers so it’s great to see businesses like Barclays providing further investment to help Northern SMEs start-up and grow.\n“Small businesses are the backbone of our economy, with over 1,000 being created every day across the country supporting nearly 3 million jobs and generating revenues of more than £200bn in the North of England alone. Through our modern Industrial Strategy, we are building a Britain in which they will continue to thrive.”\nNorthern Powerhouse Partnership vice-chair and leading economist Lord Jim O’Neill said: “I have consistently said that for the Northern Powerhouse to be a success and deliver a more balanced economy for the whole of the UK requires the support and vision of the North’s leading businesses.\n“This major fund from Barclays will significantly increase the potential of our SMEs across the Northern Powerhouse to embrace the next Industrial Revolution, incorporating innovation such as robotics and AI into everything they do.\n“There is real momentum growing in the Northern Powerhouse, and I hope the commitment Barclays and their CEO Jes Staley have demonstrated will be matched by our political leaders in Whitehall so the Northern Powerhouse can truly fulfil its potential.”\nMr Staley also met apprentices at one of the bank’s major contact centres in Doxford International Business Park, near Sunderland.\nThe centre employs 1,600 people carrying out customer support roles including providing mortgages, helping to prevent fraud against customers and advising small businesses.\nHe also announced that all new entry roles in the bank’s Sunderland and Liverpool contact centres will be offered exclusively to apprentices.\nHe said: “Our new apprentice-only hiring policy, which we’re piloting in our flagship contact centres, will help to provide more of those high quality jobs.\n“We’ve discovered at Barclays that the ‘can-do’ attitude our apprentices have means they are excellent at helping our customers and clients, so from now on every time we hire a new entry level employee in Sunderland or Liverpool, we will actively look to give someone the life-changing career opportunity that a quality apprenticeship provides.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-31T18:00:00.000+03:00", "crawled": "2018-05-31T18:57:07.009+03:00", "highlightTitle": ""}