{"organizations": [], "uuid": "139fa6c46fcfa130602fc19ff9a2f8a855cd2b9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14697807.ece/ALTERNATES/s1200/SGP_NEC_160517ANN06JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/whats-on/arts-culture-news/ann-cleeves-vera-lee-hall-14697777", "country": "GB", "domain_rank": 21960, "title": "Ann Cleeves (Vera) and Lee Hall (Billy Elliot) lined up to give free lectures in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-05-23T19:20:00.000+03:00", "replies_count": 0, "uuid": "139fa6c46fcfa130602fc19ff9a2f8a855cd2b9f"}, "author": "David Whetstone", "url": "https://www.chroniclelive.co.uk/whats-on/arts-culture-news/ann-cleeves-vera-lee-hall-14697777", "ord_in_thread": 0, "title": "Ann Cleeves (Vera) and Lee Hall (Billy Elliot) lined up to give free lectures in the North East", "locations": [], "entities": {"persons": [{"name": "ann cleeves", "sentiment": "negative"}, {"name": "billy elliot", "sentiment": "negative"}, {"name": "lee hall", "sentiment": "negative"}, {"name": "ann", "sentiment": "none"}, {"name": "vera stanhope", "sentiment": "none"}, {"name": "brenda blethyn", "sentiment": "none"}, {"name": "vera stan", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "university of sunderland", "sentiment": "none"}, {"name": "murray library lecture theatre", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Author Ann Cleeves (Image: Newcastle Chronicle) Share Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nVera author Ann Cleeves and Lee Hall, the man who gave us Billy Elliot, are lined up to give free public lectures in the North East in the coming weeks.\nAnn, whose books about detective Vera Stanhope have spawned the hugely successful ITV drama series, is first up in the University of Sunderland public lecture series.\nShe will be giving a talk, From Page to Screen, in the university’s Murray Library Lecture Theatre at 6.30pm on Thursday, May 31.\nShooting for the next series of Vera is taking place around the region with actress Brenda Blethyn once again in the title role.\nFour new self-contained Vera stories are in the offing to brighten up TV viewers’ Sunday nights in a uniquely dark fashion.\nThe fourth of them, The Seagull, is an adaptation of Ann’s latest novel of the same name.\nIs the Vera we see on screen how her creator first imagined she would be? Actress Brenda Blethyn playing DCI Vera Stanhope during filming for the ITV series Vera in Whitley Bay (Image: PA)\nAnn is very, very complimentary Brenda Blethyn’s performance which has brought her widespread acclaim.\n“Brenda Blethyn is magnificent as Vera,” she says.\n“She might not be as large or as ugly as the character in the book, but Brenda understands her completely.\n“She worked with director Mike Leigh and his way of developing character through improvisation means that she knows everything about the woman.”\nThe same, apparently, applies to Dougie Henshall who plays Jimmy Perez in Ann’s Shetland series on BBC TV.\nAnn says he might not look like Jimmy, who in the books has dark eyes and hair and Spanish ancestry, “but he’s captured the character beautifully. I’ve been very fortunate.”\nIn the case of Vera, it seems the actress might, in fact, have influenced the author. Lee Hall, creator of Billy Elliot (Image: ncjMedia)\n“Now I certainly hear Brenda’s voice in my head when I write dialogue,” says Ann, “and I know readers see her too.”\nShe doesn’t feel any need to conform to the TV portrayal, though.\n“I’m delighted that Vera is bringing work to the area and showing the beauty of the region off to the world, but I don’t feel pressure,” she says.\n“I feel pressure to make my books as good as they can be but the TV isn’t my responsibility so I can’t worry about it.”\nLee Hall, whose many successes include Billy Elliot, Cooking with Elvis and The Pitmen Painters, will take the platform on June 7, talking about writing for stage, cinema and radio.\nAlso coming up in the lecture series are Gary Fildes, founder of Kielder Observatory, with Our Place in the Universe (June 14) and Lord Puttnam, the film producer and educationalist, with a talk called Shaping the Values of a Post-Brexit World (July 3).\nTickets are free but must be booked via https:// www.sunderland.ac.uk/events/ Like us on Facebook", "external_links": ["http://www.sunderland.ac.uk/events/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-05-23T19:20:00.000+03:00", "crawled": "2018-05-23T23:05:33.005+03:00", "highlightTitle": ""}