{"organizations": [], "uuid": "8e51363bdd3fa704f73454983606a89e9024b506", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29839293/15641116.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/anicca-digital-has-eye-on-frog-island-for-future-expansion/story-29839293-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Anicca Digital has its eye on Frog Island for future expansion", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Anicca Digital has its eye on Frog Island for future expansion", "spam_score": 0.0, "site_type": "news", "published": "2016-10-25T20:45:00.000+03:00", "replies_count": 0, "uuid": "8e51363bdd3fa704f73454983606a89e9024b506"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/anicca-digital-has-eye-on-frog-island-for-future-expansion/story-29839293-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Anicca Digital has its eye on Frog Island for future expansion", "locations": [], "entities": {"persons": [{"name": "tom pegden", "sentiment": "negative"}, {"name": "bing", "sentiment": "none"}, {"name": "anicca", "sentiment": "none"}, {"name": "ann stanley", "sentiment": "none"}, {"name": "philip shearer", "sentiment": "none"}, {"name": "snooks", "sentiment": "none"}, {"name": "james murray", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dunelm", "sentiment": "none"}, {"name": "ann", "sentiment": "none"}], "locations": [{"name": "frog island", "sentiment": "none"}, {"name": "anicca", "sentiment": "none"}, {"name": "deichmann", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "leicester marriott hotel", "sentiment": "none"}], "organizations": [{"name": "anicca digital", "sentiment": "negative"}, {"name": "loughborough", "sentiment": "none"}, {"name": "anicca", "sentiment": "none"}, {"name": "aurum holdings", "sentiment": "none"}, {"name": "manchester digital", "sentiment": "none"}, {"name": "office depot", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "facebook and twitter", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "leicester digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nBusiness Editor Tom Pegden chats with one of the city's leading experts in online marketing – and hears how the digital future looks very bright indeed \nThese are exciting times for Anicca Digital, the SEO to e-commerce to social media to PR agency based in Leicester's pleasant King Street. The business is booming as more and more organisations learn to value the benefits of ensuring their products, services and messages are sufficiently promoted on the world wide web. \nThe company, which currently has two dozen staff, has its eyes on new premises in the city's Frog Island, an area which, it is hoped, will one day become a thriving hub for business as part of the city mayor's regeneration plans. \nAnicca is also planning a big convention during the county's second business festival, which kicked off yesterday, giving business leaders and retailers a taste of the online opportunities available in the growing field of e-commerce. \nThe \"E-commercial\" conference takes place at the Leicester Marriott Hotel next Monday. \nThe keynote presenter will be Philip Shearer, Google's shopping lead for Europe, who will speak about how technology is shaping the way we buy and sell things. \nJames Murray, UK search advertising lead at Bing, will also be speaking, giving a talk on voice and visual search. \nThere will also be seminars and round table discussions. \nThe conference is a spin-off of a group Anicca founder and MD Ann Stanley helped launch last year called Leicester Digital. \nRead more: Aurum Holdings sees rise in sales after Brexit vote \nIt was created to bring the city and county's digital communities together – quite sensible when you think the likes of Next, Dunelm and Office Depot, to name but a few, all have major online operations here. \nAll this and more contributed to Ann picking up the Business Woman of the Year award at the second Leicester Mercury Women in Business Awards, which were held at the City Rooms earlier this month. \nShe isn't a finalist in our annual Business Executive of the Year awards, which take place next week, but one can't help but feel it is only a matter of time. \nShe came into SEO from a background in biology and that scientific background has helped in her understanding of a vast and complex area of new technology that few businesses properly grasp. \nAnn said digital marketing in the UK was growing by 15 or 20 per cent a year, so helping create Leicester Digital was a way of bringing the local elements of that community together to share best practice and do business. \nIt already has 550 members and she has high hopes for it. \nShe said a similar organisation called Manchester Digital has built good relationships with the universities there and provides a strong support infrastructure. \nAnn said: \"We thought it would be good to do the same thing in Leicester. \n\"There's a monthly meet-up downstairs at the Exchange bar with a half-hour seminar and a bit of networking and we are getting about 20 people at each.\" \nCloser to home, the new premises she has her eye on will be knocked about and refurbished to her own high specifications so that she can stamp her presence on the business scene. \nRead more: Delta One left me feeling on top of the world \nAnn said: \"We are just about to purchase the office in Frog Island, with plans to expand to 50 people over the next few years. \n\"We're in the process of buying a two-storey building down there. We've been here for four years now and have already doubled the size. \n\"We are at 24 staff now and are turning over £80,000 a month. If you look at the profile of digital agencies in the city we are now one of the biggest.\" \nAnn is also proud of the fact that there's a high proportion of women in her company – web development is traditionally male dominated. \nShe has a transparent and even pay structure to ensure staff retention in a sector where competition is tough. She also has to invest in training to keep an edge. \nAnn said: \"We are a real mix of diversity and cultures here and have some international employees. We are a bit elitist in the sense that nearly everybody is a graduate, but it's such a fast moving industry you have to have a high level of education to deal with that. \n\"We have kept people for six or seven years – it's about being a great place to work. \n\"We're hoping to move in the second half of next year, and it will be a big project for us with a planned extension and refurbishment. \n\"It will be more than a £1 million investment, including £300,000 to buy it. \n\"It's going to be a good time to be in that area because we will be one of the first to relocate there and hopefully part of a great new community.\" \nRead more: Business Executive Awards: Just Hype, Snooks and Watch. This. Space are up for young executive award \nAnicca was formed in 2007 to design websites. More recently, Ann bought out her business partner and began focusing on digital marketing. \nEven that market has changed, with Google ads, for instance, facing fresh competition for ad share from the likes of Facebook and Twitter. \nAt the same time SEO – basically getting your web page high up on Google listings – has adapted and is no longer just technically driven but content driven. \nThat was why she added a PR element to the business – it means as well as getting digital marketing help, clients can be offered publicity support that adds to their online impact. \nShe said: \"People such as Google want to see brand authenticity. They want that to be natural, through things like PR. \n\"That PR can work with influencers like vloggers and bloggers – instead of just focusing on building traffic to a website, we are building the brand as well. \n\"And it's not just PR but social media. So with Facebook you have pay-to-play, with social advertising. \n\"All that combined helps you communicate your brand and get people to your website, it's the full gamut of social marketing. \n\"It's a much more integrated approach – our clients want us to help them with all of it. That's the difference between Anicca in 2016 and three years ago.\" \nThe business now has about 50 clients including Experian, Deichmann, Speedo, and online Loughborough shop BuyDirect4U. \nShe said: \"Many of them have their own marketing teams, but not the extra resources, which is where we help. We also do a lot of training with monthly boot camps. \n\"We've come a long way and we're heading for a new chapter as we approach our 10th birthday, with the new office and plans to be at 50 staff in three years. \n\"And as we double staff, we hope to quadruple turnover in three years to £3-£4 million, because we will become more efficient, too. \n\"At the same time, we're not sure what will happen with Brexit, but I think we will be busier as a lot of our customers will want to market themselves overseas.\"", "external_links": [], "published": "2016-10-25T20:45:00.000+03:00", "crawled": "2016-10-25T16:55:51.848+03:00", "highlightTitle": ""}