{"organizations": [], "uuid": "facf0dc4bae6ac799cf297da9d36805b9dda5724", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12078668.ece/ALTERNATES/s1200/JS93761126.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-vodafone-12073563", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Vodafone slapped with £4.6m fine, plus latest financial news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Vodafone slapped with £4.6m fine, plus latest financial news", "spam_score": 0.0, "site_type": "news", "published": "2016-10-26T15:20:00.000+03:00", "replies_count": 0, "uuid": "facf0dc4bae6ac799cf297da9d36805b9dda5724"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-vodafone-12073563", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Vodafone slapped with £4.6m fine, plus latest financial news", "locations": [], "entities": {"persons": [{"name": "lindsey fussell", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "horta-osorio", "sentiment": "none"}, {"name": "stephanie", "sentiment": "none"}, {"name": "cheryl ball", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "iain malcolm", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "antonio horta-osorio", "sentiment": "none"}, {"name": "bcharmd", "sentiment": "none"}, {"name": "stephanie milburn", "sentiment": "none"}, {"name": "george culmer", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nick jones", "sentiment": "none"}, {"name": "grayling", "sentiment": "none"}, {"name": "tim cook", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "nathan bostock", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "tynemouth market", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "woolsington hall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "bcharmd", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "berlin apple", "sentiment": "none"}, {"name": "cupertino", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}], "organizations": [{"name": "vodafone", "sentiment": "negative"}, {"name": "chester-le-street", "sentiment": "none"}, {"name": "cameron hall developments", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "coreena ford transport sectrtary chris grayling", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ofcom  vodafone", "sentiment": "none"}, {"name": "banco santander", "sentiment": "none"}, {"name": "ppi", "sentiment": "none"}, {"name": "lloyds bank", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "coreena ford santander uk", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "local data company", "sentiment": "none"}, {"name": "coreena ford vodafone", "sentiment": "none"}, {"name": "macbook pro", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "coreena ford apple", "sentiment": "none"}, {"name": "santander uk", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "legatum institute", "sentiment": "none"}, {"name": "npl", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "coreena ford north east", "sentiment": "none"}, {"name": "newcastle science central 9.10 coreena ford jewellery", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "ofcom", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "coreena ford lloyds", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "That’s it for today....I’ll be back tomorrow morning. \nThanks for reading and have a great day! 9.20 Coreena Ford Santander UK warns over Brexit challenges \nSantander UK has reported a rise in quarterly profit, but again warned that earnings could take a hit as a result of Brexit. \nThe Spanish lender’s British branch said profit before tax jumped 9% to £1.6 billion over the nine months to September 30 compared with a year earlier, but said that figure slowed on a quarterly basis. \nIn the three months to September 30, pre-tax profit fell to £477 million, down from £496 million during the same period in 2015. \nIt also marks a slowdown from the £546 million reported in the second quarter. \nThe bank said Brexit could end up denting earnings. In its latest trading update, Santander UK said Britain’s decision to leave the EU has resulted in economic uncertainty and market volatility, which is expected to continue. \nChief executive Nathan Bostock said: “Although we have not seen a material impact on our business in the short period since the EU referendum, we do expect a more challenging macroeconomic environment ahead. \n“This increased caution has prompted us to revise our 2018 return on tangible equity, cost-to-income and NPL ratio targets, as disclosed at the 2016 Banco Santander strategy update in late September.” \nIn the near term, the bank said it expects consumer confidence to drop and economic growth to slow, and cautioned that higher oil prices and a weaker pound were likely to result in higher inflation. \nSterling has fallen nearly 20% against the US dollar since the EU referendum. Results also showed a pension hit following the Brexit vote, and comes as company schemes are hammered by falling bond yields. \nSantander UK said the defined benefit pension scheme had fallen into a £258 million deficit, compared with a surplus of £483 million a year earlier. \nThe bank has also put aside an additional £30 million to cover costs related to the mis-selling of payment protection insurance, bringing its total provisions over the past nine months to £397 million. \nThe UK banking industry’s PPI bill is already colossal, at more than £30 billion so far. 9.15 Coreena Ford North East is best place to do business outside London - fact. \nThe North East has been named as the best place outside London in which to do business. \nA study by the Legatum Institute, a think tank dedicated to promoting prosperity, highlights the region’s strong logistics links, along with its investment in science and technology , in providing an excellent base for businesses to grow. \nThe report rates Newcastle as the eighth best area in the country to do business - one of only four outside London in the Top 10 - while South Tyneside, Middlesbrough and Gateshead also make the Top 50. \nThe North East is, however, ranked as the least prosperous part of the UK in the same report, highlighting how “the challenge for the North East is how to turn the opportunities its business environment offers into prosperity.” The Core at Newcastle Science Central 9.10 Coreena Ford Jewellery store goes from Tynemouth Market stall to Newcastle city centre shop \nAn inspiring story for small businesses. \nBcharmd started out on a Tynemouth Market stall in 2009 and the jewellery products its founder Stephanie Milburn makes is now sold in 500 luxury stores all over the world. \nNow the firm has expanded out of its first Newcastle city centre shop into a flagship store in the impressive Central Arcade. \nRead Stephanie and Bcharmd’s success story here . Stephanie Milburn of Bcharmd with Cheryl Ball of Sintons 9.05 Coreena Ford Woolsington Hall restoration 'progressing well' \nDevelopers say restoration work to transform Woolsington Hall into a £23m five-star hotel is progressing well, months after a blaze tore through the Grade II listed building. \nLatest accounts for Cameron Hall Developments, the owners of the former 17th-century Jacobean hunting lodge, detail how rebuilding works and restoration is moving forward following the fire in December 2015. \nThe firm received insurance claim proceeds of £1.6m following the fire, which ripped through the building and destroyed many of its historic features. Permission was later granted to reconstruct and restore the historic building, including the roof, floor layouts, staircase, landing windows and basement. \nOnce completed, Cameron Hall Developments will open Woolsington Hall , on which Capability Brown worked as landscape architect, as a five-star hotel with an adjoining golf course, restaurant, spa and cookery school which could pump £8.9m into the local and regional economy as well as create more than 160 jobs. Fire crews damp down Woolsington Hall after it was damaged by fire 9.02 Coreena Ford Transport Sectrtary Chris Grayling heads North to discuss Heathrow plans \nSecretary of State for Transport Chris Grayling will be at Newcastle International Airport today, following his announcement that a third runway at Heathrow is the Government’s preferred option to increase the UK’s airport capacity. \nHe’ll be at the airport to meet interim chief executive Nick Jones and South Tyneside Council leader Iain Malcolm to discuss the benefits the third runway will bring to the North East. \nYesterday he ruled out any rethink on the Government’s support for the new runway, telling MPs: “It’s very important to say that the Government has decided very clearly today on its recommendation. \n“That recommendation has to be validated in a statutory process, it has to be voted on and confirmed by this House, that is what will happen. “But we’re not entering this process with a view to changing our mind.” \nMr Grayling told the BBC Radio 4 Today programme that the Heathrow runway might be built over the M25. \nHe said: “One of the things that Heathrow has been looking at is doing what many other airports have done around the world - which is to build their runway over the top of the road rather than tunnelling the road underneath it. \nIt is a cheaper and quicker way of doing it. I am, of course, very concerned to make sure that, as this runway is built, it doesn’t cause massive disruption on the M25, so I think this is a sensible way. \n“It is a very gentle hill up which the planes would take off rather than a flat surface. It’s what happens at very many airports around the world.” Transport Secretary Chris Grayling 8.50 Coreena Ford North East high streets thrive as 20% more retailers open for business \nNorth East high streets are weathering a retail storm sweeping the UK with 20% more retailers opening stores in the first half of this year compared to 2015, new analysis has revealed. \nResearch carried out for accountancy giant PwC by the Local Data Company has shown that more shops are opening and the number closing is relatively unchanged across the region, despite huge problems in the retail sector at a national level. \nRestaurants, fashion shops, jewellers and health clubs were among those growing at the fastest rate in the North East during the first half of 2016. \nData was collected in 18 town and city centres in the North East and it showed that some sectors – notably opticians, recruitment agencies and chocolatiers – were among the hardest hit in the first six months of the year. \nThe analysis of 66,401 outlets operated by multiple retailers in 500 town centres across the UK, found that in the first six months of 2016, 100 shops opened and 105 closed on the North East high streets. \nFour areas studied saw a positive net change, with Morpeth , Newcastle, Darlington and Hartlepool all experiencing more openings than closures. \nA total of 35 new retail ventures got under way in Newcastle in the period, while Morpeth saw seven openings and just one closure. \nStockton on Tees, Chester-le-Street and Bishop Auckland had the highest net reduction in the North East, followed by Gateshead, Blyth and Durham. In Stockton there were no new openings, but six closed. Shoppers on Northumberland Street in Newcastle City Centre 8.45 Coreena Ford Apple iPhone sales slow as market approaches saturation \niPhone sales continue to slow as Apple’s latest financial results revealed a 5% drop in sales when compared to the same quarter of 2015. \nThe technology giant warned of such a slide in its financial forecasts earlier this year as the smartphone market begins to reach saturation - with most consumers now owning a viable device and upgrading less frequently. \nApple reported total iPhone sales for the three months to September 24 of more than 45.5 million units - up around five million on the last quarter - but still down on the same period last year. \nThe firm’s total revenue for the quarter was 46.9 billion dollars (£38.4bn), down 9% on the same period last year. \nHowever, chief executive Tim Cook chose to focus on the success of Apple’s services business - Apple Pay and the company’s internet-based products - which grew more than 20% on last year. \n“Our strong September quarter results cap a very successful fiscal 2016 for Apple,” he said. \n“We’re thrilled with the customer response to iPhone 7, iPhone 7 Plus and Apple Watch Series 2, as well as the incredible momentum of our Services business, where revenue grew 24% to set another all-time record.” \niPad sales also continue to fall, dropping from 9.9 million in the last quarter to 9.3 million in the last three months. The tech giant’s net income for the quarter was nine billion dollars (£7.3 billion), and sales of Mac computers rose by 15% on the last quarter, to 4.9 million units sold. \nThe next generation of Macs are due to be unveiled at a media event at the company’s Cupertino headquarters tomorrow, with a new MacBook Pro expected to lead the announcements. \nIndustry analysts have suggested Apple’s performance will be better judged in early 2017, when the technology giant reports the first of its figures to truly take into account the iPhone 7. A visitor tries out an Apple iPhone 7 on the first day of sales of the new phone at the Berlin Apple store on September 16, 2016 in Berlin, Germany 8.40 Coreena Ford Lloyds sets aside extra £1bn for PPI claims \nLloyds Banking Group has set aside another £1 billion to meet compensation claims for the mis-selling of payment protection insurance (PPI). \nThe part state-owned lender is by far the worst affected by the PPI scandal, and as part of a third quarter trading update it has announced that its total compensation bill has reached £17 billion. \nThe banking industry’s PPI bill already stands at more than £30 billion. Earlier this year the Financial Conduct Authority (FCA) moved to put a June 2019 deadline on claims in an effort to draw a line under what has been one of the biggest banking scandals in history. \nThe extra PPI provision meant that statutory pre-tax profits came in 15% below last year at £811 million in the quarter. \nUnderlying profit for the third quarter came in 3% down at just under £2 billion. \nResults also show a pension hit following the Brexit vote, which comes as company schemes are hammered by falling bond yields. \nThe bank’s schemes moved from a net surplus of £430 million to a net deficit of £740 million in the quarter. \nGeorge Culmer, the chief financial officer, said the PPI provision takes the bank through to 2019 and the FCA deadline. \nOn Brexit, chief executive Antonio Horta-Osorio said that there has been “no significant” drop in consumer activity following the referendum result. “We don’t see any change in consumer trends. \nBut on the business side, SMEs (small and medium-sized enterprises) and mid-size corporates, there has been some impact on businesses holding back on investment. \n“The British economy is in a very strong position facing Brexit. But uncertainty will persist and the economy requires fiscal stimulus in infrastructure and house building,” he said. \nThe chief executive also moved to quash speculation surrounding his potential departure from the bank following revelations about his private life earlier in the year. \n“I’m very happy at Lloyds. I like the bank, I like the team, I like the strategy,” Mr Horta-Osorio added. \nIn its results, Lloyds also said it has accounted for a further £150 million provision to cover other conduct issues, including £100 million relating to packaged bank accounts. \nThe figures come after Chancellor Philip Hammond ditched plans for a Lloyds share sale to the public earlier this month, instead planning to offload the Government’s remaining 9% stake to institutional investors. \nIn July, Mr Horta-Osorio announced that Lloyds was cutting 3,000 jobs and shutting 200 branches as part of an efficiency drive. Lloyds Bank has set aside more money for PPI claims 8.35 Coreena Ford FTSE and pound latest \nThe FTSE-100 index opened at 7017.64. \nThe pound at 8am was 1.2171 dollars compared to 1.2162 dollars at the previous close. The euro at 8am was 0.8957 pounds compared to 0.8949 pounds at the previous close. 8.30 Coreena Ford Vodafone fined £4.6m by Ofcom \nVodafone has been slapped with a £4.6 million fine by Britain’s telecom watchdog for breaching consumer protection rules. \nThe fine is a result of two investigations by Ofcom which found Vodafone was mishandling customer complaints and failed to credit the accounts of more than 10,452 pay-as-you-go customers who topped up their accounts. \nThe breaches took place between January 2014 and November 2015, and December 2013 and April 2015, respectively. Ofcom consumer group director Lindsey Fussell said: “Vodafone’s failings were serious and unacceptable, and these fines send a clear warning to all telecoms companies.” \nThe fine must be paid to Ofcom within 20 working days, and the money will be passed to the Treasury. \nVodafone said: \nWe deeply regret these system and process failures. \nWe are completely focused on serving our customers: everyone who works for us is expected to do their utmost to meet our customers’ needs, day after day, and act quickly and efficiently if something goes wrong. \nIt is clear from Ofcom’s findings that we did not do that often enough or well enough on a number of occasions. \nWe offer our profound apologies to anyone affected by these errors. \nThe company said it has fully refunded or recredited more than 10,422 customers an average of £14.35 each, and has made a £100,000 donation to “a number of UK charities” in lieu of being able to track down the remaining affected customers. \nOfcom said it took Vodafone’s customer reimbursement plans and willingness to enter into formal settlement into account, cutting the company’s fine by 7.5% as a result. \nVodafone blamed the pay-as-you-go credit failure on a “complex IT migration” that involved moving more than 28.5 million customer accounts to a new system starting in 2013, leading to some mistakes in billing data and price plans and a “sharp increase” in the number of customer complaints. \nIt said the IT failure was resolved by April last year, adding that all customer accounts are now on the new system. The company also said it has invested an extra £30 million in customer service training and hired 1,000 new UK call centre personnel. \nVodafone added: \nThis has been an unhappy episode for all of us at Vodafone, we know we let our customers down. \nWe are determined to put everything right. We are also confident that our customers are already beginning to see the benefits of our substantial investment in new systems designed to meet their needs much more effectively in future.", "external_links": [], "published": "2016-10-26T15:20:00.000+03:00", "crawled": "2016-10-26T11:58:37.236+03:00", "highlightTitle": ""}