{"organizations": [], "uuid": "66fc257ab6231274e7c5e4fdd17aa27ea7972060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12015838.ece/ALTERNATES/s1200/JS102116118.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-cynical-mockery-decent-12015751", "country": "GB", "domain_rank": 21960, "title": "Theresa May's cynical mockery of the decent liberal values I treasure is outrageous", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May's cynical mockery of the decent liberal values I treasure is outrageous", "spam_score": 0.0, "site_type": "news", "published": "2016-10-13T01:00:00.000+03:00", "replies_count": 0, "uuid": "66fc257ab6231274e7c5e4fdd17aa27ea7972060"}, "author": "Bernard Trafford", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-cynical-mockery-decent-12015751", "ord_in_thread": 0, "title": "Theresa May's cynical mockery of the decent liberal values I treasure is outrageous", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "michael fallon", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "matthew parris", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastlegateshead", "sentiment": "none"}, {"name": "bernard trafford", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}], "locations": [], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}, {"name": "royal grammar school", "sentiment": "none"}, {"name": "house of commons  many", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May's cynical mockery of the decent liberal values I treasure is outrageous 18:00, 12 Oct 2016 Newcastle headteacher Bernard Trafford says the Prime Minister seems to have set out to rile people on the middle ground   PA Wire Prime Minister Theresa May speaks during Prime Minister's Questions in the House of Commons \nMany's the time I’ve stated in this column that I’m not a political animal and that, if pressed, I admit to being powerfully wishy-washy, a through-and-through centrist. \nYou might reckon I’m just playing safe. It’s hard to take exception, isn’t it, to someone whose views are exclusively moderate? In truth, I suspect and fear extremes. \nPoliticians have fought for the moderate vote throughout the last couple of decades. Tony Blair cunningly occupied the centre ground to win his landslide election in 1997. Following the hapless Gordon Brown, centrist Tory David Cameron reoccupied that middle territory. \nNow the political landscape’s shifted again. Bizarrely, as both major parties have shifted to the extremes the middle ground has perversely become not merely lonely, but uncongenial. \nPeople like me, educated and essentially liberal, are now lambasted by our new (unelected) prime minister. We’re the “smug liberal elite”, accused of sneering at patriotism and at the concerns about immigration felt by “ordinary hard-working people”. \nIt gets worse. \nI’m an internationalist at heart: I’m not sure how one can be in education and not be so. In schools we teach foreign languages. We take children abroad and encourage them to understand and immerse themselves in other cultures: we encourage young people to appreciate their place not just within their own society but in the world as a whole. \nSince last week’s Tory Conference, however, internationalists are derided: described as “citizens of nowhere”, we’re said to despise our own country. \nHuman Rights have also come in for stick, not from the PM but from Defence Secretary Sir Michael Fallon. Concerned about soldiers accused of war crimes, he wants to disengage from the European Convention on Human Rights. I’ve written before about how nervous such proposals make me: worse still, the Tory conference booed any mention of human rights lawyers. I begin to wonder what we fought the Second World War for… \nWhy on earth has the PM set out to rile the middle? We’re the people who decide the outcome of elections by shifting our vote, unlike (you might argue) the tribal majority. Read More Culture, passion and history: Theresa May on why NewcastleGateshead will host Great North Exhibition \nIn last Saturday’s Times, Matthew Parris suggested Mrs May did this precisely because she can afford to take the risk. Centrists currently feeling offended will, he insisted, mostly return to her at election time. Meanwhile, with Labour in disarray, she is staking a powerful claim to the middle ground in an attempt to win over disillusioned UKIP and Labour voters alike. \nHence her appeal to “ordinary hard-working people”, assuring them she’s taking seriously their concerns over immigration: she stretched the truth to breaking point in claiming to understand how they feel about immigrants taking their jobs or, by accepting lower pay, forcing wages down. That was economic nonsense: read the BBC’s online Reality Check. Still, who in the Tory party would believe that den of lefties? They’re seeking to clip the BBC’s wings! \nSo no, she’s not after my vote, nor that of people like me. She may try to woo us back later on: but right now, although most of her policies are lurching to the right, with no credible opposition she’s bidding to occupy not just the middle ground but the entire political landscape. She may succeed, too. Read More Amber Rudd, Mein Kampf and worrying views on immigration \nIt’s a high-risk tactic. She’s infuriated me, and undoubtedly many others more likely than me to vote for her at the next election. Our memories are long. A rather-too-quiet ex-Remainer now advocating hard Brexit, Mrs May’s created a big enough credibility gap to bridge without pouring scorn on those of us who chose not to turn our coats. \nHer cynical mockery of my decent liberal values is outrageous: not easy to live up to at the best of times, I nonetheless follow them resolutely. If believing in moderation is to be branded wishy-washy, I’m content - and proud to be so. \nDeserving better, we moderate liberals may yet punish our Prime Minister in 2020. \nDr Bernard Trafford is Headmaster of Newcastle’s Royal Grammar School. The views expressed here are personal. \n@bernardtrafford", "external_links": [], "published": "2016-10-13T01:00:00.000+03:00", "crawled": "2016-10-12T20:23:37.601+03:00", "highlightTitle": ""}