{"organizations": [], "uuid": "7bb26738654c072f04da33b0cb3f0ea887917d52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12058953.ece/ALTERNATES/s1200/JS102281833.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-job-loss-fears-nissans-12061691", "country": "GB", "domain_rank": 21960, "title": "Brexit job loss fears for Nissan's Sunderland plant could become a reality", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit job loss fears for Nissan's Sunderland plant could become a reality", "spam_score": 0.0, "site_type": "news", "published": "2016-10-22T00:08:00.000+03:00", "replies_count": 0, "uuid": "7bb26738654c072f04da33b0cb3f0ea887917d52"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-job-loss-fears-nissans-12061691", "ord_in_thread": 0, "title": "Brexit job loss fears for Nissan's Sunderland plant could become a reality", "locations": [], "entities": {"persons": [{"name": "coun paul watson", "sentiment": "none"}, {"name": "ghosn", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexiteers", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "europe union", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north-east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "nissan sunderland", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "brexit  bidding", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sunderland west", "sentiment": "none"}, {"name": "north east of england chamber of commerce", "sentiment": "none"}, {"name": "nissan qashqai", "sentiment": "none"}, {"name": "sunderland nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit job loss fears for Nissan's Sunderland plant could become a reality 17:08, 21 Oct 2016 The car giant is to decide next month whether to produce the next Qashqai SUV model in Sunderland or not Share The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nThe North East is bracing itself for a potentially bitter economic body blow concerning car giants Nissan . \nIts chief executive, Carlos Ghosn, has announced it will decide next month whether or not to produce its next Qashqai SUV model at its Sunderland plant . \nIf the UK had voted to stay in the Europe Union on June 23, most believe that decision would have been a formality. \nNow after Brexit , it is anything but that. \nThe Wearside plant is one of the region’s biggest employers with around 7,000 staff, while tens of thousands more work for companies that provide components and parts for it. \nSharon Hodgson , MP for Washington and Sunderland West, in whose constituency the Nissan factory is based, said: “The decision on whether or not to produce the new Qashqai SUV at the Sunderland Nissan factory will be an important indicator of Nissan’s confidence in our country’s economy as we begin the process of exiting the European Union, especially when questions remain unanswered about our future access to the single market. \n“The Government have said they will do everything they can to support Nissan, especially post-Brexit, but when this decision is made it will be a clear indicator of Nissan’s confidence to invest in our region’s economy and support the 48,000 jobs based here in the North-East and across the country that depend upon the success of the factory.” Nissan/PA Wire Nissan \nMr Ghosn’s comments follow his meeting last week with Prime Minister Theresa May in which he warned that leaving the EU could halt investment on Wearside. \nThe factory, which builds the popular Qashqai SUV and many other models, is Britain’s largest car plant, producing 475,000 vehicles last year, of which about 60% were Qashqais. \nMr Ghosn said: “We’re not asking for any advantage [from the British Government] but we don’t want to lose any competitiveness no matter what the discussions.” \nHe said he had received reassurance that the British government would be “extremely cautious” in “preserving the competitiveness” of the Sunderland plant. \n“As long as I have this guarantee ... I can look at the future of Sunderland with more ease,” he said. Read More Government facing growing pressure to protect Nissan from effects of Brexit \nBidding to build the Qashqai SUV among Nissan’s plants worldwide is expected towards the end of next year or in early 2018 and it seems unlikely that the UK will have finalised its trading arrangements with the EU within that time frame . \nThis poses question marks as to whether Sunderland would be able to bid. At the very least the plant would have to include potential trade tariffs into its calculations, driving up the costs of its bid. \nUncertainty over tariffs is particularly significant, given that 80% of the cars produced at Sunderland are exported. The new Nissan Qashqai is produced on the assembly line at the Nissan Sunderland plant \nIt is ironic that on the night of the EU referendum it was the Sunderland vote which was overwhelmingly for Leave that first hinted at a win for Brexit. Read More \nThis was despite concerns expressed in the campaign about the future of Nissan which were dismissed by Brexiteers as part of ‘Project Fear’. \nHowever Ross Smith, of the North East of England Chamber of Commerce, remained hopeful. \nHe said: “Nissan has repeatedly re-invested in the Sunderland plant, which says a huge amount about the quality of the local management team, the workforce and excellent supply chain in North East England. \n“None of those things have changed, so if the external environment is right there remains a strong case for further models to come here. It would clearly be a big fillip for the region if that happens.” \nCoun Paul Watson, leader of Sunderland City Council , said: “Nissan is vitally important, not just to our city and the wider region but the whole of the UK as it impacts on 40,000 jobs nationally. \n“We very much hope that last week’s reassurances by the Prime Minister that the UK remains a competitive place to do business will be a deciding factor in Nissan’s decision.”", "external_links": [], "published": "2016-10-22T00:08:00.000+03:00", "crawled": "2016-10-21T19:23:40.502+03:00", "highlightTitle": ""}