{"organizations": [], "uuid": "cb25a8f619c77b534e71e87f040b6c8a53214008", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12077782.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-investment-government-not-publish-12106661", "country": "GB", "domain_rank": 21960, "title": "Nissan investment: Government will not publish letter sent to Sunderland car giant", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan investment: Government will not publish letter sent to Sunderland car giant", "spam_score": 0.0, "site_type": "news", "published": "2016-11-01T02:15:00.000+02:00", "replies_count": 0, "uuid": "cb25a8f619c77b534e71e87f040b6c8a53214008"}, "author": "Craig Thompson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-investment-government-not-publish-12106661", "ord_in_thread": 0, "title": "Nissan investment: Government will not publish letter sent to Sunderland car giant", "locations": [], "entities": {"persons": [{"name": "david", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}, {"name": "clive lewis", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "owen", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "qashqai", "sentiment": "none"}, {"name": "wallonia", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The row over the exact details of the Nissan-Government deal rumbles on as ministers demand answers Share Get daily news by email Andrew Matthews/PA Wire A Nissan car dealership \nThe Government will not publish the letter it sent to Nissan which led to the car manufacturer’s decision to pour new investment into its Sunderland plant, Greg Clark has signalled. \nMinisters have been under pressure to reveal the terms of its agreement with the Japanese car giant following last week’s announcement that the company will build two new models at its plant in the north east, securing the future of 7,000 jobs. \nThe Business Secretary set out details of the Government’s four-point approach to the automotive sector, including Brexit reassurances, in a letter to Nissan chief executive Carlos Ghosn. \nBut Mr Clark suggested to MPs he will not publish the letter due to the need to protect Nissan’s commercially sensitive investment plans. \nThe Government has strongly denied suggestions it offered the firm a “sweetheart deal”. \nMr Clark told the Commons the letter contained commitments to continue to make funds available for skills and training, to encourage smaller firms in the supply chain to locate in the UK and to support research and development. Owen Humphreys/PA Wire Workers at Nissan working on the Qashqai in Sunderland, as the car giant has decided to build its next Qashqai SUV at the factory, securing thousands of jobs \nIt also contained a pledge to keep the UK car industry competitive post-Brexit. \nLabour’s shadow business secretary Clive Lewis demanded that the letter be published. \nBut Mr Clark said: “You asked me whether I would publish the correspondence. \n“I have set out the information that I gave them and I would just say this to you. \n“My responsibility, on behalf of the Government, is to encourage and to attract investment in this country and it’s important that when companies of all types and in all sectors share with me their investment plans that are of information to their prospective competitors that they can be assured that they are not going to be disclosed to their competitors to their disadvantage. \n“My objective is to obtain those investments but I’m very happy to answer today and to the select committee where I intend to appear at the invitation of the committee all of the aspects of it.” Business Secretary Greg Clark \nMr Lewis welcomed the investment announcement as “fantastic news” but insisted ministers needed to give more details about how the deal was done. \nHe said: “Are we really to believe that Nissan are risking millions of pounds of investment and the success of its newest models on the basis of the Government’s good intentions alone? \n“If that is the case, then why have they been keeping their good intentions to themselves? \n“The overwhelming impression until now has been that the Government has no strategy for Brexit. \n“If we are now expected to believe that the Government not only has a strategy, but that it has a strategy so convincing that it’s persuaded Nissan to stay without the need for any special guarantees, then why won’t they tell us what they are?” \nMr Lewis joked that Mr Clark must have discovered “the Brexit equivalent of the philosopher’s stone”. \n“Tariff-free market access with no concessions, readily agreed by all 27 EU countries , including Wallonia,” he said. \n“Surely that is a feat worth sharing?” \nThe shadow business secretary said it appeared the Government was willing to give assurances to particular companies while leaving the majority “in the dark”. David Parry/PA Wire Nissan chief executive Carlos Ghosn \n“If you didn’t offer Nissan a sweetener, then what have you got to hide? \n“Show us the letter,” he said. \nMr Clark ridiculed Mr Lewis for adopting a “spluttering old banger of an approach” to the issue as he joked his opposite number should “upgrade to a new model”. \n“I recommend a Qashqai,” he joked. \nThe Business Secretary also set out his vision for securing continued tariff-free access to EU markets for British manufacturers. \nHe said: “In our negotiations to leave the EU we will emphasise the very strong common ground that there is, especially in the automotive sector, between ourselves and other EU member states in ensuring the trade between us can be free and unencumbered by impediments. \n“A good deal for the UK can also be a good deal for other member states and that is how we will approach the negotiations.” Nissan jobs boost", "external_links": [], "published": "2016-11-01T02:15:00.000+02:00", "crawled": "2016-10-31T21:49:31.841+02:00", "highlightTitle": ""}