{"organizations": [], "uuid": "8b445cbffb39bcecd56f8cfd48a43f8cb914eb7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12018357.ece/ALTERNATES/s1200/wigmain.jpg", "site_section": "http://www.chroniclelive.co.uk/whats-on/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/whats-on/shopping/halloween-wigs-poundland-withdrawn-sale-12018250", "country": "GB", "domain_rank": 21960, "title": "Halloween wigs - why has Poundland withdrawn sale of some brands?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Halloween wigs - why has Poundland withdrawn sale of some brands?", "spam_score": 0.0, "site_type": "news", "published": "2016-10-13T18:17:00.000+03:00", "replies_count": 0, "uuid": "8b445cbffb39bcecd56f8cfd48a43f8cb914eb7b"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/whats-on/shopping/halloween-wigs-poundland-withdrawn-sale-12018250", "ord_in_thread": 0, "title": "Halloween wigs - why has Poundland withdrawn sale of some brands?", "locations": [], "entities": {"persons": [{"name": "jerry", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "bob", "sentiment": "none"}, {"name": "pink", "sentiment": "none"}], "locations": [{"name": "poundland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "nite", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wigs taken off Poundland shelves in North East as Killer Clown craze takes off and Halloween approaches Share Get what's on news by email Poundland has recalled a number of halloween wigs \nA leading retailer has withdrawn sales of Halloween wigs . \nPoundland, which also trades under the Dealz brand, said the products had fallen below the standards of the company. \nA statement from Poundland, which has several stores in the North East, said: “Poundland is recalling Halloween Wigs having found them to fall below its standards. \n“Customers are advised to return them to their nearest store for a full refund.” \nIt was not immediately clear how the wigs were found to fall below standards. \nSome of them are marketed with packaging where the wearer, with face painted in various ways, look like demonic clowns. \nThe recall notice comes as the Killer Clown craze, in which people dressed as clowns scare passers-by, has resulted in complaints to police around the region. \nThe products affected by the recall notice include the Fright Nite Long Wig in various colours including green, blue, black, red and pink. \nThe Fright Nite Short Bob wig and the Fright Nite curly wig in the same colours are also affected. \nThe wigs affected have been on sale at Poundland stores, Poundland Online and Dealz stores since August 2016. Read More Missing Marmite and bye bye Ben & Jerry's: Is Brexit hitting our supermarket shelves? \nA recall notice issued by the store stated: “If you have purchased one of these products or have any concerns regarding any other Poundland wig you have purchased previously to August 2016, please return it to your nearest store for a full refund. \n“As a responsible retailer we take the testing and the standard of our products very seriously and remain committed to the highest levels of product quality which is why we are taking this precautionary measure. \n“We apologise for any inconvenience this may cause.” \nPoundland advise customers to check the barcode and return the item to the nearest store. \nThey also ask customers who purchased the wigs for someone else to alert them to the recall. \nThe product codes and barcodes affected are: \n127038-FRIGHT NITE LONG WIG (Green, Blue, Black, Red, Pink) Barcodes: 5054110002671, 5054110002688, 5054110002695, 5054110002701, \n5054110002718 \n15428-FRIGHT NITE SHORT BOB WIG (Green, Blue, Black, Red, Pink) Barcodes: 5054110002626, 5054110002633, 5054110002640, 5054110002657, \n5054110002664, 5054110280475, 5054110280482, 5054110280499, 5054110280505, 5054110280512 \n27039- FRIGHT NITE CURLY WIG (Green, Blue, Black, Red, Pink) Barcodes: 5054110002725, 5054110002732, 5054110002749, 5054110002756, 5054110002763 Clown craze hits the North East", "external_links": [], "published": "2016-10-13T18:17:00.000+03:00", "crawled": "2016-10-13T13:34:06.629+03:00", "highlightTitle": ""}