{"organizations": [], "uuid": "1720124b43133ae71f7cd97f9b3704bc2541bfc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12032002.ece/ALTERNATES/s1200/SBR_151016brexit_06.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hundreds-anti-brexit-campaigners-stage-12031317", "country": "GB", "domain_rank": 21960, "title": "Hundreds of anti-Brexit campaigners stage protest in Newcastle city centre", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Hundreds of anti-Brexit campaigners stage protest in Newcastle city centre", "spam_score": 0.0, "site_type": "news", "published": "2016-10-16T17:09:00.000+03:00", "replies_count": 0, "uuid": "1720124b43133ae71f7cd97f9b3704bc2541bfc7"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hundreds-anti-brexit-campaigners-stage-12031317", "ord_in_thread": 0, "title": "Hundreds of anti-Brexit campaigners stage protest in Newcastle city centre", "locations": [], "entities": {"persons": [{"name": "louise brown", "sentiment": "none"}, {"name": "john barran", "sentiment": "none"}, {"name": "james shearin", "sentiment": "none"}, {"name": "mary james", "sentiment": "none"}, {"name": "coun wallace", "sentiment": "none"}, {"name": "jon proctor", "sentiment": "none"}, {"name": "jonathan wallace", "sentiment": "none"}, {"name": "sheila ellis", "sentiment": "none"}, {"name": "silvie fisch", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}, {"name": "louise", "sentiment": "none"}, {"name": "lee williscroft-ferris", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jasmine watkiss", "sentiment": "none"}, {"name": "helen whitehouse", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "anti-brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "little england", "sentiment": "none"}, {"name": "grey's monument", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "green party", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "siemens", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hundreds of anti-Brexit campaigners stage protest in Newcastle city centre 10:09, 16 Oct 2016 10:10, 16 Oct 2016 By Jasmine Watkiss , Helen Whitehouse The event at Grey's Monument in Newcastle city centre was attended by people from all over the North of England Share Get daily news by email Newcastle For Europe rally in the city centre \nAnti-Brexit protesters gathered at Monument for a 250-people strong protest against leaving the EU. \nThe event was attended by people from all over the North of England including Liverpool, Manchester and Leeds - with plenty of North East natives. \nLocal politicians from Labour, the Lib Dems and the Green party came together to speak about the issues that Brexit has caused in the North East. \nLabour MP Chi Onwurah and Lib Dem Councillor Jonathan Wallace were concerned by the impact of Brexit on local jobs at Nissan and Siemens, and the alarming rise in racially-motivated or xenophobic hate crimes since June 23. \nCoun Wallace said: “The post-brexit vision adores conformity and is inward-looking. \n“It has taken us back to the social conformity of the 1950s.” \n“It is now a case of Great Britain versus Little England. A Britain that is open for business or a Britain that is in slow economic decline.” Read More Marmite and ice cream - how Brexit is already changing our lives \nLabour MP Chi Onwurah said: “The Tories are deliberately using language which creates an environment with effectively promotes hate crime. \n“They are intentionally flirting with xenophobia in an attempt to shore off their absolute lack of strategy to enact a Brexit which works for all of us.” \n“People did vote to reduce immigration because immigrants have been blamed for all the problems associated with austerity.” \nOccasionally, a vocal passer-by tried to interrupt proceedings, but there was an air of positivity as the crowds cheered stirring speeches from local politicians and activists. \nSeveral bystanders were keen to say how Brexit has affected them. \nSheila Ellis, from Sunderland said: “I grew up in the rubble of the last world war and I know how important this is.” \n“I was part of the crowd-funding to get the rally here. It’s a very worthy cause.” Newcastle For Europe rally in the city centre \nMary James, 56, from Jesmond said: “I was so happy the rally came to Newcastle. It’s a badge of honour now here today. Everyone thinks we voted to leave, but we didn’t, everyone’s diverse and Newcastle wants to welcome this.” \nSilvie Fisch, who lives in Newcastle , said: “I’m German, and Brexit has affected me a lot. I’ve lived in the UK for 20 years. I felt safe and welcome here for a long time, and all of a sudden everything has changed.” \n“There are parallels between the current situation and what happened to German communities in the UK when the First World War broke out.” \nGreen Party activist Lee Williscroft-Ferris said: “Newspaper headlines call us unpatriotic, but the people who voted leave do not have a monopoly on patriotism. Their patriotism is not one we recognise.” \n“To those who are here from European countries, do not think you aren’t welcome in Newcastle because you absolutely are.” Read More Nissan boss 'confident' UK is competitive after crunch talks with PM over future of Sunderland plant \nSpeech and language therapist Louise Brown said: “We were all told a lot of lies. It’s turned into a Tory-led Brexit, and the people who voted to leave were lied to the most of all.” \nAs a health worker, Louise has seen first-hand the effect of Brexit on British healthcare. “European health workers who had contracts to come and work in the UK just didn’t turn up after the Brexit vote.” \nJames Shearin said: “What people were promised and what they actually voted for are two different things.” \nEuropean Activist John Barran held a large flag, and said: “For all its faults, the freedom of movement is a grand human achievement. That’s not something I’m willing to lose.” \nJon Proctor, one of the organisers, said: “We are all passionate about this. This rally is energising our community. We need to talk about the impact of Brexit, and we need to fight back.”", "external_links": [], "published": "2016-10-16T17:09:00.000+03:00", "crawled": "2016-10-16T12:43:15.055+03:00", "highlightTitle": ""}