{"organizations": [], "uuid": "2e6922e48bb91e059fa4dff39ff0fc045b58ca16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11176376.ece/ALTERNATES/s1200/JS73964669.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-still-bidding-new-devo-12011183", "country": "GB", "domain_rank": 21960, "title": "Newcastle still bidding for new devo deal - and can become 'the Great North City'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle still bidding for new devo deal - and can become 'the Great North City'", "spam_score": 0.0, "site_type": "news", "published": "2016-10-12T04:28:00.000+03:00", "replies_count": 0, "uuid": "2e6922e48bb91e059fa4dff39ff0fc045b58ca16"}, "author": "Michael Muncaster", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-still-bidding-new-devo-12011183", "ord_in_thread": 0, "title": "Newcastle still bidding for new devo deal - and can become 'the Great North City'", "locations": [], "entities": {"persons": [{"name": "mancheste", "sentiment": "negative"}, {"name": "nick forbes", "sentiment": "negative"}, {"name": "richard davies", "sentiment": "none"}, {"name": "adam serfontein", "sentiment": "none"}, {"name": "ben lucas", "sentiment": "none"}, {"name": "coun forbes", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "pat ritchie", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "brian aitken", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "nick forbes  newcastle", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "crowne plaza", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "communities", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "hanro group", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "metro dynamics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle City Council leader Nick Forbes says the city must be seen as an equal alongside Manchester, Liverpool and London Share Get daily news by email Nick Forbes \nNewcastle is not going to give up on getting a new devolution deal for the North East. \nThat’s the message from Newcastle City Council leader Nick Forbes , who outlined his hope at the authority’s annual State of the City event on Tuesday. \nIn front of a packed audience at the Crowne Plaza, Coun Forbes and a panel of experts told of their ambitions for the city as well as the challenges it faces. \nCoun Forbes said the city is still seeking a new devolution deal after Communities Secretary Sajid Javid said devolution for the North East was “off the table”. \nIt comes after the Government announced it was giving up on the North East devo package, after a majority of the region’s seven local councils voted against pressing ahead with it. \nCoun Forbes said: “Some saw that as game over. Some even celebrated that as game over. That is not my position. Read More North East mayor and £900 million devolution deal is scrapped \n“The needs of our communities has not gone away and the desire from business to grow faster than other parts of the UK is undiminished. \n“To achieve all of that we need to press ahead with devolution to show that Newcastle is part of the vanguard of a new constitutional settlement in the country.” \nCoun Forbes warned Newcastle must not allow itself to be relegated to the “second tier” like other cities and councils. The panel speaking at the council's annual State of the City event \nHe added: “We have to be seen as equals and working alongside Manchester, Liverpool, Birmingham and London and others who opt for devolution, including in Teesside. \n“So the conversion must and will continue. There is a coalition of the willing between Newcastle, North Tyneside and Northumberland . \n“Together we represent almost a million people and we are determined to continue the conversion with Government around the benefits of devolved powers and responsibilities for our communities.” \nCoun Forbes called on Newcastle to take control of its own destiny if it is to become “the Great North City”. \nHe said: “There is a strong sense of identity in Newcastle, which means the people here do not feel isolated, or cut off from each other. Read More Northern Powerhouse - George Osborne fights to save his pet project \n“The changing circumstance of public finances, of devolution and of Brexit means that we as a city have to be clear about how we will create Newcastle’s reputation once again. \n“No-one outside of Newcastle will do this for us. It is something we have to decide to do and we have to tell the world this is what we are doing.” \nThe panel, including Newcastle United’s head of corporate affairs Brian Aitken and Metro Dynamics managing director Ben Lucas, then spoke about the impact Brexit could have on the city. Councillor Nick Forbes with Chief Executive Pat Ritchie \nThe council’s chief executive Pat Ritchie warned Newcastle University and Northumbria University could both be affected when Britain leaves the European Union. \nAdam Serfontein, Hanro Group’s managing director, agreed, saying: “It will have a big impact on the education sector and overseas students being able to come here and study. \n“It will be March 2019 before we know what the playing field looks like. We now have to get on with it and make sure we get the maximum advantage from it.” Read More Nick Forbes: I am not going to give up on North East devolution \nProfessor Richard Davies, pro vice chancellor for engagement and internationalisation at Newcastle University, said foreign students bring £115m into the region every year. \nHe said: “We get some fantastic students and staff at the university and our message is that they are welcome at Newcastle University. \n“We benefit from research funding from across the EU and without foreign students and staff we will be a weaker university and city.” \nThe panel also discussed providing more support for disadvantaged communities, developments in the city and improving transport links.", "external_links": [], "published": "2016-10-12T04:28:00.000+03:00", "crawled": "2016-10-12T00:08:31.208+03:00", "highlightTitle": ""}