{"organizations": [], "uuid": "8fc540346593eb861604875389d6212d208b11b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29827183/15632633.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/caterpillar-laying-off-113-staff-in-desford/story-29827183-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Caterpillar laying off 113 staff in Desford", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Caterpillar laying off 113 staff in Desford", "spam_score": 0.0, "site_type": "news", "published": "2016-10-21T13:04:00.000+03:00", "replies_count": 0, "uuid": "8fc540346593eb861604875389d6212d208b11b8"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/caterpillar-laying-off-113-staff-in-desford/story-29827183-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Caterpillar laying off 113 staff in Desford", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "paresh patel", "sentiment": "none"}], "locations": [{"name": "peckleton lane", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "desford", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "caterpillar", "sentiment": "negative"}, {"name": "desford caterpillar", "sentiment": "negative"}, {"name": "caterpillar inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Caterpillar laying off 113 staff in Desford By TomPegden | Posted: October 21, 2016 0 COMMENTS SHARES Caterpillar laying off 113 staff in Desford X \nCopy link to paste in your message / \nMore than 100 workers are going in the latest round of job cuts at one of the county's biggest manufacturers. \nCaterpillar (UK) is laying off 113 staff at its Desford plant this month. \nIt is fewer than the 150 potential redundancies the company had announced last month. \nCaterpillar said all the workers affected were leaving voluntarily and the business – which has faced a drop in global orders – has managed to avoid compulsory redundancies. \nUnion leaders have worked closely with management to make the process as painless as possible. \nThey said cuts among permanent shop floor staff in the mechanical excavator – or backhoe loader division – at the Peckleton Lane plant, would play some part in securing the future of the site. \nA company spokesman said: \"Caterpillar's voluntary severance programme has now concluded and will result in approximately 113 employees leaving its Desford facility during October. \n\"Thanks to a sufficient number of volunteers, alongside some forthcoming increase in production, we are able to avoid compulsory redundancies. \n\"We know this has been a difficult time for employees and we are grateful for their commitment throughout this process, which ultimately will increase our competitiveness. \n\"Following the voluntary severance programme, the permanent workforce will be approximately 1,100 at the Desford facility.\" \nUnite union regional officer Paresh Patel said: \"We have been in detailed negotiations with Caterpillar and basically I'm pleased to report that there are no compulsory job losses. \n\"While we never want to see anybody lose their jobs, the negotiations have been really positive and constructive. \n\"Suffice it to say the package offered has been accepted by the union. \n\"Caterpillar has had its fair share of redundancies but in between, when things have picked up they have increased their workforce, taking on temps as permanent staff or taking on apprentices. \n\"It's a difficult climate out there and we do not know what Brexit will cause. \n\"As a union we are making representatives across all manufacturing industries. \n\"It is still uncertain times and we hope this will be the last tranche of redundancies. But it is difficult to see what's around the corner, and we will be doing what we can to protect jobs. \n\"There has been a drop in production of back hoe loaders, one of the areas affected, but what has happened is also trying to future-proof the plant, given the economic climate in Europe.\" \nBackhoe loaders and compact wheel loaders made at the county site are typically used in the building and construction trade, as well as earth-moving, aggregates and mining. \nIn July parent company Caterpillar Inc announced sales and revenues for the previous three months were down $2 billion (£1.6 billion) at $12.3 billion, compared to $10.3 billion a year earlier. \nIn a trading statement the parent company said: \nThe world economic growth remained subdued. We are not expecting an upturn in important industries like mining, oil and gas and rail to happen this year. Commodity prices appear to have stabilised, but at low levels. Global uncertainty continues, and the recent Brexit outcome and the turmoil in Turkey adds to risks, especially in Europe.", "external_links": [], "published": "2016-10-21T13:04:00.000+03:00", "crawled": "2016-10-21T09:49:22.059+03:00", "highlightTitle": ""}