{"organizations": [], "uuid": "bba7a99f5b8e54638607bc1ea439b36cfac28b96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12086097.ece/ALTERNATES/s1200/JS54001575.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/innovation-drives-growth-north-east-12086499", "country": "GB", "domain_rank": 21960, "title": "Innovation drives growth for the North East automotive sector", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Innovation drives growth for the North East automotive sector", "spam_score": 0.0, "site_type": "news", "published": "2016-10-27T22:03:00.000+03:00", "replies_count": 0, "uuid": "bba7a99f5b8e54638607bc1ea439b36cfac28b96"}, "author": "Angela Upex", "url": "http://www.chroniclelive.co.uk/business/business-news/innovation-drives-growth-north-east-12086499", "ord_in_thread": 0, "title": "Innovation drives growth for the North East automotive sector", "locations": [], "entities": {"persons": [{"name": "robert forrester", "sentiment": "none"}, {"name": "mckinn", "sentiment": "none"}, {"name": "vertu", "sentiment": "none"}, {"name": "mcminn", "sentiment": "none"}, {"name": "paul butler", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mayes", "sentiment": "none"}, {"name": "butler", "sentiment": "none"}, {"name": "nigel mcminn", "sentiment": "none"}, {"name": "liz mayes", "sentiment": "none"}, {"name": "dave atkinson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "volkswagen", "sentiment": "none"}, {"name": "smes", "sentiment": "none"}, {"name": "lloyds bank automotive report", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "lloyds bank commercial banking", "sentiment": "none"}, {"name": "gt group", "sentiment": "none"}, {"name": "nissan qashqai", "sentiment": "none"}, {"name": "erdf", "sentiment": "none"}, {"name": "benfield motor group", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "miller construction uk", "sentiment": "none"}, {"name": "vertu motors  forrester", "sentiment": "none"}, {"name": "audi", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "caterpillar", "sentiment": "none"}, {"name": "cummins", "sentiment": "none"}, {"name": "north east automotive alliance", "sentiment": "none"}, {"name": "vertu motors", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "neaa", "sentiment": "none"}, {"name": "komatsu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Innovation drives growth for the North East automotive sector 15:03, 27 Oct 2016 Automotive has been one of the North East’s most important business sectors for several decades now. MARK LANE spoke to some of the key players in the sector about the current state of the industry and its prospects Share Get business news by email The Nissan Qashqai in production in Sunderland \nThe global automotive sector is changing rapidly, with significant breakthroughs in the hybridisation of engines and electrical vehicular development being two of the major drivers for this change. \nThe North East automotive supply chain, with the innovative, research and development-focused Nissan at its heart, is ideally placed to capitalise on the opportunities presented by these shifting market dynamics. \nCertainly, one of the most significant developments to have taken place in recent years for the region’s automotive supply chain was the launch last year of the North East Automotive Alliance (NEAA) which promotes the region’s automotive sector capabilities on a national and international level, as well as providing supply chain business and collaboration opportunities. \nThe development of the NEAA can be viewed as a much-needed strategic development for the region’s automotive supply chain – an opportunity to foster collaboration and the tackling of common issues across the multitude of world-class engineering and related automotive businesses which now reside here. \nHeading up the NEAA is Paul Butler. He says: “Improving the supply chain competitiveness is a key focus for the NEAA. The NEAA has been able to secure ERDF funding to support over 160 SMEs across the North East region. Paul Butler, CEO of NEAA \n“This funding will not only allow the NEAA to improve SME capability in the existing supply chain but to also increase the breadth of the supply chain by attracting new SMEs into the automotive supply chain. \n“In just 18 months the NEAA has grown to become the UK’s largest automotive cluster, and one of the fastest growing clusters across Europe. The NEAA represents the region’s automotive sector on 16 steering groups throughout the UK and has raised the profile of the region’s significant and growing automotive capabilities.” \nThink automotive in the North East and minds automatically go to Nissan – which is fair enough given that the company now employs around 7,000 people producing \n500,000 cars per annum, approximately one third of all UK car production. \nHowever, what has become increasingly apparent in recent years is how Nissan’s presence has spawned a world-class supply chain which continues to grow and develop. \nButler says: “The North East automotive sector is not just restricted to Nissan and its supply chain, indeed the region is home to a significant off-highways sector which includes Komatsu, Caterpillar, GT Group and Miller Construction UK; and includes other key OEMs such as Cummins and the Explorer Group.” \nButler also points out how the North East has become global leader in electric vehicle manufacture, thanks in no small part to the fact that the all-electric Nissan LEAF is manufactured here and accounts for 26% of all electric vehicle production across Europe. \n“This has had a knock-on effect and now the region boasts a significant and growing reputation for investment into research and development and new and emerging automotive technologies,” says Butler. “We are advanced in terms of battery technology, control systems and EV charging networks.” \nToday there are over 240 companies operating in the automotive sector in the North East, together employing over 30,000 people and generating more than £11bn of sales for the region’s economy. \nAsked where he sees this major North East industry sector heading in the next five years, Butler told us: “The pace of innovation in automotive is unprecedented. Environmental concerns such as climate change and city air quality; safety and congestion pressures; and changing customer tastes and model integration are driving this change. \n“The hybridisation of engines and electric car market really is taking off however we’re certainly not there yet. The future is all about developing the range of the vehicles so drivers can drive further and charge faster. Lighter cars, bigger batteries are coming and faster charging is under development. Hybrid technologies are also strong in the off-highway sector.” \nAll of which points to some exciting times ahead for the region’s automotive supply chain. However, there are many challenges on the horizon, of which – arguably – the most pressing is skills. To find out more about this issue, we talked to Liz Mayes, the North East region director of the EEF, the manufacturers’ organisation (which includes many automotive sector members). \nShe told us: “Access to skilled workers continues to be a perennial weed for the sector. Firms struggle to attract both the quality and quantity of skilled workers that they need to drive their businesses forward. Liz Mayes \n“The fast-approaching advent of 4IR (the fourth industrial revolution) is expected to exacerbate this problem even further and will see manufacturers across the board seeking to compete with other hi-tech industries for staff with the technical, managerial and leadership skills required to capitalise on the opportunities set to be unleashed by new technologies. \n“Against this backdrop, it’s worrying that firms typically have grave concerns about the Apprenticeship Levy, which the Government sees as a solution to creating more and better apprenticeships, while industry sees it as a system likely to fail.” \nSkills are an ongoing problem for the sector, and a problem which many sector-linked companies didn’t expect to be facing until the shock Brexit result, was the UK’s withdrawal from the EU market. This is a serious worry for Mayes and her organisation’s members. She told us: “There is a lot of uncertainty and we are, of course, worried that [Brexit] could lead to reduced investment. \n“What we do know is that firms’ business confidence dropped following the referendum and that, in this region, manufacturers are more concerned about the status of EU funding and research grants than their peers in other regions and were among those most likely to immediately review UK recruitment and investment. \n“For the automotive sector and manufacturing as a whole, ongoing access to the single market in goods and services and the ability to continue to employ and deploy staff from across the EU will be critical. \n“At the same time, we know that firms are also keen to seize post-Brexit opportunities for more global trade and it’s vital that the Government supports these ambitions through new free trade agreements, particularly with the US, China, India and Canada, which are the countries of most interest to manufacturers.” \nWhile Brexit has unquestionably cast a spell of uncertainty over all of the region’s manufacturers, our conversations with the industry stakeholders we spoke to suggested there is still a strong sense of optimism in automotive supply chain circles. \nSuch anecdotal evidence is backed by several industry surveys on this issue. For instance, the extensive recent Lloyds Bank Automotive Report suggests North East manufacturers are forecasting 13% growth over the next two years, while their commitment to innovation remains strong with the region’s firms planning to invest an average of 18% of current turnover into research and development over the next two years (as opposed to 17% across the UK as a whole). \nMeanwhile, the same report suggests North East firms are keeping a close eye on technological developments in the sector, with more than a third (40%) planning to upskill their workforce or change their business model to develop low carbon or electric vehicle technology. \nDave Atkinson is head of manufacturing for Lloyds Bank Commercial Banking. Talking on the report’s findings, he told us: “The North East is home to a vibrant automotive industry. \n“[In our latest survey] businesses in the region told us they were gearing up for turnover growth over the next two years and had above UK-average plans to invest in new products. \n“On average North Easy companies are looking to invest almost a fifth of their turnover in research and development, with many creating new products and spending on existing lines.” \nThis commitment to research and development bodes well for the automotive sector’s future in the North East. Equally important are developments such as the International Advanced Manufacturing Park (IAMP) project which will provide a world-class environment for hi-tech industries and advanced manufacturing businesses, including further options for the automotive sector. \nSunderland City Council is continuing to work very closely with South Tyneside Council on the IAMP project. \nThis joint venture has seen the two councils consulting recently on a preferred site for IAMP which is proposed for an area close to the A19 and A1 to the north of Nissan’s existing manufacturing plant. RETAIL SECTOR FOCUS \nThe region’s car retail industry continues to flourish, thanks in no small part to the fact that the people of the North East love their cars. We spoke to the leaders of two prominent motor retailers about the outlook for the sector VERTU Motors has 16 dealerships in the North East alongside substantial central functions, all of them located at Team Valley, Gateshead. Employing more than 1,000 people in the region, this is one of the North East’s most successful companies. \nDiscussing the current state of the market, Vertu chief executive Robert Forrester told us: “Used car demand is very robust indeed. On the new car side, we have seen UK demand falling since April of this year and with sterling down there will be some upward pressure on new car prices. That said, with the UK being the fastest growing major economy on the planet, near full employment and low interest rates all provide much optimism of strong new car markets in the years ahead.” Robert Forrester, CEO of Vertu Motors \nForrester sees significant opportunities for Vertu as the car retail sector in the region consolidates. He added: “We will seek to further consolidate the sector as more people decide to sell their dealerships. We are the fifth largest car retailer in the UK and theeighth largest in Europe. \n“We are well set to ensure that there is a major North East-based car retailer in the future and this will help to contribute to the economic growth in the region. \n“Companies that are headquartered in the region will be vital if the region is to flourish and high-value added jobs are developed. There is a big knock-on effect to other companies in the region.” \nWe also talked to Nigel McMinn, managing director at the motors group Lookers, which also employs over 1,000 staff across 21 businesses in the region, including eight Volkswagen, four Audi and two Nissan dealers, as well as wholesale operations and a repair centre. Lookers last year purchased the Benfield Motor Group. \nMcMinn suggests there has always been a strong motor retail trade in the region, with the presence of the Nissan manufacturing plant in Sunderland leading to demand for that brand in the North East being “the strongest in the UK”. \n“[Demand for cars] has fully recovered from the 2008 recession and new registrations have now surpassed the previous UK peak market. Used car demand this year is also the strongest on record,” he told us. \nAsked about current opportunities, challenges and threats for modern day car retailers, McKinn said: “The role of the internet in the purchase experience will be the biggest area of challenge and opportunity going forward. \n“Like other mainstream retail sectors it appears likely that customers will \nultimately want a ‘multi-channel’ experience which still includes physical outlets as well as e-commerce. \nBoth will be supported by call centres. \n“The use of technology and cleverer management of customer data will make communication more personalised and relevant.”", "external_links": [], "published": "2016-10-27T22:03:00.000+03:00", "crawled": "2016-10-27T17:07:45.440+03:00", "highlightTitle": ""}