{"organizations": [], "uuid": "dc8a569a62f482c618f45c2fb81877660c69ad06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29774489/15594230.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/company-car-8216-taxes-will-increase-if-corbyn-is-elected-pm-8217/story-29774489-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury commented Company Car: 'Taxes will increase if Corbyn is elected PM'", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury commented Company Car: 'Taxes will increase if Corbyn is elected PM'", "spam_score": 0.0, "site_type": "news", "published": "2016-10-04T12:59:00.000+03:00", "replies_count": 0, "uuid": "dc8a569a62f482c618f45c2fb81877660c69ad06"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/company-car-8216-taxes-will-increase-if-corbyn-is-elected-pm-8217/story-29774489-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury commented Company Car: 'Taxes will increase if Corbyn is elected PM'", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "negative"}, {"name": "sanjay gogia", "sentiment": "negative"}, {"name": "ross walk", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david shrigley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "leicest", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "trafalgar square", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "dmu", "sentiment": "none"}, {"name": "un", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "turner prize", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (1) \nSanjay Gogia is a notary public and commissioner of oaths, based in Ross Walk, Leicester \nDo you think Donald Trump might be the next US President and what are your thoughts if he is? \nI do not think he is going to win. Leaders like him are a disaster in this world. Donald Trump has never served in a government job of any sort. The most frightening thing about Trump is that he considers himself to be 100 per cent correct about everything. His plans to renegotiate trade deals and impose tariffs on countries that will not bend to his will can be very harmful for the American economy which may indirectly affect Britain. \nHow tough do you think the UN, UK, US and EU should get with Russia over Syria and are you concerned things could escalate? \nAmerica, Britain and the EU are not comfortable with Putin's ambitions in the Middle East, or his methods of achieving them. Putin is trying to distract the international community from his own unfinished intervention in eastern Ukraine. I think European capital markets should be closed to Russian banks. EU-Russia arms deals should be banned and the EU should not export any oil industry technology to Russia. Russia should also be suspended from the G8 permanently. \nAn asset freeze on leading Russian individuals and companies will not only affect bank accounts and shares but also economic resources such as property. But the United States, Britain and EU should not suspend their diplomatic engagement on Syria with Russia. \nA family paid £3,600 for a holiday villa that didn't exist. What's the worst scam/holiday disaster you have ever fallen victim to? \nMy heart goes out to the people who paid such a big amount. I was scammed by a travel agency in India. They would only communicate via e-mail. The website was set up using fake details and false information. The room given to me in the hotel was nowhere close to the pictures on the website and the facilities were awful. \nWhat do you make of the huge \"thumbs up\" statue DMU graduate and Turner Prize nominee David Shrigley has installed in Trafalgar Square? \nI think it is a good piece of work and makes a very positive statement. It conveys an upbeat message that \"all is well\" after Brexit, even though we all know that there is a lot of uncertainty. \nWhat is the future of the Labour party under Jeremy Corbyn? \nThe first job of any Prime Minister is to keep the country safe. I am totally unsure as to how that can ever happen if Jeremy Corbyn, below, decimates MI6, cancels Trident and shackles the army. \nOther policies include ending austerity, blocking welfare cuts, scrapping tuition fees and creating a national education service, all of which means that taxes will rise for both individuals and corporations. If corporation tax goes up many foreign investors might move their headquarters to other EU countries such as Ireland where corporation tax is the lowest. \nHow will Brexit impact on British laws, lawmakers and lawyers? \nIf the single market remains open to the UK then there is no problem. If the single market does not remain open, negative consequences will slowly follow. Businesses and individuals have got used to arranging themselves around the existing laws. If those were to change dramatically and quickly it could cause huge uncertainty.", "external_links": [], "published": "2016-10-04T12:59:00.000+03:00", "crawled": "2016-10-04T11:38:40.749+03:00", "highlightTitle": ""}