{"organizations": [], "uuid": "7d2725e275e7de36fa93a6edfa72145a9c688d4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29818084/15624536.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/opinion-8203-the-brexit-rollercoaster-rattles-on/story-29818084-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published OPINION: ​The Brexit rollercoaster rattles on", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published OPINION: ​The Brexit rollercoaster rattles on", "spam_score": 0.0, "site_type": "news", "published": "2016-10-18T17:12:00.000+03:00", "replies_count": 0, "uuid": "7d2725e275e7de36fa93a6edfa72145a9c688d4a"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/opinion-8203-the-brexit-rollercoaster-rattles-on/story-29818084-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published OPINION: ​The Brexit rollercoaster rattles on", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "tom pegden", "sentiment": "negative"}, {"name": "farage", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bank of england minouche shafik", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "unilever", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nThe Brexit rollercoaster rattles on, writes Tom Pegden . \nWhether it eventually comes to a pleasant halt at the platform, or flings its passengers into the theme park's lion enclosure is anyone's guess. \nIn early June, worried markets were on a downward slide as they feared the Eurosceptics might win the referendum. \nThings ratcheted upwards as polls said Farage, Boris and Gove weren't going to win. \nThen, just as the carriages looked like heading ever upward, the results came in and the pound and stock markets nosedived. \nThe London Stock Exchange has bounced back, but sterling is looking very precarious. \nIn the meantime, the man who brought about this situation handed the keys back to 10 Downing Street. \nBut rather than ripping themselves apart, the Tories came together and quickly elected a new leader. \nThe ride started heading upwards again, and continued through the summer as everyone started thinking maybe the economy wasn't doomed. \nThen all hell broke loose and that rollercoaster is plummeting again, with warnings of a consumer spending slowdown and the drop in sterling beginning to pinch. \nThe local picture is no more positive than the national. \nJust as Unilever had its spat with Tesco last week, Leicestershire's manufacturers are also worried about rising costs. \nFood and drinks firms which import raw materials told the Mercury they were seeing those costs rise 18 per cent. \nThat's a big hit for small companies which already struggle with things such as access to finance, staff retention, rising business rates and ever more frugal customers. \nThose same firms told a meeting with MPs they are already finding it hard to fill unskilled positions. \nIf restrictions on immigration come in when we leave the EU, they say this will get worse. \nFewer staff means less productivity, higher prices and less benefit to the economy. \nIronically, cutting immigration – the reason many voted to leave the EU – looks like it will have a big impact on the economy. \nYou can't have your cake and eat it, it would seem. \nThen, on Friday, a Q&A session with deputy governor of the Bank of England Minouche Shafik gave Leicester taxpayers a chance to raise their concerns with someone who really mattered. \nWhat would be the consequences of all this free cash being pumped into the economy through quantitative easing, she was asked? \nWas the Bank right to bring interest rates down post-referendum, rather than hold out a bit longer or even raise them? \nWhat was being done to give small and medium-sized businesses and start-ups access to investment funding? \nHow would a lower exchange rate impact on inflation? \nIt looks like the brief spell of economic optimism that followed June 23 has subsided. \nThey say a week is a long time in politics. \nWell, the next couple of years might feel very long indeed. \nThe ride could get bumpy.", "external_links": [], "published": "2016-10-18T17:12:00.000+03:00", "crawled": "2016-10-18T12:54:57.618+03:00", "highlightTitle": ""}