{"organizations": [], "uuid": "8d5ef399f0017cb88a230f46a5895fd50dcd28e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11985896.ece/ALTERNATES/s1200/Vera-Baird-Newcastle-Crime-consultation.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-want-police-officers-do-11985856", "country": "GB", "domain_rank": 21960, "title": "What do we want our police officers to do? Tackling hate crime tops the list", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What do we want our police officers to do? Tackling hate crime tops the list", "spam_score": 0.0, "site_type": "news", "published": "2016-10-06T18:00:00.000+03:00", "replies_count": 0, "uuid": "8d5ef399f0017cb88a230f46a5895fd50dcd28e3"}, "author": "Michael Muncaster", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-want-police-officers-do-11985856", "ord_in_thread": 0, "title": "What do we want our police officers to do? Tackling hate crime tops the list", "locations": [], "entities": {"persons": [{"name": "vera baird", "sentiment": "none"}, {"name": "steve ashman", "sentiment": "none"}, {"name": "baird", "sentiment": "none"}, {"name": "cons ashman", "sentiment": "none"}], "locations": [{"name": "european union", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "umbria police", "sentiment": "none"}, {"name": "northumbria police", "sentiment": "none"}, {"name": "newcastle civic centre", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What do we want our police officers to do? Tackling hate crime tops the list 11:00, 6 Oct 2016 Northumbria Police and Crime Commissioner Vera Baird spoke with residents to discuss how the force should operate Share Get daily news by email Vera Baird \nTackling hate crime and dangerous so-called legal highs should be the priority for Northumbria Police . \nThat’s the message from residents who had their say on how the force should operate at a public consultation held at Newcastle Civic Centre on Wednesday. \nNorthumbria Police and Crime Commissioner Vera Baird and chief constable Steve Ashman spoke with members of the public as Ms Baird looks to create her Police and Crime Plan. \nThe four-year plan will include her objectives and priorities for policing, what resources will be provided to the chief constable and how performance will be measured. \nDuring the meeting, one resident raised concerns over the increase in hate crime in the region after UK voters opted to leave the European Union. \nMs Baird said: “There had been an increase since Brexit but it did not go up an enormous amount and settled down quite quickly. \n“It was very unpleasant with people saying on the street ‘why are you here we voted for you to go home’. \n“The minority communities do work well together and when there is an issue they join together with the council and police to try and resolve them.” \nChief Cons Ashman said all forces across the country face a rise in hate crimes following major events such as the Paris attacks. \nHe added: “As a police force we have got to decide what we are going to do about the sad inevitable spike in reports of hate crime. \n“When it happens we have got to make sure that we get back to normality as soon as we can.” \nConcerns over the blanket ban on so-called legal highs, which came into force in the UK in May, was also raised at the event. \nOne resident feared the law to criminalise the production, distribution, sale and supply of new psychoactive substances could drive the market underground. \nThe chemicals are designed to give users the same effect as drugs like cannabis and cocaine and last year were linked to more than 100 deaths in the UK. Read More Legal high crackdown launched in Newcastle by Northumbria Police \nChief Cons Ashman said: “Legal highs can cause very serious harm - to young people in particular - but there has been a huge of amount of work done here. \n“Looking at the damage it can cause and the risk to young people, action needed to be taken. We are leading the way nationally on what we are doing about it.” \nMs Baird added: “There are very vulnerable people being sold legal highs. The police and city council have worked very well to combat that.” \nResidents also sought assurances over community policing to ensure close relationships are maintained with volunteer groups. \nMs Baird said: “We can assure you that community policing remains a priority for us. \n“Community support officers pay an important role and because they may have been estate agents or hairdressers, people communicate with them and they get an enormous amount of intelligence from that. \n“There will be no risk to community policing while I am the police and crime commissioner.”", "external_links": [], "published": "2016-10-06T18:00:00.000+03:00", "crawled": "2016-10-06T13:20:21.356+03:00", "highlightTitle": ""}