{"organizations": [], "uuid": "973874a41545f9f63d8ad1aa1548dc5d63040dde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.liverpoolecho.co.uk/incoming/article11292827.ece/ALTERNATES/s1200/JS89065845.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/health/uk-train-more-doctors-stop-11974306", "country": "GB", "domain_rank": 21960, "title": "UK to train more doctors to stop importing them from overseas - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "UK to train more doctors to stop importing them from overseas - Chronicle Live", "spam_score": 0.245, "site_type": "news", "published": "2016-10-04T13:00:00.000+03:00", "replies_count": 0, "uuid": "973874a41545f9f63d8ad1aa1548dc5d63040dde"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/health/uk-train-more-doctors-stop-11974306", "ord_in_thread": 0, "title": "UK to train more doctors to stop importing them from overseas - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "jonathan walker h", "sentiment": "neutral"}, {"name": "hunt", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "world health organisation", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "conservative party conference", "sentiment": "none"}, {"name": "armed forces", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UK to train more doctors to stop importing them from overseas 05:00, 4 Oct 2016 By Jonathan Walker Health Secretary Jeremy Hunt wants to end reliance on foreign doctors and has announced a dramatic expansion of medical student places Share Get daily news by email Health Secretary Jeremy Hunt \nThe UK is to train more medical students - to ensure we don’t have to rely on foreign doctors. \nHeath Secretary Jeremy Hunt is announcing a dramatic expansion of medical student places, as he speaks at the Conservative conference in Birmingham. \nThe 2018 intake of medical students will be funded by Government to rise by up to 1,500 places a year, an increase of 25%. \nMr Hunt will pledge to reform the current cap on the total number of places that medical schools can offer, which is set at just over 6,000 a year. Currently, universities are forced to turn away half of those who apply to study medicine. \nCurrently, The UK relies heavily on doctors from overseas, who now comprise 25% of the medical workforce, as well as expensive agency staff. \nLast year hospitals spent £3.3 billion on agency staff, including £1.2 billion on medical locums, money which the Government says could be better spent. \nThe World Health Organisation says that there is now a global shortage of more than 2 million doctors – meaning self-sufficiency will be more important in the years ahead. A doctor \nSpeaking at Conservative Party Conference in Birmingham, the Health Secretary is expected to say: \n“As well as delivering higher standards today, we need to prepare the NHS for the future – which means doing something we have never done properly before: training enough doctors. \n“Currently a quarter of our doctors come from overseas. They do a fantastic job and we have been clear that we want EU nationals who are already here to be able to stay post-Brexit. \n“But is it right to import doctors from poorer countries that need them whilst turning away bright home graduates desperate to study medicine?” \nHe will add: “From September 2018, we will train up to 1500 more doctors every year, increasing the number of medical school places by up to a quarter. Of course it will take a number of years before those doctors qualify, but by the end of the next parliament we will make the NHS self- sufficient in doctors.” \nIn order to ensure these reforms deliver for the taxpayer, the Government will also require for the first time that all those trained as doctors on the NHS will be required to work in the NHS for a minimum of four years after graduation. \n“This mirrors the approach taken for those whose higher education was funded by the Armed Forces. It currently costs the taxpayer £220,000 to produce a graduate from medical school. ", "external_links": [], "published": "2016-10-04T13:00:00.000+03:00", "crawled": "2016-10-04T08:04:39.097+03:00", "highlightTitle": ""}