{"organizations": [], "uuid": "69b8fe51aa983d2949256e2c7423ebe08e2afb3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29781349/15598769.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/topps-tiles-set-to-deliver-record-sales/story-29781349-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published Topps Tiles set to deliver record sales", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Lauren_Mills published Topps Tiles set to deliver record sales", "spam_score": 0.0, "site_type": "news", "published": "2016-10-05T21:59:00.000+03:00", "replies_count": 0, "uuid": "69b8fe51aa983d2949256e2c7423ebe08e2afb3c"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/topps-tiles-set-to-deliver-record-sales/story-29781349-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published Topps Tiles set to deliver record sales", "locations": [], "entities": {"persons": [{"name": "matthew williams", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "topps tiles", "sentiment": "negative"}, {"name": "topps", "sentiment": "none"}, {"name": "brexit  topps", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nThe UK's biggest tile retailer is on target to deliver record sales. \nIn a trading update, Enderby-based Topps Tiles said revenues for the year to October 1 were expected to come in around £215 million, up from just over £212 million last year, which included an extra week. \nThe company said its strategy of \"out-specialising the specialists\" continued to resonate with customers and drive sales. \nThe company expects like-for-like sales, which ignore income from newly opened stores, to increase by around 4.2 per cent this year, down from a rise of 5.4 per cent in 2015. \nTopps said its previously announced decision to stop selling low-margin wood flooring reduced like-for-like sales in the four quarter by around 1.5 per cent, though it expects the impact to be reduced as sales from its new range of larger format tiles build. \nMatthew Williams, chief executive of Topps, said: \"I am pleased to report on a successful year for Topps, where we grew sales to a new record, through our proven strategy of out specialising the specialists. \n\"Whilst market conditions weakened over the final quarter as a result of reduced levels of consumer confidence we remain confident in our ability to outperform the market and deliver our goal of further profitable sales growth.\" \nRead more: Topps Tiles chief executive feeling calm post Brexit \nTopps said its trade loyalty scheme continued to grow with more than 40,000 traders now regularly participating. \nIt added; \"We have now launched our new digital loyalty scheme which will increase opportunities to capitalise further on the \"do it for me trend\" in the UK tile market.\" \nIt is also adding new ranges to lure customers. \n\"As a result of in-store space freed up from the exit of the wood flooring category we are introducing new and exclusive ranges of tiles, such as our new XL range, which will meet the growing demand for even larger tiles and also allow us to improve overall returns. \n\"In total, more than 50 new ranges have been launched this year with sales from recently launched lines accounting for 12.8 per cent of total sales in the period,\" the company said. \nAs for convenience, Topps said it opened five new stores in the final quarter. It is currently trading from 351 stores, including 15 boutique stores. \nShares in Topps Tiles fell 7.5 per cent to 103p this afternoon, down from 149p on June 23, the day of the EU referendum.", "external_links": [], "published": "2016-10-05T21:59:00.000+03:00", "crawled": "2016-10-05T18:06:37.179+03:00", "highlightTitle": ""}