{"organizations": [], "uuid": "86bcca7369c40174c3ac4de287cb6cf9c963656c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.liverpoolecho.co.uk/incoming/article11969605.ece/ALTERNATES/s1200/JS100725965.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-revealed-divided-society-11974373", "country": "GB", "domain_rank": 21960, "title": "Brexit vote revealed divided society, warns Chancellor Philip Hammond", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit vote revealed divided society, warns Chancellor Philip Hammond", "spam_score": 0.0, "site_type": "news", "published": "2016-10-04T04:00:00.000+03:00", "replies_count": 0, "uuid": "86bcca7369c40174c3ac4de287cb6cf9c963656c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-revealed-divided-society-11974373", "ord_in_thread": 0, "title": "Brexit vote revealed divided society, warns Chancellor Philip Hammond", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "negative"}, {"name": "philip hammond brexit", "sentiment": "negative"}, {"name": "david cameron", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east vital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit vote revealed divided society, warns Chancellor Philip Hammond 21:00, 3 Oct 2016 Chancellor Philip Hammond says the EU referendum revealed unfairness between regions and between generations Share Get daily news by email Chancellor of the Exchequer, Philip Hammond \nThe European Union referendum revealed that “too many people feel left behind”, Chancellor Philip Hammond has claimed. \nHe warned: “A dangerous divide is opening up between those who believe they have a stake in the success of our economy and those who do not.” \nIn his speech to the Conservative conference in Birmingham, he committed the Tories to ensuring wealth is shared fairly across the UK - and between generations. \nMr Hammond also paid tribute to former Chancellor George Osborne , saying his decisions after the banking crisis had “pulled us back from the precipice”. \nBut his comments also suggest that the previous government, led by David Cameron and Mr Osborne, did not do enough to create a fairer society. \nHe said: “One of the key messages of the referendum campaign was that large parts of our country feel left behind. \n“They see the country getting richer, but don’t feel part of that success. \n“A dangerous divide is opening up between those who believe they have a stake in the success of our economy and those who do not. \n“It is one of the central missions of this government to tackle that divide, to see the benefits of economic growth shared more evenly across the regions, and across the generations. \n“A key part of this agenda is harnessing the economic power of our cities.” Britain's Chancellor of the Exchequer Philip Hammond \nThe Government’s Northern Powerhouse project would help reduce inequality between regions - and would continue, he said. \n“The Northern Powerhouse project takes a visionary approach, linking the great cities of the North into a coherent economic entity, an interconnected region that raises productivity and delivers growth by making it easier and cheaper for firms and individuals to move goods, people, and ideas. \n“And I pledge today, that the Treasury, under my leadership, will continue to drive the Northern Powerhouse project, working in partnership with local leaders to see it deliver its potential for people in the North.” \nBut he said the Government wanted to ensure every part of the country benefited in a similar way. \n“Our ambition isn’t limited to the Northern Powerhouse. \n“We want to create the conditions for success in the North, the South, and everywhere in between. Read More 'All star' Brexit committee for the North East vital says influential think tank \nMr Hammond set out policies designed to shore up Britain’s economy during a period of “turbulence” which he has forecast as a result of Brexit. \nHe announced £220 million of new funding for the tech sector to support efforts to transform biomedical and computer innovations into marketable products. \nMr Hammond warned that the UK economy faces a “rollercoaster” ride over the coming two years as the UK negotiates a new relationship with its EU partners. \nBut he said he was ready to take “whatever steps are necessary to protect this economy from turbulence”. \nAnd he hinted that this could include tax cuts to stimulate economic activity, telling delegates that “fiscal policy may also have a role to play” alongside interest rate reductions to boost confidence.” More on the EU Referendum", "external_links": [], "published": "2016-10-04T04:00:00.000+03:00", "crawled": "2016-10-04T00:04:30.446+03:00", "highlightTitle": ""}