{"organizations": [], "uuid": "206f87587522b1279603c3f4b7328225f703f062", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12060553.ece/ALTERNATES/s1200/JS52094239.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/government-must-speed-up-plans-12059815", "country": "GB", "domain_rank": 21960, "title": "Government must speed up plans for new industrial strategy, report demands", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Government must speed up plans for new industrial strategy, report demands", "spam_score": 0.0, "site_type": "news", "published": "2016-10-24T07:01:00.000+03:00", "replies_count": 0, "uuid": "206f87587522b1279603c3f4b7328225f703f062"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/government-must-speed-up-plans-12059815", "ord_in_thread": 0, "title": "Government must speed up plans for new industrial strategy, report demands", "locations": [], "entities": {"persons": [{"name": "andrew morton", "sentiment": "none"}, {"name": "liz mayes", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "natwest", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "natwest", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Government must speed up plans for new industrial strategy, report demands 00:01, 24 Oct 2016 Complacency is ‘not an option’ warns the report out by Natwest and EEF, the manufacturers' organisation Share Get   Liz Mayes, new boss of the EEF \nA new report has called on the Government to speed up plans to launch a consistent and coherent long-term industrial strategy, to ensure that manufacturers’ growth ambitions are fully supported across the pre and post-Brexit divide. \nThe report by EEF, the manufacturers’ organisation, and NatWest – Manufacturing Ambitions: an industrial strategy for a stronger economy – says swift implementation is vital if growth ambitions are not to be allowed to fall by the wayside, particularly while the UK steers its tricky way towards Brexit. \nThe industry’s call is backed up by a new poll, conducted by 3GEM on behalf of EEF, showing 90% of UK adults agree that the UK needs a comprehensive, long-term industrial strategy and 86% want the Government to promote a stronger manufacturing base in Britain. \nThe report welcomes the fact that a UK-wide industrial strategy is back on the Government’s table and says it must clearly set out the Government’s goals for growth, backed by policies which deliver a more skilled workforce, more resilient infrastructure, a lower cost of doing business and better support for growing businesses. \nLiz Mayes, North East Region Director at EEF, said: “We need to get this right and we need to get this in place now so that manufacturers’ growth ambitions are supported across the pre and post-Brexit divide. \n“It is not enough to talk about an industrial strategy – it is time for the Government to draw a line under the stop-go efforts of the past and to demonstrate its commitment to industry by putting some much-needed flesh on the bones. \n“Manufacturers are not just talking about future growth – they have firm plans in place to make it happen. Their ambition and drive will help get the sector and our economy on the road to stronger, better-balanced growth, but this must be matched by Government. \n“If we are to stay the distance and realise the full benefits for the UK then complacency is not an option. Read More Bellway issues Brexit warning despite posting record revenues \n“A consistent long-term industrial strategy can help us make more of what we have and develop the growth drivers of the future. We must strive for better productivity, increased trade and more ambitious investment in new technologies. Government can underpin this by supporting higher skills, investing in infrastructure, lowering the cost of doing business and providing world class support for growing businesses.” \nThe study shows that 76% of manufacturers are going for growth, while 71% have a three to five year business plan in place to back up their ambitions. \nThe sector already has a strong track record on productivity and, promisingly, there is every indication that this is set to continue, with almost two thirds of firms (63%) focussed on driving up productivity, while margins (71%) and sales (64%) are also key targets in manufacturers’ growth plans. Read More Senior PwC boss outlines firm's mission to tackle the gender gap in accountancy \nInnovation and the introduction of new business models are coming to the fore as companies pursue growth. \nOver nine in ten are either already increasing innovation efforts (63%) or plan to do so within the timeframe of their current business plan (29%). \nSupply chain collaboration is, however, seen as even more critical to growth, with over half of manufacturers (52%) already enhancing cooperation in areas such as production, design and development and a further quarter (26%) planning to do so. \nAndrew Morton, relationship director, corporate and commercial banking, North East, NatWest, said: “We have some amazing manufacturing businesses in this country. \n“The industry is a significant part of the UK economy and it is vital that businesses are given the right support in order to compete globally and succeed. \n“As this report clearly indicates, a long term industrial strategy will help UK manufacturers to compete and succeed in the future. \n“At NatWest we are already well down the line with building a series of solutions and support systems to aid the potential and aspirations of the sector. With continuous engagement at its core, we hope to provide progressive mentorship that can plug manufacturers into the advanced technologies, the most up-to-date thinking and R&D, and the best new business models and practices.”", "external_links": [], "published": "2016-10-24T07:01:00.000+03:00", "crawled": "2016-10-24T03:05:38.253+03:00", "highlightTitle": ""}