{"organizations": [], "uuid": "9fc9884b5d2b6dcd0a970531cd55d67b55e7102a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.liverpoolecho.co.uk/incoming/article12017244.ece/ALTERNATES/s1200/JS102101417.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/sterling-crisis-brexit-ruining-dream-12030059", "country": "GB", "domain_rank": 21960, "title": "The Sterling crisis and why Brexit is ruining my dream holiday", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The Sterling crisis and why Brexit is ruining my dream holiday", "spam_score": 0.0, "site_type": "news", "published": "2016-10-16T01:00:00.000+03:00", "replies_count": 0, "uuid": "9fc9884b5d2b6dcd0a970531cd55d67b55e7102a"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/news-opinion/sterling-crisis-brexit-ruining-dream-12030059", "ord_in_thread": 0, "title": "The Sterling crisis and why Brexit is ruining my dream holiday", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "steven seagal", "sentiment": "none"}, {"name": "mike kelly", "sentiment": "none"}], "locations": [{"name": "new york new york", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new york city  when ua", "sentiment": "none"}, {"name": "lower manhattan", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "united airlines", "sentiment": "none"}, {"name": "world trade center", "sentiment": "none"}, {"name": "sunday sun", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Sterling crisis and why Brexit is ruining my dream holiday 18:00, 15 Oct 2016 'New York New York, so good I'm paying for my trip there twice thanks to Brexit', so says the Sunday Sun's Mike Kelly Share Get daily news by email A selection of one pound coins and bank notes \nBrexit and the fall out from it is ruining my dream holiday. \nWhile leaving the European Union was supposed to let us claim back our country, it’s left a fair few of us wondering how we can claim back our cash. \nSterling - the official currency - is currently getting a right old kicking on the money markets after talk of a ‘hard Brexit ’, which sounds like the title of a Steven Seagal movie. \nAnd, like a Steven Seagal movie, the plunging pound and its affect on tourists hoping to travel abroad like me is no laughing matter. Read More Marmite and ice cream - how Brexit is already changing our lives \nTo cut a long story a bit shorter, for years I have dreamed about going to New York yet things, complicated and personal, have got in the way. \nWhen United Airlines started flying direct to New York from Newcastle a couple of years back, I saw it as a sign that at last I would be going. I started saving up as well as beginning the long, arduous task of persuading my partner to come with me (she prefers Somerset!). 2016 Getty Images An aerial view One World Trade Center in Lower Manhattan in New York City \nWhen UA announced in the summer direct flights from Newcastle to New York were coming to an end, I saw it as another sign - that my dream was not to be. With a heavy sigh I got out the travel guide to Somerset (apparently it’s really nice, so no bitter ‘why do birds fly upside down in Somerset ...’jokes from me) then someone suggested flying with Jet2.com. \nI am embarrassed to admit that I did not know the budget plane company flies direct to New York from Newcastle in certain parts of the year. \nI went on their site four weeks ago and found out they were flying there this month and tickets were available. I rang my partner and got a speedy OK from her, probably just to stop me weeping down the phone, and before she could think better of it I booked the tickets and in an unprecedented display of organisation by me, booked a hotel room too. Read More How many Euros do I get for the pound? Holidaymakers warned as pound slumps \nEasy, I thought. However it being me, there was a sting in the tail and sure enough I made two big mistakes which are getting bigger by the day. \nFirst I opted to pay for the hotel room when I arrive in New York. And I put off buying dollars until nearer the date too. By my estimate this has cost me over £100 so far. \nNow I am wondering whether to stick or twist, buy now or hold tight and pray and keep everything crossed that there will be a sudden upturn in sterling’s fortunes soon. \nAs such, for perhaps the first time in my life, I am acting in unison with a Tory government. More on the EU Referendum", "external_links": [], "published": "2016-10-16T01:00:00.000+03:00", "crawled": "2016-10-15T20:06:26.341+03:00", "highlightTitle": ""}