{"organizations": [], "uuid": "f6f21f75967e9b3498009653ce5b868f8a04a636", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article7158499.ece/ALTERNATES/s1200/Jonathan-Arnott.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mep-jonathan-arnott-12068113", "country": "GB", "domain_rank": 21960, "title": "North East MEP Jonathan Arnott backs Paul Nuttall's bid to become UKIP leader", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East MEP Jonathan Arnott backs Paul Nuttall's bid to become UKIP leader", "spam_score": 0.0, "site_type": "news", "published": "2016-10-24T14:57:00.000+03:00", "replies_count": 0, "uuid": "f6f21f75967e9b3498009653ce5b868f8a04a636"}, "author": "Michael Muncaster", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mep-jonathan-arnott-12068113", "ord_in_thread": 0, "title": "North East MEP Jonathan Arnott backs Paul Nuttall's bid to become UKIP leader", "locations": [], "entities": {"persons": [{"name": "paul nuttall", "sentiment": "negative"}, {"name": "jonathan arnott", "sentiment": "negative"}, {"name": "james", "sentiment": "none"}, {"name": "brendan chilton", "sentiment": "none"}, {"name": "diane james", "sentiment": "none"}, {"name": "anne evans", "sentiment": "none"}, {"name": "anna gowthorpe/pa wire paul nuttall", "sentiment": "none"}, {"name": "steven woolfe", "sentiment": "none"}, {"name": "ms evans", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}, {"name": "evans", "sentiment": "none"}, {"name": "farage", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}, {"name": "mike hookem", "sentiment": "none"}, {"name": "suzanne evans", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "labour leave", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East MEP Jonathan Arnott backs Paul Nuttall's bid to become UKIP leader 07:57, 24 Oct 2016 Suzanne Evans and Paul Nuttall have announced they will run for the leadership of UKIP, with both promising to unite the party Share Get daily news by email Jonathan Arnott \nNorth East MEP Jonathan Arnott has backed Paul Nuttall to become the next leader of the UKIP party. \nSuzanne Evans and Mr Nuttall have announced they will run for the party’s top job, with both promising to unite its members. \nMs Evans said she would make the party less “toxic” and aim to occupy the “common sense centre” ground. \nWhile Mr Nuttall, who like Ms Evans is an ex-party chairman, said he was the man to “bring the factions together”. \nMr Arnott, who pulled out of the party’s previous leadership race, believes Mr Nuttall can help UKIP challenge the Labour Party, especially in the North. \nHe said: “Labour’s Brendan Chilton, general secretary of Labour Leave, said, ‘If Paul Nuttall wins the UKIP leadership, my party Labour, will be fighting for its life in the heartlands’. \n“He is undoubtedly correct and I feel very heartened for the future of UKIP.” Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nThe party has been in turmoil since the EU referendum in June, when the UK voted to leave. \nNigel Farage stood down as leader at the start of July saying he had achieved his political ambition. \nHis successor Diane James resigned earlier this month after only 18 days in the job - leading to Mr Farage’s return as interim leader. \nAnd last week Steven Woolfe, who had been one of the front-runners to replace Ms James, quit the party after an altercation with fellow MEP Mike Hookem. Read More UKIP must reform or die, warns North East leadership candidate Jonathan Arnott \nMr Nuttall said: “Having spent six years as deputy leader and previously been chairman, I believe I am best suited to take the helm of the party. \n“I stand first and foremost as a unifying candidate demanding an end to the infighting and squabbling which performs just one purpose, that of delighting our rivals. \n“I believe UKIP can simply be much bigger and better than this but we have to work together as a united team to do so. \n“I promise from day one under my leadership there is a clean slate for UKIP MEPs, domestic politicians and members. We will pull together to fight forward not backwards.” Anna Gowthorpe/PA Wire Paul Nuttall \nEarlier this month Mr Nuttall said UKIP could move into a vacuum created by Labour splits, insisting his party still has a future following the Brexit vote. \nHe added: “No matter who tries to falsely take the credit, few can argue that the historic June 23 vote to leave the EU would simply never have happened without us. \n“Although more than 17 million British citizens voted to leave the EU, only one in four of them voted for UKIP at last year’s general election. \n“That is precisely where our opportunity lies. I am certain now after achieving the Brexit decision, it is time to seize the day. \n“Great Britain needs a strong UKIP more than ever to hold the Government’s feet to the fire in the Brexit negotiations and to fill the political gap vacated by what’s left of Labour.”", "external_links": [], "published": "2016-10-24T14:57:00.000+03:00", "crawled": "2016-10-24T10:22:24.652+03:00", "highlightTitle": ""}