{"organizations": [], "uuid": "341c34ba000cdaeac2a740cf480eec273aa6b5c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12061259.ece/ALTERNATES/s1200/JS102917689.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/wear-inns-pub-operators-toast-12061207", "country": "GB", "domain_rank": 21960, "title": "Wear Inns pub operators toast successful year of strong food and drink sales", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Wear Inns pub operators toast successful year of strong food and drink sales", "spam_score": 0.0, "site_type": "news", "published": "2016-10-23T23:00:00.000+03:00", "replies_count": 0, "uuid": "341c34ba000cdaeac2a740cf480eec273aa6b5c6"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/wear-inns-pub-operators-toast-12061207", "ord_in_thread": 0, "title": "Wear Inns pub operators toast successful year of strong food and drink sales", "locations": [], "entities": {"persons": [{"name": "john weir", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "simon duckworth", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "new inn", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}], "organizations": [{"name": "yorkshire", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wear inns", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wear Inns pub operators toast successful year of strong food and drink sales 16:00, 23 Oct 2016 The North East and Yorkshire pub operator said the Brexit vote has so far not affected customers' spending habits Share Get business news by email The Millstone pub in Gosforth \nDirectors at leading leisure firm Wear Inns have toasted a successful year boosted by strong sales of both food and drink. \nThe North East and Yorkshire pub operator, which runs more than 20 pubs, saw turnover reach £13.6m in the year ended March 31 2016, up from £13.2m, with EBITDA rising by 5.8% to £2.308m. Gross profit also rose, by 4.27% to £5.183m. \nIn a report accompanying the accounts, directors said they were pleased with the overall performance in the year and looked forward to further improvements next year. \nIn a strategic report alongside the accounts, directors said: “The company continued to trade well through its 26 pubs during the financial year, achieving an overall turnover increase of 3.22% due to excellent performances in both wet and food sales with the level of like for like sales improvements increasing as the year progressed. \n“Cost of sales increased by only 2.59% due to continuing tight control of purchase costs and effective use of staff, despite increases in hourly pay rates.” \nThe firm said it has yet to see any impact from the vote to exit the EU. \n“Improvements in both pub performance and the perceived outlook referred to in last year’s report continued through the year and beyond March 31 2016 into the current year,” it said. \n“The potential effects of Brexit cannot yet be assessed with any certainty, but we have not yet noticed any adverse impact on consumer expenditure in our pubs, nor on cost prices of products due to the fixed costs in the majority of our supply contracts, with run through to 2018.” \nJohn Weir, 67, one of the firm’s founders, passed away at home in August following a heart attack, and the directors used the annual accounts to pay tribute to him. \nA note within the accounts said: “The remaining directors of the company wish to pay tribute to him for his immense contribution to the development of the company since its inception and for his many outstanding personal qualities. He will be greatly missed.” \nWear Inns’ interim chief executive Simon Duckworth added that the firm is continuing on the acquisition trail to add to its portfolio. \n“We are pleased with the performance of the company in the year to March 2016. \n“We have continued to see an improvement in profitability this financial year despite challenging times, both with the economic uncertainty and the tragic death of John Weir in August. \n“John was one of our founding directors and was instrumental in the growth of the business over the years. He is sadly missed. \n“We have a great team of local, entrepreneurial managers and staff who remain focused on delivering the best pub experience. The positive feedback we have received from both regular and new customers is being translated into sales putting us on a strong footing for further growth. \n“We sold the New Inn, Durham this financial year and bought the Whistlestop in Leeds. \n“We will continue to evaluate our estate and look to acquire more pubs if the price and area is right.”", "external_links": [], "published": "2016-10-23T23:00:00.000+03:00", "crawled": "2016-10-23T18:52:47.933+03:00", "highlightTitle": ""}