{"organizations": [], "uuid": "4471da508b696be2187f90bb9554e2d1a47415c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29784464/15600746.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/8203-john-lydon-on-brexit-donald-trump-and-why-leicester-people-are-my-kind-of-people/story-29784464-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "gemmapeplow published ​John Lydon on Brexit, Donald Trump and why Leicester people are...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "gemmapeplow published ​John Lydon on Brexit, Donald Trump and why Leicester people are...", "spam_score": 0.0, "site_type": "news", "published": "2016-10-08T00:30:00.000+03:00", "replies_count": 0, "uuid": "4471da508b696be2187f90bb9554e2d1a47415c1"}, "author": "gemmapeplow", "url": "http://www.leicestermercury.co.uk/8203-john-lydon-on-brexit-donald-trump-and-why-leicester-people-are-my-kind-of-people/story-29784464-detail/story.html", "ord_in_thread": 0, "title": "gemmapeplow published ​John Lydon on Brexit, Donald Trump and why Leicester people are...", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "john lydon", "sentiment": "negative"}, {"name": "clinton", "sentiment": "none"}, {"name": "mark morriss", "sentiment": "none"}, {"name": "scott firth", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "bruce smith", "sentiment": "none"}, {"name": "nora", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "lu edmonds", "sentiment": "none"}, {"name": "johnny rotten", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "la", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "leicester", "sentiment": "negative"}, {"name": "public image ltd", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "​John Lydon on Brexit, Donald Trump and why Leicester people are 'my kind of people' By gemmapeplow | Posted: October 07, 2016 0 COMMENTS SHARES The PiL line-up, from left: Lu Edmonds, John Lydon, Scott Firth, Bruce Smith. ​John Lydon on Brexit, Donald Trump and why Leicester people are 'my kind of... X \nCopy link to paste in your message / Comments (0) \nJohn Lydon is not the easiest man to interview. Not because he's difficult, or hates the publicity wheel; quite the opposite. He's a social creature, he says, a man who \"comes from the pubs,\" and any opportunity to socialise, to talk, is \"fine by me\". \nBut his initial answers are brief, followed by pauses milliseconds away from the edge of awkwardness. Just as you've started to move on to the next, he'll continue the previous with a stream of consciousness, as if his mouth is struggling to keep up with his hyperactive brain. \nWhich is, really, no bad thing: an interviewee who likes to talk is much better than one who doesn't. And there are a fair few of those. \n\"Hmmm, I wonder why they feel that way?\" is his response. \"I'm not shy about revealing my innermost secrets — although I probably won't — but to have a fear of talking to the press is foolish. When I first started, the press were all out to kill me, but that was good for me, it taught me that I had a justifiable point in life; expressing my point to the best of my ability, and if someone doesn't like it then go away.\" \nJohn Lydon certainly gives a good interview, as long as you can keep up. \"Alive!\" is his response when I ask how he is, before he acknowledges the fact I'm calling from Leicester: \"You won the league, you might as well win an interview with me, ha ha.\" \nLeicester people are \"my kind of people,\" he says. \"I've played Leicester many a time, I know it very well. I'm pleased I'm playing there again. They're good people: they come, they appreciate and they're well-mannered.\" \nJohn is at home when I call; home being sunny Los Angeles, California, where he has lived for \"decades\". It's about as far away from Johnny Rotten and Sex Pistols and anarchy as you can get, but that's how he likes it nowadays. \n\"It's very quiet. I don't really have much of a social life in the US and I want it to be that way. It's just Nora (his wife) and me, basically, and one or two friends. England, that's different. It's the place I grew up in; you go straight back into all the things you shouldn't do.\" \nWhich are? \n\"Everything.\" He laughs. \"You name it.\" \nRead more: 'I've NEVER had a bad time in Leicester': Mark Morriss on The Bluetones' 'charmed ride' & going solo \nHe has many friends in England, so this is where he tends to do his \"hanging out and socialising,\" when he's on tour. \"America is the quiet life. And the weather here… we may as well not call it weather because it's basically the same all year round. It's exotic for me to live on a beach. I come from the council flats.\" \nJohn will be back in the UK next month for the latest round of Public Image Ltd (PiL) shows. Since returning to play live for the first time in 17 years in 2009, the band have enjoyed a steady stream of success and sold-out gigs, most recently touring across the UK, Europe, the US and Latin America. \nHe still loves it, he says, the \"rigid regime\" of touring, despite celebrating his 60th earlier this year. \n\"I love the hard schedules, all of that. What I don't like is nerves. It's a big thing, whether it's 20 people or 20 million (in the crowd), it's a big thing to put your head on the chopping block. Over time I've learned to cope.\" \nThis is in no small part down to being in an \"excellent, damn fine band,\" he says. \"I've worked with bitter enemies on stage before. You learn how to overcome.\" \nJohn is comfortable with PiL in a way he never was with the Sex Pistols, he says, and he's immensely proud of their body of work. They released 10th album What The World Needs Now independently last year and are about to reissue Metal Box (1979) and Album (1986) as deluxe box sets. \n\"I'm very, very proud of my body of work and that's just a small tip of it,\" he says. \"Over the years I've certainly made music that's made a difference to many people. It's as valid now as it was then. An awful lot has been copied from me.\" \nJohn won't name names, but says there is \"generally lots of rap that uses our backbeats\". \nHe continues: \"That's okay but it would be nice if they said thanks. It's impossible to hunt it all down — it would have to be a full-time occupation — but there it goes. \n\"When I released these records, they weren't exactly over-praised at the time. Now those things, the kind of music has become the norm. It's like, HELLO! Someone pay attention here. And pay attention more to what I doing currently as well. I don't mean to be big-headed, but we always seem to be ahead of the curve.\" \nHe's yet to have his highlights, he says, to experience the defining moments of his 40-plus years in the industry. \n\"I don't feel I've done enough work or worked hard enough to be able to say that. I'm far from worn out. The older I get the more energy I get. Like a fine wine, I'm maturing slowly.\" \nSongwriting and performing is \"occupational therapy\" to John. \n\"You get the chance to share your emotions and opinions on subjects through song. It's like a proper working class, good piece of theatre going on. I like eye contact with the audience and I can see when the songs mean things to them and what they mean. That's a very healthy sharing of minds. Writing songs for me is about communicating.\" \nBefore a show, he sits in his dressing room drinking tea, he says. \"I love me tea. How do I have it? In a cup, usually, ha ha, with non-fat milk. I try to avoid sandwiches because if you eat before you go on you're never going to be able to sing. Afterwards, you eat. Anything with grease afterwards you can't resist. You find yourself going up and down like a balloon.\" \nYou can't imagine John Lydon worrying too much about his diet, although maybe LA is having an influence. He became an official American citizen in 2013 – which means he'll be voting in the upcoming election. Unsurprisingly, he has lots to say on that subject. \n\"Everyone in the world knows that's ridiculous,\" he says of Donald Trump. \"I mean, this will be the first opportunity I get to vote after all these years. Wow! What a choice! I've always said politics is a fiasco and now more so than ever. \n\"You can't ever think a businessman can replace a politician. It's not a viable option. The whole concept of business is selfishness and greed, accumulating as much wealth for yourself as you possibly can. It's no way to run a country. A country is not your private personal company. I think he's oblivious to that. And he's so aggressive; when he can't deal with questions, he immediately resorts to insults.\" \nHe's genuinely worried for the future, he says. \n\"Very much so. I'm old enough to remember the Cuban Missile Crisis. I was very young at the time but I remember it and it terrified me. I'm feeling the same way about him. Anything is better than him… even that lying old hag!\" \nSo John Lydon, American citizen, will be voting Clinton. And if Trump does get into power? \n\"Run for the hills! He's not capable of understanding the system… I want my world run by level-headed people, it's as simple as that. I don't care what affairs they're having or if they tell a few fibs, as long as they know what they're doing.\" \nAnd then of course there's Brexit and everything that followed. John has followed it all with a mixture of despair and amusement. \n\"The 'Great' in Britain is certainly being tested, isn't it? Brexit, yay or nay, and all the propagators seem to have run for the hills. And we're left with May … It's always been in my blood to never trust a Tory. Still firmly rooted.\" \nHe probably would have voted out he says, describing the EU as \"nothing more than a tax break for corporations,\" but says he's not sure it was the right time to hold the vote. \n\"There was no information, it was deeply puzzling. The left let everyone down. I guess the most surprised man in Britain was Boris Johnson, who was shocked anyone listened to him. He's a buffoon, a hilarious buffoon.\" \nOn that note, it's time to say goodbye. John laughs. \"Cheers for that. You'll never get all that in a small paragraph, but good luck anyway. Peace.\" \nSee PiL at the O2 Academy on Saturday, November 19 . Metal Box and Album will be released as 4 CD and 4 vinyl LP deluxe box sets, including rare and previously unreleased material along with a live disc, on October 28.", "external_links": [], "published": "2016-10-08T00:30:00.000+03:00", "crawled": "2016-10-07T20:28:56.831+03:00", "highlightTitle": ""}