{"organizations": [], "uuid": "8736282f3b381b2bbb2b531f1a5f2378ad931f37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12066124.ece/ALTERNATES/s1200/Rate-of-the-pound-sterling-shallow-DOF.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-weakened-pound-good-news-12066082", "country": "GB", "domain_rank": 21960, "title": "Could the weakened pound be good news for North East tourism?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Could the weakened pound be good news for North East tourism?", "spam_score": 0.0, "site_type": "news", "published": "2016-10-23T20:00:00.000+03:00", "replies_count": 0, "uuid": "8736282f3b381b2bbb2b531f1a5f2378ad931f37"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-weakened-pound-good-news-12066082", "ord_in_thread": 0, "title": "Could the weakened pound be good news for North East tourism?", "locations": [], "entities": {"persons": [{"name": "guy opper", "sentiment": "negative"}, {"name": "opperman", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland coast", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "hexham", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "confederation of british industry", "sentiment": "none"}, {"name": "unesco world heritage site hadrian", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could the weakened pound be good news for North East tourism? 13:00, 23 Oct 2016 Hexham MP Guy Opperman says Britain will become a more attractive destination for tourists looking to cash in Share Get daily news by email One pound coin on fluctuating graph \nA weakened pound will boost tourism as Britain will be a more attractive destination for holidaymakers, an MP has said. \nWith sterling dropping to a six-year low against the Euro last week and analysts anticipating further slumps due to uncertainty over Britain’s plan to leave the European Union, the Hexham MP Guy Opperman outlined the potential positives of a weakened pound. \nMr Opperman, a Conservative, argued rising import costs will encourage Britain to “balance” its economy by producing more goods. \nThe former barrister said a sterling slump could help British exports, as they will be cheaper for foreign buyers. \nAnd he believes a holiday in the UK will be more affordable for visitors from abroad, while Brits may decide against trips to the continent and opt for a “staycation” instead. Read More \nIn his blog, the 51-year-old wrote: “If you run a homegrown bed and breakfast or a hotel then the devaluation of the pound as compared to the dollar or the Euro is wonderful news. \n“Your product - the great British holiday - is now a lot more attractive to overseas visitors. \n“But if you are going on a European or American mini-break then your pound buys less dollars or Euros. Your holiday abroad got more expensive. “Which means many families, I predict, will choose to staycation in the UK next year. Which boosts our UK tourism, hotels, pubs and bed and breakfasts.” MP Guy Opperman \nMr Opperman - whose Northumberland constituency includes UNESCO World Heritage Site Hadrian’s Wall - thinks Britain’s tourism industry is in a healthy state. \nHe said: “We’ve had a very good year for tourism. \n“The evidence - anecdotal evidence - tells me there is tremendous confidence in the British tourism and staycation sector.” \nAsked if a weakened pound restricts opportunities for British tourists to go abroad, Mr Opperman replied: “It will encourage people to have holidays in this country. \n“There’s a 10% increase in the cost of a holiday [abroad] as compared to what it was. If you spent £500 on a holiday before, it’s now £550. That’s the difference if you’re choosing to go abroad.” \nLast week, the MP attended an event organised by the Confederation of British Industry where business leaders discussed the North East’s post-Brexit economy. \nHe said the meeting was “very positive” and highlighted three statistics. \nSince July, the month after Britain voted to leave the European Union, gross domestic product (GDP) rose by 0.7%, the service sector has seen 0.4% growth, and the retail sales index went up by 10 points. \nHe added: “Yes there are issues in the months ahead, but at the same stage, it’s very heartening to hear that there is confidence nationally and locally.” Explore the Northumberland Coast", "external_links": [], "published": "2016-10-23T20:00:00.000+03:00", "crawled": "2016-10-23T15:28:57.496+03:00", "highlightTitle": ""}