{"organizations": [], "uuid": "687bc9d51e530b7bc5e9c2bc6274fcfeec3dc5b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12058002.ece/ALTERNATES/s1200/JS102821654.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/senior-pwc-boss-outlines-firms-12057817", "country": "GB", "domain_rank": 21960, "title": "Senior PwC boss outlines firm's mission to tackle the gender gap in accountancy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Senior PwC boss outlines firm's mission to tackle the gender gap in accountancy", "spam_score": 0.0, "site_type": "news", "published": "2016-10-21T17:29:00.000+03:00", "replies_count": 0, "uuid": "687bc9d51e530b7bc5e9c2bc6274fcfeec3dc5b9"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/senior-pwc-boss-outlines-firms-12057817", "ord_in_thread": 0, "title": "Senior PwC boss outlines firm's mission to tackle the gender gap in accountancy", "locations": [], "entities": {"persons": [{"name": "ms hyde", "sentiment": "none"}, {"name": "graeme whitfield stephanie hyde", "sentiment": "none"}, {"name": "stephanie hyde", "sentiment": "none"}, {"name": "hyde", "sentiment": "none"}, {"name": "dewhirst", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "pwc", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Senior PwC boss outlines firm's mission to tackle the gender gap in accountancy 10:29, 21 Oct 2016 10:29, 21 Oct 2016 By Graeme Whitfield Stephanie Hyde, head of regions as PwC, detailed the firm's determination to increase diversity in the profession during a visit to Newcastle Share Get business news by email Stephanie Hyde, PwC \nThe regional head of one of the Big Four accountancy firms has spoken of her company’s desire to do more to tackle the gender gap in its industry. \nStephanie Hyde, head of regions for PwC, was speaking on a visit to the firm’s Newcastle office , one of its largest outside London with more than 300 employees. \nPwC is among a number of the big accountancy groups to take the lead in tackling the diversity of its staff with a range of programmes from recruitment up to partner level that aim to reverse the traditional image of accountancy being a male, white and middle class profession. \nThe company has changed its recruitment procedures to ensure a more diverse intake and also has targets to increase the number of women getting promoted to director and partner level, as well as running mentoring schemes for talented female employees. \nMs Hyde said: “Professional services have historically been a very male dominated environment and not particularly diverse in any way. \n“Over the years we’ve recognised that to be able to work with our clients successfully and to do the best we can we need a more diverse group of people. That’s about gender and background and a number of other factors. \n“We’ve really focussed on moving people through the grades. We don’t have quotas but we understand our targets and if you can get 40% of your directors as women, that gives you the chance to reach 40% at partner level. Read More Thinking Digital organisers launch event for women in Newcastle \n“We really challenge ourselves to be supportive and look at how our policies and procedures are helping this. We’ve just promoted two women to senior positions who are either on maternity leave or about to go on it. Making sure life events don’t disqualify people from being considered is very important.” \nAlong with the other major accountancy firms, PwC has drastically altered its recruitment policies to achieve a broader intake of staff. Read More Former Dewhirst seamstress is back in textile business in new role \nThe firm does not look at A-level points and places more weight on things like work experience which it believes gives people the skills they need to succeed in accountancy. It has also increased its apprenticeship programme and work with schools to break down barriers to young people considering working for the company. \nMs Hyde, who spends time at all of PwC’s 25 offices outside London, said many companies in the regions had initially been shocked by the EU referendum result but the level of deals being done suggested they were now focussing on their businesses and growing them. \nBut she said there was also a desire for the Government to provide more clarity on how it would negotiate Brexit and what that would mean for the economy.", "external_links": [], "published": "2016-10-21T17:29:00.000+03:00", "crawled": "2016-10-21T12:41:34.386+03:00", "highlightTitle": ""}