{"organizations": [], "uuid": "e669b00f7e206f51f0286e4cac1f48b989583bb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12016270.ece/ALTERNATES/s1200/JS92136611.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/saving-north-east-jobs-more-12016218", "country": "GB", "domain_rank": 21960, "title": "Is saving North East jobs more important than cutting immigration rates?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Is saving North East jobs more important than cutting immigration rates?", "spam_score": 0.0, "site_type": "news", "published": "2016-10-13T01:00:00.000+03:00", "replies_count": 0, "uuid": "e669b00f7e206f51f0286e4cac1f48b989583bb2"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/saving-north-east-jobs-more-12016218", "ord_in_thread": 0, "title": "Is saving North East jobs more important than cutting immigration rates?", "locations": [], "entities": {"persons": [{"name": "jonat", "sentiment": "negative"}, {"name": "liam fox", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dominic grieve", "sentiment": "none"}, {"name": "ken clarke", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "walker sedgefield's labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "continental europe", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "nissan sunderland", "sentiment": "none"}, {"name": "nissan qashqai", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Is saving North East jobs more important than cutting immigration rates? 18:00, 12 Oct 2016 By Jonathan Walker Sedgefield's Labour MP Phil Wilson says tens of thousands of jobs depend on the UK's access to the EU markets   Views inside Hitachi train factory at Newton Aycliffe where new East Coast trains will be built \nPutting a crackdown on EU migration ahead of the economy could threaten thousands of jobs in the North East, an MP has warned. \nSedgefield MP Phil Wilson said ensuring British-made products can be sold across Europe was more important than cutting immigration. \nThe MP also said the Government and other politicians must listen to the concerns of voters and find ways to get immigration numbers down. \nBut he said: “At the end of the day, what actually trumps immigration is economic wellbeing and jobs.” \nHe joined other MPs in the North East who are concerned about the impact Brexit could have on investment in the region, where major employers include Japanese firms Hitachi and Nissan . \nAs long as the UK remains in the EU, goods made in the UK can be sold across the EU. However, if the UK leaves the single market then it’s possible tariffs could be imposed, making British goods more expensive overseas. \nThe Government appears to be heading for what has become known as “hard Brexit”, which probably involves leaving the EU single market and also taking back full control over the UK’s borders, allowing the UK to control immigration from EU countries. The new Nissan Qashqai is produced on the assembly line at the Nissan Sunderland plant \nBy contrast, the option known as “soft Brexit” would involve continuing as full or partial members of the EU single market, but would probably also mean continuing to accept the principle of freedom of movement so that EU citizens have a right to live and work in the UK. \nMr Wilson said: “You’ve got implications for foreign domestic investment, particularly in the North East. The Japanese have pointed that out. \n“I know immigration is a big issue but I don’t think people voted to make themselves poorer. \n“I think we have got to look at the impact on immigration and also on the economy if we leave the single market.” \nHe added: “There are tens of thousands of jobs in the North East which are reliable on future trade existing and future trade with the single market.” \nMr Wilson pointed out that official figures show more than half of migrants to the UK actually come from countries outside the EU. This shows that leaving the EU will not put an end to immigration in any case, he said. Read More Theresa May's cynical mockery of the decent liberal values I treasure is outrageous \nHe criticised senior Conservative politicians who backed the ‘Leave’ campaign, saying: “The Government obviously didn’t have a contingency plan for a leave vote. \n“And secondly, those people that have been promoting us leaving the EU for decades now, and I mean the likes of Liam Fox and David Davis, don’t seem to have a plan.” Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nIn September, the Japanese Government issued a stark warning that businesses in Japan may reduce investment in the UK if trade restrictions are put in place. \nIt said in a letter: “Japanese businesses with their European headquarters in the UK may decide to transfer their head office function to Continental Europe if EU laws cease to be applicable in the UK after its withdrawal.” \nAnd it warned that manufacturers, “especially of automobiles”, have raised concerns that they will be hit by trade tariffs. \nSpeaking in the House of Commons on Wednesday, David Davis, the Secretary of State for Exiting the European Union, insisted the Government would not share its plans for leaving the EU in any detail at this point. \nTory heavyweights Ken Clarke and former attorney general Dominic Grieve suggested MPs should get a vote on the Brexit blueprint. \nPrime Minister Theresa May has announced the UK will trigger article 50 of the Lisbon Treaty, the official mechanism for leaving the EU, by the end of March 2017. \nIt means the UK could be out of the EU by the summer of 2019.", "external_links": [], "published": "2016-10-13T01:00:00.000+03:00", "crawled": "2016-10-12T20:23:37.610+03:00", "highlightTitle": ""}