{"organizations": [], "uuid": "dde5485c0ca648f999ca253217881305728e4e0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12052051.ece/ALTERNATES/s1200/EMPTY-SHOPS-12.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/gateshead-ghosthead-taking-look-demise-12052407", "country": "GB", "domain_rank": 21960, "title": "From Gateshead to 'Ghosthead' - taking a look at the demise of the town's high streets", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "From Gateshead to 'Ghosthead' - taking a look at the demise of the town's high streets", "spam_score": 0.0, "site_type": "news", "published": "2016-10-22T18:00:00.000+03:00", "replies_count": 0, "uuid": "dde5485c0ca648f999ca253217881305728e4e0b"}, "author": "Keiran Southern", "url": "http://www.chroniclelive.co.uk/news/north-east-news/gateshead-ghosthead-taking-look-demise-12052407", "ord_in_thread": 0, "title": "From Gateshead to 'Ghosthead' - taking a look at the demise of the town's high streets", "locations": [], "entities": {"persons": [{"name": "michelle teasdale", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john millard", "sentiment": "none"}, {"name": "andrew marshall", "sentiment": "none"}, {"name": "matthew hopkinson", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "beaconsfield", "sentiment": "none"}, {"name": "burslem", "sentiment": "none"}, {"name": "felling", "sentiment": "none"}, {"name": "trinity square", "sentiment": "none"}, {"name": "old durham road", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "stoke-on-trent", "sentiment": "none"}], "organizations": [{"name": "gateshead council", "sentiment": "none"}, {"name": "gateshead bedding company", "sentiment": "none"}, {"name": "trinity square", "sentiment": "none"}, {"name": "local data company", "sentiment": "none"}, {"name": "ldc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Once a thriving shopping area, parts of Gateshead now resemble a ghost town . \nA quick walk around the streets and you will see signs with letters missing, windows without glass and shutters pulled firmly down. \nNew figures reveal that the town has one of the highest rates of empty shops in the entire country, with nearly one in five standing vacant. \nAccording to the Local Data Company (LDC), for the first half of 2016, 19.5% of stores were empty. \nThat is a rise of 1.3% from a level of 18.2% in 2015. \nThat makes it one of the worst performers among towns in Britain with less than 200 premises. \nBut it’s not just Gateshead town centre that is suffering, with the scene familiar across parts of Felling, Old Durham Road and other high streets. \nMichelle Teasdale owns Gateshead Bedding Company on the high street. \nThe 50-year-old’s family have been on the street for 45 years - but as one business after another disappears, she fears for the future. \nShe said: “I can remember being six or seven walking up and down the high street and you had to walk in the road it was that busy. It was completely different to what it is now. There are gaps all up the street were shops used to be. \n“It’s sad really. There isn’t any hope if you ask me. To watch what has happened is heartbreaking.” John Millard Empty shops in Gateshead \nThe problem is not just reserved for Gateshead. \nThe North East has the highest percentage of long-term vacant units but, perhaps predictably, London is the only region to have lost in numbers of independent shops and the only one to gain in numbers of chain stores over the past half-decade. \nAnd Matthew Hopkinson of the LDC, said Brexit could make things worse. \nHe said: “Growth slackened significantly in the half year leading up to the referendum at the end of June, taking the steam out of the gentle improvement in vacancy that has improved by 2.3% since 2011. \n“Since the end of June we have seen the vacancy rate in leisure outlets inch upwards. Whether this will be just a twitch in the statistics or the beginning of a long term reversal will become clear over the coming months. \n“For example, the 23% net growth in restaurants since 2010 is unlikely to continue. Business, government and the media are all sniffing the air and scanning the horizon for any piece of news that might tell us what happens next. \nHe added: “Increased costs for retailers coupled with fierce competition and oversupply of shops is likely to see increased levels of distress and failure among retailers with survival of the fittest being the order of the day.” \nBut it is not all doom and gloom. Read More You won't believe the same view of the Tyne at Gateshead from four decades ago \nGateshead Council points to the success of Trinity Square - the shopping and leisure centre - and believes that success could be replicated across the borough. \nAndrew Marshall, service director economic and housing growth, said: “Gateshead Council has a long term vision for Gateshead which includes the redevelopment of the town centre. We want to create a vibrant town centre which provides the shops, business accommodation, attractions and homes that people want. \n“Over the last few years the north end of Gateshead town centre has been transformed with the new Trinity Square development. This has brought new shops, restaurants, a cinema and student accommodation into the heart of Gateshead. \n“We have similar high aspirations for the south end of the high street where our long term strategy aims to change this area from retail to housing as part of a new ‘exemplar neighbourhood’, but major regeneration schemes like these take many years to come to fruition. \n“The council has bought properties when the opportunity has arisen so that suitable development sites will be available when the time is right.” \nAcross Britain, Burslem in Stoke-on-Trent has the highest vacancy rate at 33.3%, while Beaconsfield is the top performing town by occupation with no vacant units. Town nostalgia", "external_links": [], "published": "2016-10-22T18:00:00.000+03:00", "crawled": "2016-10-22T13:30:03.411+03:00", "highlightTitle": ""}