{"organizations": [], "uuid": "952f8a42daa69b7e651115eef64d2fce91806379", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29787956/15603656.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/corbyn-appoints-leicester-south-mp-jon-ashworth-as-shadow-health-minister/story-29787956-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Corbyn appoints Leicester South MP Jon Ashworth as shadow health minister | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Corbyn appoints Leicester South MP Jon Ashworth as shadow health minister | Leicester Mercury", "spam_score": 0.696, "site_type": "news", "published": "2016-10-08T00:40:00.000+03:00", "replies_count": 0, "uuid": "952f8a42daa69b7e651115eef64d2fce91806379"}, "author": "", "url": "http://www.leicestermercury.co.uk/corbyn-appoints-leicester-south-mp-jon-ashworth-as-shadow-health-minister/story-29787956-detail/story.html", "ord_in_thread": 0, "title": "Corbyn appoints Leicester South MP Jon Ashworth as shadow health minister | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "jon ashworth", "sentiment": "negative"}, {"name": "corbyn", "sentiment": "negative"}, {"name": "rosie winterton", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "jonathan reynolds", "sentiment": "none"}, {"name": "abbott", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}, {"name": "jo stevens", "sentiment": "none"}, {"name": "shami chakrabarti", "sentiment": "none"}, {"name": "winterton", "sentiment": "none"}, {"name": "ms butler", "sentiment": "none"}, {"name": "ashworth", "sentiment": "none"}, {"name": "tom blenkinsop", "sentiment": "none"}, {"name": "jamie vardy", "sentiment": "none"}, {"name": "dawn butler", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "nia griffith", "sentiment": "none"}, {"name": "dianne abbott", "sentiment": "none"}, {"name": "laobour", "sentiment": "none"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "emily thornberry", "sentiment": "none"}], "locations": [{"name": "leicester south", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "highcross", "sentiment": "none"}], "organizations": [{"name": "crown prosecution service", "sentiment": "none"}, {"name": "plp", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "leicester south", "sentiment": "none"}, {"name": "liberty", "sentiment": "none"}, {"name": "waterstones", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Corbyn appoints Leicester South MP Jon Ashworth as shadow health minister By danjmartin | Posted: October 07, 2016 0 COMMENTS SHARES Corbyn appoints Leicester South MP Jon Ashworth as shadow health minister X \nCopy link to paste in your message / \nLeicester South MP Jon Ashworth has been appointed shadow health secretary in Jeremy Corbyn's reshuffle of his top team. \nMr Ashworth has promoted from his previous role as the Labour leader's shadow cabinet member without portfolio. \nHe takes over the post from Dianne Abbott who has in turn been made shadow Home Secretary. \nFollowing the appointment Mr Ashworth tweeted: \"The NHS was and still is Labour's greatest achievement. \n\"On the brink of crisis under the Tories and going backwards. We'll be campaigning hard.\" \nThe 37-year-old's elevation to a key post will be seen as an olive branch to the moderates Laobour members after criticism that earlier appointments - like Ms Abbott's - strengthened Mr Corbyn's allies on the left. \nRead more: Waterstones at Highcross, Leicester, sells out of Jamie Vardy's From Nowhere: My Story in just hours \nThere was said to be unhappiness among Labour MPs at the promotion of his long-time ally Diane Abbott to shadow home secretary and the sacking of chief whip Rosie Winterton, seen as a key link with the backbenches. \nCritics have expressed concern that with John McDonnell expected to stay in place as shadow chancellor and Emily Thornberry likely to retain the foreign affairs brief, the three most senior positions in the body are all held by staunch-Corbyn supporters - and London MPs. \nFormer whip Tom Blenkinsop accused Mr Corbyn of going back on his promise to unite the party. \nHe tweeted: \"Clear Corbyn wants submission not unity. Ignoring wishes of the PLP and just sacking and appointing regardless.\" \nThe reshuffle saw little-known MPs moved around, including a promotion for Jo Stevens who was handed shadow Welsh secretary and Nia Griffith moved to the shadow defence brief, while Dawn Butler and Jonathan Reynolds were offered ministerial positions. \nMs Butler, shadow minister for diverse communities, denied that Mr Corbyn had failed to appoint the party's more experienced MPs to top jobs because they had opposed him in the leadership election. \n\"They might be obscure but they are competent,\" she said of the new team. \nThe Labour leader is rebuilding his front benches after the mass walkout of shadow cabinet members who opposed him in the aftermath of the Brexit vote in June. \nIn a surprise move, the Labour leader brought in Nick Brown, a long-standing ally of former leader Gordon Brown to replace Ms Winterton as chief whip, who had been attempting to broker an agreement over shadow cabinet elections. \nThe move has reportedly angered many of Mr Corbyn's critics, who saw Ms Winterton's role as a key bridge of communication between moderate backbenchers and the leader's team. \nMr Corbyn has so far been resistant to calls from former shadow cabinet members for the body's membership to be decided by a ballot of MPs. \nBut the Labour leader announced Sir Keir Starmer, the former head of the Crown Prosecution Service who stormed out of his front bench position as immigration minister, has been brought into the shadow cabinet as shadow Brexit secretary. \nIt brings forward a major moderate figure to the top team, in a signal that Mr Corbyn is prepared to allow some room for his critics. \nHowever, a number of anti-Corbyn MPs, such as failed leadership challenger Mr Smith, have insisted they could not serve under him. \nShami Chakrabarti, the former Liberty director who carried out a controversial investigation into anti-Semitism in the Labour Party, has been named the new shadow attorney general. \nIt comes after she was forced to defend herself over her peerage nomination, which was announced just a month after her anti-Semitism inquiry into the Labour Party concluded amid claims from critics that it was too soft. ", "external_links": [], "published": "2016-10-08T00:40:00.000+03:00", "crawled": "2016-10-07T18:58:30.109+03:00", "highlightTitle": ""}