{"organizations": [], "uuid": "4a2e6266cc376fbb7a1abcfd1901774cbe2ebc27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29816221/15624600.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/big-problems-getting-young-people-into-the-food-and-drink-industry/story-29816221-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Houses of Commons food business discussion reveals difficulty in recruiting young people | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Houses of Commons food business discussion reveals difficulty in recruiting young people | Leicester Mercury", "spam_score": 0.508, "site_type": "news", "published": "2016-10-18T18:56:00.000+03:00", "replies_count": 0, "uuid": "4a2e6266cc376fbb7a1abcfd1901774cbe2ebc27"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/big-problems-getting-young-people-into-the-food-and-drink-industry/story-29816221-detail/story.html", "ord_in_thread": 0, "title": "Houses of Commons food business discussion reveals difficulty in recruiting young people | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "leiceste", "sentiment": "negative"}, {"name": "nick pulley", "sentiment": "none"}, {"name": "costa", "sentiment": "none"}, {"name": "tom pegden", "sentiment": "none"}, {"name": "alberto costa", "sentiment": "none"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "kim kettle", "sentiment": "none"}, {"name": "dickinson", "sentiment": "none"}], "locations": [{"name": "everards brewery", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "leicester food park", "sentiment": "none"}, {"name": "langton brewery", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "oakham", "sentiment": "none"}, {"name": "melton", "sentiment": "none"}, {"name": "north west leicestershire", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "leicester mercury houses of commons", "sentiment": "negative"}, {"name": "northfield farm", "sentiment": "none"}, {"name": "llep houses of commons", "sentiment": "none"}, {"name": "leicestershire south", "sentiment": "none"}, {"name": "long clawson dairy", "sentiment": "none"}, {"name": "leicestershire enterprise partnership", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "royal chai", "sentiment": "none"}, {"name": "shelton's coffee", "sentiment": "none"}, {"name": "llep", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "north warwickshire", "sentiment": "none"}, {"name": "cofresh", "sentiment": "none"}, {"name": "marion plant obe", "sentiment": "none"}, {"name": "hinckley college and south leicestershire college", "sentiment": "none"}, {"name": "morris pork pies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Houses of Commons food business discussion reveals difficulty in recruiting young people By Leicester Mercury | Posted: October 18, 2016 By Tom Pegden MPs Alberto Costa and Andrew Bridgen hosted the talks, which were chaired by the LLEP Houses of Commons food business discussion reveals difficulty in recruiting... X \nCopy link to paste in your message / Comments (0) \nSchools and colleges must work closer with food and drinks manufacturers to encourage more young people into the industry. \nThat was the conclusion of a round-table discussion at the Houses of Parliament covering issues facing the sector and promoting the high quality products coming out of Leicester, Leicestershire and Rutland. \nSome business leaders said it was becoming increasingly hard to recruit young people to work on their production lines. \nRead more: House of Commons getting taste of Leicestershire food and drink \nAnd they said things could get even worse if the number of unskilled European immigrants is restricted as a result of Brexit. \nLeicestershire South MP Alberto Costa and North West Leicestershire MP Andrew Bridgen hosted the London session, which was chaired by the Leicester and Leicestershire Enterprise Partnership (LLEP). \nEarlier the same day, the LLEP hosted a showcase of some of our best food and drink producers inside the Palace of Westminster, under the title the Global Flavours of Leicestershire. \nMost of the city and county's MPs showed their support. \nAttendees included management from Asian snack maker Cofresh, Everards Brewery, Long Clawson Dairy, Leicester-based Asian and vegetarian food business Farsan and hard boiled egg business Just Egg. \nAlso present were representatives of Indian tea producer Royal Chai and Columbian coffee company Shelton's Coffee – both based on Leicester Food Park – Langton Brewery, Melt'on Ice Cream, Northfield Farm, near Oakham, Harborough-based Two Birds spirits and Dickinson and Morris Pork Pies. \nMany said an immediate concern was the rising cost of imported raw materials following the devaluation of sterling after the EU referendum. \nAccording to the LLEP, food and drink is the UK's biggest manufacturing sector with an annual turnover of £95.4 billion. \nThe business support body said there were 200 or so companies working in the sector, employing 12,000 people – with the number in Melton, in particular, 10 times higher than the national average. \nLLEP chair Nick Pulley said they had made food and drink a priority area because of its high economic value and local strengths such as: Higher than average employment levels A wide-ranging diversity of food manufacturing including \"seamless cultural infusion and ethnic product mainstreaming\" A \"vast\" range of exporters of locally-made products and an extensive food industry supply chain Advanced technologies, scientific innovation and constant research and product development and adaptation to meet consumer needs A long-standing history of food and drink manufacturing \nThe LLEP said research it had commissioned suggested most businesses in the sector were increasing turnover, while job opportunities were expected to grow. \nBut it found almost 50 per cent of businesses spoken to said they had skills gaps in their workforce and 41 per cent said they had \"significant\" or \"major\" issues in recruiting. \nThose taking part in the round-table session included Kim Kettle, managing director at Long Clawson Dairy, a £59 million turnover Stilton producer with 365 staff. \nHe said: \"At a reasonably senior level it's not too difficult [finding staff] but we are really struggling to get people to do the job at the coal face. \n\"We are constantly advertising and seeing people move. \n\"Twenty per cent of our employees are Polish nationals and people are getting very concerned about their security and a number are moving to continental Europe. \n\"At very senior levels we can find people, but from supervisor team leader down to ordinary operatives we can't find them.\" \nMarion Plant OBE is a LLEP board member and principal and chief executive of North Warwickshire and Hinckley College and South Leicestershire College. \nShe said: \"Brexit is only going to make this problem more urgent and all I can do is work my hardest to help businesses work with education.\" \nAlberto Costa said some farmers had asked him who would pick their potatoes once we left the EU. \nHe said one way could be compelling jobless people to take up unskilled jobs. \nMr Costa said: \"The reality is we will have to get people to do the unskilled work they have not wanted to do.\" \nAndrew Bridgen said businesses needed to get the messages to schoolchildren that they were looking for young talent. \nHe said: \"Part of keeping businesses sustainable is having a sustainable workforce and we are going to invest time and money in making that link with education.\" ", "external_links": [], "published": "2016-10-18T18:56:00.000+03:00", "crawled": "2016-10-18T15:41:40.057+03:00", "highlightTitle": ""}