{"organizations": [], "uuid": "9555a80f7639dcd658552899f7fdbe3713060546", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12035252.ece/ALTERNATES/s1200/HSR_NEC_171016freedom_02.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/activists-mouths-taped-shut-take-12035091", "country": "GB", "domain_rank": 21960, "title": "Activists with mouths taped shut take part in silent Newcastle city centre 'Walk for Freedom'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Activists with mouths taped shut take part in silent Newcastle city centre 'Walk for Freedom'", "spam_score": 0.0, "site_type": "news", "published": "2016-10-17T18:00:00.000+03:00", "replies_count": 0, "uuid": "9555a80f7639dcd658552899f7fdbe3713060546"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/activists-mouths-taped-shut-take-12035091", "ord_in_thread": 0, "title": "Activists with mouths taped shut take part in silent Newcastle city centre 'Walk for Freedom'", "locations": [], "entities": {"persons": [{"name": "mrs may", "sentiment": "none"}, {"name": "rachel jobes", "sentiment": "none"}, {"name": "arunita praharaj", "sentiment": "none"}, {"name": "bruce", "sentiment": "none"}, {"name": "low fell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "neil scott more", "sentiment": "none"}, {"name": "lindsay bruce", "sentiment": "none"}, {"name": "kevin hyland", "sentiment": "none"}, {"name": "neil scott", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "chinatown", "sentiment": "none"}, {"name": "north-east", "sentiment": "none"}, {"name": "grey street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "birtley", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "hillsong newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Activists with mouths taped shut take part in silent Newcastle city centre 'Walk for Freedom' 11:00, 17 Oct 2016 11:01, 17 Oct 2016 By Arunita Praharaj More than 100 campaigners joined forces to make a stand against the scale of human trafficking and slavery   Neil Scott More than 100 people took to the streets of Newcastle this weekend as part of a world-wide 'Walk for Freedom' \nCampaigners took to the streets to make a stand against slavery and human trafficking. \nMore than 100 people joined forces in Newcastle as part of the worldwide ‘Walk for Freedom’ . \nJust days after Prime Minister Theresa May spoke out on the “shocking” numbers associated with human trafficking, a crime she referred to as “modern day slavery”, a group organised by members Hillsong Newcastle led a silent but powerful protest through the city. \nAs part of Saturday’s rally, involving more than 270 locations across the world, the activists partnered with an anti-human trafficking organisation - the A21 Campaign - to raise awareness on the world’s fastest growing and most profitable serious crimes. Neil Scott More than 100 people took to the streets of Newcastle this weekend as part of a world-wide 'Walk for Freedom' \nBeginning at Chinatown, the ‘abolitionists’ moved to the Monument, down Grey Street and along the Quayside. \nOrganiser Rachel Jobes, 37, from Low Fell, Gateshead , said: “We planned this route around known trafficking hot spots in our city, where raids have taken place and victims found. \n“We also wanted to highlight our city’s proud past of leading the way in abolition, but also drawing attention to the fact there are now more slaves in the world than at any time in the past. \n“As many as 46 million people, according to latest statistics from the newly appointed anti-slavery commissioner Kevin Hyland, are currently trapped in slavery, through human trafficking. As a church we couldn’t stand back and not do something about this.” \nWearing all black, some with mouths taped shut in solidarity with those who are voiceless in captivity, the activists walked single file and in silence through the city. Neil Scott More than 100 people took to the streets of Newcastle this weekend as part of a world-wide 'Walk for Freedom' \nThe powerful demonstration highlighted the message that slavery was still rampant across the globe, and in the North-East. \nMum-of-two Lindsay Bruce, a social justice campaigner and writer from Birtley, Gateshead , said: “Just by walking through the city, it was clear that the information we were handing out was unbelievable to some people. \n“‘That doesn’t happen anymore’ and ‘that’s disgusting’ were common replies when we explained the extent of what we are talking about. \n“But it does still exist and it is disgusting. As a part of a rescue here in the UK, a baby was rescued; a baby. \n“In another case, a girl was forced to service up to 150 men in a day. You can’t hear that and not respond.” Read More School children believe 'all immigrants will be sent home' after Brexit anti-racism charity says \nMrs Bruce added: “These issues can be combated. If people want to help, I recommend signing up to regularly financially support institutions such as the A21 and Hope for Justice. Giving up your latte once a week can help organisations investigate and set victims free.” \nSpeaking about the scale of slavery across Britain, PM Mrs May vowed not to ignore the pleas of those in need. Neil Scott More than 100 people took to the streets of Newcastle this weekend as part of a world-wide 'Walk for Freedom' \nShe said: “To the victims of modern slavery: We will not ignore your plight. We will not turn away. We will not shut our eyes and pretend your suffering does not exist. \n“We will work tirelessly, relentlessly pursuing the perpetrators of these appalling crimes so that victims of slavery can go free. And my message to these criminals is simply this: We are coming after you.” \nFor more information and to find out how you can help, visit www.a21.org", "external_links": [], "published": "2016-10-17T18:00:00.000+03:00", "crawled": "2016-10-17T13:25:16.139+03:00", "highlightTitle": ""}