{"organizations": [], "uuid": "3864cc06bd1a7f29bce4fed45749dabacc4c5136", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29798178/15610678.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/company-car-i-do-worry-about-the-economy-but-i-think-it-always-will-be-a-concern/story-29798178-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Company Car: I do worry about the economy but I think it always will be a concern | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Company Car: I do worry about the economy but I think it always will be a concern | Leicester Mercury", "spam_score": 0.379, "site_type": "news", "published": "2016-10-11T17:39:00.000+03:00", "replies_count": 0, "uuid": "3864cc06bd1a7f29bce4fed45749dabacc4c5136"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/company-car-i-do-worry-about-the-economy-but-i-think-it-always-will-be-a-concern/story-29798178-detail/story.html", "ord_in_thread": 0, "title": "Company Car: I do worry about the economy but I think it always will be a concern | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}], "locations": [{"name": "hungarton", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "ford", "sentiment": "negative"}, {"name": "leicester mercury  mark thompson", "sentiment": "neutral"}, {"name": "bbc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nMark Thompson owns the Black Boy pub in Hungarton. He drives a Ford Mondeo estate. \nQ) What do you like about your car? \nA) It is a great family car with lots of room for two kids and a dog and it also has very handy boot space for cash and carry runs at work. \nQ) Do you think the Tories are trying to out-UKIP UKIP? \nA) I don't see a problem in companies having to say how many foreign workers they employ, but to me the Government should look more closely at why big companies look to employ foreign workers over British-born workers, and as running the country has turned into running a business, maybe the Government should be clear on who they employ. \nQ) What needs to be done to stop the high number of pubs shutting their doors for good? \nA) As I have owned and run our country pub for 15 years, our single biggest bill is the VAT bill. I know people say that you only pay it if you earn it, but to lose 20 per cent of takings every time we run a food bill through the till is always a hard one to find. For the smaller country pubs like ourselves the business rates are also a big bill to find considering we don't get anything for it. \nQ) The Government has given the green light for a fracking site. In light of needs to cut carbon emissions was this right? Do wind and solar need more state support? \nA) Due to the upcoming closure of a number of nuclear plants in the UK, we will be facing an energy shortage soon, whilst solar and renewables do need economic support to move forward it seems unlikely that the technology will be ready to provide enough energy in the short term – so we have to consider investment in alternatives such as fracking. \nQ) Should David Cameron be cashing in on his years as PM with his memoirs or is his fall from grace still too fresh? \nA) As with all political questions it always depends on which side of the fence you sit. I think everyone has the right to go out and earn whatever they can but it is up to the public to decide whether they buy his book or not. \nQ) How worried are you about the economic impact of Britain leaving the EU and how will it affect your day-to-day life and business? \nA) I do worry about the economy but I think it always is and always will be a concern. Brexit only makes it more difficult for people to decide whether to spend or not. We personally have had a good summer and I think that is down to more people staying in Britain than going abroad on holiday. \nQ) The Columbian president has won the Nobel peace prize for trying to stop years of civil war. Who would you nominate and why? \nA) I think the Columbian president deserves it but as with these things there are hundreds of thousands of people who go about their daily life helping people with no recognition at all and all of those workers who go above and beyond whether in countries of peace or war deserve recognition for what they do. \nQ) Can you come up with a new show to replace Great British Bake Off on the BBC? \nA) It is a shame that the BBC lost the Bake Off but I admire the fact they stuck to their guns when the only winner was greed. I would like to see the BBC fighting to win back lots more sports coverage that it has lost. ", "external_links": [], "published": "2016-10-11T17:39:00.000+03:00", "crawled": "2016-10-11T18:59:50.743+03:00", "highlightTitle": ""}