{"organizations": [], "uuid": "04fc3ef3b5f4702a5ecf8ff0b52304d15118e482", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29805770/15616306.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/8203-when-bob-dylan-played-de-montfort-hall-leicester-in-1965/story-29805770-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "​When Bob Dylan played De Montfort Hall, Leicester, in 1965 | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "​When Bob Dylan played De Montfort Hall, Leicester, in 1965 | Leicester Mercury", "spam_score": 0.982, "site_type": "news", "published": "2016-10-13T20:57:00.000+03:00", "replies_count": 0, "uuid": "04fc3ef3b5f4702a5ecf8ff0b52304d15118e482"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/8203-when-bob-dylan-played-de-montfort-hall-leicester-in-1965/story-29805770-detail/story.html", "ord_in_thread": 0, "title": "​When Bob Dylan played De Montfort Hall, Leicester, in 1965 | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "bob dylan", "sentiment": "negative"}, {"name": "mark morriss", "sentiment": "none"}, {"name": "dylan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "john lydon", "sentiment": "none"}, {"name": "engelbert humperdinck", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "de montfort hall", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "manchester free trade hall", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "​When Bob Dylan played De Montfort Hall, Leicester, in 1965 By Leicester Mercury | Posted: October 13, 2016 0 COMMENTS SHARES Bob Dylan at De Montfort Hall in 1965 ​When Bob Dylan played De Montfort Hall, Leicester, in 1965 X \nCopy link to paste in your message / \nBob Dylan has been awarded the 2016 Nobel Prize for Literature. \nThe US singer, 75, is the first songwriter to be presented with the prestigious honour. \nHe was given the prize \"for having created new poetic expressions within the great American song tradition\". \nHere, we take a look back at when the folk singer came to Leicester in 1965 and performed at the De Montfort Hall. \nHis first gig here was a huge success – but 12 months later it was an entirely different story. \nBob Dylan took to the stage at Leicester's De Montfort Hall on May 2, 1965. \nThe gig was an emphatic success, with crowds of giddy fans chasing his limo down the street after the show. \nRead more: Engelbert Humperdinck pays tribute to the woman who helped him start his music career \nHere's the Mercury's review from the following day, headlined The Dylan Magic Is Here To Stay: \n\"The booming upsurge of folk music throughout the Western world is largely represented by a frail, shaggy-haired 23-year-old American called Bob Dylan. \n\"In the last few months his \"sound\" and the almost mystical lyrics which he writes himself – \"I reckon I've written about 70 songs, but many more words\" – have started off a new bandwagon in popular music, and have begun a fresh teenager cult on both sides of the Atlantic. \n\"But Dylan's popularity does not entirely rest on the shifting shoulders of the teenagers. \n\"His 100-minute solo performance to a sell-out audience of more then 3,000 at Leicester's De Montfort Hall last night proved by its sincerity and sheer magic that he will outlive and probably outgrow any mere popularity boom. \nRead more: John Lydon on Brexit, Donald Trump and why Leicester people are 'my kind of people' \n\"Dylan's material is above all poetic and leaves the impression that the music has been added as an afterthought. \n\"But this is something he denies. \"I write songs. I don't write poetry although I admit that some of the lyrics were written before the music.\" \n\"His songs are about people, feelings, events. It is always an emotional performance, often sad and sometimes sick. \n\"There is no doubt about his growing popularity. As he left the hall he was treated to the inevitable back-slapping, coat-tugging hysteria by a crowd of about 200 youngsters. \nRead more: 'I've NEVER had a bad time in Leicester': Mark Morriss on The Bluetones' 'charmed ride' & going solo \n\"This is perhaps sad because Dylan's music is no transient fly-by-night. It contains nothing to rave about but plenty to think about.\" \nHe left Leicester as a hero to a generation, but 12 months later – in the same city and venue – he was booed off as folk diehards turned on him for plugging in an electric guitar. \nThat 1966 tour is well-documented as Dylan was met with derision wherever he played, leading to cries of \"Judas\" from one member of the audience at Manchester Free Trade Hall and prompting hundreds of purists to turn tail and leave. ", "external_links": [], "published": "2016-10-13T20:57:00.000+03:00", "crawled": "2016-10-13T15:12:19.382+03:00", "highlightTitle": ""}