{"organizations": [], "uuid": "a67b407b01655a560439ea7e43e6f5943054453d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11082960.ece/ALTERNATES/s1200/JS85666692.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-investment-shows-brexit-can-12087280", "country": "GB", "domain_rank": 21960, "title": "Nissan investment shows Brexit can work - but what did we offer in return?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan investment shows Brexit can work - but what did we offer in return?", "spam_score": 0.0, "site_type": "news", "published": "2016-10-27T20:43:00.000+03:00", "replies_count": 0, "uuid": "a67b407b01655a560439ea7e43e6f5943054453d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-investment-shows-brexit-can-12087280", "ord_in_thread": 0, "title": "Nissan investment shows Brexit can work - but what did we offer in return?", "locations": [], "entities": {"persons": [{"name": "ghosn", "sentiment": "none"}, {"name": "ed miliband", "sentiment": "none"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "positive"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nissan leaf", "sentiment": "none"}, {"name": "nissan sunderland", "sentiment": "none"}, {"name": "nissan qashqai", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nWe heard a lot about Nissan during the EU referendum, as opponents of Brexit warned that quitting the European Union could deter firms such as the Japanese car giant from investing in the United Kingdom. \nBut it wasn’t unusual for politicians to focus on Nissan. \nWhen they want to show their commitment to the North East, the Sunderland car plant is often their first port of call. \nFormer prime minister David Cameron turned up to celebrate the launch of the Nissan Leaf in 2013. \nNick Clegg arrived, in his role as deputy prime minister, a year later. \nAnd former Labour leader Ed Miliband also visited in 2014. \nIt’s no secret why. The plant is a major employer, with 6,700 staff. Qashqai production at Nissan's Sunderland plant \nAnd that’s just the tip of the iceberg, because it also supports thousands of jobs in smaller firms which supply goods and services. \nNissan is a massive success. David Cameron told the House of Commons last year: “The achievements at Nissan are absolutely remarkable. One of the great privileges of my job is being able to go and meet people there and see what they are doing. Read More Nissan secures 7,000 jobs by confirming Qashqai will be built in North East \n“I think that I am right in saying that the north-east of England now produces more cars than the whole of Italy, which is something that I think we can be proud of.” \nBut the “remain” campaign was telling the truth when it said that leaving the EU put future investment in the plant at risk. It wasn’t project fear - it was project reality. \nThat’s why the announcement that Nissan is to build the new Qashqai and the X-Trail SUV in Sunderland is so important. A worker puts the finishing touches on a Nissan Qashqai \nIn fact, the decision to bring the X-Trail SUV to the North East came as a surprise - a very welcome one, of course - even to the Government. The decision is better than expected. \nNissan chief executive Carlos Ghosn warned in September that he could decide to build the Qashqai elsewhere unless the Government promised to provide compensation for any tariffs that may be imposed after Brexit. \nHe said: “If I need to make an investment in the next few months and I can’t wait until the end of Brexit , then I have to make a deal with the UK government. If there are tax barriers being established on cars, you have to have a commitment for carmakers who export to Europe that there is some kind of compensation.” \nThere may have been an element of brinkmanship in this, as some industry experts have questioned whether Nissan had another plant capable of building the vehicle without massive investment. The new Nissan Qashqai is produced on the assembly line at the Nissan Sunderland plant \nBut the Government took the threat seriously. Prime minister Theresa May held talks with Mr Ghosn in Number 10. \nInsiders say the deal was done, however, when business secretary Greg Clark travelled to Japan to meet Nissan bosses. \nWhat we don’t know is what exactly that deal involves. \nSedgefield MP Phil Wilson raised this question in the House of Commons this week. He said it appeared - though we can’t know for sure - that Brexit had forced the Government to subsidise industries, in order to convince overseas firms to invest in the UK. \nFor the Government, however, the lesson is clear. It shows that the UK can make a success of Brexit. \nMrs May hammered home the message in a statement welcoming the decision, saying: “This vote of confidence shows Britain is open for business and that we remain an outward-looking, world-leading nation.” \nThe prime minister, and Greg Clark, never wanted the UK to quit the EU. They were both remainers. \nBut their task now is to ensure that we continue to have a strong economy as we leave. \nThe Nissan announcement suggests that the goal is achievable. And of course, it’s fantastic news for the North East. \nBut it does also illustrate the danger that Brexit poses to our economy. Because while credit must go to Mr Clark for securing the investment, it would have been in far less doubt in the first place if we were staying in the EU.", "external_links": [], "published": "2016-10-27T20:43:00.000+03:00", "crawled": "2016-10-27T15:56:58.361+03:00", "highlightTitle": ""}