{"organizations": [], "uuid": "3780045ce21c77eee9f164a22186b73958081818", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11624024.ece/ALTERNATES/s1200/JS56466196.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/accountancy-group-ey-sees-7-12028403", "country": "GB", "domain_rank": 21960, "title": "Accountancy group EY sees 7% revenue growth despite pre-Brexit slowdown", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Accountancy group EY sees 7% revenue growth despite pre-Brexit slowdown", "spam_score": 0.0, "site_type": "news", "published": "2016-10-17T07:01:00.000+03:00", "replies_count": 0, "uuid": "3780045ce21c77eee9f164a22186b73958081818"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/accountancy-group-ey-sees-7-12028403", "ord_in_thread": 0, "title": "Accountancy group EY sees 7% revenue growth despite pre-Brexit slowdown", "locations": [], "entities": {"persons": [{"name": "graeme", "sentiment": "negative"}, {"name": "steve varley", "sentiment": "none"}, {"name": "mark hatton", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ernst", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ey", "sentiment": "none"}], "organizations": [{"name": "ey", "sentiment": "negative"}, {"name": "newcastle’s citygate", "sentiment": "none"}, {"name": "ey foundation", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "whitfield firm", "sentiment": "none"}, {"name": "citygate", "sentiment": "none"}, {"name": "newcastle  professional", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Accountancy group EY sees 7% revenue growth despite pre-Brexit slowdown 00:01, 17 Oct 2016 By Graeme Whitfield Firm now employs more than 600 people in Newcastle after growth in a number of key departments Share Get business news by email Mark Hatton, from Ernst and Young, in Newcastle \nProfessional services firm EY has announced a 7% rise in income, saying that its growing Newcastle office contributed to the firm’s success. \nEY - which provides assurance, tax, transaction and advisory services - saw its UK fee increase to £2.15bn for the year ending 1 July 2016, saying that the success was “driven by a focus on innovation and investment”. \nIn the North East, the firm now employs more than 600 people in offices at Newcastle’s Citygate, with rapid growth in the firm’s financial services, tax and advisory services departments. \nMark Hatton, North East Senior Partner at EY, said: “The North East is an important market for EY and we are seeing continued demand from our entrepreneurial and large corporate clients to help them drive growth and trade both in the UK and internationally. \n“Our core service lines and sectors have performed strongly with our financial services practice in particular going from strength to strength. This has led us to extending our premises and take on an additional 23,000 square feet in our Citygate 1 office. \n“Our Government and public sector team has also continued to expand, helping local public sector organisations account for new delivery models. \n“Investing and developing our people, as well as ensuring we have an inclusive culture, have been vital to our success in recent years, and this continued in FY16. \n“The North East remains a great place for us to recruit top talent and we have made a number of senior appointments who, along with the large number of graduate, school leaver and other experienced hires, will help to grow our business in the years to come. We plan to announce more senior hires in the coming weeks. \n“Our charity, The EY Foundation, has also been hugely impactful, with so many of our people getting involved to support young people in the North East. \n“Through the Smart Futures programme, year 12 students in the North East have been able to access employment skills and paid work experience, and are receiving mentoring from our people throughout year 13 to support them. A number are now starting their careers with EY as part of our school leavers programme.” \nThe slow-down in the run up to the EU Referendum reduced the momentum of EY’s overall performance, though all service lines and regions still reported strong growth over the year. \nEY’s tax department saw the largest growth, at 12.4%, while there were also big rises in assurance and transaction advisory services. Distributable profits before tax increased by 3% from £437m to £452m. \nAlong with a number of the other large accountancy firms, EY has made efforts to diversify its new hires by changing its recruitment process. \nThe firm removed academic qualifications from its entry criteria for graduates, undergraduate and school leavers and introduced new assessment tools designed to look at a candidate’s true potential. \nSteve Varley, EY’s UK Chairman, says: “We had another good year at EY, with strong growth across all of our service lines, sectors and regions. \n“This has partly been driven by a focus on innovation and investment in technology both within our own business and in the services we provide to our clients.", "external_links": [], "published": "2016-10-17T07:01:00.000+03:00", "crawled": "2016-10-17T02:54:58.566+03:00", "highlightTitle": ""}