{"organizations": [], "uuid": "5d59c4b591ebe0783253a4d58c4a0f1ac1f577c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29839204/15641085.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/aurum-holdings-sees-rise-in-sales-after-brexit-vote/story-29839204-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "IFrodsham published Aurum Holdings sees rise in sales after Brexit vote", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "IFrodsham published Aurum Holdings sees rise in sales after Brexit vote", "spam_score": 0.0, "site_type": "news", "published": "2016-10-25T20:29:00.000+03:00", "replies_count": 0, "uuid": "5d59c4b591ebe0783253a4d58c4a0f1ac1f577c2"}, "author": "IFrodsham", "url": "http://www.leicestermercury.co.uk/aurum-holdings-sees-rise-in-sales-after-brexit-vote/story-29839204-detail/story.html", "ord_in_thread": 0, "title": "IFrodsham published Aurum Holdings sees rise in sales after Brexit vote", "locations": [], "entities": {"persons": [{"name": "isobel frodsham", "sentiment": "none"}, {"name": "hublot", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "matthew knowles", "sentiment": "none"}, {"name": "breguet", "sentiment": "none"}, {"name": "brian duffy", "sentiment": "none"}, {"name": "dominic gomersall", "sentiment": "none"}, {"name": "chopard", "sentiment": "none"}, {"name": "dominic", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "aurum holdings", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "ifrodsham", "sentiment": "negative"}, {"name": "mappin & webb", "sentiment": "none"}, {"name": "goldsmiths", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "university of leicester school of business", "sentiment": "none"}, {"name": "aurum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Aurum Holdings sees rise in sales after Brexit vote By IFrodsham   0 COMMENTS SHARES Aurum Holdings sees rise in sales after Brexit vote   Comments (0) \nBrexit means Brexit, says the Prime Minister. But what does it mean for the county's jewellery businesses? Isobel Frodsham investigates \nRegular readers of the Business Monthly will have seen an interesting comment piece from Dominic Gomersall, managing director of Lumbers jewellers in Leicester, in August. \nDominic argued that Brexit was good for business, particularly jewellery businesses, and the drop in the value of the pound against the dollar had increased export opportunities. \nHe added: \"We have seen these clients take advantage of the situation by realising that the UK is currently the least expensive market for quality Swiss brands in the world. \n\"We have been lucky enough to have exported sales of Breguet, Chopard and Hublot watches and have actually had a record July on this basis, seeing a 40 per cent increase on last year.\" \nTwo months after the piece was published, the pound experienced a \"flash crash\", which saw it drop by 6 per cent from $1.26 in a matter of minutes. \nThe time of the crash was unusual – it was very late at night for the British traders, very late in the trading day for the US and very early in the trading day for Asia. \nWhile the reason for the flash crash has not yet been confirmed, and probably won't be for some time, the flagging value of the pound is doing wonders for big exporters. \nSo, how else have Leicestershire's top jewellery businesses been affected? \nBrian Duffy, chief executive officer of Aurum Holdings, said that the international traffic for Braunstone-based Aurum Holdings, the business that owns Mappin & Webb, Goldsmiths, Watches of Switzerland and Watch Lab, had \"seen a significant boost\". \nHe said: \"When the vote came through that morning there was a natural assumption that the domestic market would feel the pinch initially as the Government was changing hands. \n\"The pound value fell immediately around the world, particularly against the euro and the dollar. \n\"As a result, the prices of luxury Swiss brands are 15 to 20 per cent lower to buy in the UK than anywhere else in the world. If a consumer is buying in the UK tax free, i.e. buying our product and claiming tax back when they go back to their own country, it could be as much as a 40 per cent lower price. It is hugely favourable for consumers to come to the UK right now.\" \nBrian said that post-Brexit, the company was concerned about its domestic sales being affected due to UK customers being more wary. \nHowever, he said this had not been the case. \n\"Altogether it's been positive. Brexit hasn't been a problem for us. It's been hugely beneficial in London and the luxury Swiss watch market. \n\"Our domestic business is holding up very well.\" \nLast Tuesday, it was announced that the UK consumer price index jumped to 1 per cent in September, higher than the City expected. \nThis was a 0.4 per cent jump on August's figure. \nHow will this affect Aurum? \nBrian said: \"Anything we import is more expensive now, so at some point, even everyday commodities are going to become more expensive for people to buy. \n\"We're seeing that with gold and diamond prices now as we buy everything in dollars. \n\"The gold prices are rising and the diamond prices will rise. \n\"We're not increasing any prices to the consumer right now and taking a lower margin on it all. \n\"But eventually that could become impossible to do.\" \nThe success of the jewellery businesses in the county after the Brexit vote is a great for the local economy. However, is this something that is going to continue? \nMatthew Knowles, lecturer in Economics at the University of Leicester School of Business, gives his opinion. \nHe said: \"Things do not look so bad over the next six months for the jewellery and retail sectors. \n\"The low pound will boost exports, and I would not anticipate major price rises within the next six months. \n\"There is little sign that the British economy is sinking just yet. \n\"However, I would not be at all optimistic about the outlook for jewellery and other retail over the next few years, and I fear things might start to take a turn for the worse within a few months. \n\"Some retailers have so far benefited from the growth in exports due to the low pound. \n\"This will continue to be the case, as many observers expect the pound to fall further. \n\"However, the jewellery sector remains predominantly national and exports are for many firms not a large fraction of their sales. \n\"So for many retailers, what happens to domestic sales is ultimately the most important thing. While these seem OK right now, there's not much to be optimistic about here. \n\"Probably the biggest concern for jewellers and other retailers is overall consumer spending. \n\"Consumer confidence, and therefore spending, will depend on what happens politically over the coming months, but I would expect consumer spending to fall once it becomes clearer that we are heading for a hard Brexit and an uncertain long-term economic future. \n\"Brexit is hitting the financial sector which will likely reduce lending, and the Government remains committed to reining in public spending. All of these will hit domestic demand and consumer spending further. \n\"Rising prices will also hurt sales of jewellery and other consumer goods. \n\"Sooner or later, retailers will have to pass these costs on to the consumer, which will hit sales.\"", "external_links": [], "published": "2016-10-25T20:29:00.000+03:00", "crawled": "2016-10-25T16:28:03.204+03:00", "highlightTitle": ""}