{"organizations": [], "uuid": "56e8b8ef012b1158582c956d814f81cfb4360b18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12006316.ece/ALTERNATES/s1200/JS102022265.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/usiness-breakfast-live-puregym-scraps-12001785", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Newcastle student schemes in £51.5m deal, plus PureGym scraps flotation plan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Newcastle student schemes in £51.5m deal, plus PureGym scraps flotation plan", "spam_score": 0.0, "site_type": "news", "published": "2016-10-11T15:20:00.000+03:00", "replies_count": 0, "uuid": "56e8b8ef012b1158582c956d814f81cfb4360b18"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/usiness-breakfast-live-puregym-scraps-12001785", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Newcastle student schemes in £51.5m deal, plus PureGym scraps flotation plan", "locations": [], "entities": {"persons": [{"name": "fenwick", "sentiment": "negative"}, {"name": "john fenwick", "sentiment": "negative"}, {"name": "house of fraser", "sentiment": "none"}, {"name": "coreena ford ted baker", "sentiment": "none"}, {"name": "kelvin", "sentiment": "none"}, {"name": "grainger", "sentiment": "none"}, {"name": "coreena ford crosslane", "sentiment": "none"}, {"name": "helen gordon", "sentiment": "none"}, {"name": "james robson", "sentiment": "none"}, {"name": "brian nicholls", "sentiment": "none"}, {"name": "john waterworth", "sentiment": "none"}, {"name": "steve ingham", "sentiment": "none"}, {"name": "cowie", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "paul martin", "sentiment": "none"}, {"name": "adam", "sentiment": "none"}, {"name": "john savage", "sentiment": "none"}, {"name": "crosslane", "sentiment": "none"}, {"name": "gibson o’neill", "sentiment": "none"}, {"name": "andy whatson", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "ben bajarin", "sentiment": "none"}, {"name": "coreena ford pound", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "humphrey cobbold", "sentiment": "none"}, {"name": "ray kelvin", "sentiment": "none"}, {"name": "ted baker", "sentiment": "none"}, {"name": "esh", "sentiment": "none"}, {"name": "james mccauley", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "crosslane", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "liberum", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "honolulu", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "czech republic", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "hollywood bowl", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "aldi", "sentiment": "none"}, {"name": "samsung electronics galaxy", "sentiment": "none"}, {"name": "biffa", "sentiment": "none"}, {"name": "scs", "sentiment": "none"}, {"name": "cleveland cable", "sentiment": "none"}, {"name": "st james’ house", "sentiment": "none"}, {"name": "st james", "sentiment": "none"}, {"name": "coreena ford food", "sentiment": "none"}, {"name": "coreena ford samsung", "sentiment": "none"}, {"name": "continental europe", "sentiment": "none"}, {"name": "st james’ street", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "hays travel", "sentiment": "none"}, {"name": "db arriva", "sentiment": "none"}, {"name": "entrepreneurs’ forum", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "crosslane", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "pagegroup", "sentiment": "none"}, {"name": "la fitness", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "coreena ford pagegroup", "sentiment": "none"}, {"name": "michael page international", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "budget fitness chain puregym", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "coreena ford grainger plc", "sentiment": "none"}, {"name": "st james point", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9.29 Coreena Ford John Fenwick receives lifetime achievement award \nThe man behind Fenwick’s windows has been given a lifetime achievement award by a business organisation based in the North East. \nJohn Fenwick, who stood down as deputy chairman of the family department store group in 2013, was among four business leaders honoured at the North East Entrepreneurial Awards run by the Entrepreneurs’ Forum. \nMr Fenwick’s award was introduced by his son Adam, current managing director of the retail group, who praised his father’s role in building Fenwick’s as a North East institution. \nAwards also went to John Waterworth, chief executive of Gosforth-based Parkdean Resorts, who was named Entrepreneur of the Year, James Robson as mentor of the Year and John Savage, managing director of growing North East trade retailers Flame Heating Spares, who was presented with the Emerging Talent Award. John Fenwick gets lifetime achievement award at Entrepreneurs' Forum diner 9.26 Coreena Ford Samsung share price falls amid Galaxy Note 7 issues \nThe Korean technology giant’s share price tumbled 7% in trading in Seoul, wiping billions of pounds off its value, as the future of the flagship handset was thrown into jeopardy. \nAnalysts say the latest problems pose a real crisis for the world’s largest smartphone company. \nBen Bajarin, a consumer tech industry analyst with Creative Strategies, described it was a “real black eye on the product”. \nIn September Samsung saw £11 billion wiped off its market value when it first recalled the handset intended to take on Apple’s iPhone 7 plus. A photo taken in Honolulu shows a replacement Galaxy Note 7 smartphone one day after the phone released smoke and sizzled. 9.24 Coreena Ford Samsung stops Galaxy Note 7 sales \nSamsung says global sales of its Galaxy Note 7 are to be halted following reports of handsets that were issued as safe replacements catching fire. \nThe Korean technology giant said owners of either an original Note 7 or a replacement should turn them off and stop using them as it investigates the reports with regulators. Affected consumers have been advised to seek a refund or exchange their devices. \nSamsung said it is “working with relevant regulatory bodies to investigate the recently reported cases involving the Galaxy Note 7. \n“Because consumers’ safety remains our top priority, Samsung will ask all carrier and retail partners globally to stop sales and exchanges of the Galaxy Note 7 while the investigation is taking place,” the firm added in a statement. \nOfficials in the US said they were investigating at least five incidents of fire or overheating reported since Samsung first recalled the devices in September. Meanwhile, authorities in South Korea said they had found a new product defect in the Note 7, but did not identify the issue. \nSamsung said it remained “committed to working diligently with appropriate regulatory authorities to take all necessary steps to resolve the situation”. “Consumers with either an original Galaxy Note 7 or replacement Galaxy Note 7 device should power down and stop using the device and take advantage of the remedies available.” \nAuthorities in the US and South Korea echoed Samsung’s advice to switch the phones off and not use them. \nThe UK release date for the Note 7 had been moved to October 28, after Samsung ordered the recall of its latest handset following dozens of reports of devices overheating worldwide. \nThe South Korean manufacturer then began a programme offering replacement phones to consumers who had pre-ordered the device in the UK. \nSamsung said in September that it was “confident” it had completely overcome the problem and was ready to launch the device. \nHowever, concerns were raised over further defects beyond the battery cell, following several reports in the US of phones catching fire that showed the green battery icon Samsung added to replacement phones to mark them as safe. \nThe company said 45,000 Note 7s had been sold in Europe through the pre-order campaign - the majority in the UK - and more than 75% had since been replaced with either a Note 7 or another Samsung handset. Samsung Electronics Galaxy Note 7 smartphones on display before sales were halted 9.16 Coreena Ford Family businesses in North East set to feature highly in Top 200 list \nPrivately owned companies – many of them family businesses – will make a colourful and valuable contribution to the new list of Top 200 North East companies coming out soon, says Brian Nicholls. \nMost privately owned businesses have impressive stories to tell. And many will certainly be prominent on the new list of Top 200 North East companies soon to be revealed. \nSome such firms of the past, true, have since become major public limited companies - Greggs, for example, a favourite City share for 32 years since, and the former Cowie motor group, now DB Arriva. Both continue to excel, transformed, in this Top 200. \nBut also many businesses that are still privately owned reach the list, often family run, and still proudly independent. Fenwick’s department stores - founded in Newcastle and now with 11 branches around the country – came in last year at 24th on £290.2m sales. With additional investment recently made, it could this year again be top among the “privates”. \nThe next four highest of the private representation last year – Esh construction group (27th), Hays Travel (30th), and two Teesside flag fliers, Cleveland Cable (32nd) and Gibson O’Neill (37th) – should all excel again. \nEsh, building homes and commercial and public property across the North and in Scotland, has enjoyed a strong year ahead of Brexit uncertainties, and along with Hays Travel recently made The Sunday Times Profit Track 100 List of the UK’s fastest growing private firms. The Top 200 9.14 Coreena Ford Dividend payout for ScS shareholders \nSunderland sofa firm ScS has announced that its recommended final dividend of 9.83p per share, as disclosed in the Company’s recent preliminary results will, if approved by shareholders, be paid on November 28, to shareholders on the register as at close of business on November 4. 9.12 Coreena Ford Food sales boosted by warm weather \nGrocery sales rose at their fastest pace since 2013 in the three months to September as supermarket price wars and an Indian summer gave food retailers a boost. The latest British Retail Consortium-KPMG survey showed food sales rose 1.6% between July and September compared with the same period last year, which is three times the average 12-month rate of 0.5%. “It was yet another month of positive growth for the grocers. Late summer temperatures combined with shoppers continuing to benefit from the ongoing price war has meant food and drink sales have been in the black for a full quarter - undoubtedly welcome news for the sector,” said Paul Martin, head of retail at KPMG. Major UK supermarkets have recently embarked on a fresh round of price cuts in a bid to win back market share amid competition from German upstarts Aldi and Lidl. Meanwhile, warm weather factors that boosted grocer sales hurt fashion retailers. The rise in mercury helped drag down non-food sales, which only grew 0.5% over the past three months, compared with the 12-month average growth rate of 1.3%. 9.03 Coreena Ford Pound and FTSE latest \nThe pound at 9am was 1.2296 dollars compared to 1.2395 dollars at the previous close. The euro at 9am was 0.9042 pounds compared to 0.9009 pounds at the previous close. \nThe FTSE-100 index at 8:45am was up 14.21 at 7111.71. 9.00 Coreena Ford PageGroup sees profits fall \nUK profits at recruitment firm PageGroup have taken a Brexit hit, with financial services bearing the brunt of the pain. \nThe group said that British profits slumped 4.7% to £37.8 million in the third quarter, with financial services profit falling 14%. \nThe sector accounts for 4% of its UK business. \nChief executive Steve Ingham said: \nIn the UK, confidence levels remained fragile and below levels seen earlier in the year. \nWith the prevailing uncertainty in the UK, the challenges in some of our other larger markets and the unpredictable nature of the current cycle, we remain cautious in our short-term outlook. \nThe news comes as the Government signals Britain is hurtling towards a so-called “hard Brexit”, whereby the UK would ditch the EU’s single market, a move that many argue would be catastrophic for businesses, the economy and the financial services sector. \nHowever, the firm said it will be boosted by the collapse in sterling, which will see £45 million added to gross profits and £10 million to operating profits over the full year. \nPageGroup, formerly known as Michael Page International, added that technology was its best performing sector in the UK, with growth of 22%. Globally, profits rose 1.3% to £158.6 million, driven by a strong performance in Europe. 8.53 Coreena Ford Crosslane sells Newcastle student schemes for £51.5m \nCrosslane has announced that it has sold its recently completed 147-bed student accommodation development, St James’ House, at St James’ Street, Newcastle, to an institutional investor for a total purchase price of £16.5 million. \nCrosslane also advised the Victus European Student Accommodation Fund on the sale of St James’ Point Phases One and Two, both close to St James’ Park, Newcastle and developed by Crosslane, to the same investor for a total purchase price of £35 million. \nPrime Student Living, the student accommodation lettings and operational management arm of Crosslane, has been managing the St James Point properties since each phase became operational in 2014 and 2015, respectively, and has ensured that the newly built St James’ House is 98% let for the start of the 2016/17 academic year. \nThe properties have a total of 566 beds, with 216 and 203 respectively at St James’ Point Phase One and Two and 147 beds at St James’ House. All three schemes have excellent high quality communal facilities and amenity space and also boast the fastest broadband on the market of 250MB. \nAndy Whatson, Director of Crosslane Student Developments, said: \nCrosslane is pleased to have successfully identified the sites in prime locations in Newcastle and then developed these three student accommodation schemes over three consecutive years delivering 566 beds in the city. Our fourth development in the city is expected to be complete for the 2017/18 academic year and will see Crosslane deliver a further 130 beds. These sales, at an attractive yield, are in line with our strategy of delivering optimal returns to investors and are testament to the high specification of the properties, fantastic amenities offered and the continuing attractions of student accommodation as an investment. \nCrosslane continues to grow its identified pipeline of potential student accommodation investments in Newcastle as well as in other prime university cities in the UK and Continental Europe. Crosslane has sold student schemes with 566 beds for £51.5m 8.45 Coreena Ford Ted Baker hikes up half-year profits \nFashion chain Ted Baker shrugged off tough trading on the high street to hike half-year profits by more than a fifth, but cautioned conditions remain “challenging”. \nFounder and chief executive Ray Kelvin hailed a strong performance despite difficult trading in all its markets as the group posted a 20.5% leap in pre-tax profits to £21.5 million for the six months to August 13. \nThe firm notched up a 13.6% rise in retail sales, up 9.6% with currency movements stripped out, helped by surging online sales in the first half - up 29.7%. \nMr Kelvin said Ted Baker “continues to perform well” since the first half and the group is pleased with the reaction to its autumn/winter collections. \nBut it warned: “Ongoing external factors impacting trading across our established markets have meant that conditions remain challenging.” \nThe results come amid a torrid past few months for high-street clothing chains. Next, John Lewis and House of Fraser have all warned over difficult trading in recent weeks amid a shift in consumer spending, while last month’s unexpected heatwave caused chaos for clothing stores. \nTed Baker said across the UK and Europe, where it has 283 stores and concessions, sales lifted 8.5% or 6.7% on a constant currency basis over the first half. In the US and Canada, where it has 106 stores and concessions, sales jumped 18.8% on a constant currency basis, while sales lifted 6.5% across its remaining international business. \nThe group expanded further over its first half, including more concessions in the UK, and it confirmed aims to continue extending its international footprint, with more stores and concessions set to open across the US and Asia. \nIt said the full-year performance would be driven by the all-important Christmas season, but added it was “confident of making further progress”. \nShares lifted nearly 4% after the interim results, but the stock has fallen sharply in recent months, down around 28% since a high last November, on fears over the weakness of US department stores and challenging conditions in Asia, with the declines compounded recently by Brexit. Retail analysts said the share falls have been overdone, with experts at Liberum saying Ted Baker continues to “outperform in all weathers”. 8.37 Coreena Ford Grainger Plc predicts £50m-plus profits \nThe Uk’s largest listed landlord - Newcastle-based Grainger - has issued an update ahead of announcing its full year results, and it’s forecasting profits to be upwards of £50m. \nThe figures follows a year in which the business has sought to simplify operations, a strategy which has involved disposing of non-core assets. \nThe firm said: \nSince setting out the strategy in January, we have now completed the majority of our non-core disposals. \nThis includes the recent successful disposal of Grainger’s joint venture in the Czech Republic, which was located in Prague. We are pleased to report that the disposal will generate a profit before tax of c.£9m which will be treated as a non-recurring item. \nSince our trading update on 11 August, good rental growth has continued, our sales performance has remained strong and benefits are being seen from the actions taken to reduce financing costs. We expect recurring profit for the year ended 30 September to be above £50m, at the higher end of management expectations. \nHelen Gordon, chief executive, said: \nWe are pleased with the significant progress made and the way the business is responding to our strategy of growing net rental income, improving operational efficiency and simplifying the business, with the ultimate aim of improving value for all our shareholders and partners. \nWe have seen a strong and resilient performance despite the changes to stamp duty legislation and the EU referendum, and we look forward to providing further details on strategic progress at our full year results in December. Helen Gordon, CEO of Grainger plc 8.30 Coreena Ford PureGym ditches flotation plan \nBudget Fitness chain PureGym has scrapped plans for a stock market flotation, citing “market volatility”. \nThe group had aimed to raise £190 million from its initial public offering (IPO), announced less than a month ago, to help fund ambitious expansion plans. But chief executive, Humphrey Cobbold, said: \nGiven the challenging IPO market conditions, the board has decided not to proceed with a listing despite the strong interest shown by potential investors. \nCurrent trading is strong, giving us further confidence that we can capitalise on the significant market opportunity. \nPure Gym added that pursuing a listing “in this period of market volatility is not in the long-term interests of the company and its stakeholders”. \nPure Gym was founded in 2008 and now has 169 gyms - including five in the North East, three of which are in Newcastle - and 820,000 members nationwide, boosted by the takeover last year of rival LA Fitness. \nThe group has previously signalled that it wants to roll out its affordable and flexible gym membership model further across the UK, while also looking at other areas of the fitness market and possible acquisitions. \nUK stock market listings had been expected to bounce back following a post-Brexit vote slump, with the likes of Hollywood Bowl and Biffa pushing the button on IPOs. \nBut the collapse in sterling and growing uncertainty about Britain’s relationship with the European Union, triggered in part by proclamations at the Conservative Party conference, have dampened confidence. James McCauley", "external_links": [], "published": "2016-10-11T15:20:00.000+03:00", "crawled": "2016-10-11T11:33:35.004+03:00", "highlightTitle": ""}