{"organizations": [], "uuid": "0af9efbbfe920445038305582141947d7e484d50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article10864101.ece/ALTERNATES/s1200/JS67690754.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-intu-12068624", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Intu sells shopping centre for £177.9m, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Intu sells shopping centre for £177.9m, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-10-25T15:20:00.000+03:00", "replies_count": 0, "uuid": "0af9efbbfe920445038305582141947d7e484d50"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-intu-12068624", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Intu sells shopping centre for £177.9m, plus latest news", "locations": [], "entities": {"persons": [{"name": "coreena ford brexit", "sentiment": "none"}, {"name": "colin hughes", "sentiment": "none"}, {"name": "brittain", "sentiment": "none"}, {"name": "alison brittain", "sentiment": "none"}, {"name": "walsh", "sentiment": "none"}, {"name": "martin birchall", "sentiment": "none"}, {"name": "humphrey cobbold", "sentiment": "none"}, {"name": "david fischel", "sentiment": "none"}, {"name": "wilf walsh", "sentiment": "none"}, {"name": "kirsty lavin", "sentiment": "none"}, {"name": "james mccauley", "sentiment": "none"}, {"name": "bromley", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}], "locations": [{"name": "costa", "sentiment": "none"}, {"name": "wandsworth", "sentiment": "none"}, {"name": "barton square", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "intu trafford centre", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "eldon square", "sentiment": "none"}, {"name": "costa pronto", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "broadmarsh", "sentiment": "none"}, {"name": "covent garden", "sentiment": "none"}, {"name": "aintree", "sentiment": "none"}, {"name": "merry hill", "sentiment": "none"}, {"name": "watford", "sentiment": "none"}], "organizations": [{"name": "coreena ford costa coffee", "sentiment": "negative"}, {"name": "whitbread", "sentiment": "negative"}, {"name": "whitbread  costa coffee", "sentiment": "neutral"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "london borough of bromley", "sentiment": "none"}, {"name": "coreena ford intu bromley", "sentiment": "none"}, {"name": "premier inn", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "aviva", "sentiment": "none"}, {"name": "alaska permanent fund corporation", "sentiment": "none"}, {"name": "lasalle investment management", "sentiment": "none"}, {"name": "henderson managed investment trusts", "sentiment": "none"}, {"name": "henderson opportunities trust", "sentiment": "none"}, {"name": "carpetright", "sentiment": "none"}, {"name": "misys", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "intu properties", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "coreena ford carpetright", "sentiment": "none"}, {"name": "costa coffee drive-thru", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8.57 Coreena Ford Costa Coffee sales perk up Whitbread \nCosta Coffee owner Whitbread has reported a rise in half-year profits as it brews up plans to tap the artisan coffee market. \nThe group, which also owns Premier Inn, said pre-tax profit in the period rose 3.4% to £263.6 million while revenue grew 8.1% to £1.56 billion. \nLike-for-like sales at Costa continued to bounce back, growing 2.3% in the period, while Premier Inn saw a comparable sales increase of 2.4%. \nWhitbread chief executive Alison Brittain said: \n“We are trialling new ‘finer’ coffee concepts, introducing a new fresher food range and making good progress rolling out our Costa Pronto and Drive Thru formats.” \nThe company opened its first “finer coffee” concept store in London’s Covent Garden in June, which sells artisan coffee and an “enhanced beverage range”. A second store opened in Wandsworth, south-west London, this month. \nHowever, Whitbread added that it will closely monitor the risk of a “wider macro-economic effect as a result of the UK leaving the EU, including foreign exchange and interest rate fluctuations”. \nMs Brittain said that despite “uncertainty in the UK’s economic outlook, the group expects to deliver in line with full-year expectations”. Martin Birchall The Costa Coffee Drive-Thru at Aintree. Kirsty Lavin on her horse Jeff was a first customer 8.52 Coreena Ford Carpetright sales down \nCarpetright has seen sales slump in the first half of the year as the retailer warned that the collapse in sterling will increase costs. The group said that stiff competition led to a 2.9% decrease in like-for-like sales in the UK during the period, with boss Wilf Walsh flagging “variable consumer demand”. \nCarpetright added that, as a result of “increased sourcing costs resulting from the devaluation of sterling, competitive market conditions and a mix impact”, annual gross profits in the UK are now expected to come in between 1.5% to 2% lower than previously guided. \nHowever, group profit expectations for the full year remain unchanged. \nChief executive Mr Walsh said: \nTrading conditions in the UK in the first half reflect variable consumer demand and increased competitive pressures. \nAgainst this background, our plan to revitalise the UK business remains on track and we are now almost halfway towards our target of 100 store refurbishments in the current financial year, with investment in the first half weighted to the latter part of the period. \nIn the aftermath of the EU referendum, the retailer said that the vote could trigger “uncertainty” among shoppers, adding to warnings from the likes of Foxtons, EasyJet and British Airways. A Carpetright store FTSE and pound latest \nThe FTSE-100 index at 8:15am was up 25.07 at 7011.47. \nThe pound at 8am was 1.2221 dollars compared to 1.2204 dollars at the previous close. The euro at 8am was 0.8898 pounds compared to 0.8918 pounds at the previous close. 8.48 Coreena Ford Brexit vote deters firms from IPOs \nBrexit uncertainty has deterred firms from listing on the UK stock market, with the total value of initial public offerings (IPO) over the past three months falling to levels not seen since 2012. \nResearch released by Henderson Managed Investment Trusts shows a “dramatic decline” in both the number and value of firms that have successfully completed a stock market flotation in the wake of the EU referendum. \n“Pre-referendum jitters have persisted,” the report said. Of the 41 companies that have listed since January, only nine took place after the Brexit vote and only four were completed within the past three months. \nIt brings the total value of UK IPOs to £948 million in the third quarter, which marks a near-40% drop from the £1.6 billion recorded during the same period last year. \nColin Hughes, a fund manager at Henderson Opportunities Trust, said: “The chilling effect of the Brexit vote noticeably cooled companies’ enthusiasm to list on the stock market, and we have yet to see IPO activity reheat despite market conditions settling somewhat. \n“It’s actually surprising activity was not even quieter ahead of the vote, and that perhaps reflects the unexpected Leave result in the referendum.” \nFitness chain Pure Gym is the latest company to have scrapped plans for its stock market debut, citing “market volatility”. \nThe group had aimed to raise £190 million from its IPO to help fund ambitious expansion plans. \nPure Gym chief executive Humphrey Cobbold said: “Given the challenging IPO market conditions, the board has decided not to proceed with a listing despite the strong interest shown by potential investors. \nHowever, there could be some hope for the IPO market in the months ahead. A recent report by accountancy giant EY claimed that UK stock market listings could bounce back after their summer slump. \nEY said higher valuations and lower volatility could spark a pick-up in IPO activity going forward, adding that a return to the record levels of 2014 “may be a stretch”, but the number of IPOs throughout 2017 could surpass the 2015 total. \nInvestors are still awaiting the flotation of online banking software firm Misys, which stands to be the UK’s biggest IPO this year. \nMisys - which provides software to the likes of Lloyds Banking Group, Barclays and HSBC as well as lenders worldwide - is planning to list in early November. James McCauley Pure Gym scrapped plans for its stock market debut 08:42 Coreena Ford ...and Intu Properties announces £350m convertible bond offering \nThe shopping centre operator issued a third stock market note, announcing the launch of an offering of £350m of Guaranteed Convertible Bonds due in 2022, with an increase option of up to £50 million. \nThe firm intends to use the proceeds from the offering to complete its pipeline of developments of £212m over the next two years, which are predominantly pre-let. \nThat includes £152m for the to the 400,000sqft extension of intu Watford. \nIt also intends to refinance the £101m drawn on the revolving credit facility for the £410m acquisition of the remaining 50% of intu Merry Hill in June 2016. \nThe proceeds will also give enough overall financial facilities to allow the firm to pursue further projects, such as the leisure extension at intu Lakeside, the redevelopments of intu Broadmarsh in Nottingham and Barton Square at intu Trafford Centre and the development of the intu Costa del Sol shopping resort. 8.30 Coreena Ford Intu Bromley sells for £177.9m \nIntu properties plc has exchanged contracts to sell its 63.525% stake in intu Bromley to Alaska Permanent Fund Corporation for £177.9m representing a premium compared to the centre’s valuation of £175.9m in June of this yera. \nThe centre is based in London’s largest borough and has an annual footfall of 20 million, and it’s recently had a full mall refurbishment. \nThe buyer has also acquired Aviva’s 21.475% stake in the centre. London Borough of Bromley is retaining its 15% interest and freehold. The centre will be managed by LaSalle Investment Management on behalf of APFC. Completion is expected before the end of the year. \nMeanwhile in a separate stock market note the firm issued a trading update for the period from July 1 to October 25, detailing how its saw strong demand from retailers for new long-term leases \nThe shopping-centre operator agreed 67 new long-term leases, with 61 in the UK and six in Spain, for a total of £13m in new annual rents. \nIts UK development pipeline is also on track with new restaurants at intu Eldon Square now handed over to the occupiers, with opening taking place over the next few months, and its £180m intu Watford extension, which is 60% pre-let, is also progressing. \nDavid Fischel, intu Chief Executive, said: “We continue to demonstrate the attractiveness of our top quality prime shopping centres to shoppers, to retailers and to global investors, with increased footfall, good progress on lettings and rent reviews and the disposal of intu Bromley at a consideration above June 2016 market value. \n“The business has a pipeline of attractive organic investment opportunities in both the UK and Spain which will enhance intu’s long-term growth potential.” How the entrance to intu Eldon Square will look when work on the dining zone has finished", "external_links": [], "published": "2016-10-25T15:20:00.000+03:00", "crawled": "2016-10-25T11:09:13.177+03:00", "highlightTitle": ""}