{"organizations": [], "uuid": "9b730c43caa4ad1f14af96646b08bc6d98838831", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29819633/15626421.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/find-out-how-to-book-9-99-flights-from-east-midlands-airport/story-29819633-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Find out how to book £9.99 flights from East Midlands...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Find out how to book £9.99 flights from East Midlands...", "spam_score": 0.0, "site_type": "news", "published": "2016-10-18T23:27:00.000+03:00", "replies_count": 0, "uuid": "9b730c43caa4ad1f14af96646b08bc6d98838831"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/find-out-how-to-book-9-99-flights-from-east-midlands-airport/story-29819633-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Find out how to book £9.99 flights from East Midlands...", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "kiely", "sentiment": "none"}, {"name": "robin kiely", "sentiment": "none"}], "locations": [{"name": "east midlands", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "malta", "sentiment": "none"}, {"name": "girona", "sentiment": "none"}, {"name": "menorca", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "reus", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "negative"}, {"name": "east midlands ryanair", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nRyanair is launching three new routes out of East Midlands Airport despite warnings the airline's profits are growing at a slower rate because of Brexit. \nThe Irish low-cost carrier is adding new routes to Girona and Reus in Spain, and the Hungarian capital Budapest from next summer, taking the number of scheduled destinations from Castle Donington to 37. \nIt is also putting on more flights to Menorca and Malta, and predicts the number of Ryanair passengers using the airport will grow by 100,000 to 2.5 million. \nIt comes as the airline expects profits to rise by 7 per cent in its current financial year, instead of the previously forecast 12 per cent – mainly because the fall in the value of sterling against the euro. \nDespite that, the airline expects its total passenger numbers to grow to 119 million across Europe – 12 per cent up on last year's 106 million. \nAnnouncing the new routes, Ryanair's head of communications Robin Kiely said the full effects of Brexit would not really be known for another 18 months. \nHe said: \"This is our biggest ever East Midlands schedule. \n\"Our East Midlands passenger numbers are growing by 100,000 next year so we are certainly bringing more people through the airport. \nRead more: East Midlands Ryanair flight diverted after medical emergency \n\"We're half way through our financial year and what we have said is that planned growth for the UK will slow down so we are going to push growth to other European airports. \n\"We are planning around 50 new aircraft a year overall, over 10 years, but none will be in the UK – though some of them would have been (if the UK had not voted to leave the EU). \n\"Despite the effects of Brexit already, the one thing that has not changed is the British weather and the demand coming from the UK, and that is going to continue. \nRead more: Passenger who smoked in a plane toilet appears in court \n\"People are still going to want to fly at the lowest fares. \n\"We are the biggest airline in Europe, flying into and out of 19 UK, airports and campaigned strongly for Remain. \n\"Unfortunately Remain did not happen, so it's a case of seeing what happens next. \n\"The trading update we put out today highlights the issues in the UK. \n\"But we are not retreating from the UK.\" \nThe airline has nine aircraft based at the airport with 400 or so people employed there \nMr Kiely said it was possible they would have put more routes through East Midlands Airport if the Brexit vote had not happened, but new routes were based on many factors including demand, a good airport relationship and new aircraft. \nHe added: \"The good news is that we are still growing by 4 per cent and are the biggest airline out of East Midlands and see no reason why we can't continue to grow and add more routes.\" \nTo mark the launch of our East Midlands summer 2017 schedule Ryanair is releasing seats for sale from just £9.99, which are available for booking until Thursday, October 20.", "external_links": [], "published": "2016-10-18T23:27:00.000+03:00", "crawled": "2016-10-18T19:08:12.985+03:00", "highlightTitle": ""}