{"organizations": [], "uuid": "638b853a95638b48bbea703de85dc29205a0deef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article7158499.ece/ALTERNATES/s1200/Jonathan-Arnott.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/north-east-ukip-mep-feared-12080497", "country": "GB", "domain_rank": 21960, "title": "North East Ukip MEP: I feared our party was about to shatter into a thousand ugly pieces", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East Ukip MEP: I feared our party was about to shatter into a thousand ugly pieces", "spam_score": 0.0, "site_type": "news", "published": "2016-10-27T01:00:00.000+03:00", "replies_count": 0, "uuid": "638b853a95638b48bbea703de85dc29205a0deef"}, "author": "Jonathan Arnott", "url": "http://www.chroniclelive.co.uk/news/news-opinion/north-east-ukip-mep-feared-12080497", "ord_in_thread": 0, "title": "North East Ukip MEP: I feared our party was about to shatter into a thousand ugly pieces", "locations": [], "entities": {"persons": [{"name": "jonathan arnott", "sentiment": "negative"}, {"name": "paul", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "brendan chilton", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "labour leave", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "party", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathan Arnott, Ukip MEP for the North East, on why his party faces the death knell unless it makes the right choice as leader Share Get daily news by email Jonathan Arnott \nThe UKIP leadership contest is pivotal for the future of the Party. \nSpeaking as a UKIP MEP , I think it’s no exaggeration to suggest that the wrong decision now could spell the death-knell for the party. \nIf a candidate is elected who moves the party towards a bland, establishment-style politics, too far away from its core vote and demographics, we lose the basis of our electoral appeal. \nIf, on the other hand, the party lurches too far to the Right, then it’ll be a mirror image of the Labour Party’s mistake in choosing Jeremy Corbyn as leader. \nThe job description is pretty tough. We need a candidate who isn’t in one ‘faction’ or another, someone who can truly unite the party. \nWe need a candidate who is UKIP through and through, who has been a member through the good times and the bad, who has the capacity to be unfazed and not panic because they personally have experience of going through worse times and navigating us out through the other end. \nGiven the internal problems within UKIP, we need a candidate with vast experience of the inner workings of the party. We need a candidate who has experience of full-time elected office. We need a candidate who can appeal to working-class people – how else can we take advantage of the disconnect between Corbyn and traditional Labour voters? \nI’m going to admit something that I never thought I would have to say. Three weeks ago, I had almost given up hope. I knew that if I stood for the party leadership I wouldn’t get enough support to win, and I couldn’t see another candidate with the slightest hope of uniting us. \nI was preparing for the worst, as many were, fearing that the party would shatter into a thousand ugly pieces. \nThere was the altercation in Strasbourg between two of my colleagues. After 15 years of loyal service to the party, there was a part of me that felt like giving up and walking away. \nYet, in the days that followed, something remarkable happened. The mood in UKIP changed almost overnight; the party collectively woke up to the existential threat that we faced. There was suddenly a desire to unite, to find compromise, to work together once more. \nBut there was still no candidate for leader. I had despondent conversations with one of my trusted MEP friends. He, like me, lacked the profile to be able to win a leadership contest. We both knew what needed to be done; neither of us could do it. \nThen came the game-changer: Paul Nuttall agreed to put party first, sacrificing much in his personal life to do so, and stand for party leader. The future of UKIP suddenly seemed much brighter with the only qualified candidate to follow Nigel ready and willing to take on the job. \nI believe that the coming days we’ll see a serious coalescing of support amongst UKIP’s MEPs for Paul Nuttall as the next leader. He’s been a member of the party since, I think, 2004. His blood runs purple, and to him the survival of UKIP matters personally. When he took over as party chairman in 2008, the party was in an even worse state than it is in today – I remember being utterly horrified by what happened in September 2008. Under Paul’s chairmanship, the party was back on track by the European elections in 2009, where we had a huge breakthrough. \nWhat does this mean for the North East? I note the words of Labour’s Brendan Chilton (General Secretary of Labour Leave – and one of the Labour people to truly understand the Brexit vote) this morning: “If Paul Nuttall wins the UKIP leadership, my party, Labour, will be fighting for its life in the heartlands.” This stark, rare, honest analysis is spot on in my view. \nA Paul Nuttall-led UKIP will be a UKIP led by a Northerner, someone who understands the North and has spent plenty of time in the North East. He’s spent more time here than any other national UKIP figure, visiting Gateshead, Newcastle, Blyth, Sunderland, North Shields, Hartlepool, Redcar, Middlesbrough and others, many multiple times. \nHe’s shown a commitment to the North East, understands how to take the fight to Labour, and is vastly experienced politically. \nIf I were the Labour Party, I would be very worried indeed about Paul winning. As a UKIP MEP, I’m delighted to endorse him.", "external_links": [], "published": "2016-10-27T01:00:00.000+03:00", "crawled": "2016-10-26T20:06:56.759+03:00", "highlightTitle": ""}