{"organizations": [], "uuid": "fe3622573a0bdfa8d3e71f2a8a78c9dfbccf1f25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29802370/15613880.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/leicestershire-food-companies-hit-by-drop-in-value-of-pound/story-29802370-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Leicestershire food companies hit by drop in value of pound | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Leicestershire food companies hit by drop in value of pound | Leicester Mercury", "spam_score": 0.5, "site_type": "news", "published": "2016-10-12T22:41:00.000+03:00", "replies_count": 0, "uuid": "fe3622573a0bdfa8d3e71f2a8a78c9dfbccf1f25"}, "author": "", "url": "http://www.leicestermercury.co.uk/leicestershire-food-companies-hit-by-drop-in-value-of-pound/story-29802370-detail/story.html", "ord_in_thread": 0, "title": "Leicestershire food companies hit by drop in value of pound | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "keith vaz", "sentiment": "none"}, {"name": "steven", "sentiment": "none"}, {"name": "alan duncan", "sentiment": "none"}, {"name": "alberto costa", "sentiment": "none"}, {"name": "farsan", "sentiment": "none"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nainesh patel", "sentiment": "none"}, {"name": "prakash pandit", "sentiment": "none"}, {"name": "ximena shelton", "sentiment": "none"}, {"name": "melton", "sentiment": "none"}], "locations": [{"name": "leicester mercury leicestershire", "sentiment": "none"}, {"name": "humberstone road", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "leicester food park", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "leicester east", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "south leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "shelton's coffee", "sentiment": "none"}, {"name": "royal tea", "sentiment": "none"}, {"name": "shelton's coffee leicestershire", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "eurosceptic north west leicestershire", "sentiment": "none"}, {"name": "leicestershire enterprise partnership", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "commonwealth affairs", "sentiment": "none"}, {"name": "equinox", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicestershire food companies hit by drop in value of pound By TomPegden | Posted: October 12, 2016 0 COMMENTS SHARES Steven and Ximena Shelton of Shelton's Coffee Leicestershire food companies hit by drop in value of pound X \nCopy link to paste in your message / Comments (0) \nFood companies are taking a big hit from the drop in the value of the pound. \nSmaller county importers are having to think hard about staff numbers and how to make efficiencies since the drop in sterling that followed the June 23 EU referendum. \nSince the referendum the pound has dropped from around $1.48 to $1.22 and from 1.30 euros to 1.11 euros. \nMany bosses say there appears to be no light at the end of the tunnel – expecting the exchange rate to get worse, in the build up to and during Brexit negotiations. \nRead more: House of Commons getting taste of Leicestershire food and drink \nCounty food and drinks manufacturers took part in a Global Flavours of Leicestershire event at the Houses of Parliament today to promote the county's excellent reputation within the sector and discuss the way forward. \nIt was organised by the Leicester and Leicestershire Enterprise Partnership and hosted by county Tory MPs Alberto Costa and Andrew Bridgen. \nPrakash Pandit, who owns Royal Tea in Leicester Food Park, was among a dozen or so companies taking part. He said the cost of his India tea imports and flavourings had gone up almost a fifth in three months. \nThat was a huge blow for his 10 person operation which makes flavoured instant teas and which has a turnover of £500,000. \nHe said: \"Brexit is a big problem. Our raw materials have gone up in cost by 18 per cent and we even import powdered milk from Ireland and Germany. \n\"At the moment we are taking a hit until we see what happens. \n\"We are talking to our customers and are waiting to see what they are saying. \n\"Right now we have not put our prices up because customers like Tesco won't want us to do that. \n\"And nobody knows what will happen with Article 50. It will impact on staff. We work on a very low margin. It's going to kill a lot of companies.\" \nNainesh Patel runs Farsan, off Leicester's Humberstone Road, which makes Asian foods such as samosas. \nTurnover for the business – which now has 52 products – has risen £100,000 a year for the last three years to the current £700,000 and he is diversifying into new products to mitigate the increased cost of imports. \nHe said: \"Our vegetables are all UK grown, but the cost of wheat for our pastry has gone up by 25 per cent since June. Our spices are going up too. \n\"That is hitting my margins and we can't impose a price increase on the end customer. So we are having to be more efficient and move to other markets such as bean burgers and triple cooked chips.\" \nXimena Shelton runs Shelton's Coffee, which makes its own brands of coffees at Leicester Food Park, importing 10 tonnes of Columbian green coffee beans a year. \nShe said: \"We are paying in dollars and our costs are going up by 15 per cent. \n\"We can't put our prices up.\" \nShe said investment in new technology had helped keep costs down. \nMelton and Rutland MP Alan Duncan is Minister of State for Foreign and Commonwealth Affairs, and one of the people tasked with helping Britain exit the EU. \nA guest of today's reception he said it was hard to do anything about market economics, but hoped the county's food makers could exploit the low pound by finding new export markets. \nHe said: \"I would like to see less volatility and more stability and for that we will need solid Brexit negotiations. \n\"Markets are markets, They go up and they go down.\" \nLeicester East MP Keith Vaz, told the Mercury: \"We have some amazing businesses and all are going to be affected in one way or another by Brexit. \nRead more: Equinox building up for sale \n\"The people have spoken and we need to follow through – but there are implications for farming and manufacturers with the pound at a new low and we now need a plan from Government that can help people make decisions.\" \nSouth Leicestershire MP Alberto Costa said the county was home to world leaders in food and drink as well as small and medium sized companies which formed the backbone of the UK economy. \nHe said: \"As we exit the EU small and medium businesses will be the ones that help us get through the choppy waters ahead, take advantage of the new opportunities in front of us and create a new beginning for the whole of the country.\" \nEurosceptic North West Leicestershire MP Andrew Bridgen said the UK needed to ensure \"food security\" by increasing the diversity of supply. ", "external_links": [], "published": "2016-10-12T22:41:00.000+03:00", "crawled": "2016-10-12T17:33:26.394+03:00", "highlightTitle": ""}