{"organizations": [], "uuid": "a04a021f2306a3a43beed36c43741cfe3ddc8570", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.horncastlenews.co.uk/webimage/1.7607581.1476457024!/image/image.jpg", "site_section": "http://www.horncastlenews.co.uk/rss/cmlink/1.5463062", "section_title": "Horncastle News Feed", "url": "http://www.bostonstandard.co.uk/whats-on/arts/tv-column-question-time-great-british-bake-off-poldark-1-7629962", "country": "GB", "title": "TV COLUMN: Question Time, Great British Bake Off, Poldark", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "TV COLUMN: Question Time, Great British Bake Off, Poldark", "spam_score": 0.0, "site_type": "news", "published": "2016-10-15T19:00:00.000+03:00", "replies_count": 0, "uuid": "a04a021f2306a3a43beed36c43741cfe3ddc8570"}, "author": "", "url": "http://www.bostonstandard.co.uk/whats-on/arts/tv-column-question-time-great-british-bake-off-poldark-1-7629962", "ord_in_thread": 0, "title": "TV COLUMN: Question Time, Great British Bake Off, Poldark", "locations": [], "entities": {"persons": [{"name": "james waller-davies", "sentiment": "none"}, {"name": "tudor", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "rwwr", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "isabel oakeshott", "sentiment": "none"}, {"name": "alex salmond", "sentiment": "none"}, {"name": "dimbleby", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}, {"name": "candice", "sentiment": "none"}, {"name": "emily thornberry", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "brexit time", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "team candice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Have your say \nColumnist James Waller-Davies gives his view of some of the recent events on television. \nQuestion Time (BBC1), or at least to be known for the next couple of years as ‘Brexit Time’ once again stirred up the political pot. \nIn the ‘We’re doomed’ corner, Alex Salmond, a man who knows more than most about losing referendums, did his level best to poke the stick in the UK hornets’ nest, knowing full well it didn’t matter who got stung, just as long as someone did. \nSeated to his right in the ‘ha, ha, we won, you lost’ corner was Isabel Oakeshott, political editor at large for the Daily Mail and she of the David Cameron ‘pig’s head’ biography, providing the blunter instrument of the alternative view. \nIn the crowd, the usual assortment of odd views and odder haircuts, all doing an eager schoolboy’s hands up and “Me Sir! Me Sir!” to catch the pleasure of Mr Dimbleby. \nMeanwhile, Emily Thornberry managed to draw derision and scorn from every corner of the room, in the same way that a black hole sucks light out of the universe. \nThere might have been some questions other than Brexit, but by then the panel, displaying fairly convincing mutual distain, had stopped listening to each other, and so had I. \nIt was Tudor week on The Great British Bake Off (BBC1), a bit of a sixteenth century baking combo, including pies, biscuits and marzipan cake. \nIt was a tad bit too much of the innovation and it’s not been the first time this series. It’s all indicative of a franchise running out of puff. After all the fuss from a few weeks ago, the BBC might well be pleased it’s letting it slip over to Channel 4. This cake has risen as far as it’s going to. \nIn the meantime, things are finally hotting up in the kitchen. At home, we’re divided between Team Andrew and Team Candice. \nCandice took star baker this week with a peacock tail cake, which glittered in all the garish colours of her lipsticks. \nAndrew, alas, got his nut and caramel lances in the wrong place, giving the impression there were a few things knights did with their lances when their ladies weren’t looking. \nNext week, it’s semi-finals. Only two episodes of ‘real’ Bake Off to go. \nThe eagle-eyed amongst you will have noticed the scandal at the heart of Poldark (BBC1). \nI speak of course of the subtle revelation that Ross and Demelza are not a real couple, are not husband and wife. And that’s the truth. And we’ve all been staring at it in full view. \nYou’ll have noticed that in season 1, Ross slept on the left side of the bed and Demelza on the right. But now, in season 2, they’ve swapped sides. No real couple ever does that! Sleep on the other side of the bed? I’d sleep better nailed to the side of the house. \nSo Ross – or as Demelza calls him, Rwwr sss – you can cut all the bare-chested meadows you can and roll all the stockings you want up her thighs, we’re not buying it any longer. Busted! Sign in", "external_links": [], "published": "2016-10-15T19:00:00.000+03:00", "crawled": "2016-10-15T14:20:06.981+03:00", "highlightTitle": ""}