{"organizations": [], "uuid": "6ab968228defd0d5b7b63ca1df00ecdf6b47cf9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10148915.ece/ALTERNATES/s1200/JS71268182.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-petards-12101435", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Newcastle city hotel acquired by Dutch firm, plus Hitachi Rail deal for Petards", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Newcastle city hotel acquired by Dutch firm, plus Hitachi Rail deal for Petards", "spam_score": 0.0, "site_type": "news", "published": "2016-10-31T15:20:00.000+02:00", "replies_count": 0, "uuid": "6ab968228defd0d5b7b63ca1df00ecdf6b47cf9e"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-petards-12101435", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Newcastle city hotel acquired by Dutch firm, plus Hitachi Rail deal for Petards", "locations": [], "entities": {"persons": [{"name": "coreena ford pound", "sentiment": "neutral"}, {"name": "traviss", "sentiment": "none"}, {"name": "john spreadbury", "sentiment": "none"}, {"name": "raschid abdullah", "sentiment": "none"}, {"name": "rowan gormley", "sentiment": "none"}, {"name": "james hall", "sentiment": "none"}, {"name": "john colley", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "barton willmore", "sentiment": "none"}, {"name": "majid al futtaim", "sentiment": "none"}, {"name": "hugh welch", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "dickinson", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "eduard elias", "sentiment": "none"}, {"name": "allsaints", "sentiment": "none"}, {"name": "william kim", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "great western railway west", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "bermondsey and tower bridge", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "stratford city", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "porto", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "london bridge", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "buxton street", "sentiment": "none"}, {"name": "earls court/kensington", "sentiment": "none"}, {"name": "great western railway", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "pearl", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "hitachi rail", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "coreena ford fasion", "sentiment": "none"}, {"name": "hitachi rail europe", "sentiment": "none"}, {"name": "coreena ford dickonsons", "sentiment": "none"}, {"name": "dickinsons", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "coreena ford petards", "sentiment": "none"}, {"name": "petards", "sentiment": "none"}, {"name": "starwood capital group", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "lion capital", "sentiment": "none"}, {"name": "le monde", "sentiment": "none"}, {"name": "dickinsons furnishers", "sentiment": "none"}, {"name": "staybridge suites", "sentiment": "none"}, {"name": "christie & co", "sentiment": "none"}, {"name": "tace traviss", "sentiment": "none"}, {"name": "cycas hospitality", "sentiment": "none"}, {"name": "intercity express programme", "sentiment": "none"}, {"name": "vauxhall", "sentiment": "none"}, {"name": "hitachi rail europe  team valley", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wpp", "sentiment": "none"}, {"name": "new england interiors", "sentiment": "none"}, {"name": "dickinson group", "sentiment": "none"}, {"name": "dickinsons group", "sentiment": "none"}, {"name": "muckle llp", "sentiment": "none"}, {"name": "sir martin sorrell", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "allsaints", "sentiment": "none"}, {"name": "les nouvelles editions independantes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "That’s it for today - thanks for reading and I’ll be back tomorrow morning. 9.15 Coreena Ford Pound and FTSE latest \nThe FTSE-100 index at 8:45am was down 24.90 at 6971.36. \nThe pound at 9am was 1.2178 dollars compared to 1.2153 dollars at the previous close. The euro at 9am was 0.8989 pounds compared to 0.8995 pounds at the previous close. 9.10 Coreena Ford The Business Profile: James Hall, partner at planning consultancy Barton Willmore \nThis week’s business profile is with James Hall, partner in charge of leading planning consultancy Barton Willmore’s Newcastle office, in The Pearl. \nHe may not be a native, but he’s got a lot invested in the North East and has been involved in a whole raft of pivotal projects. \nRead his journey here.. 9.05 Coreena Ford Fasion firm Allsaints bags sales and profit \nFashion retailer AllSaints has bolstered sales and profits as it reaped the rewards of overseas expansion and the success of a new handbag collection. \nThe private equity owned firm said total sales rose 9% to £252.5 million in the year to the end of January, as it launched 23 new stores internationally, including new sites in the US, South Korea and Taiwan. \nEarnings before exceptional items jumped 18% to £28.5 million, with growth partly offset by the cost of opening new stores. \nAllSaints said the launch of the Capital Collection - a women’s bag range produced in partnership with Simone - was already making a double-digit contribution to revenue in some markets. \nChief executive William Kim said the decision to broaden its product range and push into new international markets had delivered strong growth. \n“Asia continues to be a massive opportunity for us,” he added. \n“We recently launched the brand in Japan, which becomes our third directly-operated country in Asia, and following our highly successful launches in Korea and Taiwan we now anticipate that non-American international markets will account for around one third of our total revenue by 2020. \n“Meanwhile, North America continues to be our biggest international market, and we are also thrilled with the start to our partnership in the Middle East with Majid Al Futtaim.” \nAllSaints said the growth boost came despite an “uncertain backdrop” in some markets where currency weakness impacted the number of tourists spending money. \nOn sterling’s collapse since the Brexit vote, Mr Kim said the way the retailer was structured helped protect it from currency fluctuations. \nAs an example, he said US sales were used to do Asian business in US dollars, while sales in euro were used to pay its Portuguese partners in Porto, creating a “natural hedge”. \nHe also hinted that the retailer was likely to steer away from any hefty UK price hikes following the plunge in the value of the pound. \nHe said when the Russian rouble halved last year there was a “tremendous mark up in pricing” from the wider industry, while AllSaints “sat and assessed and didn’t adjust pricing” except for two “minor” changes. \nThe retailer said it was also in talks with three to four different parties over licensing deals which could lead to new product ranges. \nAllSaints UK sales grew 7.4% to £144.3 million in the year to January 30, while international sales rose 12% to £108.2 million. \nThe firm, which has seen a fourfold increase in its Asian business, said more than 40% of its total sales now came from abroad. \nDigital sales also picked up by a third throughout the year to £47.3 million, compared to £35.6 million the year before. All Saints was created in 1994 and opened its first stand-alone store in London in 1997. It was bought by Lion Capital in 2011. \nThe retailer employs around 3,200 staff and has 208 stores in 18 countries. The AllSaints website homepage 9.00 Coreena Ford Majestic wine uncorks new delivery service \nMajestic Wine is hoping its new next-day delivery service will help it bolster Christmas trading after the firm was forced to issue a warning over profits in September. \nWine lovers will be able to utilise “flexible delivery options” through click and collect and next-day delivery services, and a six-bottle minimum online order has been removed, Majestic said. \nManaging director John Colley described the introduction of the service as a “big step in our transformation plan”. \n“This ... will help support Christmas trading,” he said. \n“We are putting the customer back at the heart of Majestic and can now offer a complete multi-channel experience which will deliver real benefits to our customers, people and therefore our shareholders.” \nA full range of more than 1,250 wines, including almost 400 fine wines, will be available. \nLast month shares in the wine warehouse retailer collapsed after it said earnings would take a hit from a failed marketing campaign for its Naked Wines business in America and weak sales to business customers. \nMajestic Wine said it is reviewing its commercial arm, which supplies wine to businesses, after seeing sales growth flatline and profit margins come under pressure as the first half of the year proved “even more challenging”. \nMajestic Wine has 210 warehouses across the UK as well as two branches in France, while Naked Wines operates across Britain, the US and Australia. Majestic Wine's chief executive Rowan Gormley 8.51 Coreena Ford BREAKING: Newcastle hotel acquired by Dutch hospitality giant \nNewcastle’s Staybridge Suites has been acquired by Dutch hotel group Cycas Hospitality in a deal overseen by Christie & Co. \nThe 128-suite building, on Buxton Street, has been snapped up by the Amsterdam-headquartered business for an undisclosed amount, and it’s clear the new owner have had an eye on Newcastle for some time as a desirable location for a longer-stay hptel. \nThe building will continue to be branded as a Staybridge Suites hotel and will be the fifth Staybridge Suites property under Cycas management. \nThe acquisition is a further extension of Cycas’ portfolio after recently announcing its contract with Starwood Capital Group to manage its four extended-stay hotels in Earls Court/Kensington, London Bridge, Bermondsey and Tower Bridge, making them the second largest operator of serviced apartment/apart-hotels in London. \nEduard Elias, managing partner of Cycas Hospitality said: “Newcastle is one of the most culturally and commercially dynamic cities in the UK. \n“It has invested over £250m in transforming its cultural infrastructure. \n“The city is well positioned on the high-speed East Coast mainline so most of the UK’s city hubs are just a short train ride away. New intercity trains are also due to run between Liverpool and Newcastle by December 2017. Newcastle’s accessibility, its skilled workforce and the presence of strong international companies makes it a natural fit for the extended-stay hotel market.” \nStaybridge Suites Newcastle will join the UK’s first Staybridge Suites in Liverpool, acquired by Cycas Hospitality in February this year, Staybridge Suites London -Vauxhall, Staybridge Suites London – Stratford City and the Staybridge Suites Manchester, which is due to open in 2017. Staybridge Suites in Newcastle 8.42 Coreena Ford Dickonsons has designs on expansion \nA leading North East interior design company is expanding into a key market after snapping up Newcastle-based New England Interiors. \nDickinsons Furnishers is part of the Dickinsons group, which already boasts the largest interior design studios in the North of England, with 70 staff and four retail stores across the region. \nNow the firm, which has grown turnover to £8.22m in recent years, has acquired Gosforth’s New England Interiors for an undisclosed sum as part of a planned expansion programme. \nJohn Spreadbury, managing director of the group, sees the buyout as a key part of the geographical growth of the group, who have further plans for investment and growth. \nHe said: “We are delighted to announce the purchase of New England Interiors in Gosforth. This is a strategic acquisition for us and very much part of our plans for future growth. \n“New England has a great reputation and history for providing fantastic customer service and we are looking to build on this with a wider product range of designs and product groups. \n“The Dickinsons Group has enjoyed some significant growth in the past few years and we are looking to build on this success going forward and have some exciting plans to widen our retail and trade operations which we will be announcing shortly.” \nThe Dickinsons Group specialise in flooring, furniture, soft furnishings and provide a comprehensive interior design service across a number of retail, commercial and trade sectors and was established in Hexham by the Dickinson family in 1878 and has been owned by the Traviss family since 2001. Grande designs: Hugh Welch, Muckle LLP, John Spreadbury, Managing Director and and Tace Traviss, Commercial Director, Dickinson Group who have purchased Gosforth based New England interiors 8.40 Coreena Ford WPP feels first signs of \"Brexit anxiety\" \nLeading advertising firm WPP has said the first signs of “Brexit anxiety” are beginning to show as the firm reported slower sales growth in Britain. \nThe firm, run by Sir Martin Sorrell, said in its third-quarter trading update that like-for-like growth in the UK came in at 2.1%, compared with 3.5% in the previous quarter. \nWPP said: “All parts of the group’s businesses, except data investment management and public relations and public affairs, softened. \n“Perhaps, the first signs of Brexit anxiety.” \nBut WPP also flagged the impact of a weak pound, which boosted overall revenue by 23.4% to £3.6 billion, with North America and continental Europe driving growth. On a constant currency basis, the firm said overall sales grew 7.6%. \nSpeaking to BBC Radio 4, Sir Martin said: “I always think of a country’s currency as its stock price, so when the currency falls it is rather like the country’s stock price falling.” \nSir Martin, a prominent proponent of remaining in the EU, again reiterated that WPP will place a greater emphasis on growth in western continental Europe, in particular Germany, France, Italy and Spain. \nTo this end, WPP announced in September that it is investing in French media firm Les Nouvelles Editions Independantes, which owns holdings in newspaper Le Monde and VICE France. \nIn its outlook, WPP highlighted the “diplomatic warfare and long-term negotiation around Brexit” and “right-wing and left-wing populism around ... the presidential election in the United States” as reasons for caution. Signage outside the WPP offices in London 8.30 Coreena Ford Petards secures deal with Hitachi Rail Europe \nTeam Valley technology firm Petards has secured a new deal with Hitachi Rail Europe worth 1.2m Euros, to supply its automatic passenger counting systems. \nThe AIM-listed firm, which develops advanced security and surveillance software systems, has secured an additional framework contract and two “Call Off” contracts with Hitachi. \nThe new Call Off contracts - an umbrella contract which will involve Petards’ services for three years - are for the East Coast Main Line as part of the Intercity Express Programme and the Great Western Railway West of England service, \nPetards Chairman Raschid Abdullah said: \n“The board of Petards is delighted that we continue to develop our long term relationship with Hitachi. These two exciting projects further enhance our position as a leading supplier to the rail industry and strengthen the Group’s present order book for delivery in 2017, 2018 and into 2019.” \nThe deal comes three weeks after the firm announced a contract worth about £6m with Great Western Railway, to design, development, supply and install eyeTrain systems on Class 165 and 166 Diesel Multiple Units trains. \nThat deal is expected to be completed by the third quarter of 2017 when deliveries of the integrated systems will commence with scheduled completion by the end of 2018.", "external_links": [], "published": "2016-10-31T15:20:00.000+02:00", "crawled": "2016-10-31T12:16:00.626+02:00", "highlightTitle": ""}