{"organizations": [], "uuid": "c77a3dc22ac74243fc29ac6940232839c0d2be21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12077782.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-been-forced-subsidise-nissan-12077623", "country": "GB", "domain_rank": 21960, "title": "Has the UK been forced to subsidise Nissan to invest in the North East?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Has the UK been forced to subsidise Nissan to invest in the North East?", "spam_score": 0.0, "site_type": "news", "published": "2016-10-26T01:44:00.000+03:00", "replies_count": 0, "uuid": "c77a3dc22ac74243fc29ac6940232839c0d2be21"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-been-forced-subsidise-nissan-12077623", "ord_in_thread": 0, "title": "Has the UK been forced to subsidise Nissan to invest in the North East?", "locations": [], "entities": {"persons": [{"name": "phil w", "sentiment": "negative"}, {"name": "ghosn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Has the UK been forced to subsidise Nissan to invest in the North East? 18:44, 25 Oct 2016 MP Phil Wilson asks Government to explain how Brexit has affected Nissan's investment in Sunderland Share   \nThe British Government may have offered “compensation” to Japanese carmaker Nissan to ensure it continues investing in the North East, an MP has suggested. \nPhil Wilson, Labour MP for Sedgefield, said the decision to leave the European Union may have forced the Government to subsidise industry. \nHe was leading a House of Commons debate about the impact of leaving the European Union on the North East of England. \nAnd Mr Wilson argued that the UK must maintain access to the single market - which allows firms in the UK to sell products across the European Union without paying tariffs. \nStaying in the Single Market is particularly important to the North East because it is a major exporter, and the only region that exports more than it imports, he said. \nAnd it was also important for attracting inward investment to the region. \nMr Wilson said: “Japanese investment is key to the North East of England. There are around 50 Japanese companies in the region, including Hitachi in my own constituency, who now provide almost 1000 direct jobs with many more in a growing supply chain. \nNissan, 7000, direct jobs, 30,000 in the supply chain. With 300 automotive companies in the region, the car industry in the North East produces £11 billion of sales and is responsible for over £5 billion in exports.” \nHe added: “Throughout the referendum campaign I was clear in saying that if Britain voted to leave, companies such as Hitachi and Nissan would not immediately cease production, close their factory doors and ship out to the EU. But I still believe that if we are not part of the EU single market their potential for long term growth must be called into question.” Andrew Matthews/PA Wire A Nissan car dealership \nMr Wilson also pointed out that Nissan’s Chief Executive, Carlos Ghosn, had indicated the company may halt further investment in its Sunderland plant unless the Government agreed to compensate it for any adverse financial impact from Brexit - but had reportedly now decided to build the Qashqai SUV at its Sunderland plan, following a meeting with Prime Minister Theresa May. \nHe said he welcomed the decision if the reports were correct, but the public should be told what the Government had offered in return. \nMr Wilson said: “If the new Qashqai model is to be built in North East England, what kind of compensation is Mr Ghosn anticipating? What price will Britain need to pay to keep Nissan in Sunderland that it didn’t need to pay before? \n“Don’t get me wrong, I want Nissan to stay, but I believe it is incumbent on the Government to tell us what that cost is. \n“Because it seems to me, that much vaunted windfall to the Exchequer from not being in the EU, won’t be available to spend on the NHS, if ever it was, because it will be needed to subsidise industry in a way we didn’t need to before.” \nThe Government has said it wants to ensure the UK has “access” to the Single Market, but it was unclear what this really meant, he said. \n“Brexit is the defining issue of our time. And it is more than apparent that this government didn’t have any contingency planning in place to deal with the immensity of the task ahead. \n“The future prosperity of the North East of England, and indeed our nation, depends on getting it right.” \nAnswers were needed “to provide certainty. Promote confidence and offer optimism,” Mr Wilson said. Read More Brexit job loss fears for Nissan's Sunderland plant could become a reality \nThe MP was one of the most vocal campaigners calling for the UK to remain in the EU during June’s referendum, but he said: “The country voted otherwise. The North East of England voted otherwise. Their decision must be implemented.” \nHowever, he pointed out that “leave” campaigners had promised that quitting the EU, such as by giving the NHS an extra £350 million a week or building new schools. \nMr Wilson said: “While my constituents may have voted to leave the EU, I do not believe they voted to be poorer. \n“They did not vote to put their jobs at risk. \n“They did not vote to see their region fall further behind.”", "external_links": [], "published": "2016-10-26T01:44:00.000+03:00", "crawled": "2016-10-25T21:10:49.075+03:00", "highlightTitle": ""}