{"organizations": [], "uuid": "5b646bec25ddc89795a964c81592e688b2efb7db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12032753.ece/ALTERNATES/s1200/Untitled-design-1.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-fall-out-sees-rush-12032712", "country": "GB", "domain_rank": 21960, "title": "Brexit fall out sees rush in North East people interested in emigrating", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit fall out sees rush in North East people interested in emigrating", "spam_score": 0.0, "site_type": "news", "published": "2016-10-16T20:52:00.000+03:00", "replies_count": 0, "uuid": "5b646bec25ddc89795a964c81592e688b2efb7db"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-fall-out-sees-rush-12032712", "ord_in_thread": 0, "title": "Brexit fall out sees rush in North East people interested in emigrating", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "john weir", "sentiment": "none"}, {"name": "tom rowlands", "sentiment": "none"}, {"name": "rowlands", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "sandown park", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sydney harbour", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "solihull", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}], "organizations": [{"name": "evolve media group", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "canada   getty images", "sentiment": "none"}, {"name": "national motorcycle museum", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit fall out sees rush in North East people interested in emigrating 13:52, 16 Oct 2016 Organisers see massive increase in interest in emigrating to Australia, New Zealand and Canada   Getty Images Sydney Harbour bridge \nThousands of people including many from the North East are looking for a ‘Plan B’ as the fall out from the European Union referendum vote continues. \nWith the plunging pound, inflation predicted to rise and question marks about foreign companies like Nissan remaining in the UK, there has been a rush in interest in emigrating. \nTwo events - one at the weekend, the other at the end of the month - have seen record numbers sign up to attend to find out about upping sticks and moving to Australia, Canada and New Zealand. \nOrganised by the Evolve Media Group, they say 8,000 people registered to attended at London and Solihull in Birmingham - a massive 70% leap on pre-Brexit events. \nSpokesman Tom Rowlands said: “We don’t keep a regional break down of where people are coming from but we expect many from the North East to come especially to the one in Solihull as it is nearer than London. \n“For them Plan B is an option and the North East has an excellent skills bases because of its tradition in heavy industry - you think of, for example, Redcar steel works where people who worked there have skills that are transferable.” Vancouver \nThe 70% increase in registrations for the ‘Down Under Live’ event follows a 40% increase in search activity for emigration terms following the EU referendum and reflects a growing uncertainty about the UK’s immediate future post Brexit. \nMr Rowlands said the three commonwealth countries involved provide a compelling draw for UK citizens looking for a better quality of life, improved employment opportunities and in Australia’s case, 300 days of sunshine a year. \nHe said the start of the year is traditionally the peak for interest in emigration, but 2016, following the June 23 referendum result, has bucked that trend. Read More EU Referendum: Report reveals why the North East backed Brexit \nAnd John Weir, event director for Evolve Media Group, added: “The extraordinary growth in interest in emigration and our shows is unprecedented. The current economic uncertainty is driving more and more people to consider a new life overseas, and our shows will provide them with an informative and authoritative start on their emigration journey.” \nThe event at the weekend was staged at Sandown Park while the National Motorcycle Museum in Solihull is the venue for the second event on October 29 and 30. New Zealand \nVisitors will be able to get a free visa assessment for all three countries, talk to experts in every field of migration, including visas, shipping, banking, study, pensions, currency exchange and recruitment, visit the dedicated expo hall, as well as hearing a full day of seminar talks. The immigration department for New Zealand will also be at the Solihull shows, looking to recruit skilled migrants from the UK. \nIronically, if people from the North East do want to emigrate to Australia the will first have to get through its ‘points system’, much beloved of Brexiteers who have talked of copying it to keep immigration to the UK down. \n“It’s a long convoluted process and can take up to 18 months,” said Mr Rowlands. “You have to be skilled to get in.”", "external_links": [], "published": "2016-10-16T20:52:00.000+03:00", "crawled": "2016-10-16T16:09:56.485+03:00", "highlightTitle": ""}