{"organizations": [], "uuid": "9eedd4ecb10dc37cbfa9f1415f3e2b44d4a7a6f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.7638016.1476960969!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard Feed", "url": "http://www.bostonstandard.co.uk/news/boston-and-skegness-mp-calls-on-government-to-treat-people-like-people-during-eu-migrant-rights-debate-1-7638017", "country": "GB", "title": "Boston and Skegness MP calls on Government to ‘treat people like people’ during EU migrant rights debate", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "Boston and Skegness MP calls on Government to ‘treat people like people’ during EU migrant rights debate", "spam_score": 0.0, "site_type": "news", "published": "2016-10-20T18:43:00.000+03:00", "replies_count": 0, "uuid": "9eedd4ecb10dc37cbfa9f1415f3e2b44d4a7a6f7"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/boston-and-skegness-mp-calls-on-government-to-treat-people-like-people-during-eu-migrant-rights-debate-1-7638017", "ord_in_thread": 0, "title": "Boston and Skegness MP calls on Government to ‘treat people like people’ during EU migrant rights debate", "locations": [], "entities": {"persons": [{"name": "matt warman", "sentiment": "none"}, {"name": "warman", "sentiment": "none"}, {"name": "joanna cherry", "sentiment": "none"}, {"name": "matt warman daniel jaines", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "lithuania", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "latvia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "skegness", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "policy exchange", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "scottish national party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boston and Skegness MP calls on Government to ‘treat people like people’ during EU migrant rights debate Boston and Skegness MP Matt Warman Daniel Jaines Have your say \nThe MP for Boston and Skegness has told ministers in the House of Commons that ‘When we get immigration wrong, we divide our country, we divide our towns and we foster radical parties that bring out the worst in good people’. \nMatt Warman was speaking yesterday (Wednesday) during a debate on the Rights of EU Nationals following the Brexit results, which had been put before the house by the shadow Scottish National Party spokesman Joanna Cherry. \nDuring the debate Mr Warman said: “It is with some trepidation that I rise to speak in this debate; my constituency has seen, proportionally, more EU migration than any other in the country. Drawn by the UK’s relatively high minimum wages, literally tens of thousands of people have come from Poland, Latvia, Lithuania and elsewhere to Boston and to Lincolnshire more generally in search of better lives, more money and greater prospects. \n“They were drawn here by the rights mentioned in this debate today. They may not be able to vote for us in this House, but, as I have said here before, we should all be keenly aware that those people are our constituents wherever they were born and whatever passport they hold. \n“Those new communities are in many cases home to model citizens; head pupils in schools in Boston are now from a diverse range of communities in a way that they were not in previous years. In schools, children show that children treat children equally, whatever their nationality. Done wrong, immigration, wherever it is from, leads to talk of ‘them’ and ‘us’; done properly, ‘them’ becomes ‘us’.” \nMr Warman then went on to give an overview of the role migrant labour plays in Boston’s economy, including agriculture and business - saying that it relies on migrant labour from eastern Europe ‘just as in previous centuries it relied on labour from the midlands, Ireland or Portugal. \nHe said debates in parts of the country had been ‘too shrill, too partisan and frankly sometimes too difficult to attract genuine contributions’. \nHe admitted that Governments ‘of the day’ which had allowed the expansion of Europe to ‘far poorer economies’ had bungled the figures, had not seen the changes coming and had failed to invest in local public services. \nReturning to his own constituency he said: “Today, while Boston still needs the bypass that has been on the drawing board for 100 years, schools have caught up but the NHS has not, and that raises tensions and causes debates such as this. \n“No longer required to have a job before travelling to the UK, many people were tempted by inaccurate representations of life in the UK, and found themselves doing desperately hard work in freezing fields before returning home to a rented room unfit for human habitation in which they were allowed to occupy the bed only when it was their turn. \n“Boston’s work in tackling rogue landlords has been rightly lauded in this House, but migration has worsened a problem that the Government should have foreseen. \n“The consequences of those poor housing conditions has led to tensions, such as street drinking, antisocial behaviour and violent crime. \n“Some Bostonians ask what those add to an historic town that was once a port second only to London.” \nMr Warman said Boston was ‘wrongly’ called the least integrated town in the country by Policy Exchange, which he said did not take into account work which had taken place to tackle issues. However, he conceded ‘t is talking about a real problem’. \nHe asked the Government to seize the ‘host of opportunities’ before them and to ‘depoliticise’ debates such as the one he was speaking in, asking the Government to ‘treat people like people’. \nHe concluded: “When we get immigration wrong, we divide our country, we divide our towns and we foster radical parties that bring out the worst in good people. We end up having debates such as this. \n“There is no easy way to encourage integration, especially when predominantly young men work in my constituency’s fields, largely in groups from their own countries, and go out in their precious leisure time with little motivation to integrate. \n“But if we are to sensibly conclude debates such as this, we should have a care to those concerns just as much as we do to the rights of migrant workers, whether we are speaking of a Briton in Spain or a Lithuanian in Boston. \n“When it comes to today’s motion, I hope that Europe will see the benefits that British people bring to the continent and grant them the right to stay after the UK leaves the EU, and then the UK can do likewise. \n“In many ways, Boston and Skegness’s continued economic growth depends on that reciprocity. That basic equality seems to be uncontroversial; it should be straightforward.” \nThe motion, which asked that the House to ‘recognises the contribution that nationals from other countries in the EU have made to the UK; and calls on the Government to ensure that all nationals from other countries in the EU who have made the UK their home retain their current rights, including the rights to live and work in the UK, should the UK exit the EU’, failed by a vote of 250 ayes to 293 noes. Sign in", "external_links": [], "published": "2016-10-20T18:43:00.000+03:00", "crawled": "2016-10-20T14:11:34.536+03:00", "highlightTitle": ""}