{"organizations": [], "uuid": "3196f11f3732a60c4cd454021a59793fce83713d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11984344.ece/ALTERNATES/s1200/JS101576243.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/what-theresa-mays-britain-new-11989927", "country": "GB", "domain_rank": 21960, "title": "What is Theresa May's Britain - a new global player or a closed shop?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What is Theresa May's Britain - a new global player or a closed shop?", "spam_score": 0.0, "site_type": "news", "published": "2016-10-07T01:00:00.000+03:00", "replies_count": 0, "uuid": "3196f11f3732a60c4cd454021a59793fce83713d"}, "author": "Thom Brooks", "url": "http://www.chroniclelive.co.uk/news/news-opinion/what-theresa-mays-britain-new-11989927", "ord_in_thread": 0, "title": "What is Theresa May's Britain - a new global player or a closed shop?", "locations": [], "entities": {"persons": [{"name": "thom brooks", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "neutral"}, {"name": "theresa", "sentiment": "none"}, {"name": "jonathan", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "powell", "sentiment": "none"}, {"name": "theresa may  either", "sentiment": "none"}, {"name": "enoch powell", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "parliament square", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "durham university", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "durham law school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Durham University's Thom Brooks on how the Government's approach to welcoming the world's talents is mired in contradictions Share Get daily news by email Prime Minister Theresa May \nWe may not know much about what Brexit means, but we know how the Prime Minister is spinning it. \nIn her first Conservative Party conference keynote speech as leader, Theresa May attempted to claim a mandate for her policies on the back of the EU referendum result. \nI’m unsure that any voter wanting to leave the EU was voting for a return to grammar schools – but political speeches aren’t known for always being logical or well thought out. \nThere are other examples. Brexit campaigners argued that being in the EU limited Britain’s horizons. We should be open to the world and engage the globe. Or so they said. \nAmber Rudd, the new Home Secretary who takes over in May’s former job, said that firms should be named and shamed in lists of how many of their employees are foreign. Made in Britain isn’t good enough if not created by British hands. \nSo then which is it: is Brexit Britain a new global player open to the world’s best and brightest or a closed shop where foreigners need not apply? It’s telling that within hours Rudd backed down from a bad idea. Of course, everyone should be able to pursue a range of opportunities. Full employment for all is a mantra of many a political party both right and left. \nBut if employers aren’t doing what government wants we must ask why. Some point to undercutting wages through exploiting foreign workers. The answer there is simple: to get the law right on standards – and enforce it. If the government can’t ensure the minimum wage is paid, then it is partly to blame. \nOthers say highly skilled migrants bring benefits to our economy in starting businesses and creating jobs. Yet if local people lack the skills and employability that others have abroad then government is again partly to blame for failing to invest properly in education and vocational training to get the balance right. Prime Minister Theresa May \nEither way, I say ‘partly to blame’ because we have responsibilities too. Government policy can create incentives, but we make our choices. It’s not the fault of any minister that some firms will try to undercut lawful wages and conditions – but this should be made as close to impossible as reasonably achievable. \nThere is more. We also heard from May and Rudd that the net migration target will be kept – and the usual sad song that somehow ‘mass immigration’ is all Labour’s fault. \nThis is a big nonsense. Yes net migration rose far more quickly than predicted, but May and Rudd – along with a compliant press – happily overlook the fact that net migration under Tory-led governments since 2010 have all been higher year after year than at any time under Labour. \nIf net migration is your idea of a good indicator of how bad immigration is, then it’s never been worse than with Theresa May looking after it. The facts speak for themselves. \nIt need not be like this. Net migration counts everyone coming in or out of the UK for 12 months or more. It captures a group of people that most of us wouldn’t call ‘migrants’. \nFor example, over 80,000 people included in net migration are British citizens returning from gap years or working abroad. That’s right – British citizens. You and me. British Prime Minister Theresa May leaves 10 Downing Street \nWhen we talk about all the migrants coming here that must be stopped so we can ‘take back control’, which of us has in mind our fellow citizens as targets? And it’s true that if fewer British citizens came home to the UK then net migration would be much less. \nInternational students are another large group counted in migration statistics. In his ‘Rivers of Blood’ speech – political rhetoric not normally associated with liberal views on immigration – Tory MP Enoch Powell made clear who he thought was or was not a migrant. Speaking of foreign students, Powell says (and I quote): “They are not, and never have been, immigrants”. When the Prime Minister is to the right of Enoch Powell on immigration, something has gone terribly wrong. \nIn public opinion studies, there is a pattern: just about none of us think about our fellow citizens or foreign students as migrants to be controlled and sent away. The government’s net migration target could be almost cut in half if they were both removed from it. And why not? \nThere are two clear benefits. First, scaremongering headlines would be seen for what they are. The real numbers aren’t anything like what we often hear. \nSecondly, we would have a figure that more accurately captures what the public understands as migrants in a common sense way. \nBut there is also a third benefit. We can see more clearly what is to be done – and the control we have under existing rules. All foreign students require visas to study here – full control is in hand. About half that is left are non-EU citizens that all require visas too. We have full control there. So that’s just about everybody, we have full control and no Brexit necessary. Jonathan Brady/PA Wire Remain supporters gather in Parliament Square, London, to take part in the March for Europe rally to to show their support for the European Union in the wake of Brexit \nThere remain a sizeable EU citizenry that come to Britain, but the ‘free’ movement rules are just that – rules. And all rules have conditions. The problem in Britain is how poorly they are enforced, not that they are no rules to be enforced. \nFor example, EU citizens only have a right to come for work or study for a few months. If they cannot find something and lack prospects of securing work or study, they can be expelled in six months. Just like Americans or Chinese nationals get six months to be a tourist. Again, there are rules but they are not always enforced or easy to enforce. \nNone of this stopped Amber Rudd promising to do something about immigration by going after students and limiting their opportunities. This won’t address the issue – maybe net migration will go down, but it won’t be less of who the public views as migrants. \nAnd it plays a dangerous and destructive game that we are not all in this country together. The government has more control than it admits – and so should held more responsible than it is for the situation we find ourselves in. \nMay cannot have her cake and eat it. If Britain is open to the world’s greatest talents, then it shouldn’t also shame firms from hiring them or preventing our universities from teaching them. It’s all lofty rhetoric, but lacking in logic and even some common sense. That’s not the fault of voters – nor those in favour of Brexit. But it is the fault of May’s Tory party. If she is to lead a one nation vision, I think it’s time she took a second look. \nThom Brooks is Head of Durham Law School and author of Becoming British (Biteback 2016) \n@thom_brooks", "external_links": [], "published": "2016-10-07T01:00:00.000+03:00", "crawled": "2016-10-06T20:19:43.991+03:00", "highlightTitle": ""}