{"organizations": [], "uuid": "d5d1d389e132046631d1b87dd783827e5330b0e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11411170.ece/ALTERNATES/s1200/JS50879562.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-record-results-12007002", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Record results at Vertu, plus union's fears for Nissan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Record results at Vertu, plus union's fears for Nissan", "spam_score": 0.0, "site_type": "news", "published": "2016-10-12T15:20:00.000+03:00", "replies_count": 0, "uuid": "d5d1d389e132046631d1b87dd783827e5330b0e3"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-record-results-12007002", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Record results at Vertu, plus union's fears for Nissan", "locations": [], "entities": {"persons": [{"name": "robert forrester", "sentiment": "none"}, {"name": "andrew swaffield", "sentiment": "none"}, {"name": "martin deboo", "sentiment": "none"}, {"name": "gavin darby", "sentiment": "none"}, {"name": "vertu", "sentiment": "none"}, {"name": "sharwood", "sentiment": "none"}, {"name": "schwartz", "sentiment": "none"}, {"name": "len mccluskey", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}, {"name": "julio bruno", "sentiment": "none"}], "locations": [{"name": "vertu", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "porto", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "greybull", "sentiment": "none"}, {"name": "lisbon", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "shoreditch", "sentiment": "none"}], "organizations": [{"name": "oxo", "sentiment": "negative"}, {"name": "premier foods", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "greybull capital", "sentiment": "none"}, {"name": "coreena ford airline monarch", "sentiment": "none"}, {"name": "cadbury", "sentiment": "none"}, {"name": "civil aviation authority", "sentiment": "none"}, {"name": "nissan qashqai", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "jefferies", "sentiment": "none"}, {"name": "caa", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "vertu motors", "sentiment": "none"}, {"name": "mccormick & company", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "mercedes-benz", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "time out", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "vertu  motor", "sentiment": "none"}, {"name": "coreena ford time out", "sentiment": "none"}, {"name": "companies house", "sentiment": "none"}, {"name": "nissan sunderland", "sentiment": "none"}, {"name": "bisto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8.49 Coreena Ford It's not all gravy at Premier Foods. . . \nOxo and Ambrosia firm Premier Foods has warned over first-half profits after last month’s unexpected heatwave dented demand for its gravy and puddings. The group - which also owns Bisto, Sharwood’s and Mr Kipling cakes - revealed that sales in its grocery arm tumbled by 9.5% in its second quarter to October 13. \nPremier said gravy and stocks sales were among the worst hit, dropping by 13%, while dessert sales were 9% lower in the quarter. \nThe group said half-year trading profit was now expected to be slightly lower than a year earlier after the September blow left overall first-half sales down 1.8%. \nFull-year sales are now expected to grow by a more muted 1% to 2%, but Premier said a tight rein on costs was set to keep annual profits in line with expectations. \nPremier chief executive Gavin Darby said: “We are disappointed that our grocery business reported materially lower sales in the quarter due to warmer weather; particularly in September.” \nPremier, which fought off takeover attempts earlier this year by Schwartz spice US owner McCormick & Company, said that, while September was the second equal warmest on record, every week in its second quarter was warmer than a year earlier. \nBut strong demand for new Cadbury cake Amaze Bites and its Cake On The Go range helped drive a 6.4% rise in sales of sweet treats in the second quarter, while Premier’s international business also performed well, with a 13% sales lift. \nPremier launched Cadbury cake ranges in the United Arab Emirates for the first time towards the end of the quarter. \nMartin Deboo, analyst at Jefferies, said: “An unseasonably cold winter could still put things to rights. But September’s heatwave was one that Premier Foods and its shareholders could have done without.” Bisto...not so in demand in warm weather apparently 8.43 Coreena Ford Time Out food market plans announced \nMedia group Time Out is to bring its popular food market to London’s trendy Shoreditch area as it looks to expand following its junior stock market flotation in the summer. \nThe company said it has signed a conditional lease agreement for 106 Commercial Street for Time Out Market. \nThe location is expected to have a footprint of 19,250 sq ft, housing 17 restaurants as well as a cooking academy, four bars, one shop and an art gallery. \nIt is expected to open in the second half of 2017 and the market aims to build on the success of its Lisbon operation, which attracted 1.3 million visitors in the first half of the year. \nChief executive Julio Bruno said: \nThis is not only one of the world’s most vibrant and exciting cities, but also the birthplace of our iconic brand. Opening a Time Out Market here is an incredible milestone for our brand and our growth strategy. \nTime Out has expanded from a listings magazine into a global digital media and e-commerce group in recent years. It also has plans for food markets in Porto and New York. 8.37 Coreena Ford Airline Monarch secures £165m investment \nMonarch has secured a £165 million cash injection from its owner, Greybull Capital, allowing it to retain its licence to operate. \nThe airline had faced a midnight deadline to secure fresh funding or risk being unable to renew its Atol licence. \nThe group has just announced that, alongside the investment - the biggest in its 48-year history - Monarch would take delivery of the first of 30 Boeing 737 MAX-8 aircraft in 2018. \nThe company’s future had been cast into doubt over the past weeks, with Monarch forced to deny “negative speculation” that it was in financial trouble. \nA further extension of the Atol licence by the CAA was dependent on fresh funding. \nThe scheme compensates travellers in full and ensures they are not stranded if a holiday company collapses. Monarch will now be able to sell package holidays. \nGreybull acquired a controlling stake in Monarch in 2014, but the group has struggled financially. The firm booked a £19.2 million pre-tax profit in the 12 months to the end of October 2015 following a £57.3 million loss a year earlier, according to accounts filed at Companies House. \nChief executive Andrew Swaffield said: \nIt is testament to the extensive effort by all parties, over the past weeks and months, that we are able to announce the largest investment in our 48-year history, as well as the renewal of our Atol licences. \nI’d like to thank the Civil Aviation Authority, our shareholders, partners, loyal customers and the team at Monarch for helping us to achieve this successful outcome. We are now firmly focused on the future as a stronger Monarch. A Monarch plane landing 8.32 Coreena Ford Nissan jobs are 'hanging by a thread' over Brexit, Unite warns \nInvestment decisions at Nissan which could affect thousands of North East jobs are “hanging by a thread” as the UK car industry waits for the outcome of Brexit negotiations, a report is warning. \nThe Unite union said hundreds of thousands of automotive and manufacturing jobs would be at risk unless the Government secures tariff-free access to the European single market. \nA study by the union said key investment decisions on 15 new models made in the UK – including a number of new Nissan models – were due over the next five years. \nNissan employs nearly 7,000 people at its Sunderland plant with a further 20,000 in the supply chain, while an automotive park planned close to the plant could further boost job numbers in that sector. \nLast month Nissan chief executive Carlos Ghosn called for guarantees from the Government on future trade, including compensation in case tax barriers are raised as a result of the UK leaving the European Union. \nThe company’s Sunderland factory has to beat other plants in the Nissan-Renault alliance to win the production of each new model, and increased tariffs on exports would seriously damage its competitiveness with other factories in Europe. \nUnite general secretary Len McCluskey said: “The UK car industry is the most productive in the EU. Yet the uncertainty of Brexit could seriously compromise the continued resurgence of this world-class industry. \n“Dozens of decisions, including new models to UK plants, must be made in the coming months.” The new Nissan Qashqai is produced on the assembly line at the Nissan Sunderland plant 8.30 Coreena Ford Record revenues and profits at Vertu \nMotor retailer Vertu has posted impressive growth in revenues, profits and gross margins as its continues its “buy and build” strategy. \nThe Gateshead headquartered firm said record half-year trading in the six months to August 31 2016 was driven by improvement in recently acquired businesses, a strong used car performance and growth in higher margin service area. \nIts growth strategy also progressed with a greater premium mix, including additions of Mercedes-Benz and Toyota franchises to Group \nThe firm, which now has 129 sales outlets at 107 locations across the UK posted record pre-tax profit up 14.0% to £18.7m on revenues of £1.454bn, and increase of 17.7%. \nThe group raised £35m in March 2016 to finance further acquisitions and the majority of funds has now been deployed. \nThe interim dividend is up 11.1% to 0.50p per share. \nRobert Forrester, chief executive, said: \nIn the first six months of trading, our proven growth strategy has delivered a record set of results with increased revenues, gross margins and profits. \nWe have continued to successfully grow the business, through both organic growth and the acquisition and integration of premium franchises, as we seek to build a balanced portfolio. \nConsistent delivery of an outstanding customer experience continues to be a strong driver of the growth of dealership performances across the Group. This is demonstrated by the growing number of customers retained into the Group’s aftersales businesses. \nThe outlook for the remainder of the year remains positive, underpinned by low interest rates and record high levels of employment in the UK economy. The Group’s trading performance in the key September plate change month was strong. The Board anticipates that the Group’s full year results will be in line with market expectations. Robert Forrester, CEO of Vertu Motors", "external_links": [], "published": "2016-10-12T15:20:00.000+03:00", "crawled": "2016-10-12T10:55:31.825+03:00", "highlightTitle": ""}