{"organizations": [], "uuid": "7a56363230493b6ecfbc87f85582dddd4797f9b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12043924.ece/ALTERNATES/s1200/JS87471198.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/bellway-issues-brexit-warning-despite-12043793", "country": "GB", "domain_rank": 21960, "title": "Bellway issues Brexit warning despite posting record revenues", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Bellway issues Brexit warning despite posting record revenues", "spam_score": 0.0, "site_type": "news", "published": "2016-10-18T23:20:00.000+03:00", "replies_count": 0, "uuid": "7a56363230493b6ecfbc87f85582dddd4797f9b6"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/bellway-issues-brexit-warning-despite-12043793", "ord_in_thread": 0, "title": "Bellway issues Brexit warning despite posting record revenues", "locations": [], "entities": {"persons": [{"name": "ted ayres", "sentiment": "none"}, {"name": "john watson", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bellway", "sentiment": "negative"}, {"name": "bellway homes  north east", "sentiment": "none"}, {"name": "bellway homes", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "numis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bellway issues Brexit warning despite posting record revenues 16:20, 18 Oct 2016 Bellway's revenues rose to £2.24bn in its seventh successive year of growth, but the firm said uncertainty could yet affect the sector Share Get business news by email Bellway Homes \nNorth East housebuilder Bellway has posted record results for a seventh year in a row but sounded a warning note about the affect of Britain leaving the EU . \nThe Newcastle firm saw revenues rise 26.9% to £2.24bn and annual profits increased 40.6% to £497.9m, but chief executive Ted Ayres sounded a note of caution that leaving the EU could yet affect the construction sector . \nBellway said it sold 8,721 homes, which is 12.5% higher than the previous year, with nearly a third bought through the Government’s Help to Buy boost for first time buyers. \nThe launch of Help to Buy London in February, which has a higher equity loan ratio, saw 39% of reservations of homes in the capital made using the scheme, according to Bellway. \nAnd while the EU referendum had caused some jitters over the economy, the company’s reservations remained higher year-on-year, up 13% since the Brexit vote until its year-end. \nInterest rate cuts and moves by the Bank of England to bolster borrowing following the vote to quit the EU should keep supporting the property market, the group added. Ted Ayres, Bellway Homes' chief executive \nHowever, uncertainty remains, said Ted Ayres. \nHe said: “We can only go from what we are witnessing in the market place, but after 2008 we have to remain mindful. We have talk of Brexit and soft-Brexit, but no one really knows what it means. \n“Latest inflation figures have been released and there is a suggestion that it could go up by 2-3% next year – will that impact upon people’s willingness to buy? Possibly, possibly not. \n“And will Brexit lead to job losses, and will that impact upon people’s choices? \n“We are still in that sweet spot, but we would be stupid not to think that within 12 months there won’t be a sting in the tail, otherwise all the advisors in London will have got it horribly wrong, so we will get some twists and turns along the way. \n“Post-Brexit result London has been all-consuming, but further North – and the North East is our stronghold – it is incredibly positive, and so it’s business as usual. All we can do is remain confident.” \nBellway’s results came as official figures also showed UK house prices shrugged off the Brexit vote, rising by 8.4% in the 12 months to August to £219,000 - up by 1.3% on the previous month. \nWeekly reservations at the business remained robust in the first nine weeks since its year-end, up 9% year-on-year at 162, which is only slightly lower than the 10% growth rate seen in the past financial year. \nChairman John Watson added: “The long term outlook continues to be positive, supported by strong customer demand, a substantial forward order book and favourable trading conditions across all areas of the country where Bellway operates. \n“Whilst there is some uncertainty following the result of the EU referendum, trading since that date has remained resilient.” \nAnalysts at Numis said Bellway had delivered “another solid set of results”. \nIt is pencilling in another 3% rise in selling prices of Bellway homes over the year ahead, with a 4% rise in sales by volume.", "external_links": [], "published": "2016-10-18T23:20:00.000+03:00", "crawled": "2016-10-18T19:01:55.310+03:00", "highlightTitle": ""}