{"organizations": [], "uuid": "8c2f847f6c0f9282bd8000e248d84c3049766d64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12086097.ece/ALTERNATES/s1200/JS54001575.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-secures-7000-jobs-confirming-12086060", "country": "GB", "domain_rank": 21960, "title": "Nissan secures 7,000 jobs by confirming Qashqai will be built in North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan secures 7,000 jobs by confirming Qashqai will be built in North East", "spam_score": 0.0, "site_type": "news", "published": "2016-10-27T18:48:00.000+03:00", "replies_count": 0, "uuid": "8c2f847f6c0f9282bd8000e248d84c3049766d64"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-secures-7000-jobs-confirming-12086060", "ord_in_thread": 0, "title": "Nissan secures 7,000 jobs by confirming Qashqai will be built in North East", "locations": [], "entities": {"persons": [{"name": "qashqai", "sentiment": "negative"}, {"name": "david", "sentiment": "none"}, {"name": "theresa may  mr ghosn", "sentiment": "none"}, {"name": "ghosn", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "carl", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "carlos ghosn  mrs may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "xtrail", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "uk plant", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "yokohama", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan secures 7,000 jobs by confirming Qashqai will be built in North East 11:48, 27 Oct 2016 The new Qashqai will be manufactured at the Sunderland plant and the X-Trail model has also been added to production   The Nissan Qashqai in production in Sunderland \nThousands of North East jobs at Nissan’s Sunderland car plant have been secured after the Japanese giant confirmed the new Qashqai model will be built on Wearside. \nThe company said its decision, securing 7,000 jobs, comes after the Government’s commitment to ensure that the Sunderland plant “remains competitive”. \nCarlos Ghosn, chairman and chief executive of Nissan, said: “I am pleased to announce that Nissan will continue to invest in Sunderland. \n“Our employees there continue to make the plant a globally competitive powerhouse, producing high-quality, high-value products every day. \n“I welcome British Prime Minister Theresa May’s commitment to the automotive industry in Britain and to the development of an overall industrial strategy.” Prime Minister Theresa May \nMr Ghosn met Prime Minister Theresa May last week to discuss ‘assurances’ the company had demanded after Britain voted to leave the EU in June’s referendum. \nThe two met in Downing Street amid concerns about the future of the car giant’s Wearside plant after Brexit. Read More Nissan boss 'confident' UK is competitive after crunch talks with PM over future of Sunderland plant \nAfterwards, Mr Ghosn said: “Since Mrs May’s appointment, we have maintained a clear dialogue with the UK Government during this challenging time. \n“Following our productive meeting, I am confident the Government will continue to ensure the UK remains a competitive place to do business.” \nThe firm said it will also add production of the next X-Trail model at its Sunderland, UK Plant. David Parry/PA Wire Nissan chief executive Carlos Ghosn \nMrs May welcomed the announcement, which came after the firm’s executive meeting in Yokohama, Japan. \nShe said: “This is fantastic news for the UK. Nissan is at the heart of this country’s strong automotive industry and so I welcome their decision to produce the Qashqai and a new model at their Sunderland plant. Read More More than 1,300 Sunderland jobs set for major manufacturing and commercial scheme \n“It is a recognition that the Government is committed to creating and supporting the right conditions for the automotive industry so it continues to grow – now and in the future. This vote of confidence shows Britain is open for business and that we remain an outward-looking, world-leading nation. \n“The Government will continue to work closely with employers and investors in creating a global Britain, a country where there are new opportunities for jobs and rewarding careers. Families across the North East will be delighted at this news today and I share in their enthusiasm for what this means not just for them, but for the whole of the UK”. Carl Court/Getty Images \nBusiness Secretary Greg Clark also welcomed the news, saying: “This is fantastic news for the UK economy, the people of the North East as well as the automotive industry and its supply chain. \n“The UK automotive sector has had a remarkable year - exporting over one million cars around the world and today’s announcement underlines the confidence in the sector. \n“The fact Nissan have not only made a long-term commitment to build the next generation Qashqai and Xtrail at Sunderland, but decided to upgrade their factory to a super-plant, manufacturing over 600,000 cars a year, is proof of the strength of the sector. \n“This is thanks to our highly-skilled workforce, long-term investment in new technology and innovation and the strong partnership between government and industry as we develop together our industrial strategy.”", "external_links": [], "published": "2016-10-27T18:48:00.000+03:00", "crawled": "2016-10-27T14:10:48.623+03:00", "highlightTitle": ""}