{"organizations": [], "uuid": "bc6a19d84af7e38800ccd54c28484b9beb2736c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12034328.ece/ALTERNATES/s1200/161016LHRracismredcard.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/school-children-believe-all-immigrants-12033607", "country": "GB", "domain_rank": 21960, "title": "School children believe 'all immigrants will be sent home' after Brexit anti-racism charity says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "School children believe 'all immigrants will be sent home' after Brexit anti-racism charity says", "spam_score": 0.0, "site_type": "news", "published": "2016-10-17T14:30:00.000+03:00", "replies_count": 0, "uuid": "bc6a19d84af7e38800ccd54c28484b9beb2736c6"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/school-children-believe-all-immigrants-12033607", "ord_in_thread": 0, "title": "School children believe 'all immigrants will be sent home' after Brexit anti-racism charity says", "locations": [], "entities": {"persons": [{"name": "gary bennett", "sentiment": "none"}, {"name": "ron hogg", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "ged gelby", "sentiment": "none"}, {"name": "alan reiss", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "darlington police crime", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "english defence league", "sentiment": "none"}, {"name": "red card", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Campaigners say racism is still a blight on the North East's communities with shocking revelations from inside the region's schools Share Get daily news by email The launch of Show Racism the Red Card's wear red day \nThe shocking level of racism displayed the region’s schoolchildren has been laid bare by charity Show Racism the Red Card. \nSome primary school children believe that ‘immigrants will be sent home’ because of Brexit, the charity has revealed. \nIn some lessons run by the anti-racism organisation children have drawn English Defence League logos and told teachers that they think the UK is being ‘taken over’ by immigrants who ‘only want council houses’. \nLaura Pidcock, North East education manager for Show Racism the Red Card, spoke about the views they come across ahead of Hate Crime Awareness week. \nShe said: “One child said ‘Miss you don’t need to come here and teach us this because we voted to leave so they’re all going home now,’ at the beginning of the lesson. \n“There has been a shift, racism has always existed but there is a move to an openly anti-muslim or anti-immigrant sentiment.” Laura Pidcock, North East education manager for Show Racism the Red Card \nThe shocking comments show the issue of racism in communities across the region. \nAlan Reiss, chief of staff for Durham and Darlington Police Crime Commissioner Ron Hogg said racism is still something that is a blight on communities. \nHe said: “Some of the things these children are coming out with when asked what they think about Islam is really, really shocking. They aren’t getting this from schools they’re getting it from their parents of their friends.” \nThe North East based Show Racism the Red Card teaches anti-racism classes to around 11,000 children every year. \nThe organisation was founded by Ged Gelby 20 years ago who was driven by the level or racism he encountered at football matches in the 1980s and 1990s. Read More How many race hate crimes have taken place in Tyneside since Brexit vote? \nFormer Sunderland player, Gary Bennett, who was the first black person to captain the team has been involved with Show Racism the Red Card for twenty years and often goes on educational visits to schools. \nHe said: “The North East has changed a lot over the years, but still there are some places I go to where I am the first black person these children have ever met or spoken to. \n“Post-brexit a lot of people have got the wrong idea, it is a bit scary to think people are thinking like this. We have to ask where the young people are getting these ideas from and the media does play a role in it. \nThe charity is encouraging workplaces and schools to back its Wear Red Day on Friday October 21, to raise awareness of racism and cash for the charity’s education programmes. \nSee http://www.theredcard.org/ for more details.", "external_links": [], "published": "2016-10-17T14:30:00.000+03:00", "crawled": "2016-10-17T10:10:39.490+03:00", "highlightTitle": ""}