{"organizations": [], "uuid": "5a9216cdb34b17efc221bb48aaaf5e2ccc6a08d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11979476.ece/ALTERNATES/s1200/JS101477654.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservatives-launch-crackdown-illegal-taxi-11979455", "country": "GB", "domain_rank": 21960, "title": "Conservatives launch crackdown on illegal taxi drivers in immigration blitz", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Conservatives launch crackdown on illegal taxi drivers in immigration blitz", "spam_score": 0.0, "site_type": "news", "published": "2016-10-05T15:00:00.000+03:00", "replies_count": 0, "uuid": "5a9216cdb34b17efc221bb48aaaf5e2ccc6a08d3"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservatives-launch-crackdown-illegal-taxi-11979455", "ord_in_thread": 0, "title": "Conservatives launch crackdown on illegal taxi drivers in immigration blitz", "locations": [], "entities": {"persons": [{"name": "jon", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "mrs rudd", "sentiment": "none"}, {"name": "philip hammond  mrs rudd", "sentiment": "none"}, {"name": "athan walker", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}], "locations": [{"name": "birmingham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "icc birmingham  conservatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Conservatives launch crackdown on illegal taxi drivers in immigration blitz 08:00, 5 Oct 2016 By Jonathan Walker Home Secretary Amber Rudd promises huge cuts in immigration during her speech at the party conference in Birmingham Share Comments Get daily news by email Home Secretary Amber Rudd speaks on stage on the third day of the Conservative Party Conference 2016 at the ICC Birmingham \nConservatives are launching a crackdown on immigrant taxi drivers working illegally in the UK, Home Secretary Amber Rudd has announced. \nThe profession was singled out by Mrs Rudd in her speech to the party conference in Birmingham, as she promised to “get immigration under control”. \nNet migration, currently 335,000 a year, would be reduced to “tens of thousands”, she said. \nMrs Rudd said quitting the European Union would mean an end to open-door migration from Europe - but the Government also wanted to cut immigration from the rest of the world. \nAnd she announced a £140m Controlling Migration Fund to help public services in areas with high numbers of immigrants. \nIt’s similar to a policy announced by Labour leader Jeremy Corbyn at his party conference last week. \nSetting out plans to cut immigration, she said: “From December, immigration checks will be a mandatory requirement for those wanting to get a licence to drive a taxi.” \nWhile she didn’t give any explanation of why taxi drivers were being targeted rather than people in any other line of work, the only way the policy makes sense is if the Government believes there is a problem with people who have no right to work in the UK driving taxis. \nOther measures include making it a criminal offence for a landlord knowingly to rent out property to people who have no right to be here. \nAnd banks will have to do regular checks to ensure they are not providing essential banking services to illegal migrants. \nThe Home Secretary announced measures likely to anger employers and universities. \nShe said the Government is to consider tightening the test companies have to take before recruiting from abroad, effectively making it harder for firms to recruit foreign staff. Read More Brexit vote revealed divided society, warns Chancellor Philip Hammond \nMrs Rudd said: “The test should ensure people coming here are filling gaps in the labour market, not taking jobs British people could do. \n“But it’s become a tick box exercise, allowing some firms to get away with not training local people. We won’t win in the world if we don’t do more to upskill our own workforce.” \nAnd she said rules which allow students to work in the UK will be toughened up - for the less prestigious universities. \n“Our consultation will ask what more can we do to support our best universities - and those that stick to the rules - to attract the best talent, while looking at tougher rules for students on lower quality courses.” \nShe insisted: “This Government will not waver in its commitment to put the interests of the British people first. Reducing net migration back down to sustainable levels will not be easy. But I am committed to delivering it on behalf of the British people.", "external_links": [], "published": "2016-10-05T15:00:00.000+03:00", "crawled": "2016-10-05T10:48:25.151+03:00", "highlightTitle": ""}