{"organizations": [], "uuid": "0ecd195caf52c4f45ed60e1c8bd10e760bc60883", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10335610.ece/ALTERNATES/s1200/JS74120135.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/all-star-brexit-committee-north-11964032", "country": "IE", "domain_rank": 21960, "title": "'All star' Brexit committee for the North East vital says influential think tank - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "'All star' Brexit committee for the North East vital says influential think tank - Chronicle Live", "spam_score": 0.054, "site_type": "news", "published": "2016-10-01T13:00:00.000+03:00", "replies_count": 0, "uuid": "0ecd195caf52c4f45ed60e1c8bd10e760bc60883"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/all-star-brexit-committee-north-11964032", "ord_in_thread": 0, "title": "'All star' Brexit committee for the North East vital says influential think tank - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "ed cox - director", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "jeremy middleton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ed cox", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "north east vital", "sentiment": "negative"}, {"name": "northern brexit negotiating committee", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "north east devolution commission", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "nbnc", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "chamber of commerce  responding", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'All star' Brexit committee for the North East vital says influential think tank 05:00, 1 Oct 2016 The region needs a high powered committee to safeguard region's interest in Brexit talks Share Get daily news by email Ed Cox - Director, IPPR North \nThe people of the North East are being invited to choose their ‘all star’ team for Europe. \nHowever it has nothing to do with Newcastle United, Sunderland or Middlesbrough - it is about securing the region’s future in the post Brexit era. \nThe IPPR North think-tank argues that the region needs what it called a Northern Brexit Negotiating Committee (NBNC) to advise the government on Brexit and give it extra clout during negotiations with the EU . \nIn a report out on Saturday it suggests it be made up of the North’s leading politicians, top business people, exporters, importers and innovators, and key public service leaders – and both remainers and leavers. \nAnd as part of the exercise, it is asking the public who they would choose to be on the committee. \nEd Cox, director of IPPR North, said: “Whether it’s top business leaders or trade union leaders, politicians, scientists and innovators or others, we want to hear who should join our “all-star team” for the North. \n“Speaking with a single voice will put the North on par with Scotland and London during the negotiations - and help the government create a Britain that works ‘for everyone’.” \nHis comments followed news this week that Nissan will ask the UK Government to pledge compensation for any extra costs as a result of Brexit before it invests in its Sunderland plant. \nNissan builds around one in three of all of Britain’s total automotive output at Sunderland where it employs nearly 7,000 people. \nCompany boss Carlos Ghosn said: “If I need to make an investment in the next few months and I can’t wait until the end of Brexit, then I have to make a deal with the UK government. \n“You can have commitments of compensation in case you have something negative. If there are tax barriers being established on cars, you have to have a commitment for carmakers who export to Europe that there is some kind of compensation.” Read More Government urged to act on Europe after investment warning from Nissan \nThe IPPR report, ‘Brexit North: Securing a united voice at the negotiating table’, says that from access to the single market for key northern employers like Nissan through to European Union funding for economic development, and with new trading opportunities opening up, the North’s £300bn economy will be significantly affected by Brexit. \nIt says for instance, exporting is likely to be a key priority for the North, with its thriving advanced manufacturing sector trading goods like cars and pharmaceuticals. \nThe IPPR says unlike London, Scotland, Wales or Northern Ireland, the North currently lacks a coherent united voice to articulate its top priorities, the report argues. Jonathan Walker, head of policy and campaigns at the North East England Chamber of Commerce \nResponding to the initiative Jonathan Walker, head of policy at the North East England Chamber of Commerce , said: “It’s vital that the voice of North East businesses is heard during Brexit negotiations. We have some unique assets in the region that will be affected by Brexit and so we must have a seat at the table. \n“However, we also share some common interests with regions across the country. Proposals like this should be welcome, but the Government must commit to getting out across the country and hearing first hand what businesses want from a new relationship with Europe.” \nMeanwhile Jeremy Middleton, chair of the North East Devolution Commission he set up backed by 100 local businesses, said: “It is absolutely essential that the North has a strong, unified voice in the Brexit negotiations, and within this the North East needs its fair share of representation. In our region we have Europe’s most productive car plant, and are we are the only net exporter in the UK, so our voice must be heard. It is possible that voices from other parts of the North, in particular Manchester, which has embraced the Northern Powerhouse more than anywhere else, will monopolise the representation. “ \n•The public can have its say on who it would like in the committee by emailing north@ippr.org with their suggested names by Friday 7 October. ", "external_links": [], "published": "2016-10-01T13:00:00.000+03:00", "crawled": "2016-10-01T07:05:05.491+03:00", "highlightTitle": ""}