{"organizations": [], "uuid": "bbc052446ba2b3564a97e9bf6ecd20e3994e82d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11963210.ece/ALTERNATES/s1200/JS101110115.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farming-subsidies-should-go-environmental-11964373", "country": "GB", "domain_rank": 21960, "title": "Farming subsidies 'should go to environmental schemes', pressure groups say", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Farming subsidies 'should go to environmental schemes', pressure groups say", "spam_score": 0.0, "site_type": "news", "published": "2016-10-01T07:01:00.000+03:00", "replies_count": 0, "uuid": "bbc052446ba2b3564a97e9bf6ecd20e3994e82d3"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/farming/farming-subsidies-should-go-environmental-11964373", "ord_in_thread": 0, "title": "Farming subsidies 'should go to environmental schemes', pressure groups say", "locations": [], "entities": {"persons": [{"name": "martin harper", "sentiment": "none"}, {"name": "steve trotter", "sentiment": "none"}, {"name": "owen", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "greenpeace", "sentiment": "none"}, {"name": "wwf uk", "sentiment": "none"}, {"name": "national trust", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "rspb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farming subsidies 'should go to environmental schemes', pressure groups say 00:01, 1 Oct 2016 By Agency Staff Alliance of conservation charities call for £3bn farm subsidies to be replaced by policies that help nature Share Get business news by email Owen Humphreys/PA Wire A combine harvester in a field \nEuropean Union farming subsidies should be replaced with policies that help nature across the UK countryside, conservation groups have urged. \nThe National Trust , WWF UK, the Wildlife Trusts and the RSPB have set out their vision for the environment after Brexit – calling for support for sustainable farming which produces good food and rewards farmers for protecting the countryside. \nEU subsidies of more than £3bn were paid out last year, most in direct payments to landowners for their land – with an investigation by Greenpeace revealing wealthy aristocrats and a Saudi land-owning prince were among recipients. \nBut across the UK, around three quarters of which is farmed, an estimated 56% of native wildlife species are in decline, experts warn. \nSo conservation organisations want a Brexit rethink on how subsidies are spent, with taxpayer money going to securing public benefits the market does not provide, such as healthy soils and abundant wildlife. \nThey added that, until a post-EU regime is fully in place, all existing wildlife-friendly schemes should be kept open – and an independent commission should be set up to examine the future of policy on the environment, farming and rural development. \nNature should be abundant everywhere, not just in protected areas, they argue – with work to protect species and habitats across whole landscapes. \nThey are also demanding a strong legislative baseline, which they say will safeguard the environment and create a level playing field for farmers, regardless of payments. \nSteps should also be taken to secure more of the profit for farmers in the food and farming sector, and line up policies across areas such as the countryside, health and nutrition, trade and tackling climate change, they suggested. \nThe wildlife and countryside groups want a public debate on the future of policies to look after the countryside as the UK leaves the EU. Steve Trotter, director of the Wildlife Trusts in England, said: “The government needs to be bold and take a radical new approach to the way public payments are used to deliver the things we need from a healthy countryside, like clean water, beautiful landscapes full of wildlife, nutritious food, healthy soils, jobs, room for people to exercise close to nature, as well as practical benefits like reduced flood risk. \n“This is a once in a generation chance to help reverse the huge decline in wildlife and it must not be missed.” \nMartin Harper, RSPB’s director for conservation, added: “We want to work with farmers to realise our shared ambition to restore UK biodiversity within a generation.” \nHe added: “We should grasp this opportunity to secure the future of the countryside and show we can deliver for both nature and farming.”", "external_links": [], "published": "2016-10-01T07:01:00.000+03:00", "crawled": "2016-10-01T02:42:18.994+03:00", "highlightTitle": ""}