{"organizations": [], "uuid": "4d1500a439c003590c827761a94f0a73c274fd3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11967698.ece/ALTERNATES/s1200/JS100730617.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/post-brexit-tory-rhetoric-repugnant-12050765", "country": "GB", "domain_rank": 21960, "title": "Post-Brexit Tory rhetoric 'repugnant' says Newcastle University chief", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Post-Brexit Tory rhetoric 'repugnant' says Newcastle University chief", "spam_score": 0.0, "site_type": "news", "published": "2016-10-20T01:50:00.000+03:00", "replies_count": 0, "uuid": "4d1500a439c003590c827761a94f0a73c274fd3f"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/post-brexit-tory-rhetoric-repugnant-12050765", "ord_in_thread": 0, "title": "Post-Brexit Tory rhetoric 'repugnant' says Newcastle University chief", "locations": [], "entities": {"persons": [{"name": "chris brink", "sentiment": "negative"}, {"name": "rudd", "sentiment": "none"}, {"name": "chris brink  ms rudd", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "prof brink", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "bologna", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "newcastle university", "sentiment": "negative"}, {"name": "home office", "sentiment": "none"}, {"name": "newcastle university  prof brink", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Vice Chancellor Chris Brink, of Newcastle University, has slammed the government over comments regarding monitoring foreign staff Share Get daily news by email Home Secretary Amber Rudd \nA North East university chief has slammed some of the government’s post Brexit rhetoric as “repugnant” in a stinging attack. \nIt was contained in an internal memo written by Professor Chris Brink, Vice Chancellor of Newcastle University, and distributed to staff in which he took issue with recent government language over immigration. \nProf Brink, who is from South Africa and has spent 10 years at the university, was shocked by Home Secretary Amber Rudd’s comments about monitoring foreign staff. \nSpeaking at the recent Conservative party conference, Ms Rudd said foreign workers should not be able to “take the jobs that British people should do” and announced proposals to make companies publish the proportion of “international staff on their books”. \nProf Brink said: “Personally, I never thought when I came to the UK in 2007 that I would hear a senior UK government minister propose from a public platform that companies, and presumably by extension universities, should monitor and report on their numbers of non-UK employees . Joe Giddens/PA Wire Prime Minister Theresa May \n“I find the thought that we should do so repugnant. \n“It is contrary to the idea that a university is a community of learning, open to all who have the ability and the wish to participate and benefit from it.” Read More Monday Interview: Newcastle University vice-chancellor Prof Chris Brink \nMs Rudd’s comments provoked howls of outrage and the government quickly changed tack. It later announced that companies will not be made to publish the data, that it would be confidential and instead used by the government to identify skills shortages, rather than to “name and shame” businesses that rely on foreign employees. \nAt the same conference, Prime Minister Theresa May also sparked controversy with her comment: “If you believe you’re a citizen of the world, you’re a citizen of nowhere. You don’t understand what the very word ‘citizenship’ means.” \nProf Brink said: “I disagree. I would submit that giving your loyalty to a second country, and making a contribution to its progress and success, is not dissimilar to having a second child: you do not halve your love, you double it. \n“We will continue to work for the idea that a university has, in its very being and purpose, an international aspect, as it has had since medieval days when wandering scholars commuted between Bologna and Paris and Oxford. We will continue to welcome and support, to whatever extent we can, pre- and post-Brexit, an international academic body.” \nAnd, in another barbed comment in his memo, he said: “And we would do well to keep in mind that most universities will outlast most governments.” Professor Chris Brink, Vice Chancellor of Newcastle University \nProf Brink is to retire from his post in December although we understand his comments have been endorsed by the university, which since Brexit has been working hard to reassure staff from the EU and EU students who plan to study at Newcastle. \nA Home Office spokesperson said: “ \nThis is not about listing foreign workers or so-called “naming and shaming” of companies. \n“The proportion of international workers in a company is one of the pieces of information that companies may be asked to provide to the Government. \n“This information will not be published. This already happens in the US and is one of several proposals we will be consulting on as part of our work to ensure that companies take reasonable steps to recruit at home before looking to bring in workers from abroad. \n“The purpose of having a consultation is so that we can listen to business and use that feedback to inform our decisions.” More on the EU Referendum", "external_links": [], "published": "2016-10-20T01:50:00.000+03:00", "crawled": "2016-10-19T21:03:28.952+03:00", "highlightTitle": ""}