{"organizations": [], "uuid": "6632d935e91592cc8891212b79ec437e845d3833", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12088483.ece/ALTERNATES/s1200/JS103417714.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-jobs-boost-politicians-business-12088466", "country": "GB", "domain_rank": 21960, "title": "Nissan jobs boost: Politicians and business figures react to post-Brexit jobs news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan jobs boost: Politicians and business figures react to post-Brexit jobs news", "spam_score": 0.0, "site_type": "news", "published": "2016-10-27T23:00:00.000+03:00", "replies_count": 0, "uuid": "6632d935e91592cc8891212b79ec437e845d3833"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-jobs-boost-politicians-business-12088466", "ord_in_thread": 0, "title": "Nissan jobs boost: Politicians and business figures react to post-Brexit jobs news", "locations": [], "entities": {"persons": [{"name": "sharon hodgson", "sentiment": "none"}, {"name": "nigel mills", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jonathon arnott", "sentiment": "none"}, {"name": "julie elliott", "sentiment": "none"}, {"name": "iain malcolm", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "westminster hall", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "european parliament", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "the city council", "sentiment": "none"}, {"name": "entrepreneurs’ forum", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "north east automotive association", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "sunderland west", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nissan-renault alliance", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "neaa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan jobs boost: Politicians and business figures react to post-Brexit jobs news 16:00, 27 Oct 2016 The announcement has been enthusiastically welcomed but questions about government strategy persist   Owen Humphreys/PA Wire Workers at Nissan working on the Qashqai in Sunderland, as the car giant has decided to build its next Qashqai SUV at the factory, securing thousands of jobs \nThe news that 7,000 jobs at Nissan’s Sunderland plant have been secured has been met with delight by politicians and business figures. \nThe decision to maintain and expand production, which will also create new jobs on top of the ones it will save, represents a major boost to the region’s economy. \nA Nissan spokesperson confirmed that new jobs would be created but could not say how many at this early stage. \nNot only will the Qashqai continue to be produced in Sunderland , a new model, the X-Trail SUV, will also be made at the plant. \nHowever, some have raised questions about the nature of the deal between Nissan and the government. \nNissan is a major part of Sunderland’s economy and has invested £3.7bn in the area to date. \nThe plant has produced more than 2 million Qashqai’s in less than 10 years, most of which are exported abroad. \nA further 28,000 people are employed in the supply chain associated with car production. \nJulie Elliott, MP for Sunderland Central , welcomed the news. \nShe said: “I wholeheartedly welcome the announcement that Nissan has decided to build the new Qashqai and X-Trail models at their Sunderland plant. \n“The hard work of the thousands of people working at Nissan and in the supply chain has once again been rewarded. \n“Let us celebrate this news.” A Nissan Qashqai \nHowever, she urged caution when in terms of the wider economic picture: \n“We must not, however, lose sight of the fact that tens of thousands of jobs in manufacturing are still at risk in our region because of the Government’s failure to give clarity regarding the future of our trading relationship with the EU. \n“The Prime Minister needs to act now to secure the future of UK manufacturing.” \nBut Jonathon Arnott, a UKIP member of the European Parliament, used the announcement to attack those who have been pessimistic about the UK’s future outside the EU. \nHe said: “I wonder how long it will be before we hear the words ‘despite Brexit’ from those naysayers and doom-mongers who downplay every success and magnify every failure in an attempt to sabotage the will of the people and British prosperity. \n“They were not slow to try to weaponise Nissan in their fight against the referendum result and this is one in the eye for them. \n“They ought to reflect upon the jeopardy in which they place British jobs when they do so. \n“This news is not just good news for the North East but the whole country as I have no doubt that the confidence shown by Nissan will be reflected by other companies.” Read More Nissan investment shows Brexit can work - but what did we offer in return? \nBridget Phillipson , MP for Houghton and Sunderland South, praised Nissan’s workforce and welcomed the decision but raised questions about the Prime Minister’s strategy. \nShe said: “Nissan have been clear that this decision follows the UK government’s commitment to ensure that the Sunderland plant remains competitive, but have not indicated exactly what guarantees the Prime Minister has offered to protect the company from the impact of Britain’s decision to leave the EU, and potentially the single market as well. \n“As I mentioned during a Westminster Hall debate in Parliament this week, it is imperative that the government also offers protection to the small and medium sized businesses in the Nissan supply chain and the wider manufacturing sector in the north east and beyond.” \nNissan have previously been publicly sceptical about Brexit and there had been fears they might scale back production in Sunderland. \nThere has been speculation about what sort of deal the government have privately struck with Nissan throughout the day. \nBut the news was welcomed by the North East Automotive Association, the UK’s largest network of companies involved in the sector. \nAn NEAA spokespersons said: “Nissan’s announcement is fantastic news for the North East automotive sector. \n“Not only will it secure the 7,000 jobs within Nissan, it will secure the many thousands of jobs within the supply chain throughout the UK. \n“It is testament to the excellence of the Nissan employees and the supply chain that the Sunderland plant has been able to secure this investment ahead of increased competition from within the Nissan-Renault Alliance. \n“The Qashqai is the UK’s most successful UK built vehicle and was designed, developed and produced in the UK. One Qashqai is being produced every 62 seconds at the Sunderland plant. \n“The additional announcement that the X-Trail will also be produced is an excellent addition to the Sunderland plant and will open up many more opportunities for the UK automotive sector.” Read More Nissan secures 7,000 jobs by confirming Qashqai will be built in North East \nNigel Mills, chairman of the Entrepreneurs’ Forum, said: “This is great news for Sunderland and the wider North East. \n“It does not just have a positive effect on Nissan and its employees, but also the entrepreneurial businesses in its supply chain and their staff.” \nIn terms of local councils, the news received a predictably warm reception and boosted plans for further investment in the automotive industry. \nSunderland City Council leader, Paul Watson, said: “Today’s announcement is a major vote of confidence in Sunderland as a centre of global excellence in automotive manufacturing. \n“The announcement not only helps secure 7,000 jobs, but will also see the plant upgraded. \n“It’s a huge tribute to their excellent workforce and to Sunderland’s position as a ‘jewel in Nissan’s crown’. Read More Nissan to build new Qashqai in Sunderland: Reaction as 7,000 jobs are secured and more to come \n“The City Council and many others across the North East region have been working closely with the company to make sure they were best placed to compete for the Qashqai replacement. \n“The Government, too, has been speaking with Nissan about how the UK’s economy remains competitive and efficient.” \nReacting to the news, Sharon Hodgson, MP for Washington and Sunderland West , said: “The announcement today that Nissan has decided to base the production of their new Qashqai and X-Trail SUV here in Sunderland is fantastic news and shows that not only have Nissan got confidence to continue investing in our region but most importantly, reinforces Nissan’s continued faith in the skilled and highly capable workforce based at the plant. \n“Credit must go to the workforce at the Nissan factory for their continued hard work in producing such high-quality cars, where nearly 80% of the cars rolling off the production line in Sunderland are exported across the globe. The talent and skill of Sunderland’s workforce is showcased across the world and puts Sunderland very squarely on the map as somewhere for businesses to come and invest. \n“It is welcome that this announcement will secure 7,000 jobs at the plant and it is up to the Government to ensure that this news is not squandered by jeopardising it with an unclear Brexit strategy. Clarity is still very much needed on what will happen to our automotive industry as we continue down the path of exiting the European Union. \n“Nissan is such a vital contributor to our regional economy but also our national economy, along with supporting such a large workforce totalling over 48,000 employees by Nissan directly and in the supply chain. This news should be welcomed by all and is a moment for the North East to celebrate some good news for our region’s much-needed economic growth and job creation.” \nThe news is doubly pleasing to Sunderland City Council as it allows them to go forward with the International Advanced Manufacturing Park. \nThe joint venture with South Tyneside Council is a plan to build an industrial zone to help support Nissan and attract other automotive jobs. \nSouth Tyneside Council leader, Iain Malcolm, said: “The park is expected to create more than 5,000 highly skilled jobs in the first phase, and build on our track record for manufacturing and exports.”", "external_links": [], "published": "2016-10-27T23:00:00.000+03:00", "crawled": "2016-10-27T18:19:53.467+03:00", "highlightTitle": ""}