{"organizations": [], "uuid": "e07782447fef72d62c576d4c5e55c56ed8384958", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12046978.ece/ALTERNATES/s1200/JS97337473.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/post-brexit-fall-jobless-total-12046914", "country": "GB", "domain_rank": 21960, "title": "Post-Brexit fall in jobless total in North East - but there's still 'more to do'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Post-Brexit fall in jobless total in North East - but there's still 'more to do'", "spam_score": 0.0, "site_type": "news", "published": "2016-10-19T18:29:00.000+03:00", "replies_count": 0, "uuid": "e07782447fef72d62c576d4c5e55c56ed8384958"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/post-brexit-fall-jobless-total-12046914", "ord_in_thread": 0, "title": "Post-Brexit fall in jobless total in North East - but there's still 'more to do'", "locations": [], "entities": {"persons": [{"name": "nick palmer", "sentiment": "none"}, {"name": "damian hinds", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Post-Brexit fall in jobless total in North East - but there's still 'more to do' 11:29, 19 Oct 2016 Despite a drop in the number of people looking for work, the region's unemployment rate of 6.8% is still the highest in the UK Share Get daily news by email Philip Toscano/PA Wire A Job Centre Plus \nUnemployment fell in the North East in the post-Brexit period from June to August, it has been revealed. \nThe drop goes against a national rise in the figure, published by the Office for National Statistics (ONS) on Wednesday. \nThe ONS said the jobless total in the region fell to 88,000 in the last quarter, representing a 0.7% drop. \nHowever, the unemployment rate in the North East stands at 6.8%, still the highest in the UK and almost 2% above the national average of 4.9%. \nEmployment in the region rose 8,000 to just over 1.2m while the claimant count fell slightly by 300 to 50,400. Damian Hinds, employment minister \nEmployment Minister Damian Hinds said: “There’s great news in the North East where the number of people in work has risen by 52,000 over the past year, with over 1.2 million people in work. \n“But there’s more to do, particularly when it comes to supporting young people into employment. \n“We want to build a solid base for the future, that’s why today I have announced the roll out of our Jobcentre Plus Support for Schools scheme in England which will give tens of thousands of young people help in taking their first steps into the world of work.” \nNationally, the jobless total rose by 10,000 in the quarter to August to 1.66 million, the first jump since the turn of the year. \nThe claimant count, including those on Jobseeker’s Allowance, also increased last month - up by 700 to 776,400. It was the sixth time in the last seven months that the figure has increased. \nInterested in North East jobs? Find job vacancy listings across a range of sectors here . \nBut employment was up by 106,000 in the latest quarter to almost 32 million, the highest since records began in 1971. \nThe ONS said its data also showed a 65,000 fall in the number of people classed as economically active, down to a joint record low rate of 21.5%, or 8.8 million. \nONS statistician Nick Palmer said: “These figures show that employment continued to grow over the summer and vacancies remain at high levels, suggesting continuing confidence in the economy. \n“While there was also a small rise in the headline unemployment level, that was accompanied by more people actively seeking work.” Christmas jobs in the North East", "external_links": [], "published": "2016-10-19T18:29:00.000+03:00", "crawled": "2016-10-19T13:54:09.733+03:00", "highlightTitle": ""}