{"organizations": [], "uuid": "3c9ab103913510f8c3c090cfd7e7f1de2f4d4f41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12099268.ece/ALTERNATES/s1200/The-Andrew-Marr-Show.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-agreed-sunderland-deal-after-12099162", "country": "GB", "domain_rank": 21960, "title": "Nissan agreed Sunderland deal after 'tariff-free' access pledge from Government", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan agreed Sunderland deal after 'tariff-free' access pledge from Government", "spam_score": 0.0, "site_type": "news", "published": "2016-10-30T19:11:00.000+02:00", "replies_count": 0, "uuid": "3c9ab103913510f8c3c090cfd7e7f1de2f4d4f41"}, "author": "Craig Thompson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-agreed-sunderland-deal-after-12099162", "ord_in_thread": 0, "title": "Nissan agreed Sunderland deal after 'tariff-free' access pledge from Government", "locations": [], "entities": {"persons": [{"name": "greg clark", "sentiment": "neutral"}, {"name": "ghosn", "sentiment": "none"}, {"name": "greg clark  nissan", "sentiment": "none"}, {"name": "peston", "sentiment": "none"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "owen", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "neutral"}, {"name": "sunderland", "sentiment": "neutral"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Secretary Greg Clark reveals more about the deal done between UK Government and Nissan   Business Secretary Greg Clark \nNissan agreed to pour new investment into its Sunderland plant after receiving assurances the Government was committed to securing continued tariff-free access to EU markets, Business Secretary Greg Clark has said. \nMr Clark said he was able to assure the Japanese car giant that they would be seeking a “constructive and civilised dialogue” with the other 27 member states on the terms of the UK’s withdrawal from the EU. \nMinisters have been under pressure to explain what deal the company was given after chief executive Carlos Ghosn announced it was to build two new models in Sunderland after receiving “support and assurances” from the Government. \nAppearing on BBC1’s The Andrew Marr Show, Mr Clark said: “What I said was that our objective would be to ensure that we would have continued access to the markets in Europe - and vice versa - without tariffs and without bureaucratic impediments and that is how we will approach those negotiations. \n“For the continental European car manufacturers, they export a lot to us, we export a lot to them, components go backwards and forwards. If you conduct the negotiations in a serious, constructive and civilised way there is a lot in common that we can establish. \n“I was able to reassure Nissan - and other manufacturers - that that is the way we are going to approach it.” Andrew Matthews/PA Wire A Nissan car dealership \nMr Clark - who acknowledged World Trade Organisation rules meant the Government could not offer to compensate Nissan if tariffs were imposed - confirmed he had set out the Government’s approach in a letter to Mr Ghosn. \nIt included commitments to continue to make funds available for skills and training, to “bring home” elements of the supply chain which had migrated overseas, to support research and development, and to keep the UK car industry competitive. \n“It is simply not possible to compensate for any future risks so the intention of keeping the sector competitive was important,” he said. \n“In the motor industry we have a very long track record of investment, in skills in innovations and research and development. But these things are independently reviewed, we can’t guarantee them. I hope that they (Nissan) will succeed. They have to apply as companies in the sector have to do.” \nFor Labour shadow Brexit secretary Sir Keir Starmer said the Government still needed to disclose the terms of any deal struck with Nissan. Owen Humphreys/PA Wire Workers at Nissan working on the Qashqai in Sunderland, as the car giant has decided to build its next Qashqai SUV at the factory, securing thousands of jobs \nHe said he intended to seek an urgent question in the Commons on Monday to try and compel ministers to reveal any guarantees they may have given to the car manufacturer. \n“There may be a financial element to it - I accept that. They say no money is changing hands,” he told ITV’s Peston On Sunday programme. \n“I don’t know. We need to know and I’m going to try and raise this in Parliament tomorrow because something has been said. \n“It’s good Nissan are investing, of course it’s good, but there are other businesses up and down the country of every size and every sort that need (reassurance).” Read More Controversy continues around Government support for Nissan \nHe added: “It’s not just this deal that we need to know about - it’s what happens to the other businesses. \n“Businesses are talking to me all of the time and they are very worried about what happens to them. \n“They want to trade on the same terms and if there is a deal that’s good enough for Nissan they are saying, and it’s quite understandable, ‘well, we want broadly the same deal for us’.”", "external_links": [], "published": "2016-10-30T19:11:00.000+02:00", "crawled": "2016-10-30T15:39:18.523+02:00", "highlightTitle": ""}