{"organizations": [], "uuid": "18f0f7ca78ab7f6351a5e96d877fd11f6fecb35c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11984344.ece/ALTERNATES/s1200/JS101576243.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-promises-economic-cultural-revival-11984311", "country": "GB", "domain_rank": 21960, "title": "Theresa May promises 'economic and cultural revival' of Britain's great cities", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May promises 'economic and cultural revival' of Britain's great cities", "spam_score": 0.0, "site_type": "news", "published": "2016-10-05T23:20:00.000+03:00", "replies_count": 0, "uuid": "18f0f7ca78ab7f6351a5e96d877fd11f6fecb35c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-promises-economic-cultural-revival-11984311", "ord_in_thread": 0, "title": "Theresa May promises 'economic and cultural revival' of Britain's great cities", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "jonathan walker change", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May promises 'economic and cultural revival' of Britain's great cities 16:20, 5 Oct 2016 16:20, 5 Oct 2016 By Jonathan Walker Change has got to come - because we live in a country with \"division and unfairness all around\", says the Prime Minister Share Get daily news by email Prime Minister Theresa May \nPrime Minister Theresa May has vowed to lead “an economic and cultural revival of all our great regional cities” to ensure wealth and success is shared fairly across the country. \nIn her speech to the Conservative conference in Birmingham she warned that millions of people across Britain believe the country “works well for a privileged few, but not for them”. \nBut Mrs May insisted: “Change has got to come.” \nThe Government was preparing an industrial strategy to back businesses which would create jobs in the future - such as life sciences, technology, aerospace, car manufacturing, the creative industries and the financial sector. \nAnd it would also look at the strengths of every part of the country, she said. Read More \n“We will identify the places that have the potential to contribute to economic growth and become the homes to millions of new jobs,” Mrs May told her party. \nThe Prime Minister lavished praise on David Cameron, her predecessor as Prime Minister. \nBut she then warned: “Within our society today, we see division and unfairness all around. Between a more prosperous older generation and a struggling younger generation. Between the wealth of London and the rest of the country.” \nAnd she said June’s Brexit vote illustrated the anger and unhappiness of millions of people who “stood up and said they were not prepared to be ignored anymore.” \nHer Government would respond by standing up for the week and standing up to the strong, including businesses that failed to pay a fair share of taxes, she said. \nMrs May promised “to put the power of government squarely at the service of ordinary working-class people”. \nAnd she set out areas where Labour would act, including helping people and small businesses in rural areas get decent broadband services; getting energy customers off expensive tariffs, and building more homes. \nWorkers will get a role on company boards, so that they have a say in how the business is run. \nAnd there will be “enhanced” workers’ rights, “to make sure that, in our modern and flexible economy, people are properly protected at work.” \nMrs May also vowed to press ahead with the HS2 high speed rail line, “linking London and Birmingham and, eventually, towns and cities in the North”. \nAnd she warned rich people who don’t pay their fair share of taxes: “We’re coming after you.” \nThe Prime Minister added: “If you’re an accountant, a financial adviser or a middleman who helps people to avoid what they owe to society, we’re coming after you too.” \nMrs May launched a fierce attack on Labour, calling them “the nasty party” - a phrase she famously used about the Tories back in 2002. \nShe said: “That’s what Labour stands for today. Fighting among themselves. Abusing their own MPs. Threatening to end their careers. Tolerating anti-Semitism and supporting voices of hate.” \nAnd she insisted: “Let us take this opportunity to show that we, the Conservative Party, truly are the party of the workers.” \nNorthumberland Conservative Guy Opperman , MP for Hexham, said the speech was “passionate and patriotic.” \nHe said: “I love that the Prime Minister made it clear that as a country we succeed or fail together. She is right that we achieve or fall short together. \n“When one of us falters, our human instinct is to reach out our hand and help them over the line. There is more to life than individualism and self-interest. \n“This was the Prime Minister setting out her positive mission to change the country for the many not the few.” \nAnne-Marie Trevelyan, MP for Berwick-upon-Tweed , said: “It was a fantastic speech. She summed up why I am in politics. \n“It is about hard work, taking your talents and being given the opportunity to make the best of them. \n“Now we just have to make it happen.”", "external_links": [], "published": "2016-10-05T23:20:00.000+03:00", "crawled": "2016-10-05T18:58:08.029+03:00", "highlightTitle": ""}