{"organizations": [], "uuid": "54709c106f1c368778a5727bcdf62667337dd9c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11968804.ece/ALTERNATES/s1200/JS101305809.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-new-northern-powerhouse-11968588", "country": "GB", "domain_rank": 21960, "title": "Theresa May's new Northern Powerhouse will include the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May's new Northern Powerhouse will include the North East", "spam_score": 0.0, "site_type": "news", "published": "2016-10-03T12:00:00.000+03:00", "replies_count": 0, "uuid": "54709c106f1c368778a5727bcdf62667337dd9c7"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-new-northern-powerhouse-11968588", "ord_in_thread": 0, "title": "Theresa May's new Northern Powerhouse will include the North East", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "carlisle", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May's new Northern Powerhouse will include the North East 05:00, 3 Oct 2016 Prime Minister says she's committed to spreading opportunity across the nation in Chronicle interview Share Get daily news by email British Prime Minister Theresa May \nPrime Minister Theresa May has insisted her Government is still committed to the “Northern Powerhouse”. \nBut she said she wanted to ensure it benefitted cities such as Newcastle and Sunderland. \nIt follows claims that the Northern Powerhouse policy, championed by former Chancellor George Osborne, focused too much on Manchester. \nMrs May was speaking to the Chronicle as Conservatives gathered for their annual conference, taking place in Birmingham. \nShe said she wanted to create an economy “where we see the benefits of growth being spread across the country”. \nHowever the Northern Powerhouse policy, pioneered by former Chancellor George Osborne, had not been abandoned, she said. \nThis was an attempt to turn the North of England into an economic powerhouse on a similar scale to London, partly by improving transport links. \nThere had been speculation that Mrs May considered ditching the scheme. \nBut she said: “We are keeping on with the Northern Powerhouse. I think that’s very important.” \nHowever, her Government also wanted to look for ways of “encouraging that economic growth and prosperity in each area.” \nShe said: “I want to make sure we build on its success and actually ensure we see benefits in parts of the north like Newcastle, Sunderland and Carlisle.” \nOne way in which Theresa May’s government has broken with the past is by developing an “industrial strategy” - something Ministers in David Cameron’s administration argued was unnecessary. \nBut what does this mean in practice? \nMrs May said government was working with business leaders to draw up proposals for economic growth in every area of the country. \n“A lot of detailed work is being done at the moment about different parts of the country and different sectors. \n“It’s looking really to the future and what is the economy we want for the future, as we look ahead to the opportunities that will be available to us when we leave the European Union. \n“Real opportunities for trade around the world. We want to get the right deal for trade with the EU as well. \n“So how can we ensure that we have the right things in place to encourage and develop that economy in the future? \n“That is about the role government plays but obviously working in partnership with industry and business. \n“The responses I have heard so far from businesses are that they are really interested and keen that we produce an industrial strategy.” \nThe Prime Minister defended her plans to open new grammar schools, but insisted there was far more to her reforms than simply expanding selective education. \nShe wanted to raise standards in every state school - and would bring in universities and independent schools to help, she said. \n“Education is absolutely crucial in providing social mobility and ensuring children get the opportunity to go where their talents will take them,” the Prime Minister said. \n“Though we’ve had success in increasing the number of children in good and outstanding schools, if you look at the West Midlands overall there are still over 170,000 children in under-performing schools. \n“So it’s first of all wanting to increase the capacity of the system and have more good school places. That’s why yes, the opportunity to open selective schools is part of this, but we’re also looking at universities taking more of a role in working with schools, the independent sector working more with state schools, and at more faith schools being opened. \n“So it’s about the number of good school places in the system.” \nThe Prime Minister’s school reforms are part of a wider “social reform” agenda - and there will be more to come. \nMrs May said housing was one area she was looking at. \nAnd she linked the need to create “a country that works for everyone” to the EU referendum result , suggesting the Brexit vote was prompted by disillusionment with lack of opportunity in this country as well as scepticism about the European Union . \n“I put education as my first policy because I believe it is absolutely crucial in terms of social mobility . . . but there will be other areas that we will be looking at. Areas of concern. “Because I think that what we heard from people in June 23 was, yes they want to leave the European Union, [but also] they want change. \n“And what I am very clear about is that I want to see a country that works for everyone, not a privileged few. \n“There are other areas where we recognise the concerns people have. Obviously housing is a key issue for a lot of people, so we will look at housing as one of these issues too.” \nLabour leader Jeremy Corbyn told his party to get ready for a general election as early as 2017, when he spoke at Labour’s annual conference in Liverpool. \nBut Mrs May insisted she would not call an election until 2020, the latest date possible. And she appeared to suggest that although she had not yet led the Conservatives to victory in an election, she had a responsibility to stay in office to deliver Brexit following the EU referendum vote. \n“I have said that we shouldn’t have a general election until 2020. \n“There is a good reason for saying that. We had a very clear message from the British people on June 23 [in the EU referendum] about the change that they want to see. \n“We were a government that was elected on a mandate in 2015. we are continuing with that mandate. \n“But this year in June people said there was change they wanted to see. We hear that message clearly and we want to deliver on that. \n“Obviously part of that is delivering leaving the European Union and making a success of leaving the European Union and I believe it is right for the country that we have a period of stability while we do that. \n“I think a general election would introduce instability. \n“So I think there’s a very good reason in the interest of the country [for waiting]. And that’s the crucial thing - this is about what’s right for the country.”", "external_links": [], "published": "2016-10-03T12:00:00.000+03:00", "crawled": "2016-10-03T07:15:25.213+03:00", "highlightTitle": ""}