{"organizations": [], "uuid": "47869ae2d2d0acda08a809eb782a8c12348ac1ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29775576/15594245.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/samworth-brothers-owners-receive-18m-windfall-as-profits-rise/story-29775576-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published Samworth Brothers owners receive £18m windfall as profits...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Lauren_Mills published Samworth Brothers owners receive £18m windfall as profits...", "spam_score": 0.0, "site_type": "news", "published": "2016-10-04T13:30:00.000+03:00", "replies_count": 0, "uuid": "47869ae2d2d0acda08a809eb782a8c12348ac1ff"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/samworth-brothers-owners-receive-18m-windfall-as-profits-rise/story-29775576-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published Samworth Brothers owners receive £18m windfall as profits...", "locations": [], "entities": {"persons": [{"name": "samworth", "sentiment": "none"}, {"name": "alex knight", "sentiment": "none"}, {"name": "knight", "sentiment": "none"}], "locations": [{"name": "spencer", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "samworth brothers", "sentiment": "negative"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "dickinson & morris", "sentiment": "none"}, {"name": "companies house", "sentiment": "none"}, {"name": "samworth brothers samworth brothers", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Samworth Brothers owners receive £18m windfall as profits rise By Lauren_Mills | Posted: October 04, 2016 1 COMMENTS SHARES Walkers Pies are owned by Samworth Brothers Samworth Brothers owners receive £18m windfall as profits rise X \nCopy link to paste in your message / Comments (1) \nThe family owners of Samworth Brothers received an £18 million windfall after profits at the food giant grew by more than a fifth in 2015. \nThe Melton-based maker of Ginsters pasties and Dickinson & Morris pork pies saw profits jump from £36 million in 2014 to £45.6 million last year. \nSamworth, which employs 6,800 people across nine county sites, said turnover rose 7.7 per cent to £901.6 million in the period, according to documents filed at Companies House. \nThe 120-year-old company has expanded rapidly in recent years, opening new factories, acquiring other firms and by growing its business with the UK supermarkets. \nIt supplies sandwiches and ready meals to grocery chains such as Marks and Spencer, Sainsbury's and Tesco. \nSamworth invested almost £32 million in the company last year, taking capital investment over the last five years to £185 million. \nChief executive Alex Knight said: \"It's been a year of investment, which has resulted in improved performance. \n\"We are investing so we can win more business, recruit more staff and secure more jobs and that is the virtuous circle we are trying to create. \n\"We've paid out £4.6 million a year in profit sharing over three years to about 6,500 staff. \n\"We share profits all the way through the organisation to hourly paid workers. \n\"It is only because we are a family company that we can do these things – if we had shareholders they'd want the money.\" \nMr Knight said Samworth recently opened a new innovation centre, called The Source, in Nottingham employing 30 people. \nHe said: \"This is a new product development centre. \n\"The main way for our supermarket customers to succeed is to innovate with their products and we work very closely in partnership with them to try to bring new products to market.\" \nSamworth managed to increase its gross margin in 2015 by 20 basis points, or 0.2 per cent. While this may not sound like much, Mr Knight said it was \"good news\". \nHe added: \"Our gross margin shows how much value we added to the business. \n\"It shows we improved profitability as our sales have grown. Lots of companies grow sales but make less money.\" \nDespite this, Mr Knight warned of challenging times ahead. \nHe said: \"Things are getting tough this year because there's been a sharp rise in raw material prices, in some cases up 30-40 per cent, due to availability. \n\"I think there are multiple factors in play, whether it's Brexit or China or how much money people feel they have, but the reality is it's happening and we are suddenly facing one of the strongest headwinds we have ever had to deal with.\" \nSamworth came under fire earlier this year over controversial pay changes. \nMr Knight said every member of staff had now signed up to the new terms. \nHe said: \"We are not in dispute with any member of staff and pay has either gone forward and nobody's has gone backwards. We rectified every last single case of the 6,500 workers affected. \n\"We are a fourth generation family business built on core values and we have huge \nrespect for everyone who works for us. \n\"We have no zero hours contracts and fantastic terms and conditions and an impeccable record of how we treat people in the business.\" \nHave you signed up to the Leicester Mercury Breakfast Briefing? To receive the latest business stories straight to your inbox click here", "external_links": [], "published": "2016-10-04T13:30:00.000+03:00", "crawled": "2016-10-04T11:38:39.832+03:00", "highlightTitle": ""}