{"organizations": [], "uuid": "09c136b642ac20b4fc0648854e4d991446cb8d41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11448538.ece/ALTERNATES/s1200/JS29893562.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/usiness-live-sales-soar-bellway-12040257", "country": "GB", "domain_rank": 21960, "title": "Business LIVE: Sales soar at Bellway and Utilitywise, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business LIVE: Sales soar at Bellway and Utilitywise, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-10-18T16:12:00.000+03:00", "replies_count": 0, "uuid": "09c136b642ac20b4fc0648854e4d991446cb8d41"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/usiness-live-sales-soar-bellway-12040257", "ord_in_thread": 0, "title": "Business LIVE: Sales soar at Bellway and Utilitywise, plus latest news", "locations": [], "entities": {"persons": [{"name": "coreena ford burberry", "sentiment": "negative"}, {"name": "geoff", "sentiment": "none"}, {"name": "richard laker", "sentiment": "none"}, {"name": "julianne", "sentiment": "none"}, {"name": "kantar worldpanel", "sentiment": "none"}, {"name": "utilitywise", "sentiment": "none"}, {"name": "ted ayres", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "rui vieira/pa wire ryanair", "sentiment": "none"}, {"name": "tom gadsby", "sentiment": "none"}, {"name": "julianne mccorry", "sentiment": "none"}, {"name": "john watson", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "jon kempster", "sentiment": "none"}, {"name": "simon waugh", "sentiment": "none"}, {"name": "michael o’leary", "sentiment": "none"}, {"name": "nick beighton", "sentiment": "none"}, {"name": "carol fairweather", "sentiment": "none"}, {"name": "amaya", "sentiment": "none"}, {"name": "simon", "sentiment": "none"}, {"name": "burberry", "sentiment": "none"}, {"name": "brendan flattery", "sentiment": "none"}, {"name": "julie walters", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "geoff thompson", "sentiment": "none"}], "locations": [{"name": "utilitywise", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "northgate", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "liberum", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "continental europe", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "burberry", "sentiment": "negative"}, {"name": "bellway", "sentiment": "negative"}, {"name": "coreena ford asos", "sentiment": "none"}, {"name": "mecca bingo", "sentiment": "none"}, {"name": "roce", "sentiment": "none"}, {"name": "housebuilder bellway", "sentiment": "none"}, {"name": "liberum", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "centrica", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "ladbrokes", "sentiment": "none"}, {"name": "paddy power", "sentiment": "none"}, {"name": "betfair", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "energy services", "sentiment": "none"}, {"name": "coreena ford bellway", "sentiment": "none"}, {"name": "parvus asset management", "sentiment": "none"}, {"name": "unilever", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "asos", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "coreena ford lower", "sentiment": "none"}, {"name": "rank group", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "coreena ford ryanair", "sentiment": "none"}, {"name": "centrica financial services", "sentiment": "none"}, {"name": "pricewaterhousecoopers llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9.59 Coreena Ford Burberry sales soar, thanks to plunging pound \nFashion firm Burberry has seen UK sales rocket as tourists flocking to London to take advantage of the Brexit-hit pound has sparked a luxury shopping spree. The group said UK like-for-like sales raced more than 30% in the three months to September 30 after the plunging pound has seen overseas shoppers rush to London to snap up luxury goods at a better price. \nShoppers from China and the United States in particular have been travelling to the UK to hit the shops, according to the group. \nIt came as a welcome boost to Burberry and helped the group return to overall sales growth in its second quarter, up 2% against a 3% fall in the previous three months. \nIt said recent further falls in the pound were also now expected to add around an extra £125 million to full-year profits, up from July’s estimate of £90 million. \nCarol Fairweather, chief financial officer of Burberry, said the group was “delighted” with its sales performance in the UK, which accounts for around 15% of group-wide revenues and some 40% for the European region. \nShe said sales to Chinese shoppers in UK stores were up more than 20%, but added that the group also saw a recovery in demand from British shoppers over the summer. \nSales of designer bags were strong in particular, she added, especially Burberry’s new equestrian-inspired satchel, the Bridle Bag. Its second-quarter sales hike marks the group’s first like-for-like growth for a year. \nBut it was not enough to prevent a drop in revenues over the first six months as a whole, down 4% to £1.16 billion with currency effects stripped out. It continued to see an impact from falling tourism in Continental Europe after recent terrorist attacks, while the strong dollar has left sales in the United States lower as shoppers look elsewhere for luxury bargains. \nBurberry added that sales in its wholesale arm dropped by 14%, excluding currency movements, dragged lower by a poor performance in the US and a 20% plunge in revenues across its beauty range. Shares sank 6% as the wholesale revenue hit took the shine off a turnaround in its retail stores. \nBurberry said it was on track to cut costs by around £20 million in the current financial year. \nAnalysts at Liberum cautioned: “Foreign currency benefits aside, Burberry struggles to drive meaningful growth.” The Burberry Festive Film made last year, starring Julie Walters 9.56 Coreena Ford All bets are off! \nWilliam Hill and Canadian poker firm Amaya have called time on talks over a potential £4.6bn merger, following feedback from shareholders. Earlier this month the gambling giants said discussions were under way for a “merger of equals” which would create one of the world’s biggest online gambling firms. But this morning William Hill said: “Various exploratory due diligence and other workstreams were under way but far from complete. After canvassing views from a number of William Hill’s major shareholders, the board has decided that it will not pursue discussions with Amaya.” \nThe deal was opposed by Parvus Asset Management, William Hill’s largest shareholder. \nAmaya owns the PokerStars and Full Tilt Poker brands and the aborted deal comes months after Mecca Bingo operator Rank Group pulled out of a joint bid with 888 for William Hill. The gambling sector has seen growing consolidation over the past year, with Paddy Power and Betfair joining hands and Coral and Ladbrokes inking a£2bn merger. William Hill and Canadian poker firm Amaya have called time on talks over a potential £4.6bn merger 9.52 Coreena Ford ASOS bucks faltering fashion trend \nOnline fashion firm ASOS has reported a healthy rise in full year profits, driven by growth across all of its key markets. \nThe retailer said that pre-tax profits came in at £63.7 million, up 37% compared to last year. \nSales grew 26% to £1.4 billion, helped by a 50% rise in US revenue. In the UK and Europe, sales rose by 27% and 28% respectively. Chief executive Nick Beighton said: “I’m pleased with progress in the business. \n“The strength of these results reflects our unwavering focus on delivering great customer experience, supported by rigorous execution of our investments. “We continue to target our growth opportunities, so we’re accelerating investment in both logistics and technology. \n“The pace at ASOS is continuing in the new financial year, which we are looking forward to with confidence.” \nThe success of ASOS flies in the face of recent data showing a faltering fashion market, with figures from Kantar Worldpanel showing on Monday that the British fashion market has witnessed its steepest decline in sales since 2009. \nTom Gadsby, analyst at Liberum, said: “ASOS has shrugged off the retail fears dogging the rest of the UK high street with an excellent set of full year results. “We believe the company will reach its medium term target of £2.5 billion of sales by 2019. Investment ahead of growth in infrastructure has been a key driver.” An ASOS dress yesterday 9.46 Coreena Ford Lower costs at Ryanair offset impact of falling pound \nRyanair said lower costs across the group were helping offset the impact of the pound and are now set to fall by 3% excluding fuel over its full year. \nIts lower fares also appear to be boosting sales as the group edged up the full-year forecast for its load factor - a key measure of how well it fills its planes - to 94% and said it now expected to carry 119 million passengers, up 12% year on year. \nChief executive Michael O’Leary said: \nThe recent sharp decline in sterling post-Brexit - which accounts for approximately 26% of Ryanair’s full-year revenues - will weaken second-half yields by slightly more than we had originally expected. \nWhile higher load factors, stronger traffic growth and better cost control will help to ameliorate these weaker revenues, it is prudent now to adjust full-year guidance. \nIts expected earnings will still mark a 7% rise on the previous year, although this is sharply lower than the 12% hike it had previously pencilled in. But it cautioned that forecasts could be lowered again if the pound and fares fell further. 9.44 Coreena Ford Ryanair cuts annual earning forecast \nRyanair became the latest airline to warn over the impact of the plunging pound as it said full-year profits would take a hit. \nThe Irish carrier blamed an 18% fall in the value of sterling since the Brexit vote as it cut its annual earnings forecast by 5%. \nIt said fares fell more than expected in the first half of its financial year - down 10% - and were now set to drop by up to 15% in the final six months as the Brexit-hit pound takes its toll. \nRyanair now expects full-year earnings of between 1.30 billion euros (£1.17 billion) and 1.35 billion euros (£1.22 billion), down from the previous range of 1.38 billion euros (£1.24 billion) to 1.43 billion euros (£1.28 billion). \nIt comes after rival easyJet revealed a £90 million impact from the falling pound earlier this month, on top of at least £125 million in lost profit after a combination of terror attacks across Europe, Egypt and Tunisia as well as air traffic control strikes in France and political turmoil in Turkey. \nRyanair and easyJet have also been slashing fares to boost demand. Rui Vieira/PA Wire Ryanair is the latest airline to warn over the impact of the plunging pound 9.40 Coreena Ford . . and there are board changes at Utilitywise \nAs well as unveiling their full year results, Utilitywise has announced several board changes. \nJon Kempster, chief financial officer, has decided to step down from the board and leave the group to pursue other career opportunities. \nRichard Laker has been appointed as as chief financial officer and a director of the company. \nRichard joins Utilitywise from Augean plc where, in his role as group finance director, he helped oversee the implementation of a new strategy, delivering double-digit annual growth in profit, operating cash flow and ROCE. \nRichard was previously at Northgate plc, where he held a number of senior finance roles between 2004 and 2014 including group financial controller and, most recently, UK Finance Director. \nBefore joining Northgate plc, Richard was at PricewaterhouseCoopers LLP where he qualified as a Chartered Accountant in 2001. \nMeanwhile Simon Waugh has also been appointed to the board, as non-executive director and the senior independent director, with effect from November 1 2016. \nSimon has extensive experience in senior leadership roles, including seven years between 1997 and 2004 on the executive committee at Centrica plc as sales and marketing director, helping transform British Gas into an international business with a market capitalisation of more than £10 billion. \nHe was also chief executive Officer, Centrica Financial Services, in the early part of his tenure, before later becoming deputy managing director, British Gas. \nJon Kempster is also standing down as company secretary with effect from 1 November 2016. \nJulianne McCorry, currently assistant company secretary, has been appointed company secretary with effect from that date. \nJulianne is a chartered secretary (FCIS) and has had an extensive career in both the UK and France, holding a number of senior posts including assistant company secretary of Unilever plc. 9.34 Coreena Ford Sales soar at Utilitywise as customer numbers rise \nRevenues have risen by an impressive 22% to £84.42m at North Tyneside-based energy consultancy Utilitywise, which has grown customer numbers both close to home and overseas. \nThe firm said improved supplier terms led to a substantial improvement in net debt for the year ended July 31 2016, which has been slashed from £6.7m to £200,000, and pre-tax profit now sits at £17.8m, up 7%. \nUK and Ireland customer numbers increased by 23% to 32,000, while 1nternational customer numbers increased 49% to 6,500. \nGeoff Thompson, executive chairman of Utilitywise, said: \n“I am very pleased with the progress we are making at building a capability that has no direct comparator in the Industry. \n“The strength of the procurement offering has provided a great foundation to make significant investment in our wider Energy Services capabilities allowing the group access to significant growth opportunities going forward. \n“This period of investment has positioned us very well for strong and sustainable growth with our broadened and differentiated offering. Strong operating cashflow generation contributed to a much improved cash position at the year end and the 30% increase in the dividend for the full-year is a sign of the confidence with which we enter the new year. \n“I welcome Brendan Flattery to the CEO role and look forward to working with him.” \nBrendan Flattery, chief executive of Utilitywise, said: \n“I have had a very enjoyable and positive first couple of weeks in the business, meeting over 1,000 colleagues, and engaging with many customers and partners in that short time. \n“It is clear that we have a fantastic opportunity to build on the strong business that Geoff founded and built in the last ten years. \n“I am looking forward to driving a new wave of innovation, bringing new products, services and technologies to life that enhance our strong procurement proposition, add value to customers, create direct relationships and differentiate the Utilitywise brand.” Utilitywise chief executive Geoff Thompson 9.24 Coreena Ford Bellway boosted by record revenues \nHousebuilder Bellway has posted a record set of results, for the seventh successive year. \nThe Newcastle firm has seen revenues rise by 26.9% to £2.24bn and operating profit is up 36.5% to £492m, meaning earnings per share have risen by a further 42%. \nThe firm said there will be further controlled investment to deliver ongoing growth, with 9,555 new plots contracted in the year, up from 9,128 plots, on “excellent” land opportunities and six new operating divisions have opened since August 1 2013. \nChairman, John Watson, said: \n“Bellway has delivered another record year, further increasing the number of new homes sold, which has resulted in a substantial growth in earnings. \n“The excellent operating performance has facilitated further investment into the business and has enabled the Board to propose a final dividend of 74.0p per share, bringing the total dividend for the year to 108.0p per share. \n“The long term outlook continues to be positive, supported by strong customer demand, a substantial forward order book and favourable trading conditions across all areas of the country where Bellway operates. \n“Whilst there is some uncertainty following the result of the EU referendum, trading since that date has remained resilient. Bellway has invested significantly in high quality land opportunities and infrastructure over recent years. \n“As a result, with its strong balance sheet and structure of nineteen operating divisions, the Group is well placed to deliver additional value for shareholders through further disciplined volume growth in the current financial year.” \nChief executive Ted Ayres said the workforce has been boosted by a further 9% to 2,366 - but the skills gap continues to loom. \nHe said: \nIdentifying, recruiting and retaining experienced, high calibre individuals remains the greatest constraint to long term growth for the wider industry. Upward pressure with regards to salary costs has remained a feature over the past year, particularly in London and the South East, where the demand for skilled individuals is most pronounced. \nThe Group recognises its responsibility to contribute to reducing the industry wide skills shortage and also the importance of its people in delivering this outstanding set of results. \nAccordingly, Bellway has increased the number of apprentices and graduates within the business by 14% to 83 people (2015 - 73) and has also continued to develop and invest in our site managers and assistant site managers, with 48% (2015 - 34%) of these individuals now having achieved NVQ Level 6 or higher. Ongoing training is also important across the wider organisation, ensuring that Bellway continues to meet high standards in all aspects of its business activities. This is reflected by the number of training hours undertaken by our employees increasing by 36% to 12,514 (2015 - 9,234). \nBellway has appointed a new Group Human Resources Director with the remit to further develop the Group’s people strategy, initially focussing on attraction, development and retention of talent across the business. Ted Ayres, chief executive of Bellway", "external_links": [], "published": "2016-10-18T16:12:00.000+03:00", "crawled": "2016-10-18T13:33:36.496+03:00", "highlightTitle": ""}