{"organizations": [], "uuid": "8ee1f9af061b616c1215d47cca8cd311bc756b7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12089615.ece/ALTERNATES/s1200/JS103145051.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/hundreds-new-jobs-likely-created-12089600", "country": "GB", "domain_rank": 21960, "title": "Hundreds of new jobs likely to be created at Nissan's Sunderland plant", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Hundreds of new jobs likely to be created at Nissan's Sunderland plant", "spam_score": 0.0, "site_type": "news", "published": "2016-10-28T00:58:00.000+03:00", "replies_count": 0, "uuid": "8ee1f9af061b616c1215d47cca8cd311bc756b7d"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/hundreds-new-jobs-likely-created-12089600", "ord_in_thread": 0, "title": "Hundreds of new jobs likely to be created at Nissan's Sunderland plant", "locations": [], "entities": {"persons": [{"name": "colin lawther", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "lawther", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "sunderland  production", "sentiment": "none"}, {"name": "north east automotive alliance", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nissan-renault alliance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hundreds of new jobs likely to be created at Nissan's Sunderland plant 17:58, 27 Oct 2016 Production of two new models likely to increase jobs at Nissan's Sunderland plant as it adds an extra shift Share Get Sunderland AFC news by email Work begins on a new production line at Nissan \nHundreds of new jobs will be created at Nissan’s Sunderland plant after its workers convinced company bosses to set aside Brexit fears and continue investment into the North East. \nThe motor giant delivered a surprise double boost to the region when it confirmed not only that it would build the next generation Qashqai at Sunderland but also its new X-Trail SUV. \nThe new models mean Nissan will add an extra shift onto the second production line at Sunderland, potentially creating up to 1,000 new jobs at the plant. \nColin Lawther, Nissan’s European senior vice president for manufacturing, said the Qashqai and X-Trail announcement was a testament to the workforce at the Sunderland plant, who had convinced Nissan’s executive committee to give them a vote of confidence. \nEarlier both Nissan and the Government had to deny there was any “sweetheart deal” to protect the manufacturer from any post-Brexit EU tariff. Colin Lawther, Nissan’s European senior vice president for manufacturing \nBut Mr Lawther said the June referendum vote had “knocked everything off course” as he tried to secure the new models and the negotiations over Britain’s terms for leaving the EU could impact on future decisions at the plant. \nHe said: “I’ve been working on this for the last three years. Pre-Brexit, this would have been a shoo-in. Brexit knocked everything off course in that there was a lot of uncertainty and it put a lot of problems in our way. \n“We had to take some decisions on risk management and work with the Government, but that gave us assurances that they understood the problems and they got what we need to do to ensure we have a competitive automotive sector in this country. \n“Clearly what we want is a tariff-free environment for the automotive sector. We’ll see what happens.” \nMr Lawther said that the reputation of the Sunderland plant and its workforce had helped convince Nissan’s executive committee to back the plant despite the concerns raised by the Brexit vote . \nThe new models were likely to increase production from around 500,000 models a year to 600,000, making Sunderland a “super-plant” on a global scale. Read More Nissan jobs boost: Opposition parties demand to know if the Government did a deal with Nissan \nMr Lawther added: “The story today is great news for the plant, for the North East and for the UK. \n“We stopped the line to tell people the news, which is almost unheard of, and there were big cheers. The place was really buzzing because people know what it means for their job security but also what Nissan’s executive committee think of them as individuals. \n“This is a people story because it’s these people who have won the day.” \nNissan chief executive and chairman Carlos Ghosn, who met Prime Minister Theresa May in Downing Street last week to discuss company concerns about the EU referendum vote, announced the new models and described the Sunderland plant as a “globally competitive powerhouse”. \nBoth the Government and Nissan later insisted there was no “special deal” either for Nissan or the wider automotive industry in the UK to help secure the new models. \nSunderland opened in 1986 and has produced almost nine million cars over the past three decades. Read More Nissan and Government deny 'sweetheart deal' over Sunderland \nProduction of the next Qashqai model is expected to begin in 2018 or 2019. \nConstituency MP Sharon Hodgson said: “The announcement today that Nissan has decided to base the production of their new Qashqai and X-Trail SUV here in Sunderland is fantastic news and shows that not only have Nissan got confidence to continue investing in our region but most importantly, reinforces Nissan’s continued faith in the skilled and highly capable workforce based at the plant. \n“Credit must go to the workforce at the Nissan factory for their continued hard work in producing such high-quality cars, where nearly 80% of the cars rolling off the production line in Sunderland are exported across the globe. The talent and skill of Sunderland’s workforce is showcased across the world and puts Sunderland very squarely on the map as somewhere for businesses to come and invest.” \nA spokesman for the North East Automotive Alliance said: “Nissan’s announcement is fantastic news for the North East automotive sector. \n“Not only will it secure the 7,000 jobs within Nissan, it will secure the many thousands of jobs within the supply chain throughout the UK. It is testament to the excellence of the Nissan employees and the supply chain that the Sunderland plant has been able to secure this investment ahead of increased competition from within the Nissan-Renault Alliance.”", "external_links": [], "published": "2016-10-28T00:58:00.000+03:00", "crawled": "2016-10-27T21:12:17.009+03:00", "highlightTitle": ""}