{"organizations": [], "uuid": "11c102e391c57edf654f8f8da8cc01ad318dc879", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12022362.ece/ALTERNATES/s1200/JS102203857.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/marmite-shortage-apt-metaphor-uks-12022374", "country": "GB", "domain_rank": 21960, "title": "The Marmite shortage is an apt metaphor for the UK's Brexit journey", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The Marmite shortage is an apt metaphor for the UK's Brexit journey", "spam_score": 0.0, "site_type": "news", "published": "2016-10-14T00:25:00.000+03:00", "replies_count": 0, "uuid": "11c102e391c57edf654f8f8da8cc01ad318dc879"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/marmite-shortage-apt-metaphor-uks-12022374", "ord_in_thread": 0, "title": "The Marmite shortage is an apt metaphor for the UK's Brexit journey", "locations": [], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "none"}, {"name": "liam", "sentiment": "none"}, {"name": "marmite", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uniremainer", "sentiment": "none"}, {"name": "sterling", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "unilever", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Marmite shortage is an apt metaphor for the UK's Brexit journey 17:25, 13 Oct 2016 Journal business editor Graeme Whitfield considers life without Pot Noodles as leaving the EU has unexpected consequences Share Get business news by email Yui Mok/PA Wire A single jar of Marmite remaining on the shelf of a Tesco \nAs Tesco struggles to get supplies of Marmite because of a post-referendum slump in Sterling, I wonder if they have considered switching suppliers from Unilever to Uniremainer. \nNo groaning at the back, please; don’t think you’re better than me. It is jokes like that, and indeed probably little else, that will get us through the next few years of food shortages, self-righteous Daily Mail editorials and Liam bleedin’ Fox. \nIt seems somehow apt that the first flashpoint in our Brexit world is a foul-tasting goo that half the population can’t stand. If you are part of the half that actually like it, I’m afraid you are just going to have to accept that the British people have spoken and spread something else on your toast. \nThe Marmite shortage (and the PG Tips shortage and the Persil shortage) has come as the terms under which we will leave the European Union appear to becoming clearer - though mainly in a way which makes one long for ambiguity. \nIt’s probably wrong to judge politicians on what they say at party conferences – the political equivalent of six-year-olds showing off to their friends – but, Lordy, it’s hard not to be a tad discouraged by some of the things we’ve been hearing in recent weeks. \nThe idea that businesses should be forced to say how many foreign workers they have, for example, is not just unpleasant but feeble-minded in the extreme. As for saying there are too many foreign students, one can only assume our new Home Secretary is unaware of how much funding they bring to our higher education sector. \nThe basic fact of Brexit that is becoming ever clearer is that we can’t have it all. Either we can stay in the single market and accept free movement of people or you can control immigration but leave the single market and accept whatever harm that does to the economy. \nFaced between people losing their job and having fewer foreigners around, the Government appears to be going for the latter. That is, I suppose, the logic of the referendum vote but I believe Britain will be worse off for it. \nAt some point fairly soon, Tesco will sort out its differences with Unilever and the foul-tasting goo that is Marmite will go back on sale. \nBut many other goods will become more expensive and there will be plenty more bumps in the road between now and our post-EU future. \nGraeme Whitfield is business editor of The Journal", "external_links": [], "published": "2016-10-14T00:25:00.000+03:00", "crawled": "2016-10-13T20:11:02.827+03:00", "highlightTitle": ""}