{"organizations": [], "uuid": "4ea636ba39ea87240a1cdc7d1d2225d4a124c75e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30433966/16075916.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/crime-czar-suffers-council-defeat-because-tory-leader-missed-vote/story-30433966-detail/story.html", "country": "GB", "title": "Crime czar suffered bruising no confidence defeat because Tory...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-11T13:18:00.000+03:00", "replies_count": 0, "uuid": "4ea636ba39ea87240a1cdc7d1d2225d4a124c75e"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/crime-czar-suffers-council-defeat-because-tory-leader-missed-vote/story-30433966-detail/story.html", "ord_in_thread": 0, "title": "Crime czar suffered bruising no confidence defeat because Tory...", "locations": [], "entities": {"persons": [{"name": "phillipa davey", "sentiment": "none"}, {"name": "mayor", "sentiment": "none"}, {"name": "alison hernandez", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "tudor evans", "sentiment": "none"}, {"name": "hernandez", "sentiment": "none"}, {"name": "bill stevens", "sentiment": "none"}, {"name": "ian darcy", "sentiment": "none"}, {"name": "terri beer", "sentiment": "none"}, {"name": "mark kingscote", "sentiment": "none"}, {"name": "clarence hotel", "sentiment": "none"}, {"name": "cllr bowyer", "sentiment": "none"}, {"name": "wendy foster", "sentiment": "none"}, {"name": "ian bowyer", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "tory", "sentiment": "none"}, {"name": "local government association annual conference", "sentiment": "none"}, {"name": "plymouth city council", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "council house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Crime czar suffered bruising no confidence defeat because Tory leader missed vote to catch a train By WMN_PGoodwin   0 COMMENTS SHARES Alison Hernandez lost a key vote because Tory councillors did not have the numbers Crime czar suffered bruising no confidence defeat because Tory leader missed... X \nCopy link to paste in your message / \nPolice and crime commissioner Alison Hernandez's tweet late on Friday revealed she had endured her toughest week in office. \nBut things might easily have been different. Informative evening last night with @ajcdeane on Brexit, regulation and hope for the UK. My longest week ever finally ended at 10.30pm pic.twitter.com/jRqJ7GUoQz — Alison Hernandez (@AlisonHernandez) July 8, 2017 \nThe outspoken Conservative faced three separate votes which could prove key to her survival – one by councillors in Plymouth on Monday and then two on Friday at the police and crime panel which oversees her role. \nShe lost two and won one but the scoreline could so easily have been reversed if not for a series of key absences at the first of two meetings. \nA motion of no-confidence pushed through by the Labour group at Plymouth City Council last Monday was lost by the slenderest of margins, creating embarrassing headlines for the the commissioner. \nBut councils are not supposed to lose politically motivated votes against their bitter opponents, so what went wrong? \nA detailed look at the meeting shows that the vote could have been won if the ruling Tories had enough bodies in the city's Council House meeting room. \nREAD MORE: Police boss gives her old Tory colleague a job as her deputy \nUnfortunately, three councillors - two Tories and one from Labour - excused themselves before the debate, which centred around whether Ms Hernandez's comments about arming citizens meant she was a danger to the public and should resign. \nAnd then, just before the key vote, leader Ian Bowyer left his seat and exited the chamber, consigning his party colleague to an inevitable defeat. \nLabour pushed through the motion by a single vote, forcing the chief executive to write to the Home Secretary asking for the removal of a Conservative police and crime commissioner. \nHardly the result the party was after at a time when they are under such immense pressure nationally. \nMs Hernandez has been embroiled in controversy ever since her appointment to the post last year. \nIn that time she has been the subject of an investigation by the police , admitted to smoking cannabis and has a penchant for gangsta rappers N.W.A - who sang \"F*** da police\" on their debut album. She was criticised last October for taking a selfie with the fire chief as emergency workers battled to save the Royal Clarence Hotel behind her. \nFollowing the no-confidence vote, she dismissed the tactic as politicking and declared the vote unrepresentative of the \"wider Plymouth community\". \nBut why did the Tories fail to rally enough troops to defend one of their highest-profile politicians in the county from a bruising defeat at a council it controls, albeit in coalition with UKIP? \nWas there, as some have suggested, a lack of appetite among the group to come out to bat for Hernandez after comments they may have felt overstepped the mark? \nOr did the vote simply represent a shrewd political move by Labour to push through a damaging motion at precisely the worst moment, four days before she faced the police and crime panel? \nThe full council meeting, which began at 2pm and ran for more than five hours, came to a bad-tempered ending with six highly critical motions from the Labour group, led by former leader Tudor Evans. \nThe Conservatives - who hold 27 seats to Labour's 27 on the council and can count on three more from UKIP - used their superior numbers to fend off the first five votes, around education, traffic chaos, school meals, funding cuts and a \"war\" on small business. \nBut as the final motion of no-confidence was tabled around 6.45pm, Tory cabinet members Ian Darcy and Terri Beer, all excused themselves, declaring a prejudicial interest as employees of Devon and Cornwall police. \nLabour's Bill Stevens also exited the meeting as a member of police staff. \nThis still left at least a hung chamber until Tory leader Ian Bowyer left at 7.15pm. \nSpotting the numerical advantage, Labour, moved a closure motion to go straight to the vote, which was carried almost unanimously. \nThe vote was carried by 26 to 25, despite a vote cast by the Conservative Lord Mayor, who normally only votes in the event of a tie, and a letter was sent to the chairman of the police and crime panel, requesting he table a second vote of no confidence. \nMs Hernandez survived the second vote on Friday but the council motion added to mounting pressure, and her proposed deputy, Mark Kingscote, was not endorsed by the panel amid concern he was not fit for the role. \nThis leaves her a tough decision this week: accept the panel view and find a fresh candidate or plough on and potentially alienate the councillors appointed to oversee the role. \nLabour made much of the fact that none of the Tories had spoken out specifically in defence of their colleague - instead they attacked the Opposition councillors for playing politics. \nThe suggestion was that she had few friends among her own party ranks so Cllr Bowyer was contacted by Devon Live to find out. \nHe said there had been nothing sinister or underhand in his disappearance - that he had simply had to leave to catch a train to the Local Government Association Annual Conference, which began in Birmingham the following day. \n\"I couldn't be in two places at once,\" he added. \nThe leader would not confirm whether he had been contacted by Ms Hernandez ahead of the vote or whether the support of the group had been canvassed. \n\"That is a private conversation if it occurred,\" he added. \n\"I caught the last train to get me there that night - I stayed as long as I could - left at 7.15pm, the train was at 7.44pm.\" \nOne of the Labour councilors in the meeting, Phillipa Davey, thinks there must have been a voting order in place - a so-called whip - otherwise the Lord Mayor, Wendy Foster, would not have voted. \nShe thinks the vote was lost simply due to poor organisation among the Tories, who could have re-scheduled the Hernandez vote to appear earlier in the meeting. \n\"I don't think it was a case of them not being bothered about defending her, it was just rubbish organisation and quite embarrassing for them,\" she added. \n\"If they had not been that bothered then the Lord Mayor would not have voted - that shows there must have been a whip. \n\"If it had been me and the Labour group and we had wanted to make sure we won a vote we would have made sure we were organised and ready to do that. \n\"It wasn't even the first motion, it was one of the last - if they really wanted to defend it they could easily have just moved it up the order.\"", "external_links": [], "published": "2017-07-11T13:18:00.000+03:00", "crawled": "2017-07-11T17:05:42.000+03:00", "highlightTitle": ""}