{"organizations": [], "uuid": "fb0ac91a83c5acc8906c762db55480dccb89e7d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13266533.ece/ALTERNATES/s1200/GWR_-NJL_030717meetingwith_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-paul-olvhoj-sales-13265352", "country": "GB", "domain_rank": 21960, "title": "A Meeting With: Paul Olvhoj, sales manager at Port of Sunderland", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-03T07:00:00.000+03:00", "replies_count": 0, "uuid": "fb0ac91a83c5acc8906c762db55480dccb89e7d1"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-paul-olvhoj-sales-13265352", "ord_in_thread": 0, "title": "A Meeting With: Paul Olvhoj, sales manager at Port of Sunderland", "locations": [], "entities": {"persons": [{"name": "paul olvhoj", "sentiment": "negative"}, {"name": "spike milligan", "sentiment": "none"}], "locations": [{"name": "glencoe", "sentiment": "none"}, {"name": "port of sunderland", "sentiment": "none"}, {"name": "siberia", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "port of sunderland", "sentiment": "negative"}, {"name": "port of sunderland paul olvhoj", "sentiment": "negative"}, {"name": "harbour authority", "sentiment": "none"}, {"name": "fugro", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Olvhoj, sales manager at Port of Sunderland (Photo: Copyright unknown) Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA Meeting With...Paul Olvhoj, sales manager at Port of Sunderland \nWhat is the best thing about your job? \nA bit clichéd but every day being different is something I love. I once worked briefly as a signalman for Network Rail – every single shift was exactly the same as the last and it was mind numbing. At Port of Sunderland we are a very small team running a busy port that is growing year on year, we have to adapt to new challenges in the maritime sector, keep the ships coming in and out, act as Harbour Authority and keep growing. \nWhat is your proudest achievement? \nI left home at 16 to join the Royal Navy, at 23 was working in Siberia for an oilfield services company, then at 26 was in Nigeria repairing oilwell logging equipment. When I met my wife during this time, we spent the first six months of our relationship on different continents and although I settled down a little bit, I then worked for Fugro travelling the world on vessels carrying out geophysical surveys. \nWhat advice would you give to someone starting in your career? \nEnjoy yourself. If you don’t, it is the wrong career but don’t be afraid of changing. I chose the Royal Navy to travel the world first then get a trade qualification. My time at sea was spent abroad in places I would never be able to afford to visit at that age and I qualified as a weapons engineer (they called them Artificers in those days) and for a while I was set on a path in electronic engineering but my heart wasn’t in it. I realised though that I really did love the marine industry and so have always kept within that. \nWhich individual has inspired you most and why? \nIn every role that I have had, I have been lucky to work with people who have led and inspired me to improve; inspiration is everywhere and I get it every day from all levels of the business. Outside of work my hero was Spike Milligan. I read his war memoirs when I was young and have kept copies of them ever since. A sensitive, kind, flawed and incredibly, amazing funny man. My attitude to people, animals, stupidity and cruelty has been shaped by him. \nWhat’s the best piece of advice you’ve been given? \nDon’t take anything abroad that you aren’t prepared to lose. Served me very well in Nigeria. Also don’t drink the water anywhere! \nWhat was the biggest challenge you’ve faced in your career so far? \nComing back ashore from offshore. Nowadays it is very easy to be pigeonholed into a certain type of job so to be given the chance to work onshore, see the family more and still be involved with ships is something I am grateful for. \nHow is your business going to change in the next 10 years? \nIn the short term the impact of Brexit on seatrade is going to be interesting to say the least, but the fact that we will always be an island and 96% of our goods will move in vessels will never change. Ports will need to be able to keep abreast of the new rules and still attract new business and protect current clients. The renewable energy sector will also change massively in the next ten years. We just don’t know how! \nWhat do you like to do out of work? \nThe lure of the hills in Scotland are always pulling me North for remote cottage holidays, where we can walk in the glens. The area around Glencoe is my favourite – simply stunning. When not on holiday, Northumberland provides me with my walking pleasures. \nWhat do you always carry with you? \nA smile and a beard. \nWhat would you do if you had to change career? \nRun a secondhand bookshop. My wife and I are bibliophiles and have around 2,000 books in our home including some rare first editions. Like us on Facebook", "external_links": [], "published": "2017-07-03T07:00:00.000+03:00", "crawled": "2017-07-03T08:25:53.004+03:00", "highlightTitle": ""}