{"organizations": [], "uuid": "cdfcbf2d234299f0ed592e902ecb9f0def73e1b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13319713.ece/ALTERNATES/s1200/GWR_-NJL_120717hans_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/innovation-needs-heart-north-east-13319675", "country": "GB", "domain_rank": 21960, "title": "Innovation needs to be at the heart of North East economy, LEP expert says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-12T14:13:00.000+03:00", "replies_count": 0, "uuid": "cdfcbf2d234299f0ed592e902ecb9f0def73e1b4"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/innovation-needs-heart-north-east-13319675", "ord_in_thread": 0, "title": "Innovation needs to be at the heart of North East economy, LEP expert says", "locations": [], "entities": {"persons": [{"name": "hans moller", "sentiment": "negative"}, {"name": "grainger", "sentiment": "none"}, {"name": "anthony mullen", "sentiment": "none"}, {"name": "moller", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "lep", "sentiment": "negative"}, {"name": "gartner", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "northumbrian", "sentiment": "none"}, {"name": "reece innovation", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "invalid email  innovation", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "northumbrian water", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Innovation needs to be at the heart of North East economy, LEP expert says Hans Moller has praised Northumbrian Water for staging an innovation festival Share LEP innovation director Hans Moller at the Northumbrian Water Innovation Festival (Image: Copyright unknown) Share Get   \nInnovation needs to be more central to life and work in the North East if the region’s economy is to thrive, a leading expert has said. \nHans Moller, the North East LEP’s innovation director, was speaking at Northumbrian Water’s Innovation Festival, which is this week bringing together businesses, academics and young people with the aim of finding new solutions to key challenges facing society. \nMr Moller praised the company for staging the event but said that innovation needs to be more visible and include ideas from a people across all disciplines if it is to make a difference to the region. \nHe said: “Innovation is extremely important to the North East. One of the ways of delivering the Strategic Economic Plan is supporting innovation, because we have to stay competitive. Post-Brexit , it’s even more important, for economic development, sustainability and climate change. \n“I think it’s an absolutely amazing decision from Northumbrian Water to go with this. It’s exactly what I think companies need to do, because it’s about promoting and explaining innovation internally and externally, and making it visible to people, because that’s one of our challenges: dealing with and supporting innovation and making it visible.” \n  \nThe festival is aiming to get innovative people together to suggest ways of tackling issues including flood reduction, improving the environment, building the cities of the future and the workplace of 2030. \nGlobal companies like Microsoft, IBM and BT are taking part in the event, alongside local firms like Reece Innovation. \nEach day is based around a ‘design sprint’ - a five-stage process in which businesses aim to bring new services to market in a shortened timeframe - to explore and create new solutions to some of the major challenges facing society. Read More Aldi is to create nearly 4,000 new UK jobs as expansion drive continues \nAnthony Mullen, research director at global research and advisory company Gartner, also praised the event, saying: “It’s key to make the time for events like this. They are not ‘nice to have’, they ensure the future. \n“It’s going to be quite a long time before you can automate what’s happening here today, given the speed with which businesses change and technology disrupts - it’s organic, face to face, lateral thinking. \n“The people here really seem to be very engaged and passionate. There is nothing like practical exercises or hackathons to create an extra level of depth, in terms of meeting people and creating working relationships that can drive ideas and actions.” Like us on Facebook", "external_links": [], "published": "2017-07-12T14:13:00.000+03:00", "crawled": "2017-07-12T14:30:58.009+03:00", "highlightTitle": ""}