{"organizations": [], "uuid": "6827f3a2b9d564719e1dc111ce16252c1624e351", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13273478.ece/ALTERNATES/s1200/Anti-government-Protestors-Turn-Out-For-Theresa-Mays-Farewell-Drinks-Event.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-must-agree-basic-brexit-13273316", "country": "GB", "domain_rank": 21960, "title": "UK must agree basic Brexit deal 'later this year' or face running out of time", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-03T15:00:00.000+03:00", "replies_count": 0, "uuid": "6827f3a2b9d564719e1dc111ce16252c1624e351"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-must-agree-basic-brexit-13273316", "ord_in_thread": 0, "title": "UK must agree basic Brexit deal 'later this year' or face running out of time", "locations": [], "entities": {"persons": [{"name": "david mr davis", "sentiment": "none"}, {"name": "thom brooks", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "prof brooks", "sentiment": "none"}, {"name": "mark hoban", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "kent", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "time", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "british government", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "durham law school", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "european single market", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "chevening house", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News UK must agree basic Brexit deal 'later this year' or face running out of time Time is running short for the UK and EU to agree the basic principles of Brexit, a leading North East academic has warned Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily     \nTime is already running out to secure a Brexit deal, a leading academic has warned. \nThom Brooks, dean of Durham Law School, said the British Government needed to agree the “basic principles” by the end of this year. \nIt follows the triggering of article 50 in March, when the UK formally announced its intention to leave the EU. This began a two-year exit process. \nBut Prof Brooks said Government was beginning the process late because of the snap election called by Theresa May. \nHe said: “There is a tight timetable made shorter by Mrs May’s decision to hold a snap election she did not need to and, if anything, has made her work more difficult. \n“Later this year, the UK and EU must reach some broad consensus on basis principles for how Brexit will work.” \nIt would then take about six months for EU member states and EU bodies such as the European Parliament to ratify the deal, he said. \n“In 18 months the more focused talks about how the Brexit principles will be worked out in detail will start, and this explains why a long transition period is likely but also why a deal must be struck fairly quickly if there is to be one at all.” Read More \nProf Brooks, who previously taught at Newcastle University , made the comments in an article for the Times newspaper. \nBritish officials have denied reports that they have changed their approach to Brexit. \nStaff at the Department for Exiting the European Union are said to have concluded that the UK will be forced to accept that the EU will continue to make decisions which affect us in return for a trade deal providing free and frictionless trade. \nIt would mean that the UK has an agreement similar to countries in the European Economic Area which are not members of the EU. \nThis involves allowing the free movement of persons, goods, services and capital within the European Single Market. \nNorway, Switzerland and Iceland are members of the European Economic Area but not members of the EU. \nBut participation in the EEA could risk a backlash from people who want to cut immigration. Thom Brooks \nSuggestions of a change of approach rejected by a spokesman Brexit Secretary David Mr Davis, who denied there had been any change of mood since the election. \nAsked to respond to reports of ministers now being forced to consider a trade-off, he said they “did not recognise the language”. \nMr Davis will host a conference Chevening House in Kent on Friday for business leaders, following reports that bosses felt excluded from the Brexit decision-making process. \nA government source said: “With negotiations under way, the Secretary of State for Exiting the European Union is determined to bolster the Government’s engagement with the business community on Brexit. \n“That is why he recently announced an intention to co-ordinate activity with the Prime Minister, Chancellor and Business Secretary to ensure we tap into the wealth of specialist knowledge from businesses up and down the country\". Read More Warning over 20 years of failure to cut the gap between the haves and have-nots \nMeanwhile, business leaders from the City of London are to send a delegation to Brussels with a proposal for a post-Brexit free trade deal for financial services. \nAccording to the Financial Times, the group will be led by former City minister Mark Hoban as banks fear the fallout from Brexit negotiations if access to EU markets is curtailed. \nA number of banks have developed contingency plans after Prime Minister Theresa May confirmed that Britain would ditch the single market, including stepping up operations at other EU sites in cities such as Frankfurt, Dublin and Luxembourg. \nAny deal which sees the country lose access to the single market would mean City firms lose so-called passporting rights that provide wide-ranging EU access for UK-based financial services. Like us on Facebook", "external_links": [], "published": "2017-07-03T15:00:00.000+03:00", "crawled": "2017-07-03T16:08:34.002+03:00", "highlightTitle": ""}