{"organizations": [], "uuid": "dfcf156209fbcd35950227f915799b5037f8533b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13258207.ece/ALTERNATES/s1200/CFR_NJL_290617airport_01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/government-helping-areas-advantage-over-13282307", "country": "GB", "domain_rank": 21960, "title": "Government helping other areas get advantage over North East, business group warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-04T19:32:00.000+03:00", "replies_count": 0, "uuid": "dfcf156209fbcd35950227f915799b5037f8533b"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/government-helping-areas-advantage-over-13282307", "ord_in_thread": 0, "title": "Government helping other areas get advantage over North East, business group warns", "locations": [], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "james ramsbotham", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ramsbotham", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "north east englan", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "northern rock", "sentiment": "none"}, {"name": "north east of england chamber of commerce", "sentiment": "none"}, {"name": "apd", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle airport share newcastle international airport", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Government helping other areas get advantage over North East, business group warns North East England Chamber of Commerce warns that doing nothing on air taxes will damage Newcastle Airport Share Newcastle International Airport (Photo: Newcastle Airport) Share Get business   Thank you for subscribing!   \nThe Government will be helping other parts of the UK get an advantage over the North East if it does not act soon on changes to air taxes, a leading business group has warned. \nThe North East of England Chamber of Commerce has written to Prime Minister Theresa May to urge action from the Government on Air Passenger Duty (APD), which increases the cost of flying from UK airports. \nThe Chamber is concerned that Newcastle Airport in particular will lose out if the Scottish Government goes through with plans to halve and then abolish taxes from airports north of the border. \nAirport bosses and business leaders in the North East fear that airlines will switch routes to airports like Edinburgh and Glasgow if flying becomes less expensive in Scotland, leaving the region cut off from international markets at a time when Brexit means those links are more important than ever. \nFormer Prime Minister David Cameron had pledged that regional airports in England would not be disadvantaged by changes to APD in the devolved nations of the UK, but Chancellor Philip Hammond signalled at the end of last year that the Government will not act on APD until after the end of the Brexit negotiations. \nNow a new threat to the region has emerged with signs that Northern Ireland may also be given power to reduce air taxes as part of the confidence-and-supply deal in which the Democratic Unionist Party (DUP) is supporting the minority Conservative Government. James Ramsbotham (Photo: tark pic) \nChamber chief executive James Ramsbotham said the moves to reduce the taxes in other parts of the UK means that “the businesses and airports of the North of England risk being disadvantaged on two fronts”. \nHe added: “This comes at a crucial time for the UK, with businesses from across the country - including North East England - striving to form new partnerships around the world. \n“We must create an environment for them to succeed, one which does not support one or more region at the expense of another, and which recognises regions like the North East as assets to a global UK.” \nMr Ramsbotham’s letter, which has also been sent to the Chancellor and to Transport Secretary Chris Grayling, points out that more than 4,000 businesses in the North East exported goods worth £10.75bn last year, with more than £350m going from Newcastle Airport alone. \nHe said that “North East businesses cannot wait” until after Brexit for the air tax problem to be resolved. \nBusiness leaders and airport bosses in the region have been campaigning against APD for many years, but the decision to allowed the devolved nations to set their own levels of the tax has exacerbated the problem for Newcastle Airport. Read More 'Bad bank' handling Northern Rock assets warns over interest rate rises \nThe main danger to the region is thought to be from its ability to attract major airlines to Newcastle, with former Chancellor George Osborne admitting in 2015 that the airport could lose around 10% of its traffic if the situation is not addressed. \nThe airport supports around 3,400 direct jobs and a further 12,000 across the North East. Like us on Facebook", "external_links": [], "published": "2017-07-04T19:32:00.000+03:00", "crawled": "2017-07-04T19:51:50.002+03:00", "highlightTitle": ""}