{"organizations": [], "uuid": "1bb9e2e6b02791f6a6faeecf6d8804fb2b53167b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30447945/16084944.jpg", "site_section": "http://www.middevongazette.co.uk/business.rss", "section_title": "Devon Live Business RSS feed", "url": "http://www.devonlive.com/how-the-great-south-west-is-set-to-rival-northern-powerhouse/story-30447945-detail/story.html", "country": "GB", "title": "How the Great South West is set to rival Northern Powerhouse", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-19T14:29:00.000+03:00", "replies_count": 0, "uuid": "1bb9e2e6b02791f6a6faeecf6d8804fb2b53167b"}, "author": "HannahFinch", "url": "http://www.devonlive.com/how-the-great-south-west-is-set-to-rival-northern-powerhouse/story-30447945-detail/story.html", "ord_in_thread": 0, "title": "How the Great South West is set to rival Northern Powerhouse", "locations": [], "entities": {"persons": [{"name": "mel squires", "sentiment": "none"}, {"name": "judith petts", "sentiment": "none"}, {"name": "steve hindley", "sentiment": "none"}, {"name": "hindley", "sentiment": "none"}, {"name": "stephen criddle", "sentiment": "none"}, {"name": "stuart brocklehurst", "sentiment": "none"}, {"name": "barbara shaw", "sentiment": "none"}, {"name": "karl tucker", "sentiment": "none"}, {"name": "hinkley", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "david bird", "sentiment": "none"}, {"name": "jackie jacobs", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "martin brown", "sentiment": "none"}, {"name": "steve smith", "sentiment": "none"}, {"name": "helen lacey", "sentiment": "none"}, {"name": "martha wilkinson", "sentiment": "none"}, {"name": "richard stevens", "sentiment": "none"}, {"name": "fiona mcmillan obe", "sentiment": "none"}], "locations": [{"name": "great south west", "sentiment": "none"}, {"name": "dorset", "sentiment": "none"}, {"name": "south west lep", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "heart of the south west", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "scilly", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "hinkley point c", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands engine", "sentiment": "none"}, {"name": "gloucester", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "portsmouth", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "european agricultural fund for rural development", "sentiment": "none"}, {"name": "south west lep", "sentiment": "none"}, {"name": "applegate marketplace", "sentiment": "none"}, {"name": "rural affairs", "sentiment": "none"}, {"name": "department for work", "sentiment": "none"}, {"name": "local enterprise partnerships", "sentiment": "none"}, {"name": "edf", "sentiment": "none"}, {"name": "exeter university", "sentiment": "none"}, {"name": "district council", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "university of plymouth", "sentiment": "none"}, {"name": "pennon group", "sentiment": "none"}, {"name": "south west local enterprise partnership", "sentiment": "none"}, {"name": "santander corporate and commercial banking", "sentiment": "none"}, {"name": "local authority", "sentiment": "none"}, {"name": "west of england aerospace", "sentiment": "none"}, {"name": "brexit resilience and opportunities group", "sentiment": "none"}, {"name": "south devon college", "sentiment": "none"}, {"name": "european social fund", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "strategic investment panel", "sentiment": "none"}, {"name": "red berry recruitment", "sentiment": "none"}, {"name": "peninsula rail task force", "sentiment": "none"}, {"name": "plymouth citybus", "sentiment": "none"}, {"name": "westward housing", "sentiment": "none"}, {"name": "heart of the south west local enterprise", "sentiment": "none"}, {"name": "department for communities and local government", "sentiment": "none"}, {"name": "midas", "sentiment": "none"}, {"name": "devon community foundation", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "yeo valley farms", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "national farmers' union", "sentiment": "none"}, {"name": "eic group", "sentiment": "none"}, {"name": "principal of bridgwater college", "sentiment": "none"}, {"name": "european regional development fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How the Great South West is set to rival Northern Powerhouse By HannahFinch | Posted: July 19, 2017 0 COMMENTS SHARES The Great South West aims to give an identity to all the efforts being made to grow the region How the Great South West is set to rival Northern Powerhouse X \nCopy link to paste in your message / The Great South West aims to give an identity to all the efforts being made to grow the region Comments (0) \nBusiness leaders striving for prosperity have launched the Great South West to give a unified voice to the region. \nLocal Enterprise Partnerships, authority leaders and regional MPs aim to develop a brand that signals a clear consistent message that together, we have what it takes to lead the way. \nSteve Hindley, chairman of the Heart of the South West LEP, covering Torbay, Plymouth, Devon and Somerset, said: \"By using the Great South West brand as our banner, we aim to raise the profile of the whole region not only to secure greater investment and resilience in infrastructure, energy, broadband, innovation from UK Government but also so that we raise our profile for international trade and investment. \nThis video sets out many innovative industries and projects here \n\"The South West is worth £1billion to the UK economy and a clear and consistent message to promote the region is vital to ensure we gain the greatest possible support from central government.\" \nThe aims of the Great South West align with the Western Morning News' #BackTheSouthWest campaign launched with key partners Pennon Group and supported by some of the region's biggest employers and with the backing of the LEPs. \nLast year, business leaders put a call out for suggestions on how a brand identity could rival other areas. \nMr Hindley said: \"The Northern Powerhouse is an example where cooperative working across a wider area has achieved more than when those areas work alone.\" \nIn October 2016, the South West Growth Summit saw the coming together of business leaders from across the region and the development of the SW Growth Charter which called for a new partnership for the South West and identified five ways to grow prosperity. The five key areas to drive prosperity To collaborate for growth To invest in a self-sustaining South West To invest in innovation, industry and infrastructure To invest in productive people and retain talent within our region To invest in our environment and share the benefits of growth \nMr Hindley said: \"It is recognised that by working collaboratively across our cities, towns and rural communities, developing shared strategies and tackling barriers to productivity, we will make the whole of the South West a prosperous region, a significant contributor to the UK economy, and realise our full economic potential. \" Steve Hindley CBE sets out the mission of the Heart of the South West Local Enterprise Partnership \nThe Heart of the South West Local Enterprise Partnership (HotSW LEP) is one of the largest and most successful LEPs in the country, covering the local authority areas of Devon, Plymouth, Somerset and Torbay. \nOur mission is to improve the economic prosperity of the area. \nSometimes that's through securing investment; sometimes it's through influencing Government thinking, often before policy is developed. \nWhichever route, our focus is on creating the conditions in which local businesses can start, survive and grow. \nThat may be through securing investment in our infrastructure, or ensuring that businesses have access to the advice and support that they need, as well as access to a skilled labour market. \nLEPs are genuinely different. \nThey bring together local leaders from the private and public sector to work together on the opportunities and challenges that we face. \nSince I've been chair of the LEP, I've seen some real changes in how this happens. We started out in 2011 with no budget and no staff; now we have a programme of investment approaching three-quarters-of-a-billion which is funding nearly 50 projects, with nine completed already, 20 taking shape on the ground and a further 19 in the pipeline. \nThese investment packages are made up of funding won from the UK Government or through European Commission funding invested in our area; alongside private, education and local authority investment. \nWe operate with a small team of core staff, but across a very broad partnership of local authorities, national parks, the education sector and the private sector, so that we double-up on expertise in a really streamlined operation. \nThese partners collaborate to bring added value that is greater than what could be achieved if these individual organisations were working separately. \nWe've a strong private sector-led board made up of local business leaders from a variety of sectors, who bring their expertise to shape our strategies and make sure we're on the right track for growth. \nWe've made great progress in securing investment and influencing government and we're building on this. \nIt's becoming more and more clear that some things can be delivered locally, but with some projects, wider cooperation is needed. \nThe Northern Powerhouse is an example where cooperative working across a wider area has achieved more than when those areas work alone. \nThe Heart of the South West and the country as a whole have been very successful at growing employment since the financial crisis. \nThere's more to be done in this area, helping more people into work, providing people with the skills they will need for the future. \nBut ensuring our businesses continue to grow and deliver higher levels of wealth and higher levels of the taxes that pay for our public services means we have to address our productivity – the amount produced per hour. \nThere's been much talk about the challenge we face as a country and this is particularly acute in our area. \nBut not all the issues can be fixed at a HotSW level so we've been working with LEPs in our neighbouring areas and have a number of cross-LEP initiatives under way at the moment. \nWith partners in Dorset and Cornwall and the Isles of Scilly, we've launched the Great South West brand – this region's answer to the Northern Powerhouse and the Midlands Engine. \nIt aims to work collaboratively to tackle barriers to productivity, and very much aligns with the #backthesouthwest campaign and some of the region's major private sector leaders. \nIt's important that the public and private sector work together on a regional basis to raise productivity and deliver the benefits to the local business and resident community. \nWe don't need to have a hard and fast geographical limit on our regional working, we can work flexibly like our friends in the North do and have different partners for different projects that are relevant to particular areas. \nFor example, our Nuclear South West partnership extends from Cornwall to Gloucester, our Marine Cluster stretches as far as Portsmouth, and our iAero partnership harnesses the globally significant aerospace strengths in the whole of the south west. \nAlso, with our partners in the West of England LEP, we've commissioned a new business support service to help businesses take up opportunities from the new build at Hinkley Point C, called the Hinkley Supply Chain. \nThe building of the largest engineering project in Europe needs everything from catering supplies to precision engineering, and companies from all over the south west, not just our HotSW area, can register on the supply chain to benefit from these commercial opportunities. \nAnother big priority for the LEP is to improve connectivity for our area in terms of road, rail and broadband. \nWe've funded much of the Connecting Devon and Somerset project to increase broadband coverage to 100% by 2020, and I know our partners in Cornwall and the Isles of Scilly have similar projects on the go. \nWe've reaped some success already in our campaign to dual the A303/A358/A30 route from the South East, and we continue to work with our partners in the Peninsula Rail Task Force to create a resilient and reliable rail service to reverse decades of under-investment in this area compared with other parts of the country. Over the coming months we'll be talking about these projects in detail with updates to progress on our projects that are taking shape on the ground. \nIn the meantime, visit our website , sign up to the Heart of the South West LEP newsletter and follow us on twitter @HeartofSWLEP Who is Steve Hindley and who else is on the board? \nThe Chairman of HotSW LEP is Steve Hindley, who is also chair of Midas, one of the country's leading construction firms. \nSteve uses his extensive experience to steer the LEP as a catalyst for growth in our area. This year saw eight new private sector board members join the LEP, bringing their skills and expertise to take the LEP forward on its journey towards increased productivity. The new board members replaced those retiring from the board after six years of service. \nThe full list of board member biographies can be seen on the website and the new members who have just joined the LEP are: Helen Lacey, managing director of Red Berry Recruitment; Karl Tucker, managing director of Yeo Valley Farms and Dr Fiona McMillan OBE, EDF board member and former Principal of Bridgwater College. \nAll use their expertise to particularly focus on the skills issues that are important to local business, and they aim to help local people become equipped to take up the higher value jobs created by projects such as Hinkley. \nRichard Stevens is managing director of Plymouth Citybus and a member of the Peninsula Rail Task Force. \nThis continues the LEP's momentum in prioritising transport connectivity. \nMel Squires, South West regional director of the National Farmers' Union brings expertise in the vital rural economy. \nJackie Jacobs, EIC Group owner is a West of England Aerospace board member, a strong sector in this area with potential for growth; Stuart Brocklehurst, chief executive of global e-commerce company, Applegate Marketplace, is a marketing expert and advocates the Great South West campaign. And David Bird, regional director of Santander Corporate and Commercial Banking, chairs the LEP's Strategic Investment Panel, the lead group in the LEP's governance of its investment portfolio. \nBoard members who have been contributing to the LEP's delivery for a number or years are: Barbara Shaw, chief executive of Westward Housing; Stephen Criddle, principal of South Devon College, Martha Wilkinson, chief executive of social enterprise company, The Devon Community Foundation; Martin Brown, who holds positions with a variety of technology businesses, Judith Petts, Vice-Chancellor of The University of Plymouth; and Sir Steve Smith, Vice-Chancellor of Exeter University. \nThe expertise of these leaders is matched by that of the local authority leaders from Devon, Plymouth, Somerset and Torbay Councils, plus District Council representatives from across the HotSW area that also make up the Board. How businesses can grow \nBusiness is buoyant in the area with many companies doing well, and to help businesses start up, develop and grow, LEPs across the country have set up Growth Hubs. \nGrowth Hubs are a one-stop-shop for a whole range of business support. \nThere is a lot of support available and whether it is with IT, marketing, staff management, law, export, technical expertise or any specialist advice needed for a particular business, the Growth Hubs are here to help. \nThe service is free, and as well as offering telephone, online or face to face business advice, the Growth Hubs match businesses to local and national funded services based on their requirements. One thing to be sure of with the Growth Hubs, because they're fully funded by the LEPs, is their complete impartiality to advising on what services are available to businesses. Wherever your business is based, there's a Growth Hub for you. Funding is available for rural businesses like yours \nAs one of the biggest LEPs in the UK and one with a very large rural economy, the Heart of the South West area has the largest allocation of European Agricultural Fund for Rural Development in the country. \nFunds are still available and could offer a real boost to many businesses and the local economy. \nSo the LEP is urging more rural businesses to consider applying for these grants, which can be used for a wide range of projects related to tourism, food, manufacturing and business development. \nIn addition to the European Agricultural Fund for Rural Development, which is managed by the Department for the Environment and Rural Affairs, other European monies are being invested in our area. \nThey include the European Social Fund, managed by the Department for Work and Pensions, and the European Regional Development Fund, managed by the Department for Communities and Local Government. \nIn each case the LEP works with these departments to ensure they are targeted at the needs of the local economy. \nVisit the website for more details on how we aim for these monies to benefit our area. Ready to face Brexit \nThere are 80,000 businesses in the Heart of the South West, each of them will have their own views on how leaving the EU may or may not impact on them, and whether Brexit presents opportunities or threats, or a mixture of both! \nIn the Heart of the South West, a Brexit Resilience and Opportunities Group has been set up combining a panel of Local Authority and LEP leaders to understand what Brexit means for the economy in this area. \nThere's public debate about potential opportunities in export, new markets or from the change in the Sterling exchange rate. \nAgainst this, there's been similar debate on the challenges in continuing to access the skills and labour that business needs; concerns over potential new tariffs and over continued access to the European market. \nIn our area there are also challenges around continued funding of our essential farming businesses and we want to build up a meaningful picture based on real-life feedback from companies. \nThere's a survey that all businesses are asked to take part in, where you share your insights and help the partners shape a planned reaction to a new economic climate on the horizon. ", "external_links": [], "published": "2017-07-19T14:29:00.000+03:00", "crawled": "2017-07-19T16:29:57.000+03:00", "highlightTitle": ""}