{"organizations": [], "uuid": "bd3c22025df70b52191fb5f3a2a74033fef407b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30443932/16082161.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/maximum-sentences-for-animal-cruelty-should-rise-from-six-months-to-five-years-neil-parish-column/story-30443932-detail/story.html", "country": "GB", "title": "Maximum sentences for animal cruelty should rise from six months...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-17T14:46:00.000+03:00", "replies_count": 0, "uuid": "bd3c22025df70b52191fb5f3a2a74033fef407b8"}, "author": "DanielClark", "url": "http://www.devonlive.com/maximum-sentences-for-animal-cruelty-should-rise-from-six-months-to-five-years-neil-parish-column/story-30443932-detail/story.html", "ord_in_thread": 0, "title": "Maximum sentences for animal cruelty should rise from six months...", "locations": [], "entities": {"persons": [{"name": "neil parish", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "rpa", "sentiment": "none"}, {"name": "coastal authority", "sentiment": "none"}, {"name": "environment food and rural affairs select committee", "sentiment": "none"}, {"name": "eu agriculture committee", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}, {"name": "department for environment food and rural affairs", "sentiment": "none"}, {"name": "clean air zones", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "efra committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Maximum sentences for animal cruelty should rise from six months to five years - Neil Parish column By DanielClark | Posted: July 17, 2017 1 COMMENTS SHARES Maximum sentences for animal cruelty should rise from six months to five years -... X \nCopy link to paste in your message / Comments (1) \nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010 \nI am delighted to have been re-elected, by fellow MPs, as Chair of the Environment Food and Rural Affairs Select Committee. \nI thoroughly enjoyed the last two years working with colleagues from all parties to scrutinise the Department for Environment Food and Rural Affairs (Defra) and its agencies. On farm support payments, toxic air, flood management and animal welfare, government knows that my Select Committee will be breathing down its neck. \nIn the last Parliament, we pressed the Government on animal welfare, holding inquiries into racing greyhounds as well as domestic pets. In Devon, animals play a big part in our lives, whether it's the family pet or farming. I want to ensure the law reflects that we are a nation of animal lovers. That's why I will continue to make the case to sharply increase maximum sentences for animal cruelty from six months to five years. Read more Brits don't want to pick fruit and veg, so we need foreign workers - Neil Parish column \nOn illegally poor air quality, the Committee produced a report labelling air pollution a 'public health emergency'. We recommended a range of solutions, from a diesel scrappage scheme to help get the most polluting cars off our roads, to more funding and power for councils to implement Clean Air Zones. Defra has been hauled in front of our Committee and the courts on this issue - and they must now produce a final Air Quality Plan by the end of the month. Rest assured, we will not be giving Ministers an easy ride if they continue to fail on toxic air. \nThe Committee's recommendations on future flood prevention also ruffled a few feathers in Government. We called for sweeping reforms to current flood management, with a new National Floods Commissioner for England, a new Coastal Authority and better natural food management, through leaky dams, tree planting and improved soil management. The West Country has a history of flooding, particularly in our coastal areas. I only hope the Government doesn't regret its current inaction the next time we have a major flood incident. Read more 'I will not rest' says MP Neil Parish until all homes have superfast broadband - opinion \nHowever, the Committee's primary attention must now turn to Brexit. Defra is affected by Brexit more than any other Department. Rules on big issues such as farm support payments, the environment and animal welfare will be made domestically after Brexit. It is the EFRA Committee's job to ensure that Defra's planning and execution is up to task. Over the coming months, we will be looking to hold inquiries into both fisheries and into forming a post-Brexit British agricultural policy. \nAs a former dairy farmer, a sustainable and productive agricultural system is incredibly important to me. It's vital that the Government get to grips with complex matters like regulations on the Basic Farm Payment and Stewardship schemes during this Parliament, so we can devise the best possible support system to produce high-quality goods, whilst protecting our precious countryside. \nExcessive regulation, delayed support payments from the RPA and price volatility convinced many farmers they actually wanted to leave the EU and the CAP. It's vital that we listen to the views of the food and farming community as we approach this monumental task. While this may be a period of upheaval for many farmers, it can also be a period of opportunity. Free from EU regulations and restraints, we will be able to create a tailored support scheme for farmers that better recognises our specific needs and environmental circumstances. \nAs a former farmer, Chair of the EU agriculture Committee and now again as Chair of the Efra Select Committee, I will be drawing upon all of my experience to scrutinise and develop a great post-Brexit strategy for food, farming and the environment. ", "external_links": [], "published": "2017-07-17T14:46:00.000+03:00", "crawled": "2017-07-17T16:18:27.012+03:00", "highlightTitle": ""}