{"organizations": [], "uuid": "f65a466ac39969bd269080a262cf59e369c01d06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30432407/16074706.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/tory-colleagues-call-on-torbay-mayor-to-resign/story-30432407-detail/story.html", "country": "GB", "title": "TinaCrowson published Tory colleagues call on Torbay Mayor to resign", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T18:50:00.000+03:00", "replies_count": 0, "uuid": "f65a466ac39969bd269080a262cf59e369c01d06"}, "author": "TinaCrowson", "url": "http://www.devonlive.com/tory-colleagues-call-on-torbay-mayor-to-resign/story-30432407-detail/story.html", "ord_in_thread": 0, "title": "TinaCrowson published Tory colleagues call on Torbay Mayor to resign", "locations": [], "entities": {"persons": [{"name": "tinacrowson", "sentiment": "none"}, {"name": "steve parrock", "sentiment": "none"}, {"name": "gordon oliver", "sentiment": "none"}, {"name": "alan tyerman", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}, {"name": "mike morey", "sentiment": "none"}, {"name": "david thomas", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}], "locations": [{"name": "brixham", "sentiment": "none"}, {"name": "churston", "sentiment": "none"}], "organizations": [{"name": "tinacrowson", "sentiment": "none"}, {"name": "local government association", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "dclg", "sentiment": "none"}, {"name": "tory group", "sentiment": "none"}, {"name": "town council notice board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tory colleagues call on Torbay Mayor to resign By TinaCrowson | Posted: July 10, 2017 4 COMMENTS SHARES Tory colleagues call on Torbay Mayor to resign X \nCopy link to paste in your message / Comments (4) \nSenior Torbay Conservative councillors have lodged a motion of no confidence in Tory Mayor Gordon Oliver citing what they say are several instances of his ‘dereliction of duty’. \nThe motion lodged officially with the council ahead of this month’s meeting cites seven instances when colleagues consider the mayor has not fulfilled his duties. \nIt states: “The council has no confidence in the mayor and the level of commitment shown by him in carrying out the duties required of him as elected mayor of Torbay.” \nTory group leader David Thomas has proposed the motion seconded by Alan Tyerman and if passed calls on the Mayor to resign as elected mayor by 10am on Monday July 24. \nIf the Mayor doesn’t tender his resignation, the motion instructs the chief executive to seek permission from the Department for Communities and Local Government to introduce ‘with immediate effect’ the leader and cabinet model of running the council which was chosen by Torbay residents in a referendum held in May 2016. READ MORE: Newton Abbot MP Anne Marie Morris recorded saying Brexit no deal... \nIn those circumstances it also instructs the chief executive Steve Parrock to make representations to the DCLG and Local Government Association requesting how the mayoral term can be reduced and the leader and cabinet system introduced ‘at the earliest opportunity’ and how the ‘Mayoral influence/decision making can be minimised’ during the remainder of his period in office. \nThe seven instances of dereliction of duty claimed by the motion are: \n1) Making a decision which is unlawful/‘ultra vires’ in respect of a covenant with the people of Churston that would enable them to prevent development of Churston Golf Course. The council’s monitoring officer has declared the decision unlawful, as it is ultra vires, but the Mayor went ahead despite clear advice against it being provided to him, \n2) It is claimed the Mayor has ‘failed to respond’ appropriately to the financial concerns facing the council, for example bridging the predicted budget gap and the need to urgently review the efficiency plan and financial resilience of the council, \n3) Over the last two years they claim the Mayor has consistently failed to get the support of the council for a large number of his proposals, including the budgets which have been significantly amended by members which they say shows he has ‘lost touch with the will of the council’. \n4) That he did not attend a meeting discussing issues related to children with learning difficulties and with disabilities which are issues ‘clearly important for the residents of Torbay’. READ MORE: Mentally ill retired priest died after self-inflicted stabbing... \n5) It is claimed he prioritised a civic occasion above a further meeting to discuss these issues and other policy matters important to the residents of Torbay. It is said the failure to cancel the meetings in the knowledge he would not be attending ‘demonstrates a lack of common courtesy to members and officers of the council and the residents of Torbay’. \n6) Colleagues say the introduction of an executive motion at the last council meeting without consultation to agree Paignton’s Palace Avenue Theatre should be sold when the council had agreed to seek to secure its future as a community theatre showed apparent ‘limited understanding’ of the proposal, with a motion ‘ill-conceived and lacking an understanding of the views of members’. \n7) It is alleged the mayor left the February council meeting, and has only attended one of the last three council meetings, and only two of the last five scheduled monthly meetings between the mayor and group leaders. \nThe motion is due to be discussed by the Tory Group at its meeting on Monday night. \nIt comes as a sign has gone up in Brixham declaring it is a 'mayor free zone.' \nThe Mayor has been asked for his response. \nIndependent Brixham councillor Mike Morey Tweeted on Sunday: \"Just passed a brand new Town Council Notice Board and saw this. Is this now council policy or just a sign of the times?\" ", "external_links": [], "published": "2017-07-10T18:50:00.000+03:00", "crawled": "2017-07-10T19:21:59.009+03:00", "highlightTitle": ""}