{"organizations": [], "uuid": "ab2f67012633597c81b4024501f5ce8d981bf906", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30433915/16075567.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/suspending-the-whip-from-anne-marie-morris-is-the-right-decision-say-tory-mps/story-30433915-detail/story.html", "country": "GB", "title": "Stand Up To Racism group say Anne Marie Morris must resign now...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-11T12:52:00.000+03:00", "replies_count": 0, "uuid": "ab2f67012633597c81b4024501f5ce8d981bf906"}, "author": "DanielClark", "url": "http://www.devonlive.com/suspending-the-whip-from-anne-marie-morris-is-the-right-decision-say-tory-mps/story-30433915-detail/story.html", "ord_in_thread": 0, "title": "Stand Up To Racism group say Anne Marie Morris must resign now...", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "kevin foster", "sentiment": "none"}, {"name": "marie chadwick", "sentiment": "none"}, {"name": "andrew gwynne", "sentiment": "none"}, {"name": "luke pollard", "sentiment": "none"}, {"name": "weyman bennett", "sentiment": "none"}, {"name": "richard younger-ross", "sentiment": "none"}, {"name": "roger kendrick", "sentiment": "none"}, {"name": "james cleverly", "sentiment": "none"}, {"name": "mrs chadwick", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "heidi allen", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "john redwood", "sentiment": "none"}, {"name": "devonlive", "sentiment": "none"}], "locations": [{"name": "st james square", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "teignbridge", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "south cambridgeshire", "sentiment": "none"}, {"name": "braintree", "sentiment": "none"}, {"name": "central london", "sentiment": "none"}], "organizations": [{"name": "stand up to racism group", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "east india club", "sentiment": "none"}, {"name": "cchq", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "plymouth sutton & devonport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stand Up To Racism group say Anne Marie Morris must resign now after using the N-word By DanielClark | Posted: July 11, 2017 2 COMMENTS SHARES Stand Up To Racism group say Anne Marie Morris must resign now after using the... X \nCopy link to paste in your message / Comments (2) \nThe Stand Up To Racism group has started an online campaign calling for Anne Marie Morris to resign now. \nMs Morris, the MP for Newton Abbot, was recorded using the N-word while addressing a meeting at the exclusive East India Club in St James Square. \nShe described the possibility of the Brexit negotiations concluding with no deal as \"the n****r in the woodpile\". \nShe has since apologised for the remarks, saying: \"\"The comment was unintentional and I apologise unreservedly for any offence caused.\" \nBut she has had the whip suspended by the Conservative Party, which means that although she is still an MP, she is no longer a Conservative MP. \nDevon Live readers have said that Anne Marie Morris should resign as an MP after she was recorded using the N-word at a meeting of eurosceptics in Central London, with a poll on our website saying that 82 per cent of our readers saying she should resign.# \nNow Stand up to Racism have said that they will be pursuing a formal complaint to the Parliamentary Commissioner for Standards and have said that such racist language harks back to the horrors of slavery in the American deep South. \nWeyman Bennett co-convenor of Stand up to Racism says \"There is no excuse for the use of this disgusting racist language, least of all from an MP, Anne Marie Morris should resign immediately. If she fails to do so Theresa May should withdraw the Conservative party whip from Ms Morris and she should be suspended from the House of Commons.\" \nAn urgent investigation into the remarks had been launched by the Conservative Party. A spokesman for CCHQ said: \"We are aware of these reports, this kind of language is completely unacceptable, and we are urgently investigating.\" \nTheresa May said: \"I was shocked to hear of these remarks, which are completely unacceptable I immediately asked the Chief Whip to suspend the party whip. \n\"Language like this has absolutely no place in politics or in today's society.\" \nRead More Anne Marie Morris should resign over N-word use say Devon Live... \nLabour's national campaign co-ordinator Andrew Gwynne, has called for her to resign. He said: \"Anne Marie Morris' comments are outrageous and totally unacceptable. \n\"While the Conservative Party has tabled a debate on Wednesday to apparently discuss and condemn abuse of candidates in the General Election, these comments prove their hypocrisy. \n\"Theresa May once spoke about changing the Tories' 'nasty party' tag. \n\"If she's serious about that, she will admit it's not enough for the Tories to 'investigate' and will apologise and act immediately. If that means withdrawing the whip, that's what they should do.\" \nConservative MPs have said that suspending the whip from Anne Marie Morris is the right decision, but most have stopped short of saying that she should resign. \nJames Cleverly, the Conservative MP for Braintree, said; \"Shocked & disappointed that Anne Marie Morris was so thoughtless & insensitive in her use of language. Suspending the whip is right decision.\" \nKevin Foster, MP for Torbay, said: \"Her comments were not appropriate and she has rightly apologised unreservedly for any offence caused.\" \nBut Heidi Allen, MP for South Cambridgeshire, called for Ms Morris to resign. She said: \"I'm afraid an apology is not good enough - we must show zero tolerance for racism. MPs must lead by example.\" \nLuke Pollard, MP for Plymouth Sutton & Devonport, said that her racist language is completely unacceptable and that she must decide whether to resign. \nIt echoes calls for her resignation that have been made by fellow politicians in Teignbridge. \nMarie Chadwick, who was the Liberal Democrat candidate at the General Election in June, has called for her resignation and said that she has shown her true colours with the remarks. \nMrs Chadwick said: \"She should resign and she needs to resign. She has a history of associating herself with people who hold dubious views and now she has shown that not only does she hold those views, she is not afraid to speak about them. \n\"You simply cannot have people who hold these views representing residents in parliament. \n\"It is worrying for the constituents that she is the MP who represents them and she has shown with these comments that she is simply not up to the job and she needs to resign. \nRichard Younger-Ross, who was the former MP for Teignbridge but lost his seat to her in 2010, said: \"Ms Morris is MP who does little except offend, is one of the worst MPs for replying to correspondence, an MP who seems to be rarely in her constituency, and an MP who seems to do little. \n\"If she was engaged with people, real people, she would not have said such an odious comment that offends people. \n\"She is simply out of touch. She will not resign as an MP, but she should make it clear that she will not re-stand.\" \nMs Morris made the astonishing remark while discussing what financial services deal the UK could struck with Brussels after 2019. \nDespite using the racist term, none of her fellow panelists, including Tory MPs Bill Cash and John Redwood, reacted to the comment. \nAfter saying just seven per cent of financial services in the UK would be affected by Brexit, Morris, who campaigned to leave the EU, said: \"Now I'm sure there will be many people who'll challenge that, but my response and my request is look at the detail, it isn't all doom and gloom. \n\"Now we get to the real n****r in the woodpile which is in two years what happens if there is no deal?\" \nIt comes just after she was forced to distance herself from comments made by her electoral agent and partner at a hustings who claimed 'that the crisis in education was due entirely to non-British born immigrants and their high birth rates'. \nDuring the debate around education and fair funding of schools, a member of the public stood up and said: 'that the crisis in education was due entirely to non-British born immigrants and their high birth rates'. \nThe person who made that remark was Roger Kendrick, who is both Anne Marie Morris's partner and her electoral agent. \nIn response, Anne Marie Morris told DevonLive: \"I don't share the views expressed by Roger Kendrick.\" ", "external_links": [], "published": "2017-07-11T12:52:00.000+03:00", "crawled": "2017-07-11T13:55:15.001+03:00", "highlightTitle": ""}