{"organizations": [], "uuid": "f1a9a26a6c95b4336a4d49a8dfd1eaff6103a6eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13377813.ece/ALTERNATES/s1200/Atlanta-Skyline.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/tech-giant-sage-plans-send-13377711", "country": "GB", "domain_rank": 21960, "title": "Tech giant Sage plans to send two North East firms on trade trip to Atlanta", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-24T16:57:00.000+03:00", "replies_count": 0, "uuid": "f1a9a26a6c95b4336a4d49a8dfd1eaff6103a6eb"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/tech-giant-sage-plans-send-13377711", "ord_in_thread": 0, "title": "Tech giant Sage plans to send two North East firms on trade trip to Atlanta", "locations": [], "entities": {"persons": [{"name": "kasim reed", "sentiment": "none"}, {"name": "womble carlyle", "sentiment": "none"}, {"name": "bond dickinson", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "carter", "sentiment": "none"}, {"name": "alan laing", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "freedom parkway", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "womble carlyle  atlanta", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "southeast united states", "sentiment": "none"}], "organizations": [{"name": "sage", "sentiment": "negative"}, {"name": "atlanta tech", "sentiment": "negative"}, {"name": "uk department for international trade", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "venture atlanta week", "sentiment": "none"}, {"name": "startup exchange", "sentiment": "none"}, {"name": "atlanta mayor’s office of international affairs", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tech giant Sage plans to send two North East firms on trade trip to Atlanta The firm is looking for aerospace, smart cities or cybersecurity firms that want to expand internationally Share Atlanta, Georgia, USA downtown city skyline over Freedom Parkway (Image: iStockphoto) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHistoric links with one of America’s largest cities are being offered to boost businesses in the North East. \nNewcastle has been a ‘sister city’ to Atlanta since the visit of then US president Jimmy Carter in 1977, with the link giving companies on Tyneside access to some lucrative markets in one of the largest cities in the US. \nAtlanta mayor Kasim Reed is set to visit Newcastle later this year and now Newcastle technology company Sage - whose US base is in Atlanta - has launched an international exchange programme that will see two companies from the North East given the chance to pitch for business in the American city. \nThe news of the growing links between the two cities has come as the Government prioritises trade links with the US, with International Trade Secretary Liam Fox in America to explore a post-Brexit free trade deal. Alan Laing of Sage (Image: newcastle chronicle) \nNick Forbes, leader of Newcastle City Council , said: “The digital sector in the region has seen significant growth over the past five of years, and is the fastest growing outside of London, now accounting for over 44,000 employees and nearly £2bn to the regional economy. \n“We have a long established relationship with Atlanta spanning some 40 years, which started back in 1977 when President Carter visited Newcastle. This business exchange programme with our sister city provides an ideal opportunity for innovative businesses to extend into growing overseas markets and explore new opportunities.” \nAtlanta Mayor Kasim Reed added: “I am pleased to support the Startup Exchange between Atlanta and Newcastle. Atlanta is the economic and cultural capital of the Southeast United States, and a thriving technology and innovation hub. \n“Programmes like the Startup Exchange offer valuable experience to entrepreneurs to learn and expand their reach. We are proud that Sage chose Atlanta for its North American headquarters, and look forward to continuing to strengthen ties between Atlanta and Newcastle.” Read More Sage boss tells small businesses: we want to give you your weekends back \nThe business exchange programme is open to firms specialising in technology for smart cities, cybersecurity or aerospace sectors are being urged to apply for the programme. The two successful firms must also be looking to expand into new markets. \nAlan Laing, Sage’s managing director of UK and Ireland, said: “Innovative, imaginative and successful small businesses are essential for our economy and are a key driver of growth. The North East is a powerhouse for creativity and our business exchange programme is focussed on helping companies on a growth path to seize the opportunity and break into new markets. \n“We’re proud of our roots in the region and are committed to supporting other North East businesses to grow and expand so we’re delighted to be able to provide a helping hand for those who want to take the next step on an exciting transformation journey with overseas expansion and play a role in creating a region of successful entrepreneurs.” \nThe visit to Atlanta is being organised in collaboration with the UK Department for International Trade, Newcastle City Council, Invest Atlanta and the Atlanta Mayor’s Office of International Affairs. \nIt will take place during either Atlanta Cyber Week or Venture Atlanta Week, both of which take place in October. Read More Newcastle's Bond Dickinson pulls off prize US merger with Womble Carlyle \nAtlanta boasts strong financial services, technology, and telecommunications industries. The city’s gross metropolitan product value - the measure of the goods and services an area produces - is $312.5bn, meaning firms that prove successful in the programme are being offered the chance to tap into a huge market. \nA number of Newcastle firms have opened offices in Atlanta, while law firm Bond Dickinson is due to merge with Atlanta’s Womble Carlyle in October and hopes to facilitate more trade between the two cities. Like us on Facebook", "external_links": [], "published": "2017-07-24T16:57:00.000+03:00", "crawled": "2017-07-24T17:20:26.040+03:00", "highlightTitle": ""}