{"organizations": [], "uuid": "8d9a442a48e3da591864ddd0993473a4b7a3e452", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13383639.ece/ALTERNATES/s1200/grayling.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/salt-wounds-calls-major-new-13382960", "country": "GB", "domain_rank": 21960, "title": "Salt in the wounds? Calls for major new rail line for the North as £30bn London project is backed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-26T07:00:00.000+03:00", "replies_count": 0, "uuid": "8d9a442a48e3da591864ddd0993473a4b7a3e452"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/salt-wounds-calls-major-new-13382960", "ord_in_thread": 0, "title": "Salt in the wounds? Calls for major new rail line for the North as £30bn London project is backed", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "grayling", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "ed cox", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "crossrail", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "central station", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "epsom", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "hertfordshire", "sentiment": "none"}, {"name": "maidenhead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "crossrail", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "invalid email  campaigners", "sentiment": "none"}, {"name": "north as labour", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "hm treasury", "sentiment": "none"}, {"name": "crossrail", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "surrey", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Salt in the wounds? Calls for major new rail line for the North as £30bn London project is backed New line linking North East and North West would go some way to tackling lack of investment in the North Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCampaigners have launched a petition demanding the Government press ahead with plans for a new high speed rail line linking the North East and North West. \nThey want a rail line as part of a bid to cut the huge gap in infrastructure investment between the north and the south. \nThink tank IPPR North has examined funding for infrastructure such as transport schemes over the past 10 years, and found that the north of England would have received £59bn more over the last decade if it had received the same funding per person as London. \nIt has now launched a petition calling for the Government to fund a new rail line. \nThe Conservative General Election manifesto included plans for a new “ Northern Powerhouse rail” line, expected to link Liverpool, Manchester, Leeds, Hull, Sheffield and Newcastle. \nLabour is proposing a similar scheme, which it calls Crossrail for the North. The proposed line has also been called HS3. \nThe funding gap was highlighted when Transport Secretary Chris Grayling backed £30bn plans for Crossrail 2 in London and the south east, days after a series of rail projects in Wales, the East Midlands and the north were downgraded or axed. Transport Secretary Chris Grayling (Image: PA) \nOne scheme, the electrification of the line between Leeds and Manchester, part of a wider plan to upgrade the entire transpennine line west from Liverpool, to Hull and Newcastle, was seen as a key element of the ‘Northern Powerhouse’ to boost the economy across the region through a “Crossrail for the North”. \nBut the Government has now said the line will be only partly electrified. \nIPPR North director, Ed Cox, said: “To approve or back Crossrail 2 ahead of backing the Northern Powerhouse rail programme is really rubbing salt into the wounds. \n“And to do it when Parliament’s in recess and there can’t be further questions of the decision taken creates greater anger and resentment. \n“We are going to be calling for the Transport Secretary to pledge backing for Crossrail for the north. \n“Over the past decade we have spent £59bn more in London than in the north of England so over the next decade there’s £59bn catch-up cash should be devolved to transport for the north. \n“Actually there’s huge economic potential in the north of England. But we need to invest in the north, it’s just very short sighted to be constantly mitigating congestion in the south rather than investing in the north.” General view of Central Station in Newcastle (Image: Newcastle Chronicle) \nMr Grayling confirmed the Government remained committed to building the rail line earlier this month. \nHe told the House of Commons that MPs “will have seen in our manifesto the commitment to the northern powerhouse rail programme, which will mean a significant change in the balance.” \nThe Transport Secretary said the Government was waiting for Transport for the North, a regional transport body backed by local councils, to complete proposals for the line. \nCrossrail 2 will run across London between Hertfordshire and Surrey at an estimated cost of £30bn. The new scheme would start in Epsom, Mr Grayling’s own constituency. \nCrossrail 1, already under construction in London, is estimated to cost £14.8bn and runs through Maidenhead, whose MP is Theresa May. Read More Jeremy Corbyn talks of Crossrail for the North as Labour manifesto promises transport revolution \nResearch by the IPPR North shows what it called a “scandal” of unfair investment in London and the south east above the regions, with the north missing out on £6bn each year in taxpayers’ cash. \nIt says this regional imbalance fuelled the Brexit vote, and a sense that the rest of the UK is left-behind the capital’s success. \nAn HM Treasury spokesperson said: “We have a strong record of investment in the North. Since 2010, more than 540 infrastructure projects have been completed in the area, with 175 more to come. \n“We are investing £13bn into Northern transport links, ensuring communities are better connected. And we have also invested over £3.3bn into Local Enterprise Partnerships, which provide finance to local infrastructure schemes.” Like us on Facebook ", "external_links": [], "published": "2017-07-26T07:00:00.000+03:00", "crawled": "2017-07-26T07:49:42.002+03:00", "highlightTitle": ""}