{"organizations": [], "uuid": "643319866a6d6149fe9f0cf2b5eeb14c2cf90da5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12351231.ece/ALTERNATES/s1200/Unusual-abstract-and-rarely-seen-views-of-the-Newcastle-Upon-Tyne-Bridges.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13268997", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-02T11:04:00.000+03:00", "replies_count": 0, "uuid": "643319866a6d6149fe9f0cf2b5eeb14c2cf90da5"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13268997", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tom eden", "sentiment": "negative"}, {"name": "briony lynne guy", "sentiment": "none"}, {"name": "briony", "sentiment": "none"}], "locations": [{"name": "missing durham", "sentiment": "none"}, {"name": "bowburn", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "framwellgate comprehensive school", "sentiment": "none"}, {"name": "durham constabulary", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "durham police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT 'Drunk' man brought down from edge of bridge \nA man was arrested after climbing onto the edge of the Redheugh Bridge while allegedly drunk on Saturday night. (Photo: Newcastle Journal) \nPolice were called to the bridge over the River Tyne to reports of a man on the wrong side of the barrier, and after talking him down, officers arrested him on suspicion of being drunk and disorderly. \nThe man remains in police custody. \nA Northumbria Police spokeswoman said: “At 9.20pm last night, police received a report of a man on the wrong side of the railings on the Redheugh Bridge. \n“Officers attended and the man was brought to safety and arrested for being drunk and disorderly.” 11:47 Ashington man charged with rape \nA 20-year-old man has been charged with the alleged rape of a woman in Ashington. Langwell Crescent area in Ashington (Photo: Google Street View) \nRyan Brody from Ashington has been charged with rape after a woman was allegedly attacked near the cricket ground during the early hours of Thursday, June 29. \nThe 20-year-old was arrested on suspicion of rape on Friday night and he is due to appear at South East Northumberland Magistrates’ Court on Monday, July 3. \nOfficers say a woman had been walking in the Langwell Crescent area of Ashington at around 1.30am on Thursday when she was allegedly attacked. \nNorthumbria Police say they will have officers on patrol in the area to reassure the public. \nPolice are continuing to appeal for witnesses and anyone with information should contact Northumbria Police on 101 quoting reference 970 290617 or Crimestoppers anonymously on 0800 555 111. 11:12 Longest jail terms handed to North East criminals \nThese are some of the longest jail sentences handed down to North East criminals. \nSometimes a judge decided the crime so heinous, the only option is to take the perpetrator off our streets for a very long time. \nAnd for most of the criminals on our list, they will be well into their old age before they stand any chance of tasting freedom. \nThe majority of the offenders are murderers, but two were slammed with huge sentences for helping a notorious killer evade justice. \nThe longest single sentence handed down is 40 years while those responsible for Jimmy Prout’s death were jailed for a combined 81 years. North East criminals who have received the longest jail terms Politics Tom Eden Boris backs May's Brexit plan \nBoris Johnson backs Theresa May’s Brexit plan “100%” despite claims he could welcome an easing up on the Prime Minister’s “red lines” for negotiations, a source close to the Foreign Secretary has said. (Photo: Newcastle Chronicle) \nIt comes after Brexit Secretary David Davis’s former chief of staff James Chapman claimed Mrs May’s insistence on leaving the jurisdiction of the European Court of Justice (ECJ) had “hamstrung” his ex-boss in negotiations. \nMr Chapman also claimed the likes of Mr Davis and Mr Johnson could welcome an easing of the PM’s Brexit demands, including on leaving the ECJ and Euratom (European Atomic Energy Community), and potentially on immigration. \nBut a source close to Mr Johnson said he fully supports the Brexit vision Mrs May set out in her Lancaster House speech in January, including leaving the ECJ, single market and customs union. \nThe Foreign Secretary also wants “managed immigration”, while being a supporter of Britain being an “open and diverse country”. \nIt came as a Number 10 source played down suggestions Mrs May is going to walk out of Brexit talks in September in a staged show of defiance over EU demands for a “divorce bill” of tens of billions of pounds. 10:29 McDonald's home delivery available in Newcastle \nThe much-awaited new McDonald’s home delivery service has arrived in Newcastle. (Photo: Rui Vieira/PA Wire) \nThe ‘McDelivery’service means you can get a McDonald’s meal delivered to your door if you live in or close to the city centre. \nThe service is available from the Northumberland Street branch of McDonald’s through the UberEATS app, which launched in June. \nCustomers within 1.5 miles of a restaurant are able to order breakfast, lunch and dinner menu items from 8am to midnight seven days a week. \nThe service is also available in 15 other cities across the UK. \nOther Newcastle restaurants with delivery services available through UberEATs include: The Grind @ No. 28, Rub Smokehouse, Portofino Italian restaurant, Viet Cafe on the Bigg Market, Master Chinese restaurant and Rani Indian restaurant. \nOthers are expected to be added as the service develops. NUFC Tom Eden Newcastle 'make enquiry' about Joe Hart \nRafa Benitez is hoping to lure England No 1 Joe Hart to Newcastle United this summer, according to reports. (Photo: Getty Images Europe) \nThe 30-year-old has won two Premier League titles, two League Cups and a FA Cup with Manchester City but he is surplus to requirements at The Etihad. \nPep Guardiola sent the 6ft 5in goalkeeper out on loan during the Spaniard’s debut campaign in England, with Hart having to move to Italy to join up with Torino late in the window last summer. \nManchester United, West Ham United, Chelsea and Liverpool are among the clubs to have already been linked with a move for Hart, but The Daily Mail is reporting that Newcastle have now made an “enquiry” for the England international. ", "external_links": [], "published": "2017-07-02T11:04:00.000+03:00", "crawled": "2017-07-02T11:15:42.029+03:00", "highlightTitle": ""}