{"organizations": [], "uuid": "15eeaf369052cfe792e0d5603d6c609a09ac2b5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13395691.ece/ALTERNATES/s1200/JS67160138.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heading-abroad-your-car-summer-13395201", "country": "GB", "domain_rank": 21960, "title": "Heading abroad in your car this summer? Make sure you know the rules of the road", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-30T07:00:00.000+03:00", "replies_count": 0, "uuid": "15eeaf369052cfe792e0d5603d6c609a09ac2b5f"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heading-abroad-your-car-summer-13395201", "ord_in_thread": 0, "title": "Heading abroad in your car this summer? Make sure you know the rules of the road", "locations": [], "entities": {"persons": [], "locations": [{"name": "cyprus", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "malta", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "latvia", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "liechtenstein", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "slovenia", "sentiment": "none"}, {"name": "slovakia", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "lithuania", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}, {"name": "irish republic", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "czech republic", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "finland", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "estonia", "sentiment": "none"}], "organizations": [{"name": "rac", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Heading abroad in your car this summer? Make sure you know the rules of the road Lookers and the RAC have provided some tips for Geordies on what the law requires you do to on foreign roads Share Make sure you know the rules of the road when you head abroad Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThousands of people will be taking their cars abroad this summer. \nFor many it will be a trouble-free experience but some will have accidents or fall foul of unexpected driving laws. \nDid you know that it is compulsory to carry a portable breathalyser on French roads? \nOr that you have to have two reflective jackets in Italy, Spain, Portugal, Austria and Croatia. \nBut sorry, kids, you may be able to drive in the UK at 17 but the age limit is 18 in most other countries. \nWe have some advice from car dealership Lookers and the RAC on some of the pitfalls. \nSo fasten your seatbelts for some top tips and the questions you should be asking. \n1. Am I allowed to drive abroad? \nSome countries do not accept a full, clean UK driving license, so make sure you check the laws before you go, including national speed limits. \nYou may need to apply for extra documents, such as an International Driving Permit, and while UK licenses are generally accepted in other EU countries, the outcome of Brexit negotiations may change this. \nThe list of countries who happily accept a UK driving licence without a problem are: Austria, Belgium, Bulgaria, Czech Republic, Republic of Cyprus, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovenia, Slovakia, Spain and Sweden \n2. Am I insured? \nMost insurance policies cover a third party as standard overseas, but you may need to pay a little extra to be protected to the level you’re used to. \nIf you are planning on hiring a car abroad you also need to check your insurance. \nCheck the terms and conditions of your breakdown cover and see if you are protected outside of the UK. \nIt is also a good idea to let your car insurance company know that you plan to drive your car while you are away,On the right side of the road? \n3. Which side of the road? \nYou must remember that most European countries drive on the right side of the road but there are exemptions. \nThe Irish Republic, Malta and Cyprus do it the way we do it. \nBut elsewhere you’ll be negotiating roundabouts anti-clockwise rather than clockwise! \n4. Will I need a GB sticker? \nAs well as the usual suspects (fire extinguisher, first-aid kit, wheel chains etc) you’ll need a GB sticker on your car. \nOther compulsory must-haves in some countries include a warning triangle and, in Italy, Spain, Portugal, Austria or Croatia, two reflective jackets. \n5. Will I need to prove I have a clean car? \nYes, but we’re not talking about tidying up the sweet wrappers and left-over sandwiches. \n‘Clean air’ windscreen stickers, called Crit’Air vignettes, are now a legal requirement in parts of France, including Paris. \nThese identify a vehicle’s emission levels and were introduced as a way of reducing levels of Co2. \nThey can even be used to refuse entry on days where cities are at risk of reaching their Euro emissions limit. \nStickers cover six categories and cost as little as £3.20, but driving without one can incur an on-the-spot fine of up to £117. You can apply online for a sticker via the official Crit’Air website. Read More \n6. Can I break the speed limit of German autobahns? \nNo, because there aren’t any. \nIt’s wise to educate yourself on local driving laws and customs, speed limits and restrictions before you drive overseas. \nWhile some of these might already be well known, such as the lack of any speed limits on the German autobahn, others, such as fines for splashing pedestrians in Japan, may come as a surprise. \n7. Can I use my blue badge? \nWhile rights differ from country to country, if you have mobility problems, you can rest assured that the blue badge scheme is recognised across Europe. \nHowever, rights do vary, so it’s worth checking where, when and for how long you can park with your blue badge. \nMotorists with mobility issues should visit www.disabledmotorists.eu , where they can print off a notice in the local language which explains their situation. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n8. Should I take local currency? \nMany European countries operate toll roads, so make sure you have plenty of loose change in the correct currency to cover the cost of tolls. \n9. Are there any other restrictions? \nIn Spain motorcycles on the road must have their lights on at all times. \nIn Belgium a foreign driving licence does not entitle the holder to drive a motor vehicle in Belgium until the age of 18. \nIn Italy civil liability insurance is compulsory – a Green Card is the best option, which can be arranged in advance or taken out at the Italian border. \nIn Germany you will need headlamp beam deflectors or, if not fitted, you will have to adjust the beam manually. Read More \n10. Are only automatic cars allowed on roads n Europe? \nNo, but Lookers suggest you might want to hire one. \nThere’s already enough to get your head around when driving abroad. Why not give yourself a break and avoid unnecessary stalling by hiring an automatic. Like us on Facebook ", "external_links": [], "published": "2017-07-30T07:00:00.000+03:00", "crawled": "2017-07-30T08:06:00.000+03:00", "highlightTitle": ""}