{"organizations": [], "uuid": "241edf0d823a43a8093b87fc73ef62781349d29a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article7692877.ece/ALTERNATES/s1200/JS44920757.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/jobs-could-saved-nestle-newcastle-13284058", "country": "GB", "domain_rank": 21960, "title": "Jobs could be saved at Nestle Newcastle with £1.2m investment, union claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-05T12:31:00.000+03:00", "replies_count": 0, "uuid": "241edf0d823a43a8093b87fc73ef62781349d29a"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/jobs-could-saved-nestle-newcastle-13284058", "ord_in_thread": 0, "title": "Jobs could be saved at Nestle Newcastle with £1.2m investment, union claims", "locations": [], "entities": {"persons": [{"name": "eamon o’hearn", "sentiment": "none"}, {"name": "caramac", "sentiment": "none"}, {"name": "nestlé", "sentiment": "none"}, {"name": "rowntree", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "fawdon", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "nestlé uk", "sentiment": "none"}, {"name": "washington  the fawdon", "sentiment": "none"}, {"name": "halifax", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "kargowa", "sentiment": "none"}], "organizations": [{"name": "nestle newcastle", "sentiment": "negative"}, {"name": "business jobs", "sentiment": "negative"}, {"name": "gmb", "sentiment": "negative"}, {"name": "pepsico", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "fawdon", "sentiment": "none"}, {"name": "bae systems", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "nestlé uk", "sentiment": "none"}, {"name": "blue riband", "sentiment": "none"}, {"name": "pepsi co", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nestle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Jobs could be saved at Nestle Newcastle with £1.2m investment, union claims The GMB says that the investment at Fawdon would be sufficient to keep Blue Riband production in the North East Share Get business   Thank you for subscribing! Could   \nJobs could be saved at Nestlé's Newcastle factory and the Blue Riband chocolate bar kept in the UK if a £1.2m investment is made, unions have claimed. \nAround 110 jobs at the Fawdon factory in Newcastle are among 300 at risk in total, with the other jobs in jeopardy being in York, Halifax and Scotland. \nThe proposed changes would see production of the famous biscuit switching to one of the global confectioner’s facilities in Poland. \nBut the GMB claims that during consultation meetings with Nestlé UK, it learned the company could keep Blue Riband production and save jobs in the UK for a one-off capital investment of just over £1m. \nA GMB spokesman said: “It was revealed during the consultation process with Nestle representatives when we challenged their track record of capital investment. \n“They acknowledged that capital investment in the production line at Fawdon of circa £1.2m would be sufficient.” \nThe Nestle proposals came not longer after 355 job were lost at the Walkers factory in Peterlee, County Durham, which is being closed by owners PepsiCo. \nEamon O’Hearn, GMB National Officer, said: “The job losses at food giants like Nestlé UK and Pepsi Co are just the tip of the iceberg if companies are not given guarantees on Brexit from this Government, especially on any future trade tariffs. \n“Losing nearly 700 jobs from the North East and York will have a devastating impact on workers, their families and the local economy.” Read More Sevcon appoints new managing director Dave Sidlow from neighbouring firm \nBlue Riband has been made in Britain since 1936 and is primarily consumed by the UK market. \nThe Fawdon factory, which was previously operated by Rowntree, is almost 50 years old and much of its machinery is old, though workers said there had been investment recently in the Blue Riband production line. \nWhen the announcement was first made, Nestlé said the move would simplify production procedures at Fawdon, which produces a wide range of products, including Rolo, Fruit Pastilles, Caramac and Breakaway. \nNestle stressed that of the 298 potential redundancies announced back in April only 80 are directly related to Blue Riband, which is made in Fawdon , and that the proposed changes relate mainly to changing shift patterns. \nA Nestlé spokesman said: “On April 25, Nestlé UK informed employees of proposals to make some changes to the factory operations within its UK confectionery business. These proposals are being made by Nestlé UK to ensure that these sites operate more efficiently and remain competitive. \n“The proposed changes are mainly to shift patterns across our confectionery factories to reflect changing production requirements. \n“They also include the proposed transfer of Blue Riband production to a Nestle factory in Poland which would result in 80 redundancies, which we hope would be achieved on a voluntary basis. All proposals are still under consultation. \n“The reality is Fawdon is the most complex of our confectionery factories with the facilities to produce everything from biscuits and soft wafer-based biscuits to chocolate singles, sharing bags, sugar confectionery and seasonal products. Read More Recycling firm O'Brien WRS sold to waste collection giant Biffa Waste Services \n“We are proposing to simplify the operation at Fawdon factory by moving the production of Blue Riband to our factory at Kargowa in Poland which is one of Nestlé’s global centres of confectionery excellence with existing capacity to produce the soft wafer Blue Riband requires. \n“This will reduce the number of technologies that Fawdon needs to maintain.” \nCatherine McKinnell, MP for Newcastle North, said: “The Nestle factory is a hugely important source of employment in my constituency, and the loss of over 100 good jobs will clearly have a devastating effect on Fawdon and the local economy. \n“Yet, it appears that the large majority of these jobs could be saved for what is a relatively small amount of capital investment for a multinational firm like Nestle. \n“The Government should be straining every sinew to retain these jobs here in Newcastle – and I have repeatedly called on Ministers to intervene to do just that. Yet, their response so far appears to involve directing those affected to the nearest Job Centre. \n“This is just not good enough, and I will continue to press Ministers to take an urgent and proactive interest in this issue.” Like us on Facebook", "external_links": [], "published": "2017-07-05T12:31:00.000+03:00", "crawled": "2017-07-05T13:14:09.001+03:00", "highlightTitle": ""}