{"organizations": [], "uuid": "73eddd43b63cc44b0224101734dd8e50e9236f19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13408575.ece/ALTERNATES/s1200/Mobile-phone-companies-fines.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/charging-your-mobile-phone-overnight-13408532", "country": "GB", "domain_rank": 21960, "title": "Why charging your mobile phone overnight could be a fatal mistake", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-31T10:45:00.000+03:00", "replies_count": 0, "uuid": "73eddd43b63cc44b0224101734dd8e50e9236f19"}, "author": "Craig Thompson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/charging-your-mobile-phone-overnight-13408532", "ord_in_thread": 0, "title": "Why charging your mobile phone overnight could be a fatal mistake", "locations": [], "entities": {"persons": [{"name": "dominic littlewood", "sentiment": "none"}, {"name": "dom", "sentiment": "none"}, {"name": "littlewood", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "itv", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why charging your mobile phone overnight could be a fatal mistake Safety experts say we should think carefully about the way we are charging our mobile phones in our homes Share A man using a a mobile phone (Image: PA) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nWe’ve all been there. \nAbout to fall asleep but knowing something isn’t quite right. \nYou sit up with as jolt - and remember. \nYou’re mobile phone is not plugged in. \nObviously, plugging your phone in to get some juice through the night is both handy and convenient. \nBut Dominic Littlewood, a consumer affairs expert, has revealed how leaving anything on charge for an extended period of time can be incredibly dangerous as it poses a fire risk. \nSpeaking on an episode of Good Morning Britain, which aired on ITV , Mr Littlewood said it’s not just the fact that we’re charging our phones for hours that should cause concern. \nIn fact, it’s also where we’re putting them. Read More Roaming charges to use mobile phones in EU will be scrapped this summer - but will Brexit affect it? \nDom strongly advices against people sleeping with their phones in bed, as people place their devices under their pillow so they can hear their alarm clock in the morning. \nDoing so could pose a fire risk - with phone batteries heating up while charging, and potentially setting fire to bed sheets and linen. \nInstead, Dom says we should place our phones on a saucer, because that way if it gets hot, the china won’t catch alight and we are protected. Read More \nBut the consumer expert also says charging your phone overnight could do long-term damage to its battery. \nAccording to PC Advisor, you should never charge the battery all the way to 100 per cent. \nThis is because constantly doing a full recharge will shorten the battery’s lifespan. Like us on Facebook ", "external_links": [], "published": "2017-07-31T10:45:00.000+03:00", "crawled": "2017-07-31T12:00:41.007+03:00", "highlightTitle": ""}