{"organizations": [], "uuid": "34149465340ccaa3d04ad2d848fd74de280e7bb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13348970.ece/ALTERNATES/s1200/DBR_SCU_011214foodstuufs_05.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/brexit-poses-real-risks-uk-13349030", "country": "GB", "domain_rank": 21960, "title": "Brexit poses 'real risks' to UK food supplies, new report warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-18T16:35:00.000+03:00", "replies_count": 0, "uuid": "34149465340ccaa3d04ad2d848fd74de280e7bb1"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/farming/brexit-poses-real-risks-uk-13349030", "ord_in_thread": 0, "title": "Brexit poses 'real risks' to UK food supplies, new report warns", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "terry marsden", "sentiment": "none"}, {"name": "erik millstone", "sentiment": "none"}, {"name": "mr lang", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "lang", "sentiment": "none"}, {"name": "tim lang", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "university of sussex", "sentiment": "none"}, {"name": "science policy research unit", "sentiment": "none"}, {"name": "city university", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cardiff university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit poses 'real risks' to UK food supplies, new report warns Report from three UK universities warns of 'chaos' unless Government acts to help farmers and food producers Share Government has been warned it needs a plan when it comes to food supply, following Brexit (Image: PA) Share Get business updates   Thank you for subscribing! Could   \nBrexit poses “real risks” to the cost, availability and quality of the UK’s food supplies, which the Government has shown little sign of addressing, researchers claim. \nA report from food policy specialists has warned the forthcoming break from Europe will lead to “chaos” unless ministers establish a clear plan on how a new food system will operate. \nCurrently, the EU props up a huge chunk of Britain’s food supply - providing 31% of its food - which the authors suggest cannot be walked away from without provisions in place. \nThe researchers from three UK universities launched the 86-page review into how Brexit could impact the country’s food and farming as the Government gears up for the next round of negotiations with Brussels. \nStability and security which is enjoyed in both the price and supply of food is partly product of EU-wide safety standards, the authors warn. \nEven a “soft” departure from Europe, in which the UK will remain in the single market or customs union, could badly affect the food and farming industries, they add. \nAuthor Tim Lang, a professor from City University in London, accused the Government of a “serious policy failing on an unprecedented scale” for its handling of the situation in the run-up to Brexit. \nAhead of the departure deadline, there are thousands of pieces of legislation concerning food which require consideration, covering areas such as agriculture and fisheries. \nMr Lang said: “The Government has provided next to no details on agriculture and fisheries, and there has been total silence on the rest of the food chain where most employment, value adding and consumer choice are made. Read More Farming could face huge labour shortages unless Government acts, industry warns \n“With the Brexit deadline in 20 months, this is a serious policy failure on an unprecedented scale. Anyone would think they want a drop into the World Trade Organisation abyss.” \nHe added: “At least the UK entered World War Two with emergency plans. No-one has warned the public that a Food Brexit carries real risks of disruption to sources, prices and quality.” \nTheir findings, published by the Science Policy Research Unit at the University of Sussex, identifies 16 issues which it urges Prime Minister Theresa May to consider. \nThese include a “clear integrated plan for UK food”, new legislation to “replace 4,000 pieces of EU law relating to food” and subsidies to cover the EU’s Common Agricultural Policy, which the UK is expected to leave. \nIt also warns that a drain on labour from the continent could rattle the production of food, with 35% of food manufacturing workers said to come from the EU. Read More Newcastle's Northern Bear finally wipes out recession-era debt after 'outstanding' year \nThe report, which is based on more than 200 sources, continues: “Prices, which are already rising and likely to rise more, will become more volatile, especially harming poor consumers.” \nNegotiations over the nature of Britain’s divorce from the continent will continue on Monday as Brexit Secretary David Davis travels for talks in Brussels. \nIn the briefing paper released on the eve of the visit, Mr Lang, alongside co-authors Terry Marsden, of Cardiff University and Erik Millstone from the University of Sussex, a call is made for the public to pressure the Government into making a “new statutory framework for UK food”. Like us on Facebook", "external_links": [], "published": "2017-07-18T16:35:00.000+03:00", "crawled": "2017-07-18T17:01:13.006+03:00", "highlightTitle": ""}