{"organizations": [], "uuid": "0057c722adf8e78fa1fa52aeafd75834f3b6fd61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30420957/16066912.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/devon-fishermen-welcome-ban-on-foreign-fishing-vessels/story-30420957-detail/story.html", "country": "GB", "title": "C_Abbott commented Devon fishermen welcome ban on foreign fishing vessels", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-03T14:36:00.000+03:00", "replies_count": 0, "uuid": "0057c722adf8e78fa1fa52aeafd75834f3b6fd61"}, "author": "C_Abbott", "url": "http://www.devonlive.com/devon-fishermen-welcome-ban-on-foreign-fishing-vessels/story-30420957-detail/story.html", "ord_in_thread": 0, "title": "C_Abbott commented Devon fishermen welcome ban on foreign fishing vessels", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "jim portus", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "portus", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "brixham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european community", "sentiment": "none"}, {"name": "south western fish producers organisation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon fishermen welcome ban on foreign fishing vessels X \nCopy link to paste in your message / Comments (2) \nDevon's fishermen are celebrating the 'tantalising' announcement that foreign boats will be banned from fishing in waters within 12 miles of the British coast, which will leave them to reap the economic benefits. \nJim Portus, one of the South West's most respected fishing industry leaders, welcomed the announcement, made by Environment Secretary Michael Gove, that the UK was leaving the London Fisheries Convention. It means that in two years' time, fishing vessels from France, Belgium, Germany, Ireland and the Netherlands will no longer have access to Britain's waters. \nHe said: \"The foreign fishermen are taking millions of pounds' worth of fish every year. That fish should be available for British fishermen in the future.\" \nBut he added that there was still a risk that exclusive access arrangements would be negotiated away to European countries by our politicians. \nMr Portus, chief executive of the South Western Fish Producers Organisation, said: \"Absolutely yes, we welcome the Government's announcement. It's something I, and the organisation I work for, and the fishermen, have been campaigning for since about the time of the referendum. \n\"We realised quite some time ago that this quirky piece of legislation existed and it needed dealing with more or less at the same time as Brexit. It's nothing to do with Brexit; it's something that was agreed before we joined the European Community. We were concerned that it would continue after the end of the Common Fisheries Policy. \nRead next: Steam engine fans disappointed as Tornado runs out of puff \n\"Various organisations took legal advice and presented evidence to ministers. Around the time of triggering Article 50 we would have liked the two years' notice to be coincident but the Government delayed, presumably while taking more legal advice. \n\"Michael Gove has done the right thing and made this announcement and I'm sure the fishing industry is celebrating being one step closer to having more control of our resources and the opportunity to have exclusive access to our waters.\" \nThe London Fisheries Convention was signed in 1964, before the UK joined the European Union. It allows vessels from France, Belgium, Germany, Ireland and the Netherlands to fish between six and 12 nautical miles of the UK's coastline. It sits alongside the EU Common Fisheries Policy which allows all European countries access between 12 and 200 nautical miles of the UK and sets quotas for how much fish nations can catch. \nThe Government has said that this move will enable the UK to become fully responsible for fisheries management and lead to a 'more competitive, profitable and sustainable industry'. In the move, UK vessels will also lose the right to fish in the waters six to 12 miles off the coast of the other countries. \nRead next: New one-day festival brings chart toppers to Torquay \nMr Portus said there was much work to be done over the next couple of years. He said: \"Nothing will happen for two years as notice has to be given to get us extricated from the arrangement. The problem is we've got Brexit negotiations going on also. You have to get rid of one piece of legislation before you can replace it. \n\"Over the coming two years I will continue to lobby to ensure that our politicians don't use the fishing industry as a negotiating point to give away access arrangements now that we've got them back. It's tantalising, this exclusivity we should have in two years' time, but there are risks we could be negotiated away. We've got to make sure Michael Gove and his Defra team maintain their resolve and make sure our fishermen are well looked after. \n\"I look forward to having conversations with ministers on behalf of the fishermen of Brixham and Torbay and fishermen from other fishing communities I represent. They will all be interested to know what's in it for them in the future.\" \nIn 2015, the UK fishing industry landed 708,000 tonnes of fish worth £775million. Under the convention, around 10,000 tonnes of fish was caught by other countries, worth an estimated £17million. ", "external_links": [], "published": "2017-07-03T14:36:00.000+03:00", "crawled": "2017-07-03T15:51:20.000+03:00", "highlightTitle": ""}