{"organizations": [], "uuid": "c77b95054f273a4db38d79d2ba75e696ab9f3111", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30433659/16075232.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/what-does-withdraw-the-whip-mean/story-30433659-detail/story.html", "country": "US", "title": "What does 'withdraw the whip' mean? | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.197, "site_type": "news", "published": "2017-07-11T15:43:00.000+03:00", "replies_count": 0, "uuid": "c77b95054f273a4db38d79d2ba75e696ab9f3111"}, "author": "", "url": "http://www.devonlive.com/what-does-withdraw-the-whip-mean/story-30433659-detail/story.html", "ord_in_thread": 0, "title": "What does 'withdraw the whip' mean? | Devon Live", "locations": [], "entities": {"persons": [{"name": "newton abbot", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "central london", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "conservative party chiefs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What does 'withdraw the whip' mean? By Neil_Shaw | Posted: July 11, 2017 0 COMMENTS SHARES Comments (0) \nDevon MP Anne Marie Morris has had the whip withdrawn on the instructions of Conservative Party leader and Prime Minister Theresa may, after Morris used the N-word during a debate on Brexit. \nEach party has a whip whose job is to ensure party discipline in a legislature. Whips are the party's \"enforcers\"; they invite their fellow legislators to attend voting sessions and to vote according to the official party policy. The term is taken from the \"whipper-in\" during a hunt, who tries to prevent the hounds from wandering away from the pack. \nAdditionally the term \"whip\" may also mean the voting instructions issued to members by the whip, or the status of a certain legislator in their party's parliamentary grouping. \nIn this case the term whip refers to the member's status within the party. \nAccording to Parliament, withdrawing the whip means a member is effectively suspended from their party, but remains an MP, and sits as an independent until the whip is restored. \nThe chief whip of the governing party in the House of Commons is customarily appointed as Parliamentary Secretary to the Treasury, has a seat and a voice in the Cabinet and has an official residence at 12 Downing Street, although the chief whip's office is currently located at 9 Downing Street. \nIn the United Kingdom, there are three categories of whip that are issued on particular business. An expressed instruction on how to vote could constitute a breach of parliamentary privilege, so the party's wishes are expressed unequivocally but indirectly. These whips are issued to MPs in the form of a letter outlining the parliamentary schedule, with a sentence such as \"Your attendance is absolutely essential\" next to each debate in which there will be a vote, underlined one, two or three times according to the severity of the whip: A single-line whip is a guide to what the party's policy would indicate, and notification of when the vote is expected to take place; this is non-binding for attendance or voting. A two-line whip , sometimes known as a double-line whip , is an instruction to attend and vote; partially binding for voting, attendance required unless prior permission given by the whip. A three-line whip is a strict instruction to attend and vote, breach of which would normally have serious consequences. Permission not to attend may be given by the whip, but a serious reason is needed. Breach of a three-line whip can lead to expulsion from the parliamentary political group in extreme circumstances and may lead to expulsion from the party. Consequently, three-line whips are generally only issued on key issues, such as votes of confidence and supply. \nDevon MP Anne Marie Morris has had the whip withdrawn by Conservative party chiefs. Prime Minister Theresa May has suspended the whip from her after she was recorded using the N-word at a meeting of eurosceptics in Central London. \nMs Morris described the UK leaving the EU without a deal as a \"real n", "external_links": [], "published": "2017-07-11T15:43:00.000+03:00", "crawled": "2017-07-11T11:34:46.003+03:00", "highlightTitle": ""}