{"organizations": [], "uuid": "ca6d91d51bd78e49262077964175617884843222", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/incoming/article185426.ece/ALTERNATES/s1200/270617-Belmont_Hotel_PF-1020.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/belmont-hotel-boss-apprenticeships-can-185420", "country": "US", "domain_rank": 48128, "title": "Belmont Hotel boss: 'Apprenticeships can fill skills crisis' - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.196, "site_type": "news", "published": "2017-07-19T08:00:00.000+03:00", "replies_count": 0, "uuid": "ca6d91d51bd78e49262077964175617884843222"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/belmont-hotel-boss-apprenticeships-can-185420", "ord_in_thread": 0, "title": "Belmont Hotel boss: 'Apprenticeships can fill skills crisis' - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "spencer griffiths", "sentiment": "negative"}, {"name": "chole williamson", "sentiment": "negative"}, {"name": "gordon ramsey", "sentiment": "none"}, {"name": "david ferguson", "sentiment": "none"}, {"name": "tom metcalfe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "chloe williamson", "sentiment": "none"}, {"name": "montagnier", "sentiment": "none"}, {"name": "eloic montagnier", "sentiment": "none"}, {"name": "chloe", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}], "locations": [{"name": "belmont hotel", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "countesthorpe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "belmont", "sentiment": "none"}, {"name": "evington", "sentiment": "none"}, {"name": "wigston", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "montfort street", "sentiment": "none"}], "organizations": [{"name": "leicester mercury apprentices", "sentiment": "negative"}, {"name": "belmont hotel", "sentiment": "none"}, {"name": "leicester college", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Apprentices Spencer Griffiths and Chole Williamson in the kitchen at the Belmont Hotel in Leicester Share Comments \nThe boss of one of Leicester’s top hotels has warned of a skills crisis. \nEloic Montagnier, general manager of the 74 room Belmont Hotel, said the hospitality industry was facing labour shortages because of negative perceptions about it. \nIt is a problem that could get worse as Brexit makes it less attractive for foreign labour to come to Britain. \nIt comes on the back of reports that UK growth could be hit by a chronic lack of skills – with everyone from engineers to banks struggling to get the right calibre of applicants. \nMr Montagnier, who manages the hotel on the corner of New Walk and De Montfort Street, said working in the hotel sector was not without its benefits. Not for you? Want a job in Leicester? There are loads here \nHe has a relationship with Leicester College to find young apprentices starting out on their careers in the industry. \nLike him, he said, if they put the time and commitment in, there was nothing to stop them making it to the top. \nRight now the Belmont has two apprentices within its ranks, not to mention past students who completed their training and stayed on in the business. The Belmont Hotel in Leicester \nMr Montagnier said they helped contribute to the hotel recently collecting two prestigious hotel and restaurant awards – a four-star AA rating and two AA Rosette awards. \nHe said: “The two awards are testament to all the hard work that the team here carry out every single day.” \nHowever he said it took him 12 months to find the head chef – David Ferguson – who went on to help bring in those awards. \nMr Montagnier said: “The industry has got a huge staff shortage, including a massive shortage of chefs. \n“Thankfully, I would have to say Leicester is better than other areas because Leicester College has one of the best reputations. \n“But generally I think the industry has a big staff shortage. Belmont Hotel general manager Eloic Montagnier \n“I started at catering college and my first job was polishing cutlery. \n“It’s a job where you can start at the bottom, but if you are dedicated and willing you can get to the top. \n“We have two Leicester College students in the kitchens – Chloe and Spencer and they are all members of the team – and they don’t just peel potatoes. \n“Spencer, the newest recruit, started in the spring and does two days a week at college. \n“Chloe has been with us for 12 months now and she really gets the job, and I think she’s definitely a future head chef. \n“She is 16 and has such a strong work ethic. She’s always, always busy. \n“All being well both will become members of the team. \n“Sometimes David and I actually forget they are only teenagers, especially because of the amount of pressure they take on when it’s busy. \n“They are as important as anybody in the team – Chloe was even our employee of the year last year.” Meet the Belmont apprentices \nChloe Williamson , 17, from Evington, is studying Professional Cookery Level 2 at Leicester College. \n“I’ve been at the Belmont since August last year and I’m assessed here, and it’s all going really well. \n“It is tough. An assessor comes out every month or so and I have now done my first lot of exams so I’m three-quarters of the way through. Apprentices Spencer Griffiths & Chole Williamson are both loving their training \n“Most of my friends went into sixth form but I think doing an apprenticeship means you can get your teeth stuck in. \n“I actually started work at the hotel first, and the college stuff came afterwards. \n“One day I want to have my own restaurant.” \nSpencer Griffiths , 18, from Wigston, is also training to be a chef. \n“I came to the Belmont on work experience in February and was offered a job on the back of that. \n“I’m also doing Professional Cookery Level 2 at Leicester College, and split my time between the college and the hotel. \n“It can be very busy and quite difficult sometimes, but I have to say I’m really enjoying it.” \nTom Metcalfe , 22, from Countesthorpe, has been working at the Belmont for five years having studied Professional Cookery Level 2. He is a senior chef de partie. \n“It’s very true that there are not enough people coming into the industry. \n“I think it can be intimidating as a business – you see people like Gordon Ramsey on TV effing and blinding and that can be off-putting. \n“And it is hard work, but it is worth it. And I have to say it was a really good course at Leicester College.” Like us on Facebook ", "external_links": [], "published": "2017-07-19T08:00:00.000+03:00", "crawled": "2017-07-19T13:15:14.007+03:00", "highlightTitle": ""}