{"organizations": [], "uuid": "8a90f46919520f5e34cb15ba453dfb74464fe43a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30424880/16069509.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/why-can-t-british-workers-pick-our-own-fruit-neil-parish-column/story-30424880-detail/story.html", "country": "GB", "title": "Brits don't want to pick fruit and veg, so we need foreign...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-05T12:45:00.000+03:00", "replies_count": 0, "uuid": "8a90f46919520f5e34cb15ba453dfb74464fe43a"}, "author": "DanielClark", "url": "http://www.devonlive.com/why-can-t-british-workers-pick-our-own-fruit-neil-parish-column/story-30424880-detail/story.html", "ord_in_thread": 0, "title": "Brits don't want to pick fruit and veg, so we need foreign...", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "neil paris", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "eastern europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}], "organizations": [{"name": "neil parish", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tiverton & honiton", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "efra select committee", "sentiment": "none"}, {"name": "seasonal agricultural workers scheme", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brits don't want to pick fruit and veg, so we need foreign workers - Neil Parish column By DanielClark   Brits don't want to pick fruit and veg, so we need foreign workers - Neil Paris...   Comments (0) \nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010 \nI am holding a debate in Westminster that calls for the reintroduction of a Seasonal Agricultural Workers Scheme. \nIt's no secret that this country relies on foreign labour to pick its fruit and veg. About 80,000 seasonal workers pick and process British fruit and veg each year. The vast majority of these workers are from the European Union. In fact, 95 per cent come from Poland, Romania and Bulgaria. For better or for worse - that's the current situation, but without these workers, British fruit and veg would end up rotting in our fields. \nThe problem is, these seasonal EU workers are getting harder to recruit. Brexit and uncertainty about the status of EU migrants has played its part. Improving living standards in Eastern Europe – particularly in Poland – mean fewer workers are attracted to Britain for higher pay. But perhaps the biggest factor in recent labour shortages is the fall in the Pound against the Euro, making British wages far less competitive. Read more 'I will not rest' says MP Neil Parish until all homes have superfast broadband - opinion \nIn April, the EFRA Select Committee published a report on labour constraints in agriculture. It showed the sector already has big problems retaining labour, which could quickly become a crisis when the free movement of labour ends. A strategy is required now to ensure British agriculture has the workers it needs. \nSo why can't British workers pick our own fruit? And I would agree, I want to see more British workers in these industries, especially in the long-term. It's not sustainable to continue to rely almost exclusively on foreign labour for these seasonable jobs. But that's a long-term shift. We need to think about the here and now. Unemployment is the lowest since 1975 and the truth is – there aren't enough British workers who want these jobs. In Tiverton & Honiton, where agriculture is a key part of the local economy, there just isn't the demand for this type of job. If we don't fill the labour shortage, not only will British fruit and veg go unpicked, our industries will eventually relocate abroad. Read more VIDEO: Neil Parish holds Tiverton & Honiton for the Conservatives - Full Report \nThat's why a Seasonal Agricultural Workers Scheme is needed now. Put simply, it allows non-British workers to work in the UK agriculture sector on a temporary basis. It would allow the Government to control numbers and is not the free movement of old. It allows the UK to import skills and labour for a specific sector of the economy. It can be extended to non-EU workers, from the Ukraine or further afield. And the scheme could also be designed so that applicants have to have a confirmed job before entering the UK. \nI believe it fits with what looks likely to be the immigration model for Britain after leaving the EU, which is controlled migration for those who have a job. \nIt may sound new, but this is actually how agriculture and horticulture operated before 2013. The previous scheme ended when free movement of labour was granted to Romania and Bulgaria. It could just as easily be reintroduced in a similar way. Once Britain leaves the EU in March 2019, a new seasonal scheme will become essential to ensure British agriculture has enough labour – and that's why, today, I'm pressing Government to get on with the job.", "external_links": [], "published": "2017-07-05T12:45:00.000+03:00", "crawled": "2017-07-05T14:39:01.000+03:00", "highlightTitle": ""}