{"organizations": [], "uuid": "43db689b72295fc600bf62233e36395dc14ec813", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13368519.ece/ALTERNATES/s1200/TMP_NEC_110717AlanLaingSage07JPG.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-boss-tells-small-businesses-13368408", "country": "GB", "domain_rank": 21960, "title": "Sage boss tells small businesses: we want to give you your weekends back", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-23T15:00:00.000+03:00", "replies_count": 0, "uuid": "43db689b72295fc600bf62233e36395dc14ec813"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-boss-tells-small-businesses-13368408", "ord_in_thread": 0, "title": "Sage boss tells small businesses: we want to give you your weekends back", "locations": [], "entities": {"persons": [{"name": "sage", "sentiment": "negative"}, {"name": "alan laing", "sentiment": "negative"}, {"name": "laing", "sentiment": "none"}, {"name": "scot", "sentiment": "none"}, {"name": "tech north", "sentiment": "none"}, {"name": "stephen kelly", "sentiment": "none"}, {"name": "jacqueline de rojas", "sentiment": "none"}, {"name": "ms de rojas", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "stephen", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "aberdeenshire", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "sage plc", "sentiment": "none"}, {"name": "digital equipment corporation", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Alan Laing of Sage (Image: newcastle chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAlan Laing is a man on a mission as Sage’s new MD for the UK. Graeme Whitfield meets the man from the North East (of Scotland) making waves on Tyneside. \nThe Sage Summit is a slightly odd affair: an event that tries to make accountancy interesting and which sees loads of Geordies taking over a conference hall in London. \nWhen the company’s first UK summit was announced in March, Sage’s then UK managing director Jacqueline de Rojas was slated to be the public face of the firm. \nBut by the time the event actually happened a few weeks later, Ms de Rojas had been replaced by Alan Laing, a genial Scot who displayed his Sage credentials by showing off his socks in the corporate shade of light green. Alan Laing of Sage (Image: newcastle chronicle) \nMr Laing – who joined the Newcastle software firm in 2014 – began his speech at the summit by telling the story of the family business he had grown up in, a farming and feed company in Aberdeenshire which failed when his father was unable to keep up with modern business practices. \n“My father’s philosophy used to be: the more receipts he had in a box, the better he was doing,” he says. “There was a lack of investment, a lack of business planning and generally a lack of control of what was going on. \n“My father didn’t see it coming. He eventually sold the business to one of his competitors, but he sold it for next to nothing and left my brother nowhere to go because he was involved in the business by that point. \n“Making stuff and satisfying customers was what he was about - not managing his cashflow or investing in the infrastructure he needed.” \nThat experience informs Mr Laing in his current role as Sage’s MD for UK and Ireland, with the firm re-casting its public image under CEO Stephen Kelly as a champion for small and medium-sized businesses, both by representing their views with policy makers and by helping them to change the way they do business. \n“The biggest opportunity for us is the huge number of small companies out there who haven’t adopted any of digital capabilities there are to help them run their business,” Mr Laing says. \n“They’re spending hours of their private time dealing with the accounts, dealing with cashflow, dealing with their payroll, often doing it at the weekends. If you’re lucky the information’s on XL spreadsheets; some of them have still got shoeboxes full of receipts. \n“Our message to them is: we have the capability, at a price that fits their business model, that will help them get their weekend back. The innovation built into our products is all about business efficiency and our ambition is for these businesses to have zero admin.” Alan Laing of Sage (Image: newcastle chronicle) \nAs well as boosting Sage and its customers, he says, the technology being developed by the firm (mostly in Newcastle) has the potential to boost the UK economy . \n“There were 97,000 start-ups in the UK last year,” he said. “We have data on many of them because we survey our prospects and our customers regularly. What we know is that, in the UK, 60% of all start-ups will fail in the first five years. So as well as zero admin and making it easier to run their businesses, adopting technology could go some way to reducing that number.” \nMr Laing’s route to the Sage boardroom started when he decided against the expected route of going into the family business. \nAfter studying law at Edinburgh, he went into private practice and became interested in technology as many of his mergers and acquisitions clients were working in that sector. \nHe joined US firm Digital Equipment Corporation as an in-house lawyer and ended up working in Hong Kong, often handling delicate negotiations with the Chinese authorities over getting the company into the vast Chinese market. He later moved to multi-national technology giant Oracle, starting as a lawyer and then becoming vice president of sales in Europe. Alan Laing of Sage (Image: newcastle chronicle) \nThe call to join Sage came in 2014, first as a consultant - “for Sage to take a look at me and me to take a look at Sage” - and then joining permanently the following February. After working first as EVP of partners and alliances he took up his current role in April with the remit of growing Sage’s business in the UK and Ireland. \nHe said: “I’m not just saying this because you’re a journalist, but this is the best thing I’ve done since those early days at Oracle. It’s such an opportunity, such a great company but we’ve more opportunity that we can shake a stick at. \n“When I’m interviewing people, the way I like to phrase it is that I like to think of Sage as a start-up with money. \n“In a start-up, cash is tight and you have to be quick and adaptable to different things happening twice a day, three days a time - you need to make it happen. We’re a bit like that: there’s so much we need to make happen. We’ve got a fantastic asset in our customer base, we’ve got this fantastic business built up over 36 years but there’s so much more we can do and the market is there for us to do it. \n“Sage UK would be, in its own right, in the top 15, if not the top 10, software businesses in the UK. That’s without everything we do in the rest of the world. Sage plc is the largest technology business on the FTSE. Sage UK itself has a million customers, 3,000 employees, lots of partners, lots of accountants and it’s a big business. \n“But frankly, while we’re well known in the North East and other pockets of the country, we’re not well known everywhere. We need to get the Sage brand out there and find customers throughout the UK and Ireland.” Alan Laing of Sage (Image: newcastle chronicle) \nThat effort to grow Sage’s reputation has seen the company’s senior staff becoming increasingly public in championing the challenges of small businesses, whether it’s Brexit , the burdens of red tape or the need to reform business rates. \nAnd for Mr Laing, many of the issues facing his small business customers (and potential customers) are much the same as those faced by father’s firm 30 years ago. Read More Tech firms need to fight for more focus in the North, says Tech North boss \nAs well as providing them with the administrative tools they need to run their businesses effortlessly - with advances in mobile technology, voice-activated accounting systems and artificial intelligence - that will mean people like him acting as a voice for SMEs with Government and other authorities. \n“We don’t want to be paternalistic nor arrogant, but worldwide we have lots of businesses that are supported by our products and we know about their challenges,” he says. \n“If you bring that together, the challenges small businesses have from start-up to scale-up, it’s very difficult for one company to make a difference. Governments are big things to deal with and the fragmentation of the message on the challenges small businesses are facing means it can be very difficult to make those points. \n“When Stephen came here, we said: first, we wanted to have these customers satisfied with Sage products and we’ve done that. We’ve improved our customer satisfaction. \n“Then we take that up a level because we think it’s incumbent on us as the largest technology business in the UK to articulate these issues and talk to Government and local authorities. to the development authorities and the myriad organisations that are out there about what’s on the agenda for these guys. How do we help more of them start-up, how do we help more of them continue to grow and thrive?” \nHelping Sage - with its nearly 2,000 staff in Newcastle - to grow and thrive is Mr Laing’s day job. Read More Sage teams up with Apprentice winner to create bright starts for young North East entrepreneurs \nBut he hopes too that that success can spread. \n“If we can help reduce the failure rate,” he sayd. “if we can get that 60% failure rate down by 30% because they’ve used Sage products, what a result that would be.” Like us on Facebook", "external_links": [], "published": "2017-07-23T15:00:00.000+03:00", "crawled": "2017-07-23T15:50:04.008+03:00", "highlightTitle": ""}