{"organizations": [], "uuid": "85ecbb28689a161f9aebb955462b3cf269f89187", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30433791/16078079.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/sea-race-will-see-competitors-cycle-across-the-tor-bay/story-30433791-detail/story.html", "country": "GB", "title": "Sea race will see competitors 'cycle' across the Tor Bay", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-12T18:42:00.000+03:00", "replies_count": 0, "uuid": "85ecbb28689a161f9aebb955462b3cf269f89187"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/sea-race-will-see-competitors-cycle-across-the-tor-bay/story-30433791-detail/story.html", "ord_in_thread": 0, "title": "Sea race will see competitors 'cycle' across the Tor Bay", "locations": [], "entities": {"persons": [{"name": "zoe_stevens   andy lang", "sentiment": "none"}, {"name": "cllr robert", "sentiment": "none"}, {"name": "robert excell", "sentiment": "none"}, {"name": "cllr robert excell", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "dawlish warren", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "paul darlow", "sentiment": "none"}, {"name": "bay", "sentiment": "none"}, {"name": "cllr excell", "sentiment": "none"}, {"name": "domenico de rosa", "sentiment": "none"}, {"name": "thomas mills", "sentiment": "none"}], "locations": [{"name": "tor bay sea", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "brixham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gloucester", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "tor bay", "sentiment": "none"}, {"name": "bay", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "tesco", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "british heart foundation", "sentiment": "none"}, {"name": "torbay community development trust", "sentiment": "none"}, {"name": "belmond royal scotsman railtour", "sentiment": "none"}, {"name": "wikipedia", "sentiment": "none"}, {"name": "herald express", "sentiment": "none"}, {"name": "excell", "sentiment": "none"}, {"name": "national charity partnership", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "torbay council", "sentiment": "none"}, {"name": "anne marie morris wikipedia", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "rnli", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sea race will see competitors 'cycle' across the Tor Bay By Zoe_Stevens | Posted: July 12, 2017 0 COMMENTS SHARES Andy Lang and Cllr Robert Excell doing sea trials for floating bike in 2015 Sea race will see competitors 'cycle' across the Tor Bay X \nCopy link to paste in your message / Comments (0) \nIt will be Whacky Races on the water when the Race Across Tor Bay sees teams compete in August. Teams of five are invited to join in different sporting ways of getting from Torquay to Brixham to raise money for the RNLI on August 28. \nThe event is just one of many events which are taking place this year as part of the Go For It campaign, which is being delivered by the Herald Express alongside headline partners the National Charity Partnership (NCP) – a partnership between Diabetes UK, the British Heart Foundation and Tesco – event sponsors Torbay Council and campaign sponsors Torbay Community Development Trust. \nThe teams of five will include kayakers, swimmers, rowers, canoeists, paddle boarders, and seabikes. \nOpen PDF \nThere is an entry fee of £50 per team, and the organisers of the event encourage pledges from family and friends to raise more money for charity. \nEach method of crossing will be judged independently from the others and then as an overall team. The winners of each class will get £100, and there will be a £500 prize for the winning team. \nTorquay councillor Robert Excell has cycled his seabike the 4.2 miles from Torquay to Brixham several times to encourage others to become more active. \nCllr Excell, who is 72-years-old, has completed the unusual bike ride several times in the past, and his personal best for completing the journey is 54 minutes. \nHe said: \"Being active, and encouraging others to be active has always been a passion of mine. We will all be crossing the Bay using different methods, but only using man-power – no motors, electricity or wind. \n\"I'd like to see an event like this where everyone can get involved in being active and travelling across our beautiful Bay. This is a unique event for Torbay. \n\"I'm aging well – I'm into my 70s now but I love it. It's a bit of fun, and something a bit different.\" \nFor more information, call Cllr Robert Excell on 07811 965194 or email him at Excell47@gmail.com. READ NEXT: LIVE: Latest news, traffic and weather updates for Tuesday July 11 2017 Welcome to our live breaking news service with the latest traffic, travel and weather advice as well as headlines from across Devon, the South West and beyond. We'll also keep you up to date on the weather and traffic news with all the latest developments and breaking news.If there's anything you want Devon to know about, tweet @devonlivenews, message us on Facebook or email echonews@expressandecho.co.uk. You can also call 01392 348444.For all the latest news updates for today Tuesday July 11, follow our live blog. Man sat outside his ex's house for 10 hours then beat up her friend A man who followed his ex twice when they broke up after 10 years, stared at her house for 10 hours then beat up her male friend, has admitted harassment.Italian fish processing plant worker Domenico De Rosa, 56, left his ex depressed and struggling to eat or sleep thanks to his campaign of harassment, a court heard.Handing him a suspended prison sentence, Judge Paul Darlow said: \"Those two incidents to me demonstrate to me intimidating and violent behaviour with little insight into the impact on others. I accept that your motivation was not revenge.\" For £10,000 a ticket you could have ridden this luxury train through Devon today Everybody moans about the price of rail travel these days, but this train might just be the most expensive ever seen on the railway lines of Devon. Early on Tuesday morning the rarely-seen Belmond Royal Scotsman Railtour passed along the spectacular seawall section between Dawlish Warren and Newton Abbot.Our man at trackside was Thomas Mills of Teignmouth, who was on hand to capture the sight. He said: \"Class 66s nos 66746 and 66744 double-headed the Belmond Royal Scotsman Railtour from Gloucester to Newton Abbot, and these locos ran round the train at Newton Abbot en route to Bath Spa. Anne Marie Morris Wikipedia entry changed to call her a 'politician and a racist' Anne Marie Morris' page on Wikipedia, the free online encyclopedia, was temporarily changed to describe her as a 'British Conservative party politician and a racist'.The Wikipedia entry was later amended to describe the political storm which hit the Newton Abbot MP after she was recorded using the racially offesive term 'n****r in the woodpile' during a debate on Brexit with eurosceptics. But for a short time when anybody searched for her details online, this is how she was listed on Wikipedia and the image was copied and circulated on Twitter. ", "external_links": [], "published": "2017-07-12T18:42:00.000+03:00", "crawled": "2017-07-12T19:24:31.003+03:00", "highlightTitle": ""}