{"organizations": [], "uuid": "b722b9f3b2e6fe9e55e4f0bd48efbf3b571fc0c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11963210.ece/ALTERNATES/s1200/JS101110115.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farming-could-face-huge-labour-13316479", "country": "GB", "domain_rank": 21960, "title": "Farming could face huge labour shortages unless Government acts, industry warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-11T19:14:00.000+03:00", "replies_count": 0, "uuid": "b722b9f3b2e6fe9e55e4f0bd48efbf3b571fc0c4"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farming-could-face-huge-labour-13316479", "ord_in_thread": 0, "title": "Farming could face huge labour shortages unless Government acts, industry warns", "locations": [], "entities": {"persons": [{"name": "raymond", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "meurig raymond", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "northumberland national park", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}], "organizations": [{"name": "business farming", "sentiment": "negative"}, {"name": "nfu", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Farming could face huge labour shortages unless Government acts, industry warns NFU warns that Brexit concerns and the slump in the value of the pound are deterring workers from coming to the UK Share A combine harvester in a field (Image: Owen Humphreys/PA Wire) Share Get business   Thank you for subscribing!   \nThe farming and food sectors could suffer huge labour shortages if the Government does not address growing concerns over agriculture’s access to workers, a new report says. \nThe NFU says that the supply of seasonal workers for the next two seasons is in jeopardy with the number of seasonal workers coming to work on British farms this year having already dropped 17%. \nThe NFU report says an immigration policy should be created to offer British farms flexible solutions for recruiting both seasonal and permanent overseas workers, with a focus on a competent and reliable workforce. \nNFU President Meurig Raymond said: “It is crucial that the Government addresses these concerns immediately to ensure that farming has access to a competent and reliable workforce, now and post-Brexit. \n“A solution, such as a suite of visa or permit schemes, is urgently needed to avoid losing a critical number of workers that could jeopardise future harvests and food production. \n“Recruiting overseas workers is not something that can be done instantly. It takes time for businesses to recruit and for seasonal work they typically plan nine months in advance. Read More Royal award for organisers of Northumberland agricultural show \n“The supply of seasonal workers for the 2018 and 2019 seasons is already in danger and Government must, as a priority, establish a system to enable sufficient recruitment of seasonal labour before the UK leaves the EU. \nThe NFU report comes a few days after MPs urged the Government to establish an immigration scheme for agricultural workers and said that Brexit could cause a crisis in staffing for the industry. \nAround 80,000 seasonal workers currently come in every year, MPs said, most of whom are from the EU and particularly Romania and Bulgaria. \nBut improved living standards in eastern Europe as well as the dramatic fall in the value of the pound against the euro means this seasonal work was not as attractive as it once was. \nIn its new report, the NFU has expressed serious concerns about the industry’s ability to maintain an adequate number of permanent workers. It has called on the Government to provide clarity on the status of EU nationals living and working in the UK, given the many permanent workers in the agri-food sector. Read More Northumberland National Park chief wants 'vision' for region's countryside \nMr Raymond added: “The forthcoming Immigration Bill must recognise the importance of migration for certain sectors and Government must recognise the strategic importance of the UK farming industry as the bedrock of the UK’s food and drink industry, worth £109bn to the economy. \n“The NFU would like to see the Government consult extensively with the farming industry on this issue to ensure a solution is reached and as soon as possible.” Like us on Facebook", "external_links": [], "published": "2017-07-11T19:14:00.000+03:00", "crawled": "2017-07-11T19:47:34.006+03:00", "highlightTitle": ""}