{"organizations": [], "uuid": "7c4e5ecd9ba98a83c4b2b954dd2e453b94e8b70a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12681012.ece/ALTERNATES/s1200/green-wall.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/marks-spencer-set-reveal-boost-13298483", "country": "GB", "domain_rank": 21960, "title": "Marks and Spencer set to reveal boost in fashion sales buoyed by heatwave and late Easter", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-09T18:00:00.000+03:00", "replies_count": 0, "uuid": "7c4e5ecd9ba98a83c4b2b954dd2e453b94e8b70a"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/marks-spencer-set-reveal-boost-13298483", "ord_in_thread": 0, "title": "Marks and Spencer set to reveal boost in fashion sales buoyed by heatwave and late Easter", "locations": [], "entities": {"persons": [{"name": "spencer", "sentiment": "negative"}, {"name": "wade", "sentiment": "none"}, {"name": "steve rowe", "sentiment": "none"}, {"name": "marco gobbetti", "sentiment": "none"}, {"name": "marco gobetti", "sentiment": "none"}, {"name": "graham spooner", "sentiment": "none"}, {"name": "gobbetti", "sentiment": "none"}, {"name": "spooner", "sentiment": "none"}, {"name": "christopher bailey", "sentiment": "none"}, {"name": "andrew wade", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "knightsbridge", "sentiment": "none"}], "organizations": [{"name": "easter business marks", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "burberry", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "share centre", "sentiment": "none"}, {"name": "m&s northumberland street", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Marks and Spencer set to reveal boost in fashion sales buoyed by heatwave and late Easter Burbbery also releases its first quarter results this week, ahead of new CEO Marco Gobetti's first appearance at the fashion house's AGM Share The green wall on M&S Northumberland Street (Image: handout) Share Get business   Thank you for subscribing!   \nMarks and Spencer is set to reveal an improvement in its under-pressure clothing arm this week after the recent heatwave and late Easter helped it narrow recent sales falls. \nThe retail bellwether reported a sobering set of annual results in May showing clothing and home sales plunged back into reverse in its fourth quarter, tumbling by 5.9%. \nExperts are expecting the clothing and home sales fall to pare back to around 1.3% in the group’s first quarter, which will include Easter this year and comes up against weaker trading from a year earlier. \nFood sales, which tumbled by 2.1% in the previous quarter, will rebound by 0.6% thanks to warmer weather and rising inflation, according to analysts. \nBut with rivals such as Debenhams sounding the alarm over the squeeze from Brexit-fuelled inflation, the path to sales recovery is not expected to be smooth for M&S . \nAnalyst forecasts also range widely, with conflicting reports from high street players in recent days. \nJefferies experts believe comparable clothing and sales may have fallen by 1.5% against a declining market. Read More North East businesses overwhelming want EU trading deals to remain unchanged \nBut Numis analyst Andrew Wade predicts Tuesday’s update will show clothing and home sales rising by 1.5% in a “solid-looking” first quarter. \nDespite pencilling in a better quarter for M&S, Mr Wade cautioned the bounce back may only be short-lived. \n“While the combination of soft comps and calendar effects should result in a solid-looking first quarter result, we retain our negative stance, believing that M&S’s clothing and home division will prove more difficult and costly to turn around than expected,” he said. \nM&S posted a 64% plunge in annual profits to £176.4m in May, admitting its overhaul had “come with a cost”. \nAs well as the Easter timing, its move to axe promotions in favour of everyday low prices hit sales \nBut chief executive Steve Rowe said the group has stabilised its market share in clothing since the start of 2017, while action to cut clearance promotions has helped full-price sales surge by 11% in the second half of its financial year. The Burberry store in Knightsbridge, London (Image: PA) \nMeanwhile, luxury retailer Burberry will release its first quarter results on Wednesday, before Marco Gobbetti makes his first appearance as chief executive at the company’s annual general meeting on Thursday. \nMr Gobbetti took the post on July 5, having served as executive chairman since January when it was revealed that he would be replacing Christopher Bailey as chief executive this summer. \nGraham Spooner, an investment research analyst at The Share Centre said investors will “look forward with interest in the style and tone of comments” from the new boss, as the company pushes ahead with a turnaround plan meant to deliver at least £100 million in cost savings by 2019. Read More Close House Golf to create luxury lodges as demand soars ahead of British Masters arrival \nThose efforts include plans to move 300 jobs from its London offices to Leeds - details of which were first revealed in May. \nWhile Burberry reported a 21% drop in underlying pre-tax profits to £462 million for 2016, the weaker pound is expected to have lifted UK sales in the first quarter. \nMr Spooner said: “Key to the group is the health of the Chinese economy, but the latest evidence is that China is beginning to show some weakness again. \n“However, for the group as a whole, it was reporting better quarterly updates lately and there is expectation for some of the momentum to continue. \n“There may be a continued pickup in the European markets while UK sales should be boosted by a weak sterling and overseas travellers shopping over here. Licensing and wholesale will probably continue to fall.” Like us on Facebook", "external_links": [], "published": "2017-07-09T18:00:00.000+03:00", "crawled": "2017-07-09T18:06:49.000+03:00", "highlightTitle": ""}