{"organizations": [], "uuid": "b31d802ab7060420803279050a1422bb31bd938c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11786493.ece/ALTERNATES/s1200/JS48050559.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/quorn-foods-create-300-jobs-13375750", "country": "GB", "domain_rank": 21960, "title": "Quorn Foods to create 300 jobs and invest £150m in North East factory", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-24T13:31:00.000+03:00", "replies_count": 0, "uuid": "b31d802ab7060420803279050a1422bb31bd938c"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/quorn-foods-create-300-jobs-13375750", "ord_in_thread": 0, "title": "Quorn Foods to create 300 jobs and invest £150m in North East factory", "locations": [], "entities": {"persons": [{"name": "mo farah", "sentiment": "none"}, {"name": "brennan", "sentiment": "none"}, {"name": "kevin brennan", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mike cowling", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "billingham", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "business quorn foods", "sentiment": "positive"}, {"name": "eu", "sentiment": "none"}, {"name": "nordics", "sentiment": "none"}, {"name": "komatsu", "sentiment": "none"}, {"name": "simon dewhurst photography", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Quorn Foods to create 300 jobs and invest £150m in North East factory The investment forms part of plans to turn Quorn's Teesside facility into the biggest of its kind in the world Share Kevin Brennan, Chief Executive of Quorn Foods (Image: Mike Cowling for Simon Dewhurst Photography) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nVegetarian food giant Quorn Foods is creating hundreds of North East jobs amid multimillion-pound plans to turn its regional site into the largest facility of its kind in the world. \nThe company plans to invest £150m in its Billingham plant, creating around 300 new jobs over the next five years. \nThe new employees will be needed to operate the additional facilities as well as provide key support services to the site. \nQuorn, which is advertised by double world champion athlete Mo Farah, made the announcement after revealing its UK sales had grown 15% during the first half of the year and a global increase in sales of 19%. Quorn pieces being made (Image: Evening Gazette) \nChief executive Kevin Brennan, a former winner of Teesside’s business executive of the year, said he is confident a growing appetite for the meat substitute in the US, Australia and Asia will enable the firm to grow, despite Brexit. \nHe said: “We are proud to be contributing to the UK’s export drive and to be investing in a British innovation that is vital to addressing the future need for protein across a growing global population. \n“Our growth will continue as expected, regardless of the Brexit deal that is reached. In fact today’s investment is indicative of our confidence in becoming a $1bn brand in the next 10 years.” Read More \nThe company is confident it will hit its billion dollar target, claiming its product is not the focus of fad diets but addresses a global need to provide protein from sustainable sources. Production line of Quorn sausages (Image: Evening Gazette) \nMr Brennan said the food producer could also cope with the introduction of an EU trade tariff following Brexit, as long as it is in line with the single-digit charges the company faces when trading with America and Australia. \nHe added: “We are running a company where we believe we can quadruple the business to one billion US dollars. \n“Europe plays a part in that but it isn’t essential to achieving that. Read More Komatsu pays tribute to Gateshead staff as it marks 30 years in the town \n“The UK business is still a business with incredibly strong growth. The US is a business with enormous scale potential to us, alongside Australia and Asia. \n“We are still taking a positive view on commercial investment in Europe. We continue to invest significantly into Germany, Italy and the Nordics. \n“But equally we know that our category is growing everywhere in the world that if Europe gets less attractive, we can divert our growth to other places. \n“Hard Brexit tariffs would not be great for us, but it wouldn’t be the end of the world.” \nWhile the firm has managed to shield customers from Brexit-induced price hikes following sterling’s collapse, he could not guarantee costs will not rise in future. He said the company is “broadly neutral” to the Brexit-hit pound, with rising import prices being countered by improving export sales. Like us on Facebook ", "external_links": [], "published": "2017-07-24T13:31:00.000+03:00", "crawled": "2017-07-24T14:10:30.000+03:00", "highlightTitle": ""}