{"organizations": [], "uuid": "55d99627df872a66acffb9ccd7ceb77b047f95a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30431212/16073858.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/fears-expressed-that-brexit-will-mean-more-dead-dolphins-will-be-found-on-devon-s-beaches/story-30431212-detail/story.html", "country": "GB", "title": "Campaigners say Brexit will mean more dead dolphins will be found on Devon's beaches | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.108, "site_type": "news", "published": "2017-07-10T00:05:00.000+03:00", "replies_count": 0, "uuid": "55d99627df872a66acffb9ccd7ceb77b047f95a4"}, "author": "", "url": "http://www.devonlive.com/fears-expressed-that-brexit-will-mean-more-dead-dolphins-will-be-found-on-devon-s-beaches/story-30431212-detail/story.html", "ord_in_thread": 0, "title": "Campaigners say Brexit will mean more dead dolphins will be found on Devon's beaches | Devon Live", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "danny groves", "sentiment": "none"}, {"name": "redruth", "sentiment": "none"}, {"name": "ruth williams", "sentiment": "none"}, {"name": "lindy hingley", "sentiment": "none"}, {"name": "george eustice", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brixham sea watch", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "camborne", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "cornwall wildlife trust", "sentiment": "none"}, {"name": "fisheries", "sentiment": "none"}, {"name": "dolphin conservation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Campaigners say Brexit will mean more dead dolphins will be found on Devon's beaches By DanielClark | Posted: July 09, 2017 1 COMMENTS SHARES Campaigner Lindy Hingley with a rare infant porpoise that was washed up on the beach Campaigners say Brexit will mean more dead dolphins will be found on Devon's... X \nCopy link to paste in your message / Comments (1) \nWildlife campaigners have been left fearing that more dolphins will be found washed up dead on British beaches - because of Brexit. Almost 200 dolphins and porpoises have been found dead on beaches in the South West already this year, with the sharpest-ever rise recorded between January and April recorded. \nMost of the protection for the mammals comes from the EU but once we leave, campaigners say, even more will die with no replacement legislation currently proposed. A petition urging Fisheries Minister George Eustice, MP for Camborne and Redruth, to put laws in place protecting dolphins, porpoises and whales once Britain leaves the EU has now got nearly 60,000 signatures. Read more Devon fishermen welcome ban on foreign fishing vessels \nDanny Groves, of Whale and Dolphin Conservation charity, said: \"Thousands of dolphins, porpoises and whales die in fishing gear every year in UK seas. Most of the protection they have comes from the EU, but after Brexit they won't even have that. What then? \n\"Now is the time to stop this suffering and so we are campaigning to get English, Scottish, Welsh and Northern Irish governments to make sure effective laws are in place to protect dolphins, porpoises and whales in UK seas after Britain leaves the EU. \"The point is that they will be exposed without new laws and that is what we are campaigning for.\" \nEU law currently states that marine ecosystems should be protected through \"technical measures\" by fisheries, and the incidental capture and killing does not have a significant negative impact on the species. Read more Brits don't want to pick fruit and veg, so we need foreign workers - Neil Parish column \nBut the British Government is yet to state what will replace it after Brexit. \nRuth Williams, marine conservation manager at Cornwall Wildlife Trust, added: \"The concern is legislation will not be carried over and could weaken things after we leave the EU. We want to use the opportunity of leaving the EU to strengthen legislation.\" \nBut Lindy Hingley, the founder and principal of Brixham Sea Watch, blamed the deaths on foreign trawlers, and said Brexit was a good way of regaining control of UK waters. \"I'm not just saying that because it's easy to blame them,\" she said. \"If it had not been for the dolphins, I would've voted to stay in the EU. I believed the only way dolphins in our waters had protection was to control the states that were killing them - mainly French, Dutch and Belgium trawlers.\" ", "external_links": [], "published": "2017-07-10T00:05:00.000+03:00", "crawled": "2017-07-09T20:34:51.014+03:00", "highlightTitle": ""}