{"organizations": [], "uuid": "56a511d6ff4481ddd454fa974f183181f7c79d6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13301108.ece/ALTERNATES/s1200/Prime-Ministers-Questions.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-uk-stay-european-union-13296320", "country": "GB", "domain_rank": 21960, "title": "Could the UK stay in the European Union after all? That's the question being asked at Westminster", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-09T07:00:00.000+03:00", "replies_count": 0, "uuid": "56a511d6ff4481ddd454fa974f183181f7c79d6d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-uk-stay-european-union-13296320", "ord_in_thread": 0, "title": "Could the UK stay in the European Union after all? That's the question being asked at Westminster", "locations": [], "entities": {"persons": [{"name": "carolyn fairbairn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "westminst", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "westminster news", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "confederation of british industry", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "london school of economics", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Could the UK stay in the European Union after all? That's the question being asked at Westminster Leaving the EU is still the most likely outcome - but there's speculation at Westminster that Brexit could be ditched Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nCould Brexit be ditched? \nThat’s a question being asked at Westminster . \nThe idea that the United Kingdom could remain part of the European Union after all was raised by the BBC last week. It reported that some people involved in the Brexit process believed that an economic downturn could mean the UK stays in the EU after all. \nAnother possibility would be for the UK join the European Economic Area, which means you have to obey EU rules but also keep many of the benefits of membership. \nThis would allow politicians to say they’ve accepted the result of the 2016 EU referendum, when 52 per cent of voters backed Brexit, while avoiding a full break. \nAs things stand, the UK is due to leave the EU by March 2019. That’s still the most likely outcome. \nBut other options are starting to look possible too. Read More Why the Brexit result proved the best result for Britain one year on \nFor one thing, employers are getting increasingly nervous. The Confederation of British Industry (CBI), which represents larger firms, last week called on the Government to ensure the UK remains in the single market and the customs union even after the March 2019 deadline for leaving the EU. \nThe EU single market is the agreement that guarantees the free movement of goods, capital, services, and labour between countries. \nAnd the customs union means that there are no customs duties levied on goods travelling between countries, and also no delays when goods cross borders. \nThe CBI says it’s not trying to stop Brexit, but it wants to have as much “continuity” as possible. \nIn a lecture at the London School of Economics, CBI Director-General Carolyn Fairbairn said: “This is not about whether we are leaving the EU, it is about how. Once the Article 50 clock strikes midnight on 29th March 2019 the UK will leave the EU. \n“Our proposal for a limited transition period paving our way to a new future. This common-sense approach would bring continuity to firms in the UK and the EU and protect investment today.” \nIn practice, however, any “transitional” arrangements could easily end up being permanent. \nAnd remaining members of both the single market and the customs union would mean that we continue to be bound by EU rules. For example, we’d continue to have freedom of movement with other EU countries, allowing European migrants to come here to work, and we’d be unable to sign our own trade deals with other countries. \nIt depends partly on how much the Government, or the opposition parties, share the concerns of employers about threats facing the economy. Prime Minister Theresa May leaves 10 Downing Street (Image: PA) \nMichel Barnier, the French politician who is now the EU’s Brexit negotiator, insisted last week that the UK simply can’t retain the benefits of single market membership, which allows the UK to trade with EU countries, without being a member. \nHe said: “I have heard some people in the UK argue that one can leave the single market and keep all of its benefits – that is not possible. \n“I have heard some people in the UK argue that one can leave the single market and build a customs union to achieve ‘frictionless trade’ – that is not possible.” \nBut he also said it wasn’t possible to keep the benefits of the customs union if we leave the EU. \nHe said: “By choosing to leave the Union, you move to the other side of the external border that delineates not only the customs union but also the area in which the rules of the internal market are adopted and implemented. \n“Only the combination of the internal market and the customs union guarantees the free movement of goods.” \nSome supporters of Brexit insist there is no doubt about leaving. \nAnne-Marie Trevelyan, Conservative MP for Berwick-upon-Tweed in Northumbria and a strong Brexit supporter, said: “It is mischief making by those who lost the battle. \n“Government really is now all Brexit facing.” \nShe added: “The machinery is entirely focused on Brexit. So yes, we will get a full Brexit. \n“The question is probably only what cheque size we have to write to appease the accountants at the European Commission, who are cross that they are going to lose £19 or £20 billion a year out of their budget. \n“But it’s without question that the machinery of government is now doing what the British people asked them to do.” Read More ", "external_links": [], "published": "2017-07-09T07:00:00.000+03:00", "crawled": "2017-07-09T08:05:41.000+03:00", "highlightTitle": ""}