{"organizations": [], "uuid": "e543a3764e4aec6d66d46a611b7c4b4a8056fcdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13334487.ece/ALTERNATES/s1200/Lookers-CEO-Andy-Bruce-has-said-the-business-will-continue-acquiring-businesses.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/motor-retailers-addison-see-profits-13334456", "country": "GB", "domain_rank": 21960, "title": "Motor retailers Addison see profits fall amid impact of Volkswagen emissions scandal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-16T18:00:00.000+03:00", "replies_count": 0, "uuid": "e543a3764e4aec6d66d46a611b7c4b4a8056fcdf"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/motor-retailers-addison-see-profits-13334456", "ord_in_thread": 0, "title": "Motor retailers Addison see profits fall amid impact of Volkswagen emissions scandal", "locations": [], "entities": {"persons": [{"name": "addison", "sentiment": "negative"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "benfield", "sentiment": "none"}, {"name": "andy bruce", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "business motor", "sentiment": "negative"}, {"name": "volkswagen", "sentiment": "negative"}, {"name": "lookers group", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "hyundai", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "addison motors", "sentiment": "none"}, {"name": "hays travel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Motor retailers Addison see profits fall amid impact of Volkswagen emissions scandal Directors at Addison, now part of the Lookers Group, said margins fell after the Volkswagen scandal in which millions of cars were recalled Share Lookers CEO Andy Bruce has said the business will continue acquiring businesses (Image: Lookers) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East motor retailers Addison saw profit margins fall in its first full year of trading as part of the Lookers Group, after being impacted by the Volkswagen emissions scandal, accounts show. \nAddison Motors traded as Benfield until it was acquired by Manchester-based Lookers for £87.5m in cash in September 2015, paving the way for the original management team’s exit from the firm. \nIn its first full year as part of the Lookers Group, the Newcastle firm grew turnover marginally, from £547m to £552m, but said its margins were affected by the 2015 scandal surrounding Volkswagen emissions testing. \nThe German car maker admitted millions of cars were fitted with software which was used to cheat on emissions tests, which led to thousands of cars across the world being recalled, including 1.2m UK diesel vehicles. \nIn accounts published for the year ended December 31 2016 the directors of the firm, which operates franchises across the North East and Yorkshire, said: “We are pleased to report that turnover grew from £547m to £552 but due to more difficult trading resulting from the widely publicised ‘emissions scandal’ hitting the worldwide car market, margins were down from 10.7% to 9%. \n“As a result, profit from operations was down to £5.1m compared to £8.8m in 2015.” \nFollowing the firm’s acquisition Lookers disposed of two Toyota dealerships and one Lexus site as they “did not compliment the range of franchises and geographical locations of the rest of the Lookers group”. \nDuring the accounts period, in October 2016, the firm also disposed of a Hyundai dealership for the same reasons. Read More Mike Ashley's Sports Direct expected to show slump in profits \nThe company made a profit of £500,000 from the disposal, but incurred an exceptional expense of £1.4m associated with terminated businesses. \nLooking ahead, the directors said its current financial year was faring well, and that it was eyeing acquisitions. \nIn a strategic report in the accounts, the firm said: “The aim is to grow the business by a combination of organic growth in the existing business, where there are many opportunities for increasing revenue, as well as from targeted and selective acquisitions. \n“The company has made a good start to the current financial year and we anticipate achievement both an improvement on 2016 on a life for like basis and against plan. \n“Quarter one results are in line with management’s expectations. \n“Whilst the new car market achieved record level in 2016 we believe it will be relatively stable in 2017 and this also applies to the used car market. \n“The continuing increase in the vehicle parc of cars less than three years old provides further opportunities for increasing revenue in the high margin aftersales sector. Read More Hays Travel named UK's best high street travel agent at London awards \nDirectors said they were also closely monitoring the Brexit situation but, as yet, had not seen any impact on the business from the vote result. \nThe report added: “There is still uncertainty resulting from the process for the UK to leave the EU. \n“Whilst we have not yet noticed any significant difference in customer behaviour we have to remain aware of consumer confidence levels and pound-euro exchange rate, both of which could have an impact on our business.” Like us on Facebook", "external_links": [], "published": "2017-07-16T18:00:00.000+03:00", "crawled": "2017-07-16T19:12:28.010+03:00", "highlightTitle": ""}