{"organizations": [], "uuid": "b04eff4837821bde9ed45cb19b80d77c2d4b1a3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12941543.ece/ALTERNATES/s1200/nestle.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13281512", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Nestle could keep Blue Riband in Newcastle with £1m investment, union claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-05T10:00:00.000+03:00", "replies_count": 0, "uuid": "b04eff4837821bde9ed45cb19b80d77c2d4b1a3d"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13281512", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Nestle could keep Blue Riband in Newcastle with £1m investment, union claims", "locations": [], "entities": {"persons": [{"name": "tim steiner", "sentiment": "none"}, {"name": "helen mcardle", "sentiment": "none"}, {"name": "helen mcardle care", "sentiment": "none"}, {"name": "persimmon", "sentiment": "none"}, {"name": "blackwell", "sentiment": "none"}, {"name": "fawdon", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "goodfellow", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "coreena ford housebuilder persimmon", "sentiment": "none"}, {"name": "gillian marshall", "sentiment": "none"}, {"name": "matthew williams", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "valda goodfellow", "sentiment": "none"}, {"name": "eamon o’hearn", "sentiment": "none"}, {"name": "katie", "sentiment": "none"}, {"name": "dame margaret barbour", "sentiment": "none"}, {"name": "caramac", "sentiment": "none"}, {"name": "rowntree", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "maltby", "sentiment": "none"}, {"name": "ian hares", "sentiment": "none"}, {"name": "ocado", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "fawdon", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "nestlé uk", "sentiment": "none"}, {"name": "immingham", "sentiment": "none"}, {"name": "halifax", "sentiment": "none"}, {"name": "northern rock", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "maxibrite", "sentiment": "none"}], "organizations": [{"name": "hargreaves services", "sentiment": "negative"}, {"name": "coreena ford hargreaves services", "sentiment": "negative"}, {"name": "nestle", "sentiment": "negative"}, {"name": "coal distribution division", "sentiment": "none"}, {"name": "prudential regulation authority", "sentiment": "none"}, {"name": "aston university", "sentiment": "none"}, {"name": "entrepreneurs’ forum", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "fawdon", "sentiment": "none"}, {"name": "ocado  online", "sentiment": "none"}, {"name": "nestlé uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "housebuilder persimmon", "sentiment": "none"}, {"name": "topps tiles", "sentiment": "none"}, {"name": "northern rock", "sentiment": "none"}, {"name": "coreena ford amazon", "sentiment": "none"}, {"name": "whole foods", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}, {"name": "charles church", "sentiment": "none"}, {"name": "ukar", "sentiment": "none"}, {"name": "hargreaves services coreena ford topps", "sentiment": "none"}, {"name": "agm", "sentiment": "none"}, {"name": "bradford & bingley", "sentiment": "none"}, {"name": "topps", "sentiment": "none"}, {"name": "pepsi co", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "j barbour & sons", "sentiment": "none"}, {"name": "pepsicol", "sentiment": "none"}, {"name": "ocado smart platform", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "pra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford London is 'tech capital of Europe' following record investment \nLondon is reinforcing its reputation as the tech capital of Europe after attracting record levels of venture capital (VC) investment, a report has said. \nVC investors have brushed aside Brexit concerns to drive more than £1.1bn into the area’s technology industry during the first six months of 2017, according to London & Partners. \nThe haul is the largest on record and four times higher than the amount seen in 2013. \nLaura Citron, chief executive of London and Partners, said London remains Europe’s leading hub for global investors. \nShe said: “The Brexit vote has understandably created some uncertainty but it is no surprise to see that London continues to attract more than double the amount of investment than any other European city. \n“The fundamental strengths of London as a centre for technology and business have not changed and we have everything companies need to be successful: policy makers, finance, infrastructure, world-class universities and talent. \n“This year’s record investment levels show that London’s tech sector continues to thrive and remains open to investment from all over the world.” London has attracted more VC funding than any other European city since the Brexit vote, including Dublin, Paris or Amsterdam. \nThe firms behind the investment inflows range from fintech companies such as Funding Circle, Zopa and Monzo , to virtual reality start-up Improbable. 9.05 Coreena Ford Government helping other areas get advantage over North East, business group warns \nThe government will be helping other parts of the UK get an advantage over the North East if it does not act soon on changes to air taxes, a leading business group has warned. \nThe North East of England Chamber of Commerce has written to Prime Minister Theresa May to urge action from the government on air passenger duty (APD), which increases the cost of flying from UK airports. \nThe chamber is concerned that Newcastle Airport in particular will lose out if the Scottish government goes through with plans to halve and then abolish taxes from airports north of the border. \nAirport bosses and business leaders in the North East fear airlines will switch routes to airports such as Edinburgh and Glasgow if flying becomes less expensive in Scotland, leaving the region cut off from international markets at a time when Brexit means those links are more important than ever. Newcastle International Airport (Photo: Newcastle Airport) 9.00 Grey Street building set for refurbishment after being bought by Utilitywise co-founder \nLooking for a city centre base? \nStessa Commercial’s acquisition on Grey Street could fit the bill. \nThe firm recently bought 18-24 Grey Street, a Grade II office building which is home to chartered surveyors Sanderson Weatherall and will soon have room for more tenants. \nThe property investment firm, which was set up by former Utilitywise director Adam Thompson, is now spearheading a refurbishment programme to prepare space for its next occupying tenants. \nLandlord Mr Thompson, who was chief operating officer at the energy consultancy having set it up with his father Geoff Thompson 11 years ago, said the updated space will be marketed by leading North East chartered surveyor and estate agents Bradley Hall. \nNeil Hart, managing director at Bradley Hall, said: “Thanks to this investment the landlord is set to create an attractive office space for prospective tenants. Its location is fantastic with excellent transport links and a well presented interior and exterior. \n“The landlord is also set to reduce rents, making it excellent value. We don’t expect the property to be vacant for very long.” The Grey Street, Newcastle, building which is set for a refurbishment (Photo: Bradley Hall Ltd) 8.57 Coreena Ford Good weather helps Booker sales jump \nCash and carry chain Booker shrugged off competition concerns surrounding its takeover by Tesco to reveal a hot weather-fuelled surge in sales. \nThe group said non-tobacco like-for-like sales jumped by 9.6% in the quarter to June 16, thanks to fair weather and this year’s later Easter. \nTobacco sales remained under pressure amid tighter regulation, down 7.9%, which left overall like-for-like sales 4.2% higher in the first quarter. \nAnalysts at Shore Capital branded the sales performance “outstanding”. \nThe figures come as Booker holds its annual general meeting for shareholders, which is expected to be dominated by questions over its tie-up with Tesco. Tesco and Booker asked the competition watchdog last week to “fast-track” its investigation into their £3.7 billion merger, with the deal expected to face an in-depth probe. \nThe Competition and Markets Authority had been expected to complete the first phase of its investigation by July 25, but the two firms have requested it speeds up referral to a more in-depth second phase. 8.46 KEY EVENT New managing director appointed at Gateshead's Sevcon \nAfter scouring the globe for a new managing director Sevcon president and chief executive officer Matt Boyle found the ideal man - just a two-minute walk from its Gateshead base. \n  Director will allow Mr Boyle to concentrate on driving forward his strategic vision for the world-leading motor control and battery charging business. \n  \nMr Sidlow has   true momentum. \n  immense. \n  mindset.” \n  Dave Sidlow, new MD of Sevcon, and Matt Boyle, the firm's president and CEO 8.39 Coreena Ford Hargreaves Services reports consistent trading \nCounty Durham’s Hargreaves Services says overall trading in the run up to the year end was consistent with expectations and underlying profit before tax is expected to be ahead of market expectations, due to the net interest charge being £400,000 lower than anticipated for the full year. \nThe Coal Distribution Division, which includes results from its German operating associate, is expected to report profits above expectations. \nIt said favourable market conditions and an expanded local trading team have combined to deliver significant outperformance, which has allowed the group to accelerate the repositioning of its UK operations - exiting its Immingham port terminal space and undertaking preparations for investment in new low-cost briquetting products at Maxibrite. \nGood progress has also been made since the acquisition of Blackwell, moving the Earthworks business away from complex “design and build” civil engineering contracts to focus on its core competence of earthworks. \nDirectors also said excellent progress has been made in the realisation of cash from legacy assets. \nThe contract for the sale of underground assets from Maltby represented an “important milestone”. \nThe group expects to report its preliminary results for the year ended 31 May 2017 on August 8. Hargreaves Services Coreena Ford Topps Toiles sales slip in 'challenging' market \nTopps Tiles has pointed to a slowing housing sector and challenging market conditions as it reported another sales slump. \nThe group said like-for-like sales fell 4.7% in the third quarter as “weaker macro-economic conditions” begin to bite. \nChief executive Matthew Williams said trading in the period reflected “a more challenging” environment, and the group pointed to tough comparatives last year when housing transactions were on the up ahead of stamp duty changes which came into effect in April 2016. \nHe added: “At the time of our interim results in May we pointed to a more challenging macro-economic environment and this has persisted through the remainder of the third quarter. \n“Tougher comparatives resulting from the changes to stamp duty in the prior year were a feature throughout the period and we have seen a modest improvement in trading over recent weeks as they have begun to ease.” \nOn a brighter note, Mr Williams said Topps is evaluating a number of small acquisition opportunities. A Topps Tiles store (Photo: Topps Tiles/PA Wire) 8.25 Coreena Ford 'Bad bank' handling Northern Rock assets warns over interest rate rises \nThe “bad bank” set up to handle some of the more toxic assets of the former Northern Rock has warned up to one in 10 of its customers could struggle if interest rates were to rise by just one percentage point. \nUK Asset Resolution (UKAR) - the state-owned group responsible for winding down the mortgage books of failed lenders Northern Rock and Bradford & Bingley - said between 5% and 10% of its 148,000 customers could face financial difficulty if rates rose from 0.25% to 1.25%. \nThat could mean up to 14,800 borrowers under pressure. \nThe warning over the threat of rising interest rates comes as the Bank of England’s Prudential Regulation Authority (PRA) also stepped up its scrutiny of the lending sector amid fears over ballooning consumer borrowing. \nIt has ordered lenders to prove by September they are not taking on too much risk as part of a crackdown launched after unsecured consumer borrowing on credit cards and car finance has surged by more than 10% a year. \nBank governor Mark Carney last week said that lenders were “forgetting the lessons of the past” as he told banks to put aside another £11.4bn to cushion them from financial shocks. \nInterest rates could go up as soon as August, according to some economists, with mounting support among Bank policymakers for a rise to 0.5%. Ian Hares, chief executive of UKAR 8.20 KEY EVENT North East women least likely to launch their own business, report finds \nWomen in the North East are the least likely in the country to launch their own start-up business, new research suggests. \nData compiled from Aston University found only 2.8% of women in the North East would describe themselves as early-stage entrepreneurs. \nThe statistics, which cover 2013 to 2016, are the lowest levels in the UK, with the region one of only two regions to see falls in female entrepreneurship in recent years. \nGillian Marshall, chief executive of the Entrepreneurs’ Forum, a North East business support group, said the region should respond to the low figures by showcasing its many successful female business leaders. \nShe said: “There are iconic people in the North East like Dame Margaret Barbour (J Barbour & Sons), Helen McArdle (Helen McArdle Care), and Valda Goodfellow (Goodfellow and Goodfellow), all of whom have grown massive businesses and are great leaders. \n“What we need to do from a regional perspective is showcase some great businesses.” \nThe new research shows that women nationally are closing the gap on men in levels of business start-ups, though men are still nearly twice as likely to be entrepreneurs as women. \nThe number of women early-stage entrepreneurs increased by 45% over the last 10 years, but in the North East and the South West the rate actually decreased. Gillian Marshall, chief executive of the Entrepreneurs’ Forum (Photo: publicity picture) 8.15 Coreena Ford Housebuilder Persimmon hails strong first half \nHousebuilder Persimmon said the property market took the snap General Election “in its stride” as the firm racked up another set of rising sales. \nIn a half-year trading update covering the year to June 30, the Charles Church group disclosed that revenue grew 12% to £1.66bn, with the average selling price of its homes growing 3.5% to around £213,000. \n“We have continued to experience good levels of customer demand since the group’s AGM trading update on 27 April 2017, with the market taking the snap UK General Election in its stride. \n“Consumer confidence remains resilient and compelling mortgage rates continue to offer good support to new home-buyers,” Persimmon said. \nCompletion volumes rose 8% to 7,794 homes in the period, with total forward sales valued at £1.6bn, an increase of 18% compared with last year. \nPersimmon added that it expects the strong trading seen in the first six months of 2017 to lead to progress in its operating margin, exceeding “comfortably” the 25.7% delivered in the second half last year. \nThe firm added: “Successful execution of the long-term strategy launched in 2012 has placed the group in a very strong financial position, with an excellent asset platform designed to position Persimmon for success through the housing cycle.” \nThe update comes after Halifax last month reported a slowdown in the housing market when Prime Minister Theresa May’s calamitous decision to call a snap election led to increased uncertainty among house-buyers. A Persimmon Homes development (Photo: PA) 8.12 What's the FTSE latest? \nThe FTSE-100 index opened at 7357.23. \nThe pound at 8am was 1.2925 dollars compared to 1.2919 dollars at the previous close. The euro at 8am was 0.8790 pounds compared to 0.8783 pounds at the previous close. 8.10 Coreena Ford Amazon's Whole Foods takeover is a 'positive catalyst' for Ocado \nOnline grocer Ocado has hailed Amazon’s recent swoop on US chain Whole Foods as a “positive catalyst” for its international deals as it posted lower half-year profits. \nThe group said pre-tax profits tumbled 18.1% on a 26-week comparable basis to £7.7m in the six months to May 28 as the costs of opening a new distribution centre offset a 12.5% rise in revenues. \nOcado, which recently struck its long-awaited first international deal, said it believed Amazon’s $13.7bn (£10.6bn) takeover of Whole Foods would help it secure further overseas partnerships. \nThe group saw shares race higher last month after Amazon’s deal was announced on hopes it would increase the chances of the online titan and Ocado working together in the future. \nOcado chief executive Tim Steiner said: “We continue to progress conversations with multiple retailers internationally to use the Ocado Smart Platform and believe that recent industry developments such as the announced acquisition of Whole Foods by Amazon will be a positive catalyst in advancing these discussions. An Ocado home delivery van (Photo: Katie Collins/PA Wire) 8.00 KEY EVENT Nestlé could keep 300 jobs and Blue Riband in the UK with £1m investment, claims GMB \nThe GMB is urging the Government to save 300 Blue Riband jobs which are at risk if Nestlé switches production of the famous chocolate bar to Poland - and leaders claim a £1m investment will keep it in the UK. \nAround 110 jobs at the Fawdon factory in Newcastle are among 300 at risk in total with the proposed move of production, the other jobs being in York, Halifax and Scotland. \nNestlé is worth £176bn and is embarking on a £16bn share buyback scheme, having made £86m in profit in the UK alone last year. \nDuring consultation meetings with Nestlé UK, GMB said it has learnt the company could keep production and save 300 jobs in the UK for a one-off capital investment of just over £1m. \nA GMB officer said: “It was revealed during the consultation process with Nestle representatives when we challenged their track record of capital investment. \n“They acknowledged that capital investment in the production line at Fawdon of circa £1.2m would be sufficient.”The Nestle proposals come as 355 job will be lost at the Walkers factory in Peterlee, after PepsiCol confirmed the site will close. \nEamon O’Hearn, GMB National Officer, said: \n“The job losses at food giants like Nestlé UK and Pepsi Co are just the tip of the iceberg if companies are not given guarantees on Brexit from this Government, especially on any future trade tariffs. \n“Losing nearly 700 jobs from the North East and York will have a devastating impact on workers, their families and the local economy.” \nBlue Riband has been made in Britain since 1936 and is primarily consumed by the UK market. \nThe Fawdon factory, which was previously operated by Rowntree, is almost 50 years old and much of its machinery is old, though workers said there had been investment recently in the Blue Riband production line. \nWhen the announcement was first made Nestlé said the move would simplify production procedures at Fawdon, which produces a wide range of products, including Rolo, Fruit Pastilles, Caramac and Breakaway. \nAt the time, the company said: “The proposed changes include amended and standardised shift patterns at each factory and, at Fawdon, the most complex of Nestlé’s UK confectionery sites, the transfer of Blue Riband production to a Nestlé factory in Poland. This would mean being able to simplify and focus Fawdon’s operation. \n“These proposals are being made by Nestlé UK to ensure that these sites operate more efficiently and remain competitive in a rapidly changing external environment.” The Nestle factory in Newcastle (Photo: PA) Share", "external_links": [], "published": "2017-07-05T10:00:00.000+03:00", "crawled": "2017-07-05T10:49:15.000+03:00", "highlightTitle": ""}