{"organizations": [], "uuid": "5e6dcd7874d7ec9172d923051e549cc89a93fcc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30449650/16086697.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/is-exeter-university-boss-worth-300k-minister-questions-soaring-salaries/story-30449650-detail/story.html", "country": "GB", "title": "WMN_PGoodwin commented Exeter University defends vice-chancellor Sir Steve Smith's...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-20T19:32:00.000+03:00", "replies_count": 0, "uuid": "5e6dcd7874d7ec9172d923051e549cc89a93fcc0"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/is-exeter-university-boss-worth-300k-minister-questions-soaring-salaries/story-30449650-detail/story.html", "ord_in_thread": 0, "title": "WMN_PGoodwin commented Exeter University defends vice-chancellor Sir Steve Smith's...", "locations": [], "entities": {"persons": [{"name": "steve smith", "sentiment": "none"}, {"name": "judith petts", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "lord adonis", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jo johnson", "sentiment": "none"}, {"name": "angela rayner", "sentiment": "none"}, {"name": "rayner", "sentiment": "none"}, {"name": "glynis breakwell", "sentiment": "none"}, {"name": "david coslett", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "exeter university", "sentiment": "none"}, {"name": "university's board of governors", "sentiment": "none"}, {"name": "ents shares exeter university", "sentiment": "none"}, {"name": "office for students", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "university of bath", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "times higher education", "sentiment": "none"}, {"name": "university's remuneration committee", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "plymouth university", "sentiment": "none"}, {"name": "university", "sentiment": "none"}, {"name": "the university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter University defends vice-chancellor Sir Steve Smith's £315,000 salary By WMN_PGoodwin | Posted: July 20, 2017 1 COMMENTS SHARES Exeter University defends vice-chancellor Sir Steve Smith's £315,000 salar... X \nCopy link to paste in your message / Comments (1) \nUniversity vice-chancellors earning more than the prime minister have been asked to prove they are worth it as part of a clampdown on accelerating pay increases among higher education leaders. \nIn a speech on Thursday, the universities minister, Jo Johnson, told higher education institutions that in future they will have to justify exceptionally high salaries. \nHigh-flying Exeter University said its vice-chancellor Sir Steve Smith was worth every penny of the £315,000 he earned last year and Plymouth defended Judith Petts, who earned £115,000 in 2015/16 but only took up the post in at the end of January last year. \nAmid mounting concern about students' increasing debt, the government has come under pressure to investigate high vice-chancellor pay amid accusations that tuition fees are being used to bolster the pay packets of senior management. \nIn a speech outlining the government's plans to secure value for money for students, Mr Johnson said: \"When pay levels are exceeding those of the prime minister, it's important they are justified by exceptional performance. \nREAD MORE: Human skulls found in Totnes belonged to homeless man \nLast week the former education minister Lord Adonis called for an inquiry, pointing to Glynis Breakwell, the vice-chancellor of the University of Bath, claiming her salary had gone up by 11 per cent this year to £451,000 – more than three times Theresa May's £143,000 pay packet. \nExeter rallied to the defence of Sir Steve, who is both chief executive and vice-chancellor of a multi-million pound organisation which has \"a flourishing global reputation\". \n\"He is one of the UK's longest serving vice chancellors and, since his arrival in 2002, has led the University of Exeter from 34th in the national league tables to being firmly established in the top ten in the UK and recognised as one of the best teaching and research universities in the country,\" a spokesman said. \n\"The University has just achieved the Gold rating for teaching excellence. These achievements not only require visionary leadership, but a Vice-Chancellor who works tirelessly on behalf of the University at a local, national and global level.\" \nSir Steve, a leading figure in Britain's EU negotiating team, talks Brexit last month. \nThe university also pointed out that his salary, which, according to the Times Higher Education Survey 2017, rose 6.9 per cent from 2014/15, is independently set by the University's remuneration committee, with only independent members of the University's Governing Body involved in the process. \nThe spokesman added: \"Since 2008, Sir Steve's salary has on average increased by under 2 per cent a year. He has personally refused an annual salary increase on two occasions in the past nine years, and also turned down a recommended bonus of £29,000 in 2012/2013. \n\"Every month for the last 15 years the VC has made a personal donation from his salary to the University to invest in students' facilities and research and to the University's hardship fund to help underprivileged students and those in times of need . This year Sir Steve will not take a pay rise, as agreed by the University's Remuneration Committee. The Vice Chancellor has no other paid positions or directorships.\" \nJohnson has said in cases of exceptionally high pay, he wants the Office for Students, the higher education regulatory body that comes into force next year, to demand evidence that demonstrates a vice-chancellor merits the reward. \nIn an interview with the Guardian, Johnson said: \"I want the ratcheting up of vice-chancellors' pay to come to an end. Universities need to show leadership. I want exceptional pay to be justified by exceptional performance.\" \nThe minister was speaking ahead of a Commons debate on Wednesday about increasing tuition fees to above £9,000. The shadow education secretary, Angela Rayner, demanded that no increases should take place without votes in both the Commons and Lords. \nHowever, her speech was repeatedly punctuated by interventions from Conservative MPs accusing Labour of abandoning its plan on wiping student debts, to which Rayner responded by saying this had never been a commitment. \nPlymouth University defended Judith Petts, who took over from David Coslett on January 31. \nA spokesman said: \"Vice-Chancellor salary is independently determined by the University's Board of Governors remuneration committee and takes into account the significant transformational positive impact the University has on its students, on the UK's research and innovation and on the local, regional and national economy. \n\"It also reflects the significant responsibility and accountability of Vice-Chancellors as the leaders of highly complex multimillion pound organisations.\" ", "external_links": [], "published": "2017-07-20T19:32:00.000+03:00", "crawled": "2017-07-20T21:18:28.003+03:00", "highlightTitle": ""}