{"organizations": [], "uuid": "b6a1418c9771ee8dd108ecb5506ad05e423ef34b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30444108/16082351.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/flybe-on-look-out-for-overseas-links-to-help-passengers-fly-further/story-30444108-detail/story.html", "country": "US", "title": "Flybe on look out for overseas links to help passengers fly further | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2017-07-17T17:53:00.000+03:00", "replies_count": 0, "uuid": "b6a1418c9771ee8dd108ecb5506ad05e423ef34b"}, "author": "", "url": "http://www.devonlive.com/flybe-on-look-out-for-overseas-links-to-help-passengers-fly-further/story-30444108-detail/story.html", "ord_in_thread": 0, "title": "Flybe on look out for overseas links to help passengers fly further | Devon Live", "locations": [], "entities": {"persons": [{"name": "christine ourmieres-widener", "sentiment": "none"}, {"name": "ourmieres-widener", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "devon live flybe", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "virgin atlantic", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "air berlin", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "aberdeen", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Flybe on look out for overseas links to help passengers fly further By HannahFinch | Posted: July 17, 2017 1 COMMENTS SHARES Codeshares allow passengers to seamlessly join international routes from regional airports Flybe on look out for overseas links to help passengers fly further X \nCopy link to paste in your message / Comments (1) \nDevon air passengers could benefit from more international connections after Exeter airline Flybe announced that it is looking for a new international partner. \nThe boss of the budget airline has also said that she wants to concentrate on the carrier's profitable routes. \nIs it faster to travel by car, train or plane from Exeter to London - this experiment has the answer \nChief Executive Christine Ourmieres-Widener said the firm was following up on a \"number of additional… opportunities\" and was on the cusp of announcing another global partner, as it looks to drive passenger traffic by connecting more regional customers with long-haul flights. READ MORE: Flybe is one of the biggest employers in Devon and Cornwall \nThe partnerships – or codeshares – already allow customers to connect on from Aberdeen to Singapore, or Edinburgh to Los Angeles, and include major airlines such as British Airways, Virgin Atlantic, Emirates and Air Berlin. \nIt comes after the firm recently secured a deal with Heathrow Airport, which has opened up new routes from Edinburgh and Aberdeen and the opportunity to secure more codeshares. \nMs Ourmieres-Widener told the Press Association: \"We are currently following up a number of additional codeshare opportunities with carriers who have approached us and expect to confirm another international partner shortly.\" \nFlybe, which carries around 8.8 million passengers across 199 scheduled routes, is seeking firmer financial ground after sinking to a £19.9m pre-tax loss in the year to March 31, down from a £2.7m profit the year before. \nThe firm came under pressure over the period from weaker demand following a string of overseas terror attacks, while its capacity increased due to an aircraft order linked to its stock market flotation seven years ago. \nHowever, Ms Ourmieres-Widener said the fleet size will fall towards the end of this year, allowing the company to focus solely on its profitable routes. READ MORE: Exeter routes remain unchanged after Flybe records £19.9loss \nShe added: \"There is a positive correlation between the decline of the capacity growth and the improvement of the load factor. We have been growing the capacity last year by more than 20% and we expect to be flat this year. \n\"We start to decrease the capacity from this winter because we are giving back aircraft to lessors. \n\"In the past… it was better to fly the routes even if they were only covering direct cost, now moving forward when you have the right fleet you can definitely select and fly the routes that will improve your profitability. \n\"The main tool in the airline industry is the optimisation of your assets and each flight should be profitable and that is what we are working on flight by flight, route by route.\" \nOn Brexit, she said Britain's divorce from the European Union could impact \"many dimensions of the organisation\", but could also throw up opportunities. \nShe said: \"As a flexible, adaptable, regional airline it could be an opportunity if some players decide that the UK is no longer the market that they want to invest in. \n\"We represent 53% of the domestic market in the UK, so we have a role to play going forward to make sure these connections stay strong through Brexit.\" NEWS ", "external_links": [], "published": "2017-07-17T17:53:00.000+03:00", "crawled": "2017-07-17T17:49:11.004+03:00", "highlightTitle": ""}