{"organizations": [], "uuid": "9425074b5e7ab905d30250ccd4b0bf5f375f6b27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30428669/16072454.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/economy-on-point-of-contraction-claims-new-business-report/story-30428669-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published \"Economy on point of contraction\" claims new business...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T09:00:00.000+03:00", "replies_count": 0, "uuid": "9425074b5e7ab905d30250ccd4b0bf5f375f6b27"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/economy-on-point-of-contraction-claims-new-business-report/story-30428669-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published \"Economy on point of contraction\" claims new business...", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "tompegden   leicestershire", "sentiment": "neutral"}, {"name": "dunelm", "sentiment": "none"}, {"name": "richard rose", "sentiment": "none"}, {"name": "hastings", "sentiment": "none"}, {"name": "bdo", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "charles street", "sentiment": "none"}], "organizations": [{"name": "topps tiles", "sentiment": "none"}, {"name": "joules", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "bdo", "sentiment": "none"}, {"name": "handmade burger co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"Economy on point of contraction\" claims new business report By TomPegden | Posted: July 10, 2017 1 COMMENTS SHARES Leicestershire's shoppers are spending less \"Economy on point of contraction\" claims new business report X \nCopy link to paste in your message / Comments (1) \nBritain's economy is at the point of contraction, according to a new business confidence report from accountants and business advisers BDO. \nThe firm, with an office in Charles Street, Leicester, today warned that UK business output was at a four-year low. \nIts findings – based on how businesses expect order books to develop over the next three months – suggest strong manufacturing performance had not been enough to halt a \"recessionary trend\". \nPoor performance in the UK services sector continued to \"stunt economic growth\", it said, and although manufacturing was growing, it was not enough to offset the slowdown. \nHowever, BDO's report did suggest UK businesses were expecting a flurry of business activity following the political uncertainty of June – which had left many businesses delaying investment plans. \nRead More: Topps Tiles reports sales decline \nBDO also said inflation continued to outpace wage rises, and was a continuing concern for households, affecting how much people are spending on the high street and on nights out. \nOnly last week Handmade Burger Co - with a branch in Leicester's Highcross - collapsed into administration, a sign of the pressures affecting the restaurant industry. \nRead More: Hastings have hundreds of new jobs up for grabs in Leicester – here's how to apply \nIn May, the Enderby-based fashion giant Next announced a drop in sales, blaming a \"challenging\" consumer market. \nAnd last week the UK's biggest tile retailer Topps Tiles, based in Grove Park, Enderby, blamed falling sales on weak trading conditions. \nSyston-based homewares chain Dunelm announced sales were up, however, largely driven by its home deliveries division. \nHarborough fashion and lifestyle retailer Joules said its sales were also up. \nRichard Rose, BDO's Midlands tax partner, warned now was not a good time for the Bank of England to be thinking about raising interest rates. \nHe said: \"Since the financial crisis, the UK's economic recovery has been reliant on consumer spending and a growing services sector. \n\"For the past two years now we have witnessed both a decrease in the performance of the services sector, as well as a reduction in consumer spending, which has become more pronounced after the devaluation of sterling. \n\"To deal with the pressures of rising inflation and to accelerate economic growth, the UK's monetary policy makers are seriously considering raising interest rates. \n\"However, given the economy's clear weakness and the continuing uncertainty we are going to see from Brexit, to raise interest rates at the moment would be a major mistake.\"", "external_links": [], "published": "2017-07-10T09:00:00.000+03:00", "crawled": "2017-07-10T10:44:36.011+03:00", "highlightTitle": ""}