{"organizations": [], "uuid": "432c1f8d3df727530782b67efa3106675985f609", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13311603.ece/ALTERNATES/s1200/LAP_NEC_100717rafa_15JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/rafa-benitez-wants-use-nufc-13311810", "country": "GB", "domain_rank": 21960, "title": "Rafa Benitez wants to use NUFC Foundation to improve links with city AND look out for 'new Messi'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T21:58:00.000+03:00", "replies_count": 0, "uuid": "432c1f8d3df727530782b67efa3106675985f609"}, "author": "Lee Ryder", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/rafa-benitez-wants-use-nufc-13311810", "ord_in_thread": 0, "title": "Rafa Benitez wants to use NUFC Foundation to improve links with city AND look out for 'new Messi'", "locations": [], "entities": {"persons": [{"name": "rafa benitez", "sentiment": "negative"}, {"name": "messi", "sentiment": "negative"}, {"name": "john hall", "sentiment": "none"}, {"name": "andy carroll", "sentiment": "none"}, {"name": "paul gascoigne", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sammy ameobi", "sentiment": "none"}, {"name": "kazenga lualua", "sentiment": "none"}, {"name": "ryan hyacinth", "sentiment": "none"}, {"name": "paul dummett", "sentiment": "none"}, {"name": "fraser forster", "sentiment": "none"}, {"name": "benitez", "sentiment": "none"}], "locations": [{"name": "post-brexit britain", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "nufc foundation", "sentiment": "negative"}, {"name": "st james", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "academy", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "foundation", "sentiment": "none"}, {"name": "geordies", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle united academy", "sentiment": "none"}, {"name": "newcastle united fc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rafa Benitez wants to use NUFC Foundation to improve links with city AND look out for 'new Messi' Newcastle United boss Rafa Benitez underlines the work of the club's brilliant Foundation project Share Rafa Benitez congratulates Ryan Hyacinth of Cambois Primary (Image: The Chronicle) Share Get Newcastle United FC   \nIt was Sir John Hall who once had the romantic idea of a Newcastle United team made up entirely of “Eleven Geordies” to thrill crowds at St James’ Park. \nAs the years have gone by, the likelihood of that happening have decreased rapidly and a quick look around the walls of Newcastle’s Academy suggests that there’s plenty of room for improvement when it comes to producing local talent from the Tyneside grassroots section. \nThe youth team’s gym has pictures of those who have succeeded within the club’s youth system and made the journey from United’s junior teams to the first XI. \nPhotographs of Andy Carroll, Sammy Ameobi, Kazenga Lualua, Paul Dummett, and Fraser Forster make up the bulk of the handful of players to have broken through in recent years. 2010. Andy Carroll in action for Newcastle \nNo fan on Tyneside needs to be told that a team of 11 Geordies is a massive ask. \nHowever, since Rafa Benitez has taken over as manager he has been keen to improve the links between the club and the surrounding community. \nThe primary function of Newcastle’s Foundation is to improve the relationship between Tyneside’s community and the club. \nThere are courses for all and the mission isn’t necessarily to find the next Andy Carroll or Paul Gascoigne. \nFrom Ladies walking football teams to coaching for disabled adults to football courses in inner city areas to help keep youngsters off the streets and reduce crime. \nFinding a player to place into the club’s Academy would actually prove to be a bonus. \nSpeaking at the 1892 Foundation Cup, which saw a host of local schools play small sided games in front of the club’s coaching staff, Benitez told the Chronicle: “It’s good to see the smiles on the faces of the children and the parents. Rafa Benitez at the Newcastle United Academy 1892 Cup, action from the early games (Image: The Chronicle) \n“The staff are always great because you have to do a lot of work behind the scenes. \n“It’s great because the link between the club the Foundation and the community are important. \n“They help a lot of people who may not have had the chance. Read More \n“But now they have come here and they will remember this forever. \n“They are quite young but you can see the ability and the technique. \n“They still have to develop and learn. \n“Normally you are looking for people who work hard and try, and have the enthusiasm to do what they have to do. \n“After that, you can look for talent and give them advice. \n“The main thing is that they enjoy their football. \n“To be fair I was I lucky I watched both finals and there were some great goals.” \nEach kid that turned up at the event was handed a brand new strip, boots and shin pads before playing a tournament on the Academy’s plastic pitches. \nBenitez said: “The idea is to keep the connection between the club and the community. \n“You know from experience if you get the shirt of your team and city and you have a day with the Foundation you will keep supporting the team forever. \n“It’s important to bring more young people and we’ll have more supporters in the future. \n“Everything the Foundation does now is important. \n“You can help people do little things and that is for us something quite simple. \n“You saw a lot of people here and that was the main thing.” \nBenitez is a manager that never stops working and admits it would be fantastic if the club did produce a player on the back of one of the Foundation’s courses. \nHe said: “It’s great if you can. \n“It’s not the main idea but at the same time you come across one talent nobody knew about. \n“And then maybe he will be the new Messi!” \nAnd when asked if the club could ever come close to producing a homegrown team like Sir John Hall once dreamt about Benitez underlined the importance of focusing on the local area as much as the grounds around Europe. \nPost-Brexit Britain will result in players from the European Union needing to apply for work permits to play in England. \nTherefore, Benitez would love to see more local players flourish in the coming years. \nHe said: “It’s always been important but now it’s even more important with Brexit. \n“It is important to bring young talent and keep our club growing with the link between the city and the team. \n“I think in the end what you are looking for in football is quality and passion. \n“You have these young boys progressing and following the big names at the club. \n“In our case, that’s what you look for passion and commitment to the club.” \nUnited have cranked up their scouting network on Tyneside as they look to ensure nobody slips through the net. \nBenitez said: “We have a lot of people now looking for young players out there. \n“After that, they have to coach them well and give them the chance to go to the first team.” \n*The Foundation’s website is well worth a visit here https://nufoundation.org.uk/ Like us on Facebook", "external_links": [], "published": "2017-07-10T21:58:00.000+03:00", "crawled": "2017-07-10T23:01:33.000+03:00", "highlightTitle": ""}