{"organizations": [], "uuid": "59512d1cd3bf736c2b18d6c33ae39ebc206a6e35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article10983550.ece/ALTERNATES/s1200/JS40363383.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/electric-vehicle-revolution-way-north-13355845", "country": "GB", "domain_rank": 21960, "title": "The electric vehicle revolution is on the way - and the North East is leading the way", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-19T20:00:00.000+03:00", "replies_count": 0, "uuid": "59512d1cd3bf736c2b18d6c33ae39ebc206a6e35"}, "author": "Peter McCusker", "url": "http://www.chroniclelive.co.uk/business/business-news/electric-vehicle-revolution-way-north-13355845", "ord_in_thread": 0, "title": "The electric vehicle revolution is on the way - and the North East is leading the way", "locations": [], "entities": {"persons": [{"name": "heron", "sentiment": "none"}, {"name": "boyle", "sentiment": "none"}, {"name": "bassi", "sentiment": "none"}, {"name": "gareth dunsmore", "sentiment": "none"}, {"name": "matt boyle", "sentiment": "none"}, {"name": "colin herron", "sentiment": "none"}, {"name": "peter mccusker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "borgwarner", "sentiment": "none"}, {"name": "volvo", "sentiment": "none"}, {"name": "neaa", "sentiment": "none"}, {"name": "nissan europe", "sentiment": "none"}, {"name": "sevcon", "sentiment": "none"}, {"name": "bloomberg new energy finance", "sentiment": "none"}, {"name": "nissan sunderland", "sentiment": "none"}, {"name": "north east automotive alliance", "sentiment": "none"}, {"name": "zero carbon futures", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business   Thank you for subscribing!   \nThe impending purchase of North East low-carbon vehicle company Sevcon by a $9bn US automotive giant testifies to the growing global momentum behind electric vehicles, as Peter McCusker reports. \nEarlier this month carmaker Volvo said all new models would be partially or completely battery-powered from 2019, and the French said they will outlaw sales of all petrol and diesel cars by 2040. \nLast week analysis from Bloomberg New Energy Finance predicted that by this date 54% of all new vehicles sold - and 33% of the total global fleet - would be all electric. \nThe magnitude of this proposed generational global shift is evidenced with just 100,000 of the UK’s 26m car fleet currently electric. Although this is starting to rise; in the first six months of 2017 new electric registrations totalled more than 22,000 - 15% ahead of last year. \nThe leading brand in the UK market is the Nissan Leaf, which accounts for over half of all new UK electric vehicles (EVs), with cars and batteries being made in Sunderland. \nGareth Dunsmore, EV Director for Nissan Europe said it welcomed recent developments. He said: “By 2020, where the market conditions are right, I’m confident we’ll be selling up to 20 percent of our volume as zero emissions vehicles and this will only grow.” Matt Boyle, Sevcon president and chief executive officer (Image: Sevcon) \nThe electric motor is some 150 years old and predates the internal combustion engine. \nGateshead’s Sevcon developed its first controller for the electric motor in the 1960s with most of its initial applications targeted at industrial and light commercial work such as fork-life trucks and milk floats. \nUnder president and chief executive officer Matt Boyle, it set its stall put to become a leading player in hybrid and electric vehicles. \nIn the last couple of years it has secured over $400m of contracts supporting this transition in both the commercial and passenger vehicle market. \nAnd, in a huge vote of confidence for its aspirations earlier this week it announced it was being acquired by US automotive giant BorgWarner for £200m. Read More Gateshead firm Sevcon to be sold in deal valuing company at £150m \nMr Boyle said: “Just two years ago if someone had said that by 2040 we would be seeing that kind of market penetration to for electric and hybrid vehicles I would have said they were daft. \n“But there has been enough work done in refining the technology to make that vision now achievable. Across the world is there is now a lot of political will aimed at making the change happen quickly.” \nDr Colin Herron of Zero Carbon Futures, a Sunderland-based consultancy specialising in low carbon vehicle technologies, said the move to electrification is being driven by a number of factors. Dr Colin Herron, managing director of Zero Carbon Futures \n“Over the last 18 months, there has been a real shift in people’s awareness of the issue of air pollution in our cities and the health threat this poses. I think that this, combined with the lowering costs of electric cars and the growth of charging infrastructure are the key reasons why consumers are becoming more open to the idea of switching to electric,” he said. \nThe North East has one of the most well developed automotive supply chains in the country - most of whom are members of the North East Automotive Alliance (NEAA). \nIn recent years new low-carbon supply chain companies have grown out of the region’s universities such as Avid of Cramlington and Hyperdive of Sunderland. \nMr Heron expects this to continue: “The electric car market is important for the North East. The region’s automotive industry boasts a significant reputation for investment in new technologies. \n“Currently, the Nissan Sunderland plant makes 20% of all battery electric cars sold in Europe and the potential for more manufacturing in the region is huge. \n“Added to that are the many companies and universities in the North East who are undertaking research and developing technologies to support the industry such as Hyperdrive, Avid and Sevcon. \n“Over the next few years we expect to see a number of developments in the market. The battery range of electric cars will increase significantly allowing people to drive further on one charge. Read More Nissan and other car makers face 'cliff edge' on Brexit, industry warns \n“We’ll also see the introduction of high powered charging to allow faster charging. I think a longer term challenge will be the replacement of both buses and heavy goods vehicles with low emission alternatives.” \nWith its acquisition of Italian battery charging firm Bassi last year Sevcon has ensured it will be a key player in the charging market and Mr Boyle signalled out China as being a key player in the global EV shift. \nAbout 28m new vehicles were sold in China last year - more than in the US - and over 350,000 were electric. The Chinese Government wants this to increase to three million EVs by 2020. \nSevcon is currently working with a Chinese/US joint venture automotive manufacturer on a new controller for a city car with a battery range of 100kms. \nAt the same time, the worldwide EV market will continue to grow says Mr Boyle. “The global market is becoming more and more exciting and electrification is now a key part of the performance car makers’ strategies, as well as making major inroads in to the bus and truck market.” \nSevcon will soon be moving to larger premises on the Team Valley estate as it looks to more than double its UK headcount to around 300. \nMr Boyle continued: “The North East automotive supply chain is probably the best in the country, whilst most of it supports the manufacturing efforts of Nissan, the transition to electric vehicles offers great opportunities for many NEAA companies and for people wanting to enter an exciting industry.” A Nissan Leaf \nMr Heron added: “When we started out in this sector in 2010, there was only a limited choice of electric cars on the market with Nissan being the true pioneer with their LEAF model. \n“Since then the market has changed substantially, with now 40 different makes and models available, and most major manufacturers have shown their hands. The Volvo announcement is just an extension of this and the direction in which the automotive industry intends to move. \n“Equally, the announcement from the French Government that they will end sales of petrol and diesel vehicles by 2040 is a valuable step forward. The UK Government has set their own vision – that by the same year all new cars will be electric or ultra low emission. \n“These targets are important as they send a clear message to both manufacturers and consumers that the transition to electric cars is coming and will be supported by policy measures.” \nHowever some in the automotive and energy industry remain sceptical over the touted progress of electric vehicles, highlighting a number of issues that still need to be overcome. \nFollow Peter McCusker on Twitter @mccusker60 Like us on Facebook", "external_links": [], "published": "2017-07-19T20:00:00.000+03:00", "crawled": "2017-07-19T20:21:20.001+03:00", "highlightTitle": ""}