{"organizations": [], "uuid": "74ea4c291736f82f2471dc813299e61b55480c66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13309517.ece/ALTERNATES/s1200/Upcycled-bicycle.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/gig-economy-workers-set-down-13309203", "country": "GB", "domain_rank": 21960, "title": "Gig economy workers 'set to be let down' by Government review, unions warn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T16:13:00.000+03:00", "replies_count": 0, "uuid": "74ea4c291736f82f2471dc813299e61b55480c66"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/gig-economy-workers-set-down-13309203", "ord_in_thread": 0, "title": "Gig economy workers 'set to be let down' by Government review, unions warn", "locations": [], "entities": {"persons": [{"name": "matthew taylor", "sentiment": "negative"}, {"name": "taylor", "sentiment": "none"}, {"name": "deliveroo", "sentiment": "none"}, {"name": "frances o’grady", "sentiment": "none"}, {"name": "tim roache", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}], "locations": [{"name": "great britain", "sentiment": "none"}, {"name": "deliveroo", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "government", "sentiment": "negative"}, {"name": "royal society of arts", "sentiment": "none"}, {"name": "tuc", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "independent workers’ union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gig economy workers 'set to be let down' by Government review, unions warn Review by Matthew Taylor is set to recommend a new status of 'dependent contractor', reports say Share A Deliveroo driver (Image: Hope & Glory PR) Share Get business   Thank you for subscribing!   \nFirms in the gig economy are being “let off the hook” by a Government-ordered review into the employment rights of workers, unions are warning. \nThe review, headed by Matthew Taylor, a former adviser to Tony Blair, is set to recommend a new category of worker called a “dependent contractor”, who should receive benefits including sick pay and holiday leave. \nThe report will be published on Tuesday by Mr Taylor, the head of the Royal Society of Arts, and is expected to call for an overhaul of employment law and new guarantees on the minimum wage for the growing number of workers in delivery and taxi firms such as Deliveroo and Uber. \nUnion leaders said the review was merely “tinkering around the edges” and attacked the idea of a new category of worker. \nTUC general secretary Frances O’Grady said: “If these proposals are true, gig economy employers are being let off the hook. \n“Creating a new ‘dependent worker’ category would be caving in to special pleading from platform companies who pretend that they cannot pay the minimum wage like any other employer. \n“We already know from union wins in the courts that Deliveroo and Uber should be paying their workforce the minimum wage now, and guaranteeing them basic rights like paid holiday and breaks.” \nTim Roache, GMB general secretary, said: “If the Taylor review does indeed call for a radical overhaul of employment law, the recommendations that are leaking out seem to miss the point. \n“What we’ve seen so far is tinkering around the edges and creating more loopholes employers will inevitably exploit. Read More North East's digital sector could be harmed by Government's Brexit stance \n“Current employment laws and our tax and national insurance structures are sufficient - the issue has been one of enforcement, or lack of it. \n“Unscrupulous employers are ignoring the rights which workers already have and are not paying their fair share of taxes. \n“Any report worth its salt on the modern world of work absolutely has to tackle the use of agency and precarious work as a business model. Thousands of people work in perpetual insecurity while vastly profitable companies can make even more in profit while refusing to pay the taxes they owe all of us. \n“Anything short of a wholesale crackdown of exploitation of working people, and avoiding tax, in the name of creating a modern world of work is unacceptable and will be seen by working people as a smoke screen for the status quo while bosses carry on as normal.” \nA spokesman for the Independent Workers’ Union of Great Britain said: “Gig economy workers already have a right to the minimum wage and these proposals seem to want to erode those rights, particularly by preventing workers from pursuing employers that pay below the minimum wage. \n“The point of this review should be to figure out how to make things better for these workers, not worse.” Like us on Facebook", "external_links": [], "published": "2017-07-10T16:13:00.000+03:00", "crawled": "2017-07-10T16:36:17.004+03:00", "highlightTitle": ""}