{"organizations": [], "uuid": "d99b26ec229805305e094cd14a00d95fab09a3ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30438661/16079134.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/under-fire-mp-anne-marie-morris-cancels-newton-abbot-surgery/story-30438661-detail/story.html", "country": "GB", "title": "Under-fire MP Anne Marie Morris cancels Newton Abbot surgery", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-13T13:38:00.000+03:00", "replies_count": 0, "uuid": "d99b26ec229805305e094cd14a00d95fab09a3ea"}, "author": "Guy_Henderson", "url": "http://www.devonlive.com/under-fire-mp-anne-marie-morris-cancels-newton-abbot-surgery/story-30438661-detail/story.html", "ord_in_thread": 0, "title": "Under-fire MP Anne Marie Morris cancels Newton Abbot surgery", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "martin warne", "sentiment": "none"}, {"name": "anne marie", "sentiment": "none"}, {"name": "steve brookes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "anne marrie morris", "sentiment": "none"}, {"name": "anne-marie morris", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "passmore edwards centre", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "newton abbot", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "newton abbot tories", "sentiment": "none"}, {"name": "ms morris", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Under-fire MP Anne Marie Morris cancels Newton Abbot surgery By Guy_Henderson | Posted: July 13, 2017 2 COMMENTS SHARES Comments (2) \nUnder-pressure Newton Abbot MP Anne-Marie Morris was absent from her planned surgery in the town on Thursday morning. The Conservative MP, who has been stripped of the party whip after being recorded making a racist remark, had been due to meet constituents at one of her regular sessions at the Passmore Edwards Centre. \nHowever, there was no sign of Ms Morris at the centre, where staff said the surgery had been called off. There was no news of the cancellation on Ms Morris' website ahead of the surgery. Her Twitter feed has not been updated since the n-word controversy broke, and neither has her Facebook page. \nHowever, it is understood that around a dozen people had made appointments to see her on Thursday morning, and they had all been notified of the cancellation. A spokesman for her office said later that the surgery had not been cancelled, but 'on advice it was relocated'. \nTV crews and journalists milled around outside the centre, which also houses the town's library. \nMs Morris hit headlines worldwide when she was recorded describing the UK leaving the EU without a deal as a \"real n r in the woodpile\" at the launch of a report into the future for the UK's lucrative financial sector after Brexit. She has since apologised for the remarks, saying: \"The comment was unintentional and I apologise unreservedly for any offence caused.\" \nBut she has had the whip suspended by the Conservative Party, which means that although she is still an MP, she is no longer a Conservative MP. Local Tories have said they support her, and have described the issue as 'a storm in a teacup'. However, there have also been calls for her to resign. \nREAD MORE: Newton Abbot Tories support their MP despite the racism row \nThere was support for Ms Morris outside the centre as the clock ticked around to the surgery opening time of 11am with no sign of the star of the show. \nLocal backer Martin Warne, a member of Northern Ireland's balance-of-power-holding Democratic Unionist Party, described himself as Anne Marrie Morris' staunchest supporter. He said he wasn't surprised that she had cancelled the surgery after 'all the negative publicity and unfair criticism'. \n\"She said something unfortunate and she regrets it,\" he said. \"The reaction has been totally out of proportion. It has been hostile, it has been a lot of negative publicity and grossly unfair criticism for an unfortunate comment. \nCOMMENT: Why it's hard to see a way forward for Anne Marie Morris after this \n\"It was an outdated comment which I'm sure Anne Marie immediately regretted, and has apologised for. It certainly hasn't weakened her position in one of the strongest seats in England. \n\"There have been a few calls for her to resign as MP from a few people, but there are 28,635 reasons for her to stay, and I believe she will.\" \nThe 28,635 figure is the number of people who voted for Anne Marie Morris in the Newton Abbot constituency in the recent General Election. \nOther supporters also made their voices heard. Steve Brookes said he had come to show his support in Latin, saying 'nil desperandum', or do not despair, and 'illegitimi non carborundum', or don't let the bastards grind you down. \nHe added: \"This is a total storm in a teacup. If this is all this country has got to worry about, then God help us all.\" ", "external_links": [], "published": "2017-07-13T13:38:00.000+03:00", "crawled": "2017-07-13T16:29:59.010+03:00", "highlightTitle": ""}