{"organizations": [], "uuid": "db34a3be318d24b79feb70f3a1b62083a0453e06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13317316.ece/ALTERNATES/s1200/Taylor-Review-of-Modern-Working-Practices-launch.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/weve-year-theresa-prime-minister-13327620", "country": "GB", "domain_rank": 21960, "title": "We've had a year of Theresa May as Prime Minister - here's her term so far in her own words", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-13T23:00:00.000+03:00", "replies_count": 0, "uuid": "db34a3be318d24b79feb70f3a1b62083a0453e06"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/weve-year-theresa-prime-minister-13327620", "ord_in_thread": 0, "title": "We've had a year of Theresa May as Prime Minister - here's her term so far in her own words", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "philip may", "sentiment": "none"}, {"name": "juncker", "sentiment": "none"}, {"name": "philip", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "michael heseltine", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "john bercow", "sentiment": "none"}, {"name": "phil", "sentiment": "none"}, {"name": "lady heseltine", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "washington dc", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "wrexham", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "maidenhead conservative", "sentiment": "none"}, {"name": "pool reuters", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "pa wire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThey do say a year is a long time in politics and Theresa May’s stock has certainly shifted in the 12 months since she brought clarity to post-referendum Britain by telling us “Brexit means Brexit”. \nIn that time the Prime Minister has told her Britain just who takes her bins out, boasted of a loyal friendship with the DUP and called an election to boost her majority (how did that go?). \nThe Maidenhead Conservative MP became Britain’s Prime Minister on 13, July 2016. \nHere are some of her best quotes. 2016: \nOn the same day Andrea Leadsom announced she was not going to run against Theresa May, the soon-to-be confirmed Prime Minister gave us a thorough answer on what is in store in the complicated move to leave European Union, following the referendum in June that year. \nOn July 11, 2016, she said: “Brexit means Brexit, and we’re going to make a success out of it”. Prime Minister Theresa May (Image: PA) \nTheresa’s fighting talk: \nOctober 2: “Let me be clear. We are not leaving the European Union only to give up control of immigration again. And we are not leaving only to return to the jurisdiction of the European Court of Justice” - Mrs May sets down her goals in the Brexit negotiations, in a speech to the Conservative conference in Birmingham. \nSo, where exactly is the world? \nOctober 5: “If you believe you’re a citizen of the world, you’re a citizen of nowhere. You don’t understand what the very word ‘citizenship’ means” - In her keynote speech to the Conservative conference, calling for a “quiet revolution” in British Government. \nFront bench bants \nAt the Spectator awards, where Foreign Secretary Boris Johnson was given the “comeback of the year award” after ruling himself out of the Tory leadership position before being given a cabinet position, Mr Johnson joked that he hoped he would survive longer than Lady Heseltine’s dog. The dog survived being partially strangled before being put down, after it attacked the Michael Heseltine. \nT-May then took to the stage and dropped this: “Boris, the dog was put down when its master decided it wasn’t needed any more.” \nOuch. The Union flag and the EU flag flying (Image: PA) 2017 \nDeal or No Deal? \nJanuary 17: “No deal for Britain is better than a bad deal for Britain” - Theresa May uncovers her cards while delivering her directive for the Brexit negotiations. Prime Minister Theresa May holding talks with US President Donald Trump (Image: PA) \nA match made in heaven? \nJanuary 27: “Haven’t you ever noticed? Sometimes opposites attract” - Visiting Donald Trump in Washington DC. \nA strong decision \nBack in April, Mrs May called an election, confident of increasing her majority so she would have a mandate to push through her Brexit vision. Went well, didn’t it? \nApril 18: “It was with reluctance that I decided the country needs this election, but it is with strong conviction that I say it is necessary to secure the strong and stable leadership the country needs to see us through Brexit and beyond” - Calling a snap election outside Downing Street. Read More Warning over 20 years of failure to cut the gap between the haves and have-nots \nApril 27: “Every vote for him (Jeremy Corbyn) is a vote for a chaotic Brexit. Every vote for me is a vote to strengthen our hand in negotiating the best deal for Britain. Every vote for him is a vote for a weaker economy, every vote for me is a vote for a stronger economy with the benefits felt by everyone across the country. And every vote for him is a vote for a coalition of chaos” - Prime Minister Theresa May greets European Commission President Jean-Claude Juncker ahead of a working dinner at 10 Downing Street, London (Image: John Stillwell/PA Wire) \nBloody Difficult \nMay 3 : “During the Conservative Party leadership campaign I was described by one of my colleagues as a bloody difficult woman. And I said at the time the next person to find that out will be Jean-Claude Juncker” - Mrs May, speaking after details of a dinner with Mr Juncker were leaked. British Prime Minister's husband Philip May (Image: Pool Reuters) \nWhen the bin’s filled, Phil takes them out. \nMay 9: “There’s boy jobs and girl jobs you see” - Theresa May on the One Show, where she revealed her husband Philip takes the bins out. \nWhen she introduced a contribution cap on her ‘dementia tax’ plan to make pensioners pay for their social care Read More \nMay 22: “Nothing has changed, nothing has changed” - At the launch of the Welsh Conservative manifesto in Wrexham, following a U-turn on social care. \nOn Terror \nJune 4: “It is time to say enough is enough. Everybody needs to go about their lives as they normally would. Our society should continue to function in accordance with our values. But when it comes to taking on extremism and terrorism, things need to change” - Speaking outside 10 Downing Street following terror attacks in Manchester and London. Fields of wheat (Image: PA) \nWhat’s the naughtiest thing you’ve ever done? \nJune 6: “I have to confess, when me and my friend, sort of, used to run through the fields of wheat, the farmers weren’t too pleased about that” - Theresa May on her naughtiest antics. \nOn the controversial plan to form a coalition with an anti-LGBT and anti-abortion party with links to loyalist paramilitary groups \nJune 8: “We will continue to work with our friends and allies in the Democratic Unionist Party in particular” - Mrs May’s reliance on support from minor parties exposed in her statement outside 10 Downing Street after losing her Commons majority. Speaker of the House of Commons John Bercow in the House of Commons, London (Image: PA Wire) \nGallows humour \nJune 13: “At least someone got a landslide” - Congratulating Tory MP John Bercow on his re-election as Speaker of the House of Commons. \nAn admission \nJune 21: “The support on the ground for families in the initial hours was not good enough. That was a failure of the state, local and national, to help people when they needed it most” - Speaking to Parliament in the aftermath of the Grenfell Tower fire. \nA version of this story first appeared in the Birmingham Mail http://www.birminghammail.co.uk/news/uk-news/memorable-quotes-theresa-during-first-13311967 Like us on Facebook", "external_links": [], "published": "2017-07-13T23:00:00.000+03:00", "crawled": "2017-07-13T23:51:42.001+03:00", "highlightTitle": ""}