{"organizations": [], "uuid": "0d98bb7329f8067c72dbf0bf696a4eca85d7358a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30420839/16067450.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/here-s-the-three-choices-on-the-table-for-exeter-s-bus-station-development/story-30420839-detail/story.html", "country": "GB", "title": "Alex_Richards commented Here's the three choices on the table for Exeter's massively over...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-03T19:49:00.000+03:00", "replies_count": 0, "uuid": "0d98bb7329f8067c72dbf0bf696a4eca85d7358a"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/here-s-the-three-choices-on-the-table-for-exeter-s-bus-station-development/story-30420839-detail/story.html", "ord_in_thread": 0, "title": "Alex_Richards commented Here's the three choices on the table for Exeter's massively over...", "locations": [], "entities": {"persons": [{"name": "alex", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "cllr andrew leadbetter", "sentiment": "none"}, {"name": "phil bialyk", "sentiment": "none"}, {"name": "cllr leadbetter", "sentiment": "none"}, {"name": "richards", "sentiment": "none"}, {"name": "emma osmundsen", "sentiment": "none"}, {"name": "cllr phil bialyk", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "exeter", "sentiment": "none"}, {"name": "exeter conservatives", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "exeter bus & coach station", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "central government", "sentiment": "none"}, {"name": "council", "sentiment": "none"}, {"name": "leisure complex and bus station programme board", "sentiment": "none"}, {"name": "st sidwell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Here's the three choices on the table for Exeter's massively over budget pool and bus scheme By Alex_Richards | Posted: July 03, 2017 5 COMMENTS SHARES Comments (5) \nExeter City Council members have to choose one of three options on the table if they are to progress with the multi-million pound redevelopment of Exeter Bus & Coach Station. \nOn Saturday it was revealed that the council were recommending one of three options , which would bring the scheme over budget by £8m and bring the overall cost of the project £40m before the first shovel has broke ground. \nThe council say a variety of factors are to blame for the cost being a lot more than the original estimate made by the council's external advisors - primarily the Brexit. \nThe other two options are just as controversial, and are laid out below. The Budget Compliant \nBus station: £6.25m \nTotal cost: £32.25m \nOption one is to develop the new Leisure Centre and Bus Station aligned to the already Council approved total project cost. \nTo achieve this the top floor of the leisure centre would need to be removed (the Spa and two studios), and 40 per cent of the gym area removed. \nThe enclosed glazed wall would also need to be removed from the Bus Station concourse. The buildings designed are 'compromised.' The Best and Final Offer \nPool: £33.05m \nBus station: £6.87m \nTotal cost: £39.92m \nOption two is to develop the new Leisure Centre and Bus Station aligned to the revised BAFO figure (incorporating value engineering). \nThe facility mix would match the one in the Feasibility Study. The buildings would remain largely as designed, with amendments to what's inside and some outside elements. \nThis is the one being recommended to members - and is nearly £8m over the original budget. The Original Tender \nBus station: £8.06m \nTotal cost: £44.27m \nOption three is to develop the new Leisure Centre and Bus Station aligned to the most favourable tender return figure. \nThe facility mix and design of the buildings would remain exactly as issued in the original Tender documents. \nThe developments, funded by Labour-led Exeter City Council, are seen as crucial to the overall £115m redevelopment of Exeter Bus & Coach Station, in partnership with the Crown Estate. \nBut Conservative Party opposition in the city say they are \"flabbergasted\" by the cost increase. \nThe current agreed budget of £32.25m is has a ring-fenced budget. The proposed increase in the budget would mean £6.27m would need to come from borrowing from Central Government or a bank. \nBut the council has defended the cost of borrowing, claiming it will be 'more than covered by the income St Sidwell's Point will generate.' \nReturn to Devon Live home page or read next: Exeter shopper attacked while enjoying wrap calls on the 'eradication' of the birds \nCllr Andrew Leadbetter, leader of Exeter Conservatives, said: \"We are absolutely flabbergasted. We thought this project was expensive before, now it is nearly £40m and they haven't even started building it. \n\"The city council has spent nearly £4m for consultancy fees already, and hasn't got a bucket of water to show for it. \n\"The Tories in Exeter have always agreed that we need a new pool, but we were unhappy with the original proposal of £18m.\" \nBelow: We speak to Cllr Phil Bialyk and Emma Osmundsen about the surprise development \n\"It is time for a rethink this vanity project of theirs, and we really call upon Labour members to think about what is best for our city. This is a crazy amount of money to spend on a project and we'd see no other projects funded in the city.\" \nCllr Leadbetter added: \"The council must have Jeremy Corbyn's 'Magic Money Tree' growing somewhere.\" \nCouncillor Phil Bialyk, lead councillor with responsibility for bus station redevelopment, said: \"We've taken our time to get this right. We said we'd deliver, and even in difficult times we plan to do just that. \n\"This is about civic pride and setting the right tone for the continued redevelopment of the city centre. It is also about providing the quality buildings and quality services that people expect and deserve. \n\"The budget to deliver these developments is more than we first thought, but that's not unusual post the Brexit vote and with the uncertainty over the economy that continues. \n\"But the project has been independently assessed as being value for money. And we absolutely think the investment in the city will be worth every penny. \n\"It will help to ensure the long term viability of the city centre, which is responsible for generating a huge number of jobs, and it will provide the residents of Exeter with facilities worthy of our great city for many decades to come.\" \nFollowing the Leisure Complex and Bus Station Programme Board on Monday, July 10, the city council's Executive will meet on Tuesday, July 11, and will be asked to give the recommendation their backing. \nA final decision would then be made at a meeting of the full council on Wednesday, July 19.", "external_links": [], "published": "2017-07-03T19:49:00.000+03:00", "crawled": "2017-07-04T01:15:07.009+03:00", "highlightTitle": ""}