{"organizations": [], "uuid": "00748d17232877d7f84d3f868e1f1cceb1d0529e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30447898/16084792.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/brexit-won-t-happen-ben-bradshaw-mp-column/story-30447898-detail/story.html", "country": "GB", "title": "DanielClark commented Brexit won't happen - and here is why - Ben Bradshaw MP Column", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-19T14:28:00.000+03:00", "replies_count": 0, "uuid": "00748d17232877d7f84d3f868e1f1cceb1d0529e"}, "author": "DanielClark", "url": "http://www.devonlive.com/brexit-won-t-happen-ben-bradshaw-mp-column/story-30447898-detail/story.html", "ord_in_thread": 0, "title": "DanielClark commented Brexit won't happen - and here is why - Ben Bradshaw MP Column", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit won't happen - and here is why - Ben Bradshaw MP Column By DanielClark | Posted: July 19, 2017 10 COMMENTS SHARES \nBen Bradshaw is the Labour MP for Exeter and has been since 1997 \nI'm going to make a bold prediction. Brexit won't happen. There. I've said it. \nIt's what a lot of people are thinking and many hoping, but not saying, for fear of appearing \"undemocratic\". \nLet me explain my reasoning for this prediction. \nI've always thought there was a good chance Brexit wouldn't happen once the British people were faced with a terrible negotiation and an even worse deal. But the general election and its aftermath have brought that moment forward. \nOnly now are we having the debate about what Brexit actually means and the different types of Brexit that we didn't during the Referendum campaign and haven't since because an imperious Prime Minister closed down all discussion with her meaningless mantra \"Brexit means Brexit.\" \nThat Prime Minister has now lost her majority and with it her authority. The level and tone of public squabbling among her Ministers is unprecedented. This week Michael Gove's ex advisor and head of the Leave campaign described the Brexit Secretary, David Davis, as \"thick as mince, lazy as a toad and vain as Narcissus.\" Soft Brexiter Cabinet Ministers hit back at Gove and Boris Johnson calling them \"testosterone-fuelled donkeys\" and \"safe seat kids\" who should \"go back to being the juvenile scribblers they were before they entered politics.\" Read more Ben Bradshaw Column: MPs must work together to stop 'gross act of self-harm' hard Brexit \nThis might be entertaining were it not so serious for the country. With a Cabinet at war with itself, how can it be expected to negotiate itself out of a paper bag, let alone conduct the most complicated, challenging, important talks this country has ever embarked on? \nWhat these Cabinet rows have exposed is the basic incompatibility of the Leave campaign's two main groups. One want to reduce immigration, whatever the cost to our economy and the other want an ultra-free-market free trade Britain and aren't bothered about immigration. Read more Exeter's Ben Bradshaw spreading the love is the must watch video of the election \nMrs May has no parliamentary majority for her extreme hard Brexit – outside the Customs Union and the Single Market. But as soon as she retreats from this and adopts a more sensible, softer Brexit, the Conservative Party will descend into civil war and, in all probability, split. The greatest danger is that the UK Government, riven with divisions, is incapable of negotiating anything, talks break down and we fall off the cliff edge. I can't see that happening without Parliament intervening to stop what would be the worst of all possible outcomes. And what then? \nNo hard Brexit, no soft Brexit, no chaotic cliff edge Brexit. And all the time the practical impact of Brexit hitting the public in lower living standards, less investment, more austerity and fewer jobs. Public opinion is already changing. Most now want to stay in the Single Market and Customs Union and most want a say on any final deal. \nThe illusion of a pain-free Brexit that would stop free movement and payments to the EU while maintaining free trade is being shattered. If the British people are renowned for one thing – it's their common sense. I can't see them tolerating a course of action that will result in their own significant impoverishment. ", "external_links": [], "published": "2017-07-19T14:28:00.000+03:00", "crawled": "2017-07-19T15:18:27.002+03:00", "highlightTitle": ""}