{"organizations": [], "uuid": "2fe467aaaf8288a216914a90824d4004d48d2c32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13393777.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/forget-chlorinated-chickens-good-brexit-13393608", "country": "GB", "domain_rank": 21960, "title": "Forget chlorinated chickens, this is why a good Brexit deal is crucial to the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-30T10:00:00.000+03:00", "replies_count": 0, "uuid": "2fe467aaaf8288a216914a90824d4004d48d2c32"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/forget-chlorinated-chickens-good-brexit-13393608", "ord_in_thread": 0, "title": "Forget chlorinated chickens, this is why a good Brexit deal is crucial to the North East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Forget chlorinated chickens, this is why a good Brexit deal is crucial to the North East Business leaders reveal EU-owned companies help pump £9bn into the region's economy making a good Brexit deal vital Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe dependance of the North East economy on the European Union is laid bare in a new report. \nIt reveals EU-owned businesses contribute more than £9bn to the region’s economy each year. \nAnd a business expert has said consumers could end up paying higher prices for goods if Brexit leads to less investment here by these companies. \nThe North East has the highest ratio of EU-owned businesses to UK-owned businesses in the country which generate 10% of the total Gross Value Added (GVA) figure for the region - ie the total number of goods and services produced here. \nSome 60% of the region’s exports also go to the EU, the Office for National Statistics research found. Allie Renison \nAllie Renison, head of EU and trade policy at the Institute of Directors, said: “The large contribution that these firms make to GVA does create a concern about what would happen if they began to plan to scale investment back here. \n“One particularly important factor here is the lack of clarity for existing EU workers in the UK, and the unclear prospects for future movement of workers between the UK and EU.” \nShe added that the Institute of Directors has been appealing to the Government to prioritise negotiating a deal with the EU in this particular regard. \nMs Renison hopes that EU-owned firms will lobby both sides of the negotiating table “to push for a Brexit deal that keeps the level of friction for trade to an absolute minimum”. \n“It’s in their interest, as much as it for UK companies, that we get a transitional agreement that takes us smoothly to a new free trade agreement with the EU,” she said. EU and Union flags (Image: PA) \nMeanwhile Dr Pierre Gröning, director of international trade policy at Brussels-based Foreign Trade Association (FTA), said retail and fashion brands are reluctant at the moment to invest in the UK because of the “big risks and the lack of legal clarity about the Brexit consequences”. \nHe added: “At the same time, we do not predict any major de-investment from EU27-based companies but rather a period of business stagnation and lower profits. \n“It is likely that the consumer will end up paying the Brexit bill in the form of higher prices.” \nAnd experts in the North said the report shows the significance of the EU market to the region. \nBen Powick, policy adviser at the North East England Chamber of Commerce , said: “These figures just show the importance of the EU market to the North East, particularly for inward investment, with international brands deciding to make their home in the region. \n“The Government needs to act now to make sure these businesses stay and continue to invest, from ensuring the right for EU workers to remain to making sure we have frictionless trade with the EU in the future.” Read More ", "external_links": [], "published": "2017-07-30T10:00:00.000+03:00", "crawled": "2017-07-30T10:34:37.001+03:00", "highlightTitle": ""}