{"organizations": [], "uuid": "e2ac27e957f58567ec9087d6c29cff37e56a1468", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30432719/16074982.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/who-is-anne-marie-morris-the-newton-abbot-mp-slammed-for-using-n-word/story-30432719-detail/story.html", "country": "GB", "title": "Alex_Richards published Who is Anne Marie Morris? The Newton Abbot MP slammed for using...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T19:34:00.000+03:00", "replies_count": 0, "uuid": "e2ac27e957f58567ec9087d6c29cff37e56a1468"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/who-is-anne-marie-morris-the-newton-abbot-mp-slammed-for-using-n-word/story-30432719-detail/story.html", "ord_in_thread": 0, "title": "Alex_Richards published Who is Anne Marie Morris? The Newton Abbot MP slammed for using...", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "roger kendrick", "sentiment": "none"}, {"name": "nick boles", "sentiment": "none"}, {"name": "ernst", "sentiment": "none"}, {"name": "anne marie", "sentiment": "none"}, {"name": "marie chadwick", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "jo johnson", "sentiment": "none"}, {"name": "devonlive", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "west sussex county council", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "people's republic of south devon", "sentiment": "none"}], "organizations": [{"name": "newton abbot", "sentiment": "none"}, {"name": "rural health and social care", "sentiment": "none"}, {"name": "health overview and scrutiny committee", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "business brexit", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "all party parliamentary group", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pps", "sentiment": "none"}, {"name": "appg", "sentiment": "none"}, {"name": "parliament for newton abbot", "sentiment": "none"}, {"name": "public accounts committee", "sentiment": "none"}, {"name": "pensions selection committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who is Anne Marie Morris? The Newton Abbot MP slammed for using N-word in Brexit meeting By Alex_Richards | Posted: July 10, 2017 0 COMMENTS SHARES Tory MP Anne Marie Morris, first elected the Member of Parliament for Newton Abbot in 2010, has landed herself in hot water Who is Anne Marie Morris? The Newton Abbot MP slammed for using N-word in Brexit... X \nCopy link to paste in your message / Tory MP Anne Marie Morris, first elected the Member of Parliament for Newton Abbot in 2010, has landed herself in hot... Comments (0) \nTory MP Anne Marie Morris, first elected the Member of Parliament for Newton Abbot in 2010, has landed herself in hot water - after using a shocking racist phrase in a meeting about Brexit. \nMs Morris described the UK leaving the EU without a deal as \"real n****r in the woodpile\" - and the comment was recorded. \nNow she is facing calls from every direction to resign and The Conservative Party has confirmed that an investigation into the remark has been launched. \nBut who is Anne Marie Morris and what is her role in Parliament? \nAnne Marie lives in Newton Abbot and has a family history in Devon that can be traced back some 200 years. She has two dogs. \nAfter her first term, Ms Morris was re-elected in May 2015 with a majority of 11,235 and then again in June 2017 with an increased majority of 17,160. \nShe has set up two new APPG's since her re-election and is the current Chairperson of both groups. The first is on Rural Health and Social Care, looking at problems faced in the health and care sector in the South West. \nBelow: The offending recording \nThe second, is on Business Brexit, considering how businesses can overcome the challenges and 'make the most of Brexit.' \nAnne Marie was a member of the Public Accounts Committee during the 2015 Parliament and regularly leads on matters regarding health expenditure. \nFrom 2015 to 2016, following the General Election, Anne Marie was appointed Parliamentary Private Secretary (PPS) to Nick Boles MP and Jo Johnson MP, a role which saw her communicate between backbench MPs and their government ministers. \nBefore 2015, she held a number of other positions including a seat on the Work and Pensions Selection Committee in October 2012 until March 2015. \nShe also set up and chaired the All Party Parliamentary Group (APPG) for Micro Businesses in 2011, was also Chair of the APPG for Small Business and Vice Chair of the APPG for Entrepreneurship. \nAnne Marie was also made Conservative Small Business Ambassador for the South West by the Prime Minister. \nBefore becoming a member of parliament in 2010 Anne Marie ran her own micro business specialising in mentoring businesses in the South West. \nAfter a career working as a corporate lawyer and subsequently a marketing director for PriceWaterhouseCooper (PwC) and Ernst and Young. \nShe also served as a County Councillor having been elected to the West Sussex County Council where she was Chair of the Health Overview and Scrutiny Committee. \nLast month, ironically, Ms Morris distanced herself from comments made by her electoral agent and partner - who claimed that the 'crisis in education' was \"due entirely to non-British born immigrants and their high birth rates.\" \nAnne Marie had faced criticism from both the People's Republic of South Devon and Liberal Democrat candidate Marie Chadwick in regards to the comment, saying that it detracted from the debate and was totally unnecessary. \nBut in response, Anne Marie Morris told DevonLive: \"I don't share the views expressed by Roger Kendrick.\" \nBelow: Follow live updates and reaction to Anne Marie Morris' shocking use of the N-word Updating", "external_links": [], "published": "2017-07-10T19:34:00.000+03:00", "crawled": "2017-07-10T20:41:49.003+03:00", "highlightTitle": ""}