{"organizations": [], "uuid": "cb8d7a4fe92b755687e04bb38d550e104846b3a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13176715.ece/ALTERNATES/s1200/Mobile-roaming-charges.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-bans-data-roaming-charges-13176770", "country": "GB", "domain_rank": 21960, "title": "Roaming charges now scrapped so you won't pay big bills to use phone on holiday in the EU", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-24T13:10:00.000+03:00", "replies_count": 0, "uuid": "cb8d7a4fe92b755687e04bb38d550e104846b3a5"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-bans-data-roaming-charges-13176770", "ord_in_thread": 0, "title": "Roaming charges now scrapped so you won't pay big bills to use phone on holiday in the EU", "locations": [], "entities": {"persons": [{"name": "vanden wijngaert", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ernest doku", "sentiment": "none"}, {"name": "kester mann", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "channel islands", "sentiment": "none"}, {"name": "andorra", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "eu news roaming", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "ccs", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Roaming charges now scrapped so you won't pay big bills to use phone on holiday in the EU It's good news if you're going on holiday as you won't pay extra in the EU to use your phone - but how will Brexit affect this? Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nRules have changed and mobile phone customers living in the EU won’t be slapped with extra ‘roaming’ charges to make calls, send texts or use data in other member states. \nThe new regulations mean your UK phone company must charge you the same to use your phone in other EU countries as they would if you were using the mobile in Britain, although the rule only applies when you are travelling. If you phone abroad from the UK then you can still be hit with extra charges. Why has the EU banned roaming charges Members of European Parliament (Image: AP Photo/Geert Vanden Wijngaert) \nYou may have seen tales of holiday makers getting the shock of their lives when their monthly bill comes through. Sometimes customers didn’t even realise they’d switched the roaming function on, or forgotten to turn it off, and come home to a hefty cost. In extreme cases people have paid bills upwards of £1,000. \nThe roaming charge ban puts and end to this - in EU member states at least. Read More Does the ban apply to the whole EU or all of Europe? \nYou can use your phone without worry in the 28 EU countries. \nBut be careful in the islands off the coast of Britain. The Channel Islands and Isle of Man are not formally part of the EU, so you need to check with your operator to see how you’ll be charged there. \nSimilarly, there are other non-EU countries within the continent, such as Switzerland, Andorra and Turkey. Again, you’ll need to check with your operator, although some have scrapped or heavily reduced charges in these areas. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Haven’t charges reduced in recent years? \nYes, the European Commission says it spent a decade up to 2015 cutting the cost of using your phone in other EU states by 80%. In 2015, it announced the 2017 ban, and in 2016 a cap was placed on roaming charges, with a maximum surcharge of around 3.5p/minute per call, 1.4p per text and 3.5p per MB of data, ahead of Friday’s total ban. What about after Brexit? The Union flag and the EU flag flying (Image: PA) \nIt’s not clear what will happen to British customers once we leave the EU. However, industry insiders think operators would be daft to reintroduce huge charges. Rather, a trend to cheap global roaming is thought to be more likely. \nUswitch spokesman Ernest Doku said the challenge for providers who want to steal a march will be in their ability to remain flexible in handling any changes resulting from Brexit , and how quickly they can broker deals in other countries ahead of the rest. \n“Either way, all signs point to worry-free global roaming becoming a new battleground amongst providers,” he said. \nKester Mann, telecoms analyst at CCS Insight told the Mirror bringing back big holiday charges would be a “foolhardy option”. \nHe added: “I think it would go down very, very badly with customers. \n“It would be very difficult for them to do that just because the UK is such a competitive market and we’ve moved such a long way from roaming.” Read More ", "external_links": [], "published": "2017-07-24T13:10:00.000+03:00", "crawled": "2017-07-24T14:10:30.015+03:00", "highlightTitle": ""}