{"organizations": [], "uuid": "934877597d5d7b8f53e8636b77570a2ffbaccd0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11086408.ece/ALTERNATES/s1200/JS85730589.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-united-owner-mike-ashley-13358180", "country": "GB", "domain_rank": 21960, "title": "Newcastle United owner Mike Ashley sees Sports Direct profits more than halved", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-20T10:22:00.000+03:00", "replies_count": 0, "uuid": "934877597d5d7b8f53e8636b77570a2ffbaccd0f"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-united-owner-mike-ashley-13358180", "ord_in_thread": 0, "title": "Newcastle United owner Mike Ashley sees Sports Direct profits more than halved", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "ashley", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "derbyshire", "sentiment": "none"}, {"name": "shirebrook", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "news newcastle united", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle United owner Mike Ashley sees Sports Direct profits more than halved The business has been left exposed to a drop in the value of the pound after the Brexit vote, meaning profits have tumbled by 58.7% Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSports Direct has reported an eye-watering nose dive in profits, with gains more than halving in the past 12 months. \nMike Ashley’s cut-price retail business has been left exposed by the drop in the value of the pound following the Brexit vote. \nThe Newcastle United owner’s firm reported a 58.7% plummet in underlying pre-tax profits to £113.7 million for the year to April 30. \nMr Ashley said the group had taken action to limit the impact of the pound’s heavy falls against the US dollar, but had a worrying message for investors: “we remain exposed”. \nThe group, which sources many of its branded goods in US dollars from Asia, said it was “optimistic” for the year ahead, targeting underlying earnings growth of between 5% and 15% despite ongoing pressure from the pound. \nIt said the rollout of a new store format was bearing fruit, with better-than-expected early results. \nMr Ashley said: “However, we will continue to be conservative in managing for the medium to long term, which may result in short-term fluctuations in underlying EBITDA (earnings), particularly given the continued uncertainty surrounding Brexit.” \nLike-for-like retail sales edged 0.3% higher over the year, while total revenues rose 11.7% as its international sales benefited from weaker pound. \nSports Direct warned after last June’s EU referendum that profits would be hit because the company failed to hedge against the fall in sterling in the immediate aftermath of the vote, meaning the weak pound impacted its product-buying power. \nIts financial troubles have come amid a storm of controversy surrounding Sports Direct and Mr Ashley. Read More Mike Ashley top of North East rich list despite losing a lot of wonga in last 12 months \nThe 52-year-old tycoon has been embroiled in a court case this summer with an investment banker over a £15 million deal allegedly struck in a London pub, with Mr Ashley still awaiting the verdict. \nIt comes as Sports Direct also continues to recover from the damage to its reputation after allegations last year over working practices at its Shirebrook headquarters in Derbyshire, with Mr Ashley hauled before MPs for a grilling. Read More Mike Ashley waiting for verdict on multimillion pound High Court battle \nDespite warning that a slump in profits was likely last week, it hasn’t stopped Mr Ashley buying up fellow high-street names. \nNever one to miss a bargain, he recently purchased a 26% stake in the struggling Game Digital chain. Like us on Facebook", "external_links": [], "published": "2017-07-20T10:22:00.000+03:00", "crawled": "2017-07-20T11:15:56.006+03:00", "highlightTitle": ""}