{"organizations": [], "uuid": "5dd24743bf43e4884b5bbd742e3ac6d82cae2553", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13269510.ece/ALTERNATES/s1200/Rafa-Colly.jpg", "site_section": "http://www.chroniclelive.co.uk/sport/?service=rss", "section_title": "nechronicle - Sport", "url": "http://www.chroniclelive.co.uk/sport/rafa-benitez-benign-dictator-inferiority-13269435", "country": "GB", "domain_rank": 21960, "title": "Rafa Benitez is a 'benign dictator' with an 'inferiority complex' who must evolve, claims Collymore", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-02T14:01:00.000+03:00", "replies_count": 0, "uuid": "5dd24743bf43e4884b5bbd742e3ac6d82cae2553"}, "author": "Chris Waugh", "url": "http://www.chroniclelive.co.uk/sport/rafa-benitez-benign-dictator-inferiority-13269435", "ord_in_thread": 0, "title": "Rafa Benitez is a 'benign dictator' with an 'inferiority complex' who must evolve, claims Collymore", "locations": [], "entities": {"persons": [{"name": "rafa benitez", "sentiment": "negative"}, {"name": "coll", "sentiment": "negative"}, {"name": "joe hart", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "collymore", "sentiment": "none"}, {"name": "florian lejeune", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}, {"name": "rafa", "sentiment": "none"}, {"name": "alex ferguson", "sentiment": "none"}, {"name": "stan collymore", "sentiment": "none"}, {"name": "benitez", "sentiment": "none"}], "locations": [{"name": "liverpool", "sentiment": "none"}, {"name": "anfield", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "collymore sport", "sentiment": "negative"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle united fc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sport Rafa Benitez is a 'benign dictator' with an 'inferiority complex' who must evolve, claims Collymore Newcastle United boss Rafa Benitez's ability to operate as a manager at a modern-day football club has been questioned by Stan Collymore Share Click to play Tap to play The video will start in 8 Cancel Play now Get Newcastle United FC updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nRafa Benitez is a “benign dictator” with an “inferiority complex” who must “evolve” if he is to succeed under Mike Ashley’s ownership at Newcastle United, claims Stan Collymore. \nIn his latest column for The Mirror, Collymore is complimentary about Benitez’s record as a coach - but questions whether his hands-on approach to management is compatible with modern-day football. \nInstead, he urges Benitez to stop “picking fights” with Ashley and focus on managing his squad. \n“Rafa Benitez is a control freak - he has been since he was at Liverpool,” the 46-year-old writes in his column in The Mirror . \n“He didn’t like any meddling at Anfield, he didn’t want any ­interference in the academy, he wanted control over every aspect of the club and its direction, and that’s still the case now he’s at Newcastle. Read More Rafa Benitez (left) and Stan Collymore \n“He’s a benign dictator – and I actually really like that in a manager. \n“But I’m starting to worry that if he keeps picking fights with owners and chief execs at the rate he does then he may well start talking himself out of every club he goes to.” \nStrangely, Collymore suggests that he may have deduced the root of Benitez’s mistrust of football-club owners. Read More How the 'Brexit effect' on sterling means Florian Lejeune will cost £1.2m more than a year ago \nIn Collymore’s opinion, Benitez’s lack of a successful playing career of his own may have led to an “inferiority complex”. \n“ Benitez seems to resent these kind of people [owners and directors of football] on the basis that they interfere in the industry he knows very well,” Collymore continues. \n“He may have a point – in most cases he probably does know ­better. His record tells you that. (Photo: Getty Images Europe) \n“But I do wonder if his feelings towards them stem in part from the fact he didn’t have a great playing career, that maybe he has some sort of mistrust of football people. \n“Maybe there’s an inferiority complex at work. Maybe he feels that having ­football people in important roles undermines him. \n“It seems as if Rafa wants to be the head honcho over everybody and that he tests club owners to the point when they think: ‘You know what, it’s too much hassle.’” \nYet, despite all this, Collymore still believes Benitez can be very successful at Newcastle - as long as he becomes more pragmatic. Read More Rafa Benitez's future - what next for Newcastle United manager? Our writers have their say \nEven Sir Alex Ferguson wouldn’t be afforded the far-reaching remit he enjoyed at Manchester United for nearly three decades if he were appointed today, says Collymore, so Benitez should not expect such luxuries either. \n“He might need to be a little bit more pragmatic because there’s no reason why he can’t have his cake and eat it at Newcastle,” Collymore states. \n“He can have his football ­narrative running all the way through the club from the seniors to the juniors. \n“And he has enough clout at Newcastle after creating such a feel-good factor on Tyneside to have a major influence on who the key people at the club should be. Read More Newcastle United 'make enquiry' for Manchester City goalkeeper Joe Hart, according to reports \n“But he needs to start thinking about team-building in his own image, putting in people he can trust to do the other jobs so he can focus on the first team rather than saying: ‘I want ­complete control over everything.’ That’s not how things work these days. \n“Even if Sir Alex Ferguson was getting the Newcastle job now, or the Manchester United job having done great things at Aberdeen, he would still have to accept there’s a chief exec and director of ­football. It’s the same for Benitez. \n“He has to evolve and the question is: ‘Can he do it?’ He can, but only if he is willing.” Read More ", "external_links": [], "published": "2017-07-02T14:01:00.000+03:00", "crawled": "2017-07-02T15:55:46.001+03:00", "highlightTitle": ""}