{"organizations": [], "uuid": "a3df48df958c0af19e8713b6288b1f9d316ec1e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13298412.ece/ALTERNATES/s1200/040717J2CJPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-britain-eu-european-union-13298138", "country": "GB", "domain_rank": 21960, "title": "How can the North East make a success of Brexit? Debate held to discuss region's future", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-09T10:00:00.000+03:00", "replies_count": 0, "uuid": "a3df48df958c0af19e8713b6288b1f9d316ec1e7"}, "author": "Chris Knight", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-britain-eu-european-union-13298138", "ord_in_thread": 0, "title": "How can the North East make a success of Brexit? Debate held to discuss region's future", "locations": [], "entities": {"persons": [{"name": "iain malcolm", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "mark easton", "sentiment": "none"}, {"name": "martin swales", "sentiment": "none"}, {"name": "henry kippin", "sentiment": "none"}, {"name": "john mccabe", "sentiment": "none"}, {"name": "jude", "sentiment": "none"}, {"name": "philip aldridge", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "steve fothergill", "sentiment": "none"}, {"name": "alan donnelly", "sentiment": "none"}, {"name": "stuart reid", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}, {"name": "caroline theobald", "sentiment": "none"}, {"name": "beth farhat", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south shields town hall", "sentiment": "none"}], "organizations": [{"name": "industrial communities alliance", "sentiment": "none"}, {"name": "face ltd", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "cbe", "sentiment": "none"}, {"name": "trades union congress", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sunderland council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "people select committee", "sentiment": "none"}, {"name": "north east of england chamber of commerce", "sentiment": "none"}, {"name": "bbc home", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How can the North East make a success of Brexit? Debate held to discuss region's future BREXploration saw the region's leading academics, businesses and politicians discuss the challenges and consequences of Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nWhat does the North East need to do to enjoy a successful Brexit ? \nThat was the question discussed by the region’s leading academics, businesses and politicians at a high-profile event mapping out the region’s next steps. \nStaged by South Tyneside Council , BREXploration saw key stakeholders discuss the challenges and consequences of Brexit. \nAbout 65 attendees and speakers joined the session at South Shields Town Hall on Friday to begin charting a course for a future outside the European Union. \nThe discussion was intended to help start defining priorities for the North East and ensure the region’s voice is heard during upcoming negotiations. \nFeedback from discussions will be captured in a report to be presented to key government departments and ministerial teams in the autumn. Councillor Iain Malcolm, leader of South Tyneside Council (Image: South Tyneside Council) \nCouncillor Iain Malcolm, leader of South Tyneside Council, said: “Now more than ever it is vital that our view, and those of our partners, help shape the Brexit negotiations. \n“Virtually every element of Brexit affects local government, our communities and businesses, from economic conditions, jobs and employment, to the people who make up our communities and workforces, and the environment in which we live and work. \n“If we are to deliver services effectively then we must have a say in the regulations which govern them and this is why we are driving this initiative.” \nHe added: “It is clear that we need to reflect what our communities wanted when many voted for Brexit. \n“It is up to local authorities to take leadership and help provide stability in an ever-changing world. \n“Others may be happy for London to dominate the Brexit‎ discussions, but we are taking the case for the North East, and what we want, to them. \n“By pulling together, our region can achieve economic and social improvements from Brexit but only if we tell Government what we want. This session and future sessions will help us to do that.” \nParticipants at the event, which evolved out of a scrutiny exercise for the council’s People Select Committee, ranged from MPs and representatives from the voluntary and community sectors, to academics and healthcare professionals - some of whom contributed evidence from their field. \nThe discussion focused on Workforce and Skills, Community Collaboration and Increasing Prosperity. (Left to right) Chief executive of South Tyneside Council Martin Swales, Dr Henry Kippin, Councillor John McCabe, Professor Steve Fothergill, Mark Easton, Jude Kirton-Darling MEP, Caroline Theobald CBE, Alan Donnelly (Image: South Tyneside Council) \nExpert chairs Alan Donnelly, Caroline Theobald, of FIRST Face to Face Ltd, and Dr Henry Kippin, of think-tank Collaborate, led intensive round-table discussions based on themes from the North East’s Strategic Economic Plan. \nThe Increasing Prosperity discussion, chaired by Alan Donnelly, looked at considerations such as the region’s needs in terms of trade and international direct investment. \nLed by Caroline Theobald CBE, the Workforce and Skills roundtable examined current and anticipated shortages in skills across different sectors, considering options for immigration and training solutions. \nThe Community Collaboration discussion, guided by Dr Henry Kippin, gave consideration to community strengths and needs, and what successful devolved services could look like. Read More UK must agree basic Brexit deal 'later this year' or face running out of time \nProfessor Steve Fothergill of the Industrial Communities Alliance also used the opportunity to share proposals for post-Brexit replacement of regional structural funding. (Left to right) Stuart Reid with South Tyneside Council , Philip Aldridge with North East of England Process Industry Cluster, Beth Farhat with Trades Union Congress, and Jonathan Walker with North East of England Chamber of Commerce (Image: South Tyneside Council) \nThe event concluded with a plenary session to summarise key points raised and feedback, which will form the basis of the report. \nAlan Donnelly said: “I applaud the leadership that South Tyneside Council has shown in organising the BREXploration event. \n“These are important issues and allowing interested parties in the North East to come together and find common ground is a critical starting point for us to move forward and ensure the region’s voice is heard. \n“There are two critical policy issues that pose existential threats to our region, the first is the future funding for the region, which has benefited greatly from EU Structural funds. \n“Without certainty over a replacement for these funds or the clarity in how we are going to continue supporting and growing our economy, we risk falling off a cliff edge. Read More MP Catherine McKinnell defies Jeremy Corbyn to back 'soft' Brexit and Single Market membership \n“That will seriously disadvantage the region, at a time when our economy needs to be strong and resilient to prosper globally. \n“The second issue is the consequence of our manufacturing sector no longer benefiting from the Customs Union. The North East has a trade surplus with the EU. \n“It is essential for us and for many of the other regions and nations in the UK that we remain part of the Customs Union. \n“We need a coalition of interests in the North East and BREXploration has established a firm base for doing this. \n“People who can come together, cross sectoral and across party political lines to agree what our region wants from the Brexit process and to ensure the North East’s voice is heard in the Brexit negotiations.” BBC Home Editor and chair of the event Mark Easton and Caroline Theobald CBE (Image: South Tyneside Council) WHAT THEY SAID… \n“There’s the national picture- which of course is really important - but we also need to have some clarity here in the North East on what’s important, what we can offer and what we need.” \nPaul Watson, chair of the North East Combined Authority and leader of Sunderland Council \n“Brexit is the reality and we need to reflect the needs of our diverse communities in getting the best deal for the North East. We wanted to talk to representatives from across our region to help us get ready and deliver for communities.” Read More 50,000 EU nationals in the North East may have to apply for 'settled status' \nCouncillor John McCabe, chair of South Tyneside Council’s People Select Committee \n“It is critically important that communities prepare for Britain post-Brexit, able to seize the opportunities and rise to the challenges. I applaud the ambitions of the Brexploration event in bringing key stakeholders together to produce a practical road-map for the North-East, ensuring the voice of this proud region is heard loud and clear in London, Brussels and beyond.” \nMark Easton, BBC Home Editor and chair of the event \n“We can’t afford to wait and let this process be done to us; we have to be involved. If we have well-argued, concrete suggestions, they will be listened to.” \nProfessor Steve Fothergill ", "external_links": [], "published": "2017-07-09T10:00:00.000+03:00", "crawled": "2017-07-09T10:21:56.000+03:00", "highlightTitle": ""}