{"organizations": [], "uuid": "61f3bf0ff9aeddd134765fadc6c3be88f41a1a99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13329942.ece/ALTERNATES/s1200/JS125219955.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13324544", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: RBS shares sale 'value for money' despite £1.9bn loss", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-14T09:55:00.000+03:00", "replies_count": 0, "uuid": "61f3bf0ff9aeddd134765fadc6c3be88f41a1a99"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13324544", "ord_in_thread": 0, "title": "Business Breakfast LIVE: RBS shares sale 'value for money' despite £1.9bn loss", "locations": [], "entities": {"persons": [{"name": "jonathon manning ee", "sentiment": "none"}, {"name": "nick ansell/pa wire", "sentiment": "none"}, {"name": "amyas morse", "sentiment": "none"}, {"name": "marc allera", "sentiment": "none"}, {"name": "allera", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "rbs", "sentiment": "negative"}, {"name": "national audit office", "sentiment": "none"}, {"name": "treasury select committee", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "uk financial investments", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "williams & glyn", "sentiment": "none"}, {"name": "hm treasury", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "nao", "sentiment": "none"}, {"name": "department of justice", "sentiment": "none"}, {"name": "ukfi", "sentiment": "none"}, {"name": "royal bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Up to 70,000 jobs in capital's financial services sector at risk, report warns \nBrexit could be “catastrophic” for London’s business, costing as many as 70,000 jobs in the financial services sector alone, a new report has warned. \nThe city also risks the loss of the “creative edge, liveability and variety” resulting from its status as a magnet for workers, students and visitors from around Europe and the world, warned the report by the Centre for London think tank. \nThe group called for Mayor Sadiq Khan to be given a “prominent” input into Brexit negotiations, as part of a Convention of City Leaders including mayors of major cities like Manchester, Glasgow, Bristol and Newcastle which stand to lose out from EU withdrawal. \nAmong measures to limit the damage to cities from Brexit, the Government should introduce a regional migration system, with different work permit quotas according to areas’ particular skills needs, the report said. \nIn London’s case, this should include a one-year City Maker Visa to allow EU citizens to live for a year in the capital while looking for work or start-up opportunities and an extended two-year working holiday visa for young Europeans, with fast-track work permit applications for both groups. \nThe report, entitled Open City, said the blow to financial services from Brexit would be “significant but not mortal”. And it said that London was in some ways less exposed than other parts of the UK to the risks of Brexit, because it already had well-developed links with other world cities outside the EU. But it warned: \nFrom other perspectives, London is far more exposed: our universities, hotels, restaurants, offices and building sites are powered by students and workers from across the EU to a far greater extent than the rest of the country. \nAnd our global city service sectors need urgent clarity on how access to the Single Market will be regulated. \nFalling out of the Single Market without a comprehensive trade deal or adequate transitional arrangements would be catastrophic for many London businesses, as would the sudden loss of EU workers. \nAnd the capital is also threatened by the potential harm Brexit will inflict on its ability to attract the young students, musicians, artists and entrepreneurs from around the world who will go on to be the decision-makers and superstars of the future and act as “lifelong ambassadors for London”. \nThe report said: \nThe longer-term risk is more subtle but no less serious - the erosion of the creative edge, liveability and variety that distinguishes London from so many other cities that can offer well-equipped offices and international airports. \nLondon needs to remain open and also needs to become more affordable and liveable. \nIt needs to continue to attract students from across the world, and to speak out against attempts to hit arbitrary immigration targets by cutting their numbers. \nThe report raised the possibility that last year’s vote for Brexit was in part driven by resentment outside the capital of London’s dominant position in the UK. It warned: \nIt may be that resentment of London was a factor in the EU referendum, but neither capital nor country can afford for London to decline economically or to retreat from international engagement. The London skyline KEY EVENT Subterranean cinema plans emerge for Newcastle's Grey Street \nA subterranean boutique cinema could soon be coming to Newcastle’s Grey Street amid proposals by Everyman Cinema. \nEveryman is already heading to the North East to open a three-screen venue at the new Milburngate development in Durham. \nNow it has emerged that the rapidly growing leisure outfit is planning to open a similarly plush two-screen cinema in Earl Grey House. \nA licensing application submitted to Newcastle City Council by Keystone Law on behalf of Everyman Media Ltd shows how the company wants to create a site in the basement of Earl Grey House at which it would have two 60-seater screens, with its entrance tucked beside Costa Coffee on Grey Street. \nThe firm is applying to be open to the public from 8am to 1.30am, seven days a week, and it also wants to be able to serve alcohol between 8am and 1am. \nThe application provides background on Everyman, which it says “tries to create a truly unique and memorable cinema experience that exceeds expectations and reaches the highest standards possible in quality, comfort and entertainment.” \nThe London-based Everyman chain currently has 20 venues around the UK, having opened four new cinemas in the last year, and has previously told how it plans to expand further across the country. \nIn March the group agreed a £20m facility from Barclays to help fund further expansion of its estate. \nThe company is known for its small but luxurious venues, all of which have licenced bars so that people can enjoy food and drink while watching their films. Earl Grey House in Newcastle (Image: GVA Bilfinger) 8:48 Jonathon Manning European recruitment boosts profits at Hays despite 'challenging' London trading \nProfits at recruitment firm Hays are set to come in ahead of market expectations, despite the company grappling with a slowdown in its UK and Ireland business as London trading remains “challenging”. \nThe firm hailed a record net fee performance for the quarter to June 30, helped by its European operation. Total like-for-like sales grew 7% in the period, with continental European and Hays’ global arm seeing an 11% rise, but the UK and Ireland fell 5%. \nThe firm flagged earlier this year that the UK business had suffered a Brexit hit, as British companies applied the brakes to their hiring plans following the EU referendum vote. But the drag was not enough to dampen the outlook for full-year operating profit, which is expected to be “marginally ahead” of consensus market expectations of £209.5m. \nChief executive Alistair Cox said: \nWe have ended our financial year with a record quarterly net fee performance. \nEurope delivered strong results, led by an excellent performance in Germany, where we have increased consultant headcount by over 20% during the year. \nHe added that the underlying trends in the UK remain “sequentially stable”, with modest improvements in the private sector offset by a tough public sector market. \nIn the UK and Ireland, which make up 25% of the group, fees in London tumbled 9% and Hays’ accountancy and finance division was down 4%. Overall net fees rose 15% and continental Europe and global grew 24%. Recruitment firm Hays has said London trading remains challenging 8:41 Ramsdens Holdings suffers cyber attack breach \nNorth East pawnbrokers Ramsdens Holdings has revealed it has been subject to a cyber attack. \nThe jewellers, which listed on the stock exchange earlier this year, said it had suffered from “unauthorised access to its IT systems” and had informed regulating authorities. \nIn a statement to the London Stock Exchange, the firm said: \nBased on its current assessment, the Company anticipates minimal disruption to its business and trading performance and a small financial cost due to additional IT software and procedures. As a precaution, Ramsdens is in the process of notifying potential impacted stakeholders and will provide appropriate advice and support. \nRamsdens is now working with third party experts to tighten its security. \nA spokesman for the firm said there was no “evidence that any data had been extracted” from its IT systems. He added that in the unlikely event that customer data was affected no bank account or card details had been compromised. Ramsdens chief executive Peter Kenyon (Image: Publicity Pic) 08:30 Jonathon Manning Exercise classes that could help battle post-natal depression launched in Tyneside \nA North East business that runs yoga classes for babies has launched a new programme that could help mothers who suffer from post-natal depression . \nKalma Mamas offers relaxation classes for pregnant women that help to help combat ailments that affect mothers during pregnancy. \nThe classes incorporate stretching and breathing exercises and are run by Eve Gray, whose 17-year career has seen her work as a nurse, midwife, and now as a health visitor. \nClasses are designed for pre and post-natal mothers. As well as relieving physical ailments, the exercises also help improve sleep patterns, and could help with post-natal depression. \nCommenting on the classes, Ms Gray said: \nIn classes we focus on visualisation, mindfulness, gentle stretches and breathing techniques that can be used in pregnancy to help lower heart rates and anxiety levels, reducing low mood in pregnancy and the postnatal period. \nWe also focus on the connection and bonding process of mothers with their unborn babies. these methods can be used in labour and delivery either through breathing techniques through contractions or methods to relax. \nIf a pregnant lady knows they are going to have a planned cesarean section these methods of relaxation can support throughout any mode of delivery. \nWe try to provide a calm relaxation group while looking at the health benefits during pregnancy, so new mums to be can socialise with others and share thoughts and feelings about what they are actually going through with their real life pregnancy. Kalma Mamas Jonathon Manning Carillion asks HSBC to review business after share price collapse \nTroubled construction and infrastructure giant Carillion has drafted in HSBC to help carry out a review of the business as it continues to reel from a dramatic collapse in its share price. \nHSBC has been appointed joint financial adviser and corporate broker with immediate effect, Carillion said on Friday. \nThe bank will help the firm with a “comprehensive review”, which was announced earlier this week alongside a profit warning that saw almost £600m wiped from its value. \nShares were up over 8% on the news at 58p, but still a far cry from the 191p they were trading at last week following days of stock market losses. Carillion’s market capitalisation has gone into freefall, falling from £826m to around £240m in a matter of days after it warned over earnings and revealed an £845m write-off on construction contracts. \nChief executive Richard Howson stepped down with immediate effect on Monday as the group said it would need to bolster its balance sheet and was struggling to stay within its borrowing limits. \nHe has been replaced by Keith Cochrane on an interim basis while a search is undertaken for a permanent boss. Analysts at UBS warned on Tuesday that shares could even plummet to zero if Carillion’s support services trading is hit, while other experts raised worries the group may not have the funds to restructure. Carillion 8:20 KEY EVENT Flights between UK and EU will be cancelled unless a Brexit deal is sealed, Ryanair boss warns \nRyanair boss Michael O’Leary has said there will be no flights between the UK and the European Union for months after Brexit if no deal is struck before Britain leaves the EU. \nMr O’Leary has told the European Parliament that airports will be deserted, holidays cancelled and Ryanair aircraft will be moved to Europe, unless replacements for EU airline agreements are struck. \nThe Open Skies agreement allows EU airlines, including those registered in the UK, to operate in each other’s countries. \nUnlike other sectors, the aviation sector can’t fall back on World Trade Organisation rules, which makes a new deal vital, he said. \nMr O’Leary warned the European Parliament’s Transport and Tourism Committee in Brussels that such a deal was “an impossibility” and that the “only sensible option” was for the British government to remain in the EU. \nHe said: \n“There is a real prospect, and we need to deal with this, that there are going to be no flights between the UK and Europe for a period of weeks, months beyond March 2019. \n“There is not going to be an interim agreement, there is not going to be a legal basis, we will be cancelling flights, we will be cancelling people’s holidays for summer of 2019.” \nRyanair flies to a number of European destinations from Newcastle , including Madrid, Barcelona, Warsaw and Dublin. Ryanair boss Michael O'Leary", "external_links": [], "published": "2017-07-14T09:55:00.000+03:00", "crawled": "2017-07-14T10:33:26.001+03:00", "highlightTitle": ""}