{"organizations": [], "uuid": "0b1a6479ccd360a593ec300544fef7ae95c1a11e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13357018.ece/ALTERNATES/s1200/Glaxo-Wellcome-Cephalosporins-Manufacturing-Building.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/pharma-firm-gsk-invest-millions-13356891", "country": "GB", "domain_rank": 21960, "title": "Pharma firm GSK to invest millions in North East but puts Ulverston factory in firing line", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-19T19:25:00.000+03:00", "replies_count": 0, "uuid": "0b1a6479ccd360a593ec300544fef7ae95c1a11e"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/pharma-firm-gsk-invest-millions-13356891", "ord_in_thread": 0, "title": "Pharma firm GSK to invest millions in North East but puts Ulverston factory in firing line", "locations": [], "entities": {"persons": [{"name": "woodcock", "sentiment": "none"}, {"name": "roger connor", "sentiment": "none"}, {"name": "philip thomson", "sentiment": "none"}, {"name": "barrow", "sentiment": "none"}, {"name": "furness john woodcock", "sentiment": "none"}], "locations": [{"name": "ulverston", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "barnard castle county durham", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "barnard castle", "sentiment": "none"}], "organizations": [{"name": "ulverston", "sentiment": "negative"}, {"name": "business pharma", "sentiment": "negative"}, {"name": "gsk", "sentiment": "negative"}, {"name": "horlicks brand", "sentiment": "none"}, {"name": "glaxo wellcome plc cephalosporins manufacturing building", "sentiment": "none"}, {"name": "gsk global manufacturing", "sentiment": "none"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "barnard castle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Pharma firm GSK to invest millions in North East but puts Ulverston factory in firing line The pharmaceutical giant is also selling its Horlicks brand, which will lead to the closure of its Slough facility Share Glaxo Wellcome PLC Cephalosporins Manufacturing Building, their secondary manufacturing site in Barnard Castle County Durham (Image: Publicity Picture) Share Get business   Thank you for subscribing!   \nGlaxoSmithKline’s (GSK) factory in Barnard Castle is set to receive a share of a £140m investment at the same time that the future of its Cumbria plant is put at risk. \nIn a series of announcements made today , the pharmaceutical giant revealed it will sell-off its famous Horlicks Brand, close its Slough plant, slash 320 jobs, and backtrack on plans to invest £350 in a biopharm facility in Ulverston, Cumbria. \nBut at the same time the firm said it was investing £140m across three of its manufacturing sites, including £39m at its Barnard Castle facility. \nThe County Durham site manufactures HIV and respiratory drugs, which are two major focus areas for the pharma firm. The £39m will be spent on new technology and equipment used to manufacture these drugs. \nAround £20m will be spent to install a new assembly and packing line for an asthma drug, while £14m will support the manufacture of a new HIV medicine. A further £5m will go towards facilities relating to a drug used to treat lupus. \nNo new jobs are expected to be created as a result of the investment. GlaxoSmithKline logo (Image: PA) \nAt the same time, however, the future of GSK’s Ulverston facility has been put at risk, as the firm carries out a strategic review of its antibiotics business. \nRoger Connor, president of GSK Global Manufacturing and Supply, said: “We have a substantial manufacturing presence in the UK and continue to support the network with new investment of more than £140m in the next three years. \n“At the same time, we have had to make some decisions which we know will cause uncertainty for some of our employees. We will do all we can to support them through this process.” \nGSK employs 350 people at the Ulverston facility, which focuses on cephalosporins antibiotics. It is hoped that job losses will be kept to a minimum as GSK searches the market for a buyer. Read More GSK invests £92m in County Durham site as UK remains 'attractive' despite Brexit vote \nA number of staff at Barnard Castle also work in the antibiotics division. The team, which GSK described as considerably smaller than the Ulverston team, will be carved out of the plant in the event of a sale. \nConcern had previously been raised over the future of a number of GSK sites, following the Brexit vote. The pharma firm responded by announcing a £275m investment spend in its UK facilities, including £92m going towards Barnard Castle. \nIn previous years the firm had also said it planned to spend £350m on a biopharm plant in Ulverston, the first new facility to have been built by GSK in the UK in 30 years. The plans have now been scrapped. \nAs recently as December, GSK’s senior management assured local MP for Barrow and Furness John Woodcock that it was still “fully committed” to the Cumbria investment. \nReacting to the announcement on Twitter, Mr Woodcock said: “Company is clear its decision is not related to Brexit. But decision to cancel shows GSK made a monumental misjudgement of biopharm market.” \nThe MP has called an emergency town meeting to discuss the plans. \nGSK employs 17,000 people across the UK, with 5,000 of those in manufacturing roles. Today’s proposals are expected to see 320 permanent jobs cut over the next four years. Read More New GlaxoSmithKline chief executive to be most powerful woman in big business \nPhilip Thomson, president of global affairs at GSK, said: “We are continuing to invest in science and our core businesses in the UK and we continue to see the UK as an attractive place for the life sciences industry. \n“We are working constructively with the Government and others to develop an ambitious plan for the sector as part of the UK’s new industrial strategy.” Like us on Facebook", "external_links": [], "published": "2017-07-19T19:25:00.000+03:00", "crawled": "2017-07-19T19:55:38.001+03:00", "highlightTitle": ""}