{"organizations": [], "uuid": "3bcd1991ddb1549539223cf13d64bcad28e8d4c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13277385.ece/ALTERNATES/s1200/JS31117003.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13277388", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Subway to serve up 5,000 jobs in major UK expansion", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-04T10:00:00.000+03:00", "replies_count": 0, "uuid": "3bcd1991ddb1549539223cf13d64bcad28e8d4c6"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13277388", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Subway to serve up 5,000 jobs in major UK expansion", "locations": [], "entities": {"persons": [{"name": "anthony devlin/pa wire", "sentiment": "none"}, {"name": "dowding", "sentiment": "none"}, {"name": "peter macnab", "sentiment": "none"}, {"name": "peter dowding", "sentiment": "none"}, {"name": "kardashian", "sentiment": "none"}, {"name": "li ka-shing", "sentiment": "none"}, {"name": "kim kardashian", "sentiment": "none"}, {"name": "mike coupe", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "coreena ford superdrug", "sentiment": "negative"}, {"name": "kardashians  superdrug", "sentiment": "neutral"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "superdrug", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "as watson", "sentiment": "none"}, {"name": "coreena ford sainsbury", "sentiment": "none"}, {"name": "subway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford New firm in Newcastle hopes to revolutionise homebuying process \nThe process of buying a house could be revolutionised as a part of plans by a North East firm to simplify the process. \nToomey Legal hopes to simplify homebuying by offering packages which can include legal advice, removal services and insurance to cover conveyancing costs. \nThe law firm was founded by managing partner and managing director Sue Shaw-Toomey. It is based in Corbridge , Northumberland , but also works out of Natwest’s E-Spark hub on Newcastle Quayside. \nMs Shaw-Toomey specialises in commercial properties as well as residential homes. She believes the new system could revolutionise the way people buy their home. (L-R) Toomey Legal graduate trainee Jennifer Wilkes, and managing director Sue Shaw-Toomey (Photo: Unknown) 8.55 Coreena Ford New pasta bar to open at 55 Degrees North in Newcastle \nA new Italian eatery is opening at a prime city centre location in Newcastle, creating six new jobs. \nZucchini Pasta Bar has agreed to a 10-year lease on a 1,900sqft ground floor unit at 55 Degrees North. The unit, which was formerly occupied by City Retreat, is next door to Asian fusion restaurant Fat Buddha and occupies a prominent corner position on the former Swan House roundabout. \nThe restaurant will serve fresh hand-rolled pasta, using a combination of Italian imported produce and locally sourced ingredients with traditional practises. Alan Barker of Zucchini Pasta Bar with James Fletcher of Naylors at the new restaurant in 55 Degrees North (Photo: Copyright unknown) 8.50 Coreena Ford Terry Laybourne unveils new restaurant for Fenwick Food Hall - but what does it replace? \nLeading North East chef and restaurateur Terry Laybourne is expanding his 21 Hospitality Group with the opening of a unique butcher and steak bar in Newcastle. \nThe new venture – to be called Porterhouse Butcher and Grill – is part of Fenwick’s latest development in the Newcastle store’s Food Hall. \nWork will starts soon on the new retail and restaurant spot within the food hall, with an opening slated for August, but its creation will replace existing Pan Asian diner Ko Sai and the Blagdon Farm Shop butcher’s counter. \nAll staff members of Ko Sai will remain within the 21 Hospitality Group, it is understood, and Porterhouse Butcher and Grill will employ up to nine kitchen and front-of-house staff when it opens next month. \nMr Laybourne said: “This new venue has been driven by the positive response we’ve had to the Saltwater Fish Company, which operates as a fish bar and fishmonger within Fenwick. We offer a premium product, treated with respect and cooked in front of customers who really engage with the process.” \nPorterhouse Butcher and Grill will offer casual dining at the counter, along with seated restaurant space. There will be counter seating for around 14 people, table seating for 30, an open kitchen, creative chefs and service staff. A CGI of Porterhouse Butcher and Grill, the newest Terry Laybourne eaterie coming to Fenwick Food Hall in Newcastle (Photo: Fenwick) 8.45 Coreena Ford Ministers face fresh calls to spell out post-Brexit trade arrangements \nMinisters are facing fresh calls from business to spell out what trade arrangements will be in place when Britain leaves the EU in 2019. \nTerry Scuoler, the chief executive of the EEF manufacturers’ organisation, said they were approaching a “tipping point” with many firms facing key investment decisions. \nHe said it was essential they knew what the transitional arrangements would be after Brexit well in advance of March 2019 - when the UK finally leaves the EU - if they were to be able to plan in confidence. \nMr Scuoler, who is meeting the president of the European Parliament, Antonio Tajani, in Strasbourg, warned failure to clarify the position would be damaging to “our collective economic interests”. \n“UK businesses need to know soon what arrangements will be in place after March 2019, to be able to plan, make investment decisions and have confidence that an orderly and carefully managed approach to Brexit is under way,” he said. \n“If they don’t have that assurance there will come a tipping point, sometime in 2018, when boards in the UK and elsewhere will need to make decisions based on the state of the negotiations at that point. \n“They cannot wait until the end of the process for confirmation of a deal on our departure or future trading relationship. \n“They need to know much sooner what transitional arrangements will be in place, and for how long. A failure to do so will damage our collective economic interests, a situation which would be as tragic as it would be harmful.” Terry Scuoler (Photo: EEF) Coreena Ford Argos' fast track delivery serves up boost for Sainsbury's \nWe have more detail on the Sainsbury’s results, which show how it had another robust performance within online sales, up 8% for groceries and 10% for Argos. \nFast track delivery and click and collect continued to prove popular with Argos customers, particularly in the heatwave, when it saw same-day demand for paddling pools and fans soar. \nThe group said despite slowing overall general merchandise sales growth, it outperformed the wider market. \nIt added there was disruption from the closure of 78 Argos concessions in Homebase and 84 Habitat in Homebase concessions over the past year. \nThe group opened 36 Argos Digital stores within its supermarkets in its first quarter, bringing the total to 75. \nThe food sales rebound comes as a welcome boost to Sainsbury’s, which warned in May over pressures from falling consumer confidence as inflation starts to bite. The group revealed bottom line profits dropped 8.2% to £503m for the year to March 11, while underlying profits fell 1% to £581m. \nIt has been offsetting this thanks to the addition of the Argos business, snapped up last year when it took over Home Retail Group for £1.4 billion. With the Argos acquisition under its belt, Sainsbury’s is continuing to look for brands to add to its shopping basket. \nIt is understood the group is now looking to buy Nisa , the network of more than 2,500 independently-owned convenience stores, in a deal worth close to £130 million, as part of a response to Tesco’s £3.7 billion merger with wholesaler Booker. Sainsbury's has been boosted by its acquisition of Argos 08:38 Petards announces £1.5m defence contracts \nTeam Valley security specialists Petards has announced new contract wins worth £1.5m. \nThe AIM-listed business, which develops advanced security systems used in defence, transport and emergency service sectors, has secured a £1m deal with the Ministry of Defence (MOD), for an Emulator that will enable its Petards ALE-47 Threat Adaptive Countermeasures Dispenser System (TACDS) to be used more effectively. \nThe ALE-47 is just one of its airborne systems used by the British Army, the Royal Air Force and the Royal Navy across a range of fast jet, helicopters and other large transport aircraft and the firm said the system boosts the survivability of aircraft and crew. \nThe project is set to start during the second half of 2017 with a completion date of mid 2018. \nThe company has also been awarded a contract by Leonardo MW (previously Agusta-Westland), a London engineering firm, for £500,000, for the continuing upgrade of the Merlin Mk.4 - the Royal Marines new helicopter - under its Merlin Life Sustainment Programme. \nThe contract is the third consecutive contact award to Petards for the supply of the ALE-47 TACDS Equipment and is scheduled for delivery during the first half of 2018. \nThe board said it is also pleased to announce that the MOD has exercised its option to extend by one year to September 2018 the group’s existing enabling contract to supply it with private mobile radio equipment, ancillaries and engineering services. \nThe contract, whose annual revenues are anticipated to be in excess of £500,000 uses Petards’ design engineering skills to identify and supply solutions to complex military communications requirements. The Petards factory in Team Valley (Photo: Google maps) 8.25 Coreena Ford Imagination Technologies posts profits as Apple dispute continues \nBritish chip maker Imagination Technologies, which put itself up for sale last month, has swung into profit and said it remains locked in talks with potential buyers. \nThe firm posted a £2.4 million pre-tax profit in the year to April 30, which compares to a £29.4 million loss in 2016. \nGroup revenue was up 19% to £145.2 million and Imagination revealed it is in “preliminary discussions” with potential bidders. \nShares in Imagination plummeted more than 60% in April after it revealed Apple will no longer use its products, meaning it will no longer be eligible for royalty payments. \nApple’s royalty payments and licence fees brought in £60.7 million in revenues in the year to April 30, accounting for half of Imagination’s total sales. \nThe Hertfordshire-based group responded by launching a formal dispute against the US tech giant. \nBoss Andrew Heath said: “We improved our financial performance across the business. \n“We returned the business to profitability and saw good cash generation despite the outflow from the now discontinued businesses. \n“However, Apple’s unsubstantiated assertions and the resultant dispute have forced us to change our course, despite the clear progress we have been making.” \nIt is concerned Apple’s plans to replace Imagination’s intellectual property - used in the graphics processor units for phones, tablets, iPods and TVs - with its own technology risks violating the company’s patents. \n“Dispute with Apple continues - no progress made. Options being reviewed,” the company said. Separately, Imagination put its MIPS and Ensigma operations up for sale in May, with the firm saying the process is progressing well and indicative proposals have been received for both businesses. 8.20 KEY EVENT North East IT companies challenged to get in 'real world' - and embrace older people \nThe North East’s burgeoning IT sector has been challenged to be more in tune with the ‘real world’ around them - including doing more to include older people. \nThe challenge to the region’s digital companies came from innovation expert Prof James Woudhuysen, who was speaking at the annual Dynamo conference in Durham. \nMore than 350 delegates from around the region attended the event, held by the body set up to grow the region’s IT and digital economy. \nProf Woudhuysen, a visiting professor at London South Bank University, listed 16 areas he believed the region’s tech sector should explore in order to grow, including mass-manufactured buildings; shale gas and oil; subsea technologies; service robots for old people; electric cars and robot commercial vehicles; quantum technologies and virtual reality technology. \nBut he also said the region’s technology companies “need to know the world around you – understand what is really happening - in order to identify the opportunities for the sector.” Keynote speaker Prof James Woudhuysen at the Dynamo conference in Durham (Photo: Copyright unknown) 8.15 Coreena Ford Superdrug profits are keeping up with the Kardashians \nSuperdrug has delivered a strong rise in full-year profits after sales were helped by a face powder championed by Kim Kardashian. \nPre-tax profits at the retailer rose 41% to £80.4 million in the 53 weeks to December 31 2016, with sales up 10.4% to £1.2 billion. \nLike-for-like sales rose 7.8% and customers “continued to be influenced by celebrities”, the firm said, with the best-selling product last year a banana face powder fronted by Kardashian. \nSuperdrug, whose parent firm AS Watson is owned by Hong Kong billionaire Li Ka-Shing, said cosmetics sales rocketed 14%, helping it achieve a market share of 30% for the first time. The group’s online offering, Superdrug.com, also performed strongly with sales increasing by over 60%. Chief executive Peter Macnab said: “We have had a strong year and are pleased with the company’s performance. “Looking to the future our strategy remains to offer customers everyday accessible health and beauty, giving them the beauty and health services they need.” \nThe firm opened 23 new stores last year and the chain pumped £33 million into store revamps. Superdrug has 789 stores in UK and Ireland where it employs 13,500 people. Superdrug profits are up thanks to a face powder championed by Kim Kardashian 8.10 What's the FTSE latest? \nThe FTSE-100 index opened at 7377.09. \nThe pound at 8am was 1.2956 dollars compared to 1.2950 dollars at the previous close. The euro at 8am was 0.8772 pounds compared to 0.8776 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) 8.07 Coreena Ford Sainsbury's sales boosted by clothing demand \nSainsbury’s has notched up a sales recovery as rising food price inflation and strong demand for clothing offset a weaker performance from its Argos business. The supermarket giant said inflation, together with this year’s later Mother’s Day and Easter, helped drive like-for-like first quarter sales including Argos up by 2.3% in a marked bounce back on the 0.3% seen in the previous three months. \nSainsbury’s said demand for deals on British strawberries and summer fare provided a boost to grocery sales, which jumped 3% higher, while it also saw 1.9% growth in the number of transactions at its tills. \nClothing sales increased by 7.2% in the 16 weeks to July 1, although general merchandise sales growth including Argos slowed to 1% from 1.5% in the previous quarter. \nMike Coupe, chief executive of Sainsbury’s, cheered a “strong” first quarter. \nHe said the group had worked with suppliers in an effort to keep a lid on inflation, which has been sent soaring as the Brexit-hit pound has impacted the price of imported goods. \nHe added: “The market is competitive and we continue to manage cost price pressures closely.” A Sainsbury's store (Photo: Anthony Devlin/PA Wire) 8.00 KEY EVENT Subway to create 5,000 jobs in hundreds of new UK and Ireland stores \nSubway plans to serve up 5,000 new jobs by 2020 in a major expansion across the UK and Ireland. \nThe fast food chain said it will roll out another 500 stores within the next three years, bolstering its footprint to 3,000 restaurants. \nSubway, which was founded in Connecticut, US, in 1965, has grown to 44,000 stores in 112 countries thanks to the popularity of its sub sandwiches. \nPeter Dowding, country director for the UK and Ireland, said the move will strengthen the chain’s position within the UK market. \nHe said: \nThe growth expansion has been continual. What we have achieved over the last few years has been phenomenal for the brand and for our franchisees across the UK and Ireland. \nWe set some very ambitious targets in 2012, where we said we would get 3,000 stores by 2020 and we are well on our way to achieving that. \nIn fact, we will be opening our 2,500th store, which is a fantastic achievement for the brand in the UK. It strengthens our position in the market as being the leading quick service chain in the UK. \nSubway’s UK and Ireland turnover reached £515m in 2016. \nThe firm plans to open 150 stores by the end of this year. Mr Dowding said Subway’s UK operation has been going through a “massive brand transformation”, with plans to kick-start a new online ordering platform in 12 months’ time. He said the business was also tackling the Brexit-induced rise in inflation by working with its suppliers to “lock down prices for the next couple of years”. More Subway shops could be opening in the North East soon Share ", "external_links": [], "published": "2017-07-04T10:00:00.000+03:00", "crawled": "2017-07-04T10:23:29.054+03:00", "highlightTitle": ""}