{"organizations": [], "uuid": "884b1d52a84d3adbafa66482a5eb992a5945d59b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.plymouthherald.co.uk/images/localworld/ugc-images/276351/Article/images/30436894/16078111.jpg", "site_section": "http://www.topix.com/rss/wire/tech", "section_title": "", "url": "http://www.devonlive.com/this-is-why-robots-cyborgs-and-self-drive-cars-will-change-your-workplace/story-30436894-detail/story.html", "country": "US", "title": "Article Image", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-19T10:49:00.000+03:00", "replies_count": 0, "uuid": "884b1d52a84d3adbafa66482a5eb992a5945d59b"}, "author": "", "url": "http://www.devonlive.com/this-is-why-robots-cyborgs-and-self-drive-cars-will-change-your-workplace/story-30436894-detail/story.html", "ord_in_thread": 0, "title": "Article Image", "locations": [], "entities": {"persons": [{"name": "ju", "sentiment": "none"}, {"name": "martyn king", "sentiment": "none"}, {"name": "prof skilton", "sentiment": "none"}, {"name": "anthony painter", "sentiment": "none"}, {"name": "mark skilton", "sentiment": "none"}, {"name": "bill murphy", "sentiment": "none"}, {"name": "peter marsh", "sentiment": "none"}, {"name": "william telford", "sentiment": "none"}, {"name": "simon ashby", "sentiment": "none"}, {"name": "steve gerry", "sentiment": "none"}], "locations": [{"name": "tamar bridge", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "newquay", "sentiment": "none"}], "organizations": [{"name": "fuel communications", "sentiment": "none"}, {"name": "plymouth business school", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "social justice in anxious times", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "royal society for the encouragement of arts", "sentiment": "none"}, {"name": "warwick business school", "sentiment": "none"}, {"name": "commerce", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "pmg", "sentiment": "none"}, {"name": "city college plymouth", "sentiment": "none"}, {"name": "plymouth manufacturers' group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This is why robots, cyborgs and self-drive cars will change your workplace By WT_Herald | Posted: July 18, 2017 By WILLIAM TELFORD, Business Editor, @WTelfordHerald 0 COMMENTS SHARES Comments (0) \nIt sounds like the stuff of science fiction, but robots, cyborgs, self-driving vehicles, genetic engineering, and space exploration are all among the factors likely to impact on the work we do in the next 30 years. \nExperts from industry and academia say technology will change the jobs we have and the way we do them. \nRobots and artificial intelligence (AI) are among the technological advances already being seen in the workplace. \nThey pose a threat to people working in mundane and monotonous low paid employment – but also those in sectors such as law, accountancy and banking, plus fishing and farming. \nBut while technology will threaten, or even do away with, some jobs, others will be created. \nThere are likely to be new posts across the board in tech industries, from App development to space exploration and bio-engineering. \nAnd in sectors where the total number of jobs will decline, such as manufacturing, there will be new, high-pay, specialist roles created. \nMeanwhile, service-related jobs that can't be replicated by robots and automation will need more people than ever. \nThese are likely to include the care industry, construction and even financial advice. \nBut, one thing is certain: workers will need to be more highly skilled and flexible. \nThat will have implications for companies and education providers, who will need to work closely to ensure jobs are filled and existing staff are retrained and retained. \nIt could be that the government even needs to subsidise some courses in the sectors most hit by a skills shortage. \nHowever, alongside this bright shiny future, there could also be a continuing growth of low-paid, gig-economy work, with attendant implications for individuals, the economy and society. \nAnd, while some of these changes are happening now, experts are agreed that the main march of the robots, and other technological quantum leaps, are still some years off. \nDr Simon Ashby, associate professor of finance at Plymouth Business School, said it's already a challenging time for many sectors and this will be exacerbated. \n\"I can't see a massive renaissance in fishing and farming, for example,\" he said. \"There will be large farms, more mechanisation, but it's not going to be great for small farmers or fishermen. You will see some boutique stuff, like line caught fishing, but it's a declining industry that has been in decline for some years and I can't see how we are going to turn it around.\" \nOn the other hand, he said, tech-based industries and service sector jobs will grow. \n\"The UK is very much a post-industrial economy, based on services and we have an aging population, so social care becomes a major part of that,\" he said. \nREAD MORE: Bag your dream job in Plymouth \n\"We have small businesses, entrepreneurial, linked to the internet, using social medial, so possibly we will see that grow. \n\"But our economy is about more than that. We punch above our weight in terms of innovation, science, the internet and manufacturing. \n\"Then there is space exploration. The UK has a great history in building satellites and components. Newquay has been picked to be a space port. \n\"High-tech science will continue to grow and so will the IT and digital sector, Apps and things to make our lives easier, the internet of things, electric and autonomous vehicles, cars connected to the internet, routing themselves, even finding a space to park in. \n\"Heavy industry will continue to decline, but it will be more positive for alternative energy, solar and wind, that will be a continuing growth area.\" \nHowever, he warned of an \"increasingly split workforce\", with businesses willing to invest in the brightest and most talented. \n\"The future is bright for those with higher skills and education,\" he said. \"But it will be more difficult for people who have not got that. \n\"The gig economy will be more insecure. We are seeing wages being pushed down in these sectors and I think that is likely to continue. \n\"So it's a brighter picture for some, but not for others. \n\"That means it will be important for people to get good training, not just university but higher apprentices. \n\"Those people that are investing time and effort will have relatively secure jobs. \nREAD MORE: It's time to talk about suicide: Tamar Bridge deaths prompt calls for action \n\"Another problem is we don't have enough young people in this country,\" he added. \"We have an aging population. People will continue working longer, but they can only work so long. \n\"We have a lot of work to do and not a lot of young people to do that work. It's a problem we will have to look at. \n\"And businesses are increasingly mobile. If they can't get a work force here they will move to another country where they can get labour. That will be a key issue for Government. \n\"The idea of cutting net migration to the tens of thousands, there are not many economists that would say that wouldn't have a negative impact on the economy. \n\"And should we offer free university places for courses like health care, science and engineering?\" \nMark Skilton, professor of practice at Warwick Business School and an expert in business technology who has advised Government, is convinced automation will change the workplace and threaten workers in retail, banking and insurance jobs in the next decade, and impact low-skilled and management jobs too. \nBut, again, there will be winners and losers. \n\"The jobs that go will include banking and insurance admin jobs, for instance, but it will create portfolio services jobs, where they are offering other services. That is happening already, a blurring of the role of advisor,\" he said. \n\"So low end jobs in the service market will disappear but there will be more advisory jobs and more skilled jobs. \n\"Also, there will be more health sector jobs that are community based. \n\"And there is lot of demand for scientists to do automation and programming, the UK economy, particularly in places like London and Cambridge, is good at that. \n\"My own area is education, so online training, blending online to classroom time, will increase. In five to 10 years we will shift to a blended level, that's already happening. \n\"We will also see a lot of personal wearables and smart homes, and more lifestyle coaches. \n\"Farming is automated already, but it will be increasing yield and productivity. \n\"But when I asked a room of 60 millennials if they think they will lose their jobs to automation they said no. \n\"They think smart Apps, which will talk in different languages in real time, will assist with jobs and we will be smarter and more productive as a result. \n\"And while the legal profession's back office will disappear, replaced by algorithms and robots, you won't get them making ethical judgements. Machine knowledge is not that smart. Going into the dock and seeing a robot is a way off yet. \n\"What we call 'world knowledge' is still a long way off.\" \nHe said there will be more automation with robotics in surgery, but again, a few years away yet. \n\"In the next 30 years there will be complete automation of routine medical procedures. But that's still 20 to 30 years away,\" he said. \nAnd while Prof Skilton believes self-driving cars are on their way, he think's Ford's a target for 2025 is a tad early. \nBut he said: \"A lot of local travel with trains and lorries will be automated in the next 10 years. \nAnd large scale 3D printing is about 10 years away.\" \nBut he feels it is likely some human interaction with the robots will be needed in certain scenarios. \n\"A lot of jobs will be changed by the tools, it will be about being smarter more Apps helping with your job,\" he said. \"Robots do not have our experience to do it yet but it's a long term goal with cyborgs and androids.\" \n\"So don't pack your bags yet, a lot of true automation is 10 years away, and cerebral thinking is 20 years away at least, computers don't yet have that intelligence. \n\"There are questions around the future of data management and making decisions and ethics. So there will be new jobs in cyber security, nano- and bio-tech \n\"The new jobs in the fourth industrial revolution will be about nano technology and bio engineering, there are new skills being created.\" \nIn early 2017, City College Plymouth commissioned research into the shifting world of work. The resulting publication The Future of Careers in Plymouth contains details about which sectors are expanding and contracting. \nIt said the health sector will continue to grow, by 8.3 per cent, but that aside, the private sector will outstrip the public realm. \nEmployment in the education, public administration and the defence sectors is expected to fall. \nBut professional jobs will grow by 32 per cent, scientific and technical services will expand by 27 per cent, the construction industry will grow by 23 per cent, and information and communication will enlarge by 21 per cent. \nThere will also be growth in the creative industries (16 per cent) and accommodation and food (11 per cent). \nAutomation and robotics will cause a decline in employment numbers in manufacturing, the research said. \nThe Bank of England has warned that 15 million jobs in the UK are under threat by robotics, the study said, with an 80 per cent risk for accountants, auditors, technical writers, train and tram operators and power plant operators. \nAt medium risk are judges, magistrates, economists, computer programmers, commercial pilots and financial advisors. Lowest risk - less than one per cent - is in the healthcare sector. \nMartyn King, director of Fuel Communications, which has offices in London and Plymouth and was commissioned to carry out the research, said the employment picture provides short-, mid- and long-term hurdles for employers. \n\"There are three big challenges for employers,\" he said. \"Just saying 'we are hiring' does not cut it because employment levels are at the highest for a decade. \n\"So the short-term challenge is for organisations to persuade the right people to join them, not assume that because there are vacancies people will fill them. \n\"The mid-term issue is Brexit. From our research employers are worried that they will be left with positions they cannot fill. \n\"The longer term issues are recognising the trends. Organisations need to be looking at how they make their industry or sector, and careers, more attractive to students coming through and engaging with colleges. \n\"Not enough employers have long term strategies. They will either have to get people from further afield or even go abroad, and Brexit is coming up.\" \nHe said employers will have to look at their training needs, for instance bespoke apprenticeships. \n\"There are really good employers in the legal sector working with colleges to create legal apprenticeships as a completely new route to going to university,\" he said. \"And we will see more of that in the construction sector.\" \nHe said the Building Plymouth initiative, where the public and private sectors are working together to fill a projected 10,000 jobs in the city, is a good example. \n\"The sector has realised there is a huge demand for people and has come together with a single voice to tackle the issue,\" he said. \nAnthony Painter, director of the action and research centre at the RSA (The Royal Society for the Encouragement of Arts, Manufactures and Commerce), runs a think-tank covering the economy, education and the future of public services and communities. \n\"We are talking about the future of work and how we can support people to adapt to the many changes they face and may face,\" said the author of Left Without a Future?: Social Justice in Anxious Times. \n\"That includes technology and the impact it is likely to have. There have been predictions about the number of jobs that will go with automation and AI. I don't believe that. If history is right we can be relatively optimistic about more jobs and jobs at the high end. \n\"But it depends on the pace and adoption of the tech. It will be different in different countries. Places like Japan will be interested in robotics because they have an aging population. \n\"We may do it more slowly, and we have a preference for keeping people in work. \n\"But people will have to gain new skills and adapt,\" he said. \n\"What are the skills we need? They will be in areas like digital literacy, the care industry. We are an aging society and need good carers. Let's think about getting a better care system. \n\"And I think we are going to experience a big opportunity with connect devices, the internet of things: how houses work, how they use energy, how we entertain ourselves, how cities are connected up, how transportation systems work. \n\"I think there is an economic dividend for countries that get ahead, countries like South Korea and the USA, and we should do that too. \n\"The areas that will thrive will be science, technology, personal care services, creativity and design, policing, teaching. \nThe decline will come in routine work and sectors like accountancy, law, retail, he suggests. \n\"Anything where the parameters are predictable will be at risk,\" Mr Painter said. \"But it's whether firms invest. They haven't been investing at the pace we thought they would. This is why productivity has been low. \n\"We have not gone for high wages, skills and investment but for ultra-efficiency. \n\"In future the problem will be transitioning people to other types of jobs. We will have to think about what else people can do, retrain them. We don't want people thrown on the scrap heap. \n\"We are also worried about the level of security that those on low to middle incomes will have, and increased stresses on those on low pay. \n\"While job figures are good there are underlying trends, and what has started to happen is work is organised differently. Full time jobs are parcelled into small pieces and while that gives people an opportunity to work, it can lead to income volatility and you are not in control of your life and people can get into unsustainable debt, and at the acute end, mental health and addiction problems.\" \nThe sector facing arguably the most volatility is manufacturing. Peter Marsh, author of the New Industrial Revolution: Consumers, Globalisation and the End of Mass Production, thinks, however, new opportunities will be created – and with a distinctly human element. \nHe calls AI \"machine learning\" and said: \"A big worry is it will do away with routine jobs, and I go along with that to some degree. \n\"For example: legal work and accountancy. If we have machines that can read text or take in other sensory information we could see these jobs disappear. \n\"Or jobs in scientific diagnosis, these will be most at risk. \n\"We can make the same leap in manufacturing, but a lot of the routine jobs have already gone or are in the process of disappearing. Manufacturing has already lost thousands of jobs in most developed countries. \n\"What's left now, more and more, are the jobs where you require some sort of human empathy. \n\"For example, the most difficult jobs to fill are sales engineers, who have technical knowledge but can also talk to customers. \nREAD MORE: Man found dead in van by A38 died of massive cocaine overdose \n\"You can't replicate what these people do. \n\"New jobs will be in companies that are coming up with new ideas, like those merging bio technology and electronics. Dozens of companies are already into bio-electronics. \n\"This won't create huge numbers of jobs, but it will create jobs that are worthwhile. \n\"The other growth area is service jobs. Think of the number of times you engage with someone and your experience is unsatisfactory, that will be alleviated by having better people. \n\"A huge demographic trend is that people are getting older, and they will need more help. The requirement for nurses and care assistants will increase. We won't have machines that will adequately cater for it. \n\"Firms will have to recruit people with the skills or retrain them and retain them by making life within their companies more attractive for them. \n\"And it is a good idea to put the companies that are doing well on a pedestal.\" \nBill Murphy, chairman of Plymouth Manufacturers' Group (PMG), said there is already a recruitment and retention problem in the sector, and this could get worse, \n\"It's a big issues that keeps coming up every year, getting the right people with the right skills into the business is a constant problem. \n\"The best way is to engage with universities and colleges to get a unified approach. \n\"Academia gets people through but its attitude, problem solving skills, we need too, an overarching knowledge of the industry, manufacturing and management, problem solving. \n\"But the jobs of the future will be more varied, it will be about the ability to set up teams and problem solve. \n\"We need people in our business that can deal with problems and manage them.\" \nAnd PMG secretary Steve Gerry concurred. \n\"It's a huge problem and even more acute in the SW because of our location,\" he said. \"There is a shortage of STEM trained people, not enough are choosing those subjects at school or for degrees. \n\"People will need a better range of skills, and maybe choose to specialise in some, \" he predicted. \n\"They will have to be able to cope with big data, the ability to analyse, and do more computer programming and coding.\" READ NEXT: ", "external_links": [], "published": "2017-07-19T10:49:00.000+03:00", "crawled": "2017-07-19T11:01:50.002+03:00", "highlightTitle": ""}