{"organizations": [], "uuid": "32146a28586604181e44099fabce2f838ec1065d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13309734.ece/ALTERNATES/s1200/TMP_NEC_070717JDRBrown06JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/offshore-giant-comes-newcastle-brings-13309659", "country": "GB", "domain_rank": 21960, "title": "Offshore giant comes to Newcastle and brings 50 new jobs with it", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-11T07:00:00.000+03:00", "replies_count": 0, "uuid": "32146a28586604181e44099fabce2f838ec1065d"}, "author": "Keiran Southern", "url": "http://www.chroniclelive.co.uk/business/business-news/offshore-giant-comes-newcastle-brings-13309659", "ord_in_thread": 0, "title": "Offshore giant comes to Newcastle and brings 50 new jobs with it", "locations": [], "entities": {"persons": [{"name": "windplus", "sentiment": "none"}, {"name": "richard turner", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "neil brown", "sentiment": "none"}, {"name": "jake berry", "sentiment": "none"}], "locations": [{"name": "windfloat atlantic", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "river tyne", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "positive"}, {"name": "offshore wind farms", "sentiment": "none"}, {"name": "government", "sentiment": "none"}, {"name": "newcastle share from", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "wells", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Offshore giant comes to Newcastle and brings 50 new jobs with it JDR, a leading supplier of subsea power cables, has opened its European service centre on the banks of the River Tyne in Newcastle Share From left Nick Brown, Richard Turner and Neil Brown both of JDR (Image: newcastle chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAn offshore energy giant has opened up on the banks of the River Tyne in Newcastle, bringing up to 50 jobs to the North East. \nJDR, a leading supplier of subsea power cables and umbilicals to the offshore industry, officially opened its European service centre in Walker on Friday. \nThe opening was marked by an official ceremony led by Newcastle East MP Nick Brown followed by a tour of the 4,000m2 facility. \nThe multi-purpose centre includes a workshop, warehouse, visitor centre and state-of-the-art offices. \nInterested in North East jobs? Find job vacancy listings across a range of sectors here . \nJDR COO, Richard Turner, said: “With this new centre we can now offer our clients a wider range of services and state-of-the-art technical support for onshore and offshore activities. \nUltimately, this allows us to grow as a company and enables us to deliver an even higher quality of service to our customers.” \nThe facility will house up to 50 staff and will serve as the central base for JDR’s European service operation, as well as the firm’s sales and marketing functions. The new JDR service centre (Image: newcastle chronicle) \nTyneside was chosen due to the thriving offshore industry in the region, as well as its prime location close to the North Sea and Europe. \nJake Berry, minister for the Northern Powerhouse , said: “It’s great to see this further expansion of JDR. This facility will have an initial workforce of 20, including 10 new jobs, and plans to expand to 50 in the future. As the inaugural winner of the Northern Powerhouse Exports Award last year, the company highlights the best of the Northern Powerhouse. They make effective use of key northern assets in energy, innovation, access to international markets and a skilled workforce.” Read More North East's digital sector could be harmed by Government's Brexit stance \nFriday’s opening ceremony also coincided with a contract signing with Tideway who selected JDR to provide termination and testing support for the inter-array cables scope of work for one of their Offshore Wind Farms currently under construction. \nJDR has been awarded a number of projects for major clients this year including 11 Wells and East Anglia One. JDR has also been nominated as preferred cable supplier for US Wind’s Maryland project as well as by WindPlus for the Windfloat Atlantic project. \nThe centre will be vital in supporting service elements associated with such projects and future contract wins the company said. Like us on Facebook", "external_links": [], "published": "2017-07-11T07:00:00.000+03:00", "crawled": "2017-07-11T07:28:18.000+03:00", "highlightTitle": ""}