{"organizations": [], "uuid": "11a6a34f97c4bcc6fc7163dc0a0fb3c668f60501", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i3.leicestermercury.co.uk/incoming/article162304.ece/ALTERNATES/s1200/The-BT-East-Midlands-Dragons-front-from-left-Geoff-Hickman-Natasha-Clough-and-Owen-Moody-with-some-of-the-Fullhurst.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/fullhurst-students-make-pitches-bts-162089", "country": "GB", "domain_rank": 48128, "title": "Fullhurst students make pitches to BT's Dragons - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.955, "site_type": "news", "published": "2017-07-04T12:13:00.000+03:00", "replies_count": 0, "uuid": "11a6a34f97c4bcc6fc7163dc0a0fb3c668f60501"}, "author": "Lauren Mills", "url": "http://www.leicestermercury.co.uk/news/business/fullhurst-students-make-pitches-bts-162089", "ord_in_thread": 0, "title": "Fullhurst students make pitches to BT's Dragons - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "steve piggot", "sentiment": "none"}, {"name": "geoff hickman", "sentiment": "none"}, {"name": "piggot", "sentiment": "none"}, {"name": "chris gordon", "sentiment": "none"}, {"name": "kasam", "sentiment": "none"}, {"name": "natasha clough", "sentiment": "none"}, {"name": "owen moody", "sentiment": "none"}, {"name": "fullhurst", "sentiment": "none"}, {"name": "kasam hussain", "sentiment": "none"}], "locations": [{"name": "bt premises", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "bt", "sentiment": "negative"}, {"name": "leicester mercury fullhurst", "sentiment": "negative"}, {"name": "fullhurst community college", "sentiment": "negative"}, {"name": "superfast leicestershire", "sentiment": "none"}, {"name": "bt east midlands 'dragons", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fullhurst students make pitches to BT's Dragons BT took its links with Fullhurst Community College to a new level Share The BT East Midlands 'Dragons' front from left Geoff Hickman, Natasha Clough and Owen Moody, with some of the contestants from the school (Image: Chris Gordon) Share Comments \nBT’s decision-makers in the East Midlands moved their regular board meeting to Fullhurst Community College, Leicester, so they could meet students, take part in a Dragon’s Den-style business event and offer reading support to 11 to 14-year-olds. \nThe link-up is part of ongoing work between the college and BT’s Kasam Hussain, who acts as an enterprise adviser as part of a Government-led scheme that links volunteers from the business world with local schools and colleges. Read More \nKasam, BT’s programme manager for the Superfast Leicestershire fibre broadband programme, said: “We meet regularly as a board and it seemed like the perfect opportunity to hold our meeting outside of BT premises. \n“As far as I’m aware, this is the first time we’ve ever done this. \n“I work really closely with Fullhurst and we’re always looking for opportunities to link learning with real-life business experience. \n“The business event was really enjoyable and a great opportunity for the students to showcase their skills and business intuition. \n“I’m sure the experience of putting ideas forward will serve them well in the future. \n“We were all incredibly impressed by the quality of the work put before us.” \nBT’s team was welcomed to the college by principal Steve Piggot. \nAfter holding the first half of their board meeting, year 10 students made their business pitches to the BT board. Read More 'Set up textiles hub for Leicester to revive the industry' \nAs part of their coursework, students were challenged to imagine setting up a business. \nThey had to show an understanding of the current business environment, including the potential financial impact of Brexit. \nThey also put together cashflow forecasts and break-even tables to show they understood financial planning, with the aim of securing a bank loan to fund their idea. \nIdeas put forward included a catering service, a comic book shop, a painting and decorating business and a gaming accessories company. Read More \nLater in the day, BT’s team spent time with students from Key Stage 3 for some paired reading. \nMr Piggot said: “It was great to be able to welcome the team from BT into school. \n“Being able to offer students the opportunity to do something different, and interact with business leaders, should not be underestimated. \n“It’s an important part of their development and helps prepare them for life after Fullhurst. \n“A huge amount of effort went in to the business session and I’d like to congratulate everyone that took part. \n“It was also good for some of the younger members of the school to share some time with BT during the reading sessions in the afternoon.” Read More \nBT’s regional board meets regularly and is made up of people from different parts of the business from across the East Midlands. \nIt is chaired by East Midlands regional director Owen Moody. \nKasam, also a member of the board, signed up to join Fullhurst as an Enterprise Advisor during 2016. He volunteers his own time, with the full support of BT, to help students by working closely with senior teaching staff to develop advice and guidance around careers, employment and enterprise. Like us on Facebook ", "external_links": [], "published": "2017-07-04T12:13:00.000+03:00", "crawled": "2017-07-19T13:16:22.003+03:00", "highlightTitle": ""}