{"organizations": [], "uuid": "cb714eafbfd6e494227a1166bac15a2d2bcc2e72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30432582/16074795.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/anne-marie-morris-must-resign-says-newton-abbot-lib-dem-candidate/story-30432582-detail/story.html", "country": "GB", "title": "DanielClark published Anne Marie Morris must resign over N-word use says Newton Abbot's...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T18:00:00.000+03:00", "replies_count": 0, "uuid": "cb714eafbfd6e494227a1166bac15a2d2bcc2e72"}, "author": "DanielClark", "url": "http://www.devonlive.com/anne-marie-morris-must-resign-says-newton-abbot-lib-dem-candidate/story-30432582-detail/story.html", "ord_in_thread": 0, "title": "DanielClark published Anne Marie Morris must resign over N-word use says Newton Abbot's...", "locations": [], "entities": {"persons": [{"name": "newton abbot", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "dani", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "roger kendrick", "sentiment": "none"}, {"name": "mrs chadwick", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "marie chadwick", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "john redwood", "sentiment": "none"}, {"name": "devonlive", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "central london", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Anne Marie Morris must resign over N-word use says Newton Abbot's Lib Dem election candidate By DanielClark | Posted: July 10, 2017 3 COMMENTS SHARES Marie Chadwick (left) has called for Anne Marie Morris (right) to resign Anne Marie Morris must resign over N-word use says Newton Abbot's Lib Dem electi... X \nCopy link to paste in your message / Comments (3) \nCalls have been made for Anne Marie Morris to resign as Newton Abbot's MP after she was recorded using the N-word at a meeting of eurosceptics in Central London. \nMs Morris described the UK leaving the EU without a deal as a \"real n r in the woodpile\" at the launch of a report into the future for the UK's lucrative financial sector after Brexit. \nMarie Chadwick, who was the Liberal Democrat candidate at the General Election in June, has called for her resignation and said that she has shown her true colours with the remarks. Read more Anne Marie Morris recorded using offensive 'N****r in the... \nMrs Chadwick said: \"She should resign and she needs to resign. She has a history of associating herself with people who hold dubious views and now she has shown that not only does she hold those views, she is not afraid to speak about them. \n\"You simply cannot have people who hold these views representing residents in parliament. \n\"It is worrying for the constituents that she is the MP who represents them and she has shown with these comments that she is simply not up to the job and she needs to resign. \n\"I will be calling on Theresa May to sack her but if not, she needs to resign as she was shown what her true colours her.\" Read more Anne Marie Morris apologises after being recorded using the... \nThe Tory MP, who has been the member of parliament for Newton Abbot since 2010, made the astonishing remark while discussing what financial services deal the UK could struck with Brussels after 2019. \nDespite using the racist term, none of her fellow panelists, including Tory MPs Bill Cash and John Redwood, reacted to the comment. Read more Tory candidate distances herself from 'racist remark' made by her agent and partner at hustings \nAfter saying just seven per cent of financial services in the UK would be affected by Brexit, Morris, who campaigned to leave the EU, said: \"Now I'm sure there will be many people who'll challenge that, but my response and my request is look at the detail, it isn't all doom and gloom. \n\"Now we get to the real n****r in the woodpile which is in two years what happens if there is no deal?\" \nIt comes just after she was forced to distance herself from comments made by her electoral agent and partner at a hustings who claimed 'that the crisis in education was due entirely to non-British born immigrants and their high birth rates'. \nDuring the debate around education and fair funding of schools, a member of the public stood up and said: 'that the crisis in education was due entirely to non-British born immigrants and their high birth rates'. \nThe person who made that remark was Roger Kendrick, who is both Anne Marie Morris's partner and her electoral agent. \nIn response, Anne Marie Morris told DevonLive: \"I don't share the views expressed by Roger Kendrick.\" ", "external_links": [], "published": "2017-07-10T18:00:00.000+03:00", "crawled": "2017-07-10T19:22:13.001+03:00", "highlightTitle": ""}