{"organizations": [], "uuid": "ed7f08d6008c6311fcb6977fcc5600ea176a3a52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12241781.ece/ALTERNATES/s1200/Sports-Direct-agency-worker-conditions.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13358187", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Mike Ashley says Sports Direct to become the 'Selfridges' of sport despite profit slump", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-20T10:25:00.000+03:00", "replies_count": 0, "uuid": "ed7f08d6008c6311fcb6977fcc5600ea176a3a52"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13358187", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Mike Ashley says Sports Direct to become the 'Selfridges' of sport despite profit slump", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "darby", "sentiment": "none"}, {"name": "carolyn mccall", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "gregory", "sentiment": "none"}, {"name": "mccall", "sentiment": "none"}, {"name": "gavin darby", "sentiment": "none"}, {"name": "david marlow", "sentiment": "none"}, {"name": "tech north", "sentiment": "none"}, {"name": "richard gregory", "sentiment": "none"}, {"name": "mr ashley", "sentiment": "none"}, {"name": "mark newton-jones", "sentiment": "none"}, {"name": "keith hellawell", "sentiment": "none"}, {"name": "martin gannon", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}, {"name": "patrizia", "sentiment": "none"}, {"name": "martin crouch", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ulverston", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "baltic centre", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "east midlands  nottingham", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "barnard castle county durham", "sentiment": "none"}, {"name": "cambridgeshire", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "shoreditch", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "gibside way", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}, {"name": "barnard castle", "sentiment": "none"}], "organizations": [{"name": "coreena ford tech", "sentiment": "none"}, {"name": "coreena ford building society", "sentiment": "none"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "premier foods", "sentiment": "none"}, {"name": "metro radio arena", "sentiment": "none"}, {"name": "oxo", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "newcastle united and sports direct", "sentiment": "none"}, {"name": "mothercare", "sentiment": "none"}, {"name": "aoc", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "coreena ford british gas", "sentiment": "none"}, {"name": "gsk", "sentiment": "none"}, {"name": "coreena ford pharma", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "nottingham building society", "sentiment": "none"}, {"name": "british gas", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "norwich & peterborough building society", "sentiment": "none"}, {"name": "nissin foods", "sentiment": "none"}, {"name": "horlicks brand", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "glaxo wellcome plc cephalosporins manufacturing building", "sentiment": "none"}, {"name": "tech north", "sentiment": "none"}, {"name": "yorkshire building society", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "cadbury", "sentiment": "none"}, {"name": "n&p", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "building society", "sentiment": "none"}, {"name": "mothercare  retailer mothercare", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT £200m Gateshead conference centre will showcase the best of the North East, backers say \nTyneside’s new £200m conference centre will give a massive boost to the region’s economy, it has been claimed. \nThe venue between the Sage and the Baltic came a step closer when Gateshead Council announced a partnership with property developers Ask Real Estate and investment group Patrizia to develop a 12,500-seat arena, plus conference and exhibition facilities on the 10-acre site. \nThe development will see the creation of an entertainment, conference and exhibition centre, a hotel, bars and restaurants on the site, with the operator of the Metro Radio Arena in Newcastle closing its current site and moving across the river. \nGateshead Council will be borrowing £25m to help fund the scheme, with £5m coming from the North East LEP’s local growth fund and the rest from the private partners in the scheme. \nGateshead Council leader Martin Gannon defended the spending on the development, and said council budgets would not be affected and the new jobs provided would benefit the town. \nHe said: “We’ve long had an ambition to do this but the big shift here is that we’ve got the users signed in for 35 years. \n“People are going to ask where the money is coming from, and I know they will say that this is happening when we’re closing libraries or reducing their mother’s care package. \n“But not a penny of this comes from our revenue budget. This is an investment so that we can generate more business rates, plus we get a rental income from the site, and that all actually helps us sustain services.” 9.05 Coreena Ford Tech firms need to fight for more focus in the North \nThe North’s technology sector faces a challenge to get the same recognition as its counterparts in the south, an industry leader has said. \nTech North director Richard Gregory said that tech firms across the North East need to work harder than many southern firms to publicise themselves and gain access to the facilities they need to grow. \nHis comments were made at Tech North’s Summer Showcase event, which was held at Gateshead’s Baltic Centre for Contemporary Art . \nAt the event Mr Gregory said that, since taking over as director of Tech North, he had heard the organisation described as a ‘marketing agency’ for the tech sector, but that while it had a wider remit, he did not mind the label as promoting the sector is one of Tech North’s five main aims . \nHe said: “Someone has to bang the drum for these organisations. It’s hard for even huge organisations such as Sage to get the coverage that a five-person start-up in Shoreditch gets.” Richard Gregory speaking at Tech North's Summer Showcase at the BALTIC (Image: Newcastle Journal) 9.00 Coreena Ford Building Society to open seven branches across East Midlands \nNottingham Building Society has secured the future of 50 jobs by bucking the industry trend and opening seven branches. \nThe firm is launching branches in market towns across Norfolk, Cambridgeshire and the Midlands, which are being run by the Norwich & Peterborough Building Society (N&P). \nIt comes after Yorkshire Building Society announced in January that it would shut 48 sites and call time on the N&P brand after 157 years. \nBanks and building societies have made cost savings by rolling back their branch network as some customers prefer to use online banking services. \nDavid Marlow, chief executive of Nottingham Building Society, said he hopes to set up even more branches in market towns. 8.55 Coreena Ford Pharma firm GSK to invest millions in North East - but Ulverston is in firing line \nGlaxoSmithKline’s (GSK) factory in Barnard Castle is set to receive a share of a £140m investment at the same time that the future of its Cumbria plant is put at risk. \nIn a series of announcements made yesterday , the pharmaceutical giant revealed it will sell-off its famous Horlicks Brand, close its Slough plant, slash 320 jobs, and backtrack on plans to invest £350m in a biopharm facility in Ulverston, Cumbria. \nBut at the same time the firm said it was investing £140m across three of its manufacturing sites, including £39m at its Barnard Castle facility. \nThe County Durham site manufactures HIV and respiratory drugs, which are two major focus areas for the pharma firm. The £39m will be spent on new technology and equipment used to manufacture these drugs. \nAround £20m will be spent to install a new assembly and packing line for an asthma drug, while £14m will support the manufacture of a new HIV medicine. A further £5m will go towards facilities relating to a drug used to treat lupus. \nNo new jobs are expected to be created as a result of the investment. \nAt the same time, however, the future of GSK’s Ulverston facility has been put at risk, as the firm carries out a strategic review of its antibiotics business. Glaxo Wellcome PLC Cephalosporins Manufacturing Building, their secondary manufacturing site in Barnard Castle County Durham (Image: Publicity Picture) 8.50 Coreena Ford Turnaround efforts pay off for Mothercare \nRetailer Mothercare has notched up further UK sales growth thanks to turnaround efforts, while the weak pound offset flagging overseas trade. \nThe baby care chain posted a 1.9% rise in UK like-for-like sales for its first quarter to July 8, although total sales fell 1.8% as it axed more stores under a sweeping overhaul. \nMothercare saw international sales rise 2.2%, but plunge 8.3% with the boost from the Brexit-hit pound stripped out. \nThe group said it was knocked by ongoing woes in the Middle East, where consumer confidence has been impacted by low oil prices and fears of an economic slowdown. \nIts update also showed online sales growth slowing sharply in the UK, to 3.3% in the 15-week quarter, although Mothercare insisted this was not the start of an “underlying permanent shift in customer behaviour”. \nBut the group joined retail rivals in cautioning over an “uncertain” consumer outlook as shoppers remain under pressure from Brexit-fuelled inflation. \nShares fell 5% after the update. \nMothercare is shutting a swathe of high street stores under a revamp plan led by CEO Mark Newton-Jones. It announced plans in May to slash its UK store estate further to between 80 and 100 shops as it focuses on key locations nationwide, which will act as specialist advice and service points to support online sales. The Mothercare store in Stockton 8.47 What's the FTSE latest? \nThe FTSE-100 index at 8:15am was up 20.99 at 7451.90. \nThe pound at 8am was 1.3021 dollars compared to 1.3036 dollars at the previous close. The euro at 8am was 0.8848 pounds compared to 0.8830 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.45 Coreena Ford British Gas to pay out £1.1m compensation over missed appointments \nBritish Gas is to pay £1.1m to compensate customers after its agents missed appointments, breaching industry standards. \nThe energy giant will make the payments to domestic and micro-business customers after its third-party agents missed appointments or turned up late, and did not compensate them as required by the regulator Ofgem. \nAround 12,000 mostly business customers were affected. British Gas reported the breach to Ofgem, which agreed to its redress package and is therefore not taking formal enforcement action. \nMartin Crouch, Ofgem senior partner for improving regulation, said: \nBritish Gas did the right thing in coming forward to report this issue, and has since improved its processes to make sure that, when appointments are missed or not kept on time, all customers receive the compensation they’re entitled to. It’s crucial that suppliers keep appointments on time, and make amends when things go wrong. \nAs part of the compensation package, British Gas paid out £30 for an initial failed appointment and £30 for not paying customers within the required 10 days. In addition, the group has paid an extra £30 to each affected customer. \nEnergy suppliers and their agents must meet minimum standards of customer service under Ofgem’s Guaranteed Standards, including when they visit customers on their premises. When they fall short, customers must be paid compensation. Gas burns on a cooker (Image: Matt Cardy/Getty Images) 8.40 Coreena Ford EastJet flying high after strong easter \nEasyJet has upgraded its annual profit forecast after a strong Easter helped boost third- quarter revenues. \nThe budget airline reported a 16% rise in sales to £1.39 billion in the three months to June 30, with passenger numbers increasing by 10.8% to 22.3 million. \nAs a result, easyJet said full-year pre-tax profits are expected to come in between £380 million and £420 million, up from earlier forecasts. \nChief executive Carolyn McCall, who will leave the company to take the top job at ITV in January, said: \nOur purposeful and disciplined growth continues to strengthen our market positions and we are seeing an underlying improving revenue trend. \nAlthough we expect capacity to continue to put pressure on yields, our progress this year has enabled us to upgrade this year’s profit-before-tax forecast and demonstrates that, after a difficult 18 months of external challenges, easyJet once again has positive momentum. \nHowever, profits will still come in below last year’s £495 million, when the firm was stung by the plunging pound. Ms McCall leaves the low-cost carrier at a difficult time for the sector in Britain, with Brexit storm clouds gathering over the travel industry. \nThe pound’s collapse has meant fewer people travelling overseas and, more starkly, British airlines are at risk of being grounded unless Tory ministers strike an aviation deal with the EU before March 2019. \nTo mitigate the impact, easyJet last week confirmed that it has applied for a new air operator’s certificate (AOC) in Austria to allow it to continue flying in the European Union after Britain’s divorce from the bloc. easyJet chief executive Carolyn McCall with dancers, at the launch of Moscow flights back in 2013. 8.35 Coreena Ford Mr Kipling owner suffers as dessert sales fall \nPremier Foods has reported a dip in first quarter revenues after a combination of warm weather and lacklustre dessert sales dragged on its performance. \nThe Mr Kipling cakes firm saw sales fall 3.1% in the 13 weeks to July 1, due in part to fewer consumers buying Ambrosia. “Ambrosia sales were noticeably lower as changing promotional mechanics resulted in lower than expected volumes in the quarter,” Premier said. \nIt added that revenue was adversely impacted by a warmer June and “lower promotional effectiveness” in its desserts division. \nHowever, international sales rocketed 20%, with Cadbury cake sales in Australia a major contributor. \nBoss Gavin Darby said: “Our first quarter sales were lower than last year, as we expected, primarily due to lower sales volumes in the grocery categories, notably desserts. \n“At the retail level we have continued to outperform our markets and industry peers, our international business grew 20% in the quarter, and our cost savings programmes are on track.” \nA partnership with Japanese noodle-maker Nissin Foods has delivered more than £3m of retail sales, the firm added. \nThe group, which also owns a raft of household brands including Oxo and Batchelors, has recently been stung with surging costs of commodities such as sugar, chocolate, dairy, wheat and palm oil, as well as the collapse in the pound. \nIn January, the firm warned over profits and said it plans to slash costs throughout its supply chain. It expects to deliver savings of £10m this financial year. \nMr Darby added: “We expect to report positive sales growth in the second quarter, broadly flat sales in the first half and our expectations to deliver progress in the full year are unchanged.” Mr Kipling Viennese Whirls KEY EVENT Sports Direct to become the 'Selfridges' of sport, says owner Mike Ashley \nThe billionaire owner of Newcastle United and Sports Direct has declared the retail empire is on track to become the ‘Selfridges’ of sport, through its new generation of stores. \nThe business has ploughed £300m into property in the last year, and also snapped up stakes in a raft of other brands and businesses, in the UK and abroad, in line with the firm’s strategy. \nHis comments came as the firm announced underlying pre-tax profits tumbled by 58.7% from £275.2m to £113.7m in the year ended April 30 2017 after it was left exposed by the pound’s plunge following the Brexit vote. \nNewcastle United owner Mr Ashley said the group had taken action to limit the impact of the pound’s heavy falls against the US dollar, but warned “we remain exposed” to longer-term sterling woes. \nMike Ashley, chief executive, said: \nSports Direct is on course to become the “Selfridges” of sport by migrating to a new generation of stores to showcase the very best products from our third party brand partners. \nWe have invested over £300m in property over the last year, and I am pleased to report that early indications show that trading in our new flagship stores is exceeding expectations. \nWe will continue to invest and make decisions for the long term, whilst trying to conservatively manage the currency volatility that is reflected in our full year results. \nAs previously announced, the devaluation of Sterling against the US dollar has led to a significant impact on EBITDA and profits in FY17. \nWe have put in place hedging arrangements to minimise the short-term impact of currency volatility, but like many UK retailers we remain exposed to medium / long term currency fluctuations. Our results were also impacted by provisions and depreciation charges. \nI would like to thank all our people at Sports Direct for ensuring that we continue to move forward together whilst elevating our retail proposition. \nThe group, which sources many of its branded goods in US dollars from Asia, said it was “optimistic” for the year ahead, targeting underlying earnings growth of between 5% and 15% despite ongoing pressure from the pound. \nIt said the rollout of a new store format was bearing fruit, with better-than-expected early results. \nThe group said on reporting results that it had “made positive progress across the business as we continue to strive to ensure that all of our people are treated with dignity and respect”. \nChairman Keith Hellawell insisted Sports Direct is a company of which “Britain can rightly feel very proud”. \nMr Ashley said the group has “smashed the ball out of the park with the Selfridges of sport concept”, having been widening the reach of its stores by partnering with other brands. \nAs well as pumping more than £300 million into new stores, he has snapped up a raft of stakes in struggling high street firms, most recently a 26% holding in struggling Game Digital. He has also bought stakes in Debenhams, French Connection and Findel. Sports Direct store on Gibside Way, Gateshead (Image: Newcastle Chronicle) Share", "external_links": [], "published": "2017-07-20T10:25:00.000+03:00", "crawled": "2017-07-20T12:42:46.003+03:00", "highlightTitle": ""}