{"organizations": [], "uuid": "bc4595a04226f1a8487bbfbdb21fe6e4ed5500da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13336136.ece/ALTERNATES/s1200/AGP_MDM_290417BLAIR_026JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tony-blair-labour-jeremy-corbyn-13336081", "country": "GB", "domain_rank": 21960, "title": "Tony Blair urges Labour to capture centre ground as he rules out creating new party", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-15T12:20:00.000+03:00", "replies_count": 0, "uuid": "bc4595a04226f1a8487bbfbdb21fe6e4ed5500da"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tony-blair-labour-jeremy-corbyn-13336081", "ord_in_thread": 0, "title": "Tony Blair urges Labour to capture centre ground as he rules out creating new party", "locations": [], "entities": {"persons": [{"name": "tony blair", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "durham city centre labour", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "kensington", "sentiment": "none"}, {"name": "county hotel balcony", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "durham miners", "sentiment": "none"}, {"name": "canterbury", "sentiment": "none"}, {"name": "luntz global partners", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "institute for global change", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Tony Blair urges Labour to capture centre ground as he rules out creating new party The former Prime Minister and Sedgefield MP warned Jeremy Corbyn to be 'careful' in the wake of the June General Election Share Former Prime Minister and Labour MP Tony Blair (Image: Daily Mirror) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTony Blair has ruled out creating a new centrist political party to emulate Emmanuel Macron’s success in France. \nThe former Prime Minister and North East MP instead urged Labour to seize the centre ground, warning Jeremy Corbyn to be “careful” in interpreting the party’s above-expectations performance in the General Election. \nMr Blair praised the Labour leader for his “temperament” in the campaign, helping the party achieve a “remarkable” result by tapping into “real and powerful” support among younger voters during the election. \nBut he cautioned against “exaggerating” the significance of the election as losses in heartlands like Middlesbrough and Stoke were as “alarming” as wins in Kensington and Canterbury were “amazing”. \nAnd he insisted the result does not alter his judgment “about the risks of an unchanged Corbyn programme”. Durham Miners' Gala 2017 in Durham City Centre Labour leader Jeremy Corbyn watches from the County Hotel Balcony \nMr Blair, Sedgefield MP from 1983 to 2007, said Mr Corbyn should now “reach out” to formerly critical MPs with Government experience to “craft a programme of credibility as well as change”. \nPresenting polling showing 73% of UK voters identify as centre, centre-left or centre-right, he wrote in an article for his Institute for Global Change: “If a right-wing populist punch in the form of Brexit was followed by a left-wing populist punch in the form of unreconstructed hard left economics, Britain would hit the canvas, flat on our back and be out for a long count. \n“The conventional wisdom is that the centre ground in British politics is now marginalised. \n“It is true that the country didn’t vote for centrist politics on June 8; but neither was it on offer. \n“The space for the centre may seem smaller; but the need for it is ever bigger.” Read More Virgin Trains did not break data protection laws with Jeremy Corbyn CCTV images \nHe went on: “I am not advocating a new party. Quite apart from the desirability of such a thing, our political system puts formidable barriers in its path. \n“In any event, as a member of the Labour Party of over 40 years standing, I want the Labour Party to capture this ground. \n“But there are millions of politically homeless in Britain. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“They are not going to wander the by-ways of politics, bedding down uncomfortably, forever, not with their country in the dire shape it is in. \n“The challenge for the centre is to be the place of changing the status quo not managing it. \n“If it does, it still beats everything else.” \nMr Blair cautioned Labour against thinking “one more heave” with the same policies would be enough to deliver an election victory, saying the Tories had instead lost a “recoiling” public with policies such as continued austerity and allowing a Commons vote on fox hunting. \n“We should beware our own form of hubris,” he said. \n“The Tories are not going to run another campaign like that one. \n“Next time, Labour’s economic programme will come under vastly greater scrutiny. \n“No one is going to believe that there is not a real possibility of Jeremy Corbyn as Prime Minister. \n“The campaign mishaps which happened every time the spending figures were put under the spotlight won’t pass so easily.” \n• The Luntz Global Partners poll surveyed 3,026 British, German and French nationals in May and June, weighting the survey to represent 1,000 from each country. Like us on Facebook", "external_links": [], "published": "2017-07-15T12:20:00.000+03:00", "crawled": "2017-07-15T13:04:29.003+03:00", "highlightTitle": ""}