{"organizations": [], "uuid": "dafeadc50812cf124be5eddd04699783721b037e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i1.leicestermercury.co.uk/incoming/article219945.ece/ALTERNATES/s1200/Breedon-Group-chairman-Peter-TomJPG.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/breedon-group-doubles-revenues-219901", "country": "GB", "domain_rank": 48128, "title": "Breedon Group doubles revenues - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.727, "site_type": "news", "published": "2017-07-20T12:38:00.000+03:00", "replies_count": 0, "uuid": "dafeadc50812cf124be5eddd04699783721b037e"}, "author": "Lauren Mills", "url": "http://www.leicestermercury.co.uk/news/business/breedon-group-doubles-revenues-219901", "ord_in_thread": 0, "title": "Breedon Group doubles revenues - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "breedon", "sentiment": "negative"}, {"name": "peter tom", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "matt short", "sentiment": "none"}], "locations": [{"name": "breedon", "sentiment": "none"}, {"name": "hill", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicester mercury news breedon group", "sentiment": "negative"}, {"name": "breedon group", "sentiment": "negative"}, {"name": "general election", "sentiment": "none"}, {"name": "share breedon group", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "breedon aggregates", "sentiment": "none"}, {"name": "leicester tigers", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Breedon Group doubles revenues Breedon has risen from 35th to 9th place in our list of the county's top 200 businesses following successful acquisitions Share Breedon Group chairman, Peter Tom (Image: Matt Short) Share Comments \nThe UK’s largest independent construction materials group has doubled its revenues. \nBreedon Group, based in Breedon on the Hill, said income in the six months to the end of June jumped 100 per cent to £326 million, up from £163 million last year. Read More Rotherhill to build massive new industrial estate near Loughborough \nProfits came in at £31 million, a 50 per cent increase from nearly £21 million for the same time in 2016. \nThe company highlighted strong profit improvement from the former Breedon Aggregates business and a “robust contribution” from former Hope Construction Materials which it purchased for £336 million in August last year. Hope Construction truck \nBreedon said the integration of former Hope operations has been completed, with planned synergies expected to be fully delivered in 2018, ahead of schedule. \nBreedon said it remains on the acquisition trail following its purchase of Hope and Pro Mini Mix, which has a fleet of eight mixer trucks and specialises in delivering small loads of ready-mixed concrete and screeds, to commercial and domestic customers. \nChairman Peter Tom, who is also chairman of Leicester Tigers, said: “We have several potential acquisitions in the pipeline and I will be disappointed if in the next six months we don't announce two or three deals.\" \nHe added: \"I am pleased to report that in the first half of 2017 the former Breedon Aggregates business posted a strong profit improvement and the former Hope Construction Materials business made a robust contribution, even after taking into account the shutdowns of both our cement kilns for planned annual maintenance and upgrade during the first half, which were completed on time and to budget. Read More 1,700 acres of glorious Leicestershire countryside - yours for just £13.5m \n“Although the outcome of the General Election, coupled with the commencement of Brexit negotiations, have created some further uncertainty for the UK economy, the outlook for UK construction remains encouraging. It is reassuring that the Government’s direction of travel appears to be moving away from continued austerity towards fiscal stimulus, which can only be helpful to our industry. Read More AIM-listed Image Scan to beat market expectations \n“We have consistently demonstrated our ability to generate value for our shareholders irrespective of economic conditions, through flexible and imaginative customer service, rigorous cost control, focused investment and a culture of continuous operational improvement. These disciplines, coupled with a strong balance sheet and healthy cashflow, put us in a strong position to take advantage of future growth opportunities, both organically and through further bolt-on acquisitions. \n“More immediately, our performance in the first six months and our prospects for the second half give us confidence that we will meet 2017 market expectations.” \nBreedon is close to completing its new £3 million headquarters at Breedon on the Hill. Around 75 staff will move in on August 8. \nMr Tom said: \"It has capacity for more than 100 and we are always looking for good people.\" Like us on Facebook ", "external_links": [], "published": "2017-07-20T12:38:00.000+03:00", "crawled": "2017-07-20T13:36:26.018+03:00", "highlightTitle": ""}