{"organizations": [], "uuid": "fa5cd11bf07927edd64825d75b62a5d4f2ba099c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13307467.ece/ALTERNATES/s1200/Fried-Breakfast.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-breakfast-alert-hard-brexit-13307310", "country": "IE", "domain_rank": 21960, "title": "Brexit breakfast alert: A hard brexit could slap £3 on the cost of a full English for families - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2017-07-10T17:00:00.000+03:00", "replies_count": 0, "uuid": "fa5cd11bf07927edd64825d75b62a5d4f2ba099c"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-breakfast-alert-hard-brexit-13307310", "ord_in_thread": 0, "title": "Brexit breakfast alert: A hard brexit could slap £3 on the cost of a full English for families - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}], "organizations": [{"name": "invalid email  brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "westminster  paul martin", "sentiment": "none"}, {"name": "kmpg", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A family full English could cost a lot more if Brexit doesn't go well (Image: Getty Images) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBrexit would raise the cost of a family full English breakfast by £3 if the UK leaves the EU without a trade deal according to a leading financial analyst firm. \nKMPG’s analysis found that a basket of goods to make a full English breakfast for a family of four would increase from £23.59 to £26.61 if Britain is unable to seal a Brexit trade deal. \nThe basket includes everything needed to make a full English breakfast if the cupboards and fridge are empty before going shopping. In addition to packets of sausage, bacon and six eggs, it includes items like full bottles of olive oil, brown sauce and orange juice, along with a jar of instant coffee. This is what Brexit could mean for breakfast \nIf British politicians can not strike a trade deal or transitional agreement with the EU, tariffs would most likely revert to the World Trade Organisation’s customs rules, according to KMPG analysts. \nImported goods would be slapped with some of the biggest tariff increases. That would include coffee, Danish bacon, orange juice and olive oil, all of which are common additions to a full English breakfast basket. The cost of imported goods will rise if Britain fails to secure post-Brexit trade deal \nThe basket which KMPG analysed also contained Danish butter, French jam, Italian chopped tomatoes, mushrooms imported from Ireland and the Netherlands, along with sausages from various EU countries. \nThe brown sauce was imported from Holland, where HP sauce is made, while the baked beans were grown in the USA and canned in Italy. \nThe eggs, bread and milk were all sourced from Britain , with KMPG saying it intentionally added imported versions of popular goods to the list to show the impact a poor trade deal could have on British shoppers, who KPMG say have got used to cheap imported goods. Read More Could the UK stay in the European Union after all? That's the question being asked at Westminster \nPaul Martin, UK head of retail at KPMG, said: “Most retailers underestimate the potential cost of customs tariffs, however not only do they need to understand their immediate supply chain better, but the supply chains of their supplier’s supplier too, as all will have an impact. \n“The British consumer has become accustomed to seasonal produce all year round and has binged on a diet of discounts for some time. With that in mind, our analysis, which focussing mainly on imported goods, isn’t too unrealistic. \n“Shoppers could be forgiven for overlooking the significant impact customs will have on the prices they pay at the till. However, against a backdrop of increasingly squeezed margins, it is unlikely retailers will be able to hold the flood on higher costs indefinitely.” Read More", "external_links": [], "published": "2017-07-10T17:00:00.000+03:00", "crawled": "2017-07-10T12:16:04.016+03:00", "highlightTitle": ""}