{"organizations": [], "uuid": "ff56c5944e1da00c21c89c90163319914c6fd7c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13398894.ece/ALTERNATES/s1200/BELGIUM_Brexit_134527A.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/areas-north-east-hit-brexit-13399094", "country": "GB", "domain_rank": 21960, "title": "All areas of North East will be hit by Brexit, new study shows", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-28T14:33:00.000+03:00", "replies_count": 0, "uuid": "ff56c5944e1da00c21c89c90163319914c6fd7c6"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/areas-north-east-hit-brexit-13399094", "ord_in_thread": 0, "title": "All areas of North East will be hit by Brexit, new study shows", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "gove", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "andrew carter", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "centre for economic performance", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "centre for cities", "sentiment": "none"}, {"name": "london school of economics", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business All areas of North East will be hit by Brexit, new study shows Study by Centre for Cities finds that hard Brexit will be almost twice as harmful as softer options Share The EU chief Brexit negotiator Michel Barnier, right, and British Secretary of State David Davis (Image: AP) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAll areas of the North East would be hit by Brexit and may take longer to recover than other parts of the country, a new study says. \nThe study by the Centre for Cities and the Centre for Economic Performance (CEP) at the London School of Economics predicts that economic output in the North East would be between 1.1% and 1.4% lower in the event of a “soft” brexit , but this would almost double to 2%-2.6% if the Government opts for a “hard” Brexit. \nThe study finds that the North East, which mostly voted in favour of leaving the EU, would not be as hit as badly as the South in the decade after Brexit. \nBut it adds that areas like the North East will be less able to adapt to the shock to their economies and will find it harder to recover aftwards. \nAndrew Carter, chief executive of Centre for Cities, said: “Contrary to much of the received wisdom on Brexit, it is the most prosperous UK cities which will be hit hardest by the downturn ahead, but poorer places across the North and Midlands will find it tougher to adapt. \n“First and foremost, the Government should do all it can to minimise the coming economic shocks by securing the best possible trade deal with the EU . That means ensuring that our post-Brexit trading arrangements are as close to our current relationship with Europe as possible. \n“But it’s also critical that the Government uses its forthcoming industrial strategy to give cities across the country the investment, powers and responsibilities they need to make their economies as successful and competitive as possible.” Read More Gove plans for new farm subsidies given cautious welcome in North East \nThe report suggests that more economically vibrant cities, predominantly in the South, will be hit hardest and most directly by Brexit as they have large, knowledge-intensive sectors such as business and financial services, which will be most affected by the increase in tariff and non-tariff barriers that Brexit could bring. \nBut these areas are also best placed to eventually respond to the changing economic circumstances while towns and cities in the North East will be less hit in the short term but also less well-equipped to respond to the economic shocks ahead. Like us on Facebook", "external_links": [], "published": "2017-07-28T14:33:00.000+03:00", "crawled": "2017-07-28T16:55:16.000+03:00", "highlightTitle": ""}