{"organizations": [], "uuid": "aa1166935f925113b0e2c398ab14b47bde704128", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article9823083.ece/ALTERNATES/s1200/PM376819.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13340795", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Carillion calls in accountants EY", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-17T10:00:00.000+03:00", "replies_count": 0, "uuid": "aa1166935f925113b0e2c398ab14b47bde704128"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13340795", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Carillion calls in accountants EY", "locations": [], "entities": {"persons": [{"name": "craig freeman", "sentiment": "positive"}, {"name": "diana hunter", "sentiment": "none"}, {"name": "crozier", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "addison", "sentiment": "none"}, {"name": "adam crozier", "sentiment": "none"}, {"name": "kalaris", "sentiment": "none"}, {"name": "benfield", "sentiment": "none"}, {"name": "heidi mottram", "sentiment": "none"}, {"name": "mccall", "sentiment": "none"}, {"name": "peter bazalgette", "sentiment": "none"}, {"name": "roger jenkins", "sentiment": "none"}, {"name": "richard boath", "sentiment": "none"}, {"name": "gergely raccuja", "sentiment": "none"}, {"name": "richard howson", "sentiment": "none"}, {"name": "john varley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "wolfson coreena ford", "sentiment": "none"}, {"name": "keith cochrane", "sentiment": "none"}, {"name": "hunter", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}, {"name": "fraser mcleay", "sentiment": "none"}, {"name": "carolyn", "sentiment": "none"}, {"name": "carolyn mccall", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "wolfson", "sentiment": "none"}, {"name": "thomas kalaris", "sentiment": "none"}, {"name": "jenkins", "sentiment": "none"}, {"name": "simon wolfson", "sentiment": "none"}, {"name": "christopher woolard", "sentiment": "none"}, {"name": "ms mccall", "sentiment": "none"}, {"name": "varley", "sentiment": "none"}, {"name": "coreena ford mike ashley", "sentiment": "none"}, {"name": "cochrane", "sentiment": "none"}, {"name": "justin cooper", "sentiment": "none"}, {"name": "pembridge villas", "sentiment": "none"}, {"name": "matthew clark", "sentiment": "none"}], "locations": [{"name": "northumbria", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "henley-on-thames", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "malibu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "thurloe square", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "liberum", "sentiment": "none"}, {"name": "oxfordshire", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "gibside way", "sentiment": "none"}], "organizations": [{"name": "coreena ford bragain booze", "sentiment": "none"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "coreena ford barclays", "sentiment": "none"}, {"name": "newcastle racecourse", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "royal academy", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "aua", "sentiment": "none"}, {"name": "addison motors", "sentiment": "none"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "guardian media group", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "witherspoon photography", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}, {"name": "fiba", "sentiment": "none"}, {"name": "trinity mirror southern", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "peppermint", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "tass", "sentiment": "none"}, {"name": "department of business", "sentiment": "none"}, {"name": "serious fraud office", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "southwark crown court", "sentiment": "none"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "capita asset services", "sentiment": "none"}, {"name": "energy and industrial strategy", "sentiment": "none"}, {"name": "lookers group", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "coreena ford northumbrian", "sentiment": "none"}, {"name": "newcastle business school", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "bargain booze", "sentiment": "none"}, {"name": "fun shack group", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "european erasmus+ programme", "sentiment": "none"}, {"name": "northumbrian water", "sentiment": "none"}, {"name": "ucl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Craig Freeman’s is one of the most fascinating Monday Interview stories I’ve heard. \nI knew before meeting him that he and his family had been involved in the Fun Shack Group for 14 years - much longer than many of the newcomers on the extreme trampoline leisure company scene. I certainly didn’t expect him to tell me that his family had actually been involved in the entertainment industry since the 1800s and that his grandmother performed the high wire for Queen Victoria - three times, no less! \nTheir business is one that’s very much rooted in the past but now they’re bringing the fun they’ve specialised in for years indoors. Craig Freeman of the Fun Shack Group (Image: newcastle chronicle) 8.55 Coreena Ford Mike Ashley's Sports Direct expected to show slump in profits \nMike Ashley’s Sports Direct is expected to reveal a slump in profits this week after an eventful year for the scandal-hit retailer and following the tycoon’s high-profile court battle. \nAnnual results for the company on Thursday are forecast to show a painful hit from the pound after it was left exposed to sterling’s plunge following the Brexit vote. \nAnalysts at Liberum are expecting the results to show underlying pre-tax profits more than halving to £126m from £275m the previous year. \nSports Direct warned after last June’s EU referendum that profit would be hit because it failed to hedge against the fall in sterling in the immediate aftermath of the vote. \nThis was borne out in half-year results when pre-tax profits slumped 57% to £71.6m. \nThe group has also cautioned of more profits woes to come as its key hedging position expired at the end of April, with no hedge in place for the following financial year. Sports Direct store on Gibside Way, Gateshead (Image: Newcastle Chronicle) 8.50 Coreena Ford How some of Europe's top basketball players are plotting the next stage of their career \nMore than 75 of Europe’s top basketball stars have linked up with a business school in the North East to develop the careers they will follow after their playing days. \nThe players are following leadership and management courses at Newcastle Business School after Northumbria University formed a partnership with the European office of basketball’s world governing body FIBA. \nThe Time-Out project is the first project of its kind and has secured funding worth €550,000 from the European Erasmus+ Programme. \nIt is designed exclusively for basketball players and aims to equip them with the skills they need to move from being an elite player to either a top coach or a business manager. \nPlayers will study through a mix of distance learning and short periods at Northumbria. While in Newcastle they will meet representatives from the city’s Eagles team, who play at the university, and also work with the Talented Athlete Scholarship Scheme (TASS), which is also based at Northumbria and helps elite athletes pursue their sporting career at the same time as getting an education. \nProfessor Fraser McLeay, head of corporate and executive development at Newcastle Business School, said: “Partnering with an organisation like FIBA Europe and bringing some of the world’s top basketball stars who have represented their country and played in top leagues like NBA in the United States is hugely prestigious. \n“Like us they have ambitious plans to develop Time-Out well beyond the initial two-year plan and to offer it to as many elite players as possible. \n“Our record of achievement and pioneering approach to business education, coupled with Northumbria’s status as one of the foremost universities in the UK for sport, makes us an ideal partner. Participants in FIBA's TIME-OUT program at Northumbria University’s Newcastle Business School (Image: SIMON VEIT-WILSON 07850209049) 8.45 Coreena Ford Bragain Booze owner toasts sales surge \nBargain Booze and Wine Rack owner Conviviality Retail has toasted surging full-year sales and profits as it continues to be boosted by a string of acquisitions. \nRevenue rocketed 85% to £1.56bn in the 12 months to April 30, while pre-tax profit jumped 147% to £22.5m. \nThe group’s performance was helped by the £200m acquisition of drinks supplier Matthew Clark, pop-up bar firm Peppermint and wine wholesaler Bibendum. Conviviality chief executive Diana Hunter said: “I am pleased to report a strong set of results that demonstrate our focus and commitment to serving our customers well, working in partnership with our suppliers and delivering against our strategic plans. \n“The balance we have created across the enlarged group, and resilience this creates, gives us confidence in the future success of the business.” \nThe company has also undergone a restructure, creating three separate business units - Conviviality Direct, Conviviality Retail and Conviviality Trading - which the firm also flagged as contributing to the strong results. \nMs Hunter added: “Importantly, the culture that we have created at Conviviality, with its entrepreneurial and innovative focus, remains true across the group and we firmly believe there is exciting potential for significant organic growth for our businesses, with further potential opportunities to build on the current platform.” (Image: Trinity Mirror Southern) Coreena Ford Barclays and former top bankers to appear in court over alleged side deals \nBarclays, its former chief executive and three top bankers will appear in court over alleged side deals struck during emergency fundraising at the height of the financial crisis. \nThe bank, ex-chief executive John Varley, 61, Roger Jenkins, 61, Thomas Kalaris, 61, and Richard Boath, 58, have all been charged with conspiracy to commit fraud over a June 2008 fundraising. \nThe case marks the first criminal charges to be brought in the UK against a bank and its former executives for activities during the financial crisis. \nBoath, of Henley-On-Thames, Oxfordshire, Jenkins, of Malibu, California, Kalaris, of Thurloe Square, London and Varley, of Pembridge Villas, London will appear at Southwark Crown Court today. \nBarclays, Varley and Jenkins face the same charge relating to a second fundraising in October 2008, while they have also been charged with providing unlawful financial assistance. \nThe Serious Fraud Office said the charges relate to the bank’s emergency fundraising from Qatari investors as the group sought to avoid a government bailout amid the banking sector meltdown. 8.35 Coreena Ford Northumbrian Water notches up 'global first' with Newcastle innovation festival \nNorthumbrian Water has hailed a week-long innovation event which it hopes will help it find answers to some of the challenges facing its industry and wider society. \nThe company has held its first innovation festival at Newcastle Racecourse this week, teaming up with customers, young people from the region and global companies including IBM, Microsoft and BT to explore a number of issues facing the region. \nThe event came to a conclusion yesterday afternoon with participants sharing their ideas on flood reduction, improving the environment, building the cities of the future and the development of the workplace of 2030. \nAnd Northumbrian Water’s CEO Heidi Mottram said that the event had been a ‘global first’. \nShe said: “Our company has some really good people but we knew we needed to collaborate with lots of other people who had something to add into what we do. The idea with this event was to bring people in with different perspectives, different ideas and different skills to see what we could do together. \n“I’ve talked to a lot of people on the site all week and they’ve been saying that this is unique. Companies around the world say they have collaborated with their customers but I’ve never before seen so many different companies and so many different types of people doing this sort of thing. \n“I think this is fairly unique in the world but I’m sure some of the companies working with us this week are to going to make it happen elsewhere because they’ve seen the value of hothousing collaboration in this way.” Northumbrian Water innovation event (Image: Witherspoon Photography) 8.30 Coreena Ford Brexit-hi pound helps deliver 'knock-out' year for investors \nInvestors are set to enjoy a “knockout year” after dividends hit an all-time record of £33.3bn in the second quarter, thanks to a lift from the Brexit-hit pound. \nThis represents a rise of 14.5% year on year in headline terms, the fastest in over three years, according to Capita Asset Services. \nSterling’s collapse since last year’s EU referendum has resulted in a substantial boost to dividends, as it means firms with overseas earnings enjoy a currency tailwind when converting them back into pounds. \nAside from the weak pound, high special dividends and robust underlying growth also lifted overall growth, the report said. \nSuch a strong quarter has led Capita Asset Services to upgrade its 2017 forecast for headline dividends to record £90.6bn, up 7% year on year. \nJustin Cooper, chief executive of Shareholder Solutions - part of Capita Asset Services, said: “The gloves came off in the second quarter, as UK plc limbered up to deliver a knockout year in dividends.” \nHe pointed out that much of these gains came from large foreign exchange gains, with the weak pound adding £1.2 billion of gains. \n“Exchange rate gains have come not only for big multinationals declaring dividends in foreign currencies, but also for others with overseas operations, or export sales, supercharging their profits and so their dividends,” he said. \nHowever, even on a constant-currency basis, underlying growth was still impressive at 7.8%, the fastest increase in two years, thanks to a large haul of special dividends and rising profits. \nSpecial payouts of £4.6bn were the second-highest on record for any quarter. This was underpinned by a very large payment from National Grid, which accounted for three quarters of the headline growth rate. \nBy sector, the largest dividends came from financials, but they grew more slowly than the average, despite a very generous payout from Lloyds Banking Group. Growth was particularly strong in the resurgent mining sector, while consumer goods and housebuilders also performed well, with every company raising its payout. EU and Union flags (Image: PA) 8.25 KEY EVENT Motor retailers Addison see profits fall amid impact of Volkswagen emissions scandal \nNorth East motor retailers Addison saw profit margins fall in its first full year of trading as part of the Lookers Group, after being impacted by the Volkswagen emissions scandal, accounts show. \nAddison Motors traded as Benfield until it was acquired by Manchester-based Lookers for £87.5m in cash in September 2015, paving the way for the original management team’s exit from the firm. \nIn its first full year as part of the Lookers Group, the Newcastle firm grew turnover marginally, from £547m to £552m, but said its margins were affected by the 2015 scandal surrounding Volkswagen emissions testing. \nThe German car maker admitted millions of cars were fitted with software which was used to cheat on emissions tests, which led to thousands of cars across the world being recalled, including 1.2m UK diesel vehicles. \nFollowing the firm’s acquisition Lookers disposed of two Toyota dealerships and one Lexus site as they “did not complement the range of franchises and geographical locations of the rest of the Lookers group”. \nLooking ahead, the directors said its current financial year was faring well. Emissions (Image: 2015 Getty Images) 8.20 Coreena Ford Next Boss lord Wolfson critical of Government over Brexit \nNext boss and prominent Leave campaigner Lord Simon Wolfson has criticised the Government for failing to present a clear vision on Brexit, warning that leaving the EU alone does not guarantee success. \nThe Tory peers said he had no regrets over his support for Brexit, but said it was important not to isolate Britain in the process. \nHe said: “The truth is that all of us who voted for Brexit knew this at the time: Brexit in and of itself does not guarantee failure or success. \n“It is the type of Brexit that we make that will determine how successful we are, and as of yet we don’t know really what direction the Government’s going. \n“We desperately need a clear vision, and what I hope is that vision is one of an open, outward looking, tolerant, liberal, Brexit that recognises that we need to control immigration, but also recognises the enormous value that hard working, tax-paying people make to our economy when they come to our country.” Lord Wolfson made the comments on the sidelines of the London ceremony for the 2017 Wolfson Economics Prize, which awarded £250,000 to 27-year-old Hungarian born UCL graduate Gergely Raccuja for his proposed solution to fund and overhaul the UK’s road network. \nWhen asked whether he had any fears that Brexit might discourage foreign nationals from trying to develop ideas to propel Britain’s economic development, Lord Wolfson said he did not expect a change. \nHe added: “The nice thing about ideas is that they can flow across borders regardless of any limitations that people put up.” Lord Wolfson Coreena Ford FCA to probe online investment market \nBritain’s financial watchdog is to investigate the growing online investment market amid competition concerns in the sector. \nThe Financial Conduct Authority (FCA) will look at investment platforms used by consumers and financial advisers to assess whether competition between them is working in the interest of consumers. \nThe regulator pointed out that the platform market has grown rapidly over the last eight years, with assets under administration (AUA) for both adviser and direct platforms increasing from £108bn in 2008 to £500bn in 2016. \nAs part of its probe, the FCA will explore whether platforms help investors make good investment decisions, if they offer investors value for money and ascertain whether the relationships between various platforms work in the interests of investors. \nChristopher Woolard, executive director of strategy and competition at the FCA, said: “With the increasing use of platforms, and the issues raised by our previous work, we want to assess whether competition between platforms is working in the interest of consumers. \n“Platforms have the potential to generate significant benefits for consumers and we want to ensure consumers are receiving these benefits in practice.” 8.10 What's the FTSE latest? \nThe FTSE-100 index opened at 7378.39. \nThe pound at 8am was 1.3095 dollars compared to 1.3077 dollars at the previous close. The euro at 8am was 0.8751 pounds compared to 0.8762 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.05 EasyJet boss Carolyn McCall lands top job at ITV \nCarolyn McCall, the asyJet boss, is to join ITV as chief executive. \nMs McCall, who begins her new role in January 2018, had been the front runner to secure the broadcaster’s vacant top job after Adam Crozier stepped down at the end of June. \nShe will receive an annual salary of £900,000 and a pension allowance of 15% of salary, as well as being eligible for a bonus plan up to a maximum of 180% of salary, and a long-term incentive plan up to 265% of salary. \nITV described it as “broadly the same remuneration opportunity” to Mr Crozier’s. Ms McCall will also receive awards to compensate for remuneration arrangements forfeited on leaving easyJet. \nShe has headed up the low-cost airline since 2010, prior to which she was chief executive of Guardian Media Group. \n“I’m really pleased to be joining ITV. It is a fantastic company in a dynamic and stimulating sector. \n“I am looking forward to getting to know all of the people at ITV and helping it make the most of the amazing opportunities that it has in the future,” she said. \nMs McCall has also been a non-executive director of Burberry since 2014 and sits on the board of the Department of Business, Energy and Industrial Strategy and is a Trustee at the Royal Academy. \nPeter Bazalgette, chairman of ITV, said: “In a very impressive field of high calibre candidates, Carolyn stood out for her track record in media, experience of an international operation, clear strategic acumen and strong record of delivering value to shareholders. I’m delighted we’ll be working together at ITV.” \nMs McCall has been widely praised for her tenure at easyJet and for raising the profile of women in business. In 2016, she was awarded a damehood in the New Year Honours list for services to the aviation industry and decorated with France’s highest merit, the Legion d’honneur. She was presented with an OBE for services to women in business in the 2008 Queen’s Birthday Honours list. easyJet chief executive Carolyn McCall with dancers, at the launch of Moscow flights back in 2013. 8.00 KEY EVENT Carillion calls in accountants EY for business review \nInfrastructure giant Carillion has drafted in accountancy giant EY to help carry out a review of the business as it fights for its survival. \nEY and Carillion will focus on “cost reduction and cash collection” following a torrid seven days for the firm. \nLast week it suffered a dramatic collapse in its share price after announcing a profit warning which saw almost £600m wiped from its value. \nInterim chief executive Keith Cochrane said: \nWe are moving forward quickly with the actions outlined last week. \nAlongside our own efforts, EY will provide support across the business and bring an external perspective to our cost reduction and cash collection challenge. My priorities are to reduce the group’s net debt and create a balance sheet that will support Carillion going forward. \nWe need to simplify the business and demonstrate that value can again be created for shareholders by focusing the group on its core markets, including infrastructure and property services, in which it has good strengths and leading positions. \nCarillion’s market capitalisation has gone into freefall, falling from £826m to around £241m in a matter of days after it warned over earnings and revealed an £845m write-off on construction contracts. \nChief executive Richard Howson stepped down with immediate effect a week ago as the group said it would need to bolster its balance sheet and was struggling to stay within its borrowing limits. \nHe has been replaced by Mr Cochrane on an interim basis while a search is undertaken for a permanent boss. \nIn better news for the firm, Carillion was named among the firms awarded contracts for the building of phase one of the HS2 rail line. \nThe deals are worth £6.6bn in total and will see tunnels, embankments and viaducts constructed between London and Birmingham. Carillion", "external_links": [], "published": "2017-07-17T10:00:00.000+03:00", "crawled": "2017-07-17T13:41:35.010+03:00", "highlightTitle": ""}