{"organizations": [], "uuid": "460e318d35a2f10f8b9b753e9415c2f8010dc4fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13272458.ece/ALTERNATES/s1200/Retail-sales.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/economy-slow-political-uncertainty-limits-13272355", "country": "GB", "domain_rank": 21960, "title": "Economy to slow as political uncertainty limits business investment", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-03T12:47:00.000+03:00", "replies_count": 0, "uuid": "460e318d35a2f10f8b9b753e9415c2f8010dc4fe"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/economy-slow-political-uncertainty-limits-13272355", "ord_in_thread": 0, "title": "Economy to slow as political uncertainty limits business investment", "locations": [], "entities": {"persons": [{"name": "nina skero", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "springfield cars", "sentiment": "none"}, {"name": "centre for economics and business research", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "cebr", "sentiment": "none"}, {"name": "gfk", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Economy to slow as political uncertainty limits business investment Economists are downgrading forecasts for the UK's growth as general election and Brexit worry business community Share High street shoppers (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEconomists have downgraded Britain’s growth prospects in the wake of political uncertainty following the general election and as a prolonged Brexit drag on business investment looms. \nNew forecasts by the Centre for Economics and Business Research (Cebr) show that the UK economy will grow by just 1.3% in 2017, a substantial downward revision from an earlier forecast of 1.7%. \nThe forecast for 2018 has also been revised down to 1.2% from 1.6% in the face of “newly created political uncertainty”, lower business investment because of Brexit and weaker consumer spending. \nIf borne out, this would make 2018 the year with the slowest GDP growth since 2009, the height of the financial crisis. \nConsumers have seen their spending power come under increasing pressure from soaring inflation triggered by the collapse of the pound following Britain’s vote to leave the European Union, which has in turn impacted high street sales. Read More North East businesses ready to make a success of devolution, says CBI leader \nLast week, data from Gfk showed that consumer confidence has collapsed to post-Brexit vote lows. \nAgainst this background, the Cebr believes that the Bank of England will not raise interest rates until the end of 2018, rather than earlier in the year as previously forecast. \nHowever, in brighter news it believes a deal with the EU “will emerge in the coming years” and that confidence will rebound, leading to stronger growth after 2018. \nCebr expects GDP to expand by 1.6% in 2019 and by 1.9% in 2020, upward revisions from pre-election forecasts of 1.5% and 1.8%. \nNina Skero, head of macroeconomics at Cebr, said: “Our data on confidence show that the newly-created political uncertainty is highly likely to weigh on growth in the short term. Read More Springfield Cars sees profits plummet 'challenging' Brexit year \n“This means that we now do not expect an interest rate rise until the end of 2018. \n“But we now think that a deal with the EU on Brexit is more likely than previously seemed which will benefit both the UK and the remaining members of the EU. \n“We have therefore revised up our forecasts for growth for the period from 2019 onwards.” Like us on Facebook", "external_links": [], "published": "2017-07-03T12:47:00.000+03:00", "crawled": "2017-07-03T13:15:48.003+03:00", "highlightTitle": ""}