{"organizations": [], "uuid": "6f899a8643b57eee86159fa7f5a4985d741351f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30421471/16067379.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/brittany-ferries-introduce-extra-bag-checks-and-plain-clothed-security-guards-on-vessels/story-30421471-detail/story.html", "country": "GB", "title": "Paul_Greaves published Brittany Ferries introduce extra bag checks and plain clothed...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-03T18:53:00.000+03:00", "replies_count": 0, "uuid": "6f899a8643b57eee86159fa7f5a4985d741351f4"}, "author": "Paul_Greaves", "url": "http://www.devonlive.com/brittany-ferries-introduce-extra-bag-checks-and-plain-clothed-security-guards-on-vessels/story-30421471-detail/story.html", "ord_in_thread": 0, "title": "Paul_Greaves published Brittany Ferries introduce extra bag checks and plain clothed...", "locations": [], "entities": {"persons": [{"name": "christophe mathieu", "sentiment": "none"}, {"name": "poole", "sentiment": "none"}, {"name": "mathieu", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}, {"name": "brittany ferries", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "pont-aven", "sentiment": "none"}, {"name": "portsmouth", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "roscoff", "sentiment": "none"}], "organizations": [{"name": "brittany ferries", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "plymouth herald", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brittany Ferries introduce extra bag checks and plain clothed security guards on vessels By Paul_Greaves | Posted: July 03, 2017 0 COMMENTS SHARES Brittany Ferries introduce extra bag checks and plain clothed security guards on... X \nCopy link to paste in your message / 1 \nFerry passengers heading to the continent this summer will face extra bag checks as part of new security measures. \nPlain clothes security staff will also be placed on the services run out of Plymouth by Brittany Ferries, it has been revealed. \nThe company says the new measures will be in addition to the French military patrols introduced last year, the Plymouth Herald reported. \nArmed sea marshals were on board the Plymouth to Roscoff return trip just last weekend (July 1/2). \nThe new measures come as the result of a six-month review of on-board security and the introduction of armed military patrols on cross-channel services. \nBut Christophe Mathieu, Brittany Ferries' chief executive, stressed there is no explicit terrorist threat to travellers. \n\"These measures are a prudent step for a responsible ferry operator and I must be clear that they are not in response to any threat,\" he said. \nDuring the first half of 2017 the company has invested in a \"comprehensive and independent\" review of security on board its ships. \nThe review led to a series of recommendations and these are now being implemented across the company's fleet of 10 ships operating on the western channel from Portsmouth, Poole and Plymouth. \nThe move follows the introduction of the first cross-channel \"sea marshal\" patrols on board Brittany Ferries' ships in 2016. \nArmed French military personnel were originally winched on board by helicopter in international waters, but have been travelling from port-to-port including within UK waters since the autumn. \nThey now board, patrol and disembark on foot. \nThe new measures being brought in by Brittany Ferries this summer include the introduction of specialist security personnel who will travel with ships on some services and who may be in plain clothes. \nAdditional bag checks will also be implemented as passengers leave car decks and head to public spaces. \nThe new measures are being implemented ahead of the school holidays and will complement the on-going sea marshal patrols which take place in partnership with the French government. \nPassengers will be kept fully informed of the new measures before they travel, the company said. \nMr Mathieu said: \"We work very closely with the authorities in France and the UK and security is already our highest priority. \n\"But I hope this significant investment will reassure passengers that we are taking all reasonable steps to ensure their journey with Brittany Ferries continues to be as safe as it is enjoyable.\" \nREAD MORE: Residents fight plan for phone mast just 50 metres from previous... \nBrittany Ferries carries up to 2.7million passengers a year and 85 per cent are British. \nIt offers services from Plymouth to Roscoff, in France, and Santander, in pain, on board its ships Armorique and Pont-Aven. \nIn March 2017 the firm reported its best passenger figures for a decade and turnover of 455million euros. \nFollowing its annual meeting in France, the firm, which sails from Plymouth's Millbay docks, has revealed what it calls \"strong passenger and freight figures\" for 2016. \nOverall passenger numbers were up for a fourth consecutive year and despite what the company described as \"challenges presented by Brexit\" it was the company's best performance in a decade. \nIn total, 2,676,500 passengers were carried, a rise of three per cent. \nTurnover was also up 5.2 per cent.", "external_links": [], "published": "2017-07-03T18:53:00.000+03:00", "crawled": "2017-07-04T01:15:13.000+03:00", "highlightTitle": ""}