{"organizations": [], "uuid": "559e2496cf54070369c8d42844a64de8cbf0f901", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13330742.ece/ALTERNATES/s1200/Deal-or-no-Deal.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/deal-no-deal-how-brexit-13330755", "country": "GB", "domain_rank": 21960, "title": "Deal or no deal? How Brexit is becoming a nightmare game show", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-14T12:27:00.000+03:00", "replies_count": 0, "uuid": "559e2496cf54070369c8d42844a64de8cbf0f901"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/deal-no-deal-how-brexit-13330755", "ord_in_thread": 0, "title": "Deal or no deal? How Brexit is becoming a nightmare game show", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "noel edmonds", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "noel", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "phil", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "invalid email", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Opinion Deal or no deal? How Brexit is becoming a nightmare game show Journal business editor Graeme Whitfield on his nightmare Brexit scenario (and his dreams of Noel Edmonds) Share Noel Edmonds (Image: Channel 4) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nI have this recurring nightmare where Theresa May is sat in March 2019 in front of a red cardboard box and a grinning Noel Edmonds asks her: “So, Theresa: no deal or a bad deal?” \nThe Prime Minister is unsure what to do. She faces a choice between giving UK companies access to their largest markets and allowing firms the skilled labour they need, or appeasing the right-wing press and backbenchers who want to reduce immigration and break links with Brussels . \n“Can I have a bit more time to decide?” says Theresa. “I am known for my methodical approach to difficult matters to ensure the right decision is made.” \n“Not really,” laughs Noel, looking at his watch. “The Article 50 process ends in five minutes’ time, and anyway, Come Dine With Me’s on after the break.” \nThe audience likes that – good ol’ Noel. Then the phone rings and the bearded gameshow host picks it up. \n“It’s Michel Barnier,” Noel grins. “He wants to make you an offer.” \nAt this point I usually wake up, which is just as well. Dreams that go into details on friction-free trade and the jurisdiction of the European Court of Justice are too dull even for me. \nThe relative merits of a deal, a bad deal or no deal with Europe are the matter of much debate in the corridors of power. \nMrs May signalled earlier this year that ‘no deal is better than a bad deal’ but her Chancellor said last month that no deal would be a ‘very, very bad outcome’. Read More \nAs they jockey for position in anticipation of the eventual moment when the Conservative Party puts the PM out of her misery, Ministers are taking sides on this half-witted debate. \nFor what it’s worth, I’m siding with Phil. \nFor our automotive industry, for example, which supports tens of thousands of well-paying jobs in the North East, a ‘no deal’ scenario would create havoc in the industry’s complicated supply chains, where parts cross borders numerous times before finally becoming a finished car. \nHavoc is not what businesses like, and they would most certainly look to relocate to the block of 27 nations who haven’t voted for havoc. \nOr take our pharmaceuticals industry, something this region is also rather good at. \nIf you are a big pharma firm, do you invest in a place where there are common regulations in 27 countries covering 450m people or in one nation of 60m? Read More \nIf this sounds like the ranting of an embittered Remoaner, that’s because it is. \nBut being bitter does not make me wrong. \nExtricating ourselves from the EU and achieving a good outcome will be all-but-impossible and require diplomatic skills of the highest level. \nAnd if anyone thinks the current Government has those skills, I suggest they see a doctor forthwith. \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2017-07-14T12:27:00.000+03:00", "crawled": "2017-07-14T13:28:40.016+03:00", "highlightTitle": ""}