{"organizations": [], "uuid": "1843900be1ee0a9e2147071062ef328126b2c39c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i3.leicestermercury.co.uk/incoming/article242689.ece/ALTERNATES/s1200/East-Midlands-AirportJPG.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/east-midlands-airport-announces-25m-242552", "country": "US", "domain_rank": 48128, "title": "East Midlands Airport announces £2.5m improvement package - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.119, "site_type": "news", "published": "2017-07-26T18:05:00.000+03:00", "replies_count": 0, "uuid": "1843900be1ee0a9e2147071062ef328126b2c39c"}, "author": "Lauren Mills", "url": "http://www.leicestermercury.co.uk/news/east-midlands-airport-announces-25m-242552", "ord_in_thread": 0, "title": "East Midlands Airport announces £2.5m improvement package - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "andy cliffe", "sentiment": "none"}], "locations": [{"name": "east midlands airport", "sentiment": "none"}, {"name": "leicester mercury east midlands airport", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "east midlands airport parkway", "sentiment": "none"}, {"name": "east midlands parkway", "sentiment": "none"}, {"name": "derby", "sentiment": "none"}, {"name": "nuneaton", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "share  east midlands airport", "sentiment": "none"}], "organizations": [{"name": "ema", "sentiment": "none"}, {"name": "east midlands rail", "sentiment": "none"}, {"name": "coventry", "sentiment": "none"}, {"name": "the department for transport", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "handmade burger co", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "East Midlands Airport announces £2.5m improvement package The region's biggest airport wants the new East Midlands rail franchise to deliver local benefits Share \nEast Midlands Airport is calling for a change of name for its nearest train station as part of a multi-million pound programme of improvements. Aerial view of East Midlands Airport \nThe airport, which is Leicestershire’s largest and one of the region’s biggest employment sites, wants to see its nearest train station East Midlands Parkway transformed through new services, more frequent trains and better timetabling - through the new East Midlands rail franchise.. Read More Hundreds of jobs saved as Handmade Burger Co sold \nEMA said these improvements will make it easier for people to access the 14,000 jobs that will be created on the airport site over the next 10 years as the airport delivers its plans to double passenger numbers to 10 million, triple the amount of cargo handled to 1 million tonnes and increase its value to the regional economy to £2.5 billion. The East Midlands Parkway Station \nThe £25.5 million East Midlands Parkway station, which was opened in 2009, currently has no service for 45 minutes of every hour and both of its hourly London services leave within seven minutes of each other. \nTo rectify this situation the airport is calling for the proposed new services to Coventry, Nuneaton and Birmingham from Nottingham to stop at East Midlands Parkway as well as the extension of current services that serve Stoke-On-Trent to the station. Read More Joules flouts Brexit woes with huge jump in profits \nThe airport is offering to carry out £2.5 million worth of improvements in return for the renaming of the station to East Midlands Airport Parkway, if these improvements are made. \nEMA’s proposed improvement package includes providing high quality and reliable transport between the airport and the station and installation of the airport’s departure and arrivals boards in the rail station and vice versa. \nThe airport has written to every MP in the region to explain the details of its aspirations. Andy Cliffe, managing director of East Midlands Airport \nAndy Cliffe, managing director of East Midlands Airport, said: “Over the course of the next East Midlands Rail franchise the airport will double the amount of people flying from here, triple the amount of cargo we handle and have three times more people working onsite. \n“To ensure people can access these opportunities we need better rail links to the airport, including new links to areas such as Coventry, Nuneaton and Birmingham as well as more frequent services to Derby, Leicester and Nottingham. Read More 35 new jobs at new Aldi store in Leicestershire - here's how to apply \n“The Department for Transport has made it clear in their consultation documents that they are committed to improving links to the airport and we have announced a £2.5 million Rail Enhancement Package to show how committed we are to these improvements too. \n“The package will deliver improved customer service, direct links between the station and our terminal, provide a better service for our local community and help people access the thousands of jobs we will create during this franchise.” Like us on Facebook ", "external_links": [], "published": "2017-07-26T18:05:00.000+03:00", "crawled": "2017-07-26T18:51:06.002+03:00", "highlightTitle": ""}