{"organizations": [], "uuid": "ef20b6cf6363f13b686ee300ab94f3a38d907ca4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30460059/16093024.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/vince-cable-visits-exeter-and-talks-questionable-pool-project-and-marijuana/story-30460059-detail/story.html", "country": "US", "title": "Vince Cable visits Exeter and talks Brexit, 'questionable' pool project and marijuana | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.143, "site_type": "news", "published": "2017-07-28T15:38:00.000+03:00", "replies_count": 0, "uuid": "ef20b6cf6363f13b686ee300ab94f3a38d907ca4"}, "author": "", "url": "http://www.devonlive.com/vince-cable-visits-exeter-and-talks-questionable-pool-project-and-marijuana/story-30460059-detail/story.html", "ord_in_thread": 0, "title": "Vince Cable visits Exeter and talks Brexit, 'questionable' pool project and marijuana | Devon Live", "locations": [], "entities": {"persons": [{"name": "alex_richar", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "nick harvey", "sentiment": "none"}, {"name": "cllr kevin mitchell", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "st david's community centre", "sentiment": "none"}], "organizations": [{"name": "vince cable", "sentiment": "none"}, {"name": "devon live vince cable", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "devon & cornwall police", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "exeter labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "labour council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Vince Cable visits Exeter and talks Brexit, 'questionable' pool project and marijuana By Alex_Richards | Posted: July 28, 2017 0 COMMENTS SHARES Comments (0) \nSir Vince Cable paid Exeter a visit this week, as part of a tour kick-starting his tenure as leader of the Liberal Democrats. \nSir Cable, well-known and long-serving politician and MP for Twickenham, was elected unopposed for his new position after the General Election. \nAnd while Monday's bustling meet-and greet at St David's Community Centre was primarily around the nationwide and Parliamentary impact of Brexit, he took the opportunity to discuss matters particular to Devon. \nReturn to Devon Live home page or read next: 600-plant cannabis farm found after police stop stolen car \nSpeaking with Devon Live, Sir Cable admits there are hurdles to overcome to bring back Lib Dem presence in the county. \nHe explained: \"It was a mixed result. Nick Harvey, who is a very respected MP in North Devon, fought a very good campaign, came close but lost ground. \n\"And before that, in the County Council elections, we were once very strong on the county, now I think it terms of opposition we now have seven members. \n\"So we have lost ground and mainly as a result of the coalition government and the 2015 election. \n\"Subsequently, under Tim Farron, membership soared to record levels, people quite like what we're doing, but we didn't break through in the election earlier this year I think through a mixture of factors.\" \n\"But I don't think people were ready for the second referendum arguments, people perhaps though we were harking to the past when we're actually looking to the end of the process. \n\"But I'm pretty confident moving forward we're in a much better position.\" \nAlso under Tim Farron, who quit the role as leader on July 14, the party turned heads when they put forward an election pledge to legalise marijuana. \nWith continued rural crime involving cannabis in the county, tackled regularly by Devon & Cornwall Police , Cable says he continues to back the 'common sense and practical' suggestion. \n\"It was actually quite a sensible evidence and medical based,\" he explains, \n\"I understand if people didn't get it and it did lost votes, I think people just thought we were perhaps promoting marijuana in some nostalgic hippy-type spirit – but that wasn't the point at all. It's based on very strong scientific advice. \n\"At the moment a lot of young people are getting into crime, but more seriously into critical medical conditions and psychosis as a result of taking some of the more toxic varieties of cannabis, skunk I think it's called. \n\"The only advice we've had is to take this out of the hands of the criminal underworld because if it remains there the substances are adulterated, the criminals make vast amounts of money and it leads to crime.\" \nOn his arrival to Exeter, he says the Labour council's pool and bus station project was raised regularly - and the sole Lib Dem opposition on the authority, Cllr Kevin Mitchell, has been staunchly opposed to the project's overspend. \n\"This is a £20m project which is now £40m. It's not for me as a National figure to visit and pass judgement on a local project but all the feedback I'm getting from local councillors say that the public are very alarmed by it. \n\"That this is a rather large amount of borrowing for a questionable project. In principle of course, council's should borrow and I'm in favour of that, and what the priority should be is housing. \n\"I just wish councils could use their borrowing powers for social housing in particular. That's where it should be.\" \nSir Cable recently said Brexit may never happen because of the difficulties it will cause, as he promised the Liberal Democrats would welcome \"refugees\" from Labour forced out by Jeremy Corbyn. \nHis view was echoed by Exeter Labour MP Ben Bradshaw, who spoke at length on why he thinks Brexit won't happen in his most recent Devon Live column . \nMr Bradshaw recently said he would \"never, ever leave the Labour Party.\"", "external_links": [], "published": "2017-07-28T15:38:00.000+03:00", "crawled": "2017-07-28T15:37:32.005+03:00", "highlightTitle": ""}