{"organizations": [], "uuid": "1ce74b8dad3282a695c7255bbd4dafd79aec8d2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i3.leicestermercury.co.uk/incoming/article240223.ece/ALTERNATES/s1200/Middletons-Leicester-2.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/leicester-steakhouse-shortlisted-prestigious-design-240164", "country": "GB", "domain_rank": 48128, "title": "Leicester steakhouse shortlisted for prestigious design award - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.579, "site_type": "news", "published": "2017-07-26T11:42:00.000+03:00", "replies_count": 0, "uuid": "1ce74b8dad3282a695c7255bbd4dafd79aec8d2b"}, "author": "Lauren Mills", "url": "http://www.leicestermercury.co.uk/news/business/leicester-steakhouse-shortlisted-prestigious-design-240164", "ord_in_thread": 0, "title": "Leicester steakhouse shortlisted for prestigious design award - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "rickshaw rick", "sentiment": "none"}, {"name": "clare devlin", "sentiment": "none"}, {"name": "steve hutton", "sentiment": "none"}, {"name": "fosse park", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "leicester mercury leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "st martins", "sentiment": "none"}, {"name": "natwest bank", "sentiment": "none"}, {"name": "middletons steakhouse & grill", "sentiment": "none"}, {"name": "natwest", "sentiment": "none"}, {"name": "middletons", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicester steakhouse shortlisted for prestigious design award A restaurant located in the city's historic centre is up for a major design award Share Comments \nA steakhouse located in one of Leicester’s architectural treasures has been shortlisted for a prestigious design award. \nThe Middletons Steakhouse & Grill, at 2 St Martins in the city’s historical heart, underwent a £1.5 million restoration last year, transforming the neglected former banking hall into an iconic 200-seat restaurant. The stunning Middletons restaurant in the former NatWest building in Leicester \nThe restaurant has been nominated by the Restaurant & Bar Design Awards for a category dedicated to restaurants and bars inside heritage buildings in the UK. Read More Joules flouts Brexit woes with huge jump in profits \nMiddletons is one of 265 projects across 33 different categories, on the overall shortlist. It is competing with restaurants and bars from all over the world including the US and Australia. \nSteve Hutton, managing director of Middletons, said: “For the Middletons Steakhouse & Grill to be shortlisted at this stage for an international award is an incredible achievement for our smaller restaurant group.” Middletons' stunning interior \n“I’ve looked through the entire list and there’s examples of some exemplary work. And I’m delighted that our own steakhouse is listed alongside very impressive national and international projects.” Read More Castles, land and Fosse Park! What the Queen 'owns' near you \nThe Restaurant & Bar Design Awards, now in its ninth year, is a globally recognised competition dedicated to the design of food and beverage spaces. \nClare Devlin, the interior designer who coordinated the Middletons Steakhouse & Grill project in Leicester, said: “This has been a fantastic project to work on, and it is a great achievement to be shortlisted for such a prestigious award. The bar area \n“The building’s character and scale definitely made this project very special, particularly the stunning 50ft-high dome and various original features. \n“It is also really satisfying to see this former banking hall fully restored to its former glory, and being enjoyed by the public once again.” Read More Take a look inside new Leicester restaurant Rickshaw Rick's - and it serves dirty shakes and food in a kitchen sink \nAs a result of the extensive restoration, the Grade-II listed building was removed from Historic England’s ‘at risk’ register earlier this year. \nThe former NatWest Bank building dates back to 1900 and had stood empty for 16 years until it was reopened as Middletons Steakhouse & Grill in October 2016. Like us on Facebook ", "external_links": [], "published": "2017-07-26T11:42:00.000+03:00", "crawled": "2017-07-26T14:03:24.000+03:00", "highlightTitle": ""}