{"organizations": [], "uuid": "d266ce24251f0b6f4a1e018a59a6223762b68a0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13410712.ece/ALTERNATES/s1200/business.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/number-distressed-businesses-soars-across-13410581", "country": "GB", "domain_rank": 21960, "title": "Number of 'distressed' businesses soars across the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-31T16:17:00.000+03:00", "replies_count": 0, "uuid": "d266ce24251f0b6f4a1e018a59a6223762b68a0b"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/number-distressed-businesses-soars-across-13410581", "ord_in_thread": 0, "title": "Number of 'distressed' businesses soars across the North East", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "gillian sayburn", "sentiment": "none"}, {"name": "salmon", "sentiment": "none"}, {"name": "begbies", "sentiment": "none"}, {"name": "ted salmon", "sentiment": "none"}, {"name": "begbies traynor", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "fsb", "sentiment": "negative"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "begbies traynor", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Number of 'distressed' businesses soars across the North East The FSB has called for an end to the UK's late payment culture to help firms manage their cash flow Share Gillian Sayburn; Ted Salmon and Jonathan Walker Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusiness leaders in the North East are calling for an end to the country’s “late payment culture” after research found that the number of regional companies in financial distress has soared. \nIn total 6,394 businesses in the North East were classed as being in ‘significant’ distress during the second quarter of 2017, according to insolvency practitioner Begbies Traynor. \nThe figures are 14% higher than three months ago and 23% higher than the same period in 2016. \nThose in significant financial distress have had minor county court judgements (CCJs) filed against them or have showed evidence of market deterioration. \nMore troubling is the increased number of firms in “critical” distress, which grew by 29% compared with the second quarter of 2016. Businesses in critical distress are those who have had winding up petitions or CCJs of more than £5,000 taken out against them. \nTed Salmon, North East regional chair of the Federation of Small Businesses, believes increased costs and late payments are to blame for failing businesses. \nMr Salmon said: “With operating costs for small businesses now at their highest in four years, firms are really starting to feel the squeeze. \n“For many members the increases in overheads have come from higher wage costs and pensions costs. Many are absorbing inflationary pressure by paying themselves less and further increasing prices, leaving all concerned with less discretionary spending power. \n“Then there’s our endemic late payment culture. Servicing debts is challenging in a country where 50,000 small firms are destroyed each year by large suppliers withholding payments.” Read More The Government's rail priorities show that London will always trump the North \nMr Salmon’s views on the effect of rising costs were echoed by the North East England Chamber of Commerce. \nJonathan Walker, the Chamber’s head of policy and campaigns, said: “Our own research suggests businesses are increasingly concerned about rising costs through inflation, which can have a knock-on effect on cashflow. However our overall view is that businesses remain confident about their long-term future. \n“There needs to be adequate support in place for businesses to weather short-term shocks, especially in a period of political uncertainty.” \nNearly every sector in the North East experienced a double digit rise in levels of significant distress year-on-year. Some of the worst affected include: utilities (62%); professional services (56%); media (33%); food and beverages (47%); leisure and cultural (30%); real estate (28%); and industrial (27%). \nOn a national level the number of firms in significant distress grew by 25%, while those in critical distress rose 21%. \nThe figures suggest that North East businesses are feeling the brunt of the harsh economic climate, with the rate of companies entering critical distress outstripping the national average by 8%. Read More Altec Engineering carries out management buyout to save 68 jobs \nGillian Sayburn, director at Begbies Traynor’s Newcastle upon Tyne office, said: “Over the last 12 months, the fragility of the UK economy has become increasingly evident, fuelled by ongoing uncertainty over Brexit and the impact this has on foreign trade and exchange rates, and little seems to have become clearer since the General Election.” \nBegbies said UK sectors relying on consumer spending had been hit the hardest, contributing to a 22% rise in distressed leisure firms. \nSmall-and-medium-sized businesses represented the lion’s share of the struggling companies, though there was still a 12% jump in the number of larger firms feeling the pinch. Like us on Facebook ", "external_links": [], "published": "2017-07-31T16:17:00.000+03:00", "crawled": "2017-07-31T16:48:39.022+03:00", "highlightTitle": ""}