{"organizations": [], "uuid": "0d281e745f514cf1cf718d793a1beb23ff68f795", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30414544/16070037.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/what-are-the-top-150-businesses-in-devon-and-cornwall/story-30414544-detail/story.html", "country": "GB", "title": "Neil_Shaw published What are the top 150 businesses in Devon and Cornwall?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-06T08:15:00.000+03:00", "replies_count": 0, "uuid": "0d281e745f514cf1cf718d793a1beb23ff68f795"}, "author": "Neil_Shaw", "url": "http://www.devonlive.com/what-are-the-top-150-businesses-in-devon-and-cornwall/story-30414544-detail/story.html", "ord_in_thread": 0, "title": "Neil_Shaw published What are the top 150 businesses in Devon and Cornwall?", "locations": [], "entities": {"persons": [{"name": "hanna", "sentiment": "none"}, {"name": "dawson", "sentiment": "none"}, {"name": "goodwin", "sentiment": "none"}, {"name": "chris dawson", "sentiment": "none"}, {"name": "brokenshire", "sentiment": "none"}, {"name": "mark goodwin", "sentiment": "none"}, {"name": "bill martin", "sentiment": "none"}, {"name": "ian brokenshire", "sentiment": "none"}, {"name": "elsie margaret", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "exeter racecourse", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "avonmouth", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "devonport dockyard", "sentiment": "none"}], "organizations": [{"name": "pavey group", "sentiment": "none"}, {"name": "annual business guide", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "kpmg plymouth", "sentiment": "none"}, {"name": "pennon group plc", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "devon colleges group", "sentiment": "none"}, {"name": "finch comments", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "newcross healthcare solutions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What are the top 150 businesses in Devon and Cornwall? By Neil_Shaw | Posted: July 06, 2017 By Hannah Finch Comments (0) \nThe Range empire owned by Devon billionaire Chris Dawson has once again topped the Top 150 list of largest employers in Devon and Cornwall. \nThe discount retailer, with a turnover of £674million, is the biggest employer in the region with 7,910 workers. \nAnd the empire is set to get even bigger with plans under way for more stores in the UK, a new HQ - to be named Elsie Margaret house after Dawson's mum - in Plymouth and the opening of the 1,200,000sq ft distribution mega shed near Avonmouth. \nAnd as the retail mogul dismissed plans to float the business on the stock exchange, he has vowed: \"I'm not going anywhere.\" \n\nThe list of Top 150 companies was revealed at the launch of the Western Morning News Annual Business Guide 2017 yesterday. \nSponsored by the University of Exeter , data compiled by KPMG and with associate sponsors Devon Colleges Group and Pavey Group , the Annual Business Guide acts as a barometer for every sector and geographical area right across the region. \nIn launching the guide at a preview at Exeter Racecourse yesterday, Bill Martin, editor Western Morning News, said the guide was a showcase for the region and a key part of the #BackTheSouthWest campaign, designed to take a unified message to the government. \nHe said: \"There is no slowdown in the Westcountry's ambition, therefore there is no appetite for indecision. \n\"Our businesses are progressive, ambitious, and are producing levels of growth and quality that any area of the country would be proud of. \n\"The region, with the Western Morning News as its cheerleader, will continue to make its voice heard to ensure that we all, and the powers that be, really do Back the South West.\" \nAlso in the top five are Exeter-based Pennon Group PLC , Devonport Dockyard in Plymouth, Newcross Healthcare Solutions in Totnes and Princess Yachts in Plymouth. \nTogether, the Top150 have a total turnover of £10.7billion and employ 78, 017 people - 3,000 more than last year. \nIan Brokenshire, senior partner at KPMG Plymouth compiled the list. \nIt is based on accounts filed to Companies House by May 19, includes companies headquartered in Devon and Cornwall and is ranked by the number of employees. \nHe said that 90% of named businesses are non-movers suggested a level of stability among the major employees in the two counties. \nThe sector dominating is manufacturing and retail and is mostly made up of entrepreneurial, family and privately owned companies. \nHe said: \"It is a fascinating list and a great snapshot of the south west business trends.\" \nPredicting the years ahead, Mr Brokenshire said that there would be an increase in inward investment and changes brought with the development of technology, artificial intelligence and social media. \nProf. Mark Goodwin, deputy vice chancellor for Innovation and External Engagement at the University of Exeter, said the region has to improve innovation, investment and raise productivity. \n\"Productivity in the South West is still only around 81% of the UK average and if were to close that gap, it would mean £11,500 more a year for every household.\" \nThe university, which contributes £600million to the regional economy and works on 1,000 projects with businesses each year, has identified that marine, aerospace, energy and environmental data will become strong growth sectors in the near future. \nProf. Goodwin said: \"The world is becoming more and more skilled, our businesses need those skilled workers and the graduates are central to providing those skills.\" \nBut the challenges of Brexit brings uncertainty for EU research funding, the future of talented overseas staff and the ability to attract students to the university. \nHe also called for the region to stand together on the #BackTheSouthWest campaign. \nHe said: \"This is not about Devon vs Cornwall, this is about ensuring that whatever money is available in the UK comes to the South West rather than Manchester or the West Midlands, which have got themselves far better organised than the South West has. \n\"This is about us working together to drive economic growth that the whole region will benefit from.\" The Top 150 list ", "external_links": [], "published": "2017-07-06T08:15:00.000+03:00", "crawled": "2017-07-06T10:00:08.001+03:00", "highlightTitle": ""}