{"organizations": [], "uuid": "394d35cb8d5a84bdbcbca82ef1d0713dcf5d3c47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30440696/16080748.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/drop-passivhaus-from-st-sidwell-s-point-exeter-civic-society-urges-council/story-30440696-detail/story.html", "country": "GB", "title": "Alex_Richards commented Civic society in shock call for council to 'pull the plug on...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-14T18:37:00.000+03:00", "replies_count": 0, "uuid": "394d35cb8d5a84bdbcbca82ef1d0713dcf5d3c47"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/drop-passivhaus-from-st-sidwell-s-point-exeter-civic-society-urges-council/story-30440696-detail/story.html", "ord_in_thread": 0, "title": "Alex_Richards commented Civic society in shock call for council to 'pull the plug on...", "locations": [], "entities": {"persons": [{"name": "peter wadham", "sentiment": "none"}, {"name": "wadham", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "cllr andrew leadbetter", "sentiment": "none"}, {"name": "cllr pete edwards", "sentiment": "none"}, {"name": "phil bialyk", "sentiment": "none"}, {"name": "cllr leadbetter", "sentiment": "none"}, {"name": "cllr phil bialyk", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "ecs", "sentiment": "none"}, {"name": "exeter conservatives", "sentiment": "none"}, {"name": "ramm", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "exeter civic society", "sentiment": "none"}, {"name": "st sidwell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Civic society in shock call for council to 'pull the plug on Exeter's passivhaus pool' By Alex_Richards | Posted: July 14, 2017 1 COMMENTS SHARES Comments (1) \nExeter Civic Society has boldly called for the council to drag their leisure centre plans back to the drawing board. \nThe influential group has nailed its colours to the mast over the bus station and leisure centre project which, if rubber stamped by a meeting of the full council on Wednesday , will now cost the city nearly £40m. \nReturn to Devon Live home page or read next: Here's the three choices on the table for Exeter's massively over budget pool and bus scheme \nThe call comes as a surprise, especially to the Exeter City Council, who have reminded the society they have backed the project and once even referred to the \"outstanding design\" of St Sidwell's Point. \nHowever, Peter Wadham, president of Exeter Civic Society and former Lib Dem city councillor and portfolio holder, believes the recent cost uplift is the final straw. \nMr Wadham, on behalf of ECS's executive committee, said: \"We urge the leader of Exeter City Council Cllr Pete Edwards and Cllr Phil Bialyk that it is now time to pull the plug on the proposed Passivhaus Swimming Pool and Leisure Centre. \n\"Now that the tenders are in at a price almost twice the original estimates, we believe it is time to say enough is enough. Back to the drawing board for a simpler design and a pool that everyone wants at a price Exeter can afford without more borrowing. \n\"To say we have done our best but now its time for fresh designs and thought would be a brave move which would be fully respected.\" \nMr Wadham added: \"The bravest thing is to know when to stop, and to come out of this with dignity. Not that many years ago we saw the cost of the RAMM redevelopment spiral and the same thing is happening again. \n\"We just want the best for the city. We are not NIMBYs, we want Pyramids to be sorted and replaced - but this is too much. Exonians would respect the council if it dropped passivhaus in favour of a cheaper design.\" \nCllr Phil Bialyk, Exeter's lead councillor with responsibility for bus station redevelopment, said: \"The design of the leisure centre has been through the planning process and we certainly won't be redesigning it now. \n\"This is a striking, landmark building of real quality, which will be a major asset to Exeter. It will add to the viability of the city centre - where 20,000 people work - for many decades to come. \n\"It was a key manifesto commitment for the Labour Party to deliver a new leisure complex and bus station, and that is what we fully intend to do. \n\"The benefits of Passivhaus are well known, and the saving in energy costs in the long term is massive. Exeter is leading the way in the use of Passivhaus to save energy, are we are proud to do so. \n\"It is very surprising to hear Exeter Civic Society now complain about the design of the leisure complex. When it gave its formal response to the planning application, it described St Sidwell's Point as an 'outstanding building' which matches 'the expectation for a landmark building on this prominent entry site to the city'. \n\"It praised the 'handsome and striking external envelope' which contains the provisions for 'very varied leisure activities' making it a 'flagship building'. \n\"It specifically praised the Passivhaus standards of the building, and the fact that the swimming pool waters will be chlorine free. It concluded that 'a standard has now been set'. \nHe added: \"A standard has been set, and it is a standard that we fully intend to maintain.\" \nThe cost of St Sidwell's Point now stands at £33.05m, with the replacement bus station an additional £6.87m. The costs estimated at the time the planning applications were approved were £26m and £6.25m. But the council is not blaming passivhaus for the coast. instead they heavily tendering the works in the \"uncertain period\" after the Brexit vote\nProject leader Phil Bialyk defended the choice to build St Sidwell's Point to passivhaus standards, saying: \"If we have a problem here in Exeter I believe its the fact we are quite aspirational, and we want the best things for our city. \n\"Passivhaus would bring an environmentally better future for Exeter. If something tells me that I am going to reduce my energy bills by 70 per cent I want to take a look at that. \n\"I applaud the project team, because this will be environmentally the best for Exeter. And in 20-30 years when people will have to start retro fitting, we will be ahead of that.\" \nExeter Civic Society aren't the only ones unhappy with the rise in budget. Conservative Party opposition in the city say they are \"flabbergasted.\" \nCllr Andrew Leadbetter, leader of Exeter Conservatives, said: \"We are absolutely flabbergasted. We thought this project was expensive before, now it is nearly £40m and they haven't even started building it. \n\"The city council has spent nearly £4m for consultancy fees already, and hasn't got a bucket of water to show for it. \n\"The Tories in Exeter have always agreed that we need a new pool, but we were unhappy with the original proposal of £18m.\" \n\"It is time for a rethink this vanity project of theirs, and we really call upon Labour members to think about what is best for our city. This is a crazy amount of money to spend on a project and we'd see no other projects funded in the city.\" \nCllr Leadbetter added: \"The council must have Jeremy Corbyn's 'Magic Money Tree' growing somewhere.\" \nWe will be covering the full meeting of Exeter City Council live from 6pm on Wednesday . ", "external_links": [], "published": "2017-07-14T18:37:00.000+03:00", "crawled": "2017-07-14T20:31:15.009+03:00", "highlightTitle": ""}