{"organizations": [], "uuid": "88ee3ee8ae47129c4ae3585896a18d9cc90eaaee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11875670.ece/ALTERNATES/s1200/JS60287380.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-makes-largest-ever-acquisition-13387467", "country": "GB", "domain_rank": 21960, "title": "Sage makes largest ever acquisition with deal to buy US fintech firm for £654m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-26T14:25:00.000+03:00", "replies_count": 0, "uuid": "88ee3ee8ae47129c4ae3585896a18d9cc90eaaee"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-makes-largest-ever-acquisition-13387467", "ord_in_thread": 0, "title": "Sage makes largest ever acquisition with deal to buy US fintech firm for £654m", "locations": [], "entities": {"persons": [{"name": "intacc", "sentiment": "negative"}, {"name": "stephen kelly", "sentiment": "none"}, {"name": "mr kelly", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "intacct", "sentiment": "none"}], "organizations": [{"name": "£654m sage", "sentiment": "neutral"}, {"name": "sps", "sentiment": "none"}, {"name": "sage business cloud", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "sage payment services", "sentiment": "none"}, {"name": "invalid email  newcastle", "sentiment": "none"}, {"name": "gtcr", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "intacct", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sage makes largest ever acquisition with deal to buy US fintech firm for £654m The deal to by Intacct comes a month after Sage sold its North American payments arm Share Stephen Kelly, the CEO of Sage Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle technology giant Sage is investing £654m in North America after revealing it is set to buy US fintech business Intacct. \nThe move to acquire Intacct, which employs more than 450, is meant to strengthen Sage’s position in the cloud computing space and boost the firm’s presence in the US. \nIntacct specialises in cloud financial management solutions to businesses in North America. Last year the California firm made £68m in revenue, 90% of which is based on subscriptions. \nCommenting on the acquisition, Sage CEO Stephen Kelly said: “Today we take another major step forward in delivering our strategy and we are thrilled to welcome Intacct into the Sage family. \n“The acquisition of Intacct supports our ambitions for accelerating growth by winning new customers at scale and builds on our other cloud-first acquisitions, strengthening the Sage Business Cloud. Intacct opens up huge opportunities in the North American market, representing over half of our total addressable market.” \nThe deal is worth $850m (£654m), which will be paid in cash and rolled over Sage options. Read More Newcastle tech giant Sage sells North American Payment arm for over £200m \nSage’s acquisition of Intacct is expected to be completed “within weeks”. It comes a month after Sage sold its North American payments business, Sage Payment Services (SPS), to private equity firm GTCR for £202m. \nAt the time, Mr Kelly said the decision to sell SPS had come after the tech giant outlined a new payments and banking strategy which included “exiting areas of the payments market where the strategic fit is not as strong as the rest of the business”. \nThe UK firm issued a trading statement alongside its takeover announcement, saying group organic revenue rose 6.3% in the third quarter. That number dropped to 5.6% when including figures for SPS. \nIt added that its results have been “positively impacted” by exchange rate movements following the Brexit vote, which sent the pound tumbling against major global currencies. Sage has confirmed its full-year guidance, which forecasts 6% organic revenue growth. \nAfter an initial increase share’s in Sage surged to 711p this morning. However, at the time of writing the tech firm’s shares have fallen to 672p. At close of trading yesterday the shares stood at 700.5p, meaning their value has fallen by 4%. Like us on Facebook", "external_links": [], "published": "2017-07-26T14:25:00.000+03:00", "crawled": "2017-07-26T15:07:49.001+03:00", "highlightTitle": ""}