{"organizations": [], "uuid": "46cb9a6396599dae12e6f3818a736d9bf0c78057", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13312105.ece/ALTERNATES/s1200/JS122181628.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-mp-delivers-verdict-theresa-13312099", "country": "GB", "domain_rank": 21960, "title": "Newcastle MP delivers her verdict on Theresa May's first year as Prime Minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-11T07:00:00.000+03:00", "replies_count": 0, "uuid": "46cb9a6396599dae12e6f3818a736d9bf0c78057"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-mp-delivers-verdict-theresa-13312099", "ord_in_thread": 0, "title": "Newcastle MP delivers her verdict on Theresa May's first year as Prime Minister", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "theresa may app", "sentiment": "negative"}, {"name": "chuka umunna", "sentiment": "none"}, {"name": "caroline lucas", "sentiment": "none"}, {"name": "jo swinson", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "mitchell", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "guy verhofstadt", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew mitchell", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "brexit share get", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "european union parliament", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "euratom", "sentiment": "none"}, {"name": "eu relations", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle MP delivers her verdict on Theresa May's first year as Prime Minister Theresa May appeals to opposition parties for help as she comes under fire from all sides over Brexit Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Prime Minister Theresa May (Image: PA) \nTheresa May’s first year as Prime Minister has been an “unmitigated disaster” according to a North East MP. \nMrs May celebrates – if that’s the right word – a year in Number 10 tomorrow. \nAnd she is insists that despite losing her Commons majority in June’s general election, she intends to stay in the role if she can. \nBut Newcastle North MP Catherine McKinnell said the Prime Minister had failed to deliver any benefits to the North East. \nShe said: “I am genuinely struggling to think of one thing Theresa May has delivered for our region over the last 12 months. \n“We were promised a Government that would tackle burning injustice and would provide strong and stable leadership. Instead, we have a society more unfair and divided than ever before, and a weak and unstable Government, reliant on the DUP to prop it up – all at a crucial time in our country’s history. \n“The last year has been an unmitigated disaster for Theresa May, and it’s clear her Government has absolutely nothing to offer the people of the North East.” Labour candidate for Newcastle North, Catherine McKinnell wins (Image: Newcastle Chronicle) \nMrs May is insisting she remains committed to the values she set out in a speech when she first became Prime Minister. \nShe said yesterday she is determined “to address difficult issues and take big decisions in the long-term interests of Britain, so that we emerge from this period of great national change stronger and better able to seize the opportunities ahead as we fulfil the promise of Brexit together.” \nBut she has also invite opposition parties to work with the Government and “come forward with your own views and ideas” about how to make the country fairer. \nThe Prime Minister’s call for cross-party unity strikes a very different tone to comments she made before the general election, when she said a poll was needed because opposition parties were trying to block Brexit. \nThe weakness of her position was illustrated by reports that former Conservative chief whip Andrew Mitchell told a dinner that the Prime Minister was “dead in the water”. Mr Mitchell has described the reports as “overheated”. \nAnd the general election result has encouraged those MPs who believe the Government could be pressured into delivering a softer version of Brexit. \nMinisters appear to believe the Government is vulnerable to defeats on the issue, and it was reported that a flagship Brexit bill is to be delayed until the autumn. \nThe Repeal Bill, which will bring existing EU laws and directives into UK law, may not come before the Commons for a vote until October at the earliest, because of fears that \nrebel Conservative MPs could join with Labour to demand key concessions. \nMPs pushing for a softer Brexit have formed a new cross-party group to help co-ordinate their efforts. \nAnna Soubry, a former Tory minister, and Chuka Umunna, the former Labour shadow business secretary, are leading the new All-Party Parliamentary Group on EU Relations. Green Party leader Caroline Lucas, Lib Dem deputy leader candidate Jo Swinson and MPs from the SNP and Welsh party Plaid Cyrmu are also involved. \nNine Conservative MPs have also come out against Government plans to quit the European nuclear body Euratom, following claims that thousands of cancer patients could face delays to their treatment as a result. \nThe agency is not part of the EU but is under the jurisdiction of the European Court of Justice, which is why the Government says the UK should leave as part of the Brexit process. \nEuratom governs the movement of radioactive material around Europe, and some medical professions say that pulling out threatens the supply of imported radioactive isotopes which are used in cancer scans and treatment. \nAnd the Prime Minister is under pressure from the European Union Parliament to improve the Government’s offer to EU citizens currently living in the UK. \nEuropean Parliament chief Brexit negotiator Guy Verhofstadt has complained that the Government’s offer to allow EU citizens who have lived in the UK for five years to live and work here forever without restriction “carries a real risk of creating second-class citizenship”. \nHe also said EU citizens living in the UK who feel their rights have been infringed should be able to appeal to EU courts. He said: “While we have the greatest respect for the British legal system, courts apply the laws adopted by British politicians, who are currently unable to give sufficient guarantees for the years to come, let alone for a lifetime. \nThe Brexit issue will dominate Mrs May’s remaining time in office. How long that will be is anyone’s guess. But the chances of her completing a second year look, at best, average. Like us on Facebook", "external_links": [], "published": "2017-07-11T07:00:00.000+03:00", "crawled": "2017-07-11T07:28:22.000+03:00", "highlightTitle": ""}