{"organizations": [], "uuid": "d85cd14a95fe55d482d9b3c7036c1d593134c054", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13088684.ece/ALTERNATES/s1200/jackson.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-mayor-could-elected-13309430", "country": "GB", "domain_rank": 21960, "title": "North of Tyne mayor could be elected in 2018 to serve Newcastle, Northumbria and North Tyneside", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T18:00:00.000+03:00", "replies_count": 0, "uuid": "d85cd14a95fe55d482d9b3c7036c1d593134c054"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-mayor-could-elected-13309430", "ord_in_thread": 0, "title": "North of Tyne mayor could be elected in 2018 to serve Newcastle, Northumbria and North Tyneside", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "dawson", "sentiment": "none"}, {"name": "peter jackson", "sentiment": "none"}, {"name": "steve rotherham", "sentiment": "none"}, {"name": "coun jackson", "sentiment": "none"}, {"name": "hilton dawson", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "andy street", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "andy burnham", "sentiment": "none"}], "locations": [{"name": "northumbria", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "liverpool city region", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "north east party", "sentiment": "none"}, {"name": "tyne combined authority", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "employment and skills", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "northumberland council", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "combined authority", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North of Tyne mayor could be elected in 2018 to serve Newcastle, Northumbria and North Tyneside Leader of Northumberland County Council reveals he wants a mayor to serve Newcastle, Northumbria and North Tyneside Share Peter Jackson is the new leader of Northumberland County Council Share Get daily   Thank you for subscribing!   \nA “North of Tyne” mayor could be elected in May 2018, the leader of Northumberland County Council has revealed. \nThe mayor would serve residents in Northumbria, Newcastle and North Tyneside. \nAnd they would lead a new Combined Authority for the three council areas north of the Tyne. \nOne of the aims would be to secure extra funding from the Government, in a similar way to funding deals already in place for Greater Manchester, the Liverpool City Region and the West Midlands. \nPeter Jackson, leader of Northumberland Council and a Conservative councillor, said in a letter: “As the now leader of the council, both I and the council’s Conservative administration are committed to securing a devolution deal for the North of Tyne and subsequently moving to the creation of a North of Tyne Combined Authority as quickly as possible - and with a view, if at all possible, to holding the mayoral election in May 2018. Peter Jackson \n“To this end, I’m working closely and constructively with my equivalents at both Newcastle and North Tyneside in negotiating with Government to secure the best deal we can for our residents and businesses.” \nIt follows the May 2017 local elections in which the Conservatives replaced Labour as the largest party on Northumberland Council. \nDespite his upbeat assessment, there is currently no agreement with Government on a devolution deal for the three councils, and no mayoral election date. Read More Brexit breakfast alert: A hard brexit could slap £3 on the cost of a full English for families \nHowever, Ministers are keen to attempt to agree a deal, after attempts to negotiate a wider North East agreement fell through. \nCoun Jackson made the comments in a letter to an activist in the North East Party, which is led by former MP Hilton Dawson. Hilton Dawson \nMr Dawson said any “North of Tyne” mayor must be powerful and offer value for our money. \nAnd he urged councils planning a mayor to “dare to put proposals to the test by holding a referendum throughout Northumberland, North Tyneside and Newcastle this Autumn”. \nThe Government previously attempted to agree a devolution with the North East Combined Authority which included an infrastructure fund of £30m per year for 30 years, making £900 million in total. \nIt would have given the authority and mayor bus franchising powers, strategic planning powers, joint responsibility for an Employment and Skills board and devolved skills funding for adults aged over 19, \nHowever, this proposal fell through when Gateshead, Sunderland, Durham and South Tyneside councils declined to press ahead. \nLocal Government Secretary Sajid Javid said he was keen to agree a deal with Newcastle, Northumberland and North Tyneside, the three councils that appeared most enthusiastic about the proposals. Communities Secretary Sajid Javid (Image: PA) \nCritics of the Government’s devolution deals have argued that the amount of money on offer is small, considering it is spread out over 30 years. \nAnd this criticism has been given extra weight after the Government announced a £1 billion deal for Northern Ireland, in return for the support of 10 MPs from the Democratic Unionist Party. \nThere was also opposition to the Government’s insistence that the money would only be available if councils agreed to the creation of a directly elected mayor. \nOther regions pressed ahead with mayoral elections earlier this year. Labour’s Andy Burnham leads Greater Manchester, Labour politician Steve Rotherham is mayor of Liverpool City Region and Conservative Andy Street, former Managing Director of John Lewis, is mayor of the West Midlands. Greater Manchester Mayor Andy Burnham (Image: PA) Like us on Facebook", "external_links": [], "published": "2017-07-10T18:00:00.000+03:00", "crawled": "2017-07-10T18:31:26.000+03:00", "highlightTitle": ""}