{"organizations": [], "uuid": "792371c6bb77d1b10a3fe31db40b92128d56f61c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30423002/16068528.jpg", "site_section": "http://www.middevongazette.co.uk/business.rss", "section_title": "Devon Live Business RSS feed", "url": "http://www.devonlive.com/nine-things-westcountry-drivers-know-about-the-a361-north-devon-link-road/story-30423002-detail/story.html", "country": "GB", "title": "Ten things Westcountry drivers know about the A361 North Devon...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-04T15:06:00.000+03:00", "replies_count": 0, "uuid": "792371c6bb77d1b10a3fe31db40b92128d56f61c"}, "author": "Patrick Phelvin", "url": "http://www.devonlive.com/nine-things-westcountry-drivers-know-about-the-a361-north-devon-link-road/story-30423002-detail/story.html", "ord_in_thread": 0, "title": "Ten things Westcountry drivers know about the A361 North Devon...", "locations": [], "entities": {"persons": [{"name": "patrick phelvin", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "meashaw", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "massey ferguson", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "south molton", "sentiment": "none"}, {"name": "kidderminster", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bampton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "taunton", "sentiment": "none"}, {"name": "bideford", "sentiment": "none"}, {"name": "north devon link road", "sentiment": "none"}], "organizations": [{"name": "volkswagen", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ten things Westcountry drivers know about the A361 North Devon Link Road By Patrick Phelvin | Posted: July 04, 2017 0 COMMENTS SHARES Drivers experience many frustrations on the A361 Ten things Westcountry drivers know about the A361 North Devon Link Road X \nCopy link to paste in your message / Comments (0) Whisper it quietly but improvements to the notorious North Devon Link Road might actually happen. Despite the doom and gloom around Brexit the Government has found £250m to make the road safer and faster by adding overtaking lanes between Tiverton and Bideford and improving junctions. No, it's not a full dualling, but for plenty of us it is a reason to be cheerful. Veteran A361 driver Patrick Phelvin rounds up 10 things we all know about the link we love to hate. 1. It would be safe if it wasn't for the idiots \nUnfortunately the road has a shocking safety reputation, with several fatal crashes over the last few years. And those who drive on it regularly will know it's not the road that's dangerous but a few morons who risk their necks, and others', to arrive at their destination no more than three minutes earlier by trying to overtake when they haven't got enough space to do so. 2. It doesn't make any difference how fast you drive \nThis is the road to North Devon, why are you in a hurry? Stick some tunes on, admire the views as you ride over the top of Exmoor and before you know it you'll get there, the guy in the BMW who roared past you half an hour ago will be precisely 200 yards in front, with his blood pressure rising as a 1989 Massey Ferguson makes its way to South Molton market. Farmers think nothing of taking a haybale or a sow for an 8mph trundle between junctions at rush hour and think anyone who complains is a mug – they might be right, this is Devon after all. 3. You wait ages for an overtaking lane, then it gets hogged by an HGV \nMost of the overtaking lanes are uphill, which makes you wonder why the selfish lorry driver who wants to travel 1mph faster than the one in front of him thinks it's OK to pull out and deprive 50 car drivers from the opportunity to overtake before it's down to one lane again. But they do – every time. Devon County Council plans £250m link road upgrade 4. Cyclists on the road \nYes, we all know it's not a motorway, and you have every right to pedal yourselves, lithe and lycra-clad bodies up and down to your heart's content but it just looks so wrong. OK, so it's only occasionally you see cyclists on the road at all, but the fact that any choose to risk their necks on a busy and polluted route when there is cycling paradise on each side never ceases to amaze me. 5. Night-time closures \nIt's late, you just want to get home, and to your horror you realise there's night-time resurfacing – cue several hours of peering into the gloom and trying to navigate a diversion that takes in 50 hamlets and villages with names like Meashaw and Alswear. Before you reach the comforts of a warm bed you must negotiate 3,568 insane bends on unlit and potholed roads. 6. The official diversions are just for tourists \nSomeone with a sick sense of humour organises link road diversions to take in as many places as possible and roadworkers just love to leave a \"road closed\" sign out. Fortunately any driver with half a brain, a little bit of nerve and a bit of local knowledge can figure out a route that's half the distance. 7. It's worth a lot to the tourism industry \nOn Friday the northbound carriageway will be full of shiny Volkswagen T5's piloted by not very good surfers from Surry who work in hedge funds or marketing and caravans towed by the semi-retired of Kidderminster. Devon folk might grumble about the traffic but secretly we love the fact that all these people think so highly of our county that they're prepared to endure the end of week A361 mayhem. 8. It's the one topic of conversation that every North Devon resident can join in on \n\"They should have dualled it in the first place\" is a favourite North Devon catchphrase. The accepted wisdom is that there was a missed opportunity in 1988 to build a proper dual carriageway, and since then the region has been failed by various transport ministers. There are, however, those who regret the fact that it was ever built before. If you subscribe to this school of thought I suggest you try driving on the old route – from Taunton through Bampton to South Molton. Now the B3227, it's a lovely winding route but takes so long you can physically feel yourself ageing between towns. 9. Big wildlife \nA busy A-road through one of the wildest parts of countryside in the UK was always going to cause conflict between fast metal things and the furry or feathered. You can keep your hedgehogs for the suburbs, link road animals have the ability to stop traffic, cause serious injury or even kill. It's not unusual to see wild boar, deer and large birds on the carriageway. Fortunately Devon drivers are made of stern stuff and quite used to animal-wrangling, like these ladies who took it upon themselves to remove an injured swan from the central reservation. 10. When they actually get on with the work, it will be a complete and utter nightmare \nHave you seen how much of a fuss they have made of the Barnstaple roundabout upgrade? And that project pales into insignificance when you see what's proposed by highways engineers. Before we have miles of lovely smooth overtaking lanes we are going to go through pain, a lot of pain. The improvements will take longer than planned and cost more than £250m – fact.", "external_links": [], "published": "2017-07-04T15:06:00.000+03:00", "crawled": "2017-07-04T18:37:28.025+03:00", "highlightTitle": ""}