{"organizations": [], "uuid": "4e450cc2c715288ae998fbbddea4bcf75febf84e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/mike-ashleys-sports-direct-expected-13333875", "country": "GB", "domain_rank": 21960, "title": "Mike Ashley's Sports Direct expected to show slump in profits", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-14T18:02:00.000+03:00", "replies_count": 0, "uuid": "4e450cc2c715288ae998fbbddea4bcf75febf84e"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/mike-ashleys-sports-direct-expected-13333875", "ord_in_thread": 0, "title": "Mike Ashley's Sports Direct expected to show slump in profits", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "mike", "sentiment": "none"}, {"name": "dave forsey", "sentiment": "none"}, {"name": "bob", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}, {"name": "nicholas hyett", "sentiment": "none"}], "locations": [{"name": "liberum", "sentiment": "none"}, {"name": "shirebrook", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "hargreaves lansdown", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "eastern mountain stores", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Mike Ashley's Sports Direct expected to show slump in profits The Newcastle United owner's company has had a difficult year and is expected to see a dip in profits Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMike Ashley’s Sports Direct is expected to reveal a slump in profits this week after an eventful year for the scandal-hit retailer and following the tycoon’s high-profile court battle. \nAnnual results for the company on Thursday are forecast to show a painful hit from the pound after it was left exposed to sterling’s plunge following the Brexit vote . \nAnalysts at Liberum are expecting the results to show underlying pre-tax profits more than halving to £126m from £275m the previous year. \nSports Direct warned after last June’s EU referendum that profit would be hit because it failed to hedge against the fall in sterling in the immediate aftermath of the vote. \nThis was borne out in half-year results when pre-tax profits slumped 57% to £71.6m. \nThe group has also cautioned of more profits woes to come as its key hedging position expired at the end of April, with no hedge in place for the following financial year. \nIts financial troubles have come amid a storm of controversy surrounding Sports Direct and Mr Ashley . \nThe 52-year-old Newcastle United owner has been embroiled in a court case this summer with an investment banker over a £15m deal allegedly struck in a London pub. \nThe case provided a steady stream of headlines as lurid details were revealed of heavy drinking sessions and business meetings held in pubs. \nThe judge presiding over the case is expected to deliver a verdict imminently. Read More Mike's Ashley's Sports Direct snaps up 26% stake in struggling Game Digital \nIt comes as Sports Direct looks to recover from the damage to its reputation after allegations last year over working practices at its Shirebrook headquarters, with Mr Ashley hauled before MPs for a grilling. \nA shambolic 2016 also saw it host a tumultuous “open day” at its headquarters, and its chief executive Dave Forsey quit - only to be replaced by Mr Ashley - followed by a string of other senior departures. \nBut the group has sought to fight back, with Mr Ashley snapping up a raft of stakes in struggling high street firms, most recently a 26% stake in struggling Game Digital. \nIt comes as part of Mr Ashley’s plans to become the “Selfridges of sports retail”, with shareholdings also held in Debenhams, French Connection and Findel. Read More Mike Ashley waiting for verdict on multimillion pound High Court battle \nSports Direct has also spent £100m on entering the US market, with the acquisition of 50 stores under the Bob’s Stores and Eastern Mountain Stores brands. \nNicholas Hyett, equity analyst at Hargreaves Lansdown, said the City will have “plenty to get our teeth into” with the full-year results. \n“We’ve had no update on how either the new strategy or the recent acquisitions have been faring since they were announced,” he said. Like us on Facebook", "external_links": [], "published": "2017-07-14T18:02:00.000+03:00", "crawled": "2017-07-14T19:10:09.005+03:00", "highlightTitle": ""}