{"organizations": [], "uuid": "c3aaa262e6748c3b58a652e223d967cbd6344386", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30419083/16065753.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/here-s-the-reaction-to-the-news-exeter-city-council-s-pool-project-is-over-budget-by-nearly-8m/story-30419083-detail/story.html", "country": "GB", "title": "Rich_Booth published Here's the reaction to the news Exeter City Council's pool...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-01T20:00:00.000+03:00", "replies_count": 0, "uuid": "c3aaa262e6748c3b58a652e223d967cbd6344386"}, "author": "Rich_Booth", "url": "http://www.devonlive.com/here-s-the-reaction-to-the-news-exeter-city-council-s-pool-project-is-over-budget-by-nearly-8m/story-30419083-detail/story.html", "ord_in_thread": 0, "title": "Rich_Booth published Here's the reaction to the news Exeter City Council's pool...", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "cllr andrew leadbetter", "sentiment": "none"}, {"name": "phil bialyk", "sentiment": "none"}, {"name": "pete edwards", "sentiment": "none"}, {"name": "graham steer", "sentiment": "none"}, {"name": "stuart hughes", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cllr leadbetter", "sentiment": "none"}, {"name": "sherry delnevo", "sentiment": "none"}, {"name": "cllr kevin mitchell", "sentiment": "none"}], "locations": [{"name": "seagullsimon", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "exeter city", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "exeter city council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "ecc", "sentiment": "none"}, {"name": "exeter conservatives", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "dcc", "sentiment": "none"}, {"name": "transportation", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Here's the reaction to the news Exeter City Council's pool project is over budget by nearly £8m By Rich_Booth | Posted: July 01, 2017 0 COMMENTS SHARES Comments (0) \nThe people of Exeter and a leading Devon councillor have taken to social media and the comments section to react to the news revealed this morning that Exeter City Council's planned leisure complex will be over budget by nearly £8million. \nIn an announcement at 10am on Saturday the city council called on councillors to approve an \"uplift of £7.67m in the previously approved budget for the leisure complex and bus station.\" \nIt would take the total cost of the development from £32.25m to nearly £40m with Brexit being labelled as one of the key issues. \nRead more: BLOCKED: the Twitter users who dared to take on Tory MP \nIn an earlier story councillor Phil Bialyk, lead councillor with responsibility for bus station redevelopment, said: \"We've taken our time to get this right. We said we'd deliver, and even in difficult times we plan to do just that. \n\"This is about civic pride and setting the right tone for the continued redevelopment of the city centre. It is also about providing the quality buildings and quality services that people expect and deserve \n\"The budget to deliver these developments is more than we first thought, but that's not unusual post the Brexit vote and with the uncertainty over the economy that continues. \n\"But the project has been independently assessed as being value for money. And we absolutely think the investment in the city will be worth every penny. \n\"It will help to ensure the long term viability of the city centre, which is responsible for generating a huge number of jobs, and it will provide the residents of Exeter with facilities worthy of our great city for many decades to come.\" Read the full story here. \nConservative Party opposition in the city say they are \"flabbergasted\" by the announcement. \nAnd on social media Stuart Hughes, East Devon councillor and DCC's cabinet member for Highways and Transportation said Exeter City council leader Pete Edwards is \"in dreamland\". \nResponding to DevonLive's original report on Twitter he added: \"What £8m # peteedwards is in dreamland up a creek without a paddle...better start shaking # Corbyn money tree.\" \nIn a video interview with DevonLive Phil Bialyk commented that Devon County Council have not 'stepped up to their responsibilities to build a bus station for Exeter'. \nWatch the full video interview above. \nResponding to Exeter City Council's version of the news released on their Facebook page this morning some described the plan as \"a farce\" but others backed the council with one user commending Phil Bialyk's honesty. \nSee ECC's video below. \nOn DevonLive's Facebook post however, the majority of comments called for the plans to be revised. \nGraham Steer wrote: \" Isn't this the perfect opportunity to revise the plans for example, keep the bus station and build it to the original specs, move the swimming pool to arena park but build a 50m pool by a alternative spec a cheaper one of which we've seen examples of nation wide then sell the land where the pool was going to go to another developer as long as they agree to develop the land in a way that enhances and benefits the city(not student accommodation) if you did this you could save money rather than borrow more and more of the Exeter citizens would be happier, oh and please don't blame everything on BREXIT its just a cheap shot and a poor excuse. \" \nOthers hit out at the use of Brexit as a reason for the announcement. \nSherry Delnevo wrote: \" Mention the word Brexit for anything negative. Every time there is a major development there is always a big delay and the cost doubles from the original quote. \" \nExeter voted 55% to remain in the EU referendum. \nSee the full comments below. \nMeanwhile on DevonLive.com the comment boxes continue to fill up with those unhappy with the plans in the first place. \nThe most uprated comment at this point is Seagullsimon with \"Scrap it and stop wasting money\". Others, again, are calling for the amendment of the original plans. \nShould Exeter City council 'scrap' the plans? Vote below: \nCllr Andrew Leadbetter, leader of Exeter Conservatives, said yesterday: \"We are absolutely flabbergasted. We thought this project was expensive before, now it is nearly £40m and they haven't even started building it. \n\"The city council has spent nearly £4m for consultancy fees already, and hasn't got a bucket of water to show for it. \n\"The Tories in Exeter have always agreed that we need a new pool, but we were unhappy with the original proposal of £18m.\" \n\"It is time for a rethink this vanity project of theirs, and we really call upon Labour members to think about what is best for our city. This is a crazy amount of money to spend on a project and we'd see no other projects funded in the city.\" \nCllr Leadbetter added: \"The council must have Jeremy Corbyn's 'Magic Money Tree' growing somewhere.\" \nRead more: Full list of carnival dates in Devon for 2017 \nLiberal Democrat Cllr Kevin Mitchell said: \"The original budget for this Leisure Centre was £20 million in December 2014and today it is recommended the budget be set at £33.05 million. \n\"These costs have spiralled upwards without a single brink being laid. We are not dealing with monopoly money, this is taxpayers money and the public deserve better. \n\"Bins are overflowing in my ward because the Council do not have the operatives to empty them regularly, rubbish is left in our streets because we don't have sufficient street sweepers, graffiti is out of control despite the valiant efforts of a small team and no fixed penalty fines have been issued in the last three years for littering or dog fouling because we no longer have the officers to enforce clean streets. \n\"I get told again and again we don't have the money to ensure these basics occur yet money keeps being found for this project, this time from borrowing. Clearly this project is a priority for our Labour Councillors but it is time they got the basics right first.\"", "external_links": [], "published": "2017-07-01T20:00:00.000+03:00", "crawled": "2017-07-01T22:20:57.002+03:00", "highlightTitle": ""}