{"organizations": [], "uuid": "0351b7270b8ea18ae5ef7d8a88df5d0894f28f35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30422443/16067761.jpg", "site_section": "http://www.middevongazette.co.uk/business.rss", "section_title": "Devon Live Business RSS feed", "url": "http://www.devonlive.com/exeter-businesses-report-record-sales-but-feel-good-factor-is-lacking-report-shows/story-30422443-detail/story.html", "country": "GB", "title": "Exeter businesses report record sales but feel good factor is...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-04T11:06:00.000+03:00", "replies_count": 0, "uuid": "0351b7270b8ea18ae5ef7d8a88df5d0894f28f35"}, "author": "HannahFinch", "url": "http://www.devonlive.com/exeter-businesses-report-record-sales-but-feel-good-factor-is-lacking-report-shows/story-30422443-detail/story.html", "ord_in_thread": 0, "title": "Exeter businesses report record sales but feel good factor is...", "locations": [], "entities": {"persons": [{"name": "lidl", "sentiment": "none"}, {"name": "mark pellow", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "vickery holman", "sentiment": "none"}, {"name": "julie hawker", "sentiment": "none"}, {"name": "derek phillips", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "exeter chamber of commerce", "sentiment": "none"}, {"name": "ikea", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter businesses report record sales but feel good factor is lacking, report shows By HannahFinch | Posted: July 04, 2017 0 COMMENTS SHARES Exeter businesses have recorded record sales but confidence is still low Exeter businesses report record sales but feel good factor is lacking, report... X \nCopy link to paste in your message / Comments (0) \nExeter businesses have reported the highest number of sales growth since records began but Brexit uncertainty remains. \nThe Exeter Chamber of Commerce's latest business survey has revealed a startling contradiction - that despite record number of businesses reporting increased sales since records began in 2000, the impact of long-term, ongoing, political and economic uncertainty is negatively impacting business confidence for the future. \nREAD NEXT: Here's the inside secrets of Ikea ahead of the Exeter opening - Revealed by a store worker \nOf the businesses surveyed a record breaking 69% recorded an increase in sales alongside an unprecedented 50% reporting an increase in jobs in the last quarter. Despite this, only 12% of respondents rated high 'Business Confidence' for the immediate future; the lowest figure since 2010. \nDerek Phillips, vice president of Exeter Chamber of Commerce, said: \"Strong results in sales and employment figures usually go hand in hand with high confidence for the future. \n\"The figures show Exeter is continuing to show growth in most sectors but the uncertainty, following the General Election, is a worrying factor, particularly in respect to future investment plans.\" \nPanel attendees at a meeting called to discuss the findings, discussed a number of factors arising from both the General Election and Brexit negotiations impacting businesses. \nREAD NEXT: Devon businesses told to speak out on Brexit \nThey include uncertainty over what funding, if any, will replace EU funding streams for business growth and development, and the agriculture and tourism sectors particularly. \nBusinesses are also foreseeing major challenges in the labour market , particularly in agriculture, retail, logistics, hospitality and tourism, owing to both weakened pound and political environment. \nThere will be further employment challenges by inward investment recruiters like Lidl and Ikea. \nThe fall in the pound has bolstered the 'staycation market', with tourism businesses in Exeter and the surrounding regions seeing record levels of visitors, at over 90% occupancy. \nConsumer confidence nationally is reported to be falling, but this is yet to be reflected in the city's retail performance. \nJulie Hawker, joint chief executive of ethical IT business Cosmic said: \"The local trading situation feels strong with plenty of sales, new customers and relationship to be won, but match that against the national and political turmoil and businesses are finding it difficult to make strategic plans. Certainly, the recently agreed investment in business support and skills development made possible by EU funding streams bring golden opportunities for businesses to invest and develop in the short-term, and in ways which will definitely pay-off in the long-term.\" \nMark Pellow, managing director of property consultants, Vickery Holman said: 'These results are very interesting as they show the ongoing success of Exeter as a business location, with many firms reporting very good trading over the last few months. Business confidence in the property market did show a drop in the immediate fallout from the General Election. \n\"We also have not seen any fall off in our property loan security valuations, again suggesting most businesses are just getting on with things despite the uncertain background\" ", "external_links": [], "published": "2017-07-04T11:06:00.000+03:00", "crawled": "2017-07-04T17:04:44.000+03:00", "highlightTitle": ""}