{"organizations": [], "uuid": "ba3dc2ad36ab493d6ff18d0f3142d883efc4401f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13368341.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/gove-plans-new-farm-subsidies-13368289", "country": "GB", "domain_rank": 21960, "title": "Gove plans for new farm subsidies given cautious welcome in North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-21T19:14:00.000+03:00", "replies_count": 0, "uuid": "ba3dc2ad36ab493d6ff18d0f3142d883efc4401f"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/gove-plans-new-farm-subsidies-13368289", "ord_in_thread": 0, "title": "Gove plans for new farm subsidies given cautious welcome in North East", "locations": [], "entities": {"persons": [{"name": "gove", "sentiment": "negative"}, {"name": "louis fell", "sentiment": "none"}, {"name": "hugh richardson", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "patrick begg", "sentiment": "none"}, {"name": "george f. white", "sentiment": "none"}], "locations": [{"name": "north east gove", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "woking", "sentiment": "none"}, {"name": "wwf living planet centre", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "national trust", "sentiment": "none"}, {"name": "greenpeace", "sentiment": "none"}, {"name": "energydesk", "sentiment": "none"}, {"name": "national farmers’ union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gove plans for new farm subsidies given cautious welcome in North East Environment Secretary wants to change subsidies after Brexit to reward environmental schemes Share Michael Gove speaking at the WWF Living Planet Centre in Woking, where he told an audience of environmental and countryside organisations that Brexit gives scope for Britain to be a global leader in green policy (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East farmers have given a cautious welcome to Government plans to replace EU subsidies with payments for helping protect the countryside. \nEnvironment Secretary Michael Gove has indicated that farmers will be paid for delivering benefits for nature and the countryside after Brexit instead of receiving subsidies for the amount of land they farm. \nUnder the Europe-wide Common Agricultural Policy UK farmers receive around £3bn a year in subsidies, mostly linked to the amount of land they farm. \nThe Government has pledged to maintain levels of funding up to 2022, but Mr Gove said ministers could only go on “generously supporting farmers” in the face of other demands on spending if the environmental benefits were clear. \nIn his first major speech as Environment Secretary, Mr Gove said reform of the system was needed, with payments for woodland creation, habitat protection, caring for treasured landscapes and higher animal welfare. \nMr Gove said: “The Common Agricultural Policy rewards size of land-holding ahead of good environmental practice, all too often puts resources in the hands of the already wealthy rather than into the common good of our shared natural environment, and encourages patterns of land use which are wasteful of natural resources.” \nHe said the UK should take the opportunity presented by leaving the EU to reward farmers for environmental protection. \nInvestigations by Greenpeace’s Energydesk have revealed that one in five of the biggest recipients of European farming subsidies in Britain are billionaires and millionaires on the Sunday Times Rich List, a number of of them in the North East . \nEnvironmentalists want to see reform of the system to boost nature and protect UK wildlife. Read More Brexit poses 'real risks' to UK food supplies, new report warns \nHugh Richardson, Northumberland chairman of the National Farmers’ Union, said: “We need to find a balance between the health and welfare of the countryside and the need to produce food in a cost-effective way. \n“When you hear that large landowners are getting millions of pounds in subsidies, it doesn’t sit right wih the general population. It’s time for a change but it needs to be done in a way that allows farmers to deliver good, wholesome food and protect the huge space that people can use. We need to remember that that comes at a cost.” \nLouis Fell, a partner at Alnwick-based land, property and business consultancy George F. White, said: “It’s pleasing that Gove is wanting to continue to support upland farmers. It’s such a fragile environment and, as we have seen in many parts of destocking, the land can easily revert to scrub which completely alters the current landscape that the public currently enjoy and wish to see protected. \n“There is only so much diversification projects and non-farming income that some farmers can earn from their farm and the Government must ensure that we don’t see a massive exodus of farmers or farm employees. The industry already struggles to attract really good people and those leading the country must be careful to ensure that they don’t portray a negative image during the next five years of changes.” \nThe National Trust has also called for reform of the subsidy system to reward farmers for providing public benefits in the countryside. Read More Farming could face huge labour shortages unless Government acts, industry warns \nPatrick Begg, National Trust rural enterprise director, said: “Michael Gove’s speech shows there’s a strong consensus that funding for farmers and land managers should be based on public money buying clear public benefits. \n“There’s no longer any real debate about whether change will happen - the key questions are now when and how it happens. \n“Putting environmental benefits at the heart of the system that replaces the Common Agricultural Policy will help safeguard natural resources and ensure a long-term future for farming.” Like us on Facebook", "external_links": [], "published": "2017-07-21T19:14:00.000+03:00", "crawled": "2017-07-21T19:49:32.000+03:00", "highlightTitle": ""}