{"organizations": [], "uuid": "369d19323b21f1123ab6fc70f7cda062a4f9f245", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12923543.ece/ALTERNATES/s1200/Inside-Sports-Direct.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-united-mike-ashley-sports-13359590", "country": "GB", "domain_rank": 21960, "title": "Newcastle United owner Mike Ashley declares Sports Direct on track to become 'Selfridges of sport'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-20T14:22:00.000+03:00", "replies_count": 0, "uuid": "369d19323b21f1123ab6fc70f7cda062a4f9f245"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-united-mike-ashley-sports-13359590", "ord_in_thread": 0, "title": "Newcastle United owner Mike Ashley declares Sports Direct on track to become 'Selfridges of sport'", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "keith hellawell", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "shirebrook", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "board", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle united and sports direct", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle United owner Mike Ashley declares Sports Direct on track to become 'Selfridges of sport' Mike Ashley's comments come as full year results show Sports Direct profits were more than halved by the sterling slump Share Mike Ashley inside a Sports Direct warehouse (Image: Daily Mirror) Share Get business   Thank you for subscribing!   \nThe billionaire owner of Newcastle United and Sports Direct has declared the retail empire is on track to become the ‘Selfridges of sport’, through its new generation of stores. \nThe business has ploughed £300m into property in the last year, acquired stores and new brands in the UK and overseas and also snapped up stakes in a raft of high street names as it strives to raise its game. \nAs expected, however, full year results for the firm, for the year ended April 30 2017, showed underlying pre-tax profits took a 58.7% tumble, from £275.2m to £113.7m, after it was left exposed by the pound’s plunge following the Brexit vote. \nMr Ashley said the group – which chalked up an 11% rise in revenues to £3.24bn – had taken action to limit the impact of the pound’s heavy falls against the US dollar, but warned “we remain exposed” to longer-term sterling woes. \nDespite the fall, he said the group is making headway in its goals. \nHe said: “Sports Direct is on course to become the “ Selfridges ” of sport by migrating to a new generation of stores to showcase the very best products from our third party brand partners. \n“We have invested over £300m in property over the last year, and I am pleased to report that early indications show that trading in our new flagship stores is exceeding expectations. \n“We will continue to invest and make decisions for the long term, whilst trying to conservatively manage the currency volatility that is reflected in our full year results. \n“The devaluation of Sterling against the US dollar has led to a significant impact on EBITDA and profits in FY17. \n“We have put in place hedging arrangements to minimise the short-term impact of currency volatility, but like many UK retailers we remain exposed to medium / long term currency fluctuations. Our results were also impacted by provisions and depreciation charges.” Read More \nThe group, which sources many of its branded goods in US dollars from Asia, said it was “optimistic” for the year ahead, targeting underlying earnings growth of between 5% and 15% despite ongoing pressure from the pound.” \nIt said the rollout of a new store format was bearing fruit, with better-than-expected early results. \nThe group currently has 388 sports stores in England, 37 in Scotland and 27 in Wales, and there are plans to open many more. \nOf 11 new generation store openings in England, four were flagship stores, including one in Sunderland, and between 12 and 18 will open in the new financial year, half of which will be flagship stores, and the group plans to open up to 150 flagship shops within the next 10 years. \nChairman Keith Hellawell said that the firm had “made positive progress across the business as we continue to strive to ensure that all of our people are treated with dignity and respect” and that Sports Direct is a company of which “Britain can rightly feel very proud”. Read More Mike Ashley top of North East rich list despite losing a lot of wonga in last 12 months \nHe said: “Following publication of the Working Practices Report in September 2016, the Board and senior management have continued our comprehensive review of our arrangements for staff, both in stores and at our Shirebrook campus. We have launched a rolling initiative to capture staff feedback called ‘Your Company, Your Voice’. All contributions are carefully monitored so that early action can be taken where appropriate. \n“A recent survey of workers in Shirebrook, to which 3,300 people responded, showed that an overwhelming majority of people in our warehouse currently feel they are treated with respect. We have used the results of this survey to identify any areas that require further attention. However, we recognise there is no room for complacency and our work remains ongoing.” Like us on Facebook", "external_links": [], "published": "2017-07-20T14:22:00.000+03:00", "crawled": "2017-07-20T14:47:05.002+03:00", "highlightTitle": ""}