{"organizations": [], "uuid": "8295a4202b85c20942113f3a3dd1a32f9479dfe2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13406542.ece/ALTERNATES/s1200/IBP_NEC_280717lottery_fund_03JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/big-lottery-fund-newcastle-shed-13406294", "country": "GB", "domain_rank": 21960, "title": "Big Lottery Fund in Newcastle to shed around 60 jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-31T07:00:00.000+03:00", "replies_count": 0, "uuid": "8295a4202b85c20942113f3a3dd1a32f9479dfe2"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/big-lottery-fund-newcastle-shed-13406294", "ord_in_thread": 0, "title": "Big Lottery Fund in Newcastle to shed around 60 jobs", "locations": [], "entities": {"persons": [{"name": "onwurah", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "news big lottery fund", "sentiment": "negative"}, {"name": "st james", "sentiment": "none"}, {"name": "st james gate", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "national lottery", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east & cumbria", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "big lottery fund", "sentiment": "none"}, {"name": "newcastle upon tyne", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Big Lottery Fund in Newcastle to shed around 60 jobs Staff were told this week about the job cuts as part of a re-organisation of the Fund which distributes cash to worthy causes Share 2 St James Gate, Newcastle Upon Tyne, Base of the Big Lottery Fund (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAround 60 people working for the Big Lottery Fund in Newcastle face losing their jobs, we can reveal. \nThe company says it employs 253 staff in the city and has an office off St James’s Gate. \nThey were informed this week about the job losses which were revealed as part of a ‘re-organisation’ of the organisation. \nThe Fund is responsible for distributing the cash raised by the National Lottery for “good causes”. \nThe move has caused huge concern among staff and has led to fears this was just the first phase of job losses. \nWe were informed by two separate sources that the numbers working there could eventually be reduced to a skeleton staff of as few as 13. \nHowever the organisation denied this. \nA BLF spokesperson said: “The number of roles in the Newcastle office will reduce by approximately 60 staff by mid - 2018. We can’t comment on numbers of staff post 2018. \n“However, we can confirm there is no expectation that the Newcastle office will reduce to 13 staff by 2019.” \nThe spokesperson also denied a second figure mentioned to us of a drop to 25 staff in Newcastle. \nIt was suggested a drop in income following a fall in National Lottery sales and the organisation wishing to focus it’s core business in Birmingham were behind the moves. \nWe were also told that staff remaining faced the possibility of pay cuts, following a two year period of pay protection. \nThe company denied it was a cost cutting exercise and claimed it was designed to improve the service. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe spokesperson said: “As part of our ambition to improve our service to customers, we are creating six regional hubs in Birmingham, Exeter, Leeds, London, Manchester and Newcastle. \n“These changes will more than double the number of staff we currently have working locally – closer to the communities we serve. \n“These changes are not about cost savings. They have been informed by customer feedback and the messages we have heard directly from communities on what they need from us.” \nRegarding the pay cut claim, the spokesperson said: “Alongside the changes we’re making to our England portfolio, we are developing a new staff framework across the Fund. This includes making staff pay levels more uniform, ensuring they are in line with the wider market. \n“The majority of staff will see no change to their salary. However, we are in consultation with unions regarding staff who may face changes. We are looking at a number of options including pay protection.” Read More Forget chlorinated chickens, this is why a good Brexit deal is crucial to the North East \nThe consultation process, we understand, will take place in the Autumn. \nAs such, the spokesperson said the final number of job losses was “subject to change” as the consultation process is yet to begin. \nVoluntary redundancies will be sought first, however the Fund did not rule out compulsory redundancies. \n“Due to the nature of the changes being implemented it is likely that there will be some redundancies amongst existing team members,” said the spokesperson.” \nThe spokesperson also said: “Overall, the number of funding staff in England will remain largely the same. This is because, while we expect around 100 roles to move out of Birmingham and Newcastle, we are more than doubling the number of staff we have working locally” \nNewcastle Central MP Chi Onwurah said the issue had been raised with her and she tabled a parliamentary question asking for the size of the proposed reduction in staff. Read More \nShe was told as the BLF is led by a non-executive board and has operational autonomy, it was not a matter for the government. \nShe said: “I wasn’t happy with the answer.” \nMs Onwurah said she was extremely concerned about the job losses and said if the BLF office in Newcastle was closed it would be a “kick in the teeth for the North East”. \nThe BLF spokesperson said: “Changes to the Newcastle office will take place gradually, and by 2021 it will primarily be the focus of our North East & Cumbria grant-making. In the meantime some corporate services and grant making roles will still be based in Newcastle, and this may continue beyond 2021.” \nThe spokesperson also said: “Our current lease runs until 2021, we can not comment on plans for the office after this date” Like us on Facebook ", "external_links": [], "published": "2017-07-31T07:00:00.000+03:00", "crawled": "2017-07-31T07:29:41.004+03:00", "highlightTitle": ""}