{"organizations": [], "uuid": "f8e6390f65a2c3613bc9101d8e2fb6add7164a88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13313859.ece/ALTERNATES/s1200/GWR_-NJL_180517krush_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/polar-krush-pledges-make-frozen-13344570", "country": "GB", "domain_rank": 21960, "title": "Polar Krush pledges to make all frozen drinks sugar-free within six months", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-17T18:32:00.000+03:00", "replies_count": 0, "uuid": "f8e6390f65a2c3613bc9101d8e2fb6add7164a88"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/polar-krush-pledges-make-frozen-13344570", "ord_in_thread": 0, "title": "Polar Krush pledges to make all frozen drinks sugar-free within six months", "locations": [], "entities": {"persons": [{"name": "paul goldfinch", "sentiment": "negative"}, {"name": "tetra pak", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "alfa lavel", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}], "organizations": [{"name": "lsl", "sentiment": "none"}, {"name": "polar krush", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "stevia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Goldfinch, chairman of Polar Krush (Image: Copyright unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIced drinks maker Polar Krush has announced it will switch to making all of its products sugar-free within the next six months. \nFollowing the challenge of replacing fruit juice as the main base ingredient with something natural and sugar-free, and after spending the last three years getting the freezing consistency and taste right, the Ashington company says it has come up with the ultimate sugar-free iced-drink range. \nTo overcome the obstacle of replacing the fruit juice base ingredient with a sugar-free alternative, a range of vegetables and crops were considered. \nOther natural ingredients are added to create the natural colours needed to give Polar Krush drinks their famous bright-coloured look. Stevia leaf acts as a natural sweetener, and adding just the natural flavour of the fruit enhances the taste. Polar Krush \nPolar Krush founder Paul Goldfinch said: “Our aim was always to make our fun drinks a guilt-free treat, making them completely sugar-free and almost zero calorie. Read More Polish cable giant acquires North East subsea specialist JDR Cable Systems \n“Our commitment is to ensure our products are still a huge hit with families, becoming the go-to, guilt-free refreshment choice. \n“We’re the only iced-drinks, and possibly soft drink manufacturer in the world to make this commitment. Our products have always added a burst of fun and excitement to family outings, and we’re delighted that we are able to make our products sugar-free, without losing any of their renowned flavour. \n“I am very proud of the team, they have experienced lots of highs and lows, and the taste profile is now exactly the same as the original product.” Read More LSL shirks Brexit fears to deliver stronger than expected profits \nAlongside the updated recipes, Polar Krush has worked with global manufacturer Alfa Lavel to develop a new packaging format, similar to a wine bag in a box, aseptically sealed in order to keep it fresher for longer so preservatives are not needed. The packaging is an adaptation of the latest ‘Tetra Pak’ production line. \nThe new sugar-free drinks are available now in selected stockists, and production will increase to full availability from Q1 2018. Like us on Facebook", "external_links": [], "published": "2017-07-17T18:32:00.000+03:00", "crawled": "2017-07-17T18:45:14.008+03:00", "highlightTitle": ""}