{"organizations": [], "uuid": "45cb0e858e8ee0dc6feb2a2193354f0587e08996", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13312418.ece/ALTERNATES/s1200/Children-research.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/your-maths-skills-better-primary-13312346", "country": "GB", "domain_rank": 21960, "title": "Are your maths skills better than a primary school child's? Try this quick quiz", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-11T10:54:00.000+03:00", "replies_count": 0, "uuid": "45cb0e858e8ee0dc6feb2a2193354f0587e08996"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/your-maths-skills-better-primary-13312346", "ord_in_thread": 0, "title": "Are your maths skills better than a primary school child's? Try this quick quiz", "locations": [], "entities": {"persons": [{"name": "mike ellicock", "sentiment": "none"}, {"name": "susie", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "national numeracy", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Are your maths skills better than a primary school child's? Try this quick quiz Almost a quarter of adults were unable to work out a basic pay rise and a numeracy charity is calling on the Government to do more Share Children during a lesson in a primary school (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCould you work out how much your pay would go up if you were given a 5% rise? \nA new poll has found almost one in four adults would be unable to make the calculation, with many others struggling to work out interest on a savings account or exchange rates. \nEarlier figures have revealed around half of England’s adults have maths skilled comparable to a primary school pupil . \nThe National Numeracy charity is calling on the Government to do more to recognise Britain’s maths problem and work to improve skills. \nOut of 2,115 adults surveyed, 23% were unable to work out how much pay someone would get if they got a 5% increase on their £9-an-hour rate. \nThe same percentage were unable to answer a question on how many US Dollars they would get for £210, if the exchange rate is £1-$1.22. A cashier holding a 20 US dollar note, alongside a 10 pound British sterling note (Image: PA) \nLess than two-thirds (63%) could calculate how much interest they would earn on an interest account which pays out 2.5% a year. \nA new report by National Numeracy and KPMG notes that a 2012 survey found that 49% of working-age adults in England have the numeracy level expected of primary school children. \nIts authors says poor numeracy skills are costing the UK economy £20bn a year. Read More Could you pass the Year 6 SATs? Try the tests designed for 10-year-olds and see how you fare \n“Poor numeracy among individuals is often not detected and the impact on productivity within a particular workplace is not quantified,” it says. \n“Numeracy - the ability to solve everyday problems through the application of basic mathematical skills and understanding - is often overshadowed by concerns about literacy and subsumed in academic mathematics. And yet it is different from both.” \nThe report adds: “The resolution of all this cannot be left to the education and skills system alone. It is not solely a matter of ensuring students leave school numerate, important though that is. \n“Help must also be directed to the millions of barely numerate adults already at work, many of whom will continue to work for several decades.” \nNational Numeracy chief executive Mike Ellicock said: “Now, more than ever, we need new solutions to this very old problem. With Brexit on the horizon, better number skills are a blatantly obvious requirement for upping the UK’s game in terms of productivity. \n“We know that millions of people have a real fear of numbers - but we can help everyone to overcome this and get the essentials of numeracy. For this we need people to ‘just do it’, employers to recognise the numeracy deficit within their own workplace and work with us to remedy it. And we want government to acknowledge the scale and urgency of the problem and support us in action to crack it.” Question - 1 of 3 Score - 0 of 0 Susie is paid £9.00 per hour. If Susie gets a 5% pay increase, what is her new pay per hour?", "external_links": [], "published": "2017-07-11T10:54:00.000+03:00", "crawled": "2017-07-11T11:53:03.025+03:00", "highlightTitle": ""}