{"organizations": [], "uuid": "84ca34bd60044294fe492766e6e018cedad055fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30453891/16088571.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/can-we-prevent-the-extinction-of-mankind/story-30453891-detail/story.html", "country": "GB", "title": "Western Morning News published Can we prevent the extinction of Mankind?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-24T16:27:00.000+03:00", "replies_count": 0, "uuid": "84ca34bd60044294fe492766e6e018cedad055fa"}, "author": "Western Morning News", "url": "http://www.devonlive.com/can-we-prevent-the-extinction-of-mankind/story-30453891-detail/story.html", "ord_in_thread": 0, "title": "Western Morning News published Can we prevent the extinction of Mankind?", "locations": [], "entities": {"persons": [{"name": "keith rossiter", "sentiment": "none"}, {"name": "martin attrill", "sentiment": "none"}, {"name": "juniper", "sentiment": "none"}, {"name": "attrill", "sentiment": "none"}, {"name": "hearnden", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tony juniper", "sentiment": "none"}, {"name": "geoff hearnden", "sentiment": "none"}, {"name": "prof attrill", "sentiment": "none"}, {"name": "jean-luc solandt", "sentiment": "none"}], "locations": [{"name": "mankind", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "exeter racecourse", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "antarctic", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "national academy of sciences", "sentiment": "none"}, {"name": "stanford", "sentiment": "none"}, {"name": "marine conservation society", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "plymouth university's marine institute", "sentiment": "none"}, {"name": "devon wildlife trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Western Morning News | Posted: July 24, 2017 By Keith Rossiter Who is on the way out? A scene from Jurassic Park Can we prevent the extinction of Mankind? X \nCopy link to paste in your message / Comments (0) \nHuman overpopulation and over-consumption by the wealthiest are driving Earth towards the biggest mass extinction since the dinosaurs vanished 66 million years ago, scientists have warned. \nThe sixth mass extinction in Earth's history is well under way and Mankind, as well as wildlife, faces a \"dismal\" future if nothing is done within the next 20 years, according to a report in the Proceedings of the National Academy of Sciences journal. \nUp to half of the number of animal individuals that once shared Earth with us are already gone, according to scientists at Stanford and Mexico City universities. \n\"An extinction is under way comparable to that which led to the extinction of the dinosaurs,\" environmentalist Tony Juniper , speaking after the South West Marine Natural Capital conference at Exeter Racecourse, said. \"And we know this is caused by people. \n\"The South West's countryside may look green and pleasant, but much of it is degraded. A lot of the changes are taking place slowly and we hardly notice what's going on.\" \nLast year's UK State of Nature report by the Wildlife Trusts revealed that 60% of the species studied have declined over recent decades. \nMr Juniper said it was not too late to act and that protecting the environment would be good for our economy. \n\"If we act right away we could avoid the worst, but we can't have room for complacency because it's already under way.\" He highlighted the fate of the corncrake, which went extinct in England but is now being reintroduced. \nFarming practices are blamed for much of the damage, but Mr Juniper said the fault lay with the market and regulations, which forced farmers to make bad choices. He hoped that Brexit would offer an opportunity to write better farming policies. \nProfessor Martin Attrill, director of Plymouth University's Marine Institute , said: \"One sobering thought is that in all major extinction events it is the 'highest' evolved animals that get hit the worst. If \nwe allow a new mass extinction to occur it is very likely that one of those species going extinct will be Homo sapiens.\" \nProf Attrill said he thought we were on the verge of a mass extinction, and added: Prof Attrill said there were many more confirmed extinctions on land than in the sea, and comparatively few marine invertebrates we know about have gone extinct. \nThe difficulty of studying sea life meant we could be doing huge damage to marine ecosystems without even realising it – as happened with overfishing in the 20th Century,\" Prof Attrill said. \n\"So many populations and species are teetering on the edge, especially in the marine environment, that it would not take much to push us over. \n\"I think climate change is likely to do that unless things change dramatically. \n\"In the UK, and most of our exploited seas, we have already seen huge environmental degradation due to a range of human activities from trawling to pollution. \n\"We are used to comparatively empty seas and bare seabeds as that has been the case for decades, due mainly to more than 100 years of seabed trawling. \n\"In the UK it is likely that hundreds of years ago our seabeds and estuaries were covered in massive banks of oysters and mussels.\" \n\"Hundreds of years ago oysters were the food of the poor as they were so common.\" \nBanks of bivalve molluscs can keep the estuaries, seas and rivers crystal clear. Now, murky rivers, estuaries and seas are seen as normal – and the problem is made worse by deforestation and loss of marshes on land. \nThe species we eat rely on reefs, seagrass beds, salt marshes and, in the tropics, coral reefs and mangroves as nurseries. When these are destroyed, so are the commercially valuable species we rely on. \nIt has been shown in the tropics that where mangroves have been cut down – usually to create king prawn farms – nearby coral reefs have depleted fish populations and any run-off from storms isn't buffered by the mangroves and smothers the reefs. \n\"Our massive effort at extracting fish and other large animals from the world's seas has had massive effects,\" Prof Attrill said. \"It is estimated that we have lost 95% of the large animals that should be in the sea. Imagine that … if you see five dolphins in a group off Plymouth, there should be 100.\" \nWildlife in decline \nTHE number of hedgehogs, lapwings and cuckoos in Devon is declining at an alarming rate according to a new study. Devon Wildlife Trust says action is needed to...The oceans are the regulators of our planet – creating oxygen as much as rainforests and dealing with most of the carbon dioxide we have put into our atmosphere. \n\"Without the oceans soaking up carbon dioxide, warming of our atmosphere would be so severe that all life as we know it would be dead, including us,\" Prof Attrill said. \n\"There was a general assumption in the past that our ocean and atmosphere were so vast that we could throw whatever waste into it and they can absorb it all. That we can also fish it as hard as we wish and the bounty is inexhaustible. \n\"This is clearly not the case.\" \nThe carbon dioxide being soaked up by the oceans is changing the chemistry, slowly making it more acidic, which is hampering the ability of sea creatures to build their shells or their skeletons. \n\"A massive fail of a scallop farm in Canada was due to increased acidity of the water impacting the growth and survival of these calcium-shell forming organisms,\" Prof Attrill said. \n\"We can find toxic pesticide chemicals in penguins in the Antarctic, and rubbish is trawled up from the deepest part of our oceans. Our waste gets everywhere.\" \nJean-Luc Solandt from the Marine Conservation Society said many marine organisms were able to withstand extinction because they can migrate to safer areas, or produce more offspring. \nBut many fish that were once common had declined to levels that make them no longer commercially valuable. They include fish such as common skate, angelshark, blue shark, mako and porbeagle, all of which were caught before industrial trawling. \n\"We need our marine protected areas and wider fisheries management to reverse these trends,\" he said. But governments have not accurately valued the benefits and costs of an improved environment. \nGeoff Hearnden, a trustee of Devon Wildlife Trust , said: \"If we destroy our environment in the end we destroy ourselves. \nThe most significant loss is of insects, according to Geoff Hearnden, a trustee of Devon Wildlife Trust. \nMr Hearnden bought a rundown farm on the edge of Dartmoor in 1959. He has now turned it largely into a nature reserve. \n\"Two or three decades ago, if you went for a drive in the countryside, your windscreen would be plastered with insects. That doesn't happen now,\" he said. \nHe blamed the widespread use of insecticides, but defended farmers. \n\"They need to make a living. Hardly any farmers think, 'Hooray. I'll kill all the insects'.\" \nBut he said that many of the chemicals now sold have a devastating effect, getting into the environment where they indiscriminately kill invertebrates, including the bees that we depend on to pollinate our food crops. \n\"Invermectin was a wonder drug. It killed pests on pigs and also their internal parasites. But it also got into the dung and killed all the dung beetles. In my childhood there were a huge number \nof flower-rich meadows because of the way farmers managed them. More than 90% are now gone, because it's so much more productive to plough them up and plant grass.\" \nFarmers now cut grass three or four times a year – and each time they kill most of the insects on the field along with many ground-nesting birds. \nSimilarly, he said, the widespread use of slug pellets was understandable, but they also harm blackbirds and hedgehogs. \n\"As far as this country is concerned, turning it round depends on farmers. Even Devon Wildlife Trust's nature reserves are not the solution.\" \nHe added that \"nobody has the faintest idea\" of what is going to happen when we leave the EU. \nREAD NEXT ", "external_links": [], "published": "2017-07-24T16:27:00.000+03:00", "crawled": "2017-07-24T17:07:21.002+03:00", "highlightTitle": ""}