{"organizations": [], "uuid": "42e2aa35bef715c9f1babc2912c65f54dde99c9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13271733.ece/ALTERNATES/s1200/CS20891200.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13261140", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Union targets taxi firm in 'bogus self-employment' case", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-03T10:25:00.000+03:00", "replies_count": 0, "uuid": "42e2aa35bef715c9f1babc2912c65f54dde99c9c"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13261140", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Union targets taxi firm in 'bogus self-employment' case", "locations": [], "entities": {"persons": [{"name": "jefferies", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "booker", "sentiment": "none"}, {"name": "liana wood", "sentiment": "none"}, {"name": "addison less", "sentiment": "none"}, {"name": "james grzinic", "sentiment": "none"}, {"name": "sainbury", "sentiment": "none"}, {"name": "addison lee", "sentiment": "none"}, {"name": "maria ludkin", "sentiment": "none"}, {"name": "nisa", "sentiment": "none"}, {"name": "leigh day", "sentiment": "none"}], "locations": [{"name": "jefferies", "sentiment": "none"}, {"name": "central london", "sentiment": "none"}], "organizations": [{"name": "jonathon manning sainsbury", "sentiment": "negative"}, {"name": "argos", "sentiment": "negative"}, {"name": "sainsbury", "sentiment": "negative"}, {"name": "tesco", "sentiment": "none"}, {"name": "jefferies", "sentiment": "none"}, {"name": "uber", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "home retail group", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bank of England facing first strike from workers in 50 years \nBank of England workers are to stage a four-day strike in a dispute over pay. \nMembers of Unite will walk out from July 31, the first strike at the bank in over 50 years. The announcement follows a 95% vote in favour of industrial action. \nUnite members working in the maintenance, parlours and security departments will be taking strike action on July 31, August 1, 2 and 3. \nThe union warned that if the bank fails to resolve the pay row it will be consulting its members across other departments as part of a plan to escalate the dispute. \nUnite said staff were angry they have been given a below inflation pay offer for the second year running, while up to a third will get no pay rise in 2017. \nUnite regional officer Mercedes Sanchez said: \nStaff at the Bank of England have made their anger clear by voting for strike action due to their employer’s outright refusal to negotiate a fair pay deal for its workforce. \nThe Bank of England now faces its first strike action in over 50 years when staff in vital services across the country will be taking action because of the bank’s total refusal to accept that their workforce are struggling to meet their costs of living. \nThe result of the bank’s unwillingness to negotiate fair pay will be that the bank’s sites, including the iconic Threadneedle Street in the city of London will effectively be inoperable without the maintenance, parlours and security staff. \nUnite said the dispute has been caused by the imposition of a 1% increase in the pay “pot” for the year from March. The amount an individual will receive is at the discretion of line managers, so that employees could receive less than 1% and some will receive no rise at all, said the union. Bank of England (Photo: PA) 9:27 Jonathon Manning Durham County Council launches business rates consultation \nLocal businesses are being given their chance to work with Durham County Council to develop a new business rates relief scheme. \nThe council is wishing to gain the views of businesses in the region after the Chancellor of the Exchequer announced his budget statement. \nThe consultation period is running from 30 June to 10 July 2017. \nSmall to medium sized businesses are being asked to fill out a three question form and return it to the council via email at businessrates@durham.co.uk. 9:23 KEY EVENT Durham Cricket Club's financial state laid bare as accounts are published \nDurham Cricket Club chairman Sir Ian Botham has thanked North East sports fans and businesses for getting the club through a year of “huge highs and lows” after the publication of accounts laid bare the financial challenges the club has faced. \nThe club’s financial results saw it swing from a £986,000 profit a year earlier to an operating loss of £864,000 while, with net interest charges, the club made a loss before tax of £1.25m. \nThat loss came as the club suffered a financial crisis which resulted in it being relegated to the second division of the County Championship after a bailout from the England and Wales Cricket Board (ECB). \nIn accounts published today, the club outlines how the loss of a £1m one-off payment made to all counties by the ECB a year earlier, plus losses from staging England’s test match against Sri Lanka in May 2016, saw the club slide into the red. \nSir Ian says: \nRegular cricket success against a backdrop of financial challenge has been a consistent feature of Durham County Cricket Club over the last 10 years but in 2016 the directors took the difficult decision that it was too great a risk for the company to seek to continue without a significant financial restructuring and that it was important that the ECB be a supporting partner to any restructuring. \nThat the cost of ECB financial support should include relegation to the second division of the County Championship, compounded by points deducation in both the championship and limited overs competitions is naturally very disapointing and particularly hard for the players and coaching staff who hae worked so hard and with such skill to keep us in the First Division. \nThe rights and wrongs of our position have been widely discussed but we are certainly grateful for the huge amount of support and good wishes we have had from our members and the wider cricket family. We would also like to acknowledge support from our key stakeholder Durham County Council and our lead sponsors Emirates, Heineken and the Port of Tyne. Sir Ian Botham (Photo: Newcastle Chronicle) 9:16 Breaking: Bank of England workers to strike \nBank of England workers are to stage a four-day in a dispute over pay. \nThe strike will begin on July 31. The workers are being represented by Unite. Bank of England (Photo: PA) 9:12 KEY EVENT Businesses seick of Sturgeon pushing for independence, says Highland Spring boss \nBusiness leaders are “fed up” with Nicola Sturgeon’s quest for independence and want her to get back to her day job, according to the boss of one of Scotland’s best-known brands. \nLes Montgomery, chief executive of bottled water firm Highland Spring, said the Scottish Government should be helping the Conservatives to achieve the best possible Brexit outcome. \nHe said: \nBusinesses are fed up. The Scottish Government should be getting on with the job they are there to do. Focusing on employment, investment, those kinds of things. \nIndependence isn’t the job that the Scottish Government is supposed to be doing. \nHis comments come as First Minister Nicola Sturgeon confirmed plans for a second referendum on Scottish independence are being put on hold - but left the door open for another ballot before 2021. \nMs Sturgeon told the Scottish Parliament she was going to “reset” the timetable she had previously set out, which could have seen a referendum take place between autumn 2018 and spring 2019. \nBut she made clear that she wanted to give Scottish voters - who backed Remain in last year’s EU referendum - an alternative to Brexit when there is “clarity” at the end of the process. \nMr Montgomery said it looks like independence is “off the table” for now, and that was a good thing as it is “just a distraction”. He added: \nI have 600 people that I am responsible for, and I am trying to do the best for them. I would think the Scottish Government should also try to do the best for the people as a whole. \nBottling over 500m litres a year, Highland Spring is showing continued strong sales performance, with revenues of £103m and pre-tax profits of £4.3m in the year end to December 31 2015. \nFounded in 1979, the company is benefiting from a shifting consumer outlook, with more consumers switching from sugary soft drinks to healthier alternatives. \nHighland Spring is ultimately owned by one of Scotland’s wealthiest men, Mahdi Al Tajir, who is worth over £1.6bn. On Brexit, Mr Montgomery said the Scottish Government should be “helping the country exit as effectively as possible”, rather than trying to create more division. \nHe said: \nWhat we and the wider industry needs is for the UK and devolved governments to continue working together, swiftly and decisively, to bring clarity to key questions for businesses as the Brexit process continues. Business leaders are \"fed up\" with the First Minister's quest for independence and want Nicola Sturgeon to get back to her day job (Photo: Jane Barlow/PA Wire) 9:05 Jonathon Manning Superdry sports standalone stores to be launched by fashion retailer \nFashion retailer SuperGroup has announced plans to launch a chain of standalone sportswear stores as it looks to cash in on the lucrative fitness market. \nThe company, which is behind the Superdry brand, said it will open a raft of Superdry Sport standalone stores in a move aimed at accelerating its “global lifestyle” strategy. \nThe first Superdry Sport standalone franchise will be in Grenoble, opening in October, and the group plans to roll out up to four more stores by Christmas before a wider round of openings next year. In the North East, Eldon Square and the Metrocentre are currently home to Superdry stores. \nThe firm pointed to SuperGroup’s two largest markets, the UK and Germany, for sport at $9.4bn (£7.2bn) and $11.2bn (£8.6bn) respectively. \nThe world’s largest market for sportswear is the US, one of SuperGroup’s “development markets”, at $103.6bn (£79.6bn). \nChief executive Euan Sutherland told the Press Association the expansion will come in the guise of “shops in shops, franchise outlets and an extended online presence”. \nSuperGroup made the announcement alongside full-year results, which saw the company report a 53.1% rise in pre-tax profits to £84.8m for the 52 weeks to April 29 while sales rose 27.4% to £752m. Like-for-like retail sales grew by 12.7%. \nOn Brexit, Mr Sutherland said he had not seen any slowdown in consumer confidence in the UK. He added: \nThe economic environment has been tough and the political backdrop uncertain. \nThe Brexit vote and fluctuating exchange rates have had the most significant direct impact. \nThe Superdry brand has proved resilient while the increased exposure of the business to different countries, markets and currencies has been important in providing some insulation from that impact. \nSuperGroup has a presence in 62 countries, with 863 stores and concessions globally. Superdry has stores at intu Eldon Square and intu Metrocentre (Photo: Hasselblad H5D) 8:59 KEY EVENT Newcastle Startup Week founder greenlights second annual event \nNewcastle’s highly successful Startup Week will return for a second year , its founder has confirmed. \nPaul Lancaster, who organised the five-day event for local entrepreneurs and would-be business people, said he was putting the wheels in motion for another event next year. \nOver 600 delegates from the North East start-up community attended the citywide event. It was also attended by a host of high profile speakers from tech giants Sage, Uber, Digital Union, Sunderland Software City, and the Federation of Small Businesses. \nMr Lancaster said: \nHaving spent almost 15 years helping other people start and grow their own business, I’ve built up a tremendous network around me and have a very good knowledge of where startups should go for the best advice and support. \nNewcastle Startup Week was an opportunity to pull everything together under one banner and put everything on a plate to show people why Newcastle and the North East is such a great place to start and grow a business. \nStartup Week took place from May 15-19, with each day given a specific theme and focus, such as ‘getting started’ or ‘funding and financing’. \nAfter nine months of planning, the event proved a success with the local business community and Mr Lancaster received a lot of positive feedback from attendees. Because of this response it was decided that a second event would be held in 2018. \nAn exact date for next year’s event has not yet been decided. Newcastle Startup Week founder Paul Lancaster speaking at the event (Photo: Unknown) 8:54 Jonathon Manning Energy regulator considering price cap for vulnerable consumers \nThe energy regulator is considering introducing a price cap on bills as part of new proposals aimed at protecting vulnerable consumers. \nOfgem said on Monday that a “safeguard tariff” for vulnerable consumers, which would protect them from overpaying for their energy, is one of a number of options it is mulling. \nIt said research it carried out with the Competition and Markets Authority points to “vulnerable consumers in particular getting a poor deal”. \nIt comes after a temporary price cap to protect over 4m households who prepay for their energy came into effect in March. Ofgem said that cap would save typical prepayment customers around £80 a year, with many seeing a reduction in their gas bill of around 10-15%. But a price cap could now be extended further with the safeguard tariff. \nDermot Nolan, chief executive of Ofgem, said: \nProtecting vulnerable consumers is a priority for Ofgem. \nWe are committed to ensuring that the more disadvantaged in society are not left behind as we move towards a smarter, more competitive energy market. \nThat’s why we are starting new work to protect vulnerable customers, including the option of introducing a safeguard tariff for them. \nAmong its other proposals are plans to make switching easier and to cap warrant charges to install pre-payment meters and ban these charges altogether for the most vulnerable. \nOfgem said it wants to take “the hassle out of switching” after its data showed many people have never or rarely switched. \nMr Nolan added: \nSuppliers must also do more to get all their consumers, particularly those on poor value standard variable tariffs, a better deal. \nWe are pressing ahead with a raft of reforms to make it even easier for people to switch no matter how they choose to shop around. A general photo showing energy costs (Photo: Rui Vieira/PA Wire) 8:50 Jonathon Manning North East car parts giant Nifco UK on track for £90m turnover by 2020 \nNorth East car parts manufacturer Nifco UK said it is on course to reach turnover of £90m by 2020 after recording its eight successive year of growth. \nThe Eaglescliffe business, which makes parts used by the likes of BMW Mini, Ford, General Motors, Honda, Jaguar Landrover, Nissan, Renault, Toyota and Vauxhall Opel, chalked up record turnover of £71m in 2016, a 14% increase on the previous year. \nOperating profit also grew, from £5.7m to £8.7m, in a year which saw a continued steady increase in volumes. \nThe firm, which employs more than 650 people, show the record results which represent the 8th consecutive year of growth for the company. \nMike Matthews, managing director of Nifco UK, said he was pleased with the growth the company, which employs more than 650 people. \nHe said: \n“We are clearly very pleased with what we have achieved at the close of our last financial year. \n“The upward trajectory continues, and this has once again been a controlled year of growth, with the team being added to along the way to ensure that we have the capacity to deliver against our expanding order book.” \nThe sale of the company’s former site at Yarm Road for £1.65m to supermarket giant Lidl, also contributed to Nifco UK’s healthy results. Mike Matthews MBE, managing director of Nifco UK and European operations officer 8:42 ", "external_links": [], "published": "2017-07-03T10:25:00.000+03:00", "crawled": "2017-07-03T10:42:08.000+03:00", "highlightTitle": ""}