{"organizations": [], "uuid": "7305661c53d893c8a3d690929addb479e7969460", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article9011887.ece/ALTERNATES/s1200/Jonathan-Arnott.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-mep-jonathan-arnott-signals-13296205", "country": "GB", "domain_rank": 21960, "title": "Ukip MEP Jonathan Arnott signals he could quit party if Anne Marie Waters becomes leader", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-08T07:00:00.000+03:00", "replies_count": 0, "uuid": "7305661c53d893c8a3d690929addb479e7969460"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-mep-jonathan-arnott-signals-13296205", "ord_in_thread": 0, "title": "Ukip MEP Jonathan Arnott signals he could quit party if Anne Marie Waters becomes leader", "locations": [], "entities": {"persons": [{"name": "far-ri", "sentiment": "negative"}, {"name": "jonathan arnott", "sentiment": "negative"}, {"name": "anne marie waters", "sentiment": "negative"}, {"name": "tommy robinson", "sentiment": "none"}, {"name": "jo cox", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "batley", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "geert wilders", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}, {"name": "richard sellers/pa wire", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "jack buckby", "sentiment": "none"}, {"name": "le pen", "sentiment": "none"}], "locations": [{"name": "borough hall", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "pegida uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "sharia watch uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "pegida rally anti-islam", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "national front", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "hartlepool  ms waters", "sentiment": "none"}, {"name": "edl", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Ukip MEP Jonathan Arnott signals he could quit party if Anne Marie Waters becomes leader Far-right outsider, who is linked to ex-EDL leader Tommy Robinson, could win the race, prompting Mr Arnott to say party could be on verge of \"dying\" Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nUkip could be on the verge of “dying” if a suspected attempt by far-right elements to take over the party succeeds this summer. \nThat’s the prognosis of the party’s most prominent figure in the North East, Jonathan Arnott MEP, who has signalled he could be forced to walk away from the party. \nThe coming months will see the party go through yet another leadership contest following a terrible general election result and the resignation of leader Paul Nuttall. \nWith Nigel Farage ruling out a return to the helm, the field has been blown wide open and a clutch of relative unknowns are competing for the chance to try and turn around the party’s sinking fortunes. \nReports, verified by Mr Arnott, that there has been a rise in people applying to be members of Ukip since the election have raised fears of a takeover from far-right entrists who could rally around a candidate. Newcastle Unites demonstrators in Newcastle city centre protesting against the first Pegida Rally anti-Islam demonstration in the country. (Image: Richard Sellers/PA Wire) \nMr Arnott said: “Since the general election, the Ukip membership has spiked. \n“It would be difficult to tell how much of that spike is caused by an up-tick in general support and how much is cause by entrists intent on taking over the party and turning it into something it hasn’t been in the 16 years I’ve been a member.” \nHe says he has serious fears that the latter is the most likely and the surge could mark the end of Ukip by allowing the coronation of Anne Marie Waters. \nMs Waters has been involved with some of the most notorious individuals and groups in recent political history. Read More Fears Northumberland will be at risk of housing free-for-all after core strategy is withdrawn \nReportedly a former Labour activist, her political metamorphosis led her to team up with former EDL leader Tommy Robinson to lead Pegida UK, an off-shoot of a German anti-Islam group. \nThey held a national demonstration in Newcastle, which attracted neo-Nazi groups like the National Front, in February 2015. Jonathan Arnott UKIP North East MEP at the conference held at Borough Hall in Hartlepool \nMs Waters also set-up the Sharia Watch UK website and has praised far-right European politicians like French presidential candidate Marine Le Pen and Dutch parliamentarian Geert Wilders, both of whom have suffered heavy electoral defeats in recent months. \nShe was previously blocked from standing as a Ukip candidate in the 2017 general election because of her views but is now jostling for the top job and is a dark horse to win the race. \nHer campaign is reportedly being run by Jack Buckby, a former-BNP member who refused to step aside in the Batley and Spen by-election triggered by the murder of Jo Cox MP by a far-right extremist. \nMr Arnott, who has served as a Ukip MEP for the North East since 2014, said: “I could not under any circumstances support Anne Marie Waters for the leadership of Ukip. \n“Many of my colleagues have said privately that, were she to become leader, they would be forced to resign. \n“And, frankly, my own position in the party would be very difficult, if not untenable, under those circumstances.” \nHe added: “There’s been a history of far-right parties in the UK which have enjoyed fleeting success before ultimately dying. \n“Any party led by Anne Marie Waters would risk the same fate.” Protesters during first Pegida anti-Islam demonstration in the country in Newcastle city centre. (Image: Richard Sellers/PA Wire) \nIn the aftermath of the 2017 general election, which saw Ukip’s vote share slump from 12.6% to 1.8% in just two years, Mr Arnott resigned as the party’s general secretary and spokesperson for constitutional affairs. \nHe blasted the party for adopting a manifesto which put “hardline anti-Islam messages” front and centre and distanced himself from policies like banning the burqa. \nMr Arnott said an Anne Marie Waters victory would lead the party further down this en-electable road. \nHe said: “My view is that it’s absolutely right for Ukip to take a strong line against terrorism and radical Islamic extremism, the ideology of ISIS. \n“What I believe is fundamentally wrong is to portray all Muslims and all strains of Islam in the same way. \n“In fact, I would suggest that it’s dangerous to do so because our security services rely on information received from Muslims who cooperate when it comes to investigations into potential attacks. \n“We should not be afraid to take on difficult issues in our society but Muslims are not all the same - there are huge difference between different strains of the religion. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“Anne Marie Waters simply does not understand that those differences exist.” \nFollowing the EU referendum result, there has been much debate about Ukip’s place in the political landscape now that it’s primary objective has been achieved. \nMr Arnott, who says he “currently has no intention” of going for the top job himself, says the only hope is that the rest of the party unites around a unity candidate, adding “I believe that Ukip should be a party that’s open to everyone whatever their background”. \nHe recently published a pamphlet called ‘Britain Beyond Brexit’, which sets out an alternative policy platform based around libertarianism and low-taxation. \nMr Arnott said: “Ukip has always been a party with policies that appeal to people across the political spectrum and feel abandoned by those who fail to represent them. \n“There’s a huge space in British politics for a reasoned political party prepared to stand up to the establishment. \n“If Anne Marie Waters wins then it would no longer be a party capable of appealing beyond a narrow spectrum of public opinion.” \nThe Ukip leadership election will get in to full swing next month with a winner due to be declared in late September. Like us on Facebook ", "external_links": [], "published": "2017-07-08T07:00:00.000+03:00", "crawled": "2017-07-08T08:14:09.003+03:00", "highlightTitle": ""}