{"organizations": [], "uuid": "4ae41cc9940cc5be3cc6ac6d8a1c78158a284ec7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30460205/16093126.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/major-alphington-road-roadworks-will-last-a-disruptive-six-weeks/story-30460205-detail/story.html", "country": "GB", "title": "Major £110k Alphington Road roadworks to remedy potential...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-28T15:45:00.000+03:00", "replies_count": 0, "uuid": "4ae41cc9940cc5be3cc6ac6d8a1c78158a284ec7"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/major-alphington-road-roadworks-will-last-a-disruptive-six-weeks/story-30460205-detail/story.html", "ord_in_thread": 0, "title": "Major £110k Alphington Road roadworks to remedy potential...", "locations": [], "entities": {"persons": [{"name": "alex", "sentiment": "none"}, {"name": "roy hill", "sentiment": "none"}, {"name": "stuart hughes", "sentiment": "none"}, {"name": "yvonne atkinson", "sentiment": "none"}, {"name": "st thomas", "sentiment": "none"}, {"name": "richards", "sentiment": "none"}, {"name": "cllr roy hill", "sentiment": "none"}, {"name": "rob hannaford", "sentiment": "none"}, {"name": "cowick", "sentiment": "none"}], "locations": [{"name": "alphington road", "sentiment": "none"}, {"name": "sydney road/alphington road retail park", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "sydney road", "sentiment": "none"}, {"name": "alphington", "sentiment": "none"}], "organizations": [{"name": "local transport plan programme", "sentiment": "none"}, {"name": "dcc", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "exeter highways and traffic orders committee", "sentiment": "none"}, {"name": "devon county council's cabinet member for highways management", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Major £110k Alphington Road roadworks to remedy potential accident spot will last six weeks By Alex_Richards | Posted: July 28, 2017 0 COMMENTS SHARES The ongoing saga to improve a potentially dangerous crossing in Exeter will soon come to an end, after the start of six weeks of roadworks. Major £110k Alphington Road roadworks to remedy potential accident spot... X \nCopy link to paste in your message / The ongoing saga to improve a potentially dangerous crossing in Exeter will soon come to an end, after the start of six... Comments (0) \nThe ongoing saga to improve a potentially dangerous crossing in Exeter will soon come to an end, after the start of six weeks of roadworks. \nWork on a new staggered signal-controlled crossing across Alphington Road will help 'vulnerable' pedestrians access the retail park, home to Aldi, The Range and Iceland. \nReturn to Devon Live home page or read next: Revealed: The cramped conditions NINE modern day slaves lived in while working at city car wash \nThe Devon County Council (DCC) scheme, on the north side of the Sydney Road/Alphington Road Retail Park junction, will cost £110,000 and begins on August 14. \nAlphington Road is one of the busiest routes by traffic volume in Exeter, and typically there are 1,000 vehicles an hour in each direction. \nThe recent increase in the number of stores at the retail park has resulted in the need for the improved walking links. \nCurrently there is no signal-controlled crossing for anyway who wants to cross from the Sydney Road and Exe Bridges direction. \nTravelling from the City, the main walking route is via the railway arch on the western side of Alphington Road - and pedestrians often have to risk the pathless way through when there is a gap in the traffic. \nIt's difficult for vulnerable pedestrians including the visually and mobility impaired and parents with young children and prams. \nInitially the work will require one of the two lanes to be either reduced in width or closed for periods, and a traffic management system will be in place. \nThe scheme will be paid for through DCC's Local Transport Plan Programme (£49,000) and developer contributions (£61,000). \nOnce the new school term starts in September any work will be carried out in the evening to minimise the impact of the work on traffic flows. \nCouncillor Stuart Hughes, Devon County Council's Cabinet Member for Highways Management said: \"It is clear there is a need for a controlled crossing at the Sydney Road junction. \n\"We have carefully considered all the options and concluded that this scheme achieves the right balance of ensuring that all pedestrians are able to access the retail park while minimising the impacts on traffic flow as much as possible. \n\"We have scheduled most of the work during the summer holidays in an effort to keep disruption to a minimum. Once the autumn term starts work will be confined to evenings only.\" \nReturn to Devon Live home page or read next: Vince Cable visits Exeter and talks Brexit, 'questionable' pool project and marijuana \nCouncillor Yvonne Atkinson, Devon County Council's Local Member for Alphington and Cowick, said: \"I'm delighted that this scheme is going ahead, a crossing point at this location is badly needed. \n\"As the retail park has expanded so has demand and a controlled crossing will help shoppers in wheelchairs, mobility scooters, parents with buggies and people with laden with shopping bags cross the road.\" \nCouncillor Rob Hannaford, the chairman of the Exeter Highways and Traffic Orders Committee and the local county councillor for Exwick and St Thomas, added: \"Alphington Road is one of Exeter's main arterial routes and the retail park is served by a busy four way junction. \n\"As new stores continue to open it's inevitable that more people are going to want to walk and drive to the retail park. This has been a major concern for local residents. \n\"I said in April I hoped that the scheme could be delivered in the autumn, so I am delighted that this crossing will now be built.\" \nBoth councillors Roy Hill and Rob Hannaford have been fighting the case for junction improvements for years. \nCllr Roy Hill said: \"We have been very concerned about this location for some time as in recent years the retail and business offer here has been changing, especially with the opening of ALDI and Iceland, and as a result , this has led to a much higher pedestrian footfall. \n\"This has again gone up with the Range moving in and expanding. So we are really concerned that this is a accident waiting to happen especially with so many children and prams out and about in the area. \n\"We have also seen a growth in retirement residential accommodation locally so many people are using their mobility scooters as well.\"", "external_links": [], "published": "2017-07-28T15:45:00.000+03:00", "crawled": "2017-07-28T17:01:14.001+03:00", "highlightTitle": ""}