{"organizations": [], "uuid": "b83a58197c4727e64177e48c5fa68db0db348d94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30434874/16076442.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/your-views-what-newton-abbot-residents-think-about-the-anne-marie-morris-n-word-row/story-30434874-detail/story.html", "country": "GB", "title": "Your views: What Newton Abbot residents think about the Anne...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-11T18:55:00.000+03:00", "replies_count": 0, "uuid": "b83a58197c4727e64177e48c5fa68db0db348d94"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/your-views-what-newton-abbot-residents-think-about-the-anne-marie-morris-n-word-row/story-30434874-detail/story.html", "ord_in_thread": 0, "title": "Your views: What Newton Abbot residents think about the Anne...", "locations": [], "entities": {"persons": [{"name": "newton abbot", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "dawlish", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "pauline", "sentiment": "none"}, {"name": "pauline giddings", "sentiment": "none"}, {"name": "mrs innes-lumsden", "sentiment": "none"}, {"name": "steven lloyd", "sentiment": "none"}, {"name": "anne-marie morris", "sentiment": "none"}, {"name": "jonathan cripps", "sentiment": "none"}, {"name": "jennifer penman", "sentiment": "none"}, {"name": "sally", "sentiment": "none"}, {"name": "anne marie", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}], "locations": [{"name": "newton abbot", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ipplepen", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}, {"name": "south london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Your views: What Newton Abbot residents think about the Anne Marie Morris N-word row By Zoe_Stevens | Posted: July 11, 2017 1 COMMENTS SHARES Comments (1) \nIn the wake of the controversy surrounding Newton Abbot's MP Anne Marie Morris, Devon Live took to the streets to find out what her constituents had to say about the matter. \nMs Morris, the MP for Newton Abbot, described the UK leaving the EU without a deal as a \"real n r in the woodpile\" at the launch of a report into the future for the UK's lucrative financial sector after Brexit. \nShe has since apologised for the remarks, saying: \"The comment was unintentional and I apologise unreservedly for any offence caused.\" \nBut she has had the whip suspended by the her party, which means that although she is still an MP, she is no longer a Conservative MP. \nRead next: Anne Marie Morris' surgery event on Thursday WILL still go ahead despite N-word row \nThe majority of the members of the public in Newton Abbot that we spoke to condemned her use of the phrase, but there was a split between those who thought she should resign, and those who thought she should stay. \nMrs Innes-Lumsden, from Ipplepen, said that she grew up with that phrase, but that it's a shame that it is still in the MP's head. \nShe said: \"I do think that it was the right thing that she has been suspended, but at the same time I feel very sorry for her. When I was a child, we grew up with that phrase. It's just a sign of the times. I'm sorry that it's still in her head that she should still use that phrase, and she should use that phrase, and she'll have to pay the penalty. But we all make mistakes. As she's in a position of high office, well then maybe we should make an example.\" \nWhen asked if she thought that Anne-Marie Morris should resign, Mrs Innes-Lumsden said: \"Not necessarily. I think she should apologise. As I say, we all make mistakes.\" \nSally, from Newton Abbot, said that Anne Marie should resign, and called the use of the phrase 'totally unacceptable'. \nShe said: \"I think it's utterly disgraceful in this day and age. I haven't heard that word used since I was a child, and I'm in my 50s. I think it's unforgivable and I think she should step down, I really do. \n\"I think she should resign. I think that in this day and age it is totally, totally unacceptable and I'm totally amazed that she even has that word is in her head, because I think it's about as low as you can get. It's totally wrong.\" \nJennifer Penman, from Dawlish, agreed, saying that the MP's use of the phrase was 'terrible'. She said: \"I just can't believe that anybody in this day and age would actually use a word like that, and I can't believe that it would even enter anybody's head, I just think it's terrible. \n\"I do think she should resign, but I'm all for the government seeing the other issues through. Although I would like her to resign, I would still like another conservative in her place, which may be difficult.\" \nRead more: Anne Marie Morris should resign over N-word use say Devon Live readers \nPauline Giddings, from Newton Abbot, said that Ms Morris' use of the phrase was 'unfortunate', and that she probably should have thought more carefully before saying it. \nShe said: \"I can understand the offence that she's caused. I think it's unfortunate because the older generation do tend to use terms or phrases, possibly without thinking about the offence that they're causing because they're very old phrases, but I still don't think that it's acceptable to use that wording or phrase in this day and age and she should have thought more carefully before she said anything. \nWhen asked if she thought Ms Morris should resign, Pauline added: \"I think that's a bit of a difficult one, because always when a politician does something slightly out of line they're always asked to resign. I'm not a supporter of hers so I wouldn't mind if she went, but I don't think that's always necessarily what has to happen.\" \nJonathan Cripps, from Totnes, said that Ms Morris should resign. \nRead more: Stand Up To Racism group say Anne Marie Morris must resign now after using the N-word \nHe explained: \"I found it quite unbelievable that there is this kind of person for whom that is even in their vocabulary at all. I'm from South London, and it really baffled me. There just seems to be this archaic group of people for whom that's an acceptable thing. On the one hand I think, slip of the tongue, but that is perhaps a pretty poor reflection culturally on us broadly as to where some people are and some people aren't.\" \nSteven Lloyd from Newton Abbot, said that he thought that Ms Morris had done a good job as MP, and that she shouldn't have to resign. \nHe said: \"I think she probably made a mistake, and she's getting pretty chastised for what she does, but ever since she was elected in office I haven't had a problem with her. She's trying to improve our lives in the community.\" \n\"She'll know better for next time, we all make mistakes.\" READ NEXT: ", "external_links": [], "published": "2017-07-11T18:55:00.000+03:00", "crawled": "2017-07-11T21:23:00.000+03:00", "highlightTitle": ""}