{"organizations": [], "uuid": "106f468281941ff5e5bf626c85e993fbe857e64a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13184852.ece/ALTERNATES/s1200/VRR_JNL_140617_jonathanwalker_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-businesses-overwhelming-want-13300166", "country": "GB", "domain_rank": 21960, "title": "North East businesses overwhelming want EU trading deals to remain unchanged", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-07T20:00:00.000+03:00", "replies_count": 0, "uuid": "106f468281941ff5e5bf626c85e993fbe857e64a"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-businesses-overwhelming-want-13300166", "ord_in_thread": 0, "title": "North East businesses overwhelming want EU trading deals to remain unchanged", "locations": [], "entities": {"persons": [{"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "british chambers of commerce", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East businesses overwhelming want EU trading deals to remain unchanged 52% of businesses want to remain in the Single Market and the Customs Union Share Jonathan Walker, head of policy and campaigns, North East England Chamber of Commerce (Image: Handout) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAn overwhelming majority of North East businesses want trading relationships with the EU to remain the same, according to a survey conducted by the North East England Chamber of Commerce. \nOf the firms that took part, 88% wish to remain in the single market and customs union in some form. \nMore than half of businesses (52%) wish to remain in both the Single Market and Customs Union. On the other hand 24% of firms wanted to remain in the single market only, while 12% wish to remain in the customs union only. \nJonathan Walker, The Chamber’s head of policy and campaigns, said: “Since last year’s referendum we have been strongly urging Government to put business views and concerns at the heart of their negotiations. Read More UK must seek to stay in single market until final EU deal is in place, CBI warns \n“In a region where over 60% of exports head to the EU, it is unsurprising that businesses want to continue to enjoy frictionless trade with European customers. The Government must ensure that the Brexit negotiations deliver an outcome that protects our ability to trade with our biggest markets.” \nThe survey also examined the business community’s views on the state of Brexit negotiations . Over 50% of respondants believed the UK’s Brexit objectives should be reviewed following the General Election. \nAround 40% also wished to see the new trading arrangements introduced over a three year transition period. However, 20% wanted a transition period of more than three years, while 21% wanted no transition period whatsoever. Read More \nOver 1,400 businesses took part in the national survey conducted by the British Chambers of Commerce, which ran in the week following the results of the General Election. Like us on Facebook", "external_links": [], "published": "2017-07-07T20:00:00.000+03:00", "crawled": "2017-07-07T20:39:33.026+03:00", "highlightTitle": ""}