{"organizations": [], "uuid": "5b44a06e4bfeb21d235b1cdc118e903fc4c18f11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12546338.ece/ALTERNATES/s1200/Aldi-Christmas-range.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/aldi-create-nearly-4000-new-13316807", "country": "GB", "domain_rank": 21960, "title": "Aldi is to create nearly 4,000 new UK jobs as expansion drive continues", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-11T20:45:00.000+03:00", "replies_count": 0, "uuid": "5b44a06e4bfeb21d235b1cdc118e903fc4c18f11"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/aldi-create-nearly-4000-new-13316807", "ord_in_thread": 0, "title": "Aldi is to create nearly 4,000 new UK jobs as expansion drive continues", "locations": [], "entities": {"persons": [{"name": "lidl", "sentiment": "none"}, {"name": "matthew barnes", "sentiment": "none"}, {"name": "barnes", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "business aldi", "sentiment": "negative"}, {"name": "aldi", "sentiment": "negative"}, {"name": "asda", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "ukcsi", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "institute of customer service", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Aldi is to create nearly 4,000 new UK jobs as expansion drive continues The German supermarket, which says it has the best pay rates in the supermarket sector, wants to fill a variety of roles Share An Aldi store (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAldi is to create nearly 4,000 new UK jobs in its largest ever recruitment drive as the German supermarket presses ahead with an aggressive expansion strategy. \nThe retailer is looking to fill the roles across its stores and regional distribution centres following what it described as a “surge in sales”. \nThe grocer, which has more than 700 UK stores, said that it saw 900,000 new customers walk through its doors last year. \nBoss Matthew Barnes said: “We need more high-performing individuals to help us achieve our growth plans. \n“In return, we offer market-leading pay and benefits and career development opportunities that are unrivalled in the supermarket sector.” \nThe jobs are predominantly at store assistant, assistant store manager and deputy store manager levels. Read More \nMr Barnes said earlier this year that Aldi could open more than 1,000 new stores, piling further pressure on its more established rivals. \nThe group said it remains on course to open 1,000 stores by 2022. \n“The success of Aldi in the UK is due to the hard work and commitment of our employees, and they are crucial to our future expansion plans,” the chief executive added. \nThe emergence of Aldi and its fellow German grocer Lidl has shaken the grocery sector’s so-called Big Four - Tesco, Asda, Sainsbury’s and Morrisons - who remain locked in a bitter price war sparked by the duo. \nSoaring inflation linked to the Brexit-hit pound is expected to see British consumers turn to cheaper options this year, providing a further boost for the pair. Read More Aldi and Lidl see sales surge as rising prices start to hit UK families \nMeanwhile Aldi has overtaken Marks & Spencer and Waitrose as the best performing supermarket for customer satisfaction in a biannual survey of thousands of UK consumers. \nThe UK Customer Satisfaction Index (UKCSI) by the Institute of Customer Service noted that Aldi had made the biggest gains among the supermarkets in sales and market share, while the three supermarkets with the lowest customer service levels - Tesco , Asda and Co-op Food - saw small drops in market share. Like us on Facebook", "external_links": [], "published": "2017-07-11T20:45:00.000+03:00", "crawled": "2017-07-11T21:45:51.005+03:00", "highlightTitle": ""}