{"organizations": [], "uuid": "992ac3ac9ba4067583018352ac0fa301eb6d9f3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/news/article230319.ece/ALTERNATES/s1200/Refugee-Centre-2.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/leicester-news/im-scared-every-night-asylum-230314", "country": "US", "domain_rank": 48128, "title": "'I'm scared every night' - Asylum seeker sleeping rough in Leicester parks tells of her constant fear of being attacked - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.116, "site_type": "news", "published": "2017-07-23T13:06:00.000+03:00", "replies_count": 0, "uuid": "992ac3ac9ba4067583018352ac0fa301eb6d9f3d"}, "author": "Heba Yousef", "url": "http://www.leicestermercury.co.uk/news/leicester-news/im-scared-every-night-asylum-230314", "ord_in_thread": 0, "title": "'I'm scared every night' - Asylum seeker sleeping rough in Leicester parks tells of her constant fear of being attacked - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "chris gord", "sentiment": "neutral"}, {"name": "jo cox", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "chris gordon", "sentiment": "none"}, {"name": "ghazl abd", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "eritrea", "sentiment": "none"}, {"name": "victoria park", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "belgrave", "sentiment": "none"}, {"name": "abbey park", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "melton road", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "loughborough", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "leicester print workshop", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "An asylum seeker speaks to a Leicester Mercury reporter at the City of Sanctuary. (Image: Chris Gordon) Share \nAn asylum seeker sleeping rough in the city has spoken about her nightly fear of being attacked. \nThe 26-year-old from Eritrea in eastern Africa, is among the refugees attending City of Sanctuary each week for free food. \nShe said she had been kicked out of her home since her application for asylum was rejected and she was sleeping rough in parks while awaiting deportation. \nShe said: “I’m scared every night. I have to sleep in Victoria Park, sometimes Abbey Park. \n“I’m scared I might get raped at night. \n“Every day I’m crying and I’m stressed. I don’t have anywhere to go. \n“I only get £10 a week in the form of gift cards - not even cash. That isn’t fair. \n“We don’t get shelter and when we go to charities or homeless shelters they just give us vouchers and advice.” Read More Textiles giant Wolsey leaving Leicester after 250 years in the city Volunteer and refugee Ghazl Abd, 35 speaks to an asylum seeker. (Image: Chris Gordon) \nSince losing her home, the woman, who asked not to be identified, has befriended a 21-year-old Eritrean man who is in the same situation as she awaits deportation. \nHe said he had fled religious persecution in Eritrea and had previously lived on a boat in Turkey and later Greece. \nHe had come to the UK hoping to be able to study but found the country had not lived up to his expectations. \nHe said: “I find it very difficult to live and I have no education. There are English classes here but that is only one day a week. It isn’t enough. \n“We come here to the City of Sanctuary one day a week because they offer us food, but what about the other six days? Am I not supposed to eat?” \nA 36 year old mother of two twin babies, who is currently appealing for leave to stay in the UK, explained how she shares a small place with another woman and her children in Belgrave, Leicester. Read More Loughborough MP Nicky Morgan calls police after Twitter troll's 'Jo Cox' Brexit threat Leicester Print Workshop are offering free courses to asylum seekers and refugees. (Image: Chris Gordon) \nShe said: “There are wires on the floors and only one bed. There is no room for my children to play or move around freely and it’s dangerous. \n“I’ve been placed on Melton Road and that’s too far away from the City of Sanctuary or any other aid. I asked for a bus pass but I was refused. \n“After the Home Office refuse us they forget about us.” \nFor more information about City of Sanctuary, which is a registered charity, visit their website . How the process of seeking asylum in the UK works Refugees and asylum seekers can get advice, food and clothing and companionship at the centre. (Image: Chris Gordon) \nPeople coming to the UK as refugees need to apply for permission to stay. That means they must prove they are unable to go back home because of persecution. \nAfter applying they are invited to meetings with an immigration officer and their caseworker and after making their application they usually have to wait about six months for a decision. \nIn most cases people will not be allowed to work while waiting for their decision but they are given some help with living expenses. \nHowever, some people can be detained at an immigration removal centre while they wait for a decision. \nAfter a decision is made, each applicant is allowed an appeal against the decision. Read More \nAt the end of the process, some asylum seekers will be allowed to stay, some will be given “leave to remain” for a limited period and others will be asked to leave. \nFailed asylum seekers are offered help with the expense of leaving the country. \nThose that fail to leave face being detained at an immigration removal centre and then sent home. Like us on Facebook ", "external_links": [], "published": "2017-07-23T13:06:00.000+03:00", "crawled": "2017-07-23T13:39:16.000+03:00", "highlightTitle": ""}