{"organizations": [], "uuid": "c71684b0362b842c02fdf3fe0bec9db22b720f87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30432548/16074839.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/where-does-the-phrase-nigger-in-the-woodpile-used-by-anne-marie-morris-come-from/story-30432548-detail/story.html", "country": "GB", "title": "EdOldfield published Where does the phrase 'N****r in the woodpile' used by Anne Marie...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T17:26:00.000+03:00", "replies_count": 0, "uuid": "c71684b0362b842c02fdf3fe0bec9db22b720f87"}, "author": "EdOldfield", "url": "http://www.devonlive.com/where-does-the-phrase-nigger-in-the-woodpile-used-by-anne-marie-morris-come-from/story-30432548-detail/story.html", "ord_in_thread": 0, "title": "EdOldfield published Where does the phrase 'N****r in the woodpile' used by Anne Marie...", "locations": [], "entities": {"persons": [{"name": "anne marie", "sentiment": "none"}, {"name": "edoldfield", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "agatha christie", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "john redwood", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "edoldfield", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "wikipedia", "sentiment": "none"}, {"name": "huffington post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Where does the phrase 'N****r in the woodpile' used by Anne Marie Morris come from? By EdOldfield   0 COMMENTS SHARES Newton Abbot MP Anne Marie Morris Where does the phrase 'N****r in the woodpile' used by Anne Marie Morris come... X \nCopy link to paste in your message / Comments (0) \nThe phrase 'nigger in the woodpile' came from the United States and was commonly used in the late 19th and early 20th century. Its usage has declined following controversy over the word in more recent times. \nAccording to the online encyclopedia Wikipedia, its origin lies in the so-called 'Underground Railway' - the route to freedom used by fugitive slaves from the south of the United States in the mid 18th century. Slavery continued in the south while it was outlawed in the northern states. \nThe suggestion is that the phrase referred to people hiding people in the piles of firewood stacked outside homes during their flight. It could also refer to people hiding in stacks of pulpwood carried inside railway carriages during the era of slavery. \nThe definition according to Wikipedia is: \"some fact of considerable importance that is not disclosed - something suspicious or wrong\". \nRead more: Anne Marie Morris recorded using offensive 'N****r in the woodpile' phrase \nThe falling out of use of the word, now often referred to in popular use of the n-word, also affected the title of a novel by Agatha Christie. 'Ten Little Niggers' was published by the crime writer, who spent much of her life in South Devon, in 1939. It was published in the United States under the title 'And Then There Were None', from the last line of the nursery rhyme Ten Little Indians. \nWikipedia describes the history of the word as as ethnic slur, which originated as a neutral term referring to people with black skin as a variation of the Spanish and Portuguese noun negro. It became a racist insult by the mid-20th century and began to disappear from popular culture. \nThe online English Oxford Living Dictionaries defines the word as: \"A contemptuous term for a black or dark-skinned person.\" \nRead more: Tory candidate distances herself from 'racist remark' made by her agent and partner at hustings \nIt adds under 'usage' that the word \"has been used as a strongly negative term of contempt for a black person since at least the 18th century. Today it remains one of the most racially offensive words in the language. Also referred to as 'the n-word,' nigger is sometimes used by black people in reference to other black people in a neutral manner (in somewhat the same way that queer has been adopted by some gay and lesbian people as a term of self-reference, acceptable only when used by those within the community).\" \nThe use of the word by Anne Marie Morris, Conservative MP for Newton Abbot, drew immediate criticism from politicians. \nShe made the astonishing remark while discussing what financial services deal the UK could struck with Brussels after 2019, the Huffington Post reports. \nDespite using the racist term, none of her fellow panelists, including Tory MPs Bill Cash and John Redwood, reacted to the comment. \nRead more: Anne Marie Morris apologises after being recorded using the N-word at Brexit meeting \nAfter saying just seven per cent of financial services in the UK would be affected by Brexit, Morris, who campaigned to leave the EU, said: \"Now I'm sure there will be many people who'll challenge that, but my response and my request is look at the detail, it isn't all doom and gloom. \n\"Now we get to the real n****r in the woodpile which is in two years what happens if there is no deal?\" \nThe comments came at the launch of a report into the future for the UK's lucrative financial sector after Brexit.", "external_links": [], "published": "2017-07-10T17:26:00.000+03:00", "crawled": "2017-07-10T19:22:19.007+03:00", "highlightTitle": ""}