{"organizations": [], "uuid": "35e4c727c13a8bd0f40eba998a5d35d1475a1bac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11981959.ece/ALTERNATES/s1200/ASR_0510_-Mike.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-car-parts-giant-13265504", "country": "GB", "domain_rank": 21960, "title": "North East car parts giant Nifco UK on track for £90m turnover by 2020", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-02T15:00:00.000+03:00", "replies_count": 0, "uuid": "35e4c727c13a8bd0f40eba998a5d35d1475a1bac"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-car-parts-giant-13265504", "ord_in_thread": 0, "title": "North East car parts giant Nifco UK on track for £90m turnover by 2020", "locations": [], "entities": {"persons": [{"name": "matthews", "sentiment": "none"}, {"name": "mike matthews", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "nifco uk", "sentiment": "none"}, {"name": "yarm road", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "durham road", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "nifco uk", "sentiment": "none"}, {"name": "bmw mini", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "renault", "sentiment": "none"}, {"name": "nifco", "sentiment": "none"}, {"name": "labone", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}, {"name": "general motors", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "jaguar", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "vauxhall opel", "sentiment": "none"}, {"name": "consett", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East car parts giant Nifco UK on track for £90m turnover by 2020 The firm has chalked up its eighth successive year of growth and expects to see revenues reach £73m this financial year Share Mike Matthews, managing director of Nifco UK (Photo: www.ianmacphotos.co.uk) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East car parts manufacturer Nifco UK said it is on course to reach turnover of £90m by 2020 after recording its eight successive year of growth. \nThe Eaglescliffe business, which makes parts used by the likes of BMW Mini, Ford, General Motors, Honda , Jaguar Landrover, Nissan, Renault, Toyota and Vauxhall Opel, chalked up record turnover of £71m in 2016, a 14% increase on the previous year, \nOperating profit also grew, from £5.7m to £8.7m, in a year which saw a continued steady increase in volumes. \nThe firm, which employs more than 650 people, show the record results which represent the 8th consecutive year of growth for the company. \nMike Matthews, managing director of Nifco UK, said he was pleased with the growth the company, which employs more than 650 people. \nHe said: “We are clearly very pleased with what we have achieved at the close of our last financial year. \n“The upward trajectory continues, and this has once again been a controlled year of growth, with the team being added to along the way to ensure that we have the capacity to deliver against our expanding order book.” Mike Matthews MBE, managing director of Nifco UK and European operations officer \nThe sale of the company’s former site at Yarm Road for £1.65m to supermarket giant Lidl, also contributed to Nifco UK’s healthy results. \nMr Matthews added: “Last year, we secured the sale of our old facility, which was undoubtedly a boost for us, but that notwithstanding, the year was a very healthy one, and we are pleased to have been able to deliver very focused, strategic growth.” \nIn a report accompanying the accounts, Mr Matthews said the firm had been unaffected by the Brexit vote, but that it may see pricing pressure during this year. Read More Consett car parts maker Labone sees turnover edge towards £15m mark \nHe said: “During 2016 the GBP weakened against the Euro compared to 2015 particularly after Brexit referendum in June 2016. However this does not appear to have dampened demand for UK products. \n“£16m of annual nominations was achieved in 2016. Nearly 50% of all inquiries were converted into purchase orders in 2016. This consistent performance will see the company grow from £71m in 2016 to approximately £73m in 2017. \n“2017 will be a challenging year as Nifco copes with increased growth pressures on a year on year basis. Nifco continues to grow on the back of new business won in 2015 and 2016. \n“Brexit in 2016 did not impact our business significantly and currently we have a natural hedge of Euro sales and Euro purchases so operating profit is not expected to be significantly affected in 2017. However we have exposure to US dollars on purchase of tolling for the Far East which will increase costs. \n“Brexit moving forward is of concern. Business does not react well to uncertainty. \n“However fears highlighted during the referendum appear to have been overstated at least in the short term. Triggering of Article 50 has not seen any further significant impact on trading or exchange rates. \n“The uncertainty around the Brexit process and negotations with the EU may negatively affect future development. However in the short term at least new opportunities may emerge as export sales may increase on the back of GBP weakness and approximately over 80% of Nifco UK products are eventually exported either directly or indirectly. \n“Current projections see Nifco UK achieve somewhere in the order of £90m by 2020.” \nThe results follow an announcement, less than two years ago, that Nifco had won its largest ever single contract, a £50m deal with US car giant Ford. The contract came after Nifco moved to a multi-million pound facility in Durham Road, which now houses two factories, significantly increasing its capacity and capabilities. \nMr Matthews added: “There have been a great many positives for us in recent years, and we are thrilled to build on that. Fundamentally, Nifco’s success is down to the support of our clients and the hard work of the entire Nifco team, so it’s thanks to them that we’ve enjoyed another strong year.” Like us on Facebook ", "external_links": [], "published": "2017-07-02T15:00:00.000+03:00", "crawled": "2017-07-02T15:55:14.000+03:00", "highlightTitle": ""}