{"organizations": [], "uuid": "bda9c9c89a6f3a11e0c3583a5886ebcbe50ed898", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13322053.ece/ALTERNATES/s1200/asr_grays.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/special-features/experience-innovation-among-hallmarks-gsc-13321935", "country": "GB", "domain_rank": 21960, "title": "Experience and innovation are among the hallmarks of GSC Grays' new farm business team", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-17T02:00:00.000+03:00", "replies_count": 0, "uuid": "bda9c9c89a6f3a11e0c3583a5886ebcbe50ed898"}, "author": "Anne Southby", "url": "http://www.chroniclelive.co.uk/special-features/experience-innovation-among-hallmarks-gsc-13321935", "ord_in_thread": 0, "title": "Experience and innovation are among the hallmarks of GSC Grays' new farm business team", "locations": [], "entities": {"persons": [{"name": "alnwick    july", "sentiment": "none"}, {"name": "rob", "sentiment": "none"}, {"name": "calum gillhespy", "sentiment": "none"}, {"name": "robert", "sentiment": "none"}, {"name": "sam dale", "sentiment": "none"}, {"name": "ali gray", "sentiment": "none"}, {"name": "guy coggrave", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}, {"name": "robert sullivan", "sentiment": "none"}, {"name": "ali", "sentiment": "none"}, {"name": "ben rogerson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "cawledge business park", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "chester-le-street", "sentiment": "none"}], "organizations": [{"name": "gsc grays", "sentiment": "negative"}, {"name": "lambton estate", "sentiment": "none"}, {"name": "gsc", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Experience and innovation are among the hallmarks of GSC Grays' new farm business team North East based land agents celebrate an auspicious July by unveiling successful new appointments Share The new team will be based at new GSC Grays offices in Chester-le-Street and Alnwick Share Get daily   \nJuly is turning out to be an auspicious month for North East based land agents GSC Grays, which is celebrating the appointment of a new farm business team. \nThe team, based at new GSC Grays offices in Chester-le-Street and Alnwick, will be headed up by Robert Sullivan. \nRobert, who has lived in County Durham for many years, has more than 25 years of experience of providing advice and guidance on all aspects of the modern farming business to clients across the whole of the North East and Yorkshire. \nThrough the provision of technical, business and strategic consultancy advice to farmers and land owners, Robert has developed a significant client base over the years, having initially worked for ADAS, before establishing and developing a farm business consultancy team for a national firm of rural surveyors. \nRobert’s specific areas of expertise include: agronomy advice, farm management, strategic business planning, contract farming, share farming agreements and joint ventures, farm business consultancy, basic payment and cross compliance advice, farm business reviews and restructuring. \n“I am thrilled to be joining GSC Grays as head of the new farm business team. Their ethos of putting their clients first is very important to me, especially in these uncertain times.” said Rob. \n“Establishing the new farm business team seamlessly complements the current areas of expertise within GSC Grays. It provides our growing client base with a complete range of consultancy services for all their rural advice”. \nThe new Chester-le-Street office, which Robert will be heading up, is situated in the Bowes offices on Lambton Estate, part of a number of converted former estate farm buildings and providing easy access to all parts of County Durham and beyond. \nAli Gray, rural director, has also joined GSC Grays to work alongside Robert and he will be heading up the new GSC Grays office on Cawledge Business Park in Alnwick. \nAli is well known across Northumberland and the North East and is an experienced farm business consultant, who has lived and worked in Northumberland for 14 years. \nHaving grown up living and working on a family farm, Ali’s focus is very much on farm business services. \nAli has experience of working with a number of progressive farming clients throughout Northumberland and Durham, dealing with a range of activities from running farms in a farm management capacity, through to dealing with subsidy and environmental scheme applications. \nAli said: “At a time when farmers are facing significant challenges and changes, joining GSC Grays in this new role will allow me to focus on what I do best and help steer our industry through Brexit. “Opening the new office in Alnwick is an additional challenge, but one I am enthusiastic about making successful”. \nAli can advise on all aspects of farm business financial management, budgeting, financial monitoring, whole farm appraisals and an assortment of farming arrangements. Ali also specialises in rural development grant applications, helping clients research, plan, secure consents, finance and set up new diversified enterprises. \nRob and Ali will also be joined by farm business consultants Ben Rogerson and Sam Dale, who have previously both worked with Rob and Ali for a number of years. \nIn addition to the farm business services on offer, both offices are supported by a land agent and project management team under the guidance of Calum Gillhespy, one of the company’s founding shareholders. \nThis team can provide a range of advice on matters as diverse as landlord and tenant, planning and development and valuation and project management – complementing the services offered by the new Farm Business team. \nGuy Coggrave, managing director of GSC Grays said: “The opening of the Chester-le-Street and Alnwick offices is an exciting development for our business and enables us to service our increasing client base in north Durham and Northumberland, and provides a great platform for further growth. \n\"Given the current economic uncertainty for many in the wider countryside due to Brexit and the associated economic climate, the opening of the farm business department couldn’t have come at a more apt time, when many farmers and landowners will be having to look differently and in detail at their business performance and structures. \n“Robert and Ali are ideally placed to work alongside landowners and farmers across the region to ensure they and their assets are delivering the best returns possible and I am delighted to have both them and their team on board, at the start of what is an exciting new chapter for GSC Grays.” \nFor more information on the services available through the new farm business team or to get in touch with Robert or Ali, click here . Like us on Facebook", "external_links": [], "published": "2017-07-17T02:00:00.000+03:00", "crawled": "2017-07-17T02:28:08.007+03:00", "highlightTitle": ""}