{"organizations": [], "uuid": "a0a77d0984304bb33ab2939fa06cf43f0c448610", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.exeterexpressandecho.co.uk/images/localworld/ugc-images/276269/site/sitelogoimage-1391102248963.png", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/farmer-denies-handling-transit-van-stolen-from-teignmouth/story-30432716-detail/story.html", "country": "GB", "title": "EdOldfield published Farmer denies handling Transit van stolen from Teignmouth", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T19:05:00.000+03:00", "replies_count": 0, "uuid": "a0a77d0984304bb33ab2939fa06cf43f0c448610"}, "author": "EdOldfield", "url": "http://www.devonlive.com/farmer-denies-handling-transit-van-stolen-from-teignmouth/story-30432716-detail/story.html", "ord_in_thread": 0, "title": "EdOldfield published Farmer denies handling Transit van stolen from Teignmouth", "locations": [], "entities": {"persons": [{"name": "ted davenport farmer de", "sentiment": "none"}, {"name": "searle", "sentiment": "none"}, {"name": "thomas hutchings", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "kingsteignton", "sentiment": "none"}, {"name": "laura searle", "sentiment": "none"}, {"name": "hutchings", "sentiment": "none"}, {"name": "joshua", "sentiment": "none"}], "locations": [{"name": "nevada construction's", "sentiment": "none"}, {"name": "shaldon road", "sentiment": "none"}, {"name": "kingsteignton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "edoldfield", "sentiment": "none"}, {"name": "teignmouth farmer", "sentiment": "none"}, {"name": "broadmeadow industrial estate", "sentiment": "none"}, {"name": "exeter crown court", "sentiment": "none"}, {"name": "hayward farm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farmer denies handling Transit van stolen from Teignmouth By EdOldfield | Posted: July 10, 2017 By Ted Davenport The court case relates to a Ford Transit Van Farmer denies handling Transit van stolen from Teignmouth X \nCopy link to paste in your message / 1 \nA farmer has denied handling a stolen Transit van which he was found dismantling in a shed on his land. \nThomas Hutchings said he was out checking his sheep during lambing season when he saw a stranger pull up in the lane next to his farm near Teignmouth with the truck on a trailer. \nHe said the driver asked if he could store it at his farm for the night but he ended up buying the tipper for £1,800 for scrap. \nHutchings, who runs a groundworks company in Kingsteignton, told Exeter Crown Court he only wanted the engine out of the vehicle, from which many parts had already been removed. \nHe said he did not ask for a receipt or any paperwork because he assumed the Transit was on its way to a scrap yard and so nothing was needed. He did not know the name of the man who sold it. \nIn fact, the truck had been stolen from just outside Nevada Construction's yard on the Broadmeadow Industrial Estate earlier that evening and was worth about £8,000. \nIt was fitted with a tracker and found by police four miles away at Hutchings' Hayward Farm on Shaldon Road, Teignmouth, two days later. Hutchings and his brother Joshua were in the process of dismantling it and were about the remove the engine. \nHutchings, aged 28, of Rydon Acres, Kingsteignton, denies handling stolen goods. \nRead more: Anne Marie Morris apologises after being recorded using the N-word at Brexit meeting \nMiss Laura Searle, prosecuting, said the truck, valued at £8,000 to £10,000 and with a newly replaced gearbox, was stolen in December 2015 and traced through a GPS tracker to Hayward Farm. \nThe tracker showed that despite the distance being only 4.3 miles, the journey had taken an hour and 42 minutes. It was found in a shed where Hutchings was working on it. \nHe said he had bought it from a stranger but had no suspicion it was stolen. \nMiss Searle said: \"The circumstances in which it was bought from a stranger, at night, with no details and no receipt for handing it over are so dodgy you can be sure he must have known it was stolen when he bought it.\" \nHutchings said he was out lambing as it was getting dark and went to investigate headlights near a gate because he thought it may be fly tippers. \nHe said he found a man towing the truck who asked him if he had anywhere where he could store it overnight. He said he was taking it to a scrap yard and after a short conversation he agreed to buy it. \nHe had cash handy because he had just sold his VW Golf for £3,000 and agreed a price of £1,800. He did not think he needed any paperwork because the tipper was intended for scrap. \nHe said:\"I had been lambing and was tired because it is a 24 hour job. I know on paper this looks terrible but it is just something that happened. I don't think like a police officer. I don't look at someone and ask if they are a criminal. \n\"I did not feel in was that necessary to ask where it came from because it was going to salvage. I saw it as an opportunity to have an engine that could be of help in the future. \n\"If I knew then what I know now I would not have bought it in the first place. I cannot stress that enough.\" The trial continues. ", "external_links": [], "published": "2017-07-10T19:05:00.000+03:00", "crawled": "2017-07-10T19:21:57.003+03:00", "highlightTitle": ""}