{"organizations": [], "uuid": "bb0db8452be22c7bf9f3f7c9c3a374ea0e69820a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12731984.ece/ALTERNATES/s1200/JS112401045.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13284698", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Bovis Homes sets further £3.5m aside for customer complaints", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-06T10:00:00.000+03:00", "replies_count": 0, "uuid": "bb0db8452be22c7bf9f3f7c9c3a374ea0e69820a"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13284698", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Bovis Homes sets further £3.5m aside for customer complaints", "locations": [], "entities": {"persons": [{"name": "colin", "sentiment": "none"}, {"name": "edward thorpe", "sentiment": "none"}, {"name": "pekka rantala", "sentiment": "none"}, {"name": "redfern", "sentiment": "none"}, {"name": "colin thorpe", "sentiment": "none"}, {"name": "fred wilson", "sentiment": "none"}, {"name": "thorpe", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "arto nummela", "sentiment": "none"}, {"name": "coreena ford thorpes", "sentiment": "none"}, {"name": "peter thorpe", "sentiment": "none"}, {"name": "paul harrison", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "peter plumb", "sentiment": "none"}, {"name": "tim aisbitt", "sentiment": "none"}, {"name": "zeiss", "sentiment": "none"}, {"name": "andrew griffith", "sentiment": "none"}, {"name": "david buttress", "sentiment": "none"}], "locations": [{"name": "gosforth high street", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "stephenson quarter", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "kingsmill", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "bovis homes", "sentiment": "negative"}, {"name": "coreena ford newcastle", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "primark", "sentiment": "none"}, {"name": "reckitt benckiser", "sentiment": "none"}, {"name": "abf", "sentiment": "none"}, {"name": "bovis", "sentiment": "none"}, {"name": "hmd global", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "coreena ford primark", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "coreena ford reckitt benckiser", "sentiment": "none"}, {"name": "associated british foods", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "nokia", "sentiment": "none"}, {"name": "zeiss", "sentiment": "none"}, {"name": "bradley hall ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Newcastle hotel with 'unusually good hairdryers' named the most female-friendly in the UK \nOne of Newcastle’s leading hotels has been named the most female friendly in the UK . \nThe Crowne Plaza, in the city’s Stephenson Quarter, has been announced as the winner of the Solo Awards, which were set up by UK business travel management company Redfern to promote hotels which prioritise the needs of women business travellers. \nMore than 100 hotels were nominated with eight being shortlisted for the prize and visited by secret judges to decide the winner. \nThe Crowne Plaza was chosen based on its commitment for safety, with 24/7 concierge and thorough CCTV. The Crowne Plaza staff were also highly praised for their personable, friendly approach. Crowne Plaza Hotel, Newcastle (Photo: handout publicity) 8.55 Coreena Ford Thorpes of Gosforth is sold to new owners \nPOPULAR shop Thorpes of Gosforth has been sold to new owners – but it will remain a hardware store under the same name. \nThe store has dominated Gosforth High Street for 70 years, having been run by three generations of the Thorpe family since it was first opened by radio engineer Edward Thorpe senior. \nThe original owners, brothers Colin and Peter Thorpe, are now getting ready to retire, prompting its sale – and they say they are delighted that another family, led by Fred Wilson, has taken it on, hoping it will continue to sell its unusual mix of everything from bird seed to light bulbs. \nThe brothers said: “We are sad to sell the store after running it for three generations, however, we are incredibly pleased that another local family will be taking it over. We wish them the best of luck.” Peter and Colin Thorpe with Tim Aisbitt of Bradley Hall (Photo: Bradley Hall Ltd) 8.45 KEY EVENT Nokia teams up with German firm to create new smartphone technology \nFuture Nokia smartphones will feature imaging technology from optical giant Zeiss, aimed at creating “new imaging standards” for smartphones. \nThe deal with German imaging firm Zeiss will see the optical specialists work on the camera hardware and software of future Nokia smartphones, as well as services and screen quality technology. \nThe Finnish phone manufacturer has re-emerged following a new licencing deal on its brand with start-up HMD Global, and earlier this year launched a new version of the basic 3310 mobile phone, first released in 2000. \nHMD Global chief executive Arto Nummela said the company hoped to provide a better photography experience as a result of the new imaging partnership. \nHe said: \nCollaborating with Zeiss is an important part of our commitment to always deliver the very best experience for our customers. \nOur fans want more than a great smartphone camera, they want a complete imaging experience that doesn’t just set the standard but redefines it. \nOur fans expect it and, together with Zeiss, we’re delivering it - co-developed imaging excellence for all. \nThe two companies previously worked together on Nokia’s feature phones in the 2000s - including the N90, the first multi-megapixel camera phone, which launched in 2005. \nThe announcement follows Nokia’s confirmation of the release of their first three smartphones since their return - the Nokia 3, 5, and 6 - which will begin this month. \nThe Nokia 3 will go on sale in the UK on July 12, the 6 on August 2 and the Nokia 5 on August 16, however Zeiss camera technology will not be present in any of this generation of phones. All three devices are priced at less than £250 as the firm looks to obtain market share in the mid-range smartphone space. HMD’s chief marketing officer Pekka Rantala also suggested Nokia was exploring augmented reality (AR) technology. Arto Nummela, chief executive officer at HMD Global,at the Mobile World Congress wireless show in Spain earlier this year. 8.40 Coreena Ford Just East announces Peter Plumb as new chief executive \nOnline takeaway delivery firm Just Eat has named Peter Plumb as its new chief executive just two months after he stepped down from the helm of Moneysupermarket.com. \nMr Plumb will take on the top job on September 18, taking over from interim boss Paul Harrison, who will continue in his permanent role as chief financial officer. \nJust Eat’s former chief executive David Buttress stepped down at the end of March due to “urgent family matters”. \nMr Plumb was boss at price comparison group Moneysupermarket for eight years until his departure in May, a tenure which saw the group’s share price rise six-fold. \nAndrew Griffith, interim chairman of Just Eat, said: “Peter has an excellent track record of creating value for shareholders in high growth consumer digital businesses. \n“His passion for customers and innovation, as well as his international experience in driving brands, and proven capability to retain, deepen and build senior management teams, made him a standout choice for the board.” 8.35 Coreena Ford Reckitt Benckiser warns of permanent sales hit following global cyber attack \nHousehold goods giant Reckitt Benckiser has warned of a permanent hit to sales after last month’s massive worldwide cyber attack wrought havoc across its factories. \nThe Durex-to-Dettol firm said that, while the ransomware attack had now been largely contained, it is still working to resolve some issues more than a week after it first struck. \nThe group said around 2% would be wiped off like-for-like revenue growth in its second quarter after the attack significantly disrupted its manufacturing and orders systems across a raft of markets, including the UK. \nIt said some of its factories are still not back to normal operation. \nThe group expects some of the sales lost in the second quarter to be recouped in the current quarter, but warned that ongoing woes in its supply chain could see it lose some customers and orders permanently. \nIt said: “The attack did disrupt the company’s ability to manufacture and distribute products to customers in multiple markets across the RB Group. “Consequently, we were unable to ship and invoice some orders to customers prior to the close of the quarter. \n“Some of our factories are currently still not operating normally but plans are in place to return to full operation.” \nIt added: “The continued production difficulties in some factories mean that we also expect to lose some further revenue permanently.” 8.30 What's the FTSE latest? \nThe FTSE-100 index opened at 7367.60. \nThe pound at 8am was 1.2942 dollars compared to 1.2933 dollars at the previous close. The euro at 8am was 0.8766 pounds compared to 0.8768 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) 8.25 Coreena Ford Primark owner ABF boosted by strong fashion sales and weak pound \nPrimark owner Associated British Foods (ABF) has been boosted by strong sales at the low-cost fashion chain, as well as the Brexit-hit pound. \nRevenue at ABF rose 13% on a constant currency basis and 20% at actual exchange rates in the third quarter, driven by increased profitability at Primark. \nThe cut-price retailer benefited from strong Easter trading and its UK turnover is up 9% in the year to date. \nOverall, Primark sales are 13% ahead of last year at constant currency, and 21% at actual exchange rates. \nABF said in a trading update: “The results to date reflect a material translation benefit from the devaluation of sterling following the result of the UK referendum on EU membership in June last year. \n“At current exchange rates, the translation benefit will be significantly less in the last quarter of our financial year. \n“The underlying operating performance of the group during the third quarter was ahead of our forecast as a result of a stronger profit delivery from Primark which has marginally improved our group outlook for the full year.” \nABF, which also generates revenue in Asia, Europe and the Americas and also owns Twinings tea, Kingsmill bread and Silver Spoon, has benefited from sterling’s collapse following last year’s referendum vote. The Primark store, on Northumberland Street, Newcastle 8.20 KEY EVENT Builder Bovis allocates extra £3.5m to fund remedial work \nBovis Homes is to set aside another £3.5m to deal with customer complaints over the poor quality of its homes. \nThe house builder has already set aside £7m to cover remedial work and compensation for affected customers after the firm was dogged by complaints over homes that were sold unfinished and had electrical and plumbing faults. \nOn Thursday Bovis said the extra provision is to ensure it is “fully resourced” to complete work quickly. \nThe firm said: “We have made good progress addressing a high level of customer issues in the first half. \n“Following the CEO’s review of the business, the group has taken a further £3.5m of provision in the first half, taking the total one-off costs related to these legacy issues to £10.5m. \n“This further provision will ensure we are fully resourced to complete the works identified as swiftly as possible whilst at the same time delivering the appropriate high level of service to our new customers.” \nIn February, Bovis announced a raft of improvement measures, including having more staff to deal with complaints, the creation of a dedicated homebuyers’ panel and an improved quality assurance process. \nBovis also said it would slow the rate at which it builds homes in 2017 as part of a “re-set” and now expects to deliver completion volumes for the full year at around 10% to 15% below the 2016 level. \nIn a half year trading update, the group said it delivered 1,512 completions compared to 1,601 in the same period in 2016 as demand “continues to be robust”. \nBovis noted first half profitability has been impacted by increased build costs and an increased level of investment to address legacy issues. \nThe sales rate slipped to 0.48 net private reservations per site per week, down from 0.62. The average selling price of its homes rose 9% to £277,000, driven by “changes in mix and a modest increase in average underlying prices”. A Bovis Homes development", "external_links": [], "published": "2017-07-06T10:00:00.000+03:00", "crawled": "2017-07-06T11:07:18.008+03:00", "highlightTitle": ""}