{"organizations": [], "uuid": "39c39a8cbbac54f55d762910bc326aaa3e7167ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13396021.ece/ALTERNATES/s1200/HS2-project.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/governments-rail-priorities-show-london-13396024", "country": "GB", "domain_rank": 21960, "title": "The Government's rail priorities show that London will always trump the North", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-27T20:00:00.000+03:00", "replies_count": 0, "uuid": "39c39a8cbbac54f55d762910bc326aaa3e7167ea"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/governments-rail-priorities-show-london-13396024", "ord_in_thread": 0, "title": "The Government's rail priorities show that London will always trump the North", "locations": [], "entities": {"persons": [{"name": "grayling", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}], "locations": [{"name": "north journ", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "northern powerhouse share transport", "sentiment": "none"}, {"name": "transpennine express", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Opinion The Government's rail priorities show that London will always trump the North Journal business editor Graeme Whitfield on how the row over rail downgrades is testing faith in the Northern Powerhouse Share Transport Secretary Chris Grayling (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAccording to the Conservative manifesto, closing the gap between London and the other cities of the UK is “the biggest prize in Britain today”. \nI know that manifesto is now a document with a roughly equivalent value to the Beano Annual of 1987, but even so, this week has seen backsliding from that worthy goal on a speed and scale rarely witnessed. \nFor those who missed it, Transport Secretary Chris Grayling cancelled electrification of rail lines in the regions - with an announcement headed: “New improvements for rail passengers in Wales, the Midlands and the North”, presumably hoping we’re all thick – and then said he was very much in favour of more rail spending in London. \nEven for Mr Grayling, whose CV includes Brexit and the employment tribunal reforms this week ruled illegal, this appears slightly dense. \nAlong with skills, transport – and in particular the ability to go from east to west in the North – is pretty much the main thing that business leaders tell me the Government needs to tackle. Downgrading the Government’s commitment to rail in the North is, at best, sending out the wrong signal and, more likely, a sign that London will always trump those pesky regions in terms of Government priorities. Read More Time for Ministers to grow up and stop Brexit disaster, says North East business chief \nAnyone who has had the misfortune to travel on the Transpennine Express will know that it is not so much a rail service as an elaborate in-joke. If that is the Express, passengers often comment, I’d hate to see the slow line. \nOver the last few years, I have tried to oppose cynicism to the Northern Powerhouse with the argument that anything that boosts the region’s economy and encourages us to find our own solutions to the challenges facing us is a good thing. \nBut as Mr Grayling blunders about and the Northern Powerhouse Minister says that concerns about rail downgrades are “scaremongering”, I’m finding it harder than ever to maintain that stance. Read More Deal or no deal? How Brexit is becoming a nightmare game show \nThe Cabinet, it’s worth pointing out, contains 10 MPs from constituencies in the South East, three from London and none from either the North East or the North West. (David Davis represents a seat in Yorkshire but he’s as much a Northerner as I am a Dutchman). \nOf course, that doesn’t necessarily translate into neglect of the North, but it looks an awful lot like that right now. \nAnd if boosting the regions really is “the biggest prize in Britain today”, the Government doesn’t look very much like it wants to win it. \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2017-07-27T20:00:00.000+03:00", "crawled": "2017-07-27T20:48:52.002+03:00", "highlightTitle": ""}