{"organizations": [], "uuid": "d99335c21f591e509f642c37006705cf096e8634", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30438610/16078975.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/sponsored/story-30438610-detail/story.html", "country": "US", "title": "Sponsored: Queen's Speech brings plenty for UK employers | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2017-07-13T18:51:00.000+03:00", "replies_count": 0, "uuid": "d99335c21f591e509f642c37006705cf096e8634"}, "author": "Western Morning News", "url": "http://www.devonlive.com/sponsored/story-30438610-detail/story.html", "ord_in_thread": 0, "title": "Sponsored: Queen's Speech brings plenty for UK employers | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon live lauren fawcett", "sentiment": "none"}, {"name": "spee", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "queen's speech", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "taylor review", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lauren Fawcett, Trainee Solicitor at Wolferstans in Plymouth examines the impact of the Queen's Speech on the UK's employment law. \nUnsurprisingly, the main focus of the Queen's Speech on June 21 was Brexit. \nUnusually, the speech summarised legislative changes proposed over the next two years, as it has already been announced that there will be no Queen's Speech in 2018. Despite the Brexit focus, the speech did cover some areas of interest to employers. \nOn exiting the EU, the Repeal Bill will mean that existing EU law will be converted into UK law alongside powers enabling corrections to laws that may not otherwise operate appropriately. \nThere was an exception in relation to immigration, instead the Immigration Bill was announced which will establish a new national policy on immigration. \nThis largely affects the free movement principles which would otherwise have been automatically converted into UK law on exiting the EU. Essentially, it means that EU nationals will be subject to current immigration rules applying to non-EU nationals. \nAlso the National Living Wage (NLW), which applies to workers aged 25 and over, will increase to 60% of median income by 2020. At present this is forecasted to reach £8.75. After 2020 the increases will be in line with the average earnings. \nA hot topic is the rise in the 'gig economy', affecting workers such as Deliveroo and Uber drivers. Although more prominent in the Tory manifesto, the Speech did make reference to this but only briefly stating said that we must wait until the Taylor Review is published in the next few weeks. The review will consider how the employment market may need to change to keep up to speed with new business models and ways of working. No further commitment to worker's rights was given so this remains a grey area. \nThe Speech also referred to further progress to tackle the gender pay gap and reducing discrimination in the workplace against people based on race, faith, gender, disability or sexual orientation. But no specific measures were announced for this to be achieved. The manifesto went into further detail with plans to ask large employers to publish information on the pay gap for people from different ethnic backgrounds but this made no appearance in the Speech. \nInterestingly, various other family-friendly pledges have been dropped from the Tory manifesto, even those that seem easiest to achieve. \nExamples include a statutory right to carer's leave, supporting employers to take on parents and carers returning to work after long periods of absence and a statutory right to bereavement leave for parents who have lost a baby. \nOne thing from the Speech is that the employment law points mentioned remain in extremely vague terms and appear rather low on the political agenda. Although this is hardly surprising given the post-Brexit uncertainties looming over us. On a positive note, in a period where the uncertainty of Brexit is a worry for most firms, any big changes in coming years relating to their employees seem rather unlikely.", "external_links": [], "published": "2017-07-13T18:51:00.000+03:00", "crawled": "2017-07-13T15:00:29.004+03:00", "highlightTitle": ""}