{"organizations": [], "uuid": "6415cb881202ff95b33ccf2feadfbb6f58cbf42c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i1.leicestermercury.co.uk/incoming/article245834.ece/ALTERNATES/s1200/David-Marlow-chief-executive-of-The-Nottingham.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/nottingham-reports-healthy-profit-rise-245797", "country": "GB", "domain_rank": 48128, "title": "The Nottingham reports healthy profit rise - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.492, "site_type": "news", "published": "2017-07-27T15:15:00.000+03:00", "replies_count": 0, "uuid": "6415cb881202ff95b33ccf2feadfbb6f58cbf42c"}, "author": "Lauren Mills", "url": "http://www.leicestermercury.co.uk/news/business/nottingham-reports-healthy-profit-rise-245797", "ord_in_thread": 0, "title": "The Nottingham reports healthy profit rise - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "david marlow", "sentiment": "none"}, {"name": "thetford", "sentiment": "none"}, {"name": "huntingdon", "sentiment": "none"}], "locations": [{"name": "stamford", "sentiment": "none"}, {"name": "bourne", "sentiment": "none"}, {"name": "fakenham", "sentiment": "none"}, {"name": "spalding", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "dereham", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "leicester mercury news the nottingham", "sentiment": "negative"}, {"name": "leicester tigers", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "shepshed building society", "sentiment": "none"}, {"name": "handmade burger co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The Nottingham reports healthy profit rise A building society is is opening more branches, launching a loyalty programme and cracking down on cyber crime Share David Marlow, chief executive of The Nottingham Share Comments \nA building society is bucking the trend of branch closures as it reports another strong rise in profits. \nThe Nottingham, which took over Shepshed Building Society in 2013 and sponsors Leicester Tigers, said profits rose 7 per cent to £more than £7.5 million in the six months to the end of June. Read More East Midlands Airport announces £2.5m improvement package \nThe building society plans to open seven new branches in Bourne, Spalding, Stamford, Huntingdon, Dereham, Thetford and Fakenham by the end of this year. \nThe business said lending was up by more than a third to £544 million compared to the same time last year, with mortgage book growth of 7.1 per cent. \nIt added that arrears levels remain at a historic low. \nDavid Marlow, chief executive of The Nottingham, said: “At the beginning of the year we undertook to continue to grow the society, invest in improving our offering and service as well as look at how we could build and reward loyal membership of The Nottingham. Read More Hundreds of jobs saved as Handmade Burger Co sold \n“At the half year point we are pleased to report good progress in all of these objectives. \n“ Investment in our technology infrastructure is key to both enhancing our offering and developing our defences against the ever-increasing threat of cyber-crime. \n“At The Nottingham we are well advanced in our project to house all of the society’s key systems in state-of-the-art dedicated data centres, as well as announcing a partnership with globally renowned technology and customer experience experts Salesforce. Read More Joules flouts Brexit woes with huge jump in profits \n“This will enable us to provide members with access to our unique advice and service proposition in a manner of their choosing; seamlessly combining phone, tablet, PC and face-to-face advice and service in our growing branch network. The scale of the investment required to achieve these important improvements highlights the society’s ambition, confidence and financial strength. \n“We were also delighted to launch our member rewards programme in May. Central to our strategy is to support and reward our loyal members for doing the right thing to protect and plan for their family’s financial future, through providing our unique combination of advice and service all available under one roof. Read More Leicester steakhouse shortlisted for prestigious design award \n“Our member rewards programme is designed to reward our loyal members for doing just that, through a range of unique discounts and offers. Benefits range from £500 off estate agency fees, to discounted fees for making a will, free access to whole-of-market mortgage advice against a standard advice fee of £249 and access to enhanced savings rates.” Like us on Facebook ", "external_links": [], "published": "2017-07-27T15:15:00.000+03:00", "crawled": "2017-07-27T19:18:04.010+03:00", "highlightTitle": ""}