{"organizations": [], "uuid": "d405020314f8ea6455aa85c46f8bf7caeddea9ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30434070/16075710.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/newton-abbot-tories-back-anne-marie-morris-and-say-they-won-t-call-for-her-to-resign/story-30434070-detail/story.html", "country": "US", "title": "Newton Abbot Tories back Anne Marie Morris and say they won't call for her to resign | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2017-07-11T20:17:00.000+03:00", "replies_count": 0, "uuid": "d405020314f8ea6455aa85c46f8bf7caeddea9ed"}, "author": "", "url": "http://www.devonlive.com/newton-abbot-tories-back-anne-marie-morris-and-say-they-won-t-call-for-her-to-resign/story-30434070-detail/story.html", "ord_in_thread": 0, "title": "Newton Abbot Tories back Anne Marie Morris and say they won't call for her to resign | Devon Live", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "marie chadwick", "sentiment": "none"}, {"name": "richard younger-ross", "sentiment": "none"}, {"name": "roger kendrick", "sentiment": "none"}, {"name": "mrs chadwick", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "sylvia russell", "sentiment": "none"}, {"name": "john redwood", "sentiment": "none"}, {"name": "devonlive", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "teignbridge", "sentiment": "none"}, {"name": "central london", "sentiment": "none"}], "organizations": [{"name": "newton abbot tories", "sentiment": "none"}, {"name": "devon live newton abbot tories", "sentiment": "none"}, {"name": "newton abbot conservatives association", "sentiment": "none"}, {"name": "newton abbot constituency", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "cchq", "sentiment": "none"}, {"name": "newton abbot conservatives", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newton Abbot Tories back Anne Marie Morris and say they won't call for her to resign By DanielClark | Posted: July 11, 2017 4 COMMENTS SHARES Sylvia Russell, president of the Newton Abbot Conservatives Association (left) has said Anne Marie Morris (right) does not need to resign Newton Abbot Tories back Anne Marie Morris and say they won't call for her to...   Sylvia Russell, president of the Newton Abbot Conservatives Association (left) has said Anne Marie Morris (right) does... Comments (4) \nNewton Abbot Conservatives say they have no intention of calling for Anne Marie Morris to resign as an MP. Ms Morris, the MP for Newton Abbot, described the UK leaving the EU without a deal as a \"real n r in the woodpile\" at the launch of a report into the future for the UK's lucrative financial sector after Brexit. \nShe has since apologised for the remarks, saying: \"The comment was unintentional and I apologise unreservedly for any offence caused.\" \nBut she has had the whip suspended by the Conservative Party, which means that although she is still an MP, she is no longer a Conservative MP. \nSylvia Russell, president of the Newton Abbot Conservatives Association, said that her remarks were inappropriate but said they won't be calling for her resignation. \nShe told Devon Live \"Anne Marie Morris is an excellent MP for the Newton Abbot Constituency and she has never made a wrong move in the seven years that she has been the MP, and massively increased her majority. \n\"It is a pity that she has found herself in this situation and clearly it was inappropriate to say, but she has apologised for it. \n\"She should definitely not resign. She is a very good MP and we have no intention of asking or calling for her to resign as an MP as a result of this. \n\"The length of her suspension from the whip is a matter for the Prime Minister to decide on but I hope that it will be proportionate. \n\"She still has a lot of offer to the public as an MP, particularly with her experience in business. \n\"She isn't the first and she won't be the last to say something that is wrong.\" Read More Anne Marie Morris' surgery event on Thursday WILL still go ahead... \nAn urgent investigation into the remarks had been launched by the Conservative Party. A spokesman for CCHQ said: \"We are aware of these reports, this kind of language is completely unacceptable, and we are urgently investigating.\" \nTheresa May said: \"I was shocked to hear of these remarks, which are completely unacceptable I immediately asked the Chief Whip to suspend the party whip. \n\"Language like this has absolutely no place in politics or in today's society.\" \nMs Morris is due to hold one of her regular surgeries to give residents in the Newton Abbot constituency an opportunity to meet with her and discuss any issues they may like to raise on Thursday. \nA spokesman for her confirmed to Devon Live on Tuesday morning that the surgery is still going ahead as planned. \nThe surgery takes place from 11am to 12pm at The Passmore Edwards Centre, Market Street, Newton Abbot. \nRather like a doctor's surgery, constituents are invited to book an appointment to discuss their concerns in advance. \nDevon Live readers have said that Anne Marie Morris should resign as an MP after she was recorded using the N-word at a meeting of eurosceptics in Central London, with a poll on our website saying that 82 per cent of our readers saying she should resign, while calls for her resignation that have been made by fellow politicians in Teignbridge. \nMarie Chadwick, who was the Liberal Democrat candidate at the General Election in June, has called for her resignation and said that she has shown her true colours with the remarks. \nMrs Chadwick said: \"She should resign and she needs to resign. She has a history of associating herself with people who hold dubious views and now she has shown that not only does she hold those views, she is not afraid to speak about them. \n\"You simply cannot have people who hold these views representing residents in parliament. \n\"It is worrying for the constituents that she is the MP who represents them and she has shown with these comments that she is simply not up to the job and she needs to resign. \nRichard Younger-Ross, who was the former MP for Teignbridge but lost his seat to her in 2010, said: \"Ms Morris is MP who does little except offend, is one of the worst MPs for replying to correspondence, an MP who seems to be rarely in her constituency, and an MP who seems to do little. \n\"If she was engaged with people, real people, she would not have said such an odious comment that offends people. \n\"She is simply out of touch. She will not resign as an MP, but she should make it clear that she will not re-stand.\" \nMs Morris made the astonishing remark while discussing what financial services deal the UK could struck with Brussels after 2019. \nDespite using the racist term, none of her fellow panelists, including Tory MPs Bill Cash and John Redwood, reacted to the comment. \nAfter saying just seven per cent of financial services in the UK would be affected by Brexit, Morris, who campaigned to leave the EU, said: \"Now I'm sure there will be many people who'll challenge that, but my response and my request is look at the detail, it isn't all doom and gloom. \n\"Now we get to the real n****r in the woodpile which is in two years what happens if there is no deal?\" \nIt comes just after she was forced to distance herself from comments made by her electoral agent and partner at a hustings who claimed 'that the crisis in education was due entirely to non-British born immigrants and their high birth rates'. \nDuring the debate around education and fair funding of schools, a member of the public stood up and said: 'that the crisis in education was due entirely to non-British born immigrants and their high birth rates'. \nThe person who made that remark was Roger Kendrick, who is both Anne Marie Morris's partner and her electoral agent. \nIn response, Anne Marie Morris told DevonLive: \"I don't share the views expressed by Roger Kendrick.\"", "external_links": [], "published": "2017-07-11T20:17:00.000+03:00", "crawled": "2017-07-11T15:20:31.024+03:00", "highlightTitle": ""}