{"organizations": [], "uuid": "8195c4caa76da2ef9f30dcac04507131a08405b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30445514/16083133.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/apprenticeship-levy-could-sink-smaller-firms-expert-warns/story-30445514-detail/story.html", "country": "US", "title": "Apprenticeship levy could sink smaller Devon firms, expert warns | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.168, "site_type": "news", "published": "2017-07-18T12:59:00.000+03:00", "replies_count": 0, "uuid": "8195c4caa76da2ef9f30dcac04507131a08405b1"}, "author": "", "url": "http://www.devonlive.com/apprenticeship-levy-could-sink-smaller-firms-expert-warns/story-30445514-detail/story.html", "ord_in_thread": 0, "title": "Apprenticeship levy could sink smaller Devon firms, expert warns | Devon Live", "locations": [], "entities": {"persons": [{"name": "boulting", "sentiment": "none"}, {"name": "mark boulting", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "customs", "sentiment": "none"}, {"name": "skills group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Apprenticeship levy could sink smaller Devon firms, expert warns By HannahFinch | Posted: July 18, 2017 0 COMMENTS SHARES Mark Boulting of Skills Group is concerned that the changes brought by the levy may be introduced too hard and fast for small organisations to cope with Apprenticeship levy could sink smaller Devon firms, expert warns X \nCopy link to paste in your message / Mark Boulting of Skills Group is concerned that the changes brought by the levy may be introduced too hard and fast for... Comments (0) \nThe apprenticeship levy could see smaller businesses fold, a Devon training provider has warned. \nIntroduced in April this year, the Apprenticeship Levy is one of the biggest shake-ups of the training sector in recent years. \nMark Boulting, managing director of Devon-based training provider Skills Group, fears it could see many businesses fold as they are unequipped to handle the changes. \nREAD MORE: This is why you won't be working nine-to-five in an office any more \nMr Boulting said: \"We are broadly supportive of the change in the long run. It is good news that the Government is raising funds but it has done it too fast with not enough forward planning, and that has put the whole system at risk.\" \nThe Apprenticeship Levy is a way the Government is trying to raise funds to make apprenticeships sustainable for the future. It involves raising funds from employers to be able to fund apprenticeships while also giving employers ownership to design apprentices to suit their needs. \nEmployers with payroll above £3 million have to pay 0.5% of this via HM Revenue and Customs. Approximately two per cent of all employers in the UK will be eligible to pay. It is viewed by many as another tax. \nFor big employers there will be a levy pot and they can choose an apprenticeship provider and spend money on apprentices. If it runs out, the Government pays 90% and the employer pay 10%, which should make it more sustainable for the future. \nSmall businesses have to pay a contribution of 10% for apprentices over 19-years-olds. For anyone they employ aged between 16 and 18, the funding comes from the Government unless the firm employs 50 or more people. There are also incentives to take on 16-18 year olds. \nREAD MORE: 17 young people reveal their hopes and fears for life in 2050 \nMr Boulting said: \"It is a huge change. The commitment of £3 billion from the levy is expected but the uptake has reduced because employers are getting used to the idea that they need to contribute to the cost.\" \nHe fears that pressure on the public sector to have 2.3% per cent of its workforce as apprentices will see roles 'badged as apprenticeships' in order to meet the criteria. \nHe said: \"The ones that will suffer most are young apprentices. \n\"According to published figures, the number of 16-18 year old apprenticeship opportunities has seen a significant drop of 75 per cent since the changes came in as it is easier for firms to retrain existing staff. \nWe think it is likely there will be a significant number of training businesses nationally that become insolvent. I also believe a third of business will fold because they are not geared up to deal with it. There is not much fat in the sector and it cannot deal with this amount of change.\" \nMr Boulting called for more stability in the industry. \nHe said: \"We have had three different ministers for skills, what other sector has had that much change in 12 months? \nEmployers need to get used to the idea that they need to contribute but in the short term may put it off and wait until they understand it more. \nThere are really difficult times ahead, and combined with the loss of overseas skills that Brexit will inevitably result in, we need good leadership and support more than ever.\" NEWS", "external_links": [], "published": "2017-07-18T12:59:00.000+03:00", "crawled": "2017-07-18T13:13:26.000+03:00", "highlightTitle": ""}