{"organizations": [], "uuid": "58efdc75d5c0d7c1fd07db69eb7f18de4ce834cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12510865.ece/ALTERNATES/s1200/CFR_NJL_250117toc_03JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13347725", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Newcastle property investors Tier One Capital to raise £700,000 in shares sale", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-19T10:15:00.000+03:00", "replies_count": 0, "uuid": "58efdc75d5c0d7c1fd07db69eb7f18de4ce834cf"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13347725", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Newcastle property investors Tier One Capital to raise £700,000 in shares sale", "locations": [], "entities": {"persons": [{"name": "andy rad", "sentiment": "none"}, {"name": "keith hamill", "sentiment": "none"}, {"name": "carolyn mccall", "sentiment": "none"}, {"name": "radcliffe", "sentiment": "none"}, {"name": "moya greene", "sentiment": "none"}, {"name": "esh", "sentiment": "none"}, {"name": "andy radcliffe", "sentiment": "none"}, {"name": "mccall", "sentiment": "none"}, {"name": "brian manning", "sentiment": "none"}, {"name": "talktalk", "sentiment": "none"}, {"name": "greene", "sentiment": "none"}], "locations": [{"name": "west auckland", "sentiment": "none"}, {"name": "fernhill", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "tier one capital", "sentiment": "negative"}, {"name": "esh group", "sentiment": "none"}, {"name": "toc property backed lending trust plc", "sentiment": "none"}, {"name": "metro radio arena", "sentiment": "none"}, {"name": "newcastle arena", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "talktalk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "coreena ford esh group", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "patrizia uk", "sentiment": "none"}, {"name": "chapman brown photography", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "coreena ford former royal boss moya greene", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "royal mail", "sentiment": "none"}, {"name": "talktalk  telecoms", "sentiment": "none"}, {"name": "pblt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Aviva sells Friends Provident for £340m \nInsurance giant Aviva has sold Friends Provident International to International Financial Group for £340m. \nAviva announced earlier this year that it had seen lower profits from Friends Provident - which serves high net worth clients in the Middle East and Asia - and was placing it under “strategic review”. \nFriends Provident booked a £2m post-tax loss in 2016 and the disposal comes just two years after the UK insurance firm acquired it as part of its £5.6bn takeover of Friends Life Group in April 2015. \nAviva said the sale will allow it to “reallocate capital” to more profitable parts of the business. Insurance giant Aviva has sold Friends Provident International to International Financial Group for £340m. 9.10 Coreena Ford AkzoNobel CEO stepping down for health reasons \nThe chief executive of AkzoNobel is to step down due to health reasons after defending the company from a prolonged 27 billion euro (£23.8bn) takeover attempt. \nThe Dulux owner has announced that Ton Buchner will relinquish his role with immediate effect, with Thierry Vanlancker appointed new chief executive. Most of Mr Buchner’s time this year has been spent fighting off an aggressive takeover charge from US chemicals giant PPG Industries , which was supported by activist investor Elliott Advisers. \nPPG abandoned its pursuit last month. \nMr Buchner, who joined AkzoNobel in 2012, said: “For me this was an extraordinarily difficult decision to make but my focus must now be on my health.” \nThe company lauded him for “significantly improving” its performance by increasing profitability and cash flow to record levels. \nAntony Burgmans, chairman of AkzoNobel’s supervisory board, said: “It is with great regret that Ton is stepping down due to health reasons. \n“He has been an outstanding leader for AkzoNobel, transforming the company and setting it up for future success. His focus on delivering for our customers and operational excellence has driven profitability to record levels, increasing returns to shareholders.” 9.05 Coreena Ford Newcastle's Hotel Du Vin unveils new bistro after significant investment \nA boutique hotel on Newcastle Quayside has unveiled a new bistro following a significant investment programme. \nTen years after Hotel Du Vin first opened its doors, the bistro has undergone a makeover to reflect the building’s nautical heritage, as part of a project spearheaded by Newcastle interior designers Dakota House of Design. \nThe interior design, architecture and visualisation studio, which works in the hospitality, leisure and residential sectors, with major brands such as Premium Country Pubs, Best Western Hotels and European casinos belonging to Caesar’s Palace in Las Vegas, was one of six shortlisted in the iDogi 2016 International Architecture and Design Awards for its work on Soho, a popular bar in Basel, Switzerland. The new Bistro at Hotel du Vin in Newcastle (Image: Hotel Du Vin) 9.00 Coreena Ford Irvins Brasserie closes in North Shields as chef winds up restaurant business \nA well-known North Shields restaurant has closed its doors , seven years after it was founded by a chef to the stars. \nIrvins Brasserie was opened in Irvin Building, a Grade II-listed building on North Shields fish quay by Graeme Cuthell in 2010. \nCuthell was once Andrew Lloyd Webber’s private chef and has cooked for the likes of Mick Jagger, Ben Elton, Kylie Minogue and the Beckhams. \nThe acclaimed chef, who had been at Hotel du Vin at Newcastle Quayside before taking the plunge with his own venture, wound up the business voluntarily on July 12, having battled tough trading conditions since the start of this year. \nIt is understood Mr Cuthell tried a number of tactics to save the business but ultimately they failed to bring customers through the doors. \nCommenting on the firm’s efforts Tait Walker partner Andrew Haslam, who acted as Irvins’ liquidator said: “The restaurant has ceased trading, the business has closed and we are in the process of selling off the company’s assets. \n“Turnover had fallen since the turn of the year. People just don’t have the money to spend. The owner had no option but to close it.” \nHe added: “Since the turn of the year he had been trying to turn it around. He had changed his headcount and he brought out new things on the menu. But for whatever reason, it wasn’t working for him.” \nThe restaurant premises at the Irvin Building have now been put up for sale with a £350,000 price tag by property agents Lofthouse & Partners. Irvins Brasserie on North Shields Fish Quay (Image: Newcastle Chronicle) 8.55 Coreena Ford Newcastle landlords' office investments keeps businesses rolling into the city \nCity centre property owners are driving forward significant investments to help counter a severe shortage of office space for incoming businesses, a new survey has confirmed. \nThe North East Office Agents Forum (NEOAF) revealed office take-up across the North East for the second quarter of this year was better than expected at almost 130,000sqft, despite some firms delaying moves to new offices in the wake of the General Election. \nIn Newcastle city centre , meanwhile, a continuing shortage of Grade A office space is driving a continuing trend among landlords to invest in properties , some of which are listed, to help meet the demand. \nJessica Simpson, senior surveyor at Naylors, said there remains a lack of Grade A supply within the city centre market, adding: “We are finding there is a continued demand for offices which have been refurbished to a high standard. \n“We are seeing that landlords are now having the confidence to carry out refurbishments in order to meet the current demand. Examples of refurbished space include Gainsborough House and Earl Grey House on Grey Street and St Nicholas Building. \n“As a result of the investment being made within buildings, landlords are starting to see deals occur.” The Grey Street, Newcastle, building which is set for a refurbishment (Image: Bradley Hall Ltd) 8.50 Coreena Ford Household goods giant Reckitt Benckiser agrees to sell food brands in £3.2bn deal \nHousehold goods giant Reckitt Benckiser has confirmed a $4.2bn (£3.2bn) deal to sell food brands including French’s mustard and Frank’s hot sauces to the maker of Schwartz spices. \nUS group McCormick fought off a number of rival bidders to secure the British firm’s food business in a move that will propel it to the number one position in America’s condiments market. \nIt comes a year after McCormick’s takeover battle to buy London-listed Mr Kipling’s cake firm Premier Foods failed. \nMcCormick said Reckitt’s food arm was a “perfect match” for the group and pledged to keep the well-known brand names, which also include Cattlemen’s BBQ Sauce. \nThe deal will create a combined group with annual sales of around $5bn (£3.8bn). McCormick boss Lawrence Kurzius said: “The addition of Frank’s RedHot hot sauce, the clear consumer favourite in an attractive and high-growth category, French’s Mustard and the other beloved products enables McCormick to become a one-stop shop for condiment, spice and seasoning needs.” \nFrank’s RedHot sauce is the number one brand in its market in the US and Canada, as is French’s Mustard. \nRakesh Kapoor, chief executive of Reckitt, said the sale is in line with its aims to refocus the group on its consumer health and cleaning products, which span a vast array of brands from Durex to Dettol. \nHe said: “This transaction marks another step towards transforming Reckitt Benckiser into a global leader in consumer health and hygiene, ensuring we continue to deliver for shareholders and give people innovative solutions for healthier lives and happier homes.” \nReckitt recently bought US baby formula maker Mead Johnson Nutrition in a mammoth $21.2bn (£16.3bn) deal to expand its consumer health arm. 8.45 Coreena Ford Wizz Air profits soar \nLow-cost European airline Wizz Air has reported a record set of results, helped by a strong Easter and high demand for travel in Eastern Europe. \nThe London-listed firm said revenue rose 29% to 469.3 million euros (£415 million) in the first quarter, while pre-tax profit soared 16% to 60.5 million euros (£53.5 million). \nWizz Air carried 7.2 million passengers in the period, a 25% increase compared with the same quarter last year as it opened up a further 10 routes, including to new airports in Russia, Kazakhstan and Morocco. \nChief executive Jozsef Varadi said: \nThe company experienced a particularly strong performance from Easter traffic in the first quarter. \nOur ultra-low cost base allows us to offer the lowest fares and that continues to stimulate the market for air travel in Central and Eastern Europe and, as economic growth in the region continues to push ahead of Western Europe, ever more customers take the opportunity to fly with Wizz Air. \nWizz Air now operates more than 500 routes to and from 42 countries. \nLast month the group hailed a “major investment in the UK” as it shrugged off Brexit uncertainties to open its first British base at Luton Airport. \nThe move will see it offer three new services to Tel Aviv in Israel, Pristina in Kosovo and Kutaisi in Georgia - taking its operations to 42 routes from Luton. A Wizz Air plane at Luton Airport 8.40 What's the FTSE latest? \nThe FTSE-100 index at 8:15am was down 1.14 at 7389.08. \nThe pound at 8am was 1.3036 dollars compared to 1.3026 dollars at the previous close. The euro at 8am was 0.8848 pounds compared to 0.8884 pounds at the previous close. 8.35 KEY EVENT A new home for Newcastle Arena amid Gateshead conference centre plans \nMultimillion-pound plans for a conference centre that would provide a jobs and tourism boost for the North East are finally set to come to fruition. \nA £200m scheme being outlined today by Gateshead Council would see the operators of the Metro Radio Arena in Newcastle move south of the Tyne to instead run a 12,500-seater venue capable of staging concerts, exhibitions and conferences on a site between the Sage and the Baltic. \nThe project is estimated to support more than 1,100 jobs, half of them newly created, bring nearly 300,000 visitors to Tyneside each year and add £29.5m into the area’s economy. \nNews of the scheme comes more than seven years after Gateshead Council bought a former warehouse site behind the Sage, with the intervening years having seen a number of setbacks in the attempt to build a conference centre on the site. \nNow the council has formed a partnership with property developers Ask Real Estate and investment group Patrizia UK to finally make the plans a reality. A 10-acre site directly opposite the Millennium Bridge would be developed to include an entertainment arena, conference and exhibition centre, hotel, bars and restaurants, creating a vibrant new entertainment area between Gateshead’s town centre and its quayside. Artist's impression of new Gateshead conference centre (Image: Gateshead Council) 8.30 Coreena Ford Former Royal Boss Moya Greene flies into easyJet board early \nEasyJet has appointed Royal Mail boss Moya Greene to its board earlier than planned as it speeds up the search for a new chief executive. \nMs Greene, who had been poised to join the budget airline in September, will now take up the position of non-executive director with immediate effect. \nShe will “support the chief executive search process” after it was announced on Monday that Carolyn McCall, current easJet leader, is to join ITV in January. \nIn addition, Keith Hamill, who was supposed to retire from easyJet’s board as non-executive director on July 31, will stay on, also to help out with the recruitment process. \nMs McCall has headed up the low-cost airline since 2010, but she leaves the low-cost carrier at a difficult time for the sector in Britain, with Brexit storm clouds gathering over the travel industry. \nThe pound’s collapse has meant less people travelling overseas and, more starkly, British airlines are at risk of being grounded unless bumbling Tory ministers strike an aviation deal with the EU before March 2019. Moya Greene, the Royal Mail boss who is joining easyJet 8.25 Coreena Ford Cyber attack continues to impact TalkTalk \nTelecoms group TalkTalk has said revenues slipped in its first quarter despite adding 20,000 broadband customers as it continues to recover from a cyber attack nearly two years ago. \nThe firm posted a 3.2% fall in revenues in the three months to the end of June, with good growth in its corporate and wholesale broadband business offset by a weaker performance in its consumer arm. \nIt said consumer revenues were being impacted by re-contracting on to new fixed low-price plans and a smaller average broadband customer base. \nBut the firm said: “These effects are expected to moderate as the base grows, and we drive fibre take-up and other products such as TV. \n“As a result, we continue to expect full-year revenues to grow.” \nTalkTalk added that it now has 1.3 million customers on fixed-price broadband plans and has a lower rate of so-called churn of customers leaving the group - at 1.2% against 1.4% in the previous year. \nThe group’s shares were hammered in May after it posted a lower-than-expected rise in annual profits and warned over the next year’s results, sending the stock slumping as much as 8% in one day. \nIt slashed investor dividend payouts and flagged that full-year earnings in 2017/18 would come in up to 11% lower, as it embarks on an investment drive to attract more customers. TalkTalk has been battling to turn itself around after being rocked by a cyber attack in 2015, which saw the personal data of nearly 160,000 people accessed by hackers. It led to tens of thousands of customers deserting the firm and cost it £60m. (Image: Publicity Picture) Coreena Ford Esh Group lays foundations for future with £5m tech investment and major restructure \nConstruction company Esh Group is driving forward a multi-million pound restructure and investment programme to prepare for future growth, its new managing director has revealed. \nAndy Rad cliffe was appointed chief executive of the Durham-based company in May, in line with the wishes of the late Brian Manning. \nAt the annual shareholders’ meeting last night, Mr Radcliffe revealed a busy year for the group involving heavy investments in a new IT system, restructuring of its regional operations and expansion of its County Durham headquarters. \nShareholders were told turnover for the year was 13% down on last year, to £242.7m, and pre-tax profit was also down, from £8.6m to £3.8m, largely as a result of the investment programme, which is costing around £5m to implement over two years. \nMr Radcliffe said the firm deliberately wanted to turn down turnover volumes after years of rapaid growth, to give the management team the breathing space to focus on bringing in operational changes to help the business build for the future. \nHe said the firm was halfway through the investment in “Project Gateway”– a far-reaching systems and technology project designed to streamline Esh’s business processes and establish solid foundations for future growth. Andy Radcliffe, who has been appointed CEO of Esh Group (Image: Chapman Brown Photography) 8.15 KEY EVENT Tier One Capital's listed investment trust plans £700,000 fundraising shares sale \nA Newcastle wealth management company’s listed investment trust has announced plans to raise up to £700,000 to fund the continued growth of its portfolio of real estate loans. \nThe placing proceeds are expected to be used to further diversify its portfolio, seven months after Tier One Capital first launched the trust -TOC Property Backed Lending Trust PLC (PBLT) - on the London Stock Exchange with big plans to invest in the burgeoning property market. \nIt launched the trust which now involves investors across the UK who are building up a substantial pot of cash to be loaned to a raft of residential and commercial property projects, predominantly in the North East. \nTOC Property Backed Lending Trust PLC, was admitted to the main market in January when it raised £17.3m, a large part of which is to be put into an initial list of 10 projects, many of which are in the region, including residential homes in Fernhill and West Auckland, County Durham. \nIn its latest stock market announcement, the firm said: “PBLT continues to see a healthy pipeline of future opportunities, both in terms of continuing to support existing projects, as well as new schemes expected to come to fruition throughout 2017. \n“The company intends to issue up to 700,000 Placing Shares pursuant to the Placing, which is being conducted by means of an accelerated bookbuild process. “The price per Placing Share is 100 pence to raise up to £700,000, before expenses.” \nSettlement for the Placing Shares and Admission are expected to take place on or before 8am on Monday, July 24. The team with TOC Property Backed Lending Trust PLC at the London Stock Exchange (Image: London Stock Exchange) Share", "external_links": [], "published": "2017-07-19T10:15:00.000+03:00", "crawled": "2017-07-19T10:44:28.003+03:00", "highlightTitle": ""}