{"organizations": [], "uuid": "76668b54a64494fc920d83313712d5eb82cb7a83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12539298.ece/ALTERNATES/s1200/Ramsdens-chief-executive-Peter-Kenyon.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/cyber-attack-targets-ramsdens-34000-13330727", "country": "GB", "domain_rank": 21960, "title": "Cyber attack targets Ramsdens 34,000 click-and-collect customers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-14T12:31:00.000+03:00", "replies_count": 0, "uuid": "76668b54a64494fc920d83313712d5eb82cb7a83"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/cyber-attack-targets-ramsdens-34000-13330727", "ord_in_thread": 0, "title": "Cyber attack targets Ramsdens 34,000 click-and-collect customers", "locations": [], "entities": {"persons": [{"name": "peter kenyon", "sentiment": "negative"}, {"name": "ramsdens", "sentiment": "negative"}], "locations": [{"name": "invalid email  north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "ramsdens holdings", "sentiment": "none"}, {"name": "northumbria healthcare nhs foundation trust", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ramsdens chief executive Peter Kenyon (Image: Publicity Pic) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East pawnbrokers Ramsdens has been hit with a cyber attack that targeted the chain’s 34,000 click-and-collect customers. \nThe Middlesbourgh firm, which has 127 shops across the UK, said it had been subject to the attack in June and has been working with third parties to investigate the incident and increase its security. \nCriminals behind the attack were targeting information about the company’s click-and-collect and travel card services customers. Information that could have been revealed include names, email addresses, postal addresses, and encrypted passwords to Ramsdens’ website. \nThe company added that there was no evidence that any data had been successfully stolen. \nA spokesperson for Ramsdens said: “We can confirm that we have responded to unauthorised access of our IT systems by a third party. We have been working with a team of experts who have assisted us to take the necessary steps to secure our systems. \n“At this stage there is no evidence that any data has been extracted but as a precaution we have reported the incident to the regulators and are making individuals aware of the situation. \n“The type of customer data which may be affected is limited and does not include bank account or card details.” Read More Flights between UK and EU will be cancelled unless a Brexit deal is sealed, Ryanair boss warns \nRamsdens is contacting customers who may have been affected by the cyber attack. It has launched a dedicated hotline, which went live this morning, to provide advice for those who are concerned about their cyber security and possible loss of data. \nAlthough Ramsdens’ website uses an encrypted password system, customers are being to told that they should change their password if they have used it on other sites. \nRamsdens Holdings, which listed on the stock exchange earlier in the year, is the latest in a number of organisations to be targeted by a cyber attack. \nIn May a computer virus caused major IT problems at North East hospitals run by the Northumbria Healthcare NHS Foundation Trust. The ransomware attack also temporarily halted production at the Nissan factory in Sunderland. \nA spokesperson for Ramsdens added that the company took its cyber security very seriously and had strong defences in place. \nAt close of play yesterday, Ramsdens’ share price stood at 147.5p. At the time of writing the share price has slipped to 140p. Like us on Facebook", "external_links": [], "published": "2017-07-14T12:31:00.000+03:00", "crawled": "2017-07-14T13:28:37.000+03:00", "highlightTitle": ""}