{"organizations": [], "uuid": "41dee051e0a21698c751e9e59eb63f64e2d1fa7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13265772.ece/ALTERNATES/s1200/Household-disposable-income.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jon-walker-speaks-time-give-13265729", "country": "GB", "domain_rank": 21960, "title": "Jon Walker speaks: Time to give public sector workers a pay rise", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-02T13:00:00.000+03:00", "replies_count": 0, "uuid": "41dee051e0a21698c751e9e59eb63f64e2d1fa7c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jon-walker-speaks-time-give-13265729", "ord_in_thread": 0, "title": "Jon Walker speaks: Time to give public sector workers a pay rise", "locations": [], "entities": {"persons": [{"name": "jon walker", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange  public", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coins and banknotes (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nWe need a strong economy. \nWhy? For one thing, the taxes paid by employees and businesses in a strong economy help fund services such as schools and hospitals. \nBut most of us also depend on wages, whether our own or the earnings of a partner of parent, to pay for essentials such as food, clothes, heating and a roof over our head. \nThen there are luxuries. Most of us want a holiday once a year, for example. We deserve it. \nA strong economy isn’t an end in itself. It’s important because our standard of living depends on it. \nAnd that means there’s little point in having a strong economy if you’re not going to allow people to share in the benefits it brings. \nThere are five million working people in this country who have seen their wages go down, year after year. Traders and financial professionals work on the floor of the New York Stock Exchange \nPublic sector workers are currently limited to an annual pay increase of one per cent. But as any student economist knows, this is really a pay cut when inflation is running at 2.9 per cent. And before that, their pay was frozen. This, once again, is actually a cut when you take inflation into account. \nIt means that millions of working people are seeing their living standards fall. \nThe UK, despite everything we went through with the banking crisis, and despite the uncertainty surrounding Brexit , is a rich country. But we’re telling many hard-working people they aren’t allowed to share in that wealth or, at least, that their share has to get smaller every year. \nIt’s time for the pay freeze for public sector workers to end. Read More Theresa May privately agrees to end public sector pay cap at last, reports claim \nImmediately after the banking crisis, there was a sense that we all had to make sacrifices. And indeed, many private firms also cut or froze pay for their staff – with employees taking it on the chin. People felt willing to make sacrifices to help the country get through a difficult period. \nBut that can’t last forever. And there’s no longer a sense that we’re all in it together. Rather, a specific group of workers is paying a heavier price than others. A police officer (Photo: PA) \nIt’s tempting to talk about the fantastic work public sector staff like police, nurses and teachers do. And they certainly are essential. \nI think it’s also worth remembering, however, that the private sector worker who delivers bread to the supermarket or stacks the shelves so that I have something to eat is also doing vital work. Read More MP Catherine McKinnell defies Jeremy Corbyn to back 'soft' Brexit and Single Market membership \nThis isn’t about one set of people being better than another. It’s about treating everyone fairly. \nIf Tories are serious about becoming the party of workers then that must mean all the workers. They could start by offering public sector staff a fair pay rise. Like us on Facebook ", "external_links": [], "published": "2017-07-02T13:00:00.000+03:00", "crawled": "2017-07-02T14:30:55.001+03:00", "highlightTitle": ""}