{"organizations": [], "uuid": "4f5af35d2d6123457b2897809102bee44c969a84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30452231/16087813.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/new-lib-dem-leader/story-30452231-detail/story.html", "country": "GB", "title": "New Lib Dem leader", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-22T18:39:00.000+03:00", "replies_count": 0, "uuid": "4f5af35d2d6123457b2897809102bee44c969a84"}, "author": "Western Morning News", "url": "http://www.devonlive.com/new-lib-dem-leader/story-30452231-detail/story.html", "ord_in_thread": 0, "title": "New Lib Dem leader", "locations": [], "entities": {"persons": [{"name": "vince cable", "sentiment": "none"}, {"name": "vince", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "glastonbury", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "yeovil", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "westland", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "liberal", "sentiment": "none"}, {"name": "falmouth university", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "green investment bank", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservatives and labour", "sentiment": "none"}, {"name": "plymouth university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Western Morning News | Posted: July 22, 2017 By Keith Rossiter 1 COMMENTS SHARES ir Vince Cable with his wife Rachel Smith, as he is named as the new leader of the Liberal Democrats New Lib Dem leader offers an Exit from Brexit X \nCopy link to paste in your message / ir Vince Cable with his wife Rachel Smith, as he is named as the new leader of the Liberal Democrats Comments (1) \nThe new Lib Dem leader, Sir Vince Cable, will need all of his Strictly Come Dancing fancy footwork to steer his party to a political comeback. \nSir Vince is determined to seize the centre ground after the move by Conservatives and Labour to the extreme fringes of politics. \nIn an exclusive interview, he said the British people must be given a \"final verdict\" when the outcomes of Brexit become clear. \nIn the June general election campaign Sir Vince was odds with former party leader Tim Farron, who had pledged a second EU referendum. \nSpeaking in Plymouth at the start of a nationwide tour to meet party activists, he suggested that may have played a part in the Lib Dem failure to make a comeback in the Westcountry. \n\"I'm pretty certain we'll be vindicated on our approach, but on this occasion our message wasn't well received down here. I think people felt we were harking back to rerunning the referendum.\" \n\"What we'll be talking about is giving people a final verdict when we know what Brexit is going to lead to. \n\"I think the full economic impact hasn't been felt – but it will be felt in this part of the country particularly. \n\"Cornwall will lose a lot of regional aid. It will take some years before that feeds through. \n\"Farming is going to be negatively affected. \n\"You've got Westland and the aerospace industries which are almost certainly going to be hit, unless the government keeps us in the customs union. \n\"I was very clear that we shouldn't rerun the referendum. It happened, and we had to respect the result. \n\"The referendum we are talking about is in the future, once the full impact is understood.\" \nSir Vince has laid out his claim to the centre ground in British politics, saying that a huge gulf has opened up between Left and Right. \nAlthough his party is a shadow of itself – down from 57 MPs in 2010 to 12 now, the recovery has already begun from a low of eight seats in 2015, and Sir Vince said anything was possible in the current volatile state of the political world. \nIn France, Emmanuel Macron and his new party came from nowhere to take control of the country. \n\"In Britain we are getting a polarisation of politics into zealots on one hand – extreme anti-Europe – and the hard Left on the other,\" Sir Vince said. \nHe did not believe that Labour leader Jeremy Corbyn's policies would stand up to scrutiny. \n\"Many young people voted Labour because they thought Labour was in favour of remaining in the EU, which they are not. And their economics is wobbly in the extreme. \n\"We will focus on health and education and an approach that is moderate.\" \n\"I think this government is going to become extremely unpopular. We are facing difficult times. The economy has slowed right down. People's living standards are going to be affected. There isn't much business investment going on. \n\"When people start being seriously squeezed they'll be looking for an alternative – but one that's middle-of-the-road and economically and financially credible.\" \n\"There is a lot of anger and unhappiness around. If we get ourselves properly organised it's possible to break through on a big scale, and that is my ambition.\" \nWhen people become deeply alienated by the traditional politics of Right and Left \"they can do remarkable things\". \n\"The Tories have become very Right-wing. Theresa May's survival hinges on the support of the [Brexit] wing of the party. That's what drives British politics regardless of the economic consequences.\" \nA wave of defections from Left and Right to the Lib Dems could happen, he said. \"I'm not predicting it, but we do know there are at least 50 Labour MPs who have rebelled over Europe. \n\"There are undoubtedly many more who were tempted to do so. They are being threatened with deselection and will have to make a decision about whether to stay or go. I can't help them with that decision but they will be warmly welcomed as political refugees if they leave. \n\"We know there is a large number of Conservative MPs that are equally very unhappy with the way the government is proceeding, and there are clearly big divisions, even within the Cabinet. Some of them may move.\" \nHe is keen to learn from Labour's use of modern tools such as social media – but is unlikely to follow Jeremy Corbyn on to the Pyramid stage at Glastonbury. \n\"That's not my forte.\" However, he said that as a former Strictly Come Dancing contestant, he is ready for the nifty footwork he'll need to steer his Liberal Democrat party to a comeback. \n\"Once people turn the spotlight on the Labour Party and what the current leadership stands for, I suspect that support will shrivel.\" \nSupport for the Lib Dems collapsed after the 2010-15 coalition government, and Sir Vince was clear that he would not take his party into coalition again – with either Labour or the Conservatives. \n\"We have such fundamental differences with both. On Brexit, they are in the same place and working together. \n\"It's totally different to 2010, when there was common ground and a national crisis. This is a completely self-inflicted situation caused by the way the government, supported by Labour, is pursuing this extreme form of Brexit. It is damaging the economy, will damage it more, and we're not going to be complicit in that.\" \nYoung voters in particular punished former Lib Dem leader Nick Clegg for breaking a promise to oppose university tuition fees. Sir Vince said that was a serious mistake, and one he would not repeat. \nBut he pointed out the Labour had broken promises on tuition fees three times. \"They promised not to introduce tuition fees, and they did. Then they promised not to increase them, but they did.\" \nIn the 2017 election, Labour's manifesto promised to help students with debts, but John McDonnell, the shadow Chancellor, has since downgraded that to \"an ambition\". \n\"We will make sure that retreat is properly signalled,\" Sir Vince said. \nWhat would make a Westcountry voter turn back to the Lib Dems? \"A combination of moderate, commonsense politics, which is neither extreme Right nor extreme Left I think will appeal to people in this area. People want to make sure that their living standards won't deteriorate. That there's adequate money for public services. That's the kind of agenda I'm interested in. \n\"One of the things I did in government was to play a role in trying to secure better regional balance. \n\"London is doing very well but parts of the country, including the South West, do feel a sense of neglect.\" \nIn government, he was involved in setting up the regional growth fund and other bodies including the Green Investment Bank to make sure money came to Westcountry businesses. \nHe was partly responsible for the industrial strategy in the 2010-15 coalition, which benefited the aerospace industries in areas such as Yeovil. \"I fear for its survival is Brexit goes ahead,\" he said. \nAs Secretary of State for Business, Innovation and Skills, Sir Vince launched the country's first successful Regional Growth Fund bid to come from a university. He helped Plymouth University, \nworking with The Western Morning News as media partners, to secure £1 million to fund business development through the pioneering Growth Acceleration and Investment Network (GAIN). \nHe was also involved in the expansion of Falmouth University. \nSir Vince was recognised as the coalition government's economic guru, a reputation he said was worth having. \n\"People are looking for competence and they're not getting it at the moment, and they certainly won't get it from the Labour Party. \n\"In the 2017 election, neither Labour nor the Tories came up with serous numbers as to how they would pay for what they wanted to spend money on. Both were heavily criticised by the business community. \n\"I want to make the Lib Dems a party of enterprise, job creation and economic competence.\" \nSir Vince said he believed there was an appetite for people to accept a small tax increase to help pay for better public services. \n\"We are not arguing for penal levels of tax. We argued in the last election for a penny in the pound to fund the health service. You have an older population down here and it's absolutely their top priority. \n\"People want an answer. If you are going to save the health service from damaging cuts, how do you pay for it? We have to be honest about that.\" \nHe said there was a determined effort by the Conservatives to write the Lib Dems out of the history of the coalition government. \n\"We did an enormous number of positive things but the Tories wanted the public not to be aware of it.\" \n\"We restrained the Tories from doing a lot of stupid things and once we'd left it quickly became apparent the mess they were going to create on their own. \n\"In the coalition we had 'strong and stable government' – which we haven't had since.\" \nSir Vince is 74, but said he did not believe his age was an issue. \"I'm very fit, active, got lots of stamina and energy. There are a lot of people of my generation who are at the top – not least Mr Corbyn and Donald Trump, not that I regard either as a role model.\" \nREAD NEXT ", "external_links": [], "published": "2017-07-22T18:39:00.000+03:00", "crawled": "2017-07-22T19:28:24.016+03:00", "highlightTitle": ""}