{"organizations": [], "uuid": "f71e4a3e1d77fd9cb98863fb135493c9f47e8d16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30432538/16074743.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/top-honour-for-pioneering-father-who-has-supported-100-000s-of-bereaved-parents/story-30432538-detail/story.html", "country": "GB", "title": "Top honour for pioneering father who has supported thousands of...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T17:19:00.000+03:00", "replies_count": 0, "uuid": "f71e4a3e1d77fd9cb98863fb135493c9f47e8d16"}, "author": "TinaCrowson", "url": "http://www.devonlive.com/top-honour-for-pioneering-father-who-has-supported-100-000s-of-bereaved-parents/story-30432538-detail/story.html", "ord_in_thread": 0, "title": "Top honour for pioneering father who has supported thousands of...", "locations": [], "entities": {"persons": [{"name": "dame mary", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "esme", "sentiment": "none"}, {"name": "bronte clark-coates", "sentiment": "none"}, {"name": "hilary devey", "sentiment": "none"}, {"name": "michael underwood", "sentiment": "none"}, {"name": "zoe", "sentiment": "none"}, {"name": "zoe clark-coates", "sentiment": "none"}, {"name": "dame mary perkins top", "sentiment": "none"}, {"name": "dame mary perkins", "sentiment": "none"}, {"name": "emilie de bruijn", "sentiment": "none"}, {"name": "andrew clarke-coats", "sentiment": "none"}, {"name": "andrew clark-coates", "sentiment": "none"}, {"name": "andy", "sentiment": "none"}, {"name": "micheal underwood", "sentiment": "none"}], "locations": [{"name": "wellswood", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "mariposa trust", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "tinacrowson", "sentiment": "none"}, {"name": "bca", "sentiment": "none"}, {"name": "specsavers", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "mariposa trust", "sentiment": "none"}, {"name": "irwin mitchell", "sentiment": "none"}, {"name": "department of health", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "lime marketing, communications", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top honour for pioneering father who has supported thousands of bereaved parents By TinaCrowson   0 COMMENTS SHARES Andrew Clarke-Coats, Micheal Underwood, Dame Mary Perkins Top honour for pioneering father who has supported thousands of bereaved parents X \nCopy link to paste in your message / \nA South Devon father who has helped provide support to hundreds of thousands of families trying to come to terms with the loss of a baby has been recognised with a national honour. \nAndrew Clark-Coates, of Wellswood, Torquay, has been given a British Citizen Award for his services to healthcare. \nThe British Citizen Awards (BCAs) were launched in January 2015, to recognise exceptional individuals who work tirelessly and selflessly to make a positive impact on society. BCAs are awarded twice annually, and recognise 'everyday' people whose achievements may otherwise be overlooked. \nREAD MORE: Newton Abbot MP Anne Marie Morris recorded saying Brexit no deal... \nAndrew, 41, set up the Mariposa Trust, in 2012 with his wife Zoe, to provide support for those suffering from any form of baby loss after being shocked to see other child loss charities made a distinction based on gestation or whether the baby had breathed at birth. \nHaving lost five children themselves during pregnancy, and realising how little support was available, Andrew and Zoe set about creating a charity to address this problem, sinking all their time and energy into ensuring others were not left alone at their most vulnerable point, like he and Zoe had been. \nAndrew is the last member of his family to be recognised by BCA for their work with Mariposa Trust. Zoe Clark-Coates received her BCA for her vision and creation last July, and their two little girls, Esme and Bronte Clark-Coates were recognised with a British Citizen Youth Award in October 2016 for their fundraising and helping their parents with the charity. They all attended the event as a family with their medals last week. \nAndrew is always available for interviews to spread the word and is constantly trying to break the taboo of baby loss and raise awareness of how people can support those going through loss. His work lobbying the NHS has recently seen the Mariposa Trust granted a stakeholder role with the Department of Health meaning that the charity will now be consulted on policy going forward. This will lead to much better support and consideration for bereaved parents. \nSince it was established, the charity has grown to the biggest of its category. The online portal supports 50,000 people a week and the website receives in excess of 650,000 hits each month, offering information and support to women, men and their families. \nAndy is described as an inspiration and often a lone male voice in a female dominated industry, leading from the front often sticking to his guns to make changes in society. Andrew speaks on behalf of the charity around the country and has impacted thousands of lives working tirelessly to break the taboo of baby loss. \nThis has all been achieved while the raising two daughters. \nREAD MORE: Mentally ill retired priest died after self-inflicted stabbing... \nThe Mariposa Trust set up 'Saying Goodbye' services, which were the first such national remembrance event in the UK. These have now spread to the US and France since their creation, with over 60 services held to date. These services allow mums, dads and their extended families and friends to come and formally grieve and remember their children at no cost to the individual themselves. \nAndrew, is one of 30 medallists who were honoured at a prestigious ceremony at the Palace of Westminster. \nSpeaking about his nomination, Andrew said: “I was deeply honoured to have been nominated and selected for the award, it's fantastic. \n“Until you go through baby loss, you have no idea of the scale of it. Each year, 250,000 in the UK and 80 million globally will suffer from baby loss. When we had gone through our five loses, we realised that there wasn't the help and support available anywhere that we wanted or needed. We started thinking about how we could help others in the same situation. \n“The Saying Goodbye services were the first thing we did and people from all over the UK soon started asking for us to hold a service in their area. We're not surprised that the charity has done so well, because we knew the scale of baby loss and the need for what we are providing. We have been surprised by how quickly it has grown but it just shows that we're hopefully doing something right.\" \nThe awards are in partnership with customer experience management company, InMoment, and are supported by the world's largest optical retailer, Specsavers; one of the largest property and leisure management, development and regeneration companies in the UK, Places for People; leading ethical law firm Irwin Mitchell; the UK and Europe's leading palletised freight distribution company, Pall-Ex, owned by BCAs Patron Hilary Devey; and specialist marketing, PR and communications agency, Lime Marketing, Communications and Productions. \nAndrew was presented with his award by Specsavers founder and BCA patron, Dame Mary Perkins, alongside TV presenter Michael Underwood. \nDame Mary said: “Many congratulations Andrew, you are a real inspiration. Losing a child must be so devastating, but you and your wife have turned such personal tragedy into a force for good and now just keep giving. The Mariposa Trust is a real credit to you and an incredible legacy.\" \nAndrew was nominated for a BCA by Mariposa Trust volunteer, Emilie de Bruijn. \nEntries for the next round of awards, which will take place in January 2018, are now open. To nominate someone, visit www.britishcitizenawards.co.uk or call 0203 002 7764.", "external_links": [], "published": "2017-07-10T17:19:00.000+03:00", "crawled": "2017-07-10T19:27:57.006+03:00", "highlightTitle": ""}