{"organizations": [], "uuid": "3c55145237e3af2448a598f4b13f0ea5564f4ce1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12983516.ece/ALTERNATES/s1200/CS15661269.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13312911", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: EU could 'dictate' job moves out of Britain, says JP Morgan boss", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-12T09:55:00.000+03:00", "replies_count": 0, "uuid": "3c55145237e3af2448a598f4b13f0ea5564f4ce1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13312911", "ord_in_thread": 0, "title": "Business Breakfast RECAP: EU could 'dictate' job moves out of Britain, says JP Morgan boss", "locations": [], "entities": {"persons": [{"name": "jonathon manning fairweather", "sentiment": "negative"}, {"name": "wetherspoo", "sentiment": "negative"}, {"name": "wetherspoon", "sentiment": "negative"}, {"name": "tim martin", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "kevin o’connor", "sentiment": "none"}, {"name": "booker", "sentiment": "none"}, {"name": "marco gobbetti", "sentiment": "none"}, {"name": "carolyn ‘", "sentiment": "none"}, {"name": "jd wetherspoon", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}, {"name": "unaoil", "sentiment": "none"}, {"name": "fairbairn", "sentiment": "none"}, {"name": "stanley", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "broadbent", "sentiment": "none"}, {"name": "nigel frank", "sentiment": "none"}, {"name": "bailey", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "christopher", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "simon bonney", "sentiment": "none"}, {"name": "barnes", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "jonathon manning burberry", "sentiment": "none"}, {"name": "jarrow", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "jonathon manning aldi", "sentiment": "none"}, {"name": "ben broadbent", "sentiment": "none"}, {"name": "matthew barnes", "sentiment": "none"}, {"name": "burberry", "sentiment": "none"}, {"name": "james mcdonagh", "sentiment": "none"}, {"name": "gobbetti", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "londis", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "knightsbridge", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "st nicholas building", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "jp morgan", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "mpc", "sentiment": "none"}, {"name": "blairgowrie advertiser", "sentiment": "none"}, {"name": "naylors", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}, {"name": "quantuma", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "aberdeen press and journal", "sentiment": "none"}, {"name": "budgens", "sentiment": "none"}, {"name": "new burberry", "sentiment": "none"}, {"name": "john wood group", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}, {"name": "asda", "sentiment": "none"}, {"name": "frank group", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}, {"name": "aldi uk", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "frank recruitment group", "sentiment": "none"}, {"name": "sfo", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}, {"name": "amec foster wheeler", "sentiment": "none"}, {"name": "eldon insurance", "sentiment": "none"}, {"name": "wood group", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "imf", "sentiment": "none"}, {"name": "emea", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "serious fraud office", "sentiment": "none"}, {"name": "cva", "sentiment": "none"}, {"name": "jonathon manning bank of england", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "burberry", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "amec", "sentiment": "none"}, {"name": "bank’s monetary policy committee", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "frg", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "alok group", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "amec foster wheeler  the serious fraud office", "sentiment": "none"}, {"name": "chester-le-street", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Fairweather drinkers prove a tonic for JD Wetherspoon chain \nSales at JD Wetherspoon have been boosted by warm summer weather over the past three months, as the pub chain’s Brexit-backing chairman launched another invective aimed at Remainers. \nLike-for-like sales rose 5.3% in the 11 weeks to July 9 and total sales rising 3.6%, with Tim Martin saying the performance was “probably helped by unusually good weather”. \nIn the year to date, like-for-like sales increased by 3.9% and total sales rose by 1.9%. Since the Brexit vote, Mr Martin has accused the EU of bullying the UK and used several company updates to rip into German chancellor Angela Merkel and European Commission president Jean-Claude Juncker. \nHe has also lashed out at former chancellor George Osborne, the IMF, the Bank of England, the CBI, Goldman Sachs, Morgan Stanley and PwC, who he claims were too negative about the impact of a Leave vote. \nOn Wednesday, Mr Martin again took aim at “gloomsters”, urging them to “put a sock in it”. \nHe said: \nThe majority of the public instinctively understands the Government’s bargaining dilemma. \nYet the supposedly sophisticated CBI, the Financial Times, the Times and the other usual suspects are vociferous in their forecasts of trouble in the absence of a free trade deal. \nAs a result, they are loading the dice hugely in favour of EU negotiators. \nThe public’s message to Carolyn ‘we’re all doomed’ Fairbairn, head of the CBI, and other gloomsters is: put a sock in it. \nWe’ll do well with or without a free trade deal, so stop tying the hands of our negotiators, who are doing their best to achieve a respectable outcome. \nDespite his diehard Brexit stance, Mr Martin last month announced Wetherspoon’s biggest ever single investment will go into the European Union through the development of a new pub and 98-bedroom hotel in Dublin city centre. JD Wetherspoon chairman Tim Martin 9:02 Serious Fraud Office launches investigation into Amec Foster Wheeler \nThe Serious Fraud Office (SFO) has launched an investigation into Amec Foster Wheeler. \nThe investigation is relates to an ongoing probe concerning Unaoil, a Monaco-based-oil and gas business which is being pursued by the fraud office in relation to allegations of bribery, corruption and money laundering. \nIn a trading update Amec confirmed that it was being investigated by the SFO. In a statement to the London Stock Exchange the firm said: \nThe company confirms that today it has been informed by the SFO that it has now opened an investigation into Amec Foster Wheeler, predecessor companies and associated persons in respect of the Foster Wheeler business. The investigation focuses on the past use of third parties and possible bribery and corruption and related offences. \nAmec Foster Wheeler takes its obligation to conduct business ethically very seriously and has in place a robust global anti-bribery programme, including a detailed code of conduct and anti-bribery and corruption policies. Amec Foster Wheeler continues fully to co-operate with and assist the SFO. \nIn March Amec agreed a £2.2bn deal that would see it taken over by rival firm Wood Group. Wood Group, which has a base in Gateshead, said the deal will result in “significant cost and revenue synergies” of at least £110m a year. \nGiven the stage of this matter, it is not possible to estimate reliably what effect the outcome of it may have on Amec Foster Wheeler. However, the SFO’s investigation is not expected to have an impact on the completion of the merger of Amec Foster Wheeler and John Wood Group, which is expected to take place in the fourth quarter of this year. 8:51 Jonathon Manning Aldi is to create nearly 4,000 new UK jobs as expansion drive continues \nAldi is to create nearly 4,000 new UK jobs in its largest ever recruitment drive as the German supermarket presses ahead with an aggressive expansion strategy. \nThe retailer is looking to fill the roles across its stores and regional distribution centres following what it described as a “surge in sales”. \nThe grocer, which has more than 700 UK stores, said that it saw 900,000 new customers walk through its doors last year. \nBoss Matthew Barnes said: \nWe need more high-performing individuals to help us achieve our growth plans. \nIn return, we offer market-leading pay and benefits and career development opportunities that are unrivalled in the supermarket sector. \nThe jobs are predominantly at store assistant, assistant store manager and deputy store manager levels. \nMr Barnes said earlier this year that Aldi could open more than 1,000 new stores, piling further pressure on its more established rivals. \nThe group said it remains on course to open 1,000 stores by 2022. The chief executive added: \nThe success of Aldi in the UK is due to the hard work and commitment of our employees, and they are crucial to our future expansion plans. \nThe emergence of Aldi and its fellow German grocer Lidl has shaken the grocery sector’s so-called Big Four - Tesco, Asda, Sainsbury’s and Morrisons - who remain locked in a bitter price war sparked by the duo. Aldi UK and Ireland of their chief executive Matthew Barnes (Image: PA) 8:46 Jonathon Manning Bank of England deputy governor sceptical about interest rates rise \nBank of England deputy governor Ben Broadbent has said he is “not ready” to raise interest rates due to too many “imponderables” in the economy. \nHis comments sent the pound falling sharply after recent gains for sterling on signs of mounting support among other policymakers for a rate hike to tackle rising inflation. \nBut Mr Broadbent finally broke his silence on rates, saying it was too difficult to make the call for a hike given the uncertainty in the economy and cautious mood among businesses. \nIt adds to further evidence of a deepening split on the Bank’s Monetary Policy Committee (MPC) ahead of next month’s interest rate meeting. Three out of eight members unexpectedly voted to raise rates to 0.5% from their record low of 0.25% in June due to concerns over soaring inflation. \nIn an interview with the Aberdeen Press And Journal, Mr Broadbent said: \nIf you look at the past six to 12 months, economic growth has been okay and the employment rate good. \nUnemployment has drifted down a little ... and inflation is higher. \nThere is reason to see the committee moving in that direction (higher interest rates) - but there are still a lot of imponderables. \nHe said business confidence was key, adding that firms remain nervous about Brexit cautious over the outlook. He said it was “very difficult for us on the committee to judge” whether there has been a significant improvement in business confidence. \nHe added: \nIn my opinion, it is a bit tricky at the moment to make a decision (to raise rates). I am not ready to do it yet. \nSterling dropped 0.2% to 1.28 US dollars and nearly 0.2% to 1.12 euro after the comments. The pound came under pressure on Tuesday when an earlier speech by Mr Broadbent had failed to address the issue of rates. Bank of England (Image: PA) 8:41 Jonathon Manning Competition watchdog to probe Tesco merger with wholesaler Booker \nThe competition watchdog is to conduct an in-depth investigation into the £3.7bn merger between Tesco and food wholesaler Booker. \nThe Competition and Markets Authority (CMA) said on Wednesday that it believes that competition could be harmed in more than 350 local areas where there is an overlap between Tesco shops and Booker “symbol stores”. \nBooker is the country’s largest wholesaler and owns Londis and Budgens as franchised outlets, and the CMA is concerned that shoppers could face worse terms when buying their groceries as a result of the deal. \nThe watchdog added that there are concerns over the “potential for Booker to reduce the wholesale services or terms it offers the ‘symbol’ stores it currently supplies, in order to drive customers to their local Tesco”. \nThe CMA now has 24 weeks to conduct its probe and pledged to publish its final report before Christmas, after an earlier provisional findings document is released. \nTesco is Britain’s biggest retailer, while Booker is the UK’s largest cash-and-carry operator with around 13,000 staff and around 200 stores. Tesco has faced criticism from investors over the deal, with some shareholders branding the takeover tilt a “distraction” and urging the Big Four grocer to scrap it. Tesco sign Jonathon Manning 900 jobs lost as fashion retailer Store Twenty One goes into liquidation \nFashion retailer Store Twenty One - which has a number of sites in the North East - has gone into liquidation, resulting in the loss of 900 jobs . \nIts owner, Indian manufacturing giant Alok Group, failed to secure investment for the chain following a Company Voluntary Arrangement (CVA) in 2016. \nAs a result, corporate recovery firm Quantuma has been appointed to handle a liquidation process, which will see the closure of 122 stores and the loss of 900 jobs. \nThe company has shops in Alnwick, Blyth, Chester-le-Street, Jarrow, Stanley, Peterlee and Houghton-le-Spring. \nThe loss-making company has found high street trading tough in recent years and its owners have struggled to keep the firm afloat. \nQuantuma partner Simon Bonney said: \nIt is very sad that matters have got to the stage where all the stores were closed by management on Friday following a prolonged period of uncertainty leading up to the liquidation. \nWe are now in the process of conducting an orderly wind-down and we would welcome contact from any interested parties who may wish to purchase assets of the company. Store Twenty One (Image: Blairgowrie Advertiser) 8:29 KEY EVENT North East more prepared for Brexit than southern regions, according to survey \nThe majority of middle market businesses in the North East and Yorkshire are more prepared for Brexit than other regions, according to a new YouGov survey. \nThe Brexit Monitor, which was commissioned by tax and consulting firm RSM, found that over two thirds (68%) of North East and Yorkshire businesses are prepared for the UK leaving the EU. \n88% of North East and Yorkshire companies said they had taken measures to battle the possible negative effects of Brexit. 41% said the had taken measures to increase productivity and efficiency, 41% had reviewed the status of EU workers, while 32% had increased local recruitment. \nHowever, over a quarter of firms said they planned to move some operations outside the UK, but only 9% have said they plan to establish EU subsidiaries. \nMore than 300 UK mid-market companies across a range of sectors took part in the survey. The firms all had a turnover between £30m and £300m. \nKevin O’Connor, RSM’s regional managing partner in the North East and Yorkshire, said: \nIn one of the most unpredictable operating environments since the economic downturn, middle market businesses in the North East and Yorkshire appear to be split regarding what impact Brexit will have the economic future of the UK. \nHowever, it is encouraging to see regional businesses on the front foot and preparing for change to ensure the North East and Yorkshire regions are well placed to succeed post Brexit. \nThe evident divide highlights that decision makers in the North East and Yorkshire take opposing views on whether the UK will adapt and emerge stronger from an EU-exit. Whether this view will change during the course of the negotiations remains to be seen, but initial signs highlight a mixed picture. \nHalf of the North East and Yorkshire respondents thought that an EU-exit would have a negative impact on the UK economy in the next five years. 41% of firms took a more positive view. Brexit infographic Jonathon Manning Burberry dales rise 3% to £478m in first quarter \nNew Burberry chief executive Marco Gobbetti has unveiled rising first quarter sales as he pointed to a “time of great change” for the fashion retailer. \nThe company reported a 3% increase in retail sales to £478m in the three months to June 30, while like-for-like sales rose 4% in the first set of results under Mr Gobbetti. \nRevenue was driven by strong performances in mainland China and in the UK, where the weaker pound has lifted sales, although Burberry said it saw a “deceleration” of this trend towards the end of the quarter. \nMr Gobbetti said: \nI am delighted to have started as Burberry CEO. We are pleased with our performance in the first quarter, while mindful of the work still to do. \nThis is a time of great change for Burberry and the wider luxury industry. \nI look forward to building on the foundations Christopher (Bailey) and the team have put in place and creating new energy to drive growth. \nMr Bailey stepped down as chief executive earlier this month, becoming president and chief creative officer as part of an overhaul. \nThe company has announced plans to deliver at least £100m in cost savings by 2019 as part of a turnaround plan to be carried out by Mr Gobbetti, and Burberry added that it is on track to deliver £50m in savings in 2018. \nThe firm said that its guidance for full year profit is unchanged. The Burberry store in Knightsbridge, London (Image: PA) 8:18 Jonathon Manning Recruitment giant creates 150 new jobs in big Newcastle office expansion \nA rapidly growing recruitment company in Newcastle is looking to boost it own numbers by filling 150 new jobs in the next few months . \nFrank Recruitment Group (FRG), which specialises in providing technology experts in permanent and freelance roles, already employs 300 staff in Newcastle but a move into a new base is set to trigger major expansion. \nThe firm is moving staff from offices across Newcastle into St Nicholas Building, where it has taken up enough space to trigger a recruitment drive of its own which will see the firm grow by a further 50% before the end of its financial year in November. \nThe deal marks the second biggest office letting of the year so far, with FRG taking up 19,000qsft of space over two floors in the grand building through an 11-year lease – just shy of the 21,000qft taken up by Eldon Insurance recently in the city. \nCommercial property specialist Naylors completed the letting, having completed a £1m refurbishment at the building to attract in new tenants. \nNewcastle-headquartered FRG, which was established in 2007 with the launch of the original Nigel Frank brand, specialises in the enterprise software market, and employs more than 700 people across sites on Tyneside and in London, Melbourne, New York, San Francisco and Singapore. \nJames McDonagh, director EMEA at Frank Group, said: \nWith the new space available at St Nicholas Building, Frank Recruitment Group is looking to recruit an additional 150 sales roles in Newcastle before the end of the financial year. \nThe investment in quality space and personnel underpins Frank Recruitment Group’s ambition and dedication to deliver the best freelance and permanent niche technology experts to vendor channel partners, SME and Enterprise organisations across the world. Frank Recruitment Group's new office at St Nicholas Building in Newcastle (Image: Frank Recruitment Group) 8:13", "external_links": [], "published": "2017-07-12T09:55:00.000+03:00", "crawled": "2017-07-12T12:23:11.002+03:00", "highlightTitle": ""}