{"organizations": [], "uuid": "e4ba0aa7abddafe986211e7b4fa452e4ecb76ed7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13347710.ece/ALTERNATES/s1200/Mobile-phone-study.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mobile-phone-battery-guide-could-13347537", "country": "GB", "domain_rank": 21960, "title": "Mobile phone battery guide: This could well be the best thing you read today", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-18T13:35:00.000+03:00", "replies_count": 0, "uuid": "e4ba0aa7abddafe986211e7b4fa452e4ecb76ed7"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mobile-phone-battery-guide-could-13347537", "ord_in_thread": 0, "title": "Mobile phone battery guide: This could well be the best thing you read today", "locations": [], "entities": {"persons": [{"name": "simon", "sentiment": "none"}, {"name": "simon jary", "sentiment": "none"}, {"name": "jary", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "nimh", "sentiment": "none"}, {"name": "nicd", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates   Thank you for subscribing!   \nMost Geordies know how to look after their mobile phones but how many of us love our batteries. \nAn expert has revealed some of the things not to do when we recharge our phones. \nYet, ever since phones were able to fit into a pocket, our batteries have taken a pounding. \nSo why not give the unglamorous part of your phone equipment a little tender loving care. \nIt will repay you by lasting longer. \nWe’ve been speaking to tech expert Simon Jary from TechAdvisor.co.uk and he has put together some top tips for keeping your phone’s battery healthy. A man texting on a mobile phone (Image: PA) Should I let the battery life go down to zero? \nNo, says Simon. \nThat might have been best practice a long time ago but batteries have changed and so has the way we recharge them. \nNewer batteries - or lithium-ion batteries - should never be allowed to drop to zero. \nAim to keep them at 50 per-cent or more for most of the time. Should I charge the battery up to 100 per-cent? \nYou should not let the battery go down to zero but neither should you normally let to go to 100 per-cent either. \nEven though it is important to try and keep it above 50% you should not allow it to fully recharge to the max. \nIt won’t be the end of the world for your battery if you do but it will shorten its lifespan. \nExperts say a good range to aim for is keeping it between the 40-80% range. Should I ever fully recharge the battery? \nOnce a month you should plug it in and let it hit that 100% mark. \nThis will recalibrate the battery and also applies to laptops. \nBut remember - just once a month. Read More Roaming charges to use mobile phones in EU will be scrapped this summer - but will Brexit affect it? Is it safe to charge my phone during the night? \nWith everyone so addicted to the little screen in your pocket the only time many of us can charge it is when we are asleep. \nMost smart phones live up to their name and will stop charging when they are full. \nHowever some tech experts say that you should remove your phone from its case for a long charging session as it can lead to overheating. What should I do with the battery if I don’t use the phone often? \nIf you leave your battery unused too long it can become unable to hold charge. \nAccording to Mr Jary: “These batteries drain at about 5-10% a month when not in use. I \n“If you let the battery discharge completely and leave it uncharged for a long period of time it may eventually become incapable of holding a charge at all (that’s properly dead). \n“It’s unlikely you’ll leave your smartphone lying in a drawer for very long, but some people do leave their laptop, battery packs or spare batteries unused for long periods of time. \n“So try to keep them all at least half charged.” What is “fast charging” and should I use it? \nUnlike iPhones, many Android devices allow you to select an option to charge your phone quicker. \nMr Jary says: “These phones have a special code usually located in a chip known as the Power Management IC (PMIC) that communicates with the charger you are using and requests that it send power at a higher voltage. \n“The iPhone 6 doesn’t feature fast charging, but is smart enough to recognise when you use a higher-amp charger (like the one you get with the iPad), and that’s a good thing because fast charging will heat up that Li-ion battery and cause it increased wear and tear. \n“For the same reason, you should never leave your phone in a hot car, on the beach or next to the oven. A hot battery will suffer long-term effects on its lifespan. And so will a super-cold one, so don’t leave your device in the freezer or out in the snow. \n“If you can, switch off fast charging on your Android phone.” Can I use any charger? \nAnyone who has ever lost a phone charger will understand the horror when they realise how much it costs to get the manufacturer’s version as a replacement. \nThis has led to many people using alternatives. Most are fine but some have caused fires when they overheat. \nIf you are using an alternative make sure it is approved by your phone’s manufacturer. Read More Why can't patients use mobile phones in NHS hospital wards? What is memory effect? \nWriting on Tech Advisor Mr Jary said: “This is about batteries remembering remaining charge if you don’t let them go all the way to zero too often. \nSo a battery frequently charged from 20% to 80% might ‘forget’ about the 40% that’s left uncharged (0-20% and 80-100%). \n“Sounds crazy but that’s sort of true - but only for older nickel-based (NiMH and NiCd) batteries, not the lithium-ion batteries in your phone. \n“Lithium-ion (Li-ion) batteries don’t suffer the memory effect so you almost need to do the opposite: charge them often but not all the way throughout the day, and don’t let them drop to zero.” Like us on Facebook", "external_links": [], "published": "2017-07-18T13:35:00.000+03:00", "crawled": "2017-07-18T14:00:10.005+03:00", "highlightTitle": ""}