{"organizations": [], "uuid": "cc9b9a147910a66fff52645d59cd67b9537d8e13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30431964/16074092.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/who-is-jayden-k-smith-and-why-i-do-i-keep-getting-messages-about-him/story-30431964-detail/story.html", "country": "GB", "title": "Who is Jayden K Smith and why I do I keep getting Facebook...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T10:02:00.000+03:00", "replies_count": 0, "uuid": "cc9b9a147910a66fff52645d59cd67b9537d8e13"}, "author": "Guy_Henderson", "url": "http://www.devonlive.com/who-is-jayden-k-smith-and-why-i-do-i-keep-getting-messages-about-him/story-30431964-detail/story.html", "ord_in_thread": 0, "title": "Who is Jayden K Smith and why I do I keep getting Facebook...", "locations": [], "entities": {"persons": [{"name": "jayden k smith", "sentiment": "none"}, {"name": "po", "sentiment": "none"}, {"name": "darwin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jayden k. smith", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "newshub", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who is Jayden K Smith and why I do I keep getting Facebook messages about him? By Guy_Henderson   Computer hacker Who is Jayden K Smith and why I do I keep getting Facebook messages about him?   \nDo you know somebody called Jayden K Smith? Do you keep getting warnings about them trying to make you their Facebook friend? Don't worry, you're not alone. You're one of millions of people all over the world who suddenly know the name of Jayden K Smith rather well. \nYou may well have received this message on Facebook over the past few days, or one very much like it: \n\"Please tell all the contacts in your Messenger list, not to accept Jayden K. Smith friendship request. He is a hacker and has the system connected to your Facebook account. If one of your contacts accepts it, you will also be hacked, so make sure that all your friends know it. Thanks. Forwarded as received.\" \nREAD MORE: A38 reopens after 'horrific' pile-up \nExperts say it is just the latest in a string of fake 'hacker' warnings which are being cut and pasted and shared around the world in the blink of an eye. Well-meaning Facebook users from Devon to Darwin share the 'warning' with all of their friends, hoping to help them escape the attentions of the mysterious hacker. \nBut it's all an elaborate hoax, a practical joke, the modern social media equivalent of ringing somebody's doorbell and running away. \nThe hoax has crossed the Atlantic as friends and family try to warn one another about the mystery hacker going by the name of Jayden K Smith. As far away as New Zealand the NewsHub website is telling its readers: \"Users have nothing to fear - the message is a hoax and as far as we can tell Jayden K Smith does not exist.\" \nREAD MORE: Campaigners say Brexit will mean more dead dolphins \nThey say: \"Accepting a request from a stranger on Facebook cannot lead to hackers gaining access to your computer or online accounts. \n\"Users would need to hand over personal information such as passwords and usernames, or download a file containing a virus, for a security breach to occur on their computer.\" \nThe Jayden K Smith hoax began to reach the UK over the weekend, and even filtered down to Devon. You can be sure of one thing - as long as your friends across the worldwide web are looking out for your safety, you will soon become very familiar with the name.", "external_links": [], "published": "2017-07-10T10:02:00.000+03:00", "crawled": "2017-07-10T10:42:57.022+03:00", "highlightTitle": ""}