{"organizations": [], "uuid": "229b4681872682a3c1713a52ccf5715ff8cd3b7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11875670.ece/ALTERNATES/s1200/JS60287380.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13380399", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Sage acquires US fintech firm for £654m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-26T10:05:00.000+03:00", "replies_count": 0, "uuid": "229b4681872682a3c1713a52ccf5715ff8cd3b7f"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13380399", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Sage acquires US fintech firm for £654m", "locations": [], "entities": {"persons": [{"name": "carolyn mccall", "sentiment": "none"}, {"name": "stephen kelly", "sentiment": "none"}, {"name": "adam crozier", "sentiment": "none"}, {"name": "liar", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "peter bazalgette", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "broadchurch", "sentiment": "none"}, {"name": "intacct", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}], "organizations": [{"name": "jonathon manning itv", "sentiment": "negative"}, {"name": "little boy blue", "sentiment": "none"}, {"name": "sps", "sentiment": "none"}, {"name": "sage business cloud", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "sage payment services", "sentiment": "none"}, {"name": "gtcr", "sentiment": "none"}, {"name": "intacct", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Village pub set to reopen as restaurant in dream move for former Gordon Ramsay employee \nA County Durham chef who worked for Gordon Ramsay will realise an ambition to run his own restaurant when he re-opens a popular village pub . \nThe King’s Arms in Great Stainton, on the outskirts of Newton Aycliffe, has been closed for almost a year having once been at the heart of village activity. \nNow the venue is set to open its doors to new and old customers having received significant investment from new owner John Wade, a local businessman who also owns the County restaurant and Telegraph pub in Aycliffe Village. \nThe new venture is set to be run by Paul Bussey, who has left his role as head chef of Acklam Hall in Middlesbrough to take on the pub, which will reopen in August. \nMr Bussey, who is originally from Chilton, was 18 when he left the North East for London to work at The Connaught under the guidance of Angela Hartnett, a protegee of TV chef Gordon Ramsay. \nHe later worked for Mark Broadbent, who won accolades during a stint on The Great British Menu, before getting more experience as a sous chef in Mr Ramsay’s restaurant in the Hilton Dubai. \nHe has now has signed an initial five-year lease agreement for the King’s Arms, which has had an extensive refurbishment. \nHe said: \nThis opportunity came up, albeit out of the blue, and it’s something I’ve always wanted to do. \nIf you don’t take the opportunity to do something for yourself, there’s every chance you will look back, five or 10 years down the line, and regret not giving it a go. \nI’d been told John Wade bought it and was in the process of refurbishing it, in preparation to re-open it as a restaurant, so I managed to get in touch with him. \nI just told him what I thought about its potential, and what I could do with it, and luckily John has been very supportive. Chef Paul Bussey outside the King's Arms in Great Stainton, near Newton Aycliffe, which he is reopening in August (Image: Mantis Media) 9:06 KEY EVENT Michael Gove: 'We can't carry on with diesel and petrol cars' \nSecretary of State for Environment Food and Rural Affairs Michael Gove has defended his decision to ban new diesel and petrol cars citing health issues and global warning as the main reasons. \nSpeaking on BBC Radio 4’s Today programme Mr Gove said: \nWe can’t carry on with diesel and petrol cars, not just because of the health problems that they cause, but also because the emissions that they cause would mean that we would accelerate climate change, do damage to our planet and to the next generation. \nAsked if there was no alternative to more wind farms and nuclear power energy stations, Mr Gove replied: \nThere is no alternative to embracing new technology. \nTold the Conservatives had a manifesto promise against more wind farms, Mr Gove said: \nThe Conservatives had a manifesto promise to ensure by 2050 there would be no diesel or petrol vehicles on our roads. \nToday we’re confirming that should mean no new diesel or petrol vehicles by 2040, and critically President Macron in France has a similar aspiration... and Norway wants to reach that goal by 2025 so we are, quite rightly, in a position of global leadership in shaping the new technology. Michael Gove speaking at the WWF Living Planet Centre in Woking, where he told an audience of environmental and countryside organisations that Brexit gives scope for Britain to be a global leader in green policy (Image: PA) 8:53 Jonathon Manning ElringKlinger to hire team of tool makers after investing £500,000 in North East factory \nCar part manufacturer ElringKlinger has c reated a number of skilled jobs at its North East base after investing £500,000 in its facilities. \nThe Redcar firm is spending £250,000 to expand its tool room and install state-of-the-art machinery that will allow it to offer clients a full in-house repair facility. \nAs a result of the expansion ElringKlinger is looking to add to its 300-strong workforce by hiring a team of skilled tool makers. \nIan Malcolm, managing director of ElringKlinger (GB), said: \nWe have invested strongly in new equipment over the last five years and the expansion of the tool room facilities is further evidence of this. We plan to continue the expansion with further investment scheduled to improve efficiencies and reduce the need for sub-contractors. \nThe North East is home to a highly skilled employee base and we are looking for experienced time-served tool makers to join our team, however our employees are also given the relevant training to deliver on high customer expectations so that we can continue to meet the demands of the automotive industry. \nThe new machinery being installed at the site will include a Hurco vmx60ti milling machine, an Agie Cute 600 WEDM and a Solidworks CADCAM suite. \nCandidates for the new tool maker roles will be expected to have experience with automated press tooling and to have worked in a busy production environment. They will be responsible for repairing and manufacturing press tools, jigs, fixtures and spares. Ian Malcolm, managing director at ElringKlinger (GB) (Image: Unknown) 8:48 Jonathon Manning RealRider's motorbike safety tech is now on market to third parties \nThe company behind motorbike safety app RealRider is making its software available to third party companies in an attempt to attract new business from manufacturers and tech companies. \nRealsafe Technologies’ app is able to detect when a motorcyclist crashes their vehicle, and automatically alerts emergency services to the rider’s location. It is the first to be backed by 999 service in the UK and 991 in Canada. \nThe company has now introduced licensing agreements that allows its software to be used in apps offered by individual manufacturers. It also means the technology could soon be adapted to work in cars and other vehicles. \nThe new strategy has the potential to open up new revenue streams for Realsafe, as well as make its product more easily available to overseas markets. \nCommenting on the new strategy, Realsafe’s chief commercial officer Andrew Richardson said: \nI have got quite close to manufactures that want to work with RealRider but what I have found is that eventually they will want their own version. \nWe have always been a standalone brand but now that we are integrating in Canada and the UK, and are looking further afield to the USA and Malaysia, being able to give them what they want with our technology plugged in after license is very powerful. \nRealsafe Technology would effectively build this product for a big brand and our technology would power that brand. \nThe firm will continue to offer RealRider as its own product but Mr Richardson believes that the licensing model will ultimately lead to more users being protected. \nHe added: \nWe want ever single motorcyclist to be protected by our technology and have RealRider used by as many people as possible. But you can’t always have that. (R-L) His Royal Highness Prince Andrew, CEO Zoe Farrington, CCO Andrew Richardson (Image: RealRider) 8:43 KEY EVENT New petrol and diesel vehicles to be banned from 2040 \nNew diesel and petrol cars and vans will be banned from 2040 as part of efforts to tackle air pollution, the Government is expected to announce. \nA £255m fund is expected to be unveiled to help councils speed up local measures to deal with pollution from diesel vehicles, as part of £3bn spending on air quality. \nThe measures are set to be included in a court-mandated clean air strategy the Government is due to publish on Wednesday, just days before the deadline set by the High Court. The expected move to ban petrol and diesel vans and cars follows similar plans announced in France this month and amid increasing signs that the shift to electric vehicles is accelerating. \nOn Tuesday, BMW announced plans for an electric Mini to be assembled at its Oxford plant while earlier this month Volvo unveiled its moves towards cleaner cars. \nThe Government was ordered to produce new plans to tackle illegal levels of harmful pollutant nitrogen dioxide after the courts agreed with environmental campaigners that a previous set of plans were insufficient to meet EU pollution limits. \nDespite government efforts to delay publication of the plans until after the general election, ministers were forced to set out the draft plans in May, with the final measures due by July 31. \nIt is thought ministers will also consult on a diesel scrappage scheme to take the dirtiest vehicles off the road. \nCampaigners have demanded the final plans should include government-funded and mandated clean air zones, with charges for the most polluting vehicles to enter areas with high air pollution, as well as a diesel scrappage scheme. Their calls for charging zones were backed up by an assessment published alongside the draft plans which suggested they were the most effective measures to tackle nitrogen dioxide, much of which comes from diesel vehicles. \nBut ministers have been wary of being seen to “punish” drivers of diesel cars, who they claim bought the vehicles in good faith after being encouraged to by the last Labour government on the basis they produced lower carbon emissions. \nThey favour local measures such as retrofitting buses and other transport to make them cleaner, changing road layouts and even altering features such as speed humps and re-programming traffic lights to make traffic flow more smoothly to reduce pollution. \nThe expected move to ban diesel and petrol cars and vans by 2040 comes after similar plans were announced in France this month and amid increasing signs that the shift to electric vehicles is accelerating, with BMW announcing plans for an electric Mini and Volvo unveiling its moves towards cleaner cars. \nAir pollution is linked to around 40,000 premature deaths a year in the UK, and transport also makes up a significant share of greenhouse gas emissions. \nA government spokesman said: \nPoor air quality is the biggest environmental risk to public health in the UK and this government is determined to take strong action in the shortest time possible. \nThat is why we are providing councils with new funding to accelerate development of local plans, as part of an ambitious £3bn programme to clean up dirty air around our roads. \nOur plan to deal with dirty diesels will help councils clean up emissions hotspots - often a single road - through common sense measures which do not unfairly penalise ordinary working people. \nDiesel drivers are not to blame and, to help them switch to cleaner vehicles, the Government will consult on a targeted scrappage scheme, one of a number of measures to support motorists affected by local plans. Secretary of State for Environment, Food and Rural Affairs Michael Gove arrives at Downing Street (Image: Getty Images Europe) 8:38 KEY EVENT Mike Ashley awaits outcome of £15m court fight over alleged pub deal \nNewcastle United owner and Sports Direct boss Mike Ashley is waiting to see whether he has won a High Court battle with an investment banker over a £15m deal allegedly made in a London pub. \nInvestment banker Jeffrey Blue told a judge that Mr Ashley promised to pay him £15m if he used his expertise to double Sports Direct’s share price to £8 a share. He says Mr Ashley paid only £1m and he wants £14m damages. \nMr Ashley denies the claim and says Mr Blue is talking “nonsense”. \nMr Justice Leggatt analysed evidence at a High Court trial in London earlier this month and is scheduled to deliver a ruling on Wednesday. \nThe judge heard that the dispute centred on a conversation in the Horse and Groom pub four years ago. \nMr Ashley said he met Mr Blue and three other finance specialists at the pub and “consumed a lot of alcohol”. \nI can’t remember the details of the conversations that we had in the pub as it was a heavy night of drinking. \nI do remember that we had a lot of drinks and a lot of banter. \nIf I did say to Mr Blue that I would pay him £15m if he could increase (Sports Direct’s) share price to £8, it would be obvious to everyone, including Mr Blue, that I wasn’t being serious. \nHe said he paid Mr Blue, who he called “Jeffers”, £1m for “other deals” unrelated to the night in the Horse and Groom. \nMr Blue told the judge that Mr Ashley was a “serious businessman”. He said the work ethic at Sports Direct was “like nothing else I have ever seen”. But he said Mr Ashley sometimes did business “in unorthodox ways and in unusual venues”. \nHe told how Mr Ashley once vomited into a fireplace after a senior management meeting that was “effectively a pub lock-in” and said the businessman would take naps under tables at “boring” meetings. \nMr Justice Leggatt told lawyers, at the end of the trial, that the case had been “a lot more interesting than some”. Owner of Sports Direct and Newcastle United, Mike Ashley (Image: Getty Images Europe) 8:30 Jonathon Manning Vertu Motors says trading is on track despite dip in sales \nNorth East car retailer Vertu Motors has said the company “remains well positions both operationally and financially” despite the firm suffering a sales dip. \nAt the firm’s annual general meeting, which is being held today, chairman Peter Jones is expected to tell investors that during the four months ending June 30 2017 new car registrations fell nationally by 6.1%. The decline occurred despite new vehicle registrations increasing by 4.4% in March, which is the month new registration plates are released. \nMr Jones will say: \nAs a result of these market trends the Group saw a softening of new retail sales volumes and used vehicle margins (particularly in premium franchises), reflecting a downturn in consumer confidence from April onwards. Aftersales like-for-like revenues and profitability increased in the Period underpinned by the Group’s retention strategies which make this growing revenue stream resilient. \nThough market conditions have softened, I am pleased to confirm that your Company remains well positioned both operationally and financially. Accordingly, at this stage, the Board expects the Group’s trading performance for the year ending 28 February 2018 to be in line with market expectations. \nThe firm is also in the process of selling two freehold properties. The sales, which are determined on planning applications being approved, will results in £7m being added to the group’s finances. \nThe board has also revealed it will pay a final dividend of 0.9p per share, up from 0.85p paid during the previous year. \nFollowing this morning’s announcement shares in Vertu have suffered a minor fall in price, from 43.5p at close of play yesterday to 43p at the time of writing. Peter Jones Jonathon Manning Newcastle construction firm Northern Bear makes first acquisition in almost a decade \nNewcastle construction company Northern Bear has made its first acquisition in almost a decade , a week after announcing soaring profits and sales. \nThe Prestwick Park group has added to its portfolio of 10 businesses with the acquisition of H Peel and Sons (Holdings) Ltd and its subsidiary H Peel and Sons Ltd, a buy-out which marks a move into the commercial interior design sector. \nBased in Dewsbury, West Yorkshire, for more than 50 years, the firm designs and delivers commercial interiors for everything from major breweries, universities and student unions to hotels, health clubs, schools, care homes and offices across the UK. \nThe management team at H Peel has been with the company for many years and has committed to stay with the business for at least three years post completion of the acquisition. \nThe Newcastle group said H Peel, which generated turnover of £5.4m in the year ended August 31 2016, makes an excellent fit for it, serving up further sectoral and geographical diversification. \nThe purchase consideration, payable to vendors Charon LLP and the management of H Peel will be a maximum of around £2.9m. \nAround £700,000 is cash is payable immediately, and £400,000 will be deferred in four equal six-monthly instalments starting six months from completion of the acquisition, 461,538 ordinary shares in Northern Bear which are valued at approximately £400,000 and a maximum of £1.4m of contingent cash payable under various earnout agreements. \nSteve Roberts, executive chairman of Northern Bear, said: \nI am delighted to announce our first acquisition for almost 10 years. We have looked at a number of acquisition opportunities in recent years and H Peel was the first one that met all of our criteria. \nWe have acquired a well-established, consistently profitable and cash generative business with a strong management team in place who are committed to remaining with the business. I would like to welcome all of H Peel’s employees to our Group and look forward to working with them. Northern Bear's headquarters in Prestwick Park, Newcastle 8:20", "external_links": [], "published": "2017-07-26T10:05:00.000+03:00", "crawled": "2017-07-26T10:22:35.001+03:00", "highlightTitle": ""}