{"organizations": [], "uuid": "5312337b9235e57051e304575da4b22498d8f9e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.liverpoolecho.co.uk/incoming/article11986037.ece/ALTERNATES/s1200/13392383-1.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/health/more-nurses-midwives-quitting-profession-13270700", "country": "GB", "domain_rank": 21960, "title": "More nurses and midwives are quitting profession than the numbers joining", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-03T10:00:00.000+03:00", "replies_count": 0, "uuid": "5312337b9235e57051e304575da4b22498d8f9e6"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/health/more-nurses-midwives-quitting-profession-13270700", "ord_in_thread": 0, "title": "More nurses and midwives are quitting profession than the numbers joining", "locations": [], "entities": {"persons": [{"name": "saffron cordery", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jon skewes", "sentiment": "none"}, {"name": "janet davies", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "department of health", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "royal college of midwives", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "rcn", "sentiment": "none"}, {"name": "midwifery council", "sentiment": "none"}, {"name": "rcm", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "royal college of nursing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "More nurses and midwives are quitting profession than the numbers joining Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDisillusioned nurses and midwives blame low pay and poor working conditions for the high numbers leaving their profession. \nFigures released by the Nursing and Midwifery Council show that - for the first time in recent history - more nurses and midwives are leaving than are joining, with 20% more quitting than entering between 2016 and 2017. \nThe Royal College of Nursing (RCN) and Royal College of Midwives (RCM) are pressing the Government to scrap pay caps in a bid to encourage more healthcare workers to stay in their roles. \nThe data shows that, following yearly rises since 2013 in the numbers on the register, there was a drop in 2016/17 of 1,783 to 690,773. \nFrom April to May this year, there has been a more dramatic fall, with a further 3,264 workers leaving the profession, Press Association reports. \nThe overall number of leavers - which includes UK, overseas and EU registrants - has increased from 23,087 in 2012/13 to 34,941 in 2016/17. \nLeavers among those first registered in the UK - who make up 85% of the entire register - jumped from 19,819 in 2012/2013 to 29,434 in 2016/2017. \nSaffron Cordery, director of policy and strategy at NHS Providers, said: “This goes beyond the concerns over Brexit - worrying though they are. \n“The reduction in numbers is most pronounced among UK registrants. And it is particularly disappointing to see so many of our younger nurses and midwives choosing to leave.” Read More How do I train to become a nurse and what qualifications will I need? \nShe hopes a new staff retention programme will support NHS trusts which have the most nurses leaving. \nShe added: “However, until we address the underlying issues driving retention problems, including the pay cap and the unsustainable workplace pressures, these approaches will only have a limited impact.” \nEU workers are also quitting in large numbers, with 3,081 leaving the NHS in 2016/17, compared to 1,173 in 2012/13. \nLeavers from outside the EU have risen from 2,095 in 2012/2013 to 2,426 in 2016/2017. \nIncreasing numbers are leaving the profession before they reach retirement age too. In 2016/17, 7,760 outgoing nurses were aged between 65 and 60, while there were 4,789 leavers aged 51 to 55 - almost double the figure for 2012/13. \nThe numbers of leaving nurses aged between 21 and 30 doubled from 1,510 to 2,901 in the same time. \nOf 4,544 people surveyed in the last year on reasons for leaving, just under half said they were not retiring. \nAmong this group, 44% said they were quitting due to working conditions, such as staffing levels or workloads, with 28% putting their decision down to personal circumstances. A further 27% said they left due to concerns over the quality of care to patients. Other reasons included leaving the UK (18%) and poor pay and benefits (16%). \nOf 247 EU leavers, 32% said Brexit had encouraged them to work outside the UK. Read More Newly qualified nurse? Here are some of the roles available in the North East \nJanet Davies, chief executive of the RCN, said: “Patients are paying the price for the Government’s failure to plan for the future and it looks set to get worse. \n“With more people leaving than joining, the NHS will be further than ever from filling the 40,000 vacant nurse jobs in England alone. \n“The average nurse is £3,000 worse off in real-terms compared to 2010. \n“The 1% cap means nursing staff can no longer afford to stay in the profession and scrapping student funding means people can no longer afford to join it.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nJon Skewes, director for policy at the RCM, said: “These are worrying figures for maternity services and for a profession that is already 3,500 midwives short of the numbers needed in England, and with retirement bulges threatening future shortages in other UK countries.” \nHe said pay freezes and increasing workloads had left workers “demoralised and disillusioned”. \nA Department of Health spokeswoman said: “We are making sure we have the nurses we need to continue delivering world-class patient care - that’s why there are almost 13,100 more on our wards since May 2010 and 52,000 in training. \n“We also know we need to retain our excellent nurses and earlier this week we launched a national programme to ensure nurses have the support they need to continue their vital work.” Like us on Facebook", "external_links": [], "published": "2017-07-03T10:00:00.000+03:00", "crawled": "2017-07-03T10:42:08.000+03:00", "highlightTitle": ""}