{"organizations": [], "uuid": "6386a90e42884df219f8096cca2ae6f9971c6601", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30432618/16074864.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/anne-marie-morris-apologises-after-she-was-recorded-using-the-n-word/story-30432618-detail/story.html", "country": "GB", "title": "DanielClark commented Anne Marie Morris apologises after being recorded using the...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-10T18:19:00.000+03:00", "replies_count": 0, "uuid": "6386a90e42884df219f8096cca2ae6f9971c6601"}, "author": "DanielClark", "url": "http://www.devonlive.com/anne-marie-morris-apologises-after-she-was-recorded-using-the-n-word/story-30432618-detail/story.html", "ord_in_thread": 0, "title": "DanielClark commented Anne Marie Morris apologises after being recorded using the...", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "caroline lucas", "sentiment": "none"}, {"name": "jim crow", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "marie chadwick", "sentiment": "none"}, {"name": "mrs jenkins", "sentiment": "none"}, {"name": "roger kendrick", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dixon-smith", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "devonlive", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "central london", "sentiment": "none"}], "organizations": [{"name": "green party", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "cchq", "sentiment": "none"}, {"name": "the conservative", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Anne Marie Morris apologises after being recorded using the N-word at Brexit meeting By DanielClark | Posted: July 10, 2017 8 COMMENTS SHARES Anne Marie Morris has apologised unreservedly after she was recorded using the N-word at a meeting of eurosceptics in Central London. Anne Marie Morris apologises after being recorded using the N-word at Brexit... X \nCopy link to paste in your message / Anne Marie Morris has apologised unreservedly after she was recorded using the N-word at a meeting of eurosceptics in... Comments (8) \nAnne Marie Morris has apologised after she was recorded using the N-word at a meeting of eurosceptics in Central London. \nMs Morris described the UK leaving the EU without a deal as a \"real n r in the woodpile\" at the launch of a report into the future for the UK's lucrative financial sector after Brexit. \nMs Morris, who is the Tory MP for Newton Abbot and has been since 2010, has apologised for the remarks. \nShe told Devon Live: \"The comment was unintentional and I apologise unreservedly for any offence caused.\" Read more Anne Marie Morris recorded using offensive 'N****r in the... \nAn urgent investigation into the remarks has been launched by the Conservative Party. A spokesman for CCHQ said: \"We are aware of these reports, this kind of language is completely unacceptable, and we are urgently investigating.\" \nMs Morris made the remark while discussing what financial services deal the UK could struck with Brussels after 2019. \nAfter saying just seven per cent of financial services in the UK would be affected by Brexit, Morris, who campaigned to leave the EU, said: \"Now I'm sure there will be many people who'll challenge that, but my response and my request is look at the detail, it isn't all doom and gloom. \n\"Now we get to the real n****r in the woodpile which is in two years what happens if there is no deal?\" \nCalls have been made by other MPs for Anne Marie Morris to lose the Conservative whip. \nTim Farron, the outgoing Lib Dem leader, called for Morris to lose the Tory whip. \n\"This disgusting comment belongs in the era of the Jim Crow laws and has no place in our parliament,\" he said. Read more Anne Marie Morris must resign over N-word use says Newton Abbot's... \n\"The Conservative party should withdraw the whip from Anne Marie Morris and they should do it today. Every hour they leave her in place, is a stain on them and the so called 'compassionate conservatism' they supposedly espouse. \n\"I am utterly shocked that this person represents the good people of Newton Abbot. Even if she misspoke this is the nastiest thing I've heard an MP utter since Lord Dixon-Smith uttered the same awful phrase a few years ago.\" \nCaroline Lucas, co-leader of the Green party, also called on the Tories to remove the whip. Appalling. Should have the whip removed immediately. No place in our politics for racism, full stop. https://t.co/khnbjFUVGi — Caroline Lucas (@CarolineLucas) July 10, 2017 \nOne person at the Brexit event contacted the Guardian because he was so shocked about what he had heard Morris say. \n\"I attended in a professional capacity with a colleague,\" he said. \"I work in financial services and was there to hear about the report on enhanced equivalence being published. \n\"I was completely taken aback after hearing such a vile and offensive phrase being used by someone in public life, who should be campaigning against such language being used, not dispensing it herself.\" \nMarie Chadwick, who was the Liberal Democrat candidate in Newton Abbot at the General Election in June, has called for her resignation and said that she has shown her true colours with the remarks. \nMrs Jenkins said: \"She should resign and she needs to resign. She has a history of associating herself with people who hold dubious views and now she has shown that not only does she hold those views, she is not afraid to speak about them. \n\"You simply cannot have people who hold these views representing residents in parliament. \n\"It is worrying for the constituents that she is the MP who represents them and she has shown with these comments that she is simply not up to the job and she needs to resign. \n\"I will be calling on Theresa May to sack her but if not, she needs to resign as she was shown what her true colours her.\" Read more Tory candidate distances herself from 'racist remark' made by her agent and partner at hustings \nIt comes just after she was forced to distance herself from comments made by her electoral agent and partner at a hustings who claimed 'that the crisis in education was due entirely to non-British born immigrants and their high birth rates'. \nDuring the debate around education and fair funding of schools, a member of the public stood up and said: 'that the crisis in education was due entirely to non-British born immigrants and their high birth rates'. \nThe person who made that remark was Roger Kendrick, who is both Anne Marie Morris's partner and her electoral agent. \nIn response, Anne Marie Morris told DevonLive: \"I don't share the views expressed by Roger Kendrick.\" ", "external_links": [], "published": "2017-07-10T18:19:00.000+03:00", "crawled": "2017-07-10T19:22:05.002+03:00", "highlightTitle": ""}