{"organizations": [], "uuid": "74771b6a960c2c4e4c2607bf42fb143b18fca088", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30450785/16086949.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/devon-county-leader-says-anne-marie-morrisneeds-to-consider-her-position/story-30450785-detail/story.html", "country": "US", "title": "Devon County Council leader says Anne Marie Morris needs to 'consider her position' | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2017-07-21T12:49:00.000+03:00", "replies_count": 0, "uuid": "74771b6a960c2c4e4c2607bf42fb143b18fca088"}, "author": "", "url": "http://www.devonlive.com/devon-county-leader-says-anne-marie-morrisneeds-to-consider-her-position/story-30450785-detail/story.html", "ord_in_thread": 0, "title": "Devon County Council leader says Anne Marie Morris needs to 'consider her position' | Devon Live", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "cllr alistair dewhirst", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "cllr dewhirst", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cllr john hart", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "john hart", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "devon live devon county council", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "anne marie morris devon county council", "sentiment": "none"}, {"name": "newton abbot conservatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon County Council leader says Anne Marie Morris needs to 'consider her position' By DanielClark | Posted: July 21, 2017 2 COMMENTS SHARES John Hart and Anne Marie Morris Devon County Council leader says Anne Marie Morris needs to 'consider her positi... X \nCopy link to paste in your message / Comments (2) \nDevon County Council leader John Hart said that Newton Abbot MP Anne Marie Morris needs to 'consider her position' as a result of the racism row she is engulfed in. \nMs Morris, who has been the MP for Newton Abbot since 2010, described the UK leaving the EU without a deal as a \"real n r in the woodpile \" at the launch of a report into the future for the UK's lucrative financial sector after Brexit. \nShe has since apologised for the remarks, saying: \"The comment was unintentional and I apologise unreservedly for any offence caused.\" \nBut she has had the whip suspended by her party, which means that although she is still an MP, she is no longer a Conservative MP. \nNewton Abbot Conservatives have backed Ms Morris and said that although her remarks were inappropriate, they won't be calling for her resignation. \nAt Thursday's Devon County Council meeting, Cllr Alistair Dewhirst raised the issue of Ms Morris' remarks and said that the council should make the MP aware that her words do not correspond to our statement on hate crime. Read more Jeremy Corbyn on Anne Marie Morris racism row: \"What was she thinking?\" \nIn response, Cllr John Hart, the Conservative leader of the council, said: \"The MP has apologised smartly, and the whip has been taken away from her very smartly. The lady has got to consider her position and there will be something on this, but I do not know what. \n\"We are the leaders of the county of Devon and we are the people who should be seen to be inclusive of all our communities. We should leave the powers in be in London to deal with this. Our council is to look after the people of Devon to the best of our ability. Read more Anne Marie Morris moves surgery to a secret location amid media storm \n\"As far as we are concerned and from what I expect from everyone, we should be tolerant, and all of us should work for a better county and our better country and that should be our aim.\" \nCllr Dewhirst had said: \"The day after it was reported the words of our MP, I had a telephone call from someone who lives in a coastal town adjacent to my division that her son, a coloured person, had been abused in the street and said that he was never coming back to Devon as a result of what was said by the MP. \n\"The final paragraph in our council statement and something that I am proud to have moved. It says that Devon is a caring and hospitable place and has a long history of welcoming people from a range of communities and faiths. However, racism and xenophobia has no place in our society and we take any instance of this extremely seriously and will see that the appropriate action is taken to deal with it. \n\"I think that our council should make the MP aware that her words do not correspond to our statement on hate crime.\" ", "external_links": [], "published": "2017-07-21T12:49:00.000+03:00", "crawled": "2017-07-21T12:33:36.000+03:00", "highlightTitle": ""}