{"organizations": [], "uuid": "a0885644eb952467a7f8b872b83e004a6e01cf17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i4.leicestermercury.co.uk/incoming/article229571.ece/ALTERNATES/s1200/Nicky-Morgan.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/local-news/loughborough-mp-nicky-morgan-calls-229550", "country": "US", "domain_rank": 48128, "title": "Loughborough MP Nicky Morgan calls police after Twitter troll's 'Jo Cox' Brexit threat - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.182, "site_type": "news", "published": "2017-07-22T18:55:00.000+03:00", "replies_count": 0, "uuid": "a0885644eb952467a7f8b872b83e004a6e01cf17"}, "author": "Dan Martin", "url": "http://www.leicestermercury.co.uk/news/local-news/loughborough-mp-nicky-morgan-calls-229550", "ord_in_thread": 0, "title": "Loughborough MP Nicky Morgan calls police after Twitter troll's 'Jo Cox' Brexit threat - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "nicky morgan", "sentiment": "negative"}, {"name": "jo cox", "sentiment": "negative"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "mrs morgan", "sentiment": "none"}, {"name": "mrs cox", "sentiment": "none"}, {"name": "batley", "sentiment": "none"}, {"name": "thomas mair", "sentiment": "none"}, {"name": "mair", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "leicester mercury loughborough", "sentiment": "negative"}, {"name": "loughborough", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "treasury select committee", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "loughborough market", "sentiment": "none"}, {"name": "leicestershire police", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative loughborough", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Loughborough MP Nicky Morgan calls police after Twitter troll's 'Jo Cox' Brexit threat The Tory MP said the threats of violence had gone beyond a tipping point Share Click to play Tap to play The video will start in 8 Cancel Play now Share \nNicky Morgan has reported internet trolls to the police after receiving messages threatening her with violence and referring to murdered MP Jo Cox. \nThe Conservative Loughborough MP today tweeted: “To those on my timeline referring to Jo Cox and threatening me with violence because of Brexit be aware you've been reported to the police.” \nMrs Morgan has contacted Leicestershire Police, parliamentary police officers and Twitter itself to report abuse. \nShe said she was concerned about a chain of tweets following an innocuous post by Loughborough Market. Read More \nIt prompted a series of insulting responses referring to her position on Brexit. \nMrs Morgan campaigned for the UK to remain in the EU. Nicky Morgan has reported threats on Twitter to the police \nOne of the tweets said: “We voted. When your vote is ignored all you are left with is violence. Nobody wants another Jo Cox episode but....” \nMrs Cox was the Labour MP for Batley and Spen when she was murdered last June by a man who shot and stabbed her in the street while shouting Britain First. \nThomas Mair was jailed for life for Mrs Cox’s murder in November. \nProsecutors said Mair was motivated by hate and his crimes were \"nothing less than acts of terrorism\". \nMrs Morgan, who was recently elected as chairman of the Treasury Select Committee, told the Mercury: “We are all used to robust political debate but messages like these pass a tipping point and it is unacceptable - particularly to make reference to Jo Cox. \n“Now everybody has the tools to send these kinds of messages and people will say things online that they would not say offline. \n“It is not just politicians who get this kind of abuse, it happens to many people in the public eye but for MPs it has been happening increasingly since the (EU) vote last year which has been one of the most divisive issues we have faced. \n\"These comments are attempts to silence alternative political views and dissenting voices.\" \nAfter Mrs Cox was killed, Mrs Morgan said she was considering installing a panic button in her Loughborough constituency office. \nToday she said she did not wish to discuss the specific aspects of her office’s protection but said all MPs’ offices have had enhanced security fitted for the benefit of their staff. \nMrs Morgan’s decision to call the police after the latest messages comes after pro-Brexit neighbouring Tory MP Andrew Bridgen wrote in the Mercury that he and other colleagues were being subjected to increasing levels of abuse and threats via email and social media. Read More ", "external_links": [], "published": "2017-07-22T18:55:00.000+03:00", "crawled": "2017-07-22T19:39:53.000+03:00", "highlightTitle": ""}