{"organizations": [], "uuid": "37da7eff0514eedb0aa3fb1af5da4bf1a2f3350a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i1.leicestermercury.co.uk/incoming/article240076.ece/ALTERNATES/s1200/Joules-colourful-clothing.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/joules-flouts-brexit-woes-huge-240053", "country": "US", "domain_rank": 48128, "title": "Joules flouts Brexit woes with huge jump in profits - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.437, "site_type": "news", "published": "2017-07-26T11:18:00.000+03:00", "replies_count": 0, "uuid": "37da7eff0514eedb0aa3fb1af5da4bf1a2f3350a"}, "author": "Lauren Mills", "url": "http://www.leicestermercury.co.uk/news/business/joules-flouts-brexit-woes-huge-240053", "ord_in_thread": 0, "title": "Joules flouts Brexit woes with huge jump in profits - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "coline porter", "sentiment": "none"}, {"name": "tom joule", "sentiment": "none"}, {"name": "porter", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicester mercury joules", "sentiment": "negative"}, {"name": "joules", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Joules flouts Brexit woes with huge jump in profits One of the county's most successful businesses is going from strength to strength Share Joules focuses on colourful prints and designs Share Comments \nA leading fashion and lifestyle retailer flouted Brexit uncertainty by delivering a huge jump in profits. \nMarket Harborough-based Joules said sales rose by nearly 20 per cent to £157 million in the year to the end of May, while profits leapt by 34 per cent to more than £10 million. \nOnline sales were up by almost 30 per cent, with store sales up by 17.5 per cent. \nJoules said wholesales sales increased more than 20 per cent reflecting the “growing appeal of the Joules brand in the UK and target international markets”. Read More \nJoules was launched in Britain by Tom Joule nearly 30 years ago when he started selling his range of colourful clothing and wellies at country fairs. \nIt has evolved into a premium lifestyle brand with an authentic British heritage. Joules has also ventured into homewares \nThe company sells its clothing, footwear and accessories for women, men and children, as well as an expanding range of homewares, toiletries and eyewear collections its network of retail stores, online, at rural shows and events and wholesale channels. \nQuality, Britishness, family values, colour and humour make Joules stand out from the crowd. This approach, along with an unwavering attention to detail, and drive to surprise and delight its customers with unexpected product details, remains at the heart of everything Joules creates and has been central to the brand’s success and expansion. Read More 35 new jobs at new Aldi store in Leicestershire - here's how to apply \nJoules chief executive Colin Porter said: “FY17 was another very exciting year for the group as the Joules brand continued to expand and develop across distribution channels and product categories both in the UK and internationally. \n“The strong progress delivered during the year was again underpinned by the group’s steadfast focus on its growing and loyal customer base, product quality and delivering engaging experiences across all channels. \n“The board remains confident that the group’s momentum will continue into FY18, despite the uncertain macro-economic outlook. Joules makes colourful clothing for the whole family \n“This confidence is supported by the growth in our customer base, our exciting new store opening plans, a robust autumn/winter wholesale order-book both in the UK and internationally, and positive early feedback on our Spring/Summer 2018 ranges from wholesale customers.” Read More Textiles giant Wolsey leaving Leicester after 250 years in the city \nMr Porter said Joules planned to open 10 to 12 stores a year in the medium term as well as relocating a number of existing stores to larger sites “that better reflect our brand and product range”. \nJoules, which is listed on the London Stock Exchange, saw its shares leap nearly 5 per cent to 316p in early morning trading Wednesday. Like us on Facebook ", "external_links": [], "published": "2017-07-26T11:18:00.000+03:00", "crawled": "2017-07-26T12:09:25.000+03:00", "highlightTitle": ""}