{"organizations": [], "uuid": "71f322f855f5c471fc5f365eca3bcc3c5f41089b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30460119/16092975.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/will-eu-reliant-devon-end-up-paying-the-price-of-brexit/story-30460119-detail/story.html", "country": "US", "title": "Will EU-reliant Devon end up paying the price of Brexit? | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2017-07-28T14:51:00.000+03:00", "replies_count": 0, "uuid": "71f322f855f5c471fc5f365eca3bcc3c5f41089b"}, "author": "", "url": "http://www.devonlive.com/will-eu-reliant-devon-end-up-paying-the-price-of-brexit/story-30460119-detail/story.html", "ord_in_thread": 0, "title": "Will EU-reliant Devon end up paying the price of Brexit? | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon live will eu-reliant devon", "sentiment": "none"}, {"name": "james woodhouse exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "pierre gröning", "sentiment": "none"}, {"name": "allie renison", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "fta", "sentiment": "none"}, {"name": "institute of directors", "sentiment": "none"}, {"name": "ms renison", "sentiment": "none"}, {"name": "foreign trade association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Will EU-reliant Devon end up paying the price of Brexit? By WMN_PGoodwin | Posted: July 28, 2017 2 COMMENTS SHARES Will EU-reliant Devon end up paying the price of Brexit? X \nCopy link to paste in your message / Comments (2) \nSouth West consumers could end up 'paying the Brexit bill', experts have warned, after new figures revealed just how much European businesses add to the regional economy. \nThe South West benefits disproportionately from the large contributions by foreign - and especially EU-owned non-financial businesses of any region in the UK. \nEU-owned businesses in the South West contribute more than £15bn to the region's economy. \nThis is a disproportionately high figure - EU-owned businesses generate almost 10 per cent of the total gross value added (GVA) from all South West businesses even though they make up less than two per cent of all companies in the region. \nAllie Renison, Head of EU and Trade Policy at the Institute of Directors told us her concerns about what the situation could look like post-Brexit: \n\"The large contribution that these firms make to GVA does create a concern about what would happen if they began to plan to scale investment back here. \nREAD MORE: Brexit could spell disaster for Devon wildlife \n\"One particularly important factor here is the lack of clarity for existing EU workers in the UK, and the unclear prospects for future movement of workers between the UK and EU.\" \nShe added that the Institute of Directors has been appealing to the Government to prioritise negotiating a deal with the EU in this particular regard. \nMs Renison hopes that EU-owned firms will lobby both sides of the negotiating table 'to push for a Brexit deal that keeps the level of friction for trade to an absolute minimum'. \n\"It's in their interest, as much as it for UK companies, that we get a transitional agreement that takes us smoothly to a new free trade agreement with the EU,\" she said. \nBrexit is 'a new synonym for uncertainty' that is 'clearly negative for investment strategies and possible expansion plans', said Dr Pierre Gröning, Director of International Trade Policy at Brussel-based Foreign Trade Association (FTA). \nRead more: James Woodhouse Exeter murder trial Day 11 LIVE \n\"While retailers and fashion brands are not able to attach a price to Brexit, they expect to be hit by higher direct and indirect costs, supply chain disruptions, and increased price pressure,\" speaking exclusively to us, he said. \n\"The sector is reluctant to currently invest in the UK because of the big risks and the lack of legal clarity about the Brexit consequences. \n\"At the same time, we do not predict any major de-investment from EU27-based companies but rather a period of business stagnation and lower profits. \n\"It is likely that the consumer will end up paying the Brexit bill in the form of higher prices.\" \nOverall foreign-owned businesses contribute £314bn to the UK economy, accounting for 27 per cent of the total generated by business in the UK. \nMore than a third of this comes from EU-owned businesses with a share of £123bn.", "external_links": [], "published": "2017-07-28T14:51:00.000+03:00", "crawled": "2017-07-28T15:37:20.015+03:00", "highlightTitle": ""}