{"organizations": [], "uuid": "bf51d9cda306a195fa4a1d3bd95b63313fe70a8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13292862.ece/ALTERNATES/s1200/LAP_NEC_181115prayer_02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/uk-must-seek-stay-single-13292435", "country": "GB", "domain_rank": 21960, "title": "UK must seek to stay in single market until final EU deal is in place, CBI warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-06T20:01:00.000+03:00", "replies_count": 0, "uuid": "bf51d9cda306a195fa4a1d3bd95b63313fe70a8c"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/uk-must-seek-stay-single-13292435", "ord_in_thread": 0, "title": "UK must seek to stay in single market until final EU deal is in place, CBI warns", "locations": [], "entities": {"persons": [{"name": "fairbairn", "sentiment": "none"}, {"name": "carolyn fairbairn", "sentiment": "none"}, {"name": "carolyn fairburn", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "kent", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "chevening house", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "cbi", "sentiment": "neutral"}, {"name": "cabinet", "sentiment": "none"}, {"name": "london school of economics", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UK must seek to stay in single market until final EU deal is in place, CBI warns The CBI has urged negotiators to agree transitional agreements as soon as possible to negate uncertainty Share Carolyn Fairburn (Image: Newcastle Chronicle) Share Get business   \nBritain needs to stay inside the single market and customs union until a final deal with the EU is in force, a leading business group has warned. \nThe CBI said even with the greatest possible goodwill on both sides of the Brexit talks, it is “impossible” to imagine the details of a new trade deal will be clear by the time the Article 50 process ends on March 29 2019. \nCBI director-general Carolyn Fairbairn urged negotiators to agree transitional agreements as soon as possible, in order to reduce uncertainty and protect jobs. \n“Instead of a cliff edge, the UK needs a bridge to the new EU deal,” Ms Fairbairn said in a lecture at the London School of Economics. \n“Our proposal is for the UK to seek to stay in the single market and a customs union until a final deal is in force. This would create a bridge to the new trading arrangement that, for businesses, feels like the road they are on.” \nMs Fairbairn also highlighted the importance of firms making only one transition, rather than forcing them to adapt twice - first to the transition, and then to the final plan. \nShe said: “Making two transitions, from where firms are now to a staging post and then again to a final deal, would be wasteful, difficult and uncertain in itself. \n“One transition is better than two and certainty is better than uncertainty.” \nOn the deal itself, Ms Fairbairn echoed Brexit Secretary David Davis who has promised an agreement “like no other in history”. \n“We’re seeking the most ambitious and comprehensive free trade deal ever agreed in history,” she said. Read More \nBut she warned the prospect of a damaging cliff edge is casting “a long shadow” over businesses, resulting in investment decisions being deferred or lost. \nShe said: “Agreement is needed fast - waiting until March 2019 is too late. \n“The exact mechanisms to achieve this can be debated and negotiated. But for businesses making daily decisions about where and how much to invest, this is the simplest answer to the uncertainty they face today.” Read More 35,000 people now employed in North East's IT sector, report reveals \nMs Fairbairn will attend a conference of business leaders on Friday, hosted by the Brexit Secretary at Chevening House in Kent, as part of a series of events to “intensify” government engagement with industry. \nIt comes after reports that corporate leaders wanted ministers to consult them more on Brexit and amid suggestions of a power struggle in the Cabinet over the shape of the UK’s exit from the EU. Like us on Facebook", "external_links": [], "published": "2017-07-06T20:01:00.000+03:00", "crawled": "2017-07-06T20:48:41.006+03:00", "highlightTitle": ""}