{"organizations": [], "uuid": "345e98b3c39c94378f2e6e226a53c251bf1bfaf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13350893.ece/ALTERNATES/s1200/CFR_NJL_291116earlgrey_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/commercial-property/newcastle-landlords-office-investments-keeps-13350712", "country": "GB", "domain_rank": 21960, "title": "Newcastle landlords' office investments keeps businesses rolling into the city", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-18T19:23:00.000+03:00", "replies_count": 0, "uuid": "345e98b3c39c94378f2e6e226a53c251bf1bfaf3"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/commercial-property/newcastle-landlords-office-investments-keeps-13350712", "ord_in_thread": 0, "title": "Newcastle landlords' office investments keeps businesses rolling into the city", "locations": [], "entities": {"persons": [{"name": "jessica simpson", "sentiment": "none"}, {"name": "patrick matheson", "sentiment": "none"}, {"name": "ruskin", "sentiment": "none"}, {"name": "du vin", "sentiment": "none"}, {"name": "vaux", "sentiment": "none"}, {"name": "matheson", "sentiment": "none"}, {"name": "lambert smith hampton", "sentiment": "none"}, {"name": "sanderson weatherall", "sentiment": "none"}, {"name": "knight frank", "sentiment": "none"}, {"name": "simpson", "sentiment": "none"}], "locations": [{"name": "east coast", "sentiment": "none"}, {"name": "grey street", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "st nicholas building", "sentiment": "none"}, {"name": "earl grey house", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "bnp paribas real estate", "sentiment": "none"}, {"name": "north east office agents forum", "sentiment": "none"}, {"name": "naylors", "sentiment": "none"}, {"name": "gainsborough house", "sentiment": "none"}, {"name": "invalid email  city", "sentiment": "none"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "cushman & wakefield", "sentiment": "none"}, {"name": "collingwood buildings", "sentiment": "none"}, {"name": "gva bilfinger", "sentiment": "none"}, {"name": "knight frank", "sentiment": "none"}, {"name": "naylors chartered surveyors", "sentiment": "none"}, {"name": "gavin black & partners", "sentiment": "none"}, {"name": "gva", "sentiment": "none"}, {"name": "share earl grey house", "sentiment": "none"}, {"name": "convergys", "sentiment": "none"}, {"name": "leeds building society", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle science central", "sentiment": "none"}, {"name": "bradley hall ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle landlords' office investments keeps businesses rolling into the city A raft of refurbishments are being made on city centre buildings, and more lettings could soon be made, the North East Office Agents Forum says Share Earl Grey House in Newcastle (Image: GVA Bilfinger) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCity centre property owners are driving forward significant investments to help counter a severe shortage of office space for incoming businesses, a new survey has confirmed. \nThe North East Office Agents Forum (NEOAF) revealed office take-up across the North East for the second quarter of this year was better than expected at almost 130,000sqft, despite some firms delaying moves to new offices in the wake of the General Election. In Newcastle city centre , meanwhile, a continuing shortage of Grade A office space is driving a continuing trend among landlords to invest in properties , some of which are listed, to help meet the demand. \nPatrick Matheson, partner for office agency at Knight Frank, said the General Election caused some office decisions to be put on hold while Brexit uncertainty was also a factor. \nHe said: “City centre take up was actually better than this year’s Q1 but what should be noted is the unusual rise in at 91,000 sqft (52%) of freehold transactions in Q1 was not repeated in Q2 where freeholds amounted to 32,000 sqft (36%), a more usual level.” The Grey Street, Newcastle, building which is set for a refurbishment (Image: Bradley Hall Ltd) \nTake-up across the region and in Newcastle’s city centre totalled 129,291 sq ft compared to 186,544 sq ft for the same period last year, a difference of 57,253 sq ft, but Mr Matheson said: “Arguably it is a hard comparison as the same period last year was the second best performing 2nd quarter over a five-year period and it included the 35,000 sq ft Convergys letting and 20,000 sq ft-plus Leeds Building Society at Cobalt.” \nJessica Simpson, senior surveyor at Naylors, said there remains a lack of Grade A supply within the city centre market, adding: “We are finding there is a continued demand for offices which have been refurbished to a high standard. \n“We are seeing that landlords are now having the confidence to carry out refurbishments in order to meet the current demand. Examples of refurbished space include Gainsborough House and Earl Grey House on Grey Street and St Nicholas Building. \n“As a result of the investment being made within buildings, landlords are starting to see deals occur.” Read More Newcastle's Hotel Du Vin unveils new bistro after significant makeover \nMr Matheson said: “Speaking to a number of agents at the NEOAF meeting, though Q2 numbers are down there is a significant amount of space under offer at the moment. \n“If this all completes there could be a bounce back next quarter. To a certain extent this also points to the issue we are facing about how long it is taking for deals to move from initial enquiry to contract. Collingwood Buildings in Newcastle which houses a boutique business centre (Image: Ruskin Photography) \n“As there is no new Grade A space available the market awaits progress on Legal & General’s recent planning application for the first of its grade A office buildings at Newcastle Science Central. \n“The 100,000 sq ft office building will create modern workspace for over 1,200 people in the science, technology and the knowledge sectors. \n“Meanwhile the 60,000 sq ft Beam office building, Vaux, Sunderland, where Knight Frank and Naylors are joint agents, is currently coming out of the ground with a positive level of interest.” Read More Irvins Brasserie closes in North Shields as chef winds up restaurant business \nMs Simpson added: “Overall, the North East remains a very good location for business with excellent connectivity, city centre facilities and in general lifestyle. With the East Coast mainline due for much improved rolling stock is about a year there is much to look forward to.” \nThe North East Office Agents Forum (NEOAF) comprises the leading office agents BNP Paribas Real Estate, Bradley Hall, Cushman & Wakefield, Gavin Black & Partners, GVA, Knight Frank, Lambert Smith Hampton, Naylors Chartered Surveyors and Sanderson Weatherall. Like us on Facebook", "external_links": [], "published": "2017-07-18T19:23:00.000+03:00", "crawled": "2017-07-18T19:36:44.001+03:00", "highlightTitle": ""}