{"organizations": [], "uuid": "d408c7c8c0e0425d1c0fd6e81b40712e4ca43f2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13366696.ece/ALTERNATES/s1200/DMR_NEC_120717air_06.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-airport-benefit-government-aviation-13366642", "country": "GB", "domain_rank": 21960, "title": "Will Newcastle airport benefit from government aviation strategy launch?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-21T16:30:00.000+03:00", "replies_count": 0, "uuid": "d408c7c8c0e0425d1c0fd6e81b40712e4ca43f2e"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-airport-benefit-government-aviation-13366642", "ord_in_thread": 0, "title": "Will Newcastle airport benefit from government aviation strategy launch?", "locations": [], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "apd", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "european union share click", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Will Newcastle airport benefit from government aviation strategy launch? Government launches an 18-month public consultation exercise to prepare for life outside the European Union Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily     \nThe government is looking to develop a long term post-Brexit aviation strategy. \nAnnounced on Friday the new Government has revealed plans which could be set to shake up the nation’s airways but they are looking to passengers for help. \nFrom town centre check-ins to changes to a controversial tax – air passenger duty – the policy could see major changes to the way we fly. \nHere we detail the proposals and how readers can have their say potentially change the industry . \nHere is everything you need to know. Newcastle International Airport today (Image: Newcastle Airport) So what’s been announced by the government? \nIt is launching a public consultation exercise over the direction its aviation plan could develop. And what is it hoping to achieve? \nIn the government’s own words, it is looking at ways of “shaping aviation to help boost economic growth, connectivity and skills will be at the centre of a new strategy to prepare the industry for the next three decades and beyond”. What’s the public consultation bit of this deal? \nThe public are being asked to have their say on how the aviation sector should respond to a range of technological, security, environmental and customer service challenges. Delayed passengers at Heathrow Airport's Terminal 5 Why should the public be bothered about aviation? \nIt’s an industry which directly supports 240,000 jobs and contributes at least £22 billion to the UK economy each year. Is this somehow linked to the EU negotiations? \nThe government said that the aviation strategy would be separate to negotiations over access to European markets after Britain leaves the EU , although protecting and promoting the sector after Brexit would be a key focus of the consultation. So what sort of stuff is the government wanting us to talk about? \nThe Government has set out what it described as “six important themes”. They are customer service, safety and security, global connectivity, competitive markets, supporting growth while tackling environmental impacts, and innovation, technology and skills. Are there any proposals to consider yet? \nAmong the proposals, the public will be asked to discuss the idea of having airport bag check-ins in town centres, and compensation for noise from airplanes. It will also examine how to make the most of existing capacity at UK airports. Newcastle Airport (Image: Handout, publicity picture) How long is it going to take? \nConsultations will happen over the next 18 months and will culminate in the publication of the final aviation strategy by the end of 2018, the government said. Read More Newcastle Airport in fresh appeal to government to stop Scottish business threat Is this good news for the region which has Newcastle International Airport? \nIt all depends. Bosses there are less concerned about the prospect of having airport bag check-ins in town centres as Air Passenger Duty (APD). Remind us why Newcastle airport is concerned about APD again? \nAir Passenger Duty increases the cost of flying from UK airports. \nNewcastle Airport in particular will lose out if the Scottish Government goes through with plans to halve and then abolish taxes from airports north of the border, making them cheaper to fly from. And a review of APD in Northern Ireland is set to take place as part of the government’s deal with the DUP. Read More Why you should care about Air Passenger Duty - and what it means for North East jobs So what’s the score in the rest of the country? \nFormer Prime Minister David Cameron had pledged that regional airports in England would not be disadvantaged by changes to APD in the devolved nations of the UK, but Chancellor Philip Hammond signalled at the end of last year that the Government will not act on APD until after the end of the Brexit negotiations. Like us on Facebook", "external_links": [], "published": "2017-07-21T16:30:00.000+03:00", "crawled": "2017-07-21T17:13:14.015+03:00", "highlightTitle": ""}