{"organizations": [], "uuid": "2d6c06f082ac3019f73b961182be5e5093109d4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13323176.ece/ALTERNATES/s1200/Sports-Direct-Boss-Mike-Ashley-Attends-High-Court-Over-Alleged-£15m-Banker-Deal.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13318350", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Mike Ashley's Sports Direct acquire 25% stake in Game Digital", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-13T09:55:00.000+03:00", "replies_count": 0, "uuid": "2d6c06f082ac3019f73b961182be5e5093109d4e"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13318350", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Mike Ashley's Sports Direct acquire 25% stake in Game Digital", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "franco manca  brexit", "sentiment": "none"}, {"name": "leggatt", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "franco manca", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "page", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}, {"name": "jonathon manning mike ashley", "sentiment": "none"}, {"name": "jeffrey blue", "sentiment": "none"}, {"name": "david page", "sentiment": "none"}, {"name": "andy stenning", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "franco manca", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "nintendo", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "fulham shore", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Google spending millions on favourable academic research papers, watchdog claims \nGoogle has spent millions funding academic research - including in the UK - which is favourable to the technology giant, a public interest watchdog has claimed. \nScholars and academics were handed sponsorship cash to produce papers that supported Google’s business and its policy goals in an attempt to curry favour with and influence the public, the research by the US-based Campaign for Accountability (CfA) said. \nIt cited studies by academics at Oxford and Edinburgh universities among those receiving payment from Google, either directly or indirectly. \nThe report stated: \nWhile some individual papers offered criticisms of Google, the overwhelming majority tended to support the company’s policy or legal positions. \nAn in-depth examination by the Google Transparency Project identified 329 research papers published between 2005 and 2017 on public policy matters of interest to Google that were in some way funded by the company. \nIn more than half of those cases (54%), academics were directly funded by Google, the watchdog said. The remainder worked for, or were affiliated with, groups or institutions that were funded by Google. \nIn the majority of cases, readers of the papers would not have been aware of the corporate funding, and academics did not disclose the Google funding in two-thirds of cases (66%), according to the watchdog. \nAuthors failed to disclose funding even when they were directly funded by Google in more than a quarter (26%) of cases, the CfA said. \nThe papers themselves centred on issues such as privacy and copyright. The report added: \nThe 329 Google-funded articles that we identified were cited nearly 6,000 times in more than 4,700 unique articles. “Overall, our analysis suggests that Google is using its sponsorship of academic research, not to advance knowledge and understanding, but as an extension of its public relations and influence machine. \nLast month Google was slapped with a record fine of €2.42bn (£2.1bn) by Europe’s competition watchdog after breaching antitrust rules with its online shopping service. \nGoogle was accused of abusing its market dominance as a search engine by promoting its own comparison shopping service in its search results, and demoting those of competitors. The company said it was considering launching an appeal against the European Commission once it had reviewed the decision. Google logo on the screen of a mobile phone, as the technology giant has spent millions funding academic research - including in the UK - which is favourable to the technology giant, a public interest watchdog has claimed (Image: Yui Mok/PA Wire) 9:00 Jonathon Manning Innovation needs to be at the heart of North East economy, LEP expert says \nInnovation needs to be more central to life and work in the North East if the region’s economy is to thrive, a leading expert has said. \nHans Moller, the North East LEP’s innovation director, was speaking at Northumbrian Water’s Innovation Festival, which is this week bringing together businesses, academics and young people with the aim of finding new solutions to key challenges facing society. \nMr Moller praised the company for staging the event but said that innovation needs to be more visible and include ideas from a people across all disciplines if it is to make a difference to the region. \nHe said: \nInnovation is extremely important to the North East. One of the ways of delivering the Strategic Economic Plan is supporting innovation, because we have to stay competitive. Post-Brexit , it’s even more important, for economic development, sustainability and climate change. \nI think it’s an absolutely amazing decision from Northumbrian Water to go with this. It’s exactly what I think companies need to do, because it’s about promoting and explaining innovation internally and externally, and making it visible to people, because that’s one of our challenges: dealing with and supporting innovation and making it visible. \nThe festival is aiming to get innovative people together to suggest ways of tackling issues including flood reduction, improving the environment, building the cities of the future and the workplace of 2030. LEP innovation director Hans Moller at the Northumbrian Water Innovation Festival (Image: Copyright unknown) 8:54 Jonathon Manning Newcastle lawyer wins top award for legal aid work \nMary Shaw, a partner at Newcastle-based David Gray Solicitors, has won a national award for her work in family law. \nMs Shaw took home the “Family Private (including Mediation) Award” at the Legal Aid Lawyer of the Year Awards in London. \nShe has worked at David Gray solicitors for 30 years and helped countless families and separating couples during this time. \nLawyers hoping to win at the awards must be nominated by fellow lawyers and clients. 8:47 Jonathon Manning Asos announces revenue increase driven by international sales \nOnline fashion retailer Asos has posted a jump in third quarter revenue, helped by a surge in international sales and investment in lower prices. \nAsos said total sales in the four months to June 30 rose 32% to £676m, driven by strong growth in the US and Europe, where revenue rose 38% and 41% respectively. In the UK, revenue rose 16% to £234.6m. \nThe company has previously said, as a net exporter, the collapse in the value of the Brexit-battered pound has helped its international sales rocket and allowed it to plough more into price cuts. \nBoss Nick Beighton said on Thursday: \nStrong half one sales momentum has continued through the third period supported by our ongoing investment in our customer proposition and in price. \nThis good performance has been underpinned by advances across all areas of our business including retail, technology, warehousing, delivery solutions and customer care. \nAsos said it remains on track to notch up full year pre-tax profit of £79.4m. \nThe group’s buoyant results come while most other British retailers are facing a torrid time. John Lewis has warned over a “turbulent and challenging” high street amid cost pressures from the rising inflation and higher costs and a dramatic shift in consumer spending. Lord Wolfson, the chief executive of Next, has also warned of another tough year ahead as the high street giant grapples with a slowdown in consumer demand. A customer shopping at Asos (Image: Tim Goode/PA Wire) 8:42 Jonathon Manning N Brown expectign to pay out up to £40m over 'flawed' insurance products \nPlus size retailer N Brown is to fork out up to £40 million in compensation to customers who were sold “flawed” insurance products by the firm. \nThe products, provided by a third party insurance underwriter, were sold to customers between 2006 and 2014. \nN Brown said in a stock market announcement: \nFollowing an assessment of the cost of potential customer redress, the group expects to incur an exceptional cost in this year’s income statement in the range of £35m to £40m. \nThe cashflow impact of this is forecast to occur from 2019 onward, and the group anticipates funding the full cost of customer redress from existing resources. \nIt follows a review prompted by a request from the Financial Conduct Authority that firms ensure general insurance products offer “value for their customers”. \nIt is not the first time N Brown has taken a hit linked to financial products. Earlier this year the retailer, which is behind the Power, Simply Be and Jacamo brands, was stung by exceptional costs relating to the mis-selling of PPI. \nN Brown took a £25.2m hit to cover compensation for customers after the deadline for settling claims was set for August 2019. The retailer offers consumer credit via a business that helps shoppers pay for products. N Brown may be forced to pay up to £40m out to customers (Image: PA) 8:37 Jonathon Manning Northern Stars awards launches to find the region's best new tech firms \nStart-up businesses from across the North East are being urged to apply for a competition which aims to find the region’s most promising tech start-ups . \nThe Northern Stars competition, which is run by accelerator programme Tech North, is open to firms who have received less than £2m in equity funding and who have a live product. \nRichard Gregory, director of Tech North, said: \nThe North has deep reserves of tech talent and that is why we have made our flagship Northern Stars competition even bigger and better than ever. \nPrevious Northern Stars winners have now achieved so much and all will tell you that the assistance and recognition that comes with winning this competition are really useful in helping push their businesses to the next stage. \nNow we want to identify more early-stage startups from the North’s great cities and towns and we know there’s some great talent out there just waiting to be discovered. \nNorth East firm ProxiSmart was named as a Northern Star winner last year after developing an app to save shoppers money on their parking. \nNorthern Stars winners will receive pitch training, a PR campaign, media training and tickets to TechCrunch Disrupt Berlin, and attendance at a London Investor Pitch Event. They will also receive opportunities to meet investors. \nFor the first time since the awards were launched, all 20 finalists will receive support and promotion from Tech North. The finalists will also receive tickets and an exhibition stand at the Founders Network Summit in 2018. \nApplications for the awards can be made through Tech North’s website, and the awards evening will be held on November 20. Tech North's Northern Stars pitch competition in Newcastle (Image: Mark Savage Photography) 8:32 Jonathon Manning   \n  Trade . \n  \nMr Sales, who is director of business, said: \nWe’re really   \nEach   One   8:27 KEY EVENT Embattled Southern Railway owner agrees to pay millions to fund improvements \nNewcastle-headquartered Go-ahead Group has pledged to fund 50 on-board supervisors as part of a £13.4m deal with the Government to fund improvements for long-suffering passengers. \nThe company is the behind strike-hit Southern Railway, which has been hugely criticised for its late services over the last year. \nGovia Thameslink Railway (GTR), which is run as a joint venture between Go-Ahead and French firm Keolis, said it had reached a long-awaited settlement with the Department for Transport (DfT) over its poor performance amid 18 months of strike action. \nIt will pay £4m to fund 50 on-board supervisors from next January for two years, while £7m will be put into a fund for the DfT to allocate towards projects and improvements to benefit passengers. \nThe remaining £2.4m will go towards target performance improvements and GTR must submit plans on how it will do this to the Government. \nSouthern has been involved in a bitter dispute with unions over proposals for so-called driver-only operated trains, with conductors holding several strikes in the past year, while drivers have separately walked out due to the row. But the railway has also been impacted by extensive improvement works, with GTR admitting it had “underestimated” the impact of this on the service. \nCharles Horton, chief executive of GTR, said: \nWe are pleased that this issue has been concluded, and accept and are sorry that our service levels haven’t been good enough for passengers. \nWe run the most congested network in the UK where passenger journeys have doubled in the last 12 years. \nThis has meant we have been running services for more and more passengers while also allowing stations to be rebuilt, platforms extended, track and signalling replaced and new trains and technology introduced too. A Southern rail train (Image: PA) 8:22", "external_links": [], "published": "2017-07-13T09:55:00.000+03:00", "crawled": "2017-07-13T10:31:52.011+03:00", "highlightTitle": ""}