{"organizations": [], "uuid": "cdcd326795784ac625c6d9f001daf4264af2f996", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13369052.ece/ALTERNATES/s1200/210717LHRairport-2JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ill-see-what-happens-scotland-13368792", "country": "GB", "domain_rank": 21960, "title": "'I'll see what happens in Scotland first' - minister holds back on scrapping air passenger duty", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-21T23:00:00.000+03:00", "replies_count": 0, "uuid": "cdcd326795784ac625c6d9f001daf4264af2f996"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ill-see-what-happens-scotland-13368792", "ord_in_thread": 0, "title": "'I'll see what happens in Scotland first' - minister holds back on scrapping air passenger duty", "locations": [], "entities": {"persons": [{"name": "callanan", "sentiment": "positive"}, {"name": "richard knight", "sentiment": "positive"}, {"name": "ross smith", "sentiment": "none"}, {"name": "graeme mason", "sentiment": "none"}], "locations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "manchester airport", "sentiment": "none"}, {"name": "south east of england", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}], "organizations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "apd", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "planning & corporate affairs", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Richard Knight, Operations Director at Newcastle Airport and Lord Callanan, Aviation Minister Share Get daily   Thank you for subscribing!   \nThe aviation minister was unable to give assurances that air passenger duty would be scrapped at North East airports saying he would ‘see what happens in Scotland first’. \nIt comes as the government today unveiled plans to develop a new strategy to help shape the future of the aviation industry to 2050 and beyond. \nIn a series of regional launches, one took place at Newcastle International Airport where Aviation Minister Lord Callanan was quizzed about concerns over its future in the next few years. \nFears have been raised the airport could be ‘left behind’ after a £1billion scheme to double the size of Manchester Airport’s Terminal 2 which has just got under way. \nAnd there’s the issue of Air Passenger Duty which puts £75 on a ticket for those travelling long haul in economy class. \nWhen asked if the Government would consider scrapping airport duty at all regional airports, Lord Callanan said the Government would be watching Scotland closely to see how the plan works out there first. \nHe said: “We can’t predict what might happen in future budgets so let’s wait to see what happens with it in Scotland first.” Richard Knight, Operations Director at Newcastle Airport and Lord Callanan, Aviation Minister \nNewcastle Airport in particular is expected to lose out if the Scottish Government goes through with plans to halve and then abolish taxes from airports north of the border, making them cheaper to fly from. \nAnd a review of APD in Northern Ireland is set to take place as part of the government’s deal with the DUP. \nWhen asked if the airport will be left behind, Newcastle-born Lord Callanan said: “No, not at all, we’ve seen the huge investment that Newcastle Airport is making in terms of the automated baggage facilities today. \n“The whole point of the aviation strategy is to see how we can grow aviation across the whole country not just the South East of England \n“We want to see all of the airports in the North expand and produce the new global Britain that we want to see as we leave the European Union.” \nHe added: “Clearly there is competition and Newcastle has to compete with Edinburgh and Manchester and competition is good for the consumer. I want to see Newcastle prosper and there is no reason they can’t all prosper.” Read More Sunseekers flock to Newcastle Airport for summer getaways on busiest day of the year \nWhen asked if the government would consider scrapping airport duty at all regional airports, Lord Callanan said the Government would be watching Scotland closely to see how the plan works out there first. \nHe said: “We can’t predict what might happen in future budgets so let’s wait to see what happens with it in Scotland first.” \nThe aviation plan unveiled on Friday will see a series of public consultations over the next 18 months which will culminate in the publication of the final aviation strategy by the end of 2018, the government said. \nUnder discussion will be subjects like customer service, security considerations and minimising the environmental impact of any future expansion in flights. \nAmong the proposals, the public will be asked to discuss the idea of having airport bag check-ins in town centres, and compensation for noise from airplanes. \nIt will also examine how to make the most of existing capacity at UK airports. Read More \nPlanning and Corporate Affairs Director, Newcastle Airport Graeme Mason said he was ‘confident’ Newcastle Airport could show how important it is for connectivity in the North East. Graeme Mason, Planning & Corporate Affairs Director at Newcastle International Airport (Image: The Journal) \n“In the future there will be more people flying, for leisure and for business and as we are a relatively peripheral region air travel is particularly important.” \n“In the post-Brexit world air travel will be more important for the North East than ever before.” \nRoss Smith, director of policy, North East England Chamber of Commerce said: “North East England’s businesses need the Government’s Aviation Strategy to ensure our region’s airports remain competitive and continue to extend our economic reach both domestically and globally. \n“During a positive meeting today (21 July 2017) to discuss the emerging strategy, Lord Callanan heard directly from Chamber members on the importance of air connectivity to the regional economy, as well as their concerns around the future of flights in the EU and the impact of Air Passenger Duty (APD) on competitiveness. \n“The next stage of the consultation must address the tax in detail, and look at measures to avoid disadvantaging North East England’s businesses compared to our Scottish neighbours, where plans to reduce APD will bring down the cost of air travel as of next April, while we continue to feel the burden.” Like us on Facebook", "external_links": [], "published": "2017-07-21T23:00:00.000+03:00", "crawled": "2017-07-21T23:55:03.029+03:00", "highlightTitle": ""}