{"organizations": [], "uuid": "6819ffbae22ddf41c7305ccf601fb56a0e32b9b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.plymouthherald.co.uk/images/localworld/ugc-images/276351/Article/images/30442907/16081659.jpg", "site_section": "http://www.middevongazette.co.uk/business.rss", "section_title": "Devon Live Business RSS feed", "url": "http://www.devonlive.com/14-of-the-best-uk-employers-on-skills-apprenticeships-and-the-workplace-of-the-future/story-30442907-detail/story.html", "country": "GB", "title": "14 of the best UK employers on skills, apprenticeships and the...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-17T08:00:00.000+03:00", "replies_count": 0, "uuid": "6819ffbae22ddf41c7305ccf601fb56a0e32b9b5"}, "author": "EMooreHerald", "url": "http://www.devonlive.com/14-of-the-best-uk-employers-on-skills-apprenticeships-and-the-workplace-of-the-future/story-30442907-detail/story.html", "ord_in_thread": 0, "title": "14 of the best UK employers on skills, apprenticeships and the...", "locations": [], "entities": {"persons": [{"name": "carol matthews", "sentiment": "none"}, {"name": "annesley", "sentiment": "none"}, {"name": "bradford", "sentiment": "none"}, {"name": "jon bridge", "sentiment": "none"}, {"name": "blain", "sentiment": "none"}, {"name": "john syvret", "sentiment": "none"}, {"name": "devon  rest", "sentiment": "none"}, {"name": "danny cox", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "beeston", "sentiment": "none"}, {"name": "cammell laird", "sentiment": "none"}, {"name": "matthew blain", "sentiment": "none"}, {"name": "thatcher", "sentiment": "none"}, {"name": "joanne moxon", "sentiment": "none"}, {"name": "chell", "sentiment": "none"}, {"name": "nelson", "sentiment": "none"}, {"name": "hargreaves lansdown", "sentiment": "none"}, {"name": "moxon", "sentiment": "none"}, {"name": "linda williams", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}, {"name": "matthews", "sentiment": "none"}, {"name": "martin thatcher", "sentiment": "none"}, {"name": "david tutton", "sentiment": "none"}, {"name": "syvret", "sentiment": "none"}, {"name": "nigel chell", "sentiment": "none"}, {"name": "sandford", "sentiment": "none"}, {"name": "bridge", "sentiment": "none"}, {"name": "tutton", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "south wales", "sentiment": "none"}, {"name": "herefordshire", "sentiment": "none"}, {"name": "rocester", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "merseyside", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "foston", "sentiment": "none"}, {"name": "nuneaton", "sentiment": "none"}, {"name": "bristol  based", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "staffordshire", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "riverside", "sentiment": "none"}], "organizations": [{"name": "nottinghamshire  total", "sentiment": "none"}, {"name": "pendragon plc", "sentiment": "none"}, {"name": "pendragon plc", "sentiment": "none"}, {"name": "triton showers", "sentiment": "none"}, {"name": "bae", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "triton", "sentiment": "none"}, {"name": "jcb", "sentiment": "none"}, {"name": "natural environment research council", "sentiment": "none"}, {"name": "nerc", "sentiment": "none"}, {"name": "plymouth university", "sentiment": "none"}, {"name": "myrtle farm", "sentiment": "none"}, {"name": "royal fleet auxiliary", "sentiment": "none"}, {"name": "weston college", "sentiment": "none"}, {"name": "skype", "sentiment": "none"}, {"name": "pendragon", "sentiment": "none"}, {"name": "derbyshire  total", "sentiment": "none"}, {"name": "liverpool  turnove", "sentiment": "none"}, {"name": "yorkshire building society", "sentiment": "none"}, {"name": "welsh water", "sentiment": "none"}, {"name": "cammell laird", "sentiment": "none"}, {"name": "aircraft carrier alliance", "sentiment": "none"}, {"name": "engineering college", "sentiment": "none"}, {"name": "sa brain & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "14 of the best UK employers on skills, apprenticeships and the workplace of the future By EMooreHerald | Posted: July 17, 2017 0 COMMENTS SHARES Comments (0) \nInvestment in skills and apprenticeships will play a key role in boosting productivity levels in the UK economy. \nAnd futurologists and policymakers are united in telling us that Britain needs to do more to develop the skills of its workers if it is to compete in world markets. \nHere 14 great companies from across the UK and industry sectors - who collective generate sales of more than £30bn and directly employ more than 161,000 - shares their thoughts on: \nGraduate and apprenticeship investment. \nWhat government support they would like to see to improve productivity. \nWhat the workforce of 2050 could be like. \nCombined turnover and employment of the 15 firms: £30bn plus and 161,000 Read next: Your dream job is here - almost 300 top Plymouth jobs listed \nApplied Automation (UK) \nWhat the company does: A global automation company with specialist operating divisions that build bespoke automation equipment for industry, control systems for super yachts and lean manufacturing systems. \nHead office : Plymouth, Devon \nRest of the UK : 15 \nTurnover: £15.5m \nDo you have any graduate/apprenticeship recruitment programmes?: \nWe have an apprenticeship programme for mechanical and electrical fitters and currently have a graduate placement with Plymouth University. To combat the skills shortage in the south west, we have plans to grow these programmes. \nWhat one thing should be done, by government to improve the quality of skills in the workplace? \nAlthough there is now more emphasis on STEM subjects, the way children are taught needs to allow for them to build on the core science and maths curriculum and make the link to technology and engineering. \nThat link is currently missing with a system that focuses on repetition and testing. \nChildren need to be able to get involved in inspirational practical activities where they can make mistakes and learn through trial and error. In engineering, we need questioning, problem solving, analytical and logic skills. \nThe government could do more to incentivise schools so children can apply their learning. \nHow do you see the workplace of 2050? \nBy 2050, we expect to see the full effect of IIOT (Industrial Internet of Things) and industry 4.0 in engineering. \nThere will be far greater automation, new developments in robotics, more connectivity and intelligent products and machines. \nIn these smart factories, people will work alongside robots as machines communicate between themselves to achieve high levels of efficiency and productivity across the supply chain and production line. \nBusinesses will have to evolve to service customer demand. Although it is likely to be a highly automated environment but the human factor will still be vital. We could see entire production lines working without people in \"lights off\", energy efficient factories where skilled teams programme and respond. \nBoots \nWhat the company does : The UK's leading pharmacy-led health and beauty retailer \nHead office : Nottingham \nTotal staff : 60,000 across the UK, including 8,000 in Beeston. \nTurnover: £11.98bn \nDo you have any graduate/apprenticeship recruitment programmes? \nMatthew Blain, head of HR operations, Boots UK said: \"We are really passionate about supporting young people to reach their full potential. \n\"These exciting and inspiring young people are our next generation of pharmacists, optometrists, accountants, dispensers, store managers and executives, and that's why we offer a range of apprenticeship, graduate and experience programmes that support them to enter the world of work. \n\"Since 2011 in the East Midlands, we have recruited around 100 young people into the business as part of our future leaders higher apprenticeship programme, and we have seen the amazing potential that these colleagues have. \n\"We also run apprenticeship schemes across the UK in opticians and healthcare to create a strong pipeline of talented people who have customer and patient care at their heart. \n\"We run a graduate scheme at our Nottingham support office, recruiting around 40 to 50 graduates each year across business areas including marketing and trading, HR, finance and supply chain. \n\"For students yet to graduate, Boots UK also offers a wide range of year in industry placements and summer internships to provide invaluable on-the-job experiences.\" \nWhat one thing should be done by government to improve skills in the workplace? \nMr Blain said: \"We are committed to delivering apprenticeships and training that build skills for our colleagues and our organisation. Continuing to evolve the conditions for success for everyone will be key to the long-term growth of capability across our sector. \nHow do you see the workplace of 2050? \nMr Blain said: \"While impossible to predict the future, it's worth drawing inspiration from the past. \n\"Despite an accelerating pace of change, workplaces have remained largely recognisable in recent decades – better equipped and with new technologies. \n\"However, we believe that the need for a human touch in retail and healthcare will to remain central to our customer and patient offer for many years to come.\" \nCammell Laird \nWhat the company does : Marine and Engineering services. \nHead office : Birkenhead \nDo you have any graduate/apprenticeship recruitment programmes ? \nCammell Laird runs an apprenticeship training programme recruiting around 20 apprentices a year. \nThe company has recruited more than 200 apprentices since 2008, of which 52 are still in training with a further 150 now in full time roles within the company having completed their apprenticeships. \nThe Cammell Laird apprenticeship programme is run in partnership with the Engineering College, based next door to the Cammell Laird site. Apprenticeship courses include mechanical fitters, pipe fitters, fabrication and welding. \nThe company also recruit graduates in naval architect and design engineer roles. It currently has around 8 graduates in the company either in training or full time roles. \nWhat one thing should be done by government to improve the quality of skills in the workplace? \nChief executive of Cammell Laird, John Syvret said: \"We delivers a significant number of accredited safety and plant machinery training courses for its respective workforce. \n\"A further recent focus has been centred upon business improvement techniques (BIT) which see's sustainable improvement activities that have delivered Quality, Cost and Delivery benefits. \nWe would encourage greater development of these techniques by government to boost productivity and value adding activity. \nEvery company is now seeking to enhance their competitive advantage and we have seen great benefits in working in partnership with clients and suppliers such as the Royal Fleet Auxiliary, BAE, the Aircraft Carrier Alliance, Rolls Royce and the Natural Environment Research Council (NERC). \n\"We would again encourage Government to support companies working in partnership. Productive partnerships produce better team working, greater understanding of specifications and greater efficiency.\" \nHow do you see the workplace of 2050? \nMr Syvret said: \"Engineering is a huge growth sector. The country has a requirement for major Infrastructure improvements in the energy, transport and logistics sectors. These capital projects are labour and skills intensive and will take many decades to complete. As such this provides a unique opportunity too.\" \nThe Co-op \nWhat the company does: The Co-op is one of the world's largest consumer co- operatives, with interests spanning food, funerals, insurance, electrical and legal services. \nHead office : Manchester \nTurnover : £9.5bn \nDo you have any graduate/apprenticeship recruitment programmes? \nWe offer apprenticeship opportunities. This year the Co-op is looking to offer a thousand apprenticeships, made up of opportunities for people both internally and externally at the Co-op. \nAll of our external positions are permanent contracts from day one and we pay the rate for the role, not the Apprenticeship Minimum Wage. \nWhat one thing should be done by government to improve the quality of skills in the workplace ? \nBritain is changing, technology is speeding this process up. We have a rising level of expectations from colleagues and consumers \nOrganisations are now facing change at an accelerated rate, as digital becomes a crucial ingredient for growth. \nMore skilled technology staff will be required as the world and business becomes more digital - more of the population need to be supported to be technologically enabled and skilled. \nLikewise, current schemes such as Apprenticeships attract funding only if full time hours yet the trend is to part-time & portfolio careers - how can the schemes be tailored to what the workforce of the future wants & needs? \nHow do you see the workplace of 2050? \nWith a multi-generational workforce, it will be essential that we provide choice to each person, regardless of where they are in their life journey. \nTo do this we needed to make sure whatever we include in our plans reflects the rapidly and continuously changing world of work. \nBy 2025 almost two-thirds of the workforce will be Millennials (aged 24-44). And we'll also have an ageing society with almost a third of the workforce over 50. Older people will choose to work part-time; there'll be more people with multiple job careers; more people with caring responsibilities \nChallenges for re-training, preparing for a retirement with lower pensions and fewer government benefits. So businesses need to look at creating workplaces that are becoming truly flexible to meet the demands of a multi-generational workforce - and leadership needs to be fluid and agile \nAs technology and humans work together more the human touch will be more and more valuable - so activity which cannot be undertaken by technology will highly prized \nThere will also be stronger links between social responsibility/community and businesses. As the government faces pressure on public spending, employers are taking a more important and social role in people's lives. \nPeople (especially Millennials) are increasingly looking for an organisation that aligns with their values and has a broader purpose – giving fulfilment beyond pay. \nEmployers have an increasingly important social role in people's lives organisations with a strong sense of purpose and ethics can differentiate. \nDŵr Cymru Welsh Water \nWhat the company does : Not-for-profit water and sewerage company \nHead office: Nelson, south Wales \nTotal staff: 3,000 across most of Wales, Herefordshire, and parts of Deeside. \nTurnov er: £744m \nDo you have any graduate/apprenticeship recruitment programmes? \nLinda Williams, director of HR, said: \"Welsh Water recruits for graduate and apprenticeships annually across all areas of the business. \n\"The latest campaign, What Are You Made Of? ran in March, and sought to fill a total of 17 apprenticeship roles across the company, spanning areas including water services, wastewater services, retail services and in our capital investment team. This was in addition to a number of graduate positions. \n\"In total, since 2011, we have recruited 129 apprentices.\" \nWhat one thing should be done by government to improve the quality of skills in the workplace ? \nMs Williams said: \"We place a lot of importance on work-based training and education for colleagues across Welsh Water, and we build those programmes around the challenges we know we will face in the future and the demands from the work we do. \n\"This development needs to be underpinned by a focus from government and education providers to ensure all school leavers are competent in numeracy, literacy and IT skills so, when they join the workplace, they are work-ready.\" \nHow do you see the workplace of 2050? \nMs Williams said: \"As a company, Welsh Water is currently developing our long-term vision - Welsh Water 2050. This identifies eight significant trends over the next 30 years, how they will impact on us and our customers and how they will be addressed. The trends include: \nAn ageing population \nClimate change and environmental changes \nCustomer expectations, and \nDigital age economy \n\"Our response will be aligned to the aims of the Future Generations Act, and the way our colleagues work will have to change along with the nature of our work so we are responding to the needs of our customers and addressing the long-term challenges facing the industry. \n\"One of our key strategic responses focuses on how we plan to maintain and develop our workforce over the next 30 years, so ensuring that we can continue to provide the most important public service at an affordable cost.\" \nHargreaves Lansdown \nWhat the company does: Hargreaves Lansdown is a leading provider of investment and pension services in the UK. \nHead office : Bristol \nBased in the south west : 940 \nTurnove r: £326.5m (net) \nDo you have any graduate/apprenticeship recruitment programmes? \nYes \nWhat one thing should be done by government to improve the quality of skills in the workplace? \nDanny Cox a spokesman for Hargreaves Lansdown, said: \"Provide the framework for business to thrive. Amongst other things this means sensible regulation, and proportionate and simple taxation. Thriving businesses attract skilled people to the area and improve the skills and knowledge of their workforce. \nHow do you see the workplace of 2050? \nMr Cox said \"In 10 years our information technology team has grown from 30 to around 180 people \n\"There was no such thing as an app a decade ago, but now we have had nearly 600,000 downloads. Technology will continue its dominance. \"And is those businesses which continue to focus on their clients and their changing needs, and who invest in their own people, who will still be successful in years to come. \nJCB \nWhat does the company does: The world's third largest manufacturer of construction equipment \nHead office: Rocester, Staffordshire with 10 other UK plants, including one producing engines in Foston, Derbyshire \nTotal staff: 6,000 in the UK \nOverseas: 6,000 \nTurnover: £2.3bn \nDo you have any graduate/apprenticeship recruitment programmes? \nJCB spokesman Nigel Chell said: \" Yes, we offer a range of intermediate, advanced, and higher apprenticeships as well as a wide selection of graduate programmes covering aspects of engineering and business. \n\"In addition we have many funded placement opportunities for those already studying at university either as summer placements or for those who want to take a year out.\" \nWhat one thing should be done by government to improve the quality of skills in the workplace \nMr Chell said: There are so many ways to develop an exciting career in a global manufacturing business. \n\"It is important that people are able to identify which routes might be right for them. \n\"We would welcome a consistent and comprehensive careers and employment advice service, to help people to understand their options and prepare them for interview and assessment. \n\"For school leavers this should include awareness that study at degree level is possible through higher and degree apprenticeships. \nThese offer the opportunity to undertake intensive study one day a week towards a degree while working in a real business role the other four days. This enables people to learn in a real business context as well as earn a good salary as they work towards becoming a professional. \n\"Today there are pockets of expertise in some schools which have this knowledge to share, but a consistent high standard is required to make sure everyone is aware of the exciting opportunities available to study in engineering and business subjects. \n\"Matching the right people to the right business roles is key in boosting productivity while also enjoying what you do on a day-to-day basis.\" \nHow do you see the workplace of 2050? \nMr Chell said: The pace of change of technology is growing rapidly. \n\"The ability to communicate and share knowledge and data on a global basis will continue to expand and the connected society will continue to change the way in which we interact with others, not only local to us, but on a global basis. \n\"Future business projects will increasingly use skills and knowledge from around the globe, offering dispersed teams who are able to progress projects 24 hours a day. \n\"This will shorten the time to deliver new and improved solutions for customers. The use of simulation, automation, and augmented reality is likely to change how we interact with devices around us, enabling them to be more efficient and sustainable to the planet.\" \nPendragon \nWhat the companies does: Pendragon plc is the UK's largest automotive retailer \nHead office: Annesley, Nottinghamshire \nTotal staff: Across the group 9,374 \nTurnover :£4.45bn \nDo you have any graduate/apprenticeship recruitment programmes? \nJoanne Moxon, HR director: \"We pride ourselves in both spotting and developing young talent. \n\"Each year we take on a number of talented undergraduates across the business, in areas such as finance, marketing, business development, HR and operations. \n\"The year-long placement sees students take a year out of their studies, with the opportunity to apply the knowledge they've learnt so far in the workplace, and gain invaluable experience in a busy retail environment. Many of our undergraduates return to us and take on permanent positions within the company on completion of their studies. \nhe key to any great talent programme is to listen and continually review programmes to reflect the needs of the talent we wish to attract. \nAlongside our graduate and undergraduate talent programmes, Pendragon PLC takes on large numbers of apprentices each year, again in diverse roles across the business. \nThe government levy provides us with an avenue to focus even further on investing in and developing future talent through apprenticeship schemes. \nWhat one thing should be done by government to improve the quality of skills in the workplace? \nMs Moxon said: \"The automotive industry is, regrettably, still a male-dominated industry, and while we at Pendragon are working to highlight the wealth of opportunities available to females, there's still more to be done. \n\"As a company we do work in schools to promote careers that have been traditionally aimed at males, such as engineering, to show that these careers can be equally as successful for women and break down stereotypes. \n\"But this is an area that would benefit from more government support to ensure that young females are getting the career education to help them into industries and disciplines that are still underrepresented by women. \nIt's important that gender stereotypes and misconceptions are broken down early on, with the government aiding the industry to celebrate the vast opportunities available to all, allowing women to succeed in these areas. \n\"At Pendragon, we celebrate equal opportunities for all and many women occupy leadership roles across the business. \nHow do you see the workplace of 2050? \nMs Moxon said: \"As people live longer, and subsequently work for longer, there are multiple generations working together within a company, all with varying needs, values and priorities. \nIt is important that as the workforce evolves, the workplace does not get left behind. \nNew technologies of course will also play a part in shaping workplaces of the future. Already at Pendragon, we've seen a change in the way we interact as a team thanks to technology – for example conducting Skype and online meetings, rather than travelling across the country. \nBy 2050, many companies may see a total dissolution of head offices – instead accessing a talent pool of remote workers nationwide. This will also lend help to more flexible working arrangements for employees. \n\"And 2050, our customer's expectations will have evolved beyond recognition from what they are today, but I have no doubt that our organisation, our team members and our workplace will have adapted accordingly. \nPrincess Yachts \nWhat does the company do: Designs, builds and sells motor yachts to customers in more than 100 countries \nHead office: Plymouth \nRegionally: 2,342 (across seven facilities within a 10-mile radius of Plymouth) \nRest of the UK: 3 staff in London \nOverseas: 5 staff in Hong Kong and in the USA in regional Princess Yachts offices (with a global network of over 67 distributors worldwide) \nTurnover: £221m \nDo you have any graduate/apprenticeship recruitment programmes? \nYes and taking in approximately 20 apprentices each year. \nWhat one thing should be done by government to improve the quality of skills in the workplace? \nThere is a significant gap in how the population in general, and especially in younger people, perceive and understand what businesses do and the contribution business brings to the community and country as a whole. \nYoung people need to understand what actually happens in businesses and what skills they need (and can develop). \nThere is a lack of understanding in the education system about business and the business agenda – this needs addressing so that young people get a real sense of what a tangible difference they can bring to the environment and community around them from working in business. \nToo often people are enticed out of the region, comparatively small investments can make big differences regionally national government needs to be more targeted. \nThe south west all too often is lumped in with the \"south\" in general, and is constantly overlooked. \nWe should be incentivised to build further on the in-house skills training we already provide and government should encourage more involvement from education providers to go into business and run courses there. \nHow do you see the workplace of 2050? \nThe impact of technology will continue apace, and we need to embrace this and use it to enhance the traditional industries of manufacturing and design. \nThe fundamental power of the personal relationship will continue to have a significant role in the work place and UK plc's place in the world, and maintaining this will be of key importance in how successful technology continues to develop. \nGood people will always be in demand. The key for the UK is to ensure we still create good people. The workplace for 2050 will be different to now with the need for continually developed transport and communication links. \nRiverside \nWhat does the company does : A provider of affordable housing, care and support services in England and Scotland, with nearly 53,000 homes in management. \nHead office : Speke, Liverpool \nTurnove r: £370m \nDo you have any graduate/apprenticeship recruitment programmes? \nChief executive of Riverside, Carol Matthews, said:\" Yes, and at the moment, Riverside has 50 apprentices in the business at different stages of their apprenticeship, with the majority based in Merseyside. \n\"They work in areas including customer service, IT, finance, housing services and repairs. \n\"We have a growing commitment to apprenticeships and use the new Apprenticeship Levy to produce the maximum impact. \n\"We also have in place a national programme called GROW – Giving Real Opportunities of Work - which we are continually developing and improving. \n\"It supports people, including former service users and customers of Riverside, in a variety of subject areas so that they gain valuable qualifications to make them more employable when the complete the initiative. \nWe will be supporting up to 18 people across the country with in the next year. \nThe number of apprentices will continue to increase over the coming year as we identify more opportunities to encourage and support people to develop. \nWhat one thing should be done by government to improve the quality of skills in the workplace? \nMs Matthews said: \"The post-Brexit shortage of traditional construction skills is likely to be a significant issue for housing developers. \n\"This can be addressed by the Government encouraging and creating more incentives for companies to use modern methods of construction and using more efficient off-site fabrication, so they are less dependent on traditional building techniques. \nThis is only taking off very slowly in the UK and needs major Government support to get to a po where critical mass is achieved, showing leadership through the construction it commissions. \n\"The Government needs to make it an absolute priority to support schools and other education providers to work more with employers to build the construction workforce of the future. There are some great partnerships out there, but it's really important that more young people leave education better equipped for working life. \n\"Different parts of the country have different skills gaps and these could be addressed by those closer working relationships, and better promotion of apprenticeships, along with more opportunities for vocational learning.\" \nHow do you see the workplace of 2050? \nMs Matthews said: \"Almost unrecognisable. We envisage the workplace to be more flexible and agile, with the workforce less tied to a single employer and a place of work, moving from role to role more frequently. \n\"This will require the workforce to have a range of skills, and employers will continue to develop them throughout their careers.\" \nSA Brain & Co \nWhat the company does: Brewing and hospitality \nHead office : Cardiff \nTurnover: £135m \nDo you have any graduate/apprenticeship recruitment programmes? \nJon Bridge, group head of people, said: \"SA Brain has a long standing commitment to supporting its team members with apprenticeships. \n\"A key consideration for us has been ensuring we link together the benefits that an accredited apprenticeship qualification offers the learner, as well as our business, with the need to ensure our training programmes deliver and equip our teams with the key skills they need to succeed in role and develop their careers. \n\"We currently have 57 front of house team members undertaking an apprenticeship with a further 46 having successfully completed one this year. We also have 62 kitchen team members undertaking an apprenticeship with a further 17 having successfully completed a kitchen apprenticeship this year. \n\"Following the launch of our new development programmes we are aiming to increase the number of apprentices within our pub estate to 20% of our workforce.\" \nWhat one thing should be done by government to improve the quality of skills in the workplace? \nMr Bridge said: \"In my opinion the Government [Welsh]should radically change their approach to understanding what should be included in NVQ frameworks, national occupation standards and curricula in schools. They should look to develop a truly collaborative working partnership with employers. \n\"There is a potential opportunity to turn the system on its head and to allow the frameworks, standards and curriculum to be set with or by the employers in industry itself. \n\"This would allow for a far more pragmatic learning experience. It would take into account the needs of the employer and result in individuals who could hit the ground running, boosting workplace productivity rather than the time lag to develop individuals that currently exists.\" \nHow do you see the workplace of 2050? \nMr Bridge said: \"The workplace of 2050 would be a very different place. It has been widely reported that AI and robots could have a significant impact on the number of jobs available in the future and whilst this is hard to quantify it may well play a part in the future of the UK workforce.\" \n\"There are a number of key areas that may be impacted with the passage of time: \nEmployers having to 'give more and expect less' from people to stand a chance of retaining their people \nTailored training to meet individual needs \nFlatter organisational structures with less management as people are given autonomy to work in their own way and utilise technology \nA workforce that prioritises social interaction and emotional connection to what a company stands for \nEmployment tenure accepted as being for the short term or finite period as people moving between roles becomes the norm \nThe end of the traditional office workspace - significant remote working across majority of sectors \nFurther automation of tasks as the consumer demand for speed and convenience grows.\" \nThatchers Cider \nWhat the company does : Makes cider \nHead office: Myrtle Farm, Sandford, Somerset \nTotal staff number: 206 \nHow many are based in South West: 165 \nRest of the UK: 41 \nTurnover: £72.5m \nDo you have any graduate/apprenticeship recruitment programmes? \nOwner of Thatchers Cider, Martin Thatcher, said: \"We currently support students at Weston College through a work experience/apprenticeship programme. We are also talking to local universities on ways of working together in the future.\" \nWhat one thing should be don by government to improve the quality of skills in the workplace to boost productivity? \nMr Thatcher said: \"Recent focus on apprenticeships has led to improvements in skills, but there is still much more to be done. We are concerned that schools and universities are giving are young people qualifications, but are not work-ready. So we need redirection of what our young people are taught. \n\"We would like to see more work based training where we as employers can teach people the latest technology as well as traditional methods, but also the responsibility and behaviours expected at work.\" \nHow do you see the workplace of 2050? \nMr Thatcher said: Mr Thatcher said: \"In one respect it feels like the world around us is changing so quickly – from economic, social and political perspectives – that to try and predict what is happening in one year's time, let alone 30, is a massive challenge. \nYet here at Thatchers we can be certain that we will maintain our focus on being a family business – led by our fifth generation by the time 2050 comes around. \n\"At Myrtle Farm we have a commitment to the most advanced technology that allows us to craft the highest quality, consistently great tasting cider for our customers. The workplace of the future will of course see massive changes in technology – but I firmly believe that whilst technology may well replace some manual jobs, it cannot replace the individual's enthusiasm and passion that we have within our workplace.\" \nTriton \nWhat the company does: Triton Showers is the UK's leading manufacturer of electric, mixer and digital showers, \nHead office: Nuneaton. \nTotal staff: 350 \nDo you have any graduate/apprenticeship recruitment programmes? \nManaging director David Tutton said: \"Triton has an ongoing commitment to apprenticeships with a number of roles made available annually across various departments. \nOur scheme gives ambitious school leavers the chance to step straight into a career with the opportunity to earn while they learn. \nAs a result, a large proportion choose to stay with Triton for a number of years, becoming experts in their field.\" \nWhat one thing should be done by government to improve the quality of skills in the workplace \nMr Tutton said: \"Investment in grants for apprenticeships and schemes that offer young people valuable insights into the world of work could help build a strong workforce for the future. \n\"Some students receive minimal careers advice in schools, so forging better links between industry, the education profession and local government representatives is just one way to ensure school leavers' skills continue to match business needs.\" \nHow do you see the workplace of 2050? \nMr Tutton said: \"Consumer demands will change quite significantly over the next 33 years so our product offering and ways of working need to remain dynamic. \n\"We will continue to focus on the development of our factory facilities in the UK which have been central to Triton's business for decades. \nEngaging with new technologies, such as predictive maintenance, 3D modelling and printing, will also ensure we continue to deliver market leading product innovation. \n\"In years to come, if today's generation of Millennials is any indication, there will be a growing demand for social consciousness too. \n\"Workers will be driven towards businesses that demonstrate a caring approach to their employees, customers and their environment. \n\"According to a report by PwC titled 'The Future of Work', employees are already more ethically aware and want to work for organisations with strong ethics. \n\"In order to continue to attract and retain employees in a competitive market, having a clear vision, mission and values will be vitally important for any ambitious UK plc.\" \nYorkshire Building Society \nWhat the company does: Savings and mortgages provider \nHead office: Bradford \nRegionally: 2,500 in West Yorkshire \nFinancials: Operating profit in 2016 of £128m \nDo you have any graduate/apprenticeship recruitment programmes? \nYes, we took on 12 apprentices last year and are in the process of recruiting 24 this year. These will work across a variety of roles covering IT, marketing, risk, customer service, HR and finance, predominantly at our Leeds and Bradford office sites. \nWhat one thing should be done by government to improve the quality of skills in the workplace \nMany organisations are already seeing the benefits of introducing apprenticeships to the workplace and utilising the professional qualifications built into these development opportunities. \nTogether with learning 'on the job', organisations can ensure that the required skills are being developed linked to their specific needs, and also challenge their existing processes and procedures. \nOne of the key issues for promoting apprenticeships is the lack of understanding within schools and colleges about how these can develop their students. More can be done to ensure apprenticeships are placed on an equal footing with continuing into higher education when it comes to outlining options to school and college students. \nHow do you see the workplace of 2050? \nThe composition of workforces and customer bases will change dramatically over the next few years which means the workplace will need to change with it. \nHistorically a job was for life but the current generation is more inclined to move between organisations to support their career advancement. \nThe transformation of digital technology already means that by the time many people graduate, what they have learned in the first two years has already been superseded by new technology. \nCompanies must ensure that they are future focused and look at the market and ensure that they are developing their people, processes and procedures to stay in line with, or ideally lead, the market's new approaches. ", "external_links": [], "published": "2017-07-17T08:00:00.000+03:00", "crawled": "2017-07-17T15:14:46.000+03:00", "highlightTitle": ""}