{"organizations": [], "uuid": "0eb7e182059f7834e382c0194848d192b96e482b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11261870.ece/ALTERNATES/s1200/JS62781946.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13374808", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Ryanair warns Brexit could ground UK flights", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-07-24T09:55:00.000+03:00", "replies_count": 0, "uuid": "0eb7e182059f7834e382c0194848d192b96e482b"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13374808", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Ryanair warns Brexit could ground UK flights", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "michael o'leary", "sentiment": "none"}, {"name": "michael o’leary", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe  bu", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "continental europe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Rumours of Asda takeover causes sharp rise for B&M shares \nShares in B&M rose sharply this morning following weekend reports that supermarket giant Asda is mulling over a £4.4bn takeover of the discount retailer. \nAsda, owned by Walmart, is exploring a bid for the firm amid a flurry of consolidation in the supermarket sector, according to the Sunday Times. \nB&M shares were up nearly 5% to 357p in morning trading on Monday. \nThe chain is owned by the billionaire Arora brothers, who have built B&M up to a 500-plus store retail giant since taking control of the firm in 2004. \nAcquiring the retailer would give Asda access to a network of high street shops through which to distribute its products, including the George clothing range. \nClive Black, analyst at Shore Capital, said: \nB&M would bring great capability in general merchandise value retailing for Asda, with its strong range, authority, pricing and space growth, whilst providing George, Asda’s excellent apparel brand, the scope for space growth in largely complementary locations. B&M is also increasingly effective in grocery, we should add. \nCost synergies would be potentially evident in central overheads, sourcing and logistics. \nA deal would also release pressure on Asda’s core supermarket business, which has seen years of sales declines as its competitors have stolen a march on it. \nTesco is attempting a £3.7bn merger with Booker and a mooted attempt by Sainsbury’s to acquire Nisa is also thought to be on the cards, barely a year after it took over Argos. Asda is rumoured to be in talks to buy B&M 9:05 Video: Inside Pele Tower after its restoration last year 9:00 KEY EVENT Corbridge to get its own 'Pele Ale' after microbrewery comes to Pele Tower \nCorbridge’s historic Pele Tower is set to become a local pub after its new manager installs a microbrewery in the 14th century property . \nThe Pele Tower was originally used to protect the town from Border Reivers, but was converted into an events venue last year by owners Shaun and Jane Cutler. \nBut now the pair have decided to lease the venue to pub trade veteran Paula Williams, who is planning to install a microbrewery at the site and brew her own “Pele Ale”. \nThe Tower will continue to host events such as champagne and wine tasting nights but will also be open more regularly as a local pub. \nMr Cutler said: \nBecause it’s been run as an events venue it means the doors aren’t open all the time. It’s only open when somebody hires it. \nWe have been looking around for the next stage of its development with the plan to keep the doors open more often. It continues to be a private hire venue but it also becomes more a part of the community. \nPaula has quite a lot of experience in the entertainment and bar industry, but the principle behind it is that they will continue with what we started but open Pele Tower on a daily basis. She has also had the exciting idea to create a small microbrewery and brew their own Pele Ale. Corbridge pele tower which has been restored 8:55 Jonathon Manning Cyber attack hits sales at Household Goods giant Reckitt Benckiser \nHousehold goods giant Reckitt Benckiser has laid bare the impact of a cyber attack that wrought havoc across its factories last month.The Durex-to-Dettol firm confirmed like-for-like sales fell 2% in the second quarter after the ransomware attack significantly disrupted its manufacturing and orders systems across a raft of markets, including the UK.Chief executive Rakesh Kapoor said: \nFrom an operational perspective, as expected we had a tough first half, with challenging conditions exacerbated by a sophisticated cyber attack. \nWe are experiencing tough market conditions, and we still have work to do on addressing the full implications of the recent cyber-attack. \nNet revenue in the first half of the year, nudged up 2% at constant exchange rates to £5bn, and adjusted operating profit rose 1% to £1.19bn.Pre-tax profit came in at £1.02bn for the six months to June 30, up from £697m.Reckitt recently bought US baby formula maker Mead Johnson Nutrition in a mammoth $21.2bn (£16.3bn) deal to expand its consumer health arm, and said on Monday that the integration is progressing well.Last week, the firm confirmed a $4.2bn (£3.2bn) deal to sell food brands including French’s mustard and Frank’s hot sauces to the maker of Schwartz spices.US group McCormick fought off a number of rival bidders to secure the British firm’s food business in a move that will propel it to the number one position in America’s condiments market.Mr Kapoor added: \nIn the first half of the year, we have made significant progress on portfolio transformation and becoming a more focused consumer health and hygiene business, with both the acquisition of Mead Johnson Nutrition, and the agreed sale of our Food business. Reckitt Benckiser Jonathon Manning Newcastle firm launches free tech to streamline 3D printing services \nA Newcastle tech firm that is helping to bring video game characters and architecture designs to life is now offering businesses free access to its revolutionary 3D printing software . \nWhispering Gibbon is allowing companies to use its Perfected3D software, which converts designs into models that can be printed by a huge range of 3D printers, free of charge during its beta trial. \nAccording to the firm, the software is set to change the way 3D printing works by making it accessible, affordable and efficient, by fully automating the process. \nWhispering Gibbon founder and CEO joe Stevens said: \nTraditionally 3D data has been manipulated to be viewed on screens. \nIt has been created to be viewed and now people are starting to print them, but the object that is viewed is not printable. There might be small holes in the product or it might be too thin.” \nMost 3D models are manually ‘hand-fixed’ to make them print ready, which is costly and time consuming. \nBy fully automating the process our platform keeps costs down and enables scale. \nThis makes 3D printing much more accessible for smaller companies and cost effective for bigger companies, allowing them to create personalised content and easily scale up. \nIn March Whispering Gibbon received a six-figure investment from Creative England to focus on the launch of the software. The tech was originally called RenderFab but has since been rebranded to Perfected3D. \nDuring its beta service Perfected3D is free to use online. All companies need to access the trial is a 3D printer. \nThe tech can be widely used in areas, such as the video games sector and construction industries. It allows companies to convert scenes from video games or architectural designs into 3D print ready models. The team at Whispering Gibbon (Image: Whispering Gibbon) 8:45 Jonathon Manning Public sector staff work £11bn unpaid overtime a year, union says \nPublic sector workers are putting in more than £11bn worth of unpaid overtime a year, a new study has revealed. \nThe GMB union said its research showed the dedication of nurses, midwives, librarians and other public sector employees. \nAn analysis of official data found that almost one in four staff regularly worked an average of eight hours unpaid a week. Around one in 20 worked at least 15 extra hours a week, said the report. Midwives, social workers and school support staff were among those most likely to put in unpaid overtime, said the GMB. \nUnions are campaigning for the Government to end its cap on public sector pay. Rehana Azam, the GMB’s national secretary for public services, said: \nChancellor Philip Hammond says that public sector workers are ‘overpaid’ but these shocking new figures show just how out of touch he is. \nPublic sector workers are the backbone of our society, working above and beyond their contracted hours because they are committed to jobs they love. \nYet the Government rewards their dedication with crippling real-terms pay cuts. \nMinisters think they can push staff indefinitely, but low pay, unmanageable workloads and stress are pushing many of our members to the limit. \nUnpaid hours mean that thousands are effectively earning below the minimum wage, especially in the care sector. \nThe reality is that public services are held together by the devotion of overworked and underappreciated employees, who are effectively handing the Government £11bn worth of their labour for free. \nIt’s frankly patronising and ill-informed to dismiss calls for wages increases when millions of salaries would rise by a quarter if payslips genuinely reflected all hours worked. \nIt’s time to tackle ever rising workloads and give our public sector workers the real pay rises they desperately need and deserve. Nurses and other public service staff work £11bn unpaid overtime a year (Image: Getty Images) 8:40 Jonathon Manning McColl's profits fall after Co-op stores acquisition \nProfits at convenience store chain McColl’s were almost cut in half after it took a hit from its acquisition of 298 Co-op stores, despite warm weather boosting sales. \nThe group said pre-tax profits fell from £8.2m to £4.5m in the first half of the year after it booked £2.3m in exceptional cost linked to the deal. But revenue rose 7.6% to £504.8m in the six months to May 28, with like-for-like sales growing 0.2%. \nIn the second quarter, comparable sales increased 1.4%, supported by “favourable weather and our evolving mix of growth products”. \nChief executive Jonathan Miller said: \nI am encouraged by the performance we have delivered over the first half of the year as our business has continued to gain momentum. \nWe have traded well in a challenging environment, and also benefited from the recent hot weather, which has helped to drive sales in key growth categories including grocery and alcohol. \nWe are delighted to have completed the integration of the acquired stores, on time and on budget. \nAnalysts believe the Co-op deal has the potential to drive a surge in earnings at McColl’s, but the grocery sector is in flux, with a number of bigger players attempting to consolidate. \nTesco is attempting a £3.7bn merger with Booker and a mooted attempt by Sainsbury’s to acquire Nisa is also thought to be on the cards. \nMr Miller added: \nAs the wider convenience and wholesale sector evolves and continues to grow, McColl’s is in a strong position to benefit. \nWe remain confident that our standing as a leading neighbourhood retailer will allow us to continue to achieve further progress against our strategy and deliver sustainable returns for shareholders. McColls Convenience Store on Abbey Drive, Jarrow (Image: The Chronicle) 8:35 Video: Take a tour around Komatsu's Birtley factory 8:30 Jonathon Manning Komatsu pays tribute to Gateshead staff as it marks 30 years in the town \nExcavator manufacturer Komatsu has celebrated the 30th anniversary of its North East factory by welcoming back a former colleague who now heads up the global company. \nTo celebrate the plant’s anniversary employees and delegates from the company’s headquarters in Japan attended a tour of the site at Birtley, Gateshead. \nIncluded in the number was Komatsu Group CEO Tesuji Ohashi, who spent seven years working at the UK plant when it was first opened. \nMr Ohashi said: \nI have nothing but fond memories of my time at Birtley and learned so much during my years here. It is fantastic to see so many old friends and colleagues here on this momentous day. \nKomatsu UK arrived at a time when North East industry was changing dramatically. Not only did I work at Komatsu UK, but back in 1984, before the site was acquired, I was one of the team members seeking a suitable location for the plant. \nI am not exaggerating when I say the whole region opened its arms to welcome us and I have felt that this is my second home ever since. In particular, I thank Gateshead Council, which supported us when the plant was established, and continued to do so ever since. \nThe Gateshead factory manufacturers a range of vehicle used on construction sites. Since the start of the year the plant has launched four new excavators, including the award-winning PC390HRD-11 model. (L-R) Komatsu UK managing director Peter Howe with group CEO Tetsuji Ohashi 8:25 KEY EVENT BREAKING: North East's Quorn to create 300 jobs in Teesside and invest £150m in UK \nThe boss of the North East’s Quorn Foods has backed the firm to ride out any Brexit disruption to its European business as he unveiled plans to create 300 jobs in Teesside and invest £150m in the UK. \nChief executive Kevin Brennan said he is confident a growing appetite for the meat substitute in the US, Australia and Asia will keep the business on track if confronted by tough trading conditions across the 27-nation bloc. \nMr Brennan said the food producer could also cope with the introduction of an EU trade tariff following Brexit, as long as it is in line with the single-digit charges the company faces when trading with America and Australia. The comments came as he pledged to create hundreds of jobs in the North of England over the next five years through an investment drive at its manufacturing operation in Billingham, Teesside. \nMr Brennan said the company had not sought any Brexit assurances from the Government before committing to the investment, but is keeping a close eye on how the divorce talks unfold. \nHe said: \nWe are running a company where we believe we can quadruple the business to one billion US dollars. Europe plays a part in that but it isn’t essential to achieving that. \nThe UK business is still a business with incredibly strong growth. The US is a business with enormous scale potential to us, alongside Australia and Asia. \nWe are still taking a positive view on commercial investment in Europe. We continue to invest significantly into Germany, Italy and the Nordics. \nBut equally we know that our category is growing everywhere in the world that if Europe gets less attractive, we can divert our growth to other places. \nHard Brexit tariffs would not be great for us, but it wouldn’t be the end of the world. \nQuorn, which sells meat-free alternatives to sausages, mince and burgers, saw UK sales grow 15% in the first half of the year. Global growth rose 19% over the period, while European sales grew by 29%, US sales were up 40% and Asia and Australia sales climbed 35% respectively. \nMr Brennan said Quorn has bucked challenging market conditions and is achieving double-digit growth in most British retailers, adding “most food companies would be happy if they had any growth at all in the UK”. \nWhile the firm has managed to shield customers from Brexit-induced price hikes following sterling’s collapse, he could not guarantee costs will not rise in future. He said the company is “broadly neutral” to the Brexit-hit pound, with rising import prices being countered by improving export sales. \nExponent Private Equity and Intermediate Capital Group bought Quorn from Bisto maker Premier Foods for £205m in 2011, before selling four years later to Philippine food giant Monde Nissin. The company employs 650 staff and is based in Stokesley, North Yorkshire. Kevin Brennan, chief executive of Quorn Foods, at the company's premises in Stokesley (Image: ©Mike Cowling for Simon Dewhurst Photography) 8:20 Jonathon Manning Gove plans for new farm subsidies given cautious welcome in North East \nNorth East farmers have given a cautious welcome to Government plans to replace EU subsidies with payments for helping protect the countryside. \nEnvironment Secretary Michael Gove has indicated that farmers will be paid for delivering benefits for nature and the countryside after Brexit instead of receiving subsidies for the amount of land they farm. \nUnder the Europe-wide Common Agricultural Policy UK farmers receive around £3bn a year in subsidies, mostly linked to the amount of land they farm. \nThe Government has pledged to maintain levels of funding up to 2022, but Mr Gove said ministers could only go on “generously supporting farmers” in the face of other demands on spending if the environmental benefits were clear. \nIn his first major speech as Environment Secretary, Mr Gove said reform of the system was needed, with payments for woodland creation, habitat protection, caring for treasured landscapes and higher animal welfare. \nMr Gove said: \nThe Common Agricultural Policy rewards size of land-holding ahead of good environmental practice, all too often puts resources in the hands of the already wealthy rather than into the common good of our shared natural environment, and encourages patterns of land use which are wasteful of natural resources. \nHe said the UK should take the opportunity presented by leaving the EU to reward farmers for environmental protection. \nInvestigations by Greenpeace’s Energydesk have revealed that one in five of the biggest recipients of European farming subsidies in Britain are billionaires and millionaires on the Sunday Times Rich List, a number of of them in the North East. Michael Gove speaking at the WWF Living Planet Centre in Woking, where he told an audience of environmental and countryside organisations that Brexit gives scope for Britain to be a global leader in green policy (Image: PA) 8:18", "external_links": [], "published": "2017-07-24T09:55:00.000+03:00", "crawled": "2017-07-24T10:12:49.002+03:00", "highlightTitle": ""}