{"organizations": [], "uuid": "969d3784574d1d0a2847709fb08b12294eb6b63e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30444055/16082289.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/pole-arnold-sponsors-women-in-business-entrepreneur-award/story-30444055-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Pole Arnold sponsors Women in Business entrepreneur award | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.844, "site_type": "news", "published": "2017-07-17T17:24:00.000+03:00", "replies_count": 0, "uuid": "969d3784574d1d0a2847709fb08b12294eb6b63e"}, "author": "", "url": "http://www.leicestermercury.co.uk/pole-arnold-sponsors-women-in-business-entrepreneur-award/story-30444055-detail/story.html", "ord_in_thread": 0, "title": "Pole Arnold sponsors Women in Business entrepreneur award | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "smallman", "sentiment": "none"}, {"name": "eileen richards", "sentiment": "none"}, {"name": "torr waterfield", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "richard todd", "sentiment": "none"}, {"name": "claire dandy", "sentiment": "none"}, {"name": "emma jesson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "leicester mercury women", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicester tigers stadium", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "pole arnold", "sentiment": "none"}, {"name": "university of leicester  rising star award", "sentiment": "none"}, {"name": "narborough", "sentiment": "none"}, {"name": "mne accounting  contribution", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Pole Arnold sponsors Women in Business entrepreneur award By Lauren_Mills | Posted: July 17, 2017 0 COMMENTS SHARES Setting for inaugural Women in Business Awards Pole Arnold sponsors Women in Business entrepreneur award X \nCopy link to paste in your message / \nWith the deadline for nominations approaching we are highlighting each of the categories at the Leicester Mercury Women in Business Awards. \nThe awards celebrate the achievements of outstanding female entrepreneurs and businesswomen in Leicester, Leicestershire and Rutland. \nThe Entrepreneur of the Year Award is one of the most keenly sought after awards. \nIt is being sponsored by Narborough based financial management firm Pole Arnold. \nRichard Todd, director of Pole Arnold, said the firm was \"once again delighted to be involved in the Leicester Mercury Women in Business Awards\". \nHe said: \"Over half of our team are female, which include our three senior managers as well as a senior adviser, and we feel privileged to be sponsoring the Entrepreneur of the Year Award. \n\"We have first-hand experience of the women within our team's entrepreneurial contribution to our own business. \n\"Team work is essential in our business and if asked I would like to think that all of the women working for us feel that they are encouraged to bring entrepreneurial skills to their work. \n\"There are plenty of female role models in the entrepreneur space although it appears we still seem to have some way to go before reaching equilibrium. \n\"Politically, a case in point being the two negotiating teams for the Brexit negotiations are currently predominately male. \n\"Clearly there will be plenty of challenges for female entrepreneurs as our Brexit negotiations progress. \n\"Theresa May will certainly have to use her entrepreneurial skills over the coming months to help steer the UK through the significant challenges ahead and to keep our economy growing.\" \nHe added: \"It was clear from the high quality of entries last year that there are many entrepreneurial women in Leicestershire and we are looking forward to meeting this year's Entrepreneur of the Year candidates. Good luck to all them all.\" \nThe Leicester Mercury is hosting the awards in partnership with BHIB insurance brokers. \nThe winners of the Leicester Mercury Business Awards will be announced at a glamourous event to be held at the Leicester Tigers Stadium in Leicester on September 28. \nThe event will be hosted by ITV weather presenter Emma Jesson. \nThere are 12 awards up for grabs and these are: \nLifetime Achievement Award - Sponsored by BHIB \nEntrepreneur of the Year - Sponsored by Pole Arnold \nSole Trader of the Year - Sponsored by Berkeley insurance Group \nBusiness Innovation Award - Sponsored by MNE Accounting \nContribution to the Community Award - Sponsored by University of Leicester \nRising Star Award - Sponsored by Search Consultancy \nFemale Apprentice of the Year - Sponsored by Smallman and Son \nNew Business of the Year - Sponsored by Easy Internet Services \nSmall Business of the Year - Sponsored by FSB \nInspirational Woman of the Year - Sponsored by Eileen Richards \nPublic Sector Woman of the Year - Sponsored by Weightmans \nBusiness Woman of the Year - Sponsored by Torr Waterfield \nTo make a nominations please visit www.leicestermercury.co.uk/womeninbusiness and complete the online form. For more information please contact Claire Dandy on 0115 905 1942 \nThe deadline for nominations is Friday August 25.", "external_links": [], "published": "2017-07-17T17:24:00.000+03:00", "crawled": "2017-07-17T17:46:37.006+03:00", "highlightTitle": ""}