{"organizations": [], "uuid": "3ec0b2c30395f3f8b99a610917e6acd1d2bd5475", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/incoming/article230843.ece/ALTERNATES/s1200/Leicester-Town-Hall-chamberPNG.png", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/leicester-news/councillor-told-apologise-colleagues-male-230786", "country": "US", "domain_rank": 48128, "title": "Councillor told to apologise to colleagues for 'male appendage' jibe goes on the offensive instead - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.539, "site_type": "news", "published": "2017-07-23T17:00:00.000+03:00", "replies_count": 0, "uuid": "3ec0b2c30395f3f8b99a610917e6acd1d2bd5475"}, "author": "Dan Martin", "url": "http://www.leicestermercury.co.uk/news/leicester-news/councillor-told-apologise-colleagues-male-230786", "ord_in_thread": 0, "title": "Councillor told to apologise to colleagues for 'male appendage' jibe goes on the offensive instead - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "coun connelly", "sentiment": "none"}, {"name": "jo cox", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "john thomas", "sentiment": "none"}, {"name": "andy connelly", "sentiment": "none"}, {"name": "coun thomas", "sentiment": "none"}, {"name": "kamal adatia", "sentiment": "none"}, {"name": "porter", "sentiment": "none"}, {"name": "nigel porter  coun porter", "sentiment": "none"}, {"name": "nigel porter", "sentiment": "none"}, {"name": "coun porter", "sentiment": "none"}], "locations": [], "organizations": [{"name": "leicester city council", "sentiment": "none"}, {"name": "aylestone", "sentiment": "none"}, {"name": "the labour", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Councillor told to apologise to colleagues for 'male appendage' jibe goes on the offensive instead He was told to say sorry, but decided to attack those who ordered him to apologise Share Comments \nA councillor ordered to publicly say sorry for a ‘male appendage’ jibe instead launched an attack on those who instructed him to apologise. \nLeicester City Council’s sole Liberal Democrat Nigel Porter had been told to offer an apology at the last full council meeting by the authority’s standards committee. \nThe committee deemed he had breached codes of conduct by telling Labour councillor John Thomas that he would ‘not take any lectures from somebody named after a male appendage’ during a stormy town hall meeting in October. Read More \nThe apology, for using offensive language, was expected at the last council meeting but Coun Porter, who represents Aylestone, again took the opportunity to hit out at the Labour group and the standard committee. Nigel Porter \nCoun Porter, who insists his remark was a joke, has accused the council of hypocrisy because no action was taken against Labour assistant mayor Andy Connelly who, in the same meeting, suggested coun Porter seek ‘psychological treatment’ and then promptly apologised for the comment. \nCoun Porter was again jeered by some Labour members while he used the latest council meeting to express his anger at the handling of his case. \nHe said: “The Labour council’s kangaroo court had no authority legally or otherwise to make a decision or sit in judgement of me. \n“I was right when I said the standards hearing had not followed the correct procedures. \n“I had to point out to them they were acting unlawfully and they weren’t following the correct procedures. \n“Prior to the tribunal I attended, an advisory committee was deliberately mislead. \n“But the Labour council in their enthusiasm to have me up before a hearing decided to take the path of least resistance and if that meant riding roughshod over the law or policy they were happy to do that. \n“How arrogant can they possibly be? \n“It’s interesting that since the council meeting took place the joke I made has moved from being inappropriate to being an offensive joke. \n“There were no cries of outrage when I made my joke. You can clearly hear cries of outrage when Coun Connelly used mental health as an insult - and that is true. \n“There have been no repercussions whatsoever for Coun Connelly.” Read More Loughborough MP Nicky Morgan calls police after Twitter troll's 'Jo Cox' Brexit threat \nAfter the meeting, the city council’s monitoring officer and head of standards Kamal Adatia said: “The council’s standards committee met in June and endorsed the findings and recommendations made in public on 10 April, when a hearing sub-committee found that Councillor Nigel Porter had breached the Elected Member Code of Conduct in October 2016 by using offensive language against Councillor John Thomas at a public meeting. \n“The committee agreed that Coun Porter had breached the code of conduct by, showing disrespect, failing to show leadership and bringing the council into disrepute. \n“They instructed Coun Porter to issue a written apology to Coun Thomas, and to offer an apology to all elected members at the Council meeting held last Thursday. \n“He has failed to do either of these two things, and it is noted with great regret that at the council meeting he chose instead to launch an attack upon the integrity of the standards process.” \nIt appears the council is powerless to do anything further to compel Coun Porter to apologise. \nA council spokeswoman said: “The city council doesn’t have a formal process in place for where a member fails to comply with sanctions applied to them. \n“An update on this matter will be provided to the standards committee at their next meeting.” Like us on Facebook ", "external_links": [], "published": "2017-07-23T17:00:00.000+03:00", "crawled": "2017-07-23T18:25:34.004+03:00", "highlightTitle": ""}