{"organizations": [], "uuid": "55159d6d1537936dfccb16ad6e14379708d24bb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30425308/16069970.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/mp-hugo-swire-says-dup-deal-could-allow-feminist-coalition-on-reproductive-freedoms/story-30425308-detail/story.html", "country": "US", "title": "MP Hugo Swire says DUP deal could herald \"feminist coalition\" on reproductive freedoms | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.174, "site_type": "news", "published": "2017-07-05T23:50:00.000+03:00", "replies_count": 0, "uuid": "55159d6d1537936dfccb16ad6e14379708d24bb5"}, "author": "", "url": "http://www.devonlive.com/mp-hugo-swire-says-dup-deal-could-allow-feminist-coalition-on-reproductive-freedoms/story-30425308-detail/story.html", "ord_in_thread": 0, "title": "MP Hugo Swire says DUP deal could herald \"feminist coalition\" on reproductive freedoms | Devon Live", "locations": [], "entities": {"persons": [{"name": "swire", "sentiment": "none"}, {"name": "hugo swire", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "ian paisley", "sentiment": "none"}, {"name": "arlene", "sentiment": "none"}, {"name": "arlene foster", "sentiment": "none"}, {"name": "stella creasey", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "creasey", "sentiment": "none"}], "locations": [{"name": "great britain", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "stormont", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "dup", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "orange order", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "sdlp", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "sinn fein", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}, {"name": "catholics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MP Hugo Swire says DUP deal could herald \"feminist coalition\" on reproductive freedoms By WMN_PGoodwin | Posted: July 05, 2017 3 COMMENTS SHARES Hugo Swire has defended the Tory DUP deal MP Hugo Swire says DUP deal could herald \"feminist coalition\" on... X \nCopy link to paste in your message / Comments (3) \nSir Hugo Swire has defended the controversial Tory deal with the Democratic Unionist Party (DUP) and called party leader Arlene Foster a \"thoroughly decent woman\". \nThe Northern Irish party has agreed to prop up the Conservative minority Government on key votes, sparking anger at the multi-billion funding deal and the effect on power-sharing. \nCritics have rounded on the Government over the DUP and its MP's views on abortion and gay rights. \nSinn Fein has blamed the failure to settle their differences with the DUP in Stormont on Theresa May's \"monumental failure.\" \nRead More: BLOCKED: the Twitter users who dared to take on Tory MP Hugo Swire \nSwire, the MP for East Devon and a junior minister in Northern Ireland under the first Cameron Government, says the DUP will \"lie low\" on issues such as same sex marriage. \nHe has hailed the parliamentary arithmetic of the minority government for allowing the emergence a new \"feminist coalition\" on women's rights. \nHe said he \"knows and likes\" First Minister Arlene Foster well and has urged people to give the deal a chance. \n\"I would count her as a friend as I do many of her colleagues,\" Mr Swire added. \n\"The DUP under her is now much more socially progressive. It no longer represents the bigoted and sectarian Anti-Catholic sentiments of the Rev Ian Paisley. Arlene is not even a member of the Orange Order. \n\"In Belfast the DUP is increasingly reflective of the population that votes for it, which includes thousands of non-churchgoing Protestants. Arlene is an Anglican like Theresa May and a Lawyer, she has Catholic and gay friends and drinks alcohol. I have shared a glass or two with her myself over the years. She is patriotic and pro-monarchy like most Conservatives. She sees her place within the United Kingdom as her key to survival. She is a thoroughly decent woman.\" \nSwire, who was returned at the General Election in the seat he has held since 2001, but with a reduced majority, says his party were right to do the deal to head off the prospect of a second election. \nHe admits the deal is \"born out of necessity\" but claims there is \"common ground\" on Brexit. \nSwire also argues that having representation in all four nations of the United Kingdom means the \"EU can no longer weaken us by driving a wedge between England and Scotland\". \nRead More: Brits don't want to pick fruit and veg, so we need foreign workers - Neil Parish column \nIn a message to constituents, he pledges to promote and champion equal rights. \n\"Conservatives in Government introduced same sex marriage and earlier this year passed 'Turing's law' to remove historic convictions for consensual acts,\" he wrote. \n\"As I work with others to govern in the national interest we will continue to promote and champion the equal rights we believe in. \n\"Besides, the DUP blocking of same sex message probably no longer commands majority support at home never mind exporting it across the water. The DUP are shrewd enough to realise that and pressure to change at home will not let up from far wider than Sinn Fein. They will surely lie low on this issue. \n\"The truth is that devolution did make progress on LGBT rights harder in Northern Ireland until this year – but it never entailed a reversion to the \"Save Ulster From Sodomy\" agenda. So progress on LGBT rights has and will continue to happen and would have done so even if the deal between Theresa May and the DUP had not gone ahead. Sometimes there has to be a slow evolution when it comes to changing people's attitudes especially in a traditional, less socially progressive environment such as Northern Ireland is.\" \nRead More: Unbuilt Exeter: Seven major projects that never got off the ground \n\"The abortion issue is the other big moral dispute in Northern Ireland and the law is devolved, unlike in Scotland. Until only a couple of years ago no party supported any reform, and certainly not the extension of the 1967 Act, to Ulster. \n\"Now the SDLP which represents many devout Catholics has split on the issue — and even the DUP is no longer holding the line on aspects of 'reproductive health'. \n\"Here, dozens of Conservative MPs expressed to Tory whips their support for an amendment by the Labour MP Stella Creasey to allow Northern Irish women access to NHS-funded abortions in Great Britain and that is now going ahead. \n\"This should also be seen as a good illustration of how coalitions can work, one that was cross party, even gender led between formidable female MPs such as Creasey and Amber Rudd. Maybe this new feminist coalition can work together on other reproductive freedoms. Certainly the momentum is now here, and if we are working with the DUP surely we now have more influence on them.\" ", "external_links": [], "published": "2017-07-05T23:50:00.000+03:00", "crawled": "2017-07-05T23:37:18.001+03:00", "highlightTitle": ""}