{"organizations": [], "uuid": "2cf82303a569964592a0c0d474d137f81c70a887", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15523977.ece/ALTERNATES/s1200/1_EMB-Im-a-Celebrity-Get-Me-Out-of-Here-TV-Show-Series-18-Australia-07-Dec-2018.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/tv/im-a-celebrity-itv-show-15523957", "country": "GB", "domain_rank": 21960, "title": "I'm A Celebrity stars break down in tears during emotional reunion with families", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-08T11:42:00.000+02:00", "replies_count": 0, "uuid": "2cf82303a569964592a0c0d474d137f81c70a887"}, "author": "Michael Muncaster", "url": "https://www.chroniclelive.co.uk/news/tv/im-a-celebrity-itv-show-15523957", "ord_in_thread": 0, "title": "I'm A Celebrity stars break down in tears during emotional reunion with families", "locations": [], "entities": {"persons": [{"name": "fleur", "sentiment": "none"}, {"name": "harry redknapp", "sentiment": "none"}, {"name": "sandra share click", "sentiment": "none"}, {"name": "keshia", "sentiment": "none"}, {"name": "sandra", "sentiment": "none"}], "locations": [{"name": "fleur east", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'm A Celebrity stars break down in tears during emotional reunion with families Viewers could not hide their delight as Harry Redknapp had an adorable reunion with his wife Sandra Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTears flowed in the jungle as the I'm A Celebrity campmates got a surprise visit from their familes.\nITV viewers watched on as football manager Harry Redknapp had an adorable reunion with his wife Sandra.\nMeanwhile, Fleur East burst into tears as she was reunited with her sister Keshia.\nThe singer walked through the jungle to find her sister waiting on a bench, the Mirror reports.\nKeshia said: “I’m so excited to see Fleur right now, I’m losing my mind. Sandra and Harry reuniting (Image: ITV)\n\"I think I’m so excited, she has no idea that she’s going to see me so I can’t wait to see the look on her face.\"\nFleur added: “I’m overwhelmed with joy, my heart is bursting. I don’t know how I’ve been doing it, tunnel vision, just trying to get through.\n\"I can’t believe you’re here, I miss you so much, how is everybody?\"\nKeshia said Fleur has \"surprised herself\" before she told her sister: “Everyone’s good, Mum and Dad are so happy for you, we’re so happy. Mum can’t even watch some of the trials, she’s such a wuss.\n\"No one can understand where you’re getting all your strength from, you’ve fully turned into a jungle warrior, a Tarzan. You’ve done so well, we’re so proud of you.” Read More When is the I'm A Celebrity final? Celebrities get ready for evictions to start\nFleur told her: “To get this moment here is such a high, I’m so happy, I’m buzzing,\" before Keshia advised.\nAfter this, John's husband Scott sat in Croc Creek and waited for John to walk back into camp.\nHe said: “In the 25 years we’ve been together, this is the longest we’ve not spoken. I speak to him every day, apart from a couple of minor rows now and again.\"\nJohn walked down into camp and saw Scott, he gasped and started to cry and hugged him, saying: \"I felt so happy to see him, it was an overwhelming rush of emotion.\"\nThe Torchwood star was overwhelmed and continued to cry, as she told his hubby: “Being in here is a challenge, it’s tough, there’s no way you can talk to each other and we all have our moments of crying, when you’re in love and you hug them and stuff” said John. John crying with his husband Scott (Image: ITV)\nScott also sniffed his husband, and say they held a Koala bear recently with his mum, as John joked: “Did you tell her they have chlamydia?!”\nThen it was James, as he cried and was shocked when his girlfriend Kirstie sat waiting for him.\nShe commented on how thin he looked, before telling her how proud their family are.\nJames then asked a rather odd question, asking: \"Having a letter was enough to get me to the end and now this. What’s happening with Brexit?”\nKirstie replied: “No progress.”", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://www.mirror.co.uk/tv/tv-news/im-celebrity-emotional-campmates-meet-13702185", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-08T11:42:00.000+02:00", "crawled": "2018-12-08T14:04:35.058+02:00", "highlightTitle": ""}