{"organizations": [], "uuid": "a1e3525c6037679acaa28deb3eacb7e1f15843f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article2346523.ece/ALTERNATES/s1200/3_bbcPNG.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/social-media-reacts-bbcs-live-2346151", "country": "US", "title": "Social media reacts to BBC's live Brexit voxpop from Torquay", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T19:27:00.000+02:00", "replies_count": 0, "uuid": "a1e3525c6037679acaa28deb3eacb7e1f15843f9"}, "author": "Colleen Smith", "url": "https://www.devonlive.com/news/devon-news/social-media-reacts-bbcs-live-2346151", "ord_in_thread": 0, "title": "Social media reacts to BBC's live Brexit voxpop from Torquay", "locations": [], "entities": {"persons": [{"name": "danny", "sentiment": "none"}], "locations": [{"name": "torquay", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "torquay social", "sentiment": "none"}, {"name": "torquay share coll", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Social media reacts to BBC's live Brexit voxpop from Torquay The BBC were live in Torquay Share Colleen Smith Regional Head of Content 17:27, 19 DEC 2018 Click to play Tap to play The video will start in 8 Cancel Play now\nWhen the BBC wanted to get the public's reaction about the Government's new post-Brexit immigration plans today they headed to Torquay's Princess Pier and interviewed three people about their views.\nBut the voxpop attracted a social media storm over some of the claims. Three people were asked what they thought about the new white paper on tougher rules for immigrants. Torquay voted heavily to leave the European union.\nOne interviewee blamed immigrants who had 'taken British jobs and British homes' and drained the NHS. Another singled out eastern European workers who took 'what would be classed as British jobs and send the money out of the UK economy'.\nReacting on Twitter some BBC viewers asked why the views of 'vile British nationalists in Torquay' were allowed to go unchallenged. One called their views 'disturbing'.\nBuilding worker Danny told the BBC: \"A lot of the Eastern Europeans come over and take what would be classed as British jobs and send the money out of the UK economy.\"\nHe added: \"I see a lot of eastern European workers over here and that could have gone to the British workers especially those on benefits and it could help our country right out.\"\nInterviewee John Walker said that his daughter lives in Australia: \"Australia has got it right because they have got the right system: don't let people into their country unless they can offer something to the country.\n\"We've just let people in and they've come over and settled over here and a lot of the people have taken British jobs and British homes and a drain on our NHS service as well.\n\"It's about time that England stood up for the English. The whole thing with the vote was that people were annoyed about all the immigrants coming over here.\"\nA third, Pam, said everybody who voted to come out had done so 'because of the immigration situation'. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-19T19:27:00.000+02:00", "crawled": "2018-12-19T19:41:52.028+02:00", "highlightTitle": ""}