{"organizations": [], "uuid": "23d152d77b39ea23775618271118cd587fd893ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15466982.ece/ALTERNATES/s1200/3_may-brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/lets-stop-pretending-theres-thing-15489580", "country": "GB", "domain_rank": 21960, "title": "Let's stop pretending there's such a thing as a Brexit deal that won't make us poorer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-15T13:03:00.000+02:00", "replies_count": 0, "uuid": "23d152d77b39ea23775618271118cd587fd893ee"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/lets-stop-pretending-theres-thing-15489580", "ord_in_thread": 0, "title": "Let's stop pretending there's such a thing as a Brexit deal that won't make us poorer", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Let's stop pretending there's such a thing as a Brexit deal that won't make us poorer Perhaps leaving the EU will be worth the pain, but don't believe anyone who says they can make the pain go away Share Click to play Tap to play The video will start in 8 Cancel Play now\nTheresa May’s pulling out all the stops as she attempts to get her Brexit deal through Parliament.\nSpeaking as she met world leaders in Argentina, she said: “What I see from Labour is an attempt to frustrate what the Government is doing to deliver Brexit for the British people.\n“That is actually a betrayal of the British people.”\nIt’s not that strange for politicians to use strong language.\nBut “betrayal of the British people” is a bit much.\nTo be honest though, I can understand why she’s getting upset.\nBecause the debate around her deal - and Brexit in general - is getting particularly silly.\nLast week we learned that the Government’s own assessments show the UK will be poorer under Theresa May’s proposed deal than if we stayed in the EU (this doesn’t mean we’ll actually get poorer - just that we won’t get richer as much as if we stayed in).\nAnd this provided ammunition for her critics, for obvious reasons. Jeremy Corbyn (Image: BBC)\nBut what they weren’t willing to say was that every possible Brexit deal is going to make us poorer than staying in.\nIf the only thing you care about is the economy then the answer is to cancel Brexit and stay in the EU.\nIf, however, you are someone who talks about “respecting the result of the 2016 referendum” and says we have to leave, you don't also get to complain about damage to the economy.\nThe idea that there’s some sort of magic Brexit deal that would solve our problems and make us all richer, if only we had a better Prime Minister, is nonsense.\nAnd it doesn’t matter whether your idea of a better Prime Minister is Jeremy Corbyn or Boris Johnson (a bizarre feature of politics at the moment is that Corbynites and hard-core Tory Brexiteers have united in promoting the fantasy of a better Brexit). Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-15T13:03:00.000+02:00", "crawled": "2018-12-15T15:26:08.002+02:00", "highlightTitle": ""}