{"organizations": [], "uuid": "5931bb0f0d3737b26da06bfb0608c99aa423cc48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15531426.ece/ALTERNATES/s1200/0_Untitled-design-37.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/next-prime-minister-odds-brexit-15531298", "country": "GB", "domain_rank": 21960, "title": "Brexit latest news: Odds on who could replace Theresa May if she resigns as Prime Minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T16:06:00.000+02:00", "replies_count": 0, "uuid": "5931bb0f0d3737b26da06bfb0608c99aa423cc48"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/next-prime-minister-odds-brexit-15531298", "ord_in_thread": 0, "title": "Brexit latest news: Odds on who could replace Theresa May if she resigns as Prime Minister", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "dominic raab he", "sentiment": "none"}], "locations": [], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThere are two ways that Theresa May could be replaced as Prime Minister.\nOne is that she leads the Conservative Party into a general election.\nIf that happens then there are only two possible people who could be Prime Minister at the end of it - Mrs May, if the Conservatives win, or Labour leader Jeremy Corbyn.\nHowever, another strong possibility is that the Conservative Party chooses a new leader before any election takes place.\nAnd if that happens, the next Prime Minister will be a Tory.\nBookmakers William Hill are offering odds on who that could be.\nFollow Brexit developments as they happen in our live blog . 13/2 - Dominic Raab\nHe’s the former Brexit Secretary who resigned because he could not support Theresa May’s proposed EU withdrawal agreement. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now 7/1 - Boris Johnson\nThe high-profile former Foreign Secretary is a leading supporter of Brexit. However, some Conservative MPs really don’t like him. Boris Johnson makes his speech on Brexit at the Tory Conference 7/1 - Michael Gove\nThe current Environment Secretary is also a high-profile supporter of Brexit but, unlike many Brexiteers, he has stayed loyal to Theresa May. 7/1 - Sajid Javid\nHome Secretary Sajid Javid backed remain in the 2016 referendum. He’s the son of immigrant parents who came to the UK with next to nothing, and went on to be a successful banker before becoming an MP. Sajid Javid, arrives in Downing Street, London, for a cabinet meeting (Image: PA) 10/1 - Jacob Rees-Mogg\nThe eccentric Conservative backbencher looks and sounds old-fashioned. People seem to like him but could be really be Prime Minister? 10/1 - Jeremy Hunt\nHe’s the Foreign Secretary and he’s seen as one of the most competent Cabinet Ministers. But he made a lot of enemies when he was Health Secretary. 12/1 - David Davis\nFormer Brexit Secertary David Davis comes from a working class background and seems tough enough to take on EU officials. He stood for the party leadership once before and was beaten by David Cameron. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-10T16:06:00.000+02:00", "crawled": "2018-12-10T17:24:17.000+02:00", "highlightTitle": ""}