{"organizations": [], "uuid": "5681e88f6c9f02e6039cba1e04f55eab430b4d5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15489050.ece/ALTERNATES/s1200/0_mp-vote.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/how-mps-vote-brexit-deal-15488026", "country": "GB", "domain_rank": 21960, "title": "How will North East MPs vote on Brexit? Only one will back Theresa May's under-fire deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-02T10:00:00.000+02:00", "replies_count": 0, "uuid": "5681e88f6c9f02e6039cba1e04f55eab430b4d5d"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/how-mps-vote-brexit-deal-15488026", "ord_in_thread": 0, "title": "How will North East MPs vote on Brexit? Only one will back Theresa May's under-fire deal", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "“There are also clear risks of an economic downturn with exiting on a no deal.\n“I would urge colleagues to back the deal.”\nMPs are to hold five days of debate from December 4 before voting on a motion proposed by the Prime Minister to approve the Brexit withdrawal agreement.\nBut it’s unclear what will happen if the Commons rejects the agreement. Brexit timeline - what happens next\nDecember 4, 5, 6, 7 and 10: MPs will host a 40-hour debate over five days.\nDecember 9: BBC will host a live TV debate involving Prime Minister Theresa May\nDecember 11: MPs will vote on Mrs May's deal in Parliament. If it’s a no, the Government has until January 21 next year to put forward a new plan.\nMarch 29, 2019: The official date Theresa May insists Brexit will happen. It means the prospect of a 'no deal' is very much a possibility.\nPossibilities include a general election , which could be held if two thirds of MPs vote for one.\nAn election would also probably take place if the Commons passed a motion of “no confidence” in the Government, which requires a simple majority.\nOther options include holding a second referendum. The number of MPs backing this option has grown, but it’s far from certain that a majority of MPs would support this.\nAlternatively, it’s possible that Mrs May could return to the EU and attempt to re-open negotiations. Prime Minister Theresa May speaks at a press conference after attending a special session of the European Council over Brexit on November 25, 2018 in Brussels, Belgium\nAnd as things stand, the UK is set to leave the EU on March 29 2019 whether a deal is agreed or not (thanks to legislation approved by Labour as well as Tory MPs in 2017 ).\nIt means a 'no-deal' Brexit is possible.\nGovernment analysis published this week showed that the North East will be poorer under Mrs May’s proposed Brexit deal than if we stayed in the EU, with the economy up to 2% smaller. Read More Brexit debate: BBC to host TV debate with Theresa May over her Brexit deal\nThe figures don’t take into account the possible impact of a huge cut in migration to the UK from Europe, which would do more damage to the economy.\nBut leaving the EU without a deal would cause far more damage according to the Government’s forecasts, and would mean the North East economy was more than 10% smaller than if we simply stayed in the EU, within 15 years of Brexit taking place. How they’ll vote Berwick-upon-Tweed: Anne Marie Trevelyan (Conservative) Conservative MP for Berwick Anne-Marie Trevelyan (Image: Newcastle Chronicle)\nMrs Trevelyan resigned from her role as a Parliamentary Private Secretary in the Department for Education, saying she could not support Mrs May’s Brexit plans. Bishop Auckland: Helen Goodman (Labour)\nHas said she opposes the deal because with a constituency that embraces manufacturing industries she wants to remain in the customs union. Blaydon: Liz Twist (Labour) Blyth Valley: Ronnie Campbell (Labour)\nWill vote against. City of Durham: Roberta Blackman-Woods (Labour)\nWill vote against. Easington: Grahame Morris (Labour)\n“I’ll be voting against on the basis that I don’t think it represents a good deal for my constituents.” MP Grahame Morris\nWill vote against. Hartlepool: Mike Hill (Labour)\n“I will be voting against it as it stands. That reflects the majority view of both leavers and remainers who have kindly canvassed me en masse, and that is also my personal choice.” Hexham: Guy Opperman (Conservative)\nWill vote in favour. Houghton and Sunderland South: Bridget Phillipson (Labour)\nSaid in a New Statesman article: “I cannot support a deal which I believe will make my constituents poorer.” Read More", "external_links": [], "published": "2018-12-02T10:00:00.000+02:00", "crawled": "2018-12-02T11:24:18.044+02:00", "highlightTitle": ""}