{"organizations": [], "uuid": "f87b5e912004db3323d37503bdd93ca9502d9270", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13880379.ece/ALTERNATES/s1200/IBP_NEC_240914monday_07JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/dozens-north-east-businesses-call-15563321", "country": "GB", "domain_rank": 21960, "title": "Dozens of North East businesses call for People's Vote on Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-17T17:55:00.000+02:00", "replies_count": 0, "uuid": "f87b5e912004db3323d37503bdd93ca9502d9270"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/dozens-north-east-businesses-call-15563321", "ord_in_thread": 0, "title": "Dozens of North East businesses call for People's Vote on Brexit", "locations": [], "entities": {"persons": [{"name": "matt boyle", "sentiment": "none"}, {"name": "hugh morgan-williams", "sentiment": "none"}, {"name": "graeme parkins", "sentiment": "none"}, {"name": "nigel mills", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "dyer engineering", "sentiment": "none"}, {"name": "wessington cryogenics", "sentiment": "none"}, {"name": "gill southern", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "collingwood solutions", "sentiment": "none"}, {"name": "north east lep", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Dozens of North East businesses call for People's Vote on Brexit More than 40 business leaders from the region have signed the letter which is being publsihed in a national newspaper Share Nigel Mills, Chairman of The lakes Distillery (Image: Newcastle Journal) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nMore than 40 business leaders from across the North East have signed a public letter calling for a second Brexit referendum.\nThe letter has been signed by a host of local businesses who are calling for an end of the uncertainty they face with the Brexit deadline fast approaching and a deal with Brussels yet to be struck.\nAmong those who have signed their name in support of a second referendum are Lakes Distillery CEO Nigel Mills, Matt Boyle from Collingwood Solutions, Graeme Parkins, managing director of Dyer Engineering, as well as former North East LEP board member Gill Southern from Wessington Cryogenics, and Hugh Morgan-Williams from Future Vision Graeme Parkins of Dyer Engineering with a Dreamers prototype\nMr Mills said: “The Prime Minister now has a deal and Parliament at this point in time can’t agree on this deal. We have reached an impasse where no decisions are being made, and if there is one it will be to reject the deal. Read More See first pictures of 2,000-job business park at Newcastle Airport\n“There is a frustration about a lack of progress. My view is when we did have a vote in 2016, the facts and the consequences of leaving Europe were not represented and the people at that point in time didn’t understand the consequences of leaving or remaining. We are at a point now where people can make an informed decision.”\nEarlier this month saw the first meeting of the Business for a People’s Vote campaign in Newcastle. Richard Swart, global sales director at Berger Group, has become heavily involved in the campaign and was one of the voices that rallied other local firms to sign the letter. Richard Swart (Image: Manufacturer’s Top 100)\nExplaining why he believes a second referendum is needed, Mr Swart said: “We must respect the result of the 2016 referendum. People voted Leave for a range of reasons. It was a black and white vote on a rainbow of issues.\n“Trying to come out the EU is like trying to take egg out of omelette - so clearly messy and damaging to us all. People voted out for range of different reasons, not fully appreciating all the consequences. Read More North East firms club together and call for a People's Vote on Brexit\n“To fully respect the result, now that we have clearly defined options to put to the people, we have an obligation to go back to them and ask them if the Prime Minister’s plan or No Deal is actually what they wanted, versus the huge advantages of the status quo. This is how the 2016 result will be best respected. After all it is a decision which will impact us all for decades\n“Every Brexit impact assessment scenario by this Brexit supporting Government confirms the UK, and the North East in particular, will be worse off. So why do it?” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-17T17:55:00.000+02:00", "crawled": "2018-12-17T20:13:40.000+02:00", "highlightTitle": ""}