{"organizations": [], "uuid": "21c0303ab4b4863a98ffc0a8f7c0dee441a43079", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15247451.ece/ALTERNATES/s1200/0_Peoples-Vote-rally-in-Sunderland.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/news-opinion/brexit-remain-peoples-vote-referendum-15411908", "country": "GB", "domain_rank": 21960, "title": "I voted to remain in the EU but I fear a 'People's Vote' on Brexit would be a disastrous mistake", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-03T13:00:00.000+02:00", "replies_count": 0, "uuid": "21c0303ab4b4863a98ffc0a8f7c0dee441a43079"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/news-opinion/brexit-remain-peoples-vote-referendum-15411908", "ord_in_thread": 0, "title": "I voted to remain in the EU but I fear a 'People's Vote' on Brexit would be a disastrous mistake", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion I voted to remain in the EU but I fear a 'People's Vote' on Brexit would be a disastrous mistake Why I'm worried about proposals for a second referendum on Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nI voted to remain in the European Union , and I still believe we'd be better off staying in.\nBut I’m not convinced by the arguments for holding a second referendum.\nIn fact, I fear that if the campaign for another vote on Brexit succeeds, we could end up in an even bigger mess than the one we’re in now.\nSupporters of a second referendum don’t like to call it that. Instead, they talk about holding a People’s Vote.\nIt’s a masterful bit of marketing. And it’s been so successful that even Theresa May, the Prime Minister , used the phrase “People’s Vote” in the House of Commons, although only to explain why she was against it (she argued that we had our people’s vote back in 2016).\nBut there should be no doubt about what it means.\nA People’s Vote would be a referendum on whether to accept whatever deal the UK Government manages to agree with the EU, or whether to reject it. But one option would be to cancel Brexit entirely.\nIn practice, it would be a second Brexit referendum, giving people a chance to reverse the decision taken in the first one. The People's Vote March and Rally takes place in Sunderland city centre led by Conservative MP Anna Soubry and Newcastle North MP Catherine McKinnell (Image: Newcastle Chronicle)\nSupport for a second referendum is growing among MPs.\nSome North East Labour MPs are among the most ardent supporters of a People's Vote.\nThey include Sedgefield MP Phil Wilson, Newcastle North MP Catherine McKinnell , Stockton South MP Paul Williams, Houghton and Sunderland South MP Bridget Phillipson , Sunderland Central MP Julie Elliott , and Redcar MP Anna Turley.\nThese MPs point out, quite rightly, that the North East will suffer more than other areas if Brexit goes wrong, because of the importance of exports and of manufacturing to the region's economy. Read More\nAnd the campaign received a major boost when Conservative Jo Johnson resigned as a Transport Minister, saying he wanted a People’s Vote.\nBut what would happen if a second referendum took place?\nThe first referendum divided the country. Having said that, debate at the time was reasonably good natured. Read More How will North East MPs vote on Brexit? Only one will back Theresa May's under-fire deal\nAfter all, many voters genuinely didn’t know which option to choose, and wanted to hear the arguments. They were ready to listen.\nThere were a few cutting remarks. Memorable moments included remain-supporting MP Amber Rudd telling Leave campaigner Boris Johnson that he was the life and soul of the party, but “you can’t trust him to take you home at the end of an evening”.\nThere was, however, no talk of traitors or betrayal. That came after the referendum, as the UK began the tortuous process of negotiating an exit from the EU.\nA second referendum will be far less pleasant. Anti-Brexit campaigners take part in the People's Vote March for the Future in London, a march and rally in support of a second EU referendum. (Image: PA)\nPeople who support Brexit will be furious. And who could blame them?\nThey were asked for their opinion and they gave it. And they were assured at the time that their decision mattered - that the result of the referendum was final.\nHolding a second referendum would mean they were lied to about that.\nIn practice, they would be told that they got it wrong the first time around, and now must try again. Brexit timeline - what happens next\nDecember 4, 5, 6, 7 and 10: MPs will host a 40-hour debate over five days.\nDecember 9: BBC will host a live TV debate involving Prime Minister Theresa May\nDecember 11: MPs will vote on Mrs May's deal in Parliament. If it’s a no, the Government has until January 21 next year to put forward a new plan.\nMarch 29, 2019: The official date Theresa May insists Brexit will happen. It means the prospect of a 'no deal' is very much a possibility.\nSupporters of a second referendum point out that when people voted in 2016, they didn’t have a chance to endorse a specific Brexit deal.\nHowever, it would be clear that a second referendum was really about reversing Brexit.\nThe idea that it was a public vote on the deal - which just happened to include the option of staying in the EU - would fool no-one.\nIt’s also said that nobody voted to make themselves poorer.\nBut they did. Or at least, they were told repeatedly, by the Government of the day, by industry and by much of the media, that Brexit would make them poorer, and they chose to vote for it anyway. Leave campaigner Boris Johnson\nMaybe they didn’t believe what they were told, or maybe they decided the country would eventually recover from whatever damage Brexit caused to the economy.\nEither way, they made their choice.\nSome MPs who campaigned for remain in 2016 believe telling voters to think again would shatter confidence in British democracy and foster a belief that voting changes nothing. Read More Brexit: Labour chair Ian Lavery says there is 'no prospect of a decent Brexit deal being passed through Parliament'\nA few even predict civil disobedience and riots on the streets.\nSupporters of a people’s vote argue that a number of recent opinion polls suggest the public has come round to the idea.\nA recent YouGov poll, for example, found 45% of voters want a public vote, with 35% opposed and 21% saying they don’t know. Read More Rising exports show why the North East NEEDS a Brexit deal to let trade continue\nBut take a look at the question pollsters asked. It went like this: “When the negotiations with the European Union about Brexit are complete, would you support or oppose a public vote on the outcome?”\nNow, anyone who’s been following the debate closely will know this means a second referendum on Brexit. But it was presented as a vote on the outcome of Mrs May’s negotiations.\nI bet a lot of people who took part in YouGov’s survey didn’t quite make the connection.\nIf a second referendum does take place, there will be no hiding what it really is.\nAnd what would happen next? Prime Minister Theresa May is trying to negotiate a Brexit deal (Image: Birmingham Mail)\nIt’s true that if the nation voted overwhelmingly to stay in the EU then the debate would be over.\nBut what if the result of the 2016 referendum, when 52% wanted to leave, was reversed - with 52% voting to stay in this time, and 48% wanting to leave?\nWould we make it best out of three? If not, how could we convince “leave” voters that the second result was conclusive while the first had to be re-run?\nSome MPs are convinced that a second referendum would harden attitudes, and leave would simply win a second time.\nMeanwhile, the nation would suffer months of further uncertainty, making it impossible for employers to plan ahead and restricting investment into the economy.\nMany voters would become even more convinced that their concerns and opinions mean nothing to those in power.\nAnd the UK would be further divided by through an angry referendum campaign in which one side felt betrayed, and perhaps with good reason. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-03T13:00:00.000+02:00", "crawled": "2018-12-03T13:11:04.067+02:00", "highlightTitle": ""}