{"organizations": [], "uuid": "6273b8e2ffaf0202d532a1ae20d8011412970769", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2330024.ece/ALTERNATES/s1200/0_Untitled-collage.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/miracle-mylo-how-quick-thinking-2330078", "country": "US", "title": "The miracle of Mylo - how quick thinking owners saved his life after horror accident", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-14T18:31:00.000+02:00", "replies_count": 0, "uuid": "6273b8e2ffaf0202d532a1ae20d8011412970769"}, "author": "Lewis Clarke", "url": "https://www.devonlive.com/news/devon-news/miracle-mylo-how-quick-thinking-2330078", "ord_in_thread": 0, "title": "The miracle of Mylo - how quick thinking owners saved his life after horror accident", "locations": [], "entities": {"persons": [{"name": "kyla", "sentiment": "none"}, {"name": "catherine tapp", "sentiment": "none"}, {"name": "mylo", "sentiment": "none"}, {"name": "adrian harris", "sentiment": "none"}], "locations": [{"name": "ellerhayes", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}], "organizations": [{"name": "park hill vets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Miracle dog Mylo comes back from the dead FOUR TIMES after burning himself with boiling hot fat Mylo managed to sustain horrific burns when he managed to pull a deep fat fryer off the kitchen unit Share Mylo the dog at Park Hill Vets with Catherine Tapp and Kyla Harris (Image: Park Hill Vets) Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA miracle dog which owners said their final farewell to on four occasions has beaten the odds of survival after scorching himself with burning hot fat.\nQuick-thinking Kyla and husband Adrian Harris from Ellerhayes near Tiverton immediately put poor four-year-old Lemon Beagle Mylo into their garden paddling pool after he managed to pull a deep fat fryer from countertops in their kitchen as the couple made egg and chips for dinner.\nThe accident happened on Wednesday, July 4, but it has taken months of painstaking work and operations for Mylo to make a full recovery, albeit with scars on his back.\n“We don’t know how it happened because we weren’t in the room,” said Kyla. “We just heard an almighty scream.”\nWarning: The images below show the injuries Mylo sustained and may cause distress\nOwner of Park Hill Vets in Tiverton, Catherine Tapp, said their quick decision to put Mylo in the paddling pool may have saved his life.\nDespite seeking advice about immediate pain relief, Kyla said that Mylo was in agony all through the night. Mylo the dog at Park Hill Vets\nCatherine said “Mylo’s first visit to us was uneventful. Burns often get worse with time and the full effect of the damage is often not seen straight away.\n“I got involved when he came back for a check-up and noticed some ooze on his skin. I started looking at it, and his skin started coming off in my hand; it was gruesome.”\nMylo then endured a series of operations which involved cutting away the burnt dead skin and closing the surrounding tissue.\n“It was a life or death situation,” Catherine explained. “We had to decide whether to treat him or put him to sleep.\n\"In the first couple of weeks, staff and the owners seemed to have doubts about whether he was going to survive and if we were doing the right thing for him; especially when he had a miserable day.\n“Mylo is a fighter though. Every time we started to think that, he would fight a bit harder and turn a corner; he’s such a trooper,” she added. Read More Campaigners head to Tiverton calling for a People's Vote on Brexit\nKyla praised the work of Catherine and the vets: “We said goodbye to him four times, but Catherine was marvellous and said that Mylo’s wounds would not be the cause of his death.”\nDue to the extent of his injuries, Mylo’s insurance quickly reached its maximum level. Thankfully, a company which provides dressings to the veterinary practice agreed to sponsor his recovery.\n“What seemed to speed up his recovery was the Manuka honey dressing,” said Catherine. “They very kindly provided the dressing and the honey.” Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-14T18:31:00.000+02:00", "crawled": "2018-12-14T20:12:01.005+02:00", "highlightTitle": ""}