{"organizations": [], "uuid": "a045a7ae6add84b1842fe4c726fbc8a346e9c79c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/news/north-east-news/article15422597.ece/ALTERNATES/s1200/0_may-presser.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-theresa-admits-cancel-vote-15532996", "country": "GB", "domain_rank": 21960, "title": "Brexit: Theresa May admits she had to cancel her vote because she would lose", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T19:22:00.000+02:00", "replies_count": 0, "uuid": "a045a7ae6add84b1842fe4c726fbc8a346e9c79c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-theresa-admits-cancel-vote-15532996", "ord_in_thread": 0, "title": "Brexit: Theresa May admits she had to cancel her vote because she would lose", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Theresa May holds a news conference at Downing Street Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTheresa May will go back to the European Union and ask for a better Brexit deal, after calling off a crunch House of Commons vote in which she was expected to go down to a heavy defeat.\nIn a dramatic statement in the Commons , Mrs May admitted she’d cancelled the vote due for Tuesday because she knew she would lose.\nMrs May said: “If we went ahead and held the vote tomorrow the deal would be rejected by a significant margin.”\nShe said the problem was the planned “backstop”, which is designed to prevent a hard border between the UK and Ireland - and she would ask EU leaders to provide reassurances in order to win over sceptical MPs, she said.\nTalks will begin before EU leaders meet for a summit on Thursday and Friday. Read More Brexit: What is a People's Vote and how would a second referendum work?\nMrs May said: “I spoke to a number of EU leaders over the weekend, and in advance of the European Council I will go to see my counterparts in other member states and the leadership of the Council and the Commission.\n“I will discuss with them the clear concerns that this House has expressed.”\nThe backstop is an agreement that the UK will stay in the EU’s customs union if no other way can be found to avoid a border between Ireland and Northern Ireland.\nMrs May says that the backstop is only included in her Withdrawal Agreement as a last resort, and if it ever was introduced then it would be temporary.\nBut some Conservative MPs say they fear it would become a permanent arrangement, and the UK would be forced to obey EU rules forever. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nSo the Prime Minister will now ask the EU to provide further reassurances about the backstop.\nMrs May’s statement came amid dramatic scenes at Westminster, as news of her plan to postpone Tuesday’s “meaningful vote” broke just minutes after Downing Street had insisted it was going ahead.\nIt is understood that the PM had been warned that she faced a large-scale defeat when MPs voted at the end of five days of debate in the Commons on her plans.\nShe spoke with her Cabinet colleagues by a telephone conference call before addressing the Commons.\nLabour leader Jeremy Corbyn said: “We are in an extremely serious and unprecedented situation. Read More Does Labour and party leader Jeremy Corbyn support Brexit?\n“The Government has lost control of events and is in complete disarray.”\nBut it seemed clear Labour has no plans at the moment to call a motion of no confidence in the Government, which could lead to a general election.\nInstead, Mr Corbyn challenged Mrs May to achieve a better deal with the EU.\nHe said: “Bringing back the same botched deal either next week or in January - and can she be clear on the timing - will not change its fundamental flaws and deeply held objections right across this House, which go far wider than the backstop alone.\n“This is a bad deal for Britain, a bad deal for our economy and a bad deal for our democracy. Our country deserves better than this.” Prime Minister Theresa May leaves Number 10 Downing Street\nOther opposition leaders attempted to pressure Mr Corbyn to call for a motion of no confidence.\nLiberal Democrat leader Sir Vince Cable said: “With the fiasco today, the Government has really lost all authority.\n“Let me just say that I and my colleagues will fully support the Leader of the Opposition (Mr Corbyn) if he now proceeds to a no confidence vote, as duty surely calls.”\nBusiness leaders responded to the latest chaos with despair. Read More ECJ Brexit ruling: UK can cancel decision to leave the EU, European Court of Justice says\nCarolyn Fairbairn, CBI Director-General, said: “This is yet another blow for companies desperate for clarity. Investment plans have been paused for two and a half years. Unless a deal is agreed quickly, the country risks sliding towards a national crisis.\n“Politicians on both sides of the Channel need show leadership, by building consensus to protect both the UK and EU’s prosperity. No one can afford to head into Christmas with the threat of no-deal costing jobs and hitting living standards.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-10T19:22:00.000+02:00", "crawled": "2018-12-10T19:51:28.001+02:00", "highlightTitle": ""}