{"organizations": [], "uuid": "36614d414e81d2cb2e43711a4781e868122a0cf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2304245.ece/ALTERNATES/s1200/0_Brexit.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/million-questions-brexit-how-stephen-2304161", "country": "GB", "domain_rank": 48128, "title": "There are a million questions on Brexit - this is how Stephen Barclay answered 10 - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "36614d414e81d2cb2e43711a4781e868122a0cf6"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/leicester-news/million-questions-brexit-how-stephen-2304161", "ord_in_thread": 0, "title": "There are a million questions on Brexit - this is how Stephen Barclay answered 10 - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "stephen barclay", "sentiment": "negative"}, {"name": "dominic raab", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "leicestershire live", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit Secretary Stephen Barclay (Image: PA) Get Daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThere are a million questions about Brexit swirling round at the moment as Parliament prepares to vote on Theresa May’s deal to get the UK out of EU.\nStephen Barclay may have some of the answers.\nThe new Brexit Secretary (his predecessor Dominic Raab quit saying he could not support the PM’s plan) agreed to answer some questions from Leicestershire Live readers on the pressing political issue of the day.\nHere are the questions you wanted to ask him and here are the responses he has offered up. poll loading What do you think of May's Brexit deal? 500+ VOTES SO FAR It's the only sensible way to leave the EU #BRINO Put it to a People's Vote Let's just stay in the EU\n1) Could it be likely that there may be a delay in products reaching the UK whilst the new borders are being created?\n\"The deal on the table provides an implementation period, a bridge if you like, where things carry on much as they are today while we prepare for our future relationship with the EU.\n\"We’ve agreed with the EU that we both want a trade deal that doesn’t throw up unnecessary barriers and red tape - which means trucks continue to flow through our ports.\"\n2) Why don’t we just walk away and save billions in a divorce bill?\n\"Firstly, let me just explain why we’ve agreed to pay the financial settlement.\n\"We’ve agreed to settle our obligations as departing members of the EU.\n\"We are a country that plays by the rules and honours its obligations: to do anything else would be wrong.\n\"It means that EU projects which the UK, and British individuals and businesses, started while we were an EU member can be completed as planned, and won’t need to fall back on the Government’s funding guarantee.\n\"It is also much lower than some of the estimates some suggested earlier in this process, which put the up front cost as high as £100 billion!\n\"It’s also important to note that this has been agreed in the spirit of our future relationship - it’s worth remembering that this is something that comes as part of the rest of the package.\n\"In the unlikely event that we leave the EU without a deal, the financial settlement as set out in the Withdrawal Agreement would no longer apply but, let’s be clear, “walking away” would not be the easy route.\n\"While the Government has been preparing for every possible scenario - including no deal - that isn’t an outcome we want.\n\"It would cause disruption and uncertainty, and, as the economic analysis released last week shows, it wouldn’t be the best bet for our economy. \"We’ve spent two years carefully negotiating a deal that has many benefits for the UK - including allowing us to make our own laws, and stop sending vast sums of money to the EU every year.\n\"This is the deal I’m backing.\" Read More How Leicester and Leicestershire MPs intend to vote on Theresa May's Brexit deal\n3) During the referendum campaign there was little or no mention of the Irish border, the divorce bill, or many of the other issues that have now emerged. Now the country’s better aware of the implications of any form of Brexit shouldn’t we get another chance to vote on whether we want it?\n\"The referendum was the largest-ever democratic exercise in the UK’s history and as an MP I cannot stress how important I think it is to respect the will of the people and defend democracy.\n\"At the heart of this is the unwritten contract between Members of Parliament and the public who elected them.\n\"It would be a betrayal of democracy to ask the public a question in this way and then ignore them and tell them they are wrong\n\"As a Brexiteer, my position on the referendum is pretty obvious, but however people voted, now is the time to unite behind the deal which is going to provide the best future for our country.\n\"Of course, people voted as they did for a variety of reasons and this deal addresses those concerns. It protects jobs and growth and on the financial settlement, it will be less than half of the figure some had previously suggested it might be and there are good reasons for paying this as I've explained above.\n\"On Ireland it protects the Belfast (Good Friday) Agreement which ensures peace on the island of Ireland.\"\n4) What will you personally do if/when the Withdrawal Agreement is defeated in Parliament on December 11?\n\"I’m focusing on the job at hand - this deal is the only deal which provides certainty for businesses and the people of UK, including those living and working in Leicester.\n\"If we reject this deal, that would mean damaging uncertainty which will threaten jobs, investment and the economy.\n\"It would also mean more division, rather than bringing the country back together. So the choice is backing the deal – or going back to square one by rejecting it.\n\"Nobody should be under any illusion that the EU are going to be prepared to start all over again and negotiate a new deal.\"\n5) What do you you think of the resignations of your principled colleagues like Dominic Raab, Jo Johnson and Sam Gyimah?\n\"Thank you for your question.\n\"My colleagues can answer for themselves but I would like to thank them for their hard work.\n\"My support for the deal comes down to how you view the deal, or the alternative risk of uncertainty from no deal or no Brexit.\n\"I think this deal delivers on the things I campaigned for - like a skills-based immigration system and global trade policy to being out of the Common Agricultural Policy.\n\"Without the deal we risk some MPs in Parliament trying to stop Brexit.\" Where next for Brexit?\n6) The Tories asked the people what they wanted and they got a clear answer so why are you pushing for Theresa May’s diluted Brexit that potentially keeps us tied in a Customs Union forever?\n\"As someone who campaigned for Brexit, I believe this deal delivers on the result of the referendum.\n\"For the first time in more than 40 years we will make our own laws and run our country without interference or rules imposed on us from another jurisdiction, decide who lives and works in this country and stop paying the EU vast amounts of money every year.\n\"Let’s be clear, nobody wants to use the backstop.\n\"We don’t want to, and the EU doesn’t like it because it means they lose all access to our fishing waters the day it comes into effect, assuming there is no fisheries agreement in place, and it allows us full access to their markets without paying a penny - something they see as an unfair competitive advantage for the UK.\n\"You need a backstop because it provides certainty for the people of Northern Ireland and Ireland.\n\"It is an insurance policy which guarantees that all the progress we have made with the Belfast Agreement cannot be undone and that we can continue to build on the gains of the peace process in Northern Ireland.\n\"In the unlikely event that the backstop is ever needed, it contains explicit and legally binding commitments that ensure it can only be temporary, and a review mechanism which either the UK or the EU can trigger to end its application.\n\"If the UK triggered this mechanism, the UK and the EU would be legally obliged to review the Protocol in good faith.\n\"If there is a dispute about the EU’s good faith in that process, it will be resolved by an independent arbitration panel who will rule on ultimately ending the backstop.\"\n7) Why are politicians like you so obsessed with Brexit as a priority when the country is struggling with increased poverty, crime and homelessness?\n\"Brexit is an incredibly important moment in our nation’s history which impacts many key areas of national life, so it’s right we focus on delivering a departure from the EU that works in the national interest.\n\"The deal that’s on the table is one which will protect our jobs and economy. A strong economy is a vital foundation for tackling all of the issues you mention, which is why we need to support the deal and help us to move forward as a nation-state.\n\"Getting this deal done allows us to focus on the issues that matter here at home like those you mention and the NHS and our schools.\n8) Why is the Government pressing ahead with a course of action that everybody knows will harm the UK’s economy and reduce its standing in the world?\n\"I’m afraid I don’t agree with you on this.\nThe referendum was the biggest democratic exercise this country has ever seen and failing to deliver on the result would be a betrayal of those who voted.\nIt is the best deal for this country and protects jobs and our economy. It will allow us to to strike ambitious trade deals with countries across the world.\nI would also say we should have more confidence in the ability of this great nation to chart a new course in the world. We are one of the biggest economies in the world with a long history of being a major player on the global stage.\nThe deal we’ve agreed with the EU gives us the ability to take us on to the next chapter in that story, and that’s why I want everyone to support it.\" Read More\n9) The EU need us more than we need them. Why have we conceded so much to Barnier and Juncker?\n\"This isn’t about concessions.\n\"It’s about working together with our EU partners to get the best deal for people and businesses on both sides.\n\"If you weigh up what we’ve agreed with the EU, it’s clear this deal protects our national interests. As with any negotiation, there was movement on both sides. For example, the EU was opposed to permitting an all-UK customs backstop.\n\"Now we have one.\n\"On the Withdrawal Agreement, the EU originally demanded jurisdiction over the whole agreement, instead we have agreed that any disputes will be resolved by both the UK and the EU or, when we cannot agree, by an independent arbitration panel.\n\"Also, this deal is unprecedented because it creates a free trade area for goods with no tariffs or quotas across the board.\"\n10) What do you say to Donald Trump who reckons this is a great deal for the EU and one that makes it hard for the UK to trade with the US?\n\"I’d say that if you take a look at what our deal delivers, it’s clear we’ll have the freedom to strike exciting new trade deals with the USA and many other countries across the world.\n\"Passing the deal means we’ll be ready to begin negotiating these as soon as the UK officially leaves the EU next March.\n\"Woody Johnson, the US Ambassador to the UK said last week, we have already forged one of the most successful economic partnerships in global history and are perfect partners - and we would be head of the queue when we take back control of our trade policy.\n\"Which is exactly what we will be doing when we leave the EU.\" Like us on Facebook ", "external_links": [], "published": "2018-12-08T02:00:00.000+02:00", "crawled": "2018-12-08T15:29:57.011+02:00", "highlightTitle": ""}