{"organizations": [], "uuid": "f6371c88bf87baa2739e5d62877532e8924d83df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10851082.ece/ALTERNATES/s1200/JS81937056.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexiteer-mp-sets-out-how-15533596", "country": "GB", "domain_rank": 21960, "title": "Brexiteer MP sets out how Theresa May CAN win support for a Brexit deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T21:36:00.000+02:00", "replies_count": 0, "uuid": "f6371c88bf87baa2739e5d62877532e8924d83df"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexiteer-mp-sets-out-how-15533596", "ord_in_thread": 0, "title": "Brexiteer MP sets out how Theresa May CAN win support for a Brexit deal", "locations": [], "entities": {"persons": [{"name": "anne-marie", "sentiment": "negative"}, {"name": "berwick anne-marie trevelyan", "sentiment": "none"}, {"name": "mrs trevelyan", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "trevelyan", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "brexiteer", "sentiment": "negative"}, {"name": "northumberland", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union share conservative", "sentiment": "none"}, {"name": "european research group", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexiteer MP sets out how Theresa May CAN win support for a Brexit deal Northumberland MP Anne-Marie Trevelyan welcomes Theresa May's decision to resume negotiations with the European Union Share Conservative MP for Berwick Anne-Marie Trevelyan Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTheresa May was backed by a Brexiteer MP after she delayed the vote on her proposed Brexit withdrawal agreement.\nAnne-Marie Trevelyan, Conservative MP for Berwick-upon-Tweed, said Mrs May now has a chance to go back to the EU and try to obtain a better deal.\nBut Mrs Trevelyan, a member of the backbench European Research Group which supports a hard Brexit , said a deal acceptable to Parliament would need to delete plans for a “backstop”, which some MPs fear could keep the UK locked in a customs union with the EU against its will.\nAnd she also said the UK should tell the EU it won’t pay the £39bn it apparently owes, until it gets a trade deal. Prime Minister Theresa May leaves Number 10 Downing Street\nShe said: “The Prime Minister was between a rock and a hard place. The vote would have been lost.\n“By pulling the vote tomorrow she has a chance to go back to Brussels and explain what would be acceptable to Parliament.\n“That is that the backstop protocol is dispensed with, that the £39bn isn’t given away without a trade deal agreed, and no more European Court of Justice control.”\nThe backstop is an agreement that the UK will stay in the EU’s customs union if no other way can be found to avoid a border between Ireland and Northern Ireland.\nMrs May says that the backstop is only included in her Withdrawal Agreement as a last resort, and if it ever was introduced then it would be temporary. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nBut some Conservative MPs say they fear it would become a permanent arrangement, and the UK would be forced to obey EU rules forever.\nSo the Prime Minister will now ask the EU to provide further reassurances about the backstop.\nThe £39bn sum is sometimes referred to as the “divorce bill”, but it is money the UK is said to owe the EU, not a payment for leaving.\nBoris Johnson, the Conservative former foreign secretary and Brexit supporter, has suggested the UK should hold half this money back until the EU agrees to sign a trade deal.\nLabour MPs accused Mrs May of running scared and Party Chair Ian Lavery, MP for Wansbeck, said the Prime Minister had “bottled it”. Read More Labour MPs put pressure on Jeremy Corbyn to back second referendum that could cancel Brexit\nAnd he suggested Mrs May should stand down, saying: “If the Prime Minister is incapable of even bringing a deal to Parliament, then she needs to step aside and make way for a Government that can.\n“Labour stands ready to intervene to unlock the negotiations, deliver on the result of the referendum and protect people’s jobs and living standards.”\nOther Labour MPs offered similar views.\nGateshead MP Ian Mearns said on Twitter: “We are dealing with a petrified Government. They are terrified of an election but they are also terrified of each other they are frozen in a state of paralysis! Ian Lavery (Image: Getty Images Europe)\n“How much longer must our country endure this Government that remains in office but not in power?”\nNewcastle Central MP Chi Onwurah said: “Am in Newcastle, watching from afar as the Government falls apart.\n“This is unbelievable. The Prime Minister apparently puts her job before everyone else’s and intends to play a game of chicken with the EU and our economy.”\nNewcastle North MP Catherine McKinnell called for a People’s Vote on Brexit. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-10T21:36:00.000+02:00", "crawled": "2018-12-10T22:12:57.005+02:00", "highlightTitle": ""}