{"organizations": [], "uuid": "69896dd9d244cdca0367982f418cd7de1d6689b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2290321.ece/ALTERNATES/s1200/0_JS164395993.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/tycoon-closing-exeters-house-fraser-2290311", "country": "US", "title": "Tycoon closing Exeter's House of Fraser store warns high street will become ghost town - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.844, "site_type": "news", "published": "2018-12-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "69896dd9d244cdca0367982f418cd7de1d6689b7"}, "author": "Jamie Hawkins", "url": "https://www.devonlive.com/news/devon-news/tycoon-closing-exeters-house-fraser-2290311", "ord_in_thread": 0, "title": "Tycoon closing Exeter's House of Fraser store warns high street will become ghost town - Devon Live", "locations": [], "entities": {"persons": [{"name": "mike ash", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}, {"name": "fraser", "sentiment": "none"}], "locations": [{"name": "devon live news tycoon", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "exeter's house of fraser", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Tycoon closing Exeter's House of Fraser store warns high street will become ghost town Mike Ashley says high streets will become extinct wants a new tax on online retailers to help save high streets Share Mike Ashley (Image: PA Wire/PA Images)\nSports Direct tycoon Mike Ashley, who has announced his intention to close Exeter's House of Fraser store in January, fears most high streets will die out completely by 2030.\nThe Newcastle United owner wants a new tax on online retailers to help save the high street.\nAppearing before MPs, the Sports Direct founder, who recently purchased troubled department store House of Fraser, Ashley said any retailer that makes more than 20 per cent of its sales online should be subject to an additional tax.\nSeveral House of Fraser stores, including Exeter’s, will close after Ashley failed to agree new terms with the building’s landlords. Read More Iceland reveals why Christmas puddings are still full of palm oil House of Fraser will close several stores (Image: Dominic Lipinski/PA Wire)\n\"It's not House of Fraser's fault, it's not Marks & Spencer's fault, it's not Debenhams’ fault the high street is dying,\" Mr Ashley said.\n\"The internet is killing the high street.\" Read More Dog walkers will now face massive fines if they break any of these eight rules\nExeter's House of Fraser store in the High Street is due to close next month, according to signs in the department store's window.\nAfter it was announced that some House of Fraser stores will close, putting hundreds of jobs at risk, Ashley yesterday warned high streets will not survive until 2030. Exeter's House of Fraser will close next year\nHe said: \"I want to make it crystal clear: the mainstream high street as we think about it today - not the Oxford Streets and the Westfields - are already dead. They can't survive.\"\nHe later said: \"Outside of London it's going to be a ghost town.\"\nMr Ashley also suggested local government should offer free parking in town centres and reform business rates.\nHis suggestions were welcomed by Robert Hayton, head of UK business rates at Altus Group. Read More Fears for shop chain McColl's as shares tank after profit warning Plymouth City Centre's House of Fraser store\nHe said: \"Our system of business rates was created nearly 30 years ago, before the advent of online shopping, and with the UK having the third largest e-commerce market in the world, Mike Ashley was right that it is vital that the Government develops a coherent approach to taxing the digital economy.\"\nQuizzed by members of the Housing and Local Government Select Committee on the future of House of Fraser, Mr Ashley said nobody would be able to keep all 59 of the department store's branches open \"except God\".\nHe also hinted a long-suggested tie-up between Debenhams and House of Fraser could still be on the cards.\n\"I told them to work together,\" he said. \"They should work together.\" Exeter's House of Fraser store\nMeanwhile, he described rising high street rents as \"prehistoric\" and said retailers were in a \"downward death spiral\". Read More B&Q blames Brexit as retail meltdown grips DIY chain\nMr Ashley has recently been embroiled in public rows with retail landlords, but he said that all parties must now come to the table to save the high street.\n\"Everybody has to come together and look at this,\" he said. \"I know it sounds very socialist, I'm not this crazy capitalist that everybody thinks I am.\" Read More", "external_links": [], "published": "2018-12-04T02:00:00.000+02:00", "crawled": "2018-12-04T16:31:50.033+02:00", "highlightTitle": ""}