{"organizations": [], "uuid": "e5860048f81784de8b112223a84b27a099bb94b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.gazettelive.co.uk/incoming/article15563463.ece/ALTERNATES/s1200/0_VRR_JNL_141218_bradleyhall_01.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/special-features/been-record-breaking-year-bradley-15563467", "country": "GB", "domain_rank": 21960, "title": "It has been a record-breaking year for Bradley Hall Chartered Surveyors and Estate Agents", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-17T17:28:00.000+02:00", "replies_count": 0, "uuid": "e5860048f81784de8b112223a84b27a099bb94b4"}, "author": "Adam Gray", "url": "https://www.chroniclelive.co.uk/special-features/been-record-breaking-year-bradley-15563467", "ord_in_thread": 0, "title": "It has been a record-breaking year for Bradley Hall Chartered Surveyors and Estate Agents", "locations": [], "entities": {"persons": [{"name": "neil hart", "sentiment": "negative"}, {"name": "john marshall", "sentiment": "none"}, {"name": "mark ketley", "sentiment": "none"}, {"name": "jonathan rudge", "sentiment": "none"}, {"name": "david douglass", "sentiment": "none"}, {"name": "nicola osborne", "sentiment": "none"}], "locations": [{"name": "bradley hall", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "bradley hall chartered surveyors and estate agents bradley hall group", "sentiment": "negative"}, {"name": "bh planning and design", "sentiment": "none"}, {"name": "bradley hall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bradley Hall Group Managing Director Neil Hart (Image: Handout) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nI can sincerely say that 2018 has been the biggest year yet for Bradley Hall.\nWe’ve celebrated our 30th anniversary with the launch of new offices, announced key appointments, welcomed £100m of new homes to market, established further company growth and gained several award wins.\nSenior appointments have included established solicitors and businessmen John Marshall and David Douglass joining our advisory board to further support the growth of Bradley Hall. Bradley Hall celebrated its 30th anniversary with a festive fundraiser (Image: Handout)\nMark Ketley joined as a director of Bradley Hall sister company, BH Planning and Design, Jonathan Rudge became head of land, development and new homes, while Nicola Osborne joined the department as corporate client director.\nWe opened our sixth regional office, expanding our presence in Northumberland to include a Hexham operation, and branched into West Lancashire with an office in Ormskirk.\nEstates Gazette (EG) awarded our commercial operations with the ‘Most Active Agents’ title and our very own chartered surveyor, Nicholas Bramwell was awarded the ‘Most Active Dealmaker’ in the North East, while our office activity grew by 400%.\nThe EG Awards are compiled only of factual data and deals, which is something we are enormously proud of gaining an award from.\nWe were also announced as the Best Property Consultancy – Newcastle upon Tyne at the International Property Awards for our activity across all departments.\nThanks to this growth, we have been lucky enough to build our commercial and residential property agency, but also become a firm which can support clients with a range of property and finance related services.\nWe are always looking at the bigger picture and encouraging activity not just for the clients and our business, but the region’s economy.\nBradley Hall’s service offerings have expanded significantly alongside our growing reputation and market share across the property industry.\nWe now operate a number of departments including property management, building surveying, commercial agency, residential agency, professional services, mortgages, as well as sister companies BH Planning and Design and BH Financial.\nOur ability to handle high profile projects has grown due to the expanding professional workforce and the addition of experienced senior management to the team. With that, we have been able to begin providing services for public sector organisations, supporting a positive impact on important services for the local community.\nWith the growth in demand for our services for the public sector, we were delighted to be awarded the Homes England Property Services Framework. The appointment to this national panel now allows us to act as key advisors on future North East and national government housing projects.\nI am a firm believer that all this success has been due to Bradley Hall moving with the times, keeping our eye on the ball and offering something different to other property firms.\nBradley Hall has been adapting to the market, outliving and outperforming the changing faces of other property firms on the high street. With an ever-growing importance on digital and online content, we also remain passionate about having a strong physical presence via our network of branches in key areas of the North East, including in its cities, suburbs and popular market towns.\nAlthough Bradley Hall has been running for 30 years, it is a very different business from what it once was.\nWith the appointment of the current board of directors and senior management team, we almost instantly reinvented our approach and legacy to support the growth we had planned.\nThroughout the business process there is a time when you have to work hard to go from ‘small’ to ‘bigger’ in order to thrive - and today’s Bradley Hall has certainly achieved that, and more, in the past few years.\nWe marked our 30th anniversary and the end of a stellar year with 300 guests at the Crowne Plaza Newcastle – Stephenson Quarter at our 3rd annual Festive Fundraiser.\nThe event raised thousands of pounds for two local charities, Marie Curie and Daft As A Brush Cancer Patient Care.\nThis further added to the funds which we raised by completing a 30km walk back in the summer.\nIn the midst of an uncertain future, we are confident that our success and growth will continue. When it comes to our future, we are a resilient region and, despite the panic, Brexit won’t create a huge problem for the property industry in the North East.\nGrowth remains slow but steady, which gives us a good indication of our region’s stability.\nDespite uncontrollable external factors which may have had a lasting negative impact on our business, we can say that Bradley Hall has thrived, grown and overcame many economic hurdles, which have often destroyed other businesses in the region.\nOur strength and resilience will no doubt continue as we look to continue growing and providing the best full-service practice in the region.\nLast but not least, thank you to everyone who has supported Bradley Hall throughout our 30th year - we are already looking forward to what 2019 will bring. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-17T17:28:00.000+02:00", "crawled": "2018-12-17T20:14:01.008+02:00", "highlightTitle": ""}