{"organizations": [], "uuid": "e5426b0e640cff082d045aa6e41cb3936c05b66a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article883696.ece/ALTERNATES/s1200/Money-causes-a-lot-of-issues-for-some-people-at-Christmas.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/how-22-new-laws-coming-2326766", "country": "GB", "domain_rank": 48128, "title": "How these 22 new laws coming into effect in 2019 will impact you - Derbyshire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "e5426b0e640cff082d045aa6e41cb3936c05b66a"}, "author": "James Rodger", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/how-22-new-laws-coming-2326766", "ord_in_thread": 0, "title": "How these 22 new laws coming into effect in 2019 will impact you - Derbyshire Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "birmingham live", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How these 22 new laws coming into effect in 2019 will impact you From drones to pensions, equal pay to EU citizens, there are some big changes on the way Share Savings rates are set to change Get Daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nWe're just a few weeks away from the start of 2019, which among other things will bring a raft of new legislation into effect in the UK.\nThere are several changes to the law which will start to apply, and will have an impact on all our day-to-day lives.\nThey cover everything from pensions to supermarket, tax to drones.\nOf course, more laws will be added as the year progresses, but for now, Birmingham Live has rounded up 22 which may gain your interest .\nThankfully, there is SOME good news.\nWorkers in the East Midlands will see the minimum wage go up.\nYou're set to pay out a lot more for a raft of things - and, to help you keep in the loop, we've got a rundown here. Increase in National Minimum Wage rates\nBoth the National Living Wage (NLW) and National Minimum Wage (NMW) rates will increase in April 2019.\nThe “living wage”, the effective minimum wage for people aged 25 or over, will rise to £8.21 next April, up from £7.38 an hour now. New drone laws Leicestershire Police drone (Image: Leicestershire Police)\nFrom November 2019, new drone rules will come into effect, impacting users.\nThe new laws will make it illegal to fly a drone weighing more than 250g without first registering with the Civil Aviation Authority and passing online safety tests.\nAviation minister Baroness Sugg said in a statement: \"Whilst we want this industry to innovate and grow, we need to protect planes, helicopters and their passengers from the increasing numbers of drones in our skies.\n\"These new laws will help ensure drones are used safely and responsibly.\" Many people will be able to keep more of the money they earn\nThe income tax threshold will increase to £12,500 in April 2019. In other words, you won’t pay any income tax at all until you earn this much.\nAssuming you have an annual income of at least £12,500, you’ll probably pay £130 less tax a year.\nAnd the threshold for the higher rate of income tax - the 40 per cent rate - will increase to £50,000-a-year.\nIt means that some people on higher salaries (more than £46,351-a-year) will also gain.\nWhat does that mean?\n“A £130 a year gain for anyone earning over £12,500,” Martin Lewis explained.\nThere was even more cash for the better off – with the point you start paying 40 per cent income tax moving from £46,350 to £50,000.\n“Which means another £730 in the pay packets of people who are above £50,000,” Martin added.\nHowever, the super-rich won't get the full benefit – for once – with people making more than £100,000 not benefiting as much or even at all. Supermarket equal pay claims\nDecisions on separate tribunal cases on the issue of equal pay involving Tesco, Asda, Morrisons and Sainsbury’s are expected in 2019.\nIt involves female shop workers who feel they are paid less than their male warehouse workers, despite carrying out a similar role. National Minimum Wage for sleep-ins\nThe Court of Appeal says people working sleep-in shifts, such as nurses and care workers, are not entitled to the National Minimum Wage for time spent asleep where they were ‘available for work’ and not ‘actually working’.\nA request to appeal this decision was lodged with the Supreme Court by Unison and a decision is expected in 2019. Settled status for EU nationals\nEuropean workers living in the UK can apply for settled status in 2019, allowing them to remain indefinitely after the end of the Brexit transition period in 2021.\nTo be granted settled status individuals must prove they have been living in the UK for five years by the date of application.\nThose who do not meet this requirement can apply for temporary status, allowing them to remain until they have gained enough residency to be granted settled status. Pension contributions Pensioners will receive a financial boost with the announcement of the new pension rates.\nThe minimum contributions for auto-enrolment pension schemes will increase for employers and employees from April 2019.\nExisting rules mean employers must contribute a minimum of two per cent of a worker’s pre-tax salary, with the worker contributing three per cent.\nUnder the new rules, employers and employees will now have to contribute a minimum of three and five per cent respectively. Payslips\nFrom April 6, 2019, the legal right to a payslip will be extended to include non-employees such as contractors and freelancers.\nEmployers will also be obliged to include the total number of hours worked on payslips for employees whose wages vary depending on how much time they have worked. Pay gap reporting Action is being taken to tackle the gender pay gap (Image: Getty)\nPrivate organisations with 250 or more employees will again be required to publish their gender pay gap figures on April 4, 2019.\nNew legislation will come into force that requires companies with more than 250 employees to publish their executive pay gap. Non-disclosure agreements\nA review into the use of non-disclosure agreements in the workplace is expected in 2019.\nThese agreements, otherwise known as gagging clauses, were originally used to protect intellectual property but they are often used to silence claims of harassment and bullying. VAT rules\nFrom April 2019, all VAT-registered businesses with taxable turnover above the VAT registration threshold will have to keep VAT records in digital form and file their VAT returns using software. State pensions Changes to the state pension have been announced (Image: Getty)\nState pension rates are set for huge changes in 2019 - and now it can be revealed reveal how.\nThe boost will be implemented from April next year, according to consumer watchdog Which?\nThe financial watchdog reports the government have finally confirmed what the basic and single-tier state pension rates will be from April 6.\nThis comes alongside a string of other benefits.\nThe state pension is basically a weekly payment from the government.\nIt can be received once somebody reaches the eligible age of 65. Basic state pension rates\nThose receiving the basic state pension will get a weekly boost in 2019/2020.\nRecipients will get an extra £3.25 a week, increasing the state pension from £125.95 to £129.20.\nRetired workers in this group will then have £169 more for the year, which works out as an annual income of £6,718.40. New state pension rates\nIt's also good news for those entitled to the full new single-tier state pension.\nThose receiving this will see an increase from £164.35 to £168.60 - which means an additional £4.25 a week.\nThat's £221 extra by the end of the 2019/2020 tax year, which raises the total annual income to £8,767.20. Additional state pension rates\n\"If you reached state pension age before April 2016, your state pension will be made up of two parts; the basic state pension and the additional state pension - sometimes referred to as the second state pension,\" revealed Which?\nThe additional state pension only increases by the rate of CPI inflation, which was announced in September, rather than being linked to the triple lock guarantee.\nhis means that the additional state pension will increase only by 2.4 per cent from April 2019.\nThere remains a cap on the maximum additional state pension you can earn, though this rises from £172.28 per week to £176.41 per week in 2019/2020. Pension credit\nThis means-tested benefit is awarded based on earnings, and from April 2019 both pension credit payments will rise by 2.4 per cent, the CPI rate of inflation.\nGuarantee credit, the first part of pension credit, will subsequently increase from £163 a week to £167.25 per week for a single person and from £248.80 to £255.25 for a couple.\nThe second part, savings credit, will see its cap rise from £13.40 to £13.72 for a single person, and from £14.99 to £15.35 a week for a couple. Personal lifetime allowance Savings rates are set to change\nThe pension lifetime allowance is the maximum amount that you can put into your retirement savings without being taxed.\nIt increases based on the rate of CPI inflation, which means that from next year, the pensions lifetime allowance will increase from £1,030,000 to £1,055,000.\nAccording to Which?, this means an extra £24,800 in tax-free pensions savings that you can make. Pension contributions\nThe minimum contributions for auto-enrolment pension schemes will increase for employers and employees from April 2019.\nExisting rules mean employers must contribute a minimum of two per cent of a worker’s pre-tax salary, with the worker contributing three per cent.\nUnder the new rules, employers and employees will now have to contribute a minimum of three and five per cent respectively. Tax allowances and thresholds\nThe amount of income you can earn before you pay tax - the personal allowance - increases from £11,850 to £12,500 on April 6, 2019.\nBasic rate tax will be still payable on taxable income up to £34,500 and the higher rate threshold will be increased from £46,350 to £50,000. Savings\nThe adult Isa annual subscription limit for 2019-20 will remain unchanged at £20,000.\nBut for child Isa savers, the annual subscription limit for Junior Isas for 2019-20 will be uprated to £4,368. Working-age benefits\nThe majority of working-age benefits, such as Jobseeker’s Allowance, are unchanged.\nThey are frozen at their 2016–17 levels for four years following the Welfare Reform and Work Act 2016. Universal credit\nOver £1billion has been set aside over five years to fund top-up payments from those who have been moved onto Universal Credit from other benefits. Like us on Facebook", "external_links": [], "published": "2018-12-14T02:00:00.000+02:00", "crawled": "2018-12-14T10:51:30.016+02:00", "highlightTitle": ""}