{"organizations": [], "uuid": "f17c7c60573a15db49c0d5ecbfbafe33526ca323", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/property/article477470.ece/ALTERNATES/s1200/Housing-marketPNG.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/property/brexit-effect-south-west-housing-2323915", "country": "US", "title": "The Brexit effect on the South West housing market", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-13T20:13:00.000+02:00", "replies_count": 0, "uuid": "f17c7c60573a15db49c0d5ecbfbafe33526ca323"}, "author": "Tina Penberthy-Hutchings", "url": "https://www.devonlive.com/news/property/brexit-effect-south-west-housing-2323915", "ord_in_thread": 0, "title": "The Brexit effect on the South West housing market", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "south west", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "rics uk residential market survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Brexit effect on the South West housing market 'Key indicators on demand and sales weaken again in the South West' Share 'Sales expectations suggest momentum is likely to slip in the coming three months' Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nUncertainty from Brexit is causing buyers and sellers to sit tight in increasing numbers, according to the November 2018 RICS UK Residential Market Survey. The results from the latest survey show a weaker trend in sales than previous months with the headline indicators for demand and supply falling once again, as almost half of respondents to the survey cite political uncertainty caused by Brexit as impacting the UK housing market.\nThe number of people looking for a new home fell again in November across the South West (net balance of -29 per cent down from -20 per cent in October), with many comments attributing this to Brexit uncertainty. Read More Millionaires' row: These are the Devon streets with the most expensive homes\nAnother contributing factor is the continued limited choice of properties for sale. The number of new properties being listed for sale also fell modestly in the latest results. Still, the agreed sales indicator pointed to a somewhat steady trend in sales transactions in November, with a net balance of eight per cent more respondents across the South West reporting an increase. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nHowever, sales expectations suggest momentum is likely to slip in the coming three months (net balance -14 per cent). The impact of softer demand is also visible in the key price balance in the South West, which slipped to -9 per cent from -7 per cent previously.\nAs seen in previous months, the regional picture remains varied, with house prices falling most notably in London, South East and East Anglia, while the price picture was broadly flat in the South West, East Midlands and North East. Read More How easy is it to move up the property ladder?\nPrices were seen rising in Northern Ireland, Scotland, West Midlands, Wales, Yorkshire and Humber and the North West. RICS chief economist Simon Rubinsohn said: “It is evident from the feedback to the latest RICS survey that the ongoing uncertainties surrounding how the Brexit process plays out is taking its toll on the housing market. Indeed, I can’t recall a previous survey when a single issue has been highlighted by quite so many contributors. Royal Institution of Chartered Surveyors chief economist Simon Rubinsohn\n“Caution is visible among both buyers and vendors and where deals are being done, they are taking longer to get over the line.\n“Significantly the forward-looking indicators reflect the suspicion that the political machinations are unlikely to be resolved anytime soon. The bigger risk is that this now spills over into development plans making it even harder to secure the uplift in the building pipeline to address the housing crisis.” Read More Here's the property £250,000 buys you in each of these towns\nRICS reported that at national level the time taken to complete a sale from initial listing stands at approximately 19 weeks, representing the longest duration since the series was first introduced in February 2017 and another sign of challenges in the sales market.\nIn the lettings market, demand from prospective tenants was holding broadly steady, however, the number of new instructions continues to fall signalling a continued decline in the supply of fresh rental stock. As a result, rents are expected to rise modestly over both the three and twelve-month horizons, according to RICS. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-13T20:13:00.000+02:00", "crawled": "2018-12-13T20:37:43.001+02:00", "highlightTitle": ""}