{"organizations": [], "uuid": "b4ec8337d95650a0fc92759eecf57668d2f2d840", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2302617.ece/ALTERNATES/s1200/0_TP_TEM_071218Parkside_01.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/topps-tiles-opens-showroom-parkside-2302487", "country": "GB", "domain_rank": 48128, "title": "Topps Tiles opens showroom for its Parkside commercial business at Grove Park HQ - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-12-10T02:00:00.000+02:00", "replies_count": 0, "uuid": "b4ec8337d95650a0fc92759eecf57668d2f2d840"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/topps-tiles-opens-showroom-parkside-2302487", "ord_in_thread": 0, "title": "Topps Tiles opens showroom for its Parkside commercial business at Grove Park HQ - Leicestershire Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "grove park", "sentiment": "none"}, {"name": "parkside", "sentiment": "none"}, {"name": "parkside tiles", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}], "organizations": [{"name": "topps tiles", "sentiment": "negative"}, {"name": "leicestershire live topps tiles", "sentiment": "negative"}, {"name": "grove park hq chain", "sentiment": "negative"}, {"name": "topps tiles hq", "sentiment": "none"}, {"name": "invalid email topps tiles", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Topps Tiles opens showroom for its Parkside commercial business at Grove Park HQ Chain relocates recently acquired Parkside business to Enderby base, and grown the sales team to 16 people Share The new Parkside Tiles showroom at the Topps Tiles HQ in Grove Park Get Business\nTopps Tiles’ has opened a showroom for its new commercial business at its Grove Park headquarters.\nThe chain has relocated its recently acquired Parkside business to its Enderby base, and grown the sales team to 16.\nThe new location gives Parkside space to display its range of porcelain, ceramic and natural stone tiles in a “dynamic and inspirational” setting.\nTopps Tiles – which previously concentrated on the DIY market and independent traders – moved into commercial sales in 2017 when it bought Thurmaston-based Parkside in a £1.1 million deal. Parkside Tiles showroom\nIt has invested a substantial amount in the showroom and sales team while turning Parkside’s Thurmaston showroom into a Topps Tiles branch.\nParkside, which also has a showroom in Chelsea, works within the architecture and design community and clients have included the likes of Nandos and Wagamama .\nTopps recently reported a 25 per cent drop in year-on-year pre-tax profits as it absorbed the cost of integrating Parkside into its broader business. Parkside Tiles\nParkside sales are expected to double from the current £2.1 million, but it is expected to make further losses next year before moving into profit.\nThe new showroom showcases the latest tiles in a modern design setting.\nParkside managing director Brian Linnington said: “This is an exciting high-quality new location that we believe will provide Parkside with room to grow as the company expands. Read More Topps Tiles explains why it's stockpiling top selling products ahead of Brexit\n“We’re delighted to be welcoming visitors to experience this new design space, and we look forward to providing them with support and assistance from our highly experienced team as they plan their new projects and schemes.”\nParkside used Harrison and Dijon Designs to make the most of the former warehouse space, exposing the pipework and keeping the industrial feel. The new Parkside Tiles showroom at the Topps Tiles HQ in Grove Park\nProgrammed lighting allows tiles to be shown in different light conditions and there is a large table to show samples on.\nInterior and design books and product images have also been made available. Read More\nShowroom manager Louise Reddell said: “We’ll be hosting a series of events throughout the year and clients are welcome to use the space for their own events and meetings too.” Like us on Facebook", "external_links": [], "published": "2018-12-10T02:00:00.000+02:00", "crawled": "2018-12-10T08:49:03.017+02:00", "highlightTitle": ""}