{"organizations": [], "uuid": "34874735b5a849b498175c4f931fd0892ec67be2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15563227.ece/ALTERNATES/s1200/2_NUFC-2019.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-2019-rafa-resolution-15563081", "country": "GB", "domain_rank": 21960, "title": "Newcastle United in 2019: From a Rafa resolution to Kenyon, eleven things to look out for next year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-17T16:23:00.000+02:00", "replies_count": 0, "uuid": "34874735b5a849b498175c4f931fd0892ec67be2"}, "author": "Mark Douglas", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-2019-rafa-resolution-15563081", "ord_in_thread": 0, "title": "Newcastle United in 2019: From a Rafa resolution to Kenyon, eleven things to look out for next year", "locations": [], "entities": {"persons": [{"name": "ashley", "sentiment": "none"}], "locations": [{"name": "kenyon", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "ex-manchester united", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "kenyon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now\nSo in response to the most popular question being asked on Tyneside at the moment: yes, there is something concrete going on with regards to the takeover. But no, no-one can tell you with any certainty that the club is going to be sold any time soon – even if it feels more likely than it has done before (a statement that is essentially meaningless given that it’s never been very close before – despite this being the seventh time under Ashley that an imminent change of ownership has been talked up). Read More 'Sold by October... 2009': The six other times a Newcastle United sale has supposedly been 'close'\nDon’t doubt Kenyon’s desire to get this deal done. The ex-Manchester United and Chelsea Chief Executive wants a ticket back to ‘the show’ and is understood to believe United could be transformed with investment, having identified areas of improvement that could provide quick wins for him. His problem is not finding investors – he has some prepared to come into a consortium – it is seeking out those prepared to accept a model of ownership which would see several individuals and groups combined with him making the key decisions. Understandably, this model isn’t for everyone.\nIn the early weeks and months of 2019, Kenyon will be the subject of much talk surrounding United. The noises that people who know him are making are that he is going nowhere – and is desperate to see this deal through. Until he actually brokers it, though, cynicism will be understandable. Chelsea's US chairman Bruce Buck (R), former Chelsea CEO Peter Kenyon (C) and Roger Taylor from the British rock band Queen (L) attend the UEFA Champions League quarter final second leg football match between Chelsea and Paris Saint-Germain at Stamford Bridge in London on April 8, 2014. Chelsea won 2-0 going through to the semi-final on the away goals rule. AFP PHOTO / GLYN KIRK (Photo credit should read GLYN KIRK/AFP/Getty Images) (Image: AFP/Getty Images) ...and ‘the other three’\nThe leak of Garry Cook’s name as a potential rival for Newcastle didn’t exactly capture the imagination over the weekend. United sources seemed less than convinced he’s a serious player in the takeover saga. Read More Who is Garry Cook? The ex-Manchester City CEO fronting a bid to buy Newcastle United\nSources close to Ashley continue to stand by the claim that there are four groups in total and there are others besides Kenyon in the mix. If that’s the case we could be taken by surprise by a name that isn’t in the public domain yet – but if you’re taking that with a pinch of salt that’s understandable. Mike Ashley in his biggest year\nHaving unnecessarily injected further uncertainty into the club’s position with his baffling Sky News interview, Ashley has fired the starting gun on a 12 month period that will be the biggest of his time at the club.\nWith Rafa Benitez’s future at stake in 2019 – and considering the ramifications for the club if he leaves – Ashley can either push the club closer to the abyss through inaction this year or, either through a sale or resolving the uncertainty surrounding the manager, give United some hope again. It’s a measure of the pessimism surrounding Newcastle that very few believe he will be inclined to do the latter. Read More Takeover talk is real - and one of seven huge issues facing Newcastle before the start of 2019\nAnd it would be a brave correspondent who would stake their reputation on Ashley not being here in 12 months time. He has made fools of those of us who take his words about selling the club at face value before – and Ashley has illustrated through his dealings thus far with Benitez that he will not be swayed by what Newcastle’s fans want to happen. Having alienated Alan Shearer and Kevin Keegan, would it really be that much of a surprise if he does the same with Benitez and banks on the fact that he rode out those waves of discontent and will be able to do the same again?\nWhat we need is an owner prepared to invest in the club, to back a manager who wants to turn them from survivors into strivers and someone who will communicate a clear and coherent strategy. The best hope for any of that is that Ashley isn’t here for much longer.\nIf he is, what comes next is shrouded in uncertainty.\nIf you want a note of optimism it should come in Ashley’s famous unpredictability. No-one saw him coming to successive matches at the start of the season and no-one believed he would sanction the arrival of Benitez in the first place. There is money to spend for Newcastle and Benitez has, it seems, had a pledge that he will get reinforcements. Mike Ashley, Newcastle United owner, in the stands prior to the Premier League match between Southampton and Newcastle United at St Mary's Stadium (Image: Getty Images) A huge January transfer window\nHaving endured four frustrating transfer windows – including a minuscule net spend in the summer – Newcastle’s recruitment will be under scrutiny for 31 days.\nThe problem in the close season was that Benitez’s wishes were so far removed from Newcastle’s that there was never going to be quick or efficient business. He wanted a crop of players pushing 30 who would command big fees; United would rather he looked at players under 26 with potential.\nNewcastle sources have spoken about trying to bring the two parties closer together – basically compromising on either approach – as a way to end the deadlock but Benitez retains scepticism about that. His January wishlist is headed by a player who is under 25 but will required United to break their long-standing transfer record. As a test case, Miguel Almiron – who wants to sign for Benitez and could be signed quickly – will do nicely. Read More Miguel Almiron's father has made a fresh claim that Newcastle United are in the box seat to sign MLS star\nBubbling away beneath the surface are the same issues that made the summer difficult: Benitez’s contract is close to ending, Ashley still wants to sell the club, Lee Charnley insists on being meticulous on incomings and outgoings, Newcastle have a large squad with some players who need to be shipped out.\nAnd perhaps the biggest frustration for Benitez is that he has never known the scope of the budget he has to work with. Newcastle tell him not to think like that but instead to work on a case-by-case basis – pointing out that a £20million spend on the right player might get the green light while a £4million deal for a 30-year-old might not. Newcastle’s boss, unlike his predecessors, does not see the logic and has stuck to his guns on targets – one of the reasons why Salomon Rondon eventually arrived on loan when a permanent deal was ruled out early in the summer.\nWith Benitez’s own future so closely aligned to the issue of recruitment, it will be a big 31 days for the club. Miguel Almiron (Image: Getty Images) Finally a resolution to the Rafa Benitez saga\nHaving spent two years debating it, this summer a decision has to be made. Will Benitez sign a new contract and stay – or will he leave at the end of his current deal?\nFirst things first: if the club go down, it’s a non-issue. Benitez will go. But on current form , he should do enough to keep them up and then there is a huge issue to resolve.\nIt is an issue that has cast such a long shadow over the club since 2016 that a resolution in the summer – or before – will at least give us an idea about what the immediate future holds for Newcastle. Without Benitez, United are a diminished force – and a huge opportunity has passed.\nIt is not a done deal, despite what some – even some of those within the Benitez camp – will tell you. The same voices saying Benitez wouldn’t stay for the Championship are saying he is unlikely to stay under Ashley but the Spaniard is his own man. It may be that he signs a short deal to continue a project that he cares passionately about at Newcastle. Read More Can Rafa Benitez's NUFC future be resolved? Inside the sometimes fraught negotiations that will prove critical\nAnd speaking to him, you sense that he yearns to remain at Newcastle if he can get some indication that the club won’t make him re-run this and last year’s desperate battles simply to survive. That is the hope: the reality is that if Ashley remains and the austerity continues, he will not be short on alternative offers.\nWhichever way it goes, it is the defining issue of the year. poll loading Do you think Rafa Benitez will stay at NUFC? 3000+ VOTES SO FAR Yes No Rafael Benitez, Manager of Newcastle United looks on prior to the Premier League match between Huddersfield Town and Newcastle United at John Smith's Stadium (Image: Getty Images) The next move from the fans\nThe Magpie Group has had a difficult start but if Benitez goes, the next move of the supporters is going to be very interesting. Similarly, if he stays it will carry plenty of weight with supporters who have backed him so well sine he joined the club.\nFans turned on themselves over protests and boycotts recently – finding an effective way of giving the most important constituency at Newcastle a voice will be important in 2019. Even if there is a new owner, getting them to listen to a fan group or pay attention to the neglected supporters is going to be key. A big decision on Salomon Rondon\nThe financials of a permanent deal for Rondon made little sense to the United hierarchy in the summer and if we’re being honest, there were plenty of Newcastle fans who couldn’t get their head round Benitez’s desire to sign Rondon either.\nBut five goals into his time at Newcastle and the Rondon issue looks less clear cut. It’s difficult to see United sanctioning the deal in its current form but if he goes on to match or improve on his goalscoring form in the second half of the season they have a big decision to make. Huddersfield Town v Newcastle United at the John Smith's Stadium, Huddersfield ---- Newcastle United striker Salomon Rondon celebrates his goal (Image: Newcastle Chronicle) ....and on the future of Kenedy too\nKenedy’s difficult second season makes his future a little less clear cut. In the summer his agent talked up a deal to take him to a Champions League club, now it feels as if he is battling to convince Newcastle to make overtures to bring him in permanently at the end of the year.\nBenitez still likes him so if the Newcastle boss remains, talks with Chelsea will begin in earnest at the end of the season. Newcastle’s hand has probably been strengthened by his inconsistency . Privately, Benitez believes there is much more to come from him. The important next move for Sean Longstaff and Freddie Woodman\nNewcastle’s record with their young players has been patchy recently but they have two excellent players ready to make the next step in their career in Longstaff and England under-21 goalkeeper Woodman. Read More Rafa Benitez assures Sean Longstaff his debut will come soon - and applauds patience of Lascelles and Shelvey\nIn the short-term, good loan moves for them in January would be the aspiration. In the long-term Benitez must decide whether they get a chance at Newcastle in 2019/20. NEWCASTLE, ENGLAND - OCTOBER 31: Sean Longstaff of Newcastle United walks outside during the Newcastle United Training Session at The Newcastle United Training Centre on October 31, 2018, in Newcastle upon Tyne, England. (Photo by Serena Taylor/Newcastle United via Getty Images) (Image: Newcastle Utd via Getty Images) The final year of the Puma deal - and the Sodexo one\nThe long-term Puma deal ends in 2020 – and so, we understand, does the Sodexo deal for in-club catering. They are two big contracts that you'd feel – by the end of next year – will present opportunities to boost club coffers.\nDue diligence has unearthed both as opportunities for any new investors. The kit manufacturer is a huge opportunity for someone. A new transfer policy – one way or another\nNot specific to Newcastle, but the UK’s imminent departure from he European Union will change the way United do business. Having a plan to cope with whatever comes next is going to be an important factor in deciding whose recruitment works in the post-Brexit world and whose is left behind. Read More\nUnited are starting to look at non-EU players again – see moves for Almiron and recent scouting of Japanese players in Europe – so the signs are that Benitez understands that football is going to have to change with the times. Like us on Facebook", "external_links": ["https://mab.data.tm-awx.com/rhs&quot;,&quot;modularCss&quot;:&quot;true&quot;,&quot;newslettersURL&quot;:&quot;https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/&quot;,&quot;nativeAppBanner&quot;:&quot;true&quot;,&quot;GDPRConsentEnabled&quot;:&quot;true&quot;,&quot;PWA.iOS.title&quot;:&quot;Newcastle"], "published": "2018-12-17T16:23:00.000+02:00", "crawled": "2018-12-17T20:14:19.108+02:00", "highlightTitle": ""}