{"organizations": [], "uuid": "27fb239017d470720e67fb9683ebc60c66c2c534", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13535976.ece/ALTERNATES/s1200/transport.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/worrying-truth-north-south-divide-15506736", "country": "GB", "domain_rank": 21960, "title": "Worrying truth about the North-South divide - and why the gap is getting bigger", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-05T02:01:00.000+02:00", "replies_count": 0, "uuid": "27fb239017d470720e67fb9683ebc60c66c2c534"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/news/north-east-news/worrying-truth-north-south-divide-15506736", "ord_in_thread": 0, "title": "Worrying truth about the North-South divide - and why the gap is getting bigger", "locations": [], "entities": {"persons": [], "locations": [{"name": "north", "sentiment": "none"}, {"name": "south of england", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North-South divide is dominating the headlines once again Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe North must be given more power to govern itself as it is the only the way to close the growing gap with the South of England, according to a major new study.\nThink tank IPPR North has published a report which warns that the North-South divide is still getting worse despite the Government ’s Northern Powerhouse policy.\nBut it said the North has enormous potential, and its economic strengths include advanced manufacturing, energy, health innovation and digital.\nProductivity in these sectors is forecast to grow by 38% by 2030.\nThe solution is to create a new Northern Powerhouse vision - but one which involves giving the North control of its own affairs, the think tank says. Do you know the north and south divide?\nIt comes as the Government prepares to publish a new Northern Powerhouse strategy , due next year.\nThe Government argues that the North has more of a voice than ever before, and also more jobs.\nBut IPPR North’s report, called State of the North 2018, includes a series of worrying statistics.\nIt warns:\n- Weekly pay has fallen by £21 in the North since 2008 in real terms – more than the national fall in pay, and half a million people work in accommodation and food services jobs where weekly pay is half the national average.\n- Since 2009/10 total public spending in the North has fallen by £6.3bn in real terms– more than any other region, while the South East and South West together received a £3.2bn rise in public spending during this period. Read More Meet Labour's new 'champion' for the North - and this is what the role could mean for the North East\n- Average household wealth is more than twice as high in the South East compared to the North East , while the increase in property wealth has driven up London’s wealth at twice the rate as in the North since 2006/08.\n- Two million working-age adults and one million children live in poverty in the North, and women and those from an ethnic minority backgrounds are disproportionately affected.\nThe report argues that, almost five years since George Osborne coined the term, the next phase of the Northern Powerhouse should introduce a philosophy of “of the North, by the North, for the North”.\nReport author Luke Raikes said: “The Government is so consumed by Westminster’s Brexit chaos that it has deprioritised the Northern Powerhouse agenda at the very time it is needed most. This cannot continue.\n“All our regional economies face severe challenges– including London’s. Brexit threatens to make this much worse and the Northern Powerhouse agenda is the best chance we have of fixing this national economic crisis. In the national interest, the North needs to thrive. Read More 28 things that annoy people who live in the North East\n“The best way to take this important agenda forward is for the North to take the lead. The next phase of the Northern Powerhouse must be of the North, by the North, for the North.\"\nDirector of IPPR North, Sarah Longlands, said: “The North has started to see the impacts of the Northern Powerhouse agenda most noticeably with the elected mayors, the growing recognition of the North’s external profile and the creation of Transport for the North. The growing confidence and appetite for economic change is something to be celebrated and built upon.\n“However too many of the North’s people and places are yet to feel the benefits. One million of northern children live in poverty. Many families depend upon precarious and poorly paid jobs and levels of healthy life expectancy in many areas constrain the opportunities of people to play an active role in their local economy.\"\nA Government spokesperson said: “The North is thriving, with a record number of people in work and over 200,000 more businesses today than in 2010.\n“Never before has it had such a powerful local voice, following the election of four new metro mayors, and a fifth on the way, who we have empowered to champion their communities and build on this success.\n“We are also backing the whole of the Northern Powerhouse with £3.4 billion to boost local economic growth and a record £13 billion in transport improvements, meaning almost £250 per person - more than any other region - will be invested next year to help commuters and motorists across the North.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-05T02:01:00.000+02:00", "crawled": "2018-12-05T03:23:05.034+02:00", "highlightTitle": ""}