{"organizations": [], "uuid": "7962967aae35dcb55db278eebbdd2647a895d858", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14635085.ece/ALTERNATES/s1200/Worker-exploitation-measures.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/new-rights-workers-outlined-government-15563129", "country": "GB", "domain_rank": 21960, "title": "New rights for workers outlined by Government after 'gig economy' review", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-17T16:12:00.000+02:00", "replies_count": 0, "uuid": "7962967aae35dcb55db278eebbdd2647a895d858"}, "author": "Agency Staff", "url": "https://www.chroniclelive.co.uk/business/business-news/new-rights-workers-outlined-government-15563129", "ord_in_thread": 0, "title": "New rights for workers outlined by Government after 'gig economy' review", "locations": [], "entities": {"persons": [{"name": "greg clark", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "share office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business New rights for workers outlined by Government after 'gig economy' review Package described as \"biggest reforms in 20 years\" will give more rights to people working in insecure positions Share Office workers at their desks (Image: PA) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe Government has set out what it describes as the biggest package of workplace reforms for over 20 years to meet the changing world of work.\nLegislation is being introduced to give workers details of their rights from the first day in a job, such as eligibility for sick leave and pay and details of other types of paid leave, such as maternity and paternity.\nThe maximum employment tribunal fines for employers demonstrated to have shown malice, spite or gross oversight will increase from £5,000 to £20,000.\nMeasures will also be taken to ensure that seasonal workers get the paid time off they are entitled to.\nBusiness Secretary Greg Clark said: “The UK has a labour market of which we can be proud. We have the highest employment rate on record, increased participation amongst historically under-represent groups and wages growing at their fastest pace in almost a decade. Business Secretary Greg Clark (Image: Getty Images Europe)\n“This success has been underpinned by policies and employment law which strikes an effective balance between flexibility and worker protections but the world of work is changing, bringing new opportunities for innovative businesses and new business models to flourish, creating jobs across the country and boosting our economy.\n“Today’s largest upgrade in workers’ rights in over a generation is a key part of building a labour market that continues to reward people for hard work, that celebrates good employers and is boosting productivity and earning potential across the UK.” Read More Tolent Living to build 148 homes in Newcastle as part of £20m contract\nThe Government said it was taking forward 51 of the 53 recommendations made by Matthew Taylor in his review into employment, especially in the so-called gig economy .\nThe measures have received a cautious welcome from business groups, though unions say they do not go far enough.\nMatthew Fell, CBI chief UK policy director, said: “Work that’s flexible and fair is essential to the success of the UK’s labour market.\n“Focusing on issues like employee engagement, fairness and inclusion boost productivity as well as being the right thing to do.\n“Businesses support a strong floor of workplace rights, and it’s right that these laws keep pace with changes in the economy and society.”\nFederation of Small Businesses chairman Mike Cherry said: “Any future consideration of employment and tax status alignment must not hinder the flexibility of our labour market or stifle the genuinely self-employed entrepreneurs that push our economy forward. TUC general secretary Frances O’Grady (Image: Daily Mirror)\n“The risks taken by sole traders, and the dynamism they provide, must be properly recognised and rewarded. Clarifications of employment status, in law, need to be undertaken with great care to avoid unintended consequences for the genuinely self-employed.”\nBut TUC general secretary Frances O’Grady said: “Scrapping the agency worker loophole is a victory for union campaigning. It was an ‘undercutters’ charter’.\n“But these reforms as a whole won’t shift the balance of power in the gig economy. Read More Gateshead tech firm wins £10m NHS contract and creates 10 new jobs\n“Unless unions get the right to organise and bargain for workers in places like Uber and Amazon, too many working people will continue to be treated like disposable labour.\n“The right to request guaranteed working hours is no right all. Zero-hours contract workers will have no more leverage than Oliver Twist.”\nAnd Rebecca Long Bailey, shadow business secretary, said: “This Conservative Government has failed to support workers. Instead it has increased tribunal fees, attacked the health and safety of workers, introduced the draconian Trade Union Act and presided over the lowest wage growth in a decade.\n“These proposals do nothing to tackle the growing number of people on precarious zero hours contracts and with their botched Brexit deal threatening jobs and rights they’ll have to do a lot more than this to reassure workers.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-17T16:12:00.000+02:00", "crawled": "2018-12-17T20:14:27.023+02:00", "highlightTitle": ""}