{"organizations": [], "uuid": "75ebc20ed76303a77720435ef80d8bc4b369535b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14760040.ece/ALTERNATES/s1200/Breaking-News-Graphic-Live-Blog-Smaller.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15523984", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-09T11:00:00.000+02:00", "replies_count": 0, "uuid": "75ebc20ed76303a77720435ef80d8bc4b369535b"}, "author": "Sonia Sharma", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15523984", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [], "locations": [{"name": "metro", "sentiment": "none"}, {"name": "tynemouth", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "st james", "sentiment": "negative"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Flood warning for North East coast due to high tides\nA flood warning has been put in place along the coast in North Tyneside and Sunderland because of high tides and strong winds this afternoon.\nThe warning, from the Environment Agency, says that “flooding is expected” and “immediate action” is required to safeguard members of the public along the seafront.\nTides are expected to be at their highest between 3.45pm and 5.45pm today.\nThe areas affected will be Whitley Bay , Cullercoats, Tynemouth, and Roker in Sunderland .\nA spokesman said: “Large and powerful waves are expected to overtop sea defences as a result of high spring tides and strong winds.\n“Areas most at risk are properties including Whitley Sands Refreshment Kiosk, Robinson Crusoe’s Café at Tynemouth Longsands, Tynemouth Sailing Club and the area at Cullercoats Bay around the Lifeboat Station and the Dove Marine Laboratory.\n“Coastal conditions are expected to continue until after the high tides at 5.45pm at the above locations.\n“We are closely monitoring the situation. Please be careful along beaches, promenades, coastal footpaths and roads as large waves and sea spray could be dangerous.”\nIn addition, a flood alert is also in place for the Northumberland coast, warning that “flooding is possible” at beaches, promenades, coastal footpaths and roads. (Image: newcastle chronicle) 14:57 From Brexit to a second referendum: Theresa May answers YOUR questions\nPrime Minister Theresa May has told ChronicleLive readers that her Brexit deal delivers on the North East’s overwhelming “Leave” vote in the 2016 referendum.\nShe insisted there was no question of the UK staying in the EU after March 29 next year, if her deal is approved.\nAnd she endorsed comments from one reader who said her Tory critics such as Jacob Rees-Mogg had failed to come up with any alternative plan for Brexit.\nThe Prime Minister said: “It’s nice to hear someone point this out. I do believe that my deal is the only credible plan on the table.\n“It is easy to make suggestions from the sidelines but negotiating day in and day out is a different matter altogether.”\nMrs May was responding to questions provided by ChronicleLive readers as she faced a day of reckoning in the House of Commons.\nThey sent their questions to us, and we passed them on to Number 10.\nHere are the full questions and answers. 14:43 Former England cricketer Ryan Sidebottom on his Dancing on Ice 'journey'\nFormer England cricketer Ryan Sidebottom hopes Dancing on Ice fans enjoy watching his journey as he transforms into a figure skater.\nThe 40-year-old ex-Yorkshire bowler spent this morning skating at Newcastle’s Centre for Life, as he prepares to take part in the 2019 ITV series alongside the likes of Richard Blackwood, Gemma Collins and Westlife’s Brian McFadden.\nRyan says he had never skated before in his life before accepting the challenge, and his still taking tumbles every day in training.\nRead the full story here Ryan Sidebottom at the Life Science Centre (Image: newcastle chronicle) 14:18 The royal family Christmas tradition Meghan Markle will experience for the first time\nIt will be her first Christmas as part of the royal family - and now Meghan Markle knows what to expect.\nThe Duchess of Sussex and husband Prince Harry are set to join the Queen at Sandringham in Norfolk for the royals’ big festive celebrations.\nAs well as attending a service at St Mary Magdalene Church and eating a large Christmas dinner, the royal family will gather around the television to watch the EastEnders Christmas special , as well as the Queen’s Speech.\nA family insider told The Sun : “The Queen loves EastEnders, and every Christmas, without fail, the telly goes on and the strains of the show’s distinctive theme tune bellow out.\n“It is an unlikely family tradition, and non-negotiable - even more so than watching the Queen’s speech! Obviously a couple of jokes have already been made about switching on the subtitles this year.”\nRead more about this story here 13:53 KEY EVENT Traffic congestion on St James Boulevard\nTraffic is quite heavy in Newcastle city centre this afternoon as fans make their way to St James’ Park for the Newcastle United vs Wolves match.\nBe prepared for delays if you’re heading in that direction. 13:47 \"Under Mike Ashley, Newcastle United is in danger of losing its soul\"\nNewcastle United is in “danger of losing its soul” if Mike Ashley remains in charge at St James’ Park , according one the country’s most respected journalists.\nThe Times’ Henry Winter spoke to Robbie Savage on BBC 5 Live about the state of United, and the prospect of a new owner coming into replace the Sports Direct founder.\nAshley took to Sky News last week to reveal that talks to sell the club were “more progressed” than ever before, and news then broke that Peter Kenyon was leading the race - against three other potential buyers - for the club.\nIt is believed that Kenyon is heading up a consortium made up of American businessmen, and he is a currently at the ‘date room’ stage of negotiations.\nWinter was asked about the potential sale, and backed Kenyon to turn the club around.\n“Mike Ashley has to sell Newcastle United - the fans need an owner who cares.\n“St James’ Park is a fabulous place to go; that amazing walk up from the station, all the fans going up there, all the excitement.\n“But unfortunately under Mike Ashley, Newcastle United is in danger of losing its soul.”\nRead the full article here Peter Kenyon (left) and Mike Ashley (Image: 2014 AFP) 13:36 Nightclub, distillery and roof terrace plan for historic building\nIt was last used as a bar and nightclub over 10 years ago - but now a historic Stockton building is set for a new lease of nightlife.\nColumbia House, an empty Grade II* listed building on Church Road, Stockton , was last used as the Bo Jangles bar/club more than 10 years ago.\nBut now developer Jomast has been granted listed building consent by Stockton Council to revive the building.\nAnd the scheme, to create a pub, restaurant, distillery, managers’ flat and roof terrace, has been backed by Historic England, which calls it “a positive improvement”.\nRead more about the plans here The former Columbia House (Image: Teesside Live) 13:20 Traffic builds up around Newcastle city centre\nIt’s looking quite busy on roads heading to and from Newcastle city centre.\nAmong those affected is the A193 New Bridge Street, between Byker and the Central Motorway. 13:14 Swan causes flutter on Tyne Bridge\nA swan caused a bit of a flutter on the Tyne Bridge today.\nNorthumbria Police were made aware of the bird on the footpath of the bridge at around 12.30pm and advised people to “pass slowly and with care” as they worked with the RSPCA to try and have it safely removed.\nThe carriageway and footpath remained open during this time.\nNow the police have confirmed that the swan has been safely taken away. 13:00 \"Wallsend is not a lost cause\"\nBusinesses in Wallsend have vowed to help improve the town centre and insist it’s “not a lost cause”.\nLast week we reported what people on the High Street felt about the town and highlighted a number of issues, including the effect of online shopping on retailers and the number of empty units in the area.\nIt was also said there were too many takeaways in and around the town centre.\nNow Wallsend Chamber, which was set up as a voice for the business community in June and has more than 140 members, has told about the efforts being made to support the town.\nThey say the centre is having difficulties similar to other high streets across the country, however it is still in a better position than many.\nThe area has a 12% vacancy rate, which means almost 90% of the high street is occupied.\nRead about their efforts here Wallsend high Street (Image: Newcastle Chronicle) 12:43 Sambuca to open in Eldon Garden shopping centre\nThe owners of a Newcastle shopping centre which faced closure say plans to breathe new life into the centre are now under way.\nEarlier this year Peer Group said its major city centre asset Eldon Garden was running on borrowed time, with just a handful of commercial operators left in it and the centre more than 85% empty.\nThe group blamed the centre’s decline in part on decisions by Newcastle City Council which it said made it harder for shoppers to use the Eldon Garden car park, which have since been exacerbated by the recession and a crisis in the retail sector which has seen high streets around the country battle to survive.\nNow, however, following a meeting with council leader Nick Forbes and chief executive Pat Ritchie to discuss a rescue plan, the group has embarked on a strategy to entice new retailers by offering units rent free for around a year.\nAnd the strategy is already bearing fruit with Peer Group managing director Howard Dawson announcing that restaurant operator Sambuca will open in the centre before Christmas.\nRead more about the plans here Sambuca on Newcastle Quayside (Image: Newcastle Chronicle) 12:28 Former gangster Paul Ferris reveals all about special bond with Sayers brothers in prison\nLocked up together in the North East’s toughest jail, gangster Paul Ferris and Tyneside’s notorious Sayers brothers formed a special bond.\nThe Scottish reformed criminal was this week reunited with his former jail pal Stephen Sayers during a trip to Newcastle to launch his new book.\nUnfinished Business: Putting the Conspiracy to Rest has been penned with Tyneside-based writers Steve Wraith and Stu Wheatman.\nNow Ferris, who turned his back on crime and became an author, has revealed how he would never have been able to write his first book without the help of North East prisoners in HMP Frankland and Stephen, who served time at the high security jail at the same time.\nAnd the 55-year-old has told how the friendship formed behind bars has stood the test of time, even after he and Stephen went straight.\nRead his full interview here Paul Ferris and Stephen Sayers (Image: newcastle chronicle) 12:13 Dog owner's warning after pet eats rat poison\nAnimal-lover Kerry-Anne Richardson is warning dog owners to be extra vigilant after her pet ate rat poison when out on a walk.\nBagel the beagle was out with Kerry-Anne’s fiance Phil Wallace when he saw the pooch eat what looked like pearls of barley.\nBut quick off the mark, Phil spotted discarded rat poison packaging and rushed Bagel to the vets.\nNow, Kerry-Anne is warning other pet owners and is asking them to stay vigilant.\n“Luckily we got Bagel to the vets and they induced vomiting to get all the poison out,” said Kerry-Anne, 36, of Longbenton , North Tyneside .\n“He is back on the road to recovery but if he had eaten enough of the poison he could have died. We are wanting to warn other dog owners to be extra careful as we don’t want any other dogs to go through this.”\nRead the full story here (Image: Newcastle Chronicle) KEY EVENT Pensioner pushed to the ground during alleged robbery\nDetectives have launched an investigation after a pensioner was pushed to the ground for his money.\nOfficers in County Durham received a report of a robbery after the 83-year-old was approached by a man demanding cash.\nA struggle between the victim and the suspect ensued before the pensioner was pushed to the ground.\nThe incident took place in Rennie Street, Ferryhill , at 9.50pm yesterday.\nIt is believed the elderly man was followed from the nearby Post Office cash machine, in the Market Place, after he had withdrawn some money.\nThe suspect was in his late 20s, 6ft tall, of slim build and wearing a jacket with fur around the hood. He was last seen walking off towards the Dean Bank Estate, in Ferryhill.\nThe victim, who was walking his dog at the time, suffered a minor hand injury.\nAnyone who saw the victim or the suspect, or has any information about the incident, is asked to call Durham Constabulary on 101, quoting reference number 510 of December 8. (Image: Manchester Evening News) 11:27 Fashionista remembers designing outfits for Spice Girls - after originally turning them down\nThe announcement of next year’s Spice Girls tour has sparked fond memories for a costume lecturer at The Northern School of Art.\nJane Havakin designed outfits for the group when they first started out and watched with pride as they wore them on Top of the Pops.\nThe five-piece band, made up of Sporty, Scary, Baby, Ginger and Posh Spice, also sported outfits created by Jane in a promotional poster for HMV.\nNow programme leader of the school’s Costume Interpretation with Design degree at its campus in Hartlepool , she remembers first meeting the singers before they were famous, just before they had their first number one hit with ‘Wannabe’ in 1996.\nThey approached her to borrow outfits she was showing at a fashion trade event.\n“I turned them down to start with,” Jane said.\nClick here to find out what happened next. Spice Girls (left to right) Melanie Brown, Melanie Chisholm, Emma Bunton and Geri Horner. (Image: Matt Crossick/PA) 11:15 Passengers could face severe disruption as bus drivers strike\nA planned bus driver strike is set to cause disruption to services in the run up to Christmas.\nDrivers in the Unite trade union working for Arriva have voted to go on strike for seven days from Sunday, December 16, over a call for a £1-an-hour pay rise.\nThe decision was backed by drivers at depots in Redcar, Stockton, Whitby, Darlington and Durham last month.\nWhile it was hoped a deal could be brokered, talks broke down between Arriva management and trade union representatives at a meeting this week.\nNow, Durham County Council bosses have stated they’re preparing for disruption if the strike goes ahead.\nThe full story is here Durham County Hall (Image: Copyright Unknown) 11:03 Teesside vegan store nominated for national award\nTeesside’s first vegan convenience store has been nominated for a prestigious national award just six months after opening.\nThe Little Vegan Market, in Middlesbrough’s Dundas Market, inside the Dundas Arcade, is in the running to be named the best small business in the Vegan Food UK Awards 2018.\nRun by Matthew Wilson and Charlotte Bottomley, the shop sells a wide range of alternatives to meat, milk, cheese and egg and also specialist products - such as jackfruit, which can be used to make vegan pulled pork.\nOn the day it opened, customers queued to get in and the shop sold out of beans and sausages before the end of trading.\nThe pair started the business because they found it difficult to buy vegan products in the area.\nRead more about the store here Matthew Wilson, 23, and Charlotte Bottomley, 24, have launched The Little Vegan Market inside the Dundas Shopping Centre (Image: evening gazette) 10:52 Beauty queens' remarkable gesture to help those sleeping rough\nHaunted by how many homeless are sleeping rough in Newcastle , big-hearted mum and daughter team Gemma and Kristen Evans hit the streets to help those in need.\nThe caring pageant queens are proving they are beautiful inside and out as they give Greggs gift cards and clothing to those who need support.\nAnd they swapped the catwalk to pounding the pavements as they arrived in the city on a busy Saturday to give their early Christmas presents to those who haven’t got a permanent roof over their heads.\nRead their story here 10:40 Woman 'pulled from car' in alleged carjacking\nDetectives are appealing for witnesses after a woman was allegedly dragged from her car while waiting at traffic lights.\nThe shocking incident happened at 11.23pm on December 7 in Washington .\nTwo men are in custody and are being questioned by police officers.\nNorthumbria Police say the female was sitting in her Vauxhall car at a set of lights when two men walked up to her vehicle and pulled her out.\nShe attempted to prevent them stealing the car by climbing onto the bonnet but two men made off in her car and she suffered leg injuries as a result.\nRead the full story here (Image: Manchester Evening News) 10:28 What people REALLY think of life in Stanley\nIt hit the headlines for all the wrong reasons when a group of teenagers attacked police officers.\nStanley residents were left outraged after Durham Constabulary released shocking footage of their officers being punched after responding to reports of a vulnerable woman.\nThe bus station has been one of the main places that large groups of youths have gathered.\nBut what is life really like in Stanley? Do people feel safe going out on the streets?\nHere’s what people had to say. Stanley bus station (Image: Newcastle Chronicle) 10:18 Scores of families head to Victorian Christmas Market\nDid you go to the North Shields Victorian Christmas Market yesterday?\nThe annual event attracts thousands of people and this year is no exception.\nIf you haven’t been yet, it is on again today from 10am to 4pm.\nNorthumberland Square is packed with over 100 stalls offering gifts, crafts, food and drink. And there’s also a Santa’s Grotto.\nClick here to see some great pictures from yesterday’s market. (Image: Newcastle Chronicle) Today's weather forecast\nThe sun is out and we are likely to see sunshine all day.\nBut temperatures are low so we still need to wrap up warm. The mercury is unlikely to go above 5-6C, and will drop to 1C overnight.\nWeather forecasters say: “It’s a dry, bright and chilly start. Through the day, conditions will remain largely unchanged.” (Image: Newcastle Chronicle)", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15523984;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-09T11:00:00.000+02:00", "crawled": "2018-12-09T11:30:35.038+02:00", "highlightTitle": ""}