{"organizations": [], "uuid": "092914a6c22b56a5bb0a68cb168a83214035a752", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15466982.ece/ALTERNATES/s1200/2_may-brexit.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-brexit-backstop-everything-you-15532796", "country": "GB", "domain_rank": 21960, "title": "What is the Brexit backstop? Everything you need to know about the Irish border issue", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T19:36:00.000+02:00", "replies_count": 0, "uuid": "092914a6c22b56a5bb0a68cb168a83214035a752"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-brexit-backstop-everything-you-15532796", "ord_in_thread": 0, "title": "What is the Brexit backstop? Everything you need to know about the Irish border issue", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What is the Brexit backstop? Everything you need to know about the Irish border issue Many MPs are worried about the \"backstop\" in Theresa May's proposed Brexit agreement, but what does that mean? Share Prime Minister Theresa May speaks at a press conference after attending a special session of the European Council over Brexit on November 25, 2018 in Brussels, Belgium Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTheresa May has cancelled the Brexit vote because she fears she would lose.\nAnd she said the main concern many MPs have is about the “backstop”.\nBut what is the backstop?\nWhat was the plan for the Irish border?\nA backstop solution aims to prevent the establishment of a hard border on the island after Brexit .\nIt would mean some regulations relating to Northern Ireland remain aligned with the rest of the EU.\nIt is an insurance policy if no answer can be found through a permanent trade deal after a transitional period from next March but unionists fear it could create regulatory disparity between Northern Ireland and the rest of the UK. Read More\nThe backstop has been a focus of discontent with Mrs May’s draft Withdrawal Agreement with Europe.\nFollowing the delay to the Commons vote, its future is uncertain.\nWhat exactly does the backstop propose?\nOnce the Brexit transition period ends in December 2020, the EU and the UK have agreed the backstop would apply until such a time as a subsequent agreement is in place.\nThis would create a single EU-UK customs territory avoiding the need for tariffs, quotas or checks on rules of origin between the EU and the UK. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nNorthern Irish businesses would not face restrictions when placing products on the EU’s Single Market.\nMrs May says that the backstop is only included in her Withdrawal Agreement as a last resort, and if it ever was introduced then it would be temporary.\nBut some Conservative MPs say they fear it would become a permanent arrangement, and the UK would be forced to obey EU rules forever.\nSo the Prime Minister will now ask the EU to provide further reassurances about the backstop.\nWhat has been the Irish Government’s reaction to the decision to defer a vote?\nIrish Taoiseach Leo Varadkar has said it is not possible to renegotiate the backstop without reopening all aspects of the draft withdrawal treaty. Read More\nDublin is keen to ensure a free-flowing border to protect the peace process and north-south trade links.\nWhat has been the DUP’s reaction?\nDeputy leader Nigel Dodds said the vote delay was a “humiliation” Mrs May had brought on herself while Arlene Foster said the Prime Minister must get rid of the backstop.\nThe DUP is concerned remaining aligned to Europe would create a regulatory divergence between Northern Ireland and the rest of the UK, requiring extra checks on east-west trade and threatening the integrity of the UK as a whole. Read More\nWhat have Remain voices in Northern Ireland said about the backstop?\nFour pro-Remain parties in Northern Ireland including Sinn Fein and the nationalist SDLP have declared it should be “banked” rather than discarded to protect the 1998 Good Friday Agreement.\nThey said a no-deal Brexit would be “catastrophic”.\nWhat happens now?\nA meeting of European leaders is planned for later this week and they will be demanding answers from Mrs May, with Europe showing no willingness to reopen months of delicate negotiations.\nThe Prime Minister said the risk of an accidental no agreement increased the longer it took to pass a deal. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-10T19:36:00.000+02:00", "crawled": "2018-12-10T19:51:17.041+02:00", "highlightTitle": ""}