{"organizations": [], "uuid": "627f3fc89996034ac5f8060b622a02c96ad7a322", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article2296039.ece/ALTERNATES/s1200/0_facebook-1903445_1920.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/trading-standards-monitoring-facebook-selling-2295906", "country": "US", "title": "Trading Standards monitoring Facebook selling groups for fake goods - Cornwall Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.601, "site_type": "news", "published": "2018-12-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "627f3fc89996034ac5f8060b622a02c96ad7a322"}, "author": "Max Channon", "url": "https://www.devonlive.com/news/devon-news/trading-standards-monitoring-facebook-selling-2295906", "ord_in_thread": 0, "title": "Trading Standards monitoring Facebook selling groups for fake goods - Cornwall Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "invalid email devon", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Trading Standards monitoring Facebook selling groups for fake goods Buying-and-selling groups on social media are being urged to sign up to a five point ‘fake-free’ pledge in the lead up to Christmas Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nDevon, Somerset and Torbay Trading Standards Service is keeping a close eye on social media buying-and-selling groups in the lead up to Christmas in a bid to stem the sale of fake goods online.\nLocal law-abiding buying-and-selling groups are encouraged to work with Trading Standards and sign up to a five point ‘fake-free’ pledge.\nThey will then be entitled to display a Real Deal logo, a visual assurance to shoppers and traders that their group is a ‘fake-free’ shopping zone. It’s part of the Real Deal Online programme, a nationwide initiative aimed at protecting local consumers and small businesses from the harm caused by the pernicious trade in fake goods.\nFrom now until Christmas, trading standards officers will be identifying buying-and-selling groups in communities across Devon, Somerset and Torbay.\nThey will contact the administrators of each group to make them aware of their legal responsibilities in not promoting the sale of counterfeit goods and other illicit products and they will invite them to follow the Real Deal Online Code of Practice. Read More Johnny Mercer MP says he has 'no idea' how he'll vote on Brexit Deal\nThose who sign up will be invited to work closely with trading standards to help identify and stamp out any illicit or illegal trade they encounter. To date they have contacted 56 administrators who cover 25 of the largest buying-and-selling Facebook Groups. Collectively these groups have over 460,000 members.\nThe Code of Practice asks group administrators to welcome trading standards officers as members of the group and to agree to the five simple steps. Ban the sale of counterfeit and other illicit goods within their group Act on information they receive that goods on their site are illegal Notify trading standards if they suspect that illegal goods are being sold within the group Exclude the sellers from trading Highlight warnings and advice notices from trading standards and to ensure that all members of the group are aware of its ‘fake-free’ policy.\nThe initiative is an extension of the Real Deal campaign which has been in place at ‘physical’ markets and car boot sales for nearly ten years. Almost 500 markets across the UK have signed up to the voluntary Real Deal Charter.\nSharon Anderson, Group Manager, Devon, Somerset and Torbay Trading Standards Service said: “Online and social media marketplaces are not uniformly regulated, and they can offer easy opportunities for those who wish to stay below the radar and trade illegally.\n“The Real Deal Code of Practice and the logo will not only reassure consumers that a group is a safe place to buy and sell it also sends a strong message to counterfeit con men who sell unsafe or illegal products that they are not welcome and they will be reported.” Read More School Nativity photography and filming laws for parents explained\nCouncillor Rufus Gilbert, Devon County Council’s Cabinet Member responsible for economy and trading standards said: “We are committed to ensuring that residents, legitimate businesses and the wider community are protected from the harm caused by the trade in fake and dangerous goods.\n“It is vital that illicit traders, who believe they can make easy money by ripping off consumers with illegal, sub-standard and often dangerous counterfeits, are deterred at the earliest stage.\n“Introducing this programme demonstrates that our trading standards officers are actively seeking out anyone advertising fake goods for sale locally on social media and will act against them. Social media no longer offers an easy hiding place for those attempting to trade illegally.” Want more news?\nTo keep up to date with Plymouth Live's latest news, follow us on Facebook here and Twitter here , or visit our homepage at www.plymouthlive.com\nFor Devon news, find Devon Live's Facebook page here , or our Twitter page here , or visit our homepage at www.devonlive.com\nFor Cornwall news, find Cornwall Live's Facebook page here , or our Twitter page here , or visit our homepage at www.cornwalllive.com Like us on Facebook ", "external_links": [], "published": "2018-12-05T02:00:00.000+02:00", "crawled": "2018-12-05T19:36:59.007+02:00", "highlightTitle": ""}