{"organizations": [], "uuid": "fbeebe99c9b50b286d4596e724dc19aaabb900c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15510006.ece/ALTERNATES/s1200/0_trio.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-north-tyne-mayor-election-15533427", "country": "GB", "domain_rank": 21960, "title": "Labour in disarray over North of Tyne mayoral race as party bosses demand fresh blood", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T10:00:00.000+02:00", "replies_count": 0, "uuid": "fbeebe99c9b50b286d4596e724dc19aaabb900c3"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-north-tyne-mayor-election-15533427", "ord_in_thread": 0, "title": "Labour in disarray over North of Tyne mayoral race as party bosses demand fresh blood", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "news labour", "sentiment": "negative"}, {"name": "invalid email labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour in disarray over North of Tyne mayoral race as party bosses demand fresh blood With no current candidate enjoying universal support, Labour bosses have demanded the nomination process be reopened to encourage female and non-white candidates to come forward Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nLabour's efforts to find a potential North of Tyne mayor have been cast into uncertainty as party bosses demand the search for a candidate is broadened.\nAll of the main parties are looking for someone to stand in the inaugural May 2 election , but Labour appears to be divided over who should run for the party.\nThe party has announced it is reopening the process to encourage more people to self-nominate - just three weeks after it formally closed - in a bid to find female and non-white candidates.\nUnder party rules, candidates have to put themselves forward and win enough support within the party to have a chance of being shortlisted for a members vote.\nBut Labour bosses have insisted the nomination process be reopened after the initial round of self-nominations produced an all-male list of candidates. Councillor Jamie Driscoll; Labour MEP Paul Brannen and Newcastle City Council leader Nick Forbes\nAt present, Newcastle council leader Nick Forbes , North East MEP Paul Brannen and Momentum-affiliated councillor Jamie Driscoll are the only candidates in the internal race after former North Tyneside cabinet member Ian Grayson dropped out.\nBut the news the party wants fresh blood in the race heaps pressure on all three and raises questions over their chances of winning the backing of the party from top to bottom. Read More\nAll three candidates have spent the last few weeks vying for position and attempting to secure support from local groups.\nBut ChronicleLive understands support from constituency Labour parties and trade unions has been split.\nIt's unclear who is likely to put themselves forward now the nomination process is reopen and party insiders are at a loss as to who could join the race as a viable candidate. Read More Does Labour and party leader Jeremy Corbyn support Brexit?\nA Labour Party spokesperson said: \"The Labour Party has a proud tradition of encouraging diversity among its elected representatives, especially in the North.\n\"Our process to select a candidate for Mayor has been extended to allow the opportunity for more candidates to put themselves forward.\n\"The chosen candidate will be announced in due course.\" Read More North of Tyne mayor: All the election candidates, dates and key information\nIt's also unclear precisely where the pressure to reopen nominations came from within the party.\nHowever, the founder of Momentum, the organisation set up to support leader Jeremy Corbyn , Tweeted his dismay at the absence of female candidates being presented to members when ChronicleLive revealed the list last month.\nOn November 29 he posted: \"Labour elected mayors are almost all men.\n\"We should be shocked therefore that there is now an all-male shortlist for the North of Tyne mayor.\n\"That should not be allowed anywhere in our party.\"\nNo party has announced their candidate yet for the May 2 election but an announcement from the Conservatives and Liberal Democrats is expected before the end of January. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-12T10:00:00.000+02:00", "crawled": "2018-12-12T12:25:02.021+02:00", "highlightTitle": ""}