{"organizations": [], "uuid": "85cc05bc2e69381e7a854ef93b7400e08b664544", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article1442885.ece/ALTERNATES/s1200/1_BD3A9F7C-CF5A-D22C-EA6E08A439708E63.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15570468", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Virgin Atlantic mulls Flybe takeover deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T10:10:00.000+02:00", "replies_count": 0, "uuid": "85cc05bc2e69381e7a854ef93b7400e08b664544"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15570468", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Virgin Atlantic mulls Flybe takeover deal", "locations": [], "entities": {"persons": [{"name": "fletcher", "sentiment": "none"}], "locations": [{"name": "virgin atlantic", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "formica", "sentiment": "none"}, {"name": "coast road", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "fletcher building", "sentiment": "none"}], "organizations": [{"name": "coreena ford formica in north shields", "sentiment": "negative"}, {"name": "formica group", "sentiment": "none"}, {"name": "fletcher building", "sentiment": "none"}, {"name": "formica group europe", "sentiment": "none"}, {"name": "broadview holding bv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Formica in North Shields is sold to Dutch firm as part of £660m deal\nFormica in North Shields has new owners after being sold by its New Zealand owners as part of a deal worth more than £660m.\nFletcher Building has owned Formica Group Europe, including the Coast Road factory, for 11 years and has made numerous improvements to the North East operation - including a multimillion-pound renovation of the building which was completed last year.\nNow, however, Fletcher has announced it has entered into an agreement to sell the Formica Group of companies to Broadview Holding BV, headquartered in the Netherlands, for $840m (£664m), on a cash-free and debt-free basis.\nThe sale comes just over a year after Fletcher Building vowed to invest £40m into the Coast Road site over three years - and eight months after the group was put up for sale so the Auckland-headquartered firm could focus on business closer to home.\nThe initial sale announcement led to concerns among the 500-plus workforce at the aminate manufacturer’s regional base, which is also the European headquarters for Formica, but it is understood investment will continue as planned and it is business as usual at the factory.\nIt is not yet known, however, if Broadview Holding will want to rebrand the Formica factory. Peter Rush, President and CEO of Formica, at its headquarters in North Tyneside (Image: Newcastle Journal) 8.57 Coreena Ford Plan to demolish offices and build student housing in Newcastle is revealed\nDevelopers have launched plans to demolish an empty office block in Newcastle and replace it with a new student accommodation scheme .\nEastgate House forms part of the former King’s Manor Central Business and Technology Park, where hundreds of people worked in the 1990s.\nMost of the offices in that area, close to Manors Metro station, now lie empty, prompting plans to regenerate the area by replacing the old offices with new student housing buildings.\nThat plan is already moving forward with planning approval granted to flatten a number of buildings – including Clough House, Manor View House and Technopole – and turn them into student flats, creating a student village close to universities and colleges and freeing up residential homes in the city’s suburbs.\nNow Newcastle developer Adderstone Group, which has driven plans for a number of student schemes in the city, has developed proposals for Eastgate House at the Manors Business Park, which would see the demolition of the outdated building and creation of a new seven and eight-storey high student accommodation building.\nRyder Architecture has been enlisted to apply for planning permission, submitting documents which show how the scheme would look. How the Eastgate House student housing scheme would look in Newcastle (Image: newcastle planning portal - Ryder Architecture) 8.50 Coreena Ford Wetherspoon chairman writes to every MP over customs union\nThe chairman of pub chain Wetherspoon is writing to every MP to highlight how the customs union works, claiming many politicians have “no knowledge” of how the system operates.\nTim Martin, a strong supporter of Brexit, said some MPs appeared to have no idea about the basic mechanics of the customs union and the EU tariff system. He said:\nThe customs union is an undisguised protectionist system that imposes import taxes on 12,651 non-EU imports, including oranges, rice, bananas and children’s clothes and shoes.\nThe customs union pushes up prices for consumers and the tariff income is collected by the UK Government and is sent to Brussels.\nIt is worrying that MPs have no knowledge at all as to how the customs operates and how it costs their constituents every day. Wetherspoons owner Tim Martin debating Brexit with his customers at the Mile Castle pub in Newcastle (Image: Newcastle Chronicle) 8.45 Coreena Ford Bank of England must transform back office, says watchdog\nThe Bank of England made £10m of purchases without following proper procedures and has 800 desks sitting empty at its Threadneedle Street offices, an inquiry into its costs has revealed.\nA probe by the National Audit Office (NAO) unearthed 200 purchases above £25,000 that were made without staff consulting the Bank’s central procurement team in the year to December 2017.\nThe spending watchdog said savings of up to £200,000 could have been made on £2m of these purchases.\nThe NAO report also found that 800 desks are allocated but sitting empty at the Bank’s headquarters on any given day, while it has more than 700 job titles, which it said is creating unnecessary complexity.\nThe report comes less than a week after the Bank announced changes to its expenses policy after MPs slammed “staggering” costs run up by officials, including more than £11,000 spent on one flight.\nThe NAO said the Bank would need to “transform” the way it operates the central services function to continue meeting its self-imposed target to cap annual costs at £476m. Bank of England in London (Image: PA) 8.36 KEY EVENT Ignite boss criticises Newcastle City Council for lack of focus on tech sector\nNewcastle is “operating so far behind where a city of our potential should be”, according to a leading figure in the North East’s tech scene .\nTristan Watson, CEO of the Ignite accelerator, hit the headlines a year ago when he wrote a blog entitled “Newcastle is failing tech entrepreneurs” and called for more support to be given to innovative businesses.\nA year on, he has re-visited his original message with a “2018 report card” which outlines how the city’s tech scene has changed over the year.\nIn the article, Mr Watson claims that although the city has benefited from the arrival of the Jeremie 2 funds and additional co-working space, Newcastle is still suffering from a lack of leadership.\nHe said: “It is great we have the Jeremie 2 funds online, it is really essential for the city but that is only one piece of the puzzle. The challenge is having enough high quality companies to invest in over the next five years. We have a challenge to grow and scale those companies.\n“At the moment there is no alignment between public sector, private sector and higher education, and all that needs to come from an over-arching strategy we can get behind. It means when people start to go off course someone can grab them and pull them back in the right direction.\n“While I have a lot of support for the council, what we don’t have is clear leadership in this sector. They have put out a number of strategies over the years with great aims but with no tangible action.” Tristan Watson, CEO of Ignite (Image: Ignite) 8.32 Coreena Ford Watchdog recommends price caps to end £4bn consumer rip offs\nThe competition watchdog has laid down a set of radical reforms to the way the insurance, mortgage, mobile phone and broadband markets operate after finding that loyal customers are being ripped off to the tune of £4bn.\nFollowing a ‘super complaint’ by Citizens Advice, the Competition and Markets Authority investigated concerns that companies penalise existing customers by charging them higher prices than new customers.\nIt found that consumers in those markets, as well as in cash savings, are “exploited” and face a “loyalty penalty” of around £4bn a year.\nIt also found that vulnerable people, including the elderly and those on a low income, may be more at risk of paying the loyalty penalty.\nThe CMA’s probe uncovered “damaging practices” by firms, including continual year-on-year stealth price rises; costly exit fees; time-consuming and difficult processes to cancel contracts or switch to new providers; and requiring customers to auto-renew or not giving them sufficient warning their contract would be rolled over.\nThe CMA is recommending government and regulators crack down on harmful business practices using enforcement powers, stating clearly the principles businesses should follow and holding firms publicly to account for their actions.\nMost radically, it also suggests that “targeted price caps” should be put in place to protect the people worst hit. Money (Image: Chris Radburn/PA Wire) 8.25 Coreena Ford Bealim House and Mushroom owner hints it could open new bars in Toon\nOne of Newcastle’s biggest leisure companies has hinted it could open more bars in the city after selling off properties to free up cash.\nVaulkhard Group already owns a host of bars and coffee shops in Newcastle, including Mushroom, Perdu, Barluga, Bealim House, Blake’s and Central Bean, as well as the Newcastle Gin Co.\nHowever, the company said it could look to boost its profit figures by acquiring more sites over the next year.\nSpeaking in the company’s accounts, director Oliver Vaulkhard said: “The group has made significant investment property disposals after the balance sheet date.\n“This is expected to provide sufficient resources to add to the number of licenced premises in the coming year within the leisure business, which will improve the EBITDA of the group.”\nVaulkhard Group generated £10.5m in turnover during the year ending March 31, an increase of around £46,500 compared with 2017.\nThe firm’s EBITDA increased from £918,000 to £985,000.\nHowever, profit after tax fell from £608,000 to £566,000.\nTurnover generated from the group’s leisure division fell 2% but this was offset by growth in other areas. Bealim House in Newcastle (Image: Newcastle Chronicle) 8.22 Coreena Ford Staff to be impacted by Glaxo-Pfizer deal\nIn media call following the announcement, Glaxo chief executive Emma Walmsley said there will be an impact on staff following the deal, but said it was too early to give details.\nShe said:\nObviously there’s going to be some impact on people.\nThat’s something we are working through and we will certainly be talking to our employees before we start talking about that in any way publicly. 8.19 Coreena Ford GSK CEO welcomes tie-up\nHere’s what Emma Walmsley, chief executive of Glaxo, had to say about this morning’s announcement:\nThrough the combination of GSK and Pfizer’s consumer healthcare businesses we will create substantial further value for shareholders.\nWith our future intention to separate, the transaction also presents a clear pathway forward for GSK to create a new global pharmaceuticals/vaccines company, with an R&D (research and development) approach focused on science related to the immune system, use of genetics and advanced technologies, and a new world-leading Consumer Healthcare company. 8.17 Coreena Ford GSK agrees tie-up with Pfizer ahead of spin-off\nBritish drugs giant GlaxoSmithKline has agreed a tie-up with US rival Pfizer to merge their consumer healthcare divisions to create a business with combined sales of £9.8bn.\nThe deal paves the way for Glaxo to break itself up to form two separate UK-based companies - one focused on pharmaceuticals and vaccines, and the other on consumer healthcare.\nGlaxo said it is aiming to do this within three years of completing the consumer healthcare joint venture.\nIt comes after pressure from shareholders for Glaxo to spin off its consumer division.\nGlaxo will own 68% of the consumer healthcare joint venture, while US firm Pfizer will own the remaining 32% stake.\nThe merger is set to deliver cost savings of £500 million by 2022, of which up to 25% will be reinvested in the business.\nIt will bring together Glaxo’s brands such as Sensodyne, Voltaren and Panadol and Pfizer’s Advil and Centrum. GlaxoSmithKline logo (Image: PA)", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15570468;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-19T10:10:00.000+02:00", "crawled": "2018-12-19T12:53:50.003+02:00", "highlightTitle": ""}