{"organizations": [], "uuid": "89899621753ded3e0317e9bcb3523f5f103342d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11055149.ece/ALTERNATES/s1200/JS33630770.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/confidence-falling-north-east-smes-15548378", "country": "GB", "domain_rank": 21960, "title": "Confidence falling with North East SMEs, regional bank says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-13T18:49:00.000+02:00", "replies_count": 0, "uuid": "89899621753ded3e0317e9bcb3523f5f103342d6"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/confidence-falling-north-east-smes-15548378", "ord_in_thread": 0, "title": "Confidence falling with North East SMEs, regional bank says", "locations": [], "entities": {"persons": [{"name": "gavin opperman", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}], "organizations": [{"name": "cybg", "sentiment": "negative"}, {"name": "virgin money", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "centre for economics and business research", "sentiment": "none"}, {"name": "cebr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Confidence falling with North East SMEs, regional bank says Survey by CYBG says the North East is one of the most vulnerable areas to Brexit Share Part of the Newcastle City Centre skyline Get business\nConfidence among SMEs in the North East is plunging as Brexit uncertainty reaches new levels, a survey by the new owners of Virgin Money has revealed.\nThe research by CYBG, which took over the Newcastle bank earlier this year, revealed that business health in the North East has fallen and that indicators for revenue, capacity and business cost have also dropped.\nCYBG’s research, undertaken with the Centre for Economics and Business Research (Cebr), also found that the North East was one of the most vulnerable to be impacted by Brexit, mirroring other studies that have highlighted the potential harm to the region from leaving the European Union.\nThe Brexit warning was based on four indicators – exports, labour supply, imports and foreign/direct investment – with the North East more reliant on exports to the EU than any other area of England.\nGavin Opperman, group customer banking director at CYBG, said: “At a macro-economic level, the UK appears to be faring well. Sectors which have previously struggled, such as construction and manufacturing, have shown marked improvement and net business creation has risen. Framing this is relatively strong GDP growth, particularly impressive given other major economies have slowed. Gavin Opperman, group customer banking director at CYBG (Image: Huddersfield Daily Examiner)\n“Given this seemingly positive backdrop, it would be reasonable to expect this quarter’s Health Check Index to reflect a more optimistic SME market, however the political and economic uncertainty driven by Brexit have sowed seeds of doubt and businesses have made it clear that they are unsure about what 2019 holds for them.”\nThe warning from CYBG has come as official data released this week showed the North East exported £2.31bn more to the EU than it did to the rest of the world.\nFigures from by HM Revenue & Customs show that the North East exported £7.61bn worth of goods to EU countries last year - compared to only £5.29bn to those not in the EU .\nThe data showed that the North East was just as reliant on EU trade when it came to imports, bringing in £7.88bn worth of goods from countries within the EU, compared to just £5.29bn from the rest of the world.\nNorth East Chamber of Commerce chief executive James Ramsbotham has urged the Government to stop in-fighting and get a grip on Brexit.\nHe said: “This country’s businesses are fundamental to the UK’s success and far greater cognisance needs to be taken of their many concerns. Time is running out for our region’s employers to adapt to any deal. This endless uncertainty is stifling opportunity, investment and employment.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-13T18:49:00.000+02:00", "crawled": "2018-12-14T01:05:02.019+02:00", "highlightTitle": ""}