{"organizations": [], "uuid": "d33b235853731d10780aec18d4c9f9eb25e324fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15522393.ece/ALTERNATES/s1200/0_Andrew-Mitchell-CEO-of-the-North-East-Fund.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-fund-boss-assures-15522273", "country": "GB", "domain_rank": 21960, "title": "North East Fund boss assures firms investments are safe despite Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-09T13:00:00.000+02:00", "replies_count": 0, "uuid": "d33b235853731d10780aec18d4c9f9eb25e324fb"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-fund-boss-assures-15522273", "ord_in_thread": 0, "title": "North East Fund boss assures firms investments are safe despite Brexit", "locations": [], "entities": {"persons": [{"name": "mitchell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew mitchell", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east fund", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "north east fund limited", "sentiment": "none"}, {"name": "european investment bank", "sentiment": "none"}, {"name": "eib", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East Fund boss assures firms investments are safe despite Brexit The North East Fund derives from cash form the European Investment Bank Share Andrew Mitchell, CEO of the North East Fund (Image: Unknown) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe CEO of a major North East investment fund has spoken out to assure businesses that its funds will remain safe after the UK leaves the European Union.\nAndrew Mitchell, CEO of the North East Fund Limited which is headquartered in Newcastle, said the fund will continue after Brexit despite it deriving from the European Investment Bank (EIB).\nThe £120m investment agreed for the North East over the next five years has been secured and local businesses looking to grow should still apply for funding through the scheme, he said.\nMr Mitchell’s assurance come as local businesses raise concerns over how regional investment for start-ups will be impacted by Brexit, as many funds originate from the EU. Read More Northumberland country pub reopens after £160,000 refurbishment\nHe said: “This is the second time that the EIB has invested and committed to the region and this demonstrates a high level of confidence in North East-based organisations, especially SMEs. EU membership has enabled regional accelerator programmes, attracted European founders and new talent, but there is also an uncertainty regarding what could replace EIB funding in the future.\n“Nobody truly knows what is going to happen after Brexit and speculation, either way, is something which cannot be avoided. However, our four fund management companies are now allocating the investment which we have secured.\n“From our point of view, supporting trailblazing companies that are innovative, produce market-leading goods and who put the region on the map, will only encourage new funding opportunities in the future. The North East Fund could assist approximately 600 SMEs support economic growth, employment and generate a good return on investment, money that can be put straight back into the North East economy.”\nThe £120m has been allocated to North East SMEs across Northumberland, Gateshead, Sunderland, Newcastle, Durham, and North and South Tyneside.\nIt aims to build a legacy of £80m in the local economy. Read More North East firms club together and call for a People's Vote on Brexit\nThe fund was established in April 2018 and is organised into five venture capital and loan funds. It is designed to help around 600 local firms and create 2,500 jobs by March 2023.\nThe programme encourages investment in new technologies - including low carbon technologies. It also aims to stimulate new business creation, private investment and entrepreneurialism. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-09T13:00:00.000+02:00", "crawled": "2018-12-09T14:34:41.001+02:00", "highlightTitle": ""}