{"organizations": [], "uuid": "3691e1096b1e5f5353bea14d7c1d35f7b554a831", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15532136.ece/ALTERNATES/s1200/0_Capture1JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/sunderland-netflix-documentary-beckham-dream-15531998", "country": "GB", "domain_rank": 21960, "title": "Working with Beckham and One Direction... But Sunderland documentary was always Fulwell73's dream", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T17:52:00.000+02:00", "replies_count": 0, "uuid": "3691e1096b1e5f5353bea14d7c1d35f7b554a831"}, "author": "Craig Johns", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/sunderland-netflix-documentary-beckham-dream-15531998", "ord_in_thread": 0, "title": "Working with Beckham and One Direction... But Sunderland documentary was always Fulwell73's dream", "locations": [], "entities": {"persons": [{"name": "beckham", "sentiment": "negative"}, {"name": "mo farah", "sentiment": "none"}, {"name": "niall quinn", "sentiment": "none"}, {"name": "david beckham", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "sunderland afc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sport Working with Beckham and One Direction... But Sunderland documentary was always Fulwell73's dream They've worked with some of the biggest stars in the world, but for Fulwell73 latest project Sunderland Til I Die was a little closer to their heart Share Click to play Tap to play The video will start in 8 Cancel Play now Get Sunderland AFC updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThey've worked with stars such as David Beckham, One Direction, Sir Mo Farah and Usain Bolt, but for production company Fulwell73 it's their latest project Sunderland Til I Die that means the most to them.\nAs their name might suggest, Sunderland AFC have always played a big part of the lives of three quarters of the founding members of hugely successful production company. It's why many of the editing suites in their London office are named after club legends such as Niall Quinn. The same editing suites than in recent months have been used tirelessly to put together the eight-part documentary series which is released on Netflix this week.\nFulwell73 have been behind some of the greatest sporting documentaries in recent past, including Class of '92 and I Am Bolt, and also created the One Direction movie and serve as executive producers for James Corden's Late Late Show in the US, and its popular spin-off Carpool Karaoke.\nBut last season they swapped all that glitz and glamour to come back to their roots.\nLeo Pearlman and Ben Turner are both Sunderland supporters and are executive producers for the upcoming eight-part series which launches on Netflix on Friday, December 14.\nThroughout all of last season cameras were given access behind the scenes at the Wearside football club.\n\"This was very much a personal one for us as fans of Sunderland,\" Pearlman told ChronicleLive. \"We started Fulwell in 2007 and this would have been the dream project from day one.\n“We’ve been so fortunate to work with some of the talent that we have done over the years - Beckham, Bolt, One Direction and god knows who else - but this always remained the dream.\n“It was a real privilege to be able to do this.”\nThe documentary begins at the start of the 2017-18 season. The Black Cats had just been relegated from the Premier League and had just appointed former Leeds United and Preston boss Simon Grayson, who they tasked with getting them promotion straight back to the mega-rich top flight of English football.\nIt should certainly be no spoiler that the season could not have gone any different to how Fulwell73 envisioned when dreaming up their documentary. Sunderland Til I Die Netflix series (Image: Netflix)\nA disastrous campaign saw the Wearsiders suffer a second successive relegation - falling to the third tier for only the second time in their entire existence. Despite that, Pearlman still believes they've created something Sunderland fans - and indeed wider football fans - will enjoy. On a personal level, he thinks it was a good thing for the club too.\nHe said: \"Of course, when we first started we expected this would be about Sunderland’s rise back to the Premier League.\n“Certainly in our lifetime, every time Sunderland had dropped down to that level we’ve either won it or got in the play-offs. And the year before Newcastle did that. They were relegated but stormed through that league.\n“And then talking to the owner and chief exec at the time Ellis Short and Martin Bain, their ambition was to go straight back up. They had big plans for the club and everything was pointing towards it still being a Premier League club, just needing that one year to reset and readdress the balance.\n“They started quite well as well, if you remember. Four of five games in they were sitting well in the table and I don’t think anyone really saw how bad it was going to become.\n“But, you know, for the sake of the story it was certainly no bad thing, and I think arguably for the sake of the football club it was no bad thing either.\n“I think it would have been disastrous to just survive in that league and end up still under the same ownership.” Ben Winston, Leo Pearlman, Gabe Turner and Ben Turner of Fulwell73 (Image: Getty Images Europe)\nPearlman's partner on the project Ben Turner added: \"A new owner comes in and we hammer Wolves - the league champions - 3-0. You couldn’t really ask for a better way to end it.\n“I think without that takeover, both as creative producers and as Sunderland fans, I think everything would have felt pretty dire to be honest. I’m not sure how else we could have ended on a high point and I would have felt pretty low about the club moving forward.\n“But the fact the new owners came in and had that instant impact, and the stuff that they said straight away, gave us the perfect ending in a sense.”\nSunderland supporters concerned that watching the documentary would be like some form of sadomasochism, reliving one of the club's darkest ever seasons, would be wrong.\nSure, what happened on the pitch plays a big part of the series, but it's about so much more than that.\nIt's clear that it's been created by people who have the club at their heart too. The documentary is as much about the city and the passionate fanbase of the football club, as it is results on the pitch.\nTurner explained: \"Reflecting the passionate fans and the city and its history and culture was always going to be a big part of the documentary. That was important for us.\n“When you start a project like this you think about what the relevance is going to be to elevate it beyond just a club shop DVD.\n“To get it on Netflix we need to reach an international audience, and the opportunity for us was to put on screen what it is that we really love about the football club that we’ve followed all of our lives.\n“I think there’s a residence in the modern world, with politics with Brexit and Trump and all that, these communities that seem to be a little left behind and forgotten about. Sunderland can definitely fall into that. Read More How close did Fulwell73 come to a Sunderland takeover? Leo Pearlman and Ben Turner respond\n“So what the club represents to that city goes way beyond winning on a football pitch. Partly because sadly they don’t win on the football pitch very often, but also partly because of the way that the community is.\n“So the opportunity for us across the eight episodes was to really try and give the sense of what that football club is to the people because that’s more interesting to people than what tactics are they going to be playing week in, week out, I think.”\nThe documentary captures that brilliantly. They have plenty of behind-the-scenes footage to interest the general football fan - including regular discussions with key people at the club such as players and chief executive Martin Bain.\nBut there's also a lot of time dedicated to meeting supporters and getting access to their families and their every day life - reflecting on how important Sunderland AFC is to them. Read More Sunderland AFC Netflix documentary: Release date, where and when you can watch it more\nThe hope for Pearlman and Turner is that their production can have a beneficial affect on the club - both in image and brand, and also hopefully financially too.\n\"Nothing would make us prouder as Sunderland fans for this to reach a global audience of Netflix viewers and for them to actually learn and know who Sunderland AFC are and also the city,\"Pearlman said.\n\"If that has a positive financial knock-on affect for the football club then that would be fantastic.”\nSunderland Til I Die launches on Netflix on December 14. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-10T17:52:00.000+02:00", "crawled": "2018-12-10T18:35:53.154+02:00", "highlightTitle": ""}