{"organizations": [], "uuid": "13784868e6343c493b5fcf357da55338354f05e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15572902.ece/ALTERNATES/s1200/0_TMP_NEC_260718JubileeHouseVirginMoney03JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/new-virgin-money-owner-given-15572675", "country": "GB", "domain_rank": 21960, "title": "New Virgin Money owner given entry to £350m scheme to increase competition in banking", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T15:55:00.000+02:00", "replies_count": 0, "uuid": "13784868e6343c493b5fcf357da55338354f05e3"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/new-virgin-money-owner-given-15572675", "ord_in_thread": 0, "title": "New Virgin Money owner given entry to £350m scheme to increase competition in banking", "locations": [], "entities": {"persons": [{"name": "monzo", "sentiment": "none"}, {"name": "arbuthnot", "sentiment": "none"}, {"name": "starling", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}], "locations": [{"name": "gosforth", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "cybg", "sentiment": "negative"}, {"name": "business new virgin money", "sentiment": "negative"}, {"name": "rbs", "sentiment": "none"}, {"name": "metro bank", "sentiment": "none"}, {"name": "tsb", "sentiment": "none"}, {"name": "rbs share virgin money jubilee house", "sentiment": "none"}, {"name": "co-op bank", "sentiment": "none"}, {"name": "clydesdale", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "hampden & co", "sentiment": "none"}, {"name": "handelsbanken", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business New Virgin Money owner given entry to £350m scheme to increase competition in banking CYBG among 11 lenders who will get a share of the scheme aimed at getting small business customers to switch from RBS Share Virgin Money Jubilee House, Gosforth (Image: newcastle chronicle)\nThe new owners of Newcastle’s Virgin Money have been deemed eligible to take a slice of a £775m Royal Bank of Scotland fund aimed at increasing competition in Britain’s banking sector.\nCYBG is among 11 lenders which will be entitled to a share of a £350m incentivised switching scheme aimed at encouraging small business customers to ditch their RBS account for rivals.\nRBS is freeing up the cash as part of conditions attached to its £45bn Government bailout at the height of the financial crisis, and the money is being distributed by the Banking Competition Remedies body.\nAs well as Clydesdale - part of the CYBG group, which took over Virgin Money in October - bids by Monzo, Starling, Arbuthnot, , Co-op Bank, Hampden & Co, Metro Bank, Nationwide, Santander, Handelsbanken and TSB have also been approved.\nThey will make offers to SME customers at RBS in February.\nA further four unnamed firms, which are not currently members of the current account switching service, were also approved and the BCR is considering a second application window in late spring 2019. David Duffy (Image: PA)\nCYBG CEO David Duffy said: “We’re pleased Yorkshire Bank and Clydesdale Bank will be participating in the Incentivised Switching Scheme.\n“As the UK’s leading SME challenger bank, we’ve invested £12m in preparing for the switching scheme so we can offer a smooth transition for Williams & Glyn customers leaving RBS, and we now have a great opportunity to offer an exciting new home for thousands of Williams & Glyn customers when the scheme opens next February.\n“SMEs will be at the heart of the UK’s future economic growth and it is vital there is a vibrant and competitive banking market helping SMEs realise their future growth plans.”\nBidding for participation in a separate £425m capability and innovation fund - aimed at helping banks develop their current account, lending and payments offerings for business customers - is also under way. Read More Five leading business groups issue strong warning over no-deal Brexit\nWhile the process has been marred by delays, having been put nearly six months behind schedule earlier this year, directors insist the BCR is now on track to deliver the distribution of the fund along a stringent timeline.\nBCR chairman Godfrey Cromwell said “It’s very good news that a broad selection of organisations have stepped forward and made a diversity of offers right across the SME client base. Today’s announcement marks an important milestone for incentivised switching.\n“Customers will be the real decision-makers here. We look forward to getting through the contracting stage and seeing these offers made public so that customers can react. We anticipate that a further application round in quarter two 2019 will widen the range of offers still further.”\nCYBG took over Virgin Money in a £1.7bn deal in what it said would create a true challenger bank to the established High Street giants.\nThe bank has pledged to maintain a base in Newcastle for at least three year. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-19T15:55:00.000+02:00", "crawled": "2018-12-19T20:37:42.005+02:00", "highlightTitle": ""}