{"organizations": [], "uuid": "3e91c42fecdb8163923206cc79c7bf01a76661b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15544579.ece/ALTERNATES/s1200/0_Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/news-opinion/theresa-survived-week-hell-can-15554748", "country": "GB", "domain_rank": 21960, "title": "Theresa May survived her week from hell - but can she deliver Brexit?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-18T12:48:00.000+02:00", "replies_count": 0, "uuid": "3e91c42fecdb8163923206cc79c7bf01a76661b0"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/news-opinion/theresa-survived-week-hell-can-15554748", "ord_in_thread": 0, "title": "Theresa May survived her week from hell - but can she deliver Brexit?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "neutral"}], "locations": [{"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nShe’s still standing. And that’s the best you can say about Theresa May’s week of hell.\nThe Prime Minister is still in a job, and still trying to get a Brexit deal.\nBut last week’s dramatic events haven’t settled anything.\nThe Prime Minister still looks incapable of securing a withdrawal deal that the House of Commons is willing to approve.\nAnd it’s no exaggeration to say that nobody at Westminster knows how this is going to end.\nThe Prime Minister spent much of December campaigning to try to build support for her proposed Brexit withdrawal agreement.\nThat included answering questions from Sunday Sun readers. She told one reader last week: “I do believe that my deal is the only credible plan on the table. It is easy to make suggestions from the side-lines but negotiating day in and day out is a different matter altogether.”\nThe House of Commons has passed legislation which ensures the Government cannot proceed with an withdrawal agreement unless it’s approved by MPs, in what’s become known as the “meaningful vote”. British Prime Minister Theresa May returns to Downing Street after the Confidence Vote in her leadership on December 12, 2018 i (Image: Getty Images)\nThe vote was due to take place on Tuesday - but on Monday, Mrs May called the whole thing off.\nShe admitted: “If we went ahead and held the vote tomorrow the deal would be rejected by a significant margin.”\nAnd she was right. In the North East, for example, only one MP was backing her deal.\nOf course, many of our MPs are Labour politicians, who might be expected to oppose the government.\nBut there are also three Conservatives. And only one, Guy Opperman, MP for Hexham in Northumberland , was willing to back Mrs May.\nThe Prime Minister said she would resume talks with EU leaders and try to make changes to the proposed deal. Read More Theresa May stays as Prime Minister after winning vote of no confidence - but she'll quit before 2022\nBut some Conservative MPs decided they’d had enough.\nFor some time, hardcore pro-Brexit MPs such as Jacob Rees-Mogg had been trying to remove the Prime Minister from office.\nThey don’t want her Brexit deal to succeed. They’d rather leave the EU with no deal at all.\nUnder Conservative Party rules, a vote of confidence in the Prime Minister would take place if 48 MPs wrote letters demanding one.\nBut Mrs May’s opponents inside the party couldn’t convince enough colleagues to write the letter.\nThat now changed. On Wednesday morning, Sir Graham Brady, chairman of the 1922 Committee which represents Tory backbenchers, announced he’d received sufficient letters.\nIt meant a secret ballot of Conservative MPs would be held. Mrs May was in a fight for her political life. Sir Graham Brady (centre), chairman of the 1922 Committee, announces that Theresa May has survived an attempt by Tory MPs to oust her as party leader with a motion of no confidence (Image: PA)\nAnd she won - but more than a third of Tory MPs voted to sack her. There were 200 votes in Mrs May’s favour, while 117 Tory MPs said they had no confidence in her.\nThe Prime Minister’s opponents in the party continued to demand her resignation.\nDramatic as the confidence vote was, history may well see it as less important than what came next.\nMrs May met EU leaders at the EU council in Brussels.\nAnd they showed little inclination to help.\nThe bone of contention is the “backstop”, which is designed to ensure there can be no hard border between Ireland and Northern Ireland.\nIt effectively keeps the UK in the EU customs union - and while it’s meant to be a temporary arrangement, it appears the UK wouldn’t be able to leave without the agreement of the EU. Read More\nBoth Mrs May and the EU say they don’t want to put the backstop into effect. It’s only there in case no other way is found to solve the border issue.\nThat doesn’t reassure MPs. They won’t vote for a withdrawal deal that includes the backstop.\nBut the EU won’t give us a withdrawal deal without it.\nTheresa May isn’t the only party leader facing a conundrum.\nAt some point, Labour leader Jeremy Corbyn is going to have to decide whether to back a “People’s Vote” - a second referendum on Brexit. Redcar MP Anna Turley at the People's Vote rally in Newcastle (Image: newcastle chronicle)\nSome North East Labour MPs, such as Newcastle North MP Catherine McKinnell and Redcar MP Anna Turley, are firmly in favour.\nOthers, such as Labour chair Ian Lavery, MP for Wansbeck, appear to be opposed.\nMrs May wants to slow things down. She said she would present her improved Brexit deal to the House of Commons (or, presumably, admit defeat if need be) before January 21.\nLabour plans to take action this coming week to put pressure on the Prime Minster. We wait to see exactly what they have planned. Read More Labour MPs put pressure on Jeremy Corbyn to back second referendum that could cancel Brexit\nBut time is running out. There’s around 100 days until we leave the EU on March 29.\nWill we leave with a deal? Will the Brexiteers get the no-deal Brexit some of them crave? Or will we have to delay - or even cancel - the whole thing?\nDon’t bother asking your local MP. None of them know. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-18T12:48:00.000+02:00", "crawled": "2018-12-18T18:19:07.047+02:00", "highlightTitle": ""}