{"organizations": [], "uuid": "8d5040e1f68399593ad4a861544f336bf2676e77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15521927.ece/ALTERNATES/s1200/0_Shocking-photos-reveal-the-true-scale-of-Britains-AE-crisis-with-mothers-and-children-on-floors.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nhs-winter-crisis-jobs-beds-15520876", "country": "GB", "domain_rank": 21960, "title": "Four-hour waits on cramped A&E trolleys will hit NHS for North East's 'worst winter on record'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T07:00:00.000+02:00", "replies_count": 0, "uuid": "8d5040e1f68399593ad4a861544f336bf2676e77"}, "author": "Jack Elsom", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nhs-winter-crisis-jobs-beds-15520876", "ord_in_thread": 0, "title": "Four-hour waits on cramped A&E trolleys will hit NHS for North East's 'worst winter on record'", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "negative"}, {"name": "nhs", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "bma", "sentiment": "none"}, {"name": "invalid email hospital", "sentiment": "none"}, {"name": "british medical association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shocking photos reveal the true scale of Britain's A&E crisis - with mothers and children on floors and pensioners on trolleys being cared for by 'corridor nurses' (Image: BBC) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nHospital patients in the North East will suffer the \"worst winter on record\" and thousands could spend hours lying on trolleys amid a severe bed shortage which threatens to push the NHS to breaking point.\nIt is predicted that people could endure more than four hours in cramped A&E waiting rooms before being treated.\nThe British Medical Association (BMA) estimates that cash-strapped North East hospitals need 180 more beds to meet the minimum standards of patient safety. Scenes from the last NHS winter crisis, which aired in a BBC documentary (Image: BBC)\nHospitals are warned to not exceed an 85% bed occupancy rate - the number of beds used for pre-booked procedures - in order to keep some free for patients being admitted with unexpected illnesses which often occur in the winter months.\nHowever, last winter bed occupancy peaked at 95.1% - above the the 92% mark where the quality of emergency care rapidly deteriorates. Read More Uber to give NHS workers free taxi rides home this Christmas\nThe BMA's bleak forecast, based on NHS England data trends from previous winters, predicts that this year will be the worst ever.\nDr George Rae, chairman of the North East BMA said: \"With an estimated 180 additional general and acute beds needed in the North East to operate at the recommended minimum safe limit this winter, not including escalation beds, patients in many cases will struggle to get the attention and care they need.\" Read More My day in A&E: Behind the scenes at Newcastle's Royal Victoria Infirmary\nHe also blamed Brexit for distracting politicians from ensuring that the NHS is well-equipped to deal with increasing strains on hospitals.\nSpeaking to ChronicleLive, Dr Rae said: \"The politicians have concentrated so much on Brexit that they have taken their eye off the ball. Hospital scenes from the NHS last winter crisis (Image: BBC)\n\"It's already happening where people are waiting a long time because the fact is that we have got fewer beds than we need.\n\"I really think that politicians have got to get Brexit sorted out so we don't suffer in the long term.\"\nThe BMA believes that without extra resources 238,000 patients across England will spend more than four hours waiting to be admitted to hospital, 12,000 higher than the record from the previous winter. Read More How do I train to become a nurse and what qualifications will I need?\nNationally, it says 5,000 additional beds are needed to plug the equipment shortage.\nDr Rob Harwood, BMA consultant committee chair, said the NHS was in \"crisis\" and also hit out at Brexit for causing uncertainty.\nHe said: \"The NHS is facing an all-year crisis that is leaving patients in an intolerable situation.\n\"This winter could be the worst on record for frontline emergency care departments, with a BMA analysis suggesting hundreds of thousands of patients will be left either waiting to see a doctor for an assessment or stranded in cramped corridors on a hospital trolley waiting for a hospital bed to become available. Shadow Health Secretary Jon Ashworth MP (centre left, shirt and tie) joins with people taking part in a march in London in support of the National Health Service to demand an end to the \"crisis\" in the NHS (Image: Yui Mok/PA Wire)\n\"A key part of this problem is the lack of available beds within the NHS system.\n\"Last winter saw incredibly high levels of bed occupancy, well above recommended limits, and despite thousands of escalation beds being put into action temporarily.\n\"At this level patients will struggle to get the attention and care they need.\" Read More Rise in staff vacancies at North East health trusts as NHS prepares for busy winter\nDr Rae said that North East hospitals are desperately trying to prepare for a tough winter but a lack of funding is stifling their efforts.\nHe pointed to initiatives such as North Tyneside's 'Consultant Connect' which allows consultants to easily seek advice from GPs to reduce the amount of hospital admissions.\"However, despite these valiant efforts we need to see long-term investment in the NHS in the North East so that extreme winter pressures are not the normal and patients get the care they deserve\", he said.\nA Department of Health and Social Care spokesperson said: \" Despite an extra 840,000 people going to A&E, hardworking NHS staff have seen nearly half a million more people within four hours over the last 12 months than compared to last year.\n“We have given the NHS £1.6 bn this year to improve performance and cut waiting times, as well as £420m in additional winter support to redevelop A&Es, improve emergency care and help patients get home quicker.\n“Our long-term plan for the NHS, backed by an extra £20.5bn a year by 2023/24, will improve front-line services and put our health service on a sustainable footing for years to come.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-10T07:00:00.000+02:00", "crawled": "2018-12-10T07:18:06.000+02:00", "highlightTitle": ""}