{"organizations": [], "uuid": "93908317fc7a57e34f64498df679d413c78cf37b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2345360.ece/ALTERNATES/s1200/0_download.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/13-new-laws-rules-coming-2345353", "country": "US", "title": "The 13 new laws and rules coming into force in 2019 and what they mean for you - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "93908317fc7a57e34f64498df679d413c78cf37b"}, "author": "Hannah Graham", "url": "https://www.devonlive.com/news/devon-news/13-new-laws-rules-coming-2345353", "ord_in_thread": 0, "title": "The 13 new laws and rules coming into force in 2019 and what they mean for you - Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "national minimum wage", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The 13 new laws and rules coming into force in 2019 and what they mean for you They include an increase in the National Minimum Wage and a rise in the personal tax threshold Share Click to play Tap to play The video will start in 8 Cancel Play now\nChanges to payslips, pensions and drone laws will be introduced in the new year.\nSome of the new regulations set to come into force in 2019 could have a big impact on your pocket.\nFrom pension changes to workers' rights, we've rounded up 22 new laws or regulations that you should know about.\nWe've included a few upcoming legal decisions, expected to be made next year, which could affect workers in various fields, as well as changes to reporting and records which could make a difference to business owners, according to the Newcastle Chronicle .\nOf course, there are likely to be plenty more legislative changes unveiled as the year goes on (the imminent Brexit, of course, being one of the factors making it impossible to predict exactly what Government announcements 2019 might bring.) Read More\nBut for now, here are a few of the changes we know are coming: Increase in National Minimum Wage rates\nBoth the National Living Wage (NLW) and National Minimum Wage (NMW) rates will increase in April 2019.\nThe “living wage”, the effective minimum wage for people aged 25 or over, will rise to £8.21 next April, up from £7.38 an hour now. Tax changes for those on low salaries - and the well-paid\nThe income tax threshold will increase to £12,500 in April 2019. In other words, you won’t pay any income tax at all until you earn this much.\nAssuming you have an annual income of at least £12,500, you’ll probably pay £130 less tax a year.\nAnd the threshold for the higher rate of income tax - the 40% rate - will increase to £50,000-a-year. Read More Argos launches massive pre-Christmas sale with bargains on toys and tech\nIt means that some people on higher salaries (more than £46,351-a-year) will also gain.\nWhat does that mean? “A £130 a year gain for anyone earning over £12,500,” said Money Saving Expert's Martin Lewis.\nThere will also be more cash for the better off – with the point you start paying 40% income tax moving from £46,350 to £50,000.\n“Which means another £730 in the pay packets of people who are above £50,000,” Martin added.\nHowever, the super-rich won't get the full benefit – for once – with people making more than £100,000 not benefiting as much or even at all. Supermarket equal pay claims\nDecisions on separate tribunal cases on the issue of equal pay involving Tesco, Asda, Morrisons and Sainsbury’s are expected in 2019.\nIt involves female shop workers who feel they are paid less than their male warehouse workers, despite carrying out a similar role. The decisions made could impact on other workers in future. Read More New rules on overdrafts axe high charges National Minimum Wage for sleep-ins\nThe Court of Appeal says people working sleep-in shifts, such as nurses and care workers, are not entitled to the National Minimum Wage for time spent asleep where they were ‘available for work’ and not ‘actually working’.\nA request to appeal this decision was lodged with the Supreme Court by Unison and a decision is expected in 2019. Settled status for EU nationals (Image: Getty)\nEuropean workers living in the UK can apply for settled status in 2019, allowing them to remain indefinitely after the end of the Brexit transition period in 2021.\nTo be granted settled status individuals must prove they have been living in the UK for five years by the date of application. Read More\nThose who do not meet this requirement can apply for temporary status, allowing them to remain until they have gained enough residency to be granted settled status. Pension contributions\nThe minimum contributions for auto-enrolment pension schemes will increase for employers and employees from April 2019.\nExisting rules mean employers must contribute a minimum of 2% of a worker’s pre-tax salary, with the worker contributing 3%.\nUnder the new rules, employers and employees will now have to contribute a minimum of 3% and 5% respectively. State pensions\nMillions of pensioners will see a pay rise from April 2019.\nThanks to inflation, pensioners who are entitled to the full new single-tier state pension will see their payments increase £4.25 per week, taking the weekly payment from £164.35 to £168.60 from 6 April 2019. Read More What to do if your parcel goes missing or gets damaged\nThe change means this group of pensioners will be £221 better off by the end of the 2019/20 tax year, with total annual income boosted from £8,546.20 to £8,767.20 a year, according to Which? .\nThose who receive the basic state pension will get a boost of £3.25 per week, with the state pension rising from £125.95 to £129.20 per week from 6 April 2019.\nThis change will give this group of pensioners a £169 boost in 2019/20, with total annual income rising from £6,549.40 to £6,718.40 a year. Pension credit Retirement saving and pension planning\nThis means-tested benefit is awarded based on earnings, and from April 2019 both pension credit payments will rise by 2.4%, the CPI rate of inflation.\nGuarantee credit, the first part of pension credit, will subsequently increase from £163 a week to £167.25 per week for a single person and from £248.80 to £255.25 for a couple. Read More\nThe second part, savings credit, will see its cap rise from £13.40 to £13.72 for a single person, and from £14.99 to £15.35 a week for a couple. State pension age\nSince November 2018 the state pension age has been 65 for both men and women.\nFrom 2019, the State Pension age will gradually increase for both men and women to reach 66 by October 2020. State Pension age will be increasing from 66 to 67 between 2026 and 2028. New drone laws\nFrom November 2019, new drone rules will come into effect, impacting users.\nThe new laws will make it illegal to fly a drone weighing more than 250g without first registering with the Civil Aviation Authority and passing online safety tests.\nAviation minister Baroness Sugg said in a statement: \"Whilst we want this industry to innovate and grow, we need to protect planes, helicopters and their passengers from the increasing numbers of drones in our skies.\n\"These new laws will help ensure drones are used safely and responsibly.\" Read More Clifton Hill Sports Centre will NOT reopen as council votes again to keep it closed after heated debate Payslips\nFrom April 6, 2019, the legal right to a payslip will be extended to include non-employees such as contractors and freelancers.\nEmployers will also be obliged to include the total number of hours worked on payslips for employees whose wages vary depending on how much time they have worked. Pay gap reporting\nPrivate organisations with 250 or more employees will again be required to publish their gender pay gap figures on April 4, 2019.\nNew legislation will come into force that requires companies with more than 250 employees to publish their executive pay gap. VAT rules\nFrom April 2019, all VAT-registered businesses with taxable turnover above the VAT registration threshold will have to keep VAT records in digital form and file their VAT returns using software. Like us on Facebook", "external_links": [], "published": "2018-12-19T02:00:00.000+02:00", "crawled": "2018-12-19T17:15:59.036+02:00", "highlightTitle": ""}