{"organizations": [], "uuid": "d3c5fe93041fd236262f6f471b2cdee86023028e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14756890.ece/ALTERNATES/s1200/1_GMB-annual-conference.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-party-leader-jeremy-corbyn-15531508", "country": "GB", "domain_rank": 21960, "title": "Does Labour and party leader Jeremy Corbyn support Brexit?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-11T17:10:00.000+02:00", "replies_count": 0, "uuid": "d3c5fe93041fd236262f6f471b2cdee86023028e"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-party-leader-jeremy-corbyn-15531508", "ord_in_thread": 0, "title": "Does Labour and party leader Jeremy Corbyn support Brexit?", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "neutral"}, {"name": "david cameron", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}], "locations": [], "organizations": [{"name": "news does labour", "sentiment": "neutral"}, {"name": "labour party", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "invalid email does labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Does Labour and party leader Jeremy Corbyn support Brexit? What is the Labour Party's position on Brexit? Does it support the EU referendum result or does it want a People's Vote? Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nDoes Labour support Brexit?\nThe answer is basically yes, but it's a bit more complicated than that.\nDuring the 2016 EU referendum , Labour campaigned in favour of remaining in the EU.\nThe party refused to join forces with the official remain campaign, which was supported by Conservative leader David Cameron.\nAnd leader Jeremy Corbyn was accused by some Labour MPs of failing to make much of an effort to campaign for remain.\nThat was the main reason a majority of Labour MPs voted that they had \"no confidence\" in Mr Corbyn after the referendum, and tried to force him to resign. Read More\nBut the fact is that Labour's official position was to support remaining in the EU.\nAfter the referendum, things changed.\nA lot of remain supporters, including Tories as well as Labour politicians, said that they had to accept the results of the referendum. How the North East voted in the EU Referendum in June 2016\nNewcastle: Remain 65,404 (50.7%); Leave 63,598 (49.3%)\nSunderland: Remain 51,930 (38.7%); Leave 82,394 (61.3%)\nNorth Tyneside: Remain 52,873 (46.63%); Leave 60,589 (53.37%)\nGateshead: Remain 44,429 (43.2%); Leave 58,529 (56.8%)\nSouth Tyneside: Remain 30,014 (38%); Leave 49,065 (62%)\nDurham: Remain 113,521 (42.5%); Leave 153,877 (57.5%)\nNorthumberland: Remain 82,022 (46%); Leave 96,699 (54%)\nMr Corbyn called immediately for the UK to trigger 'Article 50' . That's the official process of leaving the EU.\nAnd Labour's position is that it wants to leave the EU, because it \"respects the result of the referendum\".\nThings got more complex at Labour's annual conference in September. Read More Odds on who could replace Theresa May if she resigns as Prime Minister\nA lot of Labour Party members seem to support a \"People's Vote\" on Brexit. This is a second referendum, and would provide a chance to cancel Brexit.\nSo the party conference approved a policy which says that if Theresa May fails to secure a Brexit deal that is backed by Parliament, and if there is no general election, then Labour keeps the option of supporting a People's Vote \"on the table\". Jeremy Corbyn at the Durham Miners' Gala\nWhat does \"on the table\" mean? It means the party hasn't decided to support it, but hasn't ruled it out either. Labour insists its policy is clear, but you can decide for yourself.\nHowever, even though this is the official policy, a lot of senior Labour politicians still make it clear they think the UK should leave the EU.\nFor example, Barry Gardiner, the Shadow International Trade Secretary, told the BBC presenter Andrew Marr that he doesn't really want a second referendum - instead, he wants to \"respect the result\" of the first referendum, which means leaving. Read More\nHe said: \"If there were another referendum in all probability I would vote for remain. But I don’t want that.\n\"What I want to do is to respect the views of the people of this country in the referendum, and that’s why we committed to getting a deal through, and that’s why Jeremy made the offer to Theresa May that there is a deal here, if she would only stop being so stubborn, that could actually command a majority in the House of Commons.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-11T17:10:00.000+02:00", "crawled": "2018-12-12T00:21:45.002+02:00", "highlightTitle": ""}