{"organizations": [], "uuid": "e28acaf2827c6e64c270fffb3ea4f1f567ab310b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15364071.ece/ALTERNATES/s1200/0_021118Coast12.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15560701", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-18T07:00:00.000+02:00", "replies_count": 0, "uuid": "e28acaf2827c6e64c270fffb3ea4f1f567ab310b"}, "author": "Kathryn Riddell", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15560701", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "kathryn riddell jeremy corbyn", "sentiment": "none"}], "locations": [{"name": "heworth", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "theresa may labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The A184 Felling Bypass is looking busy now around the Heworth traffic lights.\nThis is the usual congestion in this area. 06:31 Kathryn Riddell Jeremy Corbyn tables motion of no confidence in Theresa May\nLabour leader Jeremy Corbyn has asked for a no confidence vote in Theresa May as Prime Minister.\nBut he did not appear to be calling for a formal no confidence vote in the Government.\nHe said he was taking action because the Prime Minister had announced that a vote on her Brexit deal will not take place until January.\nMr Corbyn said: “It’s very clear that it’s bad, unacceptable, that we should be waiting almost a month before we have a meaningful vote on the crucial issue facing the future of this country.”\nBy law, the Opposition is entitled to table a motion stating it has no confidence in the Government. This must be debated by the House of Commons and could lead to a general election.\nHowever, Mr Corbyn has chosen not to do this, and instead said he would table a motion of no confidence in the Prime Minister personally. It is unclear whether this would have any legal force if it is approved. Consett dad found dead in Thailand's red light district hotel\nA father from County Durham has been found dead in a hotel bed in the heart of Bangkok’s red light district (Image: Getty Images/iStockphoto)\nLuke Ramage, from Consett, County Durham , was discovered by a receptionist at the Bavana hotel with bruises on his shoulders and legs, according to a British newspaper.\nA source told The Sun: “The receptionist found the body. The man was dead when police arrived. There were signs of a fight.\n“The safe had been opened in a suspected theft. There were only cigarettes left.”\nOn December 14 Luke ‘checked in’ to Bangkok, Thailand, on Facebook and posted a picture with him and two friends with the caption ‘boys on tour’.\nTributes have been pouring in on social media. Angus Holmes wrote “RIP big lad far too soon horrible news” while Sarah Ross said “sleep tight Luke”.\nJade Storey wrote: “You my best friend, you are one of a kind, I love you like no other, I couldn’t be anymore gutted.\n“Your Mam, your family and your babies.\n“This time of year was hard for you I know that, I know you were hard work and made mistakes but so does everyone Luke.\n“It was only just three days ago we was putting the world to rights and it was only 2 days ago we spoke and you were having a good time.\n“I love you always my bro, rest in peace my “matey” love Jadey baby.”\nAccording to his Facebook, Luke is chief executive at Proclean Northeast and studied at Stanley school of tecnonlogy.\nA Foreign Office spokesman said: “We are in touch with the local authorities following reports of the death of a British man in Thailand.” 'It's going to a conman'\nA single mother selling a ring says she was conned by a fake bank account and was then left devastated after she said the Post Office ‘refused to return it’.\nJoanne Mullaney, from Esh Winning, County Durham , said once she realised she had been scammed, she rushed to the Post Office to retrieve her parcel back but she said she was told it had already been logged for delivery and there was nothing they could do.\nPost Office policy is that once an item is handed over the counter it is accepted into the Royal Mail network and staff are not allowed to intercept it at that stage.\nJoanne and her girlfriend, Hollie Farrow, were planning their first holiday together as a couple and were raising funds for a trip to Mexico.\nAlthough Joanne is a self employed child minder and retailer, 29-year-old Hollie is a teaching assistant and so the only possible time to go abroad would be in the school holidays , where travel prices rocket.\nIn addition to a few other items, Hollie suggested that they sell an engagement ring from her previous relationship, which was worth about £2,000.\nJoanne said she advertised the ring on Ebay and said she soon received an email from a man who offered to buy it for £500, which she accepted.\nHowever, she said the man asked if the sale could be done through Pay Pal, rather than Ebay which she also agreed to.\n“I know it was a stupid thing to do but it seemed legitimate and looked genuine.”, Joanne said.\nFull story here. Today's weather forecast\n“Cloudy and very windy with outbreaks of rain soon spreading in from the west, persisting over western hills. Winds easing in the evening as the rain gradually clears eastwards. Maximum temperature 10 °C.” Get in touch\nIf you would like to get in touch with us today about any breaking news, here are my details:\nPhone: 0191 201 6107", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15560701;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-18T07:00:00.000+02:00", "crawled": "2018-12-18T10:19:05.000+02:00", "highlightTitle": ""}