{"organizations": [], "uuid": "b22fe0a862ae4ac89cd1eb3382bcad0a0b845b15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15146784.ece/ALTERNATES/s1200/1_The-134th-Durham-Miners-Gala-Celebrates-Socialism.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/voters-labour-chair-ian-laverys-15530906", "country": "GB", "domain_rank": 21960, "title": "Voters in Labour chair Ian Lavery's constituency want a second Brexit referendum, according to new poll", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-18T18:00:00.000+02:00", "replies_count": 0, "uuid": "b22fe0a862ae4ac89cd1eb3382bcad0a0b845b15"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/voters-labour-chair-ian-laverys-15530906", "ord_in_thread": 0, "title": "Voters in Labour chair Ian Lavery's constituency want a second Brexit referendum, according to new poll", "locations": [], "entities": {"persons": [{"name": "ian lavery", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "wansbeck", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "people's vote", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Voters in Labour chair Ian Lavery's constituency want a second Brexit referendum, according to new poll Survey by supporters of a People's Vote is designed to put pressure on Labour chair Ian Lavery Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA majority of voters in Labour chair Ian Lavery's Wansbeck constituency want a second referendum on Brexit, according to a new poll.\nAnd almost seven out of 10 Labour voters in the seat support a second vote.\nThe survey was conducted by Populus and YouGov on behalf of the People's Vote, which is campaigning for another referendum.\nLabour says that it is keeping the option of supporting a so-called People's Vote \"on the table\", if MPs rejected Theresa May's proposed Brexit withdrawal agreement and if there is no general election.\nHowever, it is believed that some members of Labour's Shadow Cabinet are less keen on the idea than others. Mr Lavery is said to be one of those who believes another referendum would be a bad idea, and would anger Labour supporters in the North who backed Brexit in the 2016 referendum.\nThe survey of 521 Wansbeck voters found that 52% would support a second referendum, if MPs reject Theresa May's deal, and 48% would oppose holding a second referendum.\nAmong people who say they plan to vote Labour at the next election, 69% support a second vote.\nAnd support for the UK staying in the EU has grown sharply since the referendum in 2016, moving from a 12-point lead for Leave to an almost even split of 49 in favour of remain to 51 in favour of leaving – a swing of five points. Wansbeck MP Ian Lavery\nNo less than two-thirds of Labour voters (66%) in Wansbeck would now vote to stay in the EU.\nWhen voters in the constituency were asked how they would react if Labour ended up backing any form of Brexit deal alongside Conservative MPs, support for Labour plummets from 59% to 40% - with the anti-Brexit Liberal Democrat party surging from 6% to 26%. Read More Theresa May appears to have delayed the Brexit vote to avoid a devastating defeat\nMr Lavery said he wasn't aware of the poll.\nHe added: \"I have been sticking by the fact that I was elected on a manifesto pledge to respect the result of a referendum in which 17.4m people voted.\n\"The result in Wansbeck was heavily in support of leave. I was a remainer, and I respect the result of the referendum.\n\"To suggest that people want a people's vote is a little disrespectful, because there has already been a people's vote. Who voted in the referendum? The people.\n\"But I do understand both sides of the argument. We need to continue to try to bring people together, because this is and continues to be a very divisive issue.\"\nHe added: \"I have listened to lots of people in my constituency as I always do, and that split remains.\n\"My view is that people are fed up with Brexit but most people are clear that we should be leaving.\n\"I'll continue to listen to what everybody has to say.\"\nThe survey findings come as backing for the People’s Vote campaign grows stronger across Labour’s backbenches with more than a dozen MPs indicating their support in the past week.\nBridget Phillipson, Labour MP for Houghton & Sunderland South, said: \"Brexit will fail to solve any of the problems that really matter to this country and the hard truth is it will make lots of them far worse.\n\"We won’t get more money for our NHS by self-inflicting harm on our economy. We won’t create more jobs in the car and chemicals industries by putting up barriers to trade with Europe. We won’t grow wages by accepting a Brexit deal that will make the country poorer.\n\"What we need is new thinking, new ideas and new solutions that tackle the real challenges facing communities across the UK, that's why this weekend I will join colleagues from across Yorkshire and the North East to begin a conversation about how we build a more prosperous future for every part of our country.\"\nPhil Wilson, Labour MP for Sedgefield, said: “Brexit has been a gigantic three year distraction that's wasted time and energy we should have spent fixing the real problems this country faces.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-18T18:00:00.000+02:00", "crawled": "2018-12-18T18:18:28.018+02:00", "highlightTitle": ""}