{"organizations": [], "uuid": "c03aa88855a3e9dbf0d05cb50c2ad2d95577a515", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1754900.ece/ALTERNATES/s1200/BMEpL63O.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/news-opinion/need-invest-heavily-understanding-tackling-2344617", "country": "GB", "title": "We need to invest heavily in understanding and tackling dementia", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T14:35:00.000+02:00", "replies_count": 0, "uuid": "c03aa88855a3e9dbf0d05cb50c2ad2d95577a515"}, "author": "Neil Parish", "url": "https://www.devonlive.com/news/news-opinion/need-invest-heavily-understanding-tackling-2344617", "ord_in_thread": 0, "title": "We need to invest heavily in understanding and tackling dementia", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "world dementia council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion We need to invest heavily in understanding and tackling dementia Neil Parish MP says that as we live longer, dementia will touch more of our lives, so we urgently need to find ways to combat and cope with its effects. Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010\nAt one stage last week, I really did think Christmas would be cancelled. Thankfully, it has not been – and we do actually have a short break from politics and Brexit until the New Year.\nHow we leave the European Union is certainly important and will affect our lives in many ways. We must get it right. But a break from the febrile atmosphere, for all concerned, is much needed.\nLast week, amongst all things Brexit, world leaders met at the World Dementia Council. They were there to coordinate efforts toward effective dementia therapy by 2025. As we live longer, dementia will touch more of our lives, so we urgently need to find ways to combat and cope with its effects. Neil Parish MP\nUnknown to many, ‘dementia’ is actually a set of symptoms, including memory loss. It can be caused when the brain is damaged by diseases, such as Alzheimer’s or a series of strokes. Unfortunately, my dear mother suffered a stroke earlier this year. But instead of changing the way she lives, medical professionals have advised her to continue doing everything she used to do, to keep pathways clear in the brain and encourage activity. This shows the still-developing medical theories in this area and how we can help maintain quality of life for people as they get older. Read More PM must renegotiate as no chance of getting current Brexit deal through Parliament\nClearly, we need to invest heavily in understanding and tackling dementia. Over the next 20 years, the number of people over the age of 85 is set to double. In the next decade, the number of people with dementia is set to hit 1 million. The Government must meet the challenge.\nI am glad, therefore, that we have doubled research spending on dementia to over £300 million - and opened the UK's first ever Dementia Research Institute. This is a good start. But we also need to ensure people receive the dignified care they deserve. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-19T14:35:00.000+02:00", "crawled": "2018-12-19T14:54:31.033+02:00", "highlightTitle": ""}