{"organizations": [], "uuid": "6527fe1d75d825067cddf1e5a7f84c3b167e6553", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15543970.ece/ALTERNATES/s1200/0_may3.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-happens-next-with-brexit-15544571", "country": "GB", "domain_rank": 21960, "title": "What happens now with Brexit? Theresa May's next move after no confidence vote", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-13T00:13:00.000+02:00", "replies_count": 0, "uuid": "6527fe1d75d825067cddf1e5a7f84c3b167e6553"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-happens-next-with-brexit-15544571", "ord_in_thread": 0, "title": "What happens now with Brexit? Theresa May's next move after no confidence vote", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "neutral"}], "locations": [{"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "government's brexit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What happens now with Brexit? Theresa May's next move after no confidence vote Prime Minister Theresa May has survived a vote of no confidence triggered by her own backbenchers - so what happens now with the Government's Brexit policy Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTheresa May lives to fight another day.\nThe Prime Minister has come through the latest challenge put in front of her but the road ahead looks even trickier.\nConservative MPs rejected an attempt to oust her with a vote of no confidence in Westminster on Wednesday night after a dramatic 13 hours of uncertainty.\nBut she did not win the unanimous backing of her MPs: 200 voted in favour of Mrs May's continued leadership but 117 said they had no confidence in her.\nHer less-than emphatic victory came at a price too.\nThe Prime Minister had to promise MPs she would resign before the next election, meaning a Tory leadership election could be on the cards as early as next year.\nSo what happens to the Government's Brexit policy now? Has anything changed? Will the EU be listening?\nHere are all the scenarios, as reported by Mirror Online . What does Mrs May do now?\nHaving survived her confidence vote, the PM gets back on the plane to Brussels on Thursday morning where anxious EU leaders are gathering for their monthly summit.\nMrs May will get a chance to update the her counterparts who can then ask her questions. Read More\nThey will then go into private session, without Mrs May, to discuss Brexit before European Council president Donald Tusk and European Commission president Jean-Claude Juncker hold a press conference around 6pm [UK time].\nWith the clock ticking, Brussels is also expected to step up its own no deal preparations. What is her gameplan?\nThe PM is desparately seeking help from the EU to win over mutinuous Tory MPs in support of her deal.\nMore than 100 have spoken out publicly against it, in addition to the Democratic Unionist Party which props up the fragile Tory government.\nHer only realistic chance of getting her withdrawal agreement through parliament is to persuade sceptical Tory and DUP Brexiteers the UK will not be trapped in the Irish border backstop indefinitely.\nBrexiteer ministers have insisted that any change has to be legally binding. Read More How will she try to tweak her Brexit deal?\nDowning Street has several ideas under discussion.\nOne is to ask Brussels for a letter of intent on the political declaration, which Tory sources have suggested could include the EU defining “temporary” as lasting for as little as three years.\nMrs May’s officials are also hoping to agree a clearer route out of the backstop through a legal “codicil” to the withdrawal agreement.\nMrs May wants to offer MPs - and possibly the European Parliament - an annual vote on whether to remain in the backstop if it is ever triggered. Will she get what she wants?\nUnlikely.\nTusk says he is keen to help “facilitate UK ratification” and providing warm words shouldn’t be a problem for the EU.\nBut she will come up against a brick wall if she proposes any legal alterations to the substance of the withdrawal agreement. Read More Money Saving Expert Martin Lewis on how Brexit could impact house prices and mortgage rates\nJuncker told her this week there was “no room whatsoever” to renegotiate the backstop, while German Chancellor Angela Merkel said there was “no way” to change the deal.\nBrussels will not accept anything which prevents the backstop to avoid a hard border from coming into effect. But will her plans be enough to buy off her Tory rebels?\nProbably not.\nThey have already dismissed the idea of a letter from the EU as a “figleaf” and have demanded legally binding assurances, which the EU has refused to give.\nIn the unlikely event Mrs May persuades Brussels to agree to give the UK a unilateral exit from the backstop - backbenchers would only support it if attorney general Geoffrey Cox made a statement guaranteeing it was legally binding.\nEven if the PM resorts to threatening no deal to get what she wants, Tory Brexiteers think that EU diplomats wouldn't believe she would follow through. When will the meaningful take place?\nDowning Street has confirmed that the postponed vote on Mrs May’s Brexit deal will take place before January 21st, even though technically she has until the eve of Brexit on March 29th.\nBut No 10 said Mrs May would “keep the spirit” of the EU withdrawal act and make statement on how she intended to proceed in the event of Brexit talks breaking down.\nAlthough the vote could still take place before Christmas, Tory insiders have indicated early January is more likely as they hope the holiday will take the heat out of the rebellion What other options are on the table?\nIn a word: everything.\nJeremy Corbyn has said it was a matter of “when, not if” Labour tables a no confidence motion against the government in the House of Commons.\nMuch depends on the DUP, with rumours swirling they might vote against the government at first and back it in the second vote 14 days later, on the condition Theresa May steps down and a new Tory leader is ushered in. Read More 'I'm fed up with the Brexit negativity and the European religion!' Wetherspoons boss speaks in Newcastle pub\nBut it is improbable that a Brexiteer Tory leader would get the Commons behind them.\nIf Labour then failed to form a government, a general election would follow 21 days later under the Fixed Term Parliament Act. What about a second referendum? Anti-Brexit campaigners take part in the People's Vote March for the Future in London, a march and rally in support of a second EU referendum. (Image: PA)\nMrs May has ruled out going back to the people, saying it is too divisive.\nDowning Street doesn’t want a referendum, nor is it planning for one.\nBut senior Number 10 sources believe this is where the country could end up.\nIt is also Labour’s second choice option, and senior figures have insisted that it could only ever be an absolute last resort.\nBut the longer that parliament remains deadlocked on Brexit , the more likely it is to happen. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://www.google.com/url?q=https%3A%2F%2Fwww.mirror.co.uk%2Fnews%2Fpolitics%2Fbrexit-what-happens-theresa-may-13726314&sa=D&source=hangouts&ust=1544736961205000&usg=AFQjCNFPCcLtyPEZV-gresCA-v31DtW1jg"], "published": "2018-12-13T00:13:00.000+02:00", "crawled": "2018-12-13T03:43:59.003+02:00", "highlightTitle": ""}