{"organizations": [], "uuid": "a157353d3fa0c98fe9838c880f506f4d3857efc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15543975.ece/ALTERNATES/s1200/0_may4.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-stays-prime-minister-after-15544158", "country": "GB", "domain_rank": 21960, "title": "Theresa May stays as Prime Minister after winning vote of no confidence - but she'll quit before 2022", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T23:15:00.000+02:00", "replies_count": 0, "uuid": "a157353d3fa0c98fe9838c880f506f4d3857efc7"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-stays-prime-minister-after-15544158", "ord_in_thread": 0, "title": "Theresa May stays as Prime Minister after winning vote of no confidence - but she'll quit before 2022", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How the North East voted - in full Prime Minister says she has a plan to end Brexit chaos\nMrs May is now safe from further challenges. Conservative Party rules state there can be no further confidence vote for a year.\nThis does not prevent Labour calling for a vote of no confidence in the Government in the Commons Chamber - an entirely separate procedure.\nAnd some Conservative MPs say that another move to depose Mrs May is possible, if she fails to secure a Brexit agreement that is acceptable to the House of Commons.\nEven if a formal vote is impossible, Tories could simply make it clear to her that they no longer have confidence in her, some MPs say. Prime Minister Theresa May leaves 10 Downing Street (Image: Leon Neal/Getty Images)\nThe Prime Minister also told Conservative MPs she had a way to solve her Brexit dilemma.\nShe reportedly said that a legally binding solution was coming to the “backstop” issue. This is the part of her proposed Brexit withdrawal agreement that has sparked a lot of opposition from Conservative MPs, as well as her allies in the DUP, a Northern Ireland party.\nIf this is true, it might help her get her proposed deal through Parliament. Read More North East Conservative backed Theresa May\nGuy Opperman, Conservative MP for Hexham, said he would support the Prime Minister.\nHe said: “I will be supporting the Prime Minister tonight. To indulge in a leadership contest now is completely wrong. The Prime Minister, Theresa May, is giving everything for this country and continues to work with immense integrity, grit and determination.\n“I am saddened that some colleagues have decided to do this - just as the PM is having a series of international meetings trying to deliver Brexit. We should be getting behind Theresa May in these difficult times” Guy Opperman (Image: Newcastle Chronicle)\nNorthumberland Conservative Anne-Marie Trevelyan, MP for Berwick-upon-Tweed, did not reveal how she voted but said in a statement that she would “take time” to think about it.\nShe said: “I will take some time today to think about how to vote. I will respect the secret ballot process and I will therefore not be discussing which way I will vote once I have reached my decision.”\nBut she stressed the could not support Theresa May’s proposed Brexit withdrawal agreement without major changes.\n“On how we proceed with ensuring we deliver Brexit, despite many voices in Parliament determined to ignore the result of the referendum, as I have said since the Prime Minister unveiled her deal with the EU – there is much in the deal to be celebrated and which would honour the result of the referendum.\n“However, the Northern Ireland Protocol – the “backstop” – if triggered would force us into a perpetual customs union that we could never leave, which is unacceptable.” Labour says the vote changes nothing\nJeremy Corbyn MP, Labour Party leader , responding to the Conservative vote of no confidence in the Prime Minister, said: \"Tonight’s vote makes no difference to the lives of our people.\n\"The Prime Minister has lost her majority in Parliament, her government is in chaos and she is unable to deliver a Brexit deal that works for the country and puts jobs and the economy first. Labour leader Jeremy Corbyn walks through Downing Street ahead of the remembrance service at the Cenotaph memorial in Whitehall, central London, on the 100th anniversary of the signing of the Armistice which marked the end of the First World War (Image: PA)\n\"That’s why she pulled the vote on her botched Brexit deal this week and is trying to avoid bringing it back to Parliament. It’s clear that she has not been able to negotiate the necessary changes in Europe.\n\"She must now bring her dismal deal back to the House of Commons next week so Parliament can take back control.\n\"Labour is ready to govern for the whole country and deliver a deal that protects living standards and workers’ rights.\" Like us on Facebook", "external_links": [], "published": "2018-12-12T23:15:00.000+02:00", "crawled": "2018-12-12T23:34:37.016+02:00", "highlightTitle": ""}