{"organizations": [], "uuid": "c99b32456a14037da6f756c5e5e1b2b647ed7faf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/article2275055.ece/ALTERNATES/s1200/0_Nathalie.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/reality-devons-27000-europeans-living-2274996", "country": "US", "title": "This is the reality for Devon’s 27,000 Europeans living in Brexit limbo - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-12-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "c99b32456a14037da6f756c5e5e1b2b647ed7faf"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/reality-devons-27000-europeans-living-2274996", "ord_in_thread": 0, "title": "This is the reality for Devon’s 27,000 Europeans living in Brexit limbo - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "nathalie pilorget", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "french consulate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News This is the reality for Devon’s 27,000 Europeans living in Brexit limbo The number of Europeans living in Devon has slumped by 6,000 since the Brexit vote because no-one knows what the future holds Share Nathalie Pilorget, a French national living in Devon, joined the #lastmile march at Westminster to preserve the rights of EU workers post-Brexit. Pictured at the French Consulate.\nFor more than two years since the outcome of the Brexit referendum, thousands of Europeans living and working in Devon have been living in limbo.\nAccording to the latest ONS figures for July 2017 - June 2018 , there are around 27,000 people from the EU currently living in the county - that’s about the same population as Newton Abbot in South Devon.\nAnd since Brexit, the number has dropped by around 6,000 on the last count, from January to December 2017. There were anti-Brexit protests in Exeter back in October Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nEU citizens accounts for about 2% of Devon’s population - that’s not much on the face of it, until you consider the huge role they are playing in filling thousands of jobs in healthcare, farming and tourism.\nOnly last month, Devon County Council boss Phil Norrey warned of a care crisis post-Brexit with many workers saying they now felt unwelcome .\nSo it’s clear that it's not just the economic impact that matters. Nathalie Pilorget, a French national living in Devon, joined the #lastmile march at Westminster to preserve the rights of EU workers post-Brexit. Pictured at the French Consulate.\nNathalie Pilorget is an International (sales) Account Manager who works in Exeter but was born and brought up in France.\nA French national, she has lived in Devon for 12 years and last year moved into her very own home in Torquay.\nShe said: “The day after the referendum, I was devastated. It felt that something had died, it’s difficult to describe but it felt like a grief for the Britain that I loved or the one that I thought existed but perhaps never did.\n“But over time, I realised that the Britain I loved was still there and for many people they didn’t realise what they had voted for because a lot of lies were told.”\nLast month, Nathalie became a first-time activist, joining the #lastmile citizens’ lobby at Westminster, organised by 3million , a campaign group fighting for the rights of EU citizens in the UK. Read More Forthglade set to make millions of dogs dinners in Okehampton\nNathalie said she felt so strongly that she took the day off work to join fellow campaigners on the march.\n“I really felt that I had to add my feelings for the campaign but I don’t feel that we got anywhere. It was just words.”\nThere is still much to be clarified in the UK’s plan for immigration post Brexit, said Lisa Mulholland, solicitor in the immigration team at Stephens Scown in Exeter.\nShe explained that the Draft Withdrawal Agreement confirms that the rights of European citizens living in the UK and for Brits abroad, are likely to be preserved.\nHowever, the automatic right to live and work will end at the end of the transition period or if there’s a no-deal, could be as soon 30 March 30, 2019. The facts: EU workers in Devon\nIn Devon, 5.4% of the population are non-UK citizens and 2% are EU citizens which is lower than the UK average of 13.3% and 5% respectively.\nOf EU citizens, 80% are working age. 46% are here to work, 10% are here to study and 35% are accompanying a family member.\nEU workers are more likely to work in excess of 40 hours per week; on average, 26% of UK workers exceed 40 hours per week, but this figure rises to 49% when examining EU citizens.\nWithin the South West region, Polish citizens are the most populace nationality, followed by Indians; Germans, South Africans and Irish.\nIn the South West, 50% of all EU workers are employed in the manufacturing , retail and hospitality industries.\nThe social care sector also employs significant numbers of migrant labour.\nThe agricultural sector also relies on casual and seasonal labour and increases in labour costs that may emerge as a result of changes to migration may impact those businesses in particular.\nThe high-value manufacturing and construction sectors use EU nationals to fill higher-level skills gaps while Universities recruit researchers and teaching staff from around the world.\nA reduction in this labour could result in wage increases for domestic workers, but could also exacerbate recruitment difficulties for some firms and lead to higher prices for consumers. The BREXIT: Potential impacts on the Devon economy report that went before Devon County Council's Corporate, Infrastructure and Regulatory Services Scrutiny Committee on 31 January 2018\nEuropeans will be treated like any other foreign national wanting to work here and it will be skills and salary based.\nIn practical terms, it means that after the transition period, all EU nationals in will be required to submit applications to the Home Office under the EU Settlement Scheme if they want to stay living and working in the UK. Those living in the UK for five years will need to apply for settled status.\nAnd those who have been here for less than five years will need to apply for pre-settled status, with a view to obtaining settled status later.\nThe scheme will be implemented on a phased basis and will be fully open to all EU nationals in the UK by 30 March 2019. Lisa Mulholland, immigration specialist lawyer at Stephens Scown (Image: Ian Jackson)\nAnd while Nathalie believes that because she has lived and worked in the UK for so long, she should be granted settled status, there are no guarantees.\nShe said: “The clue is in the word ‘apply for settled status’ which means it is not automatic and you can get rejected if you don’t meet the criteria.\n“It may be that I will be fine but it’s not right just to think of myself. I am thinking about the women who have not worked because they have had children, people who have had to claim benefits or have gone abroad to work for a few years and come back again.\n“The government don’t seem to have taken that into account.” Read More Is tech the future of the post-Brexit economy in the South West?\nAnd the spectre of the Windrush Generation looms large over any promises made right now.\nNathalie explained: “They too were made similar promises which we have found have not held up through the years.”\nAnd she is concerned for her own future - what happens if she goes to apply for a job or wants to make a fresh mortgage application?\n“I am concerned that potential employers will just put me to the bottom of the pile because they don’t want to deal with the complexity or are worried that I may be illegal in some way.\n“I have considered leaving the UK but it would be a real heartache for me because my life is here and all my friends. This is where I have made my home.”\nLisa Mulholland explained that while the main concern for individuals is uncertainty about their status in the UK, for business, it is about future recruitment.\nIn future, as Theresa May controversially put it, there will be ‘ no jumping the queue ’.\nIt means that without free movement, businesses will need to sponsor overseas nationals under the current work permit system. Read More Ex-Dyson boss backs Devon's smart car pioneers Lightfoot\nBusinesses will have to apply for a sponsor licence and the salaries for some jobs in Devon and Cornwall will not be high enough to meet the current salary threshold test. Official opening of the new dementia community at Exeter care home the Old Rectory, in 2016. Judi Spiers cuts the ribbon with, from left: Claire Gee, home manager, Paul Courtney, operations manager, Southern Healthcare, Karen Bolt, director of administration, Southern Healthcare, Geoffrey Cox, managing director, Southern Healthcare, Margot Whittaker, director of nursing\nGeoffrey Cox is the managing director of Southern Healthcare, which operates six residential and care homes in Devon, three with an outstanding CQC rating.\nHe says that the minimum wage means that there is no such thing as ‘cheap labour’ but there is a desperate shortage of good nurses and care staff.\nHe said: “In the UK, people shy away from things that tend to be hard work and care work is quite hard. We rely on a group of people who are in a minority, who are fit and agile but more importantly are caring, affectionate and have empathy. These are soft skills that are in very short supply.”\nHe currently employs 220 staff and says around 80 are from the EU, including Romania, Poland and Latvia.\nOf 20 nursing staff, four are from the UK, 12 are from Europe and four are from Africa and the Philippines.\nHe said: “When we first started talking about Brexit, I thought it would never happen but from the moment it did, I thought ‘this is not good’”.\n“For my staff that are here, they should be able to stay because they are settled and working but the problem will be in recruiting from the EU in the future.\n“Already, recruitment is an absolute nightmare.”\nHe said that the current standards for English language for nurses outside the EU are so demanding that it is screening out good staff.\nThe business is a registered sponsorship employer but said that it is so costly and complex that it is ‘bordering on farcical.’\n“For all the years we have been trying, we have only managed to recruit one and that’s because our applications come back with things like: ‘we not satisfied that you have a genuine need for a nurse’.\n“They have not accepted that there is a clear shortage of nursing staff and that concerns me.\n“The problem is that the care sector has been maligned by the government for decades, it has not been properly invested in and people pick up on that.\n“For everything we say as a country, when it comes to elderly care, mental health and disability, we are still a seriously prejudiced nation.” Read More", "external_links": [], "published": "2018-12-03T02:00:00.000+02:00", "crawled": "2018-12-03T08:04:06.011+02:00", "highlightTitle": ""}