{"organizations": [], "uuid": "fd4bfdd91005130c85bbc494a6e92f0e1e0901aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15525334.ece/ALTERNATES/s1200/0_MMP_MGA_120216bus_14JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/heres-bus-passenger-numbers-falling-15536961", "country": "GB", "domain_rank": 21960, "title": "Here's why bus passenger numbers are falling in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-11T18:00:00.000+02:00", "replies_count": 0, "uuid": "fd4bfdd91005130c85bbc494a6e92f0e1e0901aa"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/heres-bus-passenger-numbers-falling-15536961", "ord_in_thread": 0, "title": "Here's why bus passenger numbers are falling in the North East", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "poulton", "sentiment": "none"}, {"name": "marshall poulton", "sentiment": "none"}], "locations": [{"name": "metro", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "east", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "wear metro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Here's why bus passenger numbers are falling in the North East Both bus and Metro numbers are down, transport officials say Share Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nNorth East travellers are turning their backs on buses and the Metro, transport bosses have warned.\nMillions of journeys are still made each year, but the numbers are falling.\nAnd local transport experts think congestion caused by the number of cars on the road may be partly to blame.\nMarshall Poulton, assistant director for transport at Newcastle City Council , said “congestion in and around the city centre” was slowing down bus journeys into Newcastle city centre, and services running between the East and West in the region.\nA fall in the number of Metro users may be connected to poor reliability, he said. Tyne and Wear Metro (Image: Newcastle Journal)\nHe was speaking at a seminar for transport leaders in the North of England, held in Manchester.\nMr Poulton, speaking in a personal capacity, said one answer to cutting congestion could be to increase parking charges in Newcastle city centre. This is not currently city council policy.\nHe said there were around 164 million bus passenger journeys each year in the area covered by the North East Combined Authority, which includes Newcastle, Gateshead , Sunderland, North Tyneside, South Tyneside, County Durham and Northumberland.\nBut the number had fallen by 22 million in recent years. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nAnd there are 36 million trips annually on the Metro system - but this is 1.3 million journeys fewer than a year ago.\nMr Poulton said: “Our general feeling is that from a bus perspective, the congestion in and around the city centre is preventing buses penetrating East-West and into Newcastle.\n“It’s not as bad on the North-South route, but East-West is definitely held up.\n“That is then maybe making the car more attractive to travel into the city centre.”\nCar travel may also appear to offer better value than bus transport, he said. Read More Labour MPs put pressure on Jeremy Corbyn to back second referendum that could cancel Brexit\nHe added: “I personally feel we’ve got to look at parking policies as well.\n“The supply of car parking and the pricing policy. It’s very affordable in Newcastle compared to other cities.”\nThe Metro was “very successful” and offered good value for money, he said.\nBut he added: “One challenge we’ve got there is the resilience of the network.\n“Sometimes it’s unreliable a bit further out from Newcastle, not so much in Newcastle itself.”\nBus passenger numbers have fallen across the country. Read More Northern Powerhouse Minister: 'There is a big problem with transport in the North'\nEarlier this year, the bus company that owns Go North East urged local councils to consider road-charging schemes to cut congestion on the roads.\nGo-Ahead Group, which provides 175,000 bus journeys every day under the Go North East brand name, said authorities should be more willing to introduce road charges, or to impose charges on workplace car parks used by employees.\nIn a written submission to House of Commons Transport Committee , Go-Ahead Group said councils should use the powers they already have in order to get cars off the roads and cut congestion. Read More Transport for the North: £60bn plan to cut rail times between Liverpool and Newcastle\nIt said: “Powers are available for local authorities to tackle congestion through the Traffic Management Act 2004 but are not effectively used and enforced.\n\"Through the Transport Act 2000, measures such as workplace charging/road user charging should be more readily deployed, as a means of achieving target journey times.”\nA congestion charge was introduced in London in 2003 and other parts of the country are now beginning to follow suit. Birmingham is introducing a “clean air zone”, which involves imposing charges on many private vehicles coming into the city centre, while Manchester City Council is considering a similar scheme. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-11T18:00:00.000+02:00", "crawled": "2018-12-11T20:35:43.013+02:00", "highlightTitle": ""}