{"organizations": [], "uuid": "3a03ca3c0f421434141cc8859836008d42b4a956", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15517395.ece/ALTERNATES/s1200/0_L-R-Enviresearch-MD-Dr-James-Garratt-Outline-Designs-David-Hardman-Mark-Thompson-from-Ryder-Ach.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-firms-club-together-15516997", "country": "GB", "domain_rank": 21960, "title": "North East firms club together and call for a People's Vote on Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-06T20:00:00.000+02:00", "replies_count": 0, "uuid": "3a03ca3c0f421434141cc8859836008d42b4a956"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-firms-club-together-15516997", "ord_in_thread": 0, "title": "North East firms club together and call for a People's Vote on Brexit", "locations": [], "entities": {"persons": [{"name": "michael prest", "sentiment": "none"}, {"name": "james garratt", "sentiment": "none"}, {"name": "richard swart", "sentiment": "none"}, {"name": "david hardman", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "mark thompson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "westgate road", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "enviresearch", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "berger group europe", "sentiment": "none"}, {"name": "eu share", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East firms club together and call for a People's Vote on Brexit Firms from across the region met to discuss what they can do to stop the UK leaving the EU Share (L-R) Enviresearch MD Dr James Garratt, Outline Design's David Hardman, Mark Thompson from Ryder Achitecture, Richard Swart from Berger Group Europe, and Michael Prest from InFacts (Image: Jonathon Manning) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nBusiness leaders from across the North East have banded together to campaign for a final vote on the UK’s Brexit deal before the country leaves the EU.\nRepresentatives from a range of industries met in Newcastle yesterday, December 6, for the first North East meeting of the Business for a People’s Vote campaign.\nThe meeting was intended to bring firms together and add their voice to the growing number of individuals calling for a vote on Prime Minister Theresa May’s Brexit deal.\nRyder Architecture hosted the meeting at its Westgate Road office, with the firm’s managing director Mark Thompson attending the meeting to show his support for the movement. Read More North East firms call for tough action as retailers are shamed for late payment culture\nAlso in attendance was Richard Swart, managing director at Peterlee’s Berger Group, David Hardman, partner at Outline Design, James Garratt, managing director of Enviresearch, and Newcastle Business School’s Professor Ignazio Cabras.\nDuring the meeting Business for a People’s Vote called on MPs to reject the Prime Minister’s deal when voting in Parliament next week.\nCommenting on the meeting’s aims, Mr Swart said: “First of all most businesses have suffered negative consequences since the 2016 referendum. Many people voted in either direction without understanding the issues fully. We have clear options presenting themselves, and in each option the Government’s impact scenarios confirm that we as a nation, and the North East, will be worse off. The first meeting in Newcastle of Business for a People's Vote (Image: Jonathon Manning)\n“It beggars belief that we would choose an option that would harm us. As we now have more details it is only right that, whatever the decision, we get it right and the people are offered the chance to support the options on the table or the status quo.”\nThe People’s Vote group has also called for MPs to resist the hope of striking a “Norway Plus” deal, where the UK would stay in the single market and customs union permanently. They believe such a deal would be scrapped by hardline Brexiteers in favour of a harder Brexit.\nOne of the criticisms of the last referendum campaign was that many businesses that were against Brexit were unwilling to raise their voice in support of Remain due to commercial and reputational factors. The campaign group is now calling for heads of industry to speak openly about the effects of Brexit on their firms.\nThe group is also looking for firms that will speak to their local MPs and media organisations to help grow support for the vote.\nMark Thompson, managing director of Ryder Architecture, said: “Brexit raises particular concerns for us over retaining and hiring people from elsewhere in the EU. We expect to open an office in Amsterdam in the New Year to help continue our international development and be a base for EU employees.” Read More Northern Gas and Power to open first Singapore office and create scores of new jobs\nDr James Garratt, managing director of Enviresearch, which provides risk assessment services to the chemicals industry, added: “Chemical safety is a big-scale issue. Laws around chemicals have been set by the EU: within the EU, all the stakeholders know that the rules are the same. By leaving the EU we will raise costs but we will not be raising safety standards. Does this make sense? The people should be asked.”\nBusinesses for a People’s Vote now wants to organise networking events across the country to raise support for a final vote on the proposed deal. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-06T20:00:00.000+02:00", "crawled": "2018-12-06T20:49:16.000+02:00", "highlightTitle": ""}