{"organizations": [], "uuid": "33fb60a4a3ea8f0dbc34b3b1233fd88d620914c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2281594.ece/ALTERNATES/s1200/2_HH5A6833JPG.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/what-would-no-deal-brexit-2315507", "country": "US", "title": "What would a No-Deal Brexit mean for Devon?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-11T15:42:00.000+02:00", "replies_count": 0, "uuid": "33fb60a4a3ea8f0dbc34b3b1233fd88d620914c6"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/what-would-no-deal-brexit-2315507", "ord_in_thread": 0, "title": "What would a No-Deal Brexit mean for Devon?", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "andy serkis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ian brokenshire", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gollum", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "plymouth kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nBusinesses in Devon are being warned to prepare for a no-deal Brexit.\nThe decision to delay a crucial vote has heightened fears that the UK could stumble into a no-deal exit from the EU in March.\nAnd businesses are already acting on their contingency plans if a deal cannot be agreed in time.\nWatch Gollum actor Andy Serkis poke fun at Theresa May's Brexit dilemma Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nIan Brokenshire, senior partner at Plymouth KPMG, said: “There's a mix of small businesses who have only just realised they need to act and larger businesses who are activating their plans. We think everybody needs to think about the basics and the surprises lurking in the detail of contracts, which may lead to suppliers not being able to deliver. Read More Brexit delay is a 'blow for business'\n\"There are a number of clients in the South West who simply can’t now hold off any longer before implementing contingencies. In general businesses like everyone else, are pondering how the next few months might turn out and what that means to the way they operate. Brexit is absorbing a great deal of time and energy in businesses across the region.”\nTheresa May is meeting European leaders and EU officials for talks aimed at rescuing her Brexit deal.\nShe needs further assurance about the Northern Ireland border plan to avoid a hard border before getting the backing she needs from MPs. Prime Minister Theresa May making a statement in the House of Commons, London, where she told MPs that the planned vote on her Brexit deal had been deferred (Image: PARBUL/PA Wire)\nBut the EU will not renegotiate the deal but there is room for clarification.\nMPs will have have to agree to Mrs May's deal before it can come into effect when the UK leaves the EU on 29 March.\nDowning Street has said a Commons vote will be held on the deal before 21 January.\nBut the deal is far from what the people voted for back in 2016, said Nathan Peacey, a partner at law firm Foot Anstey.\nHe said: \"I would take the Tardis back to 2016 and re-run the vote with a clear – and honest – articulation of the choices on the ballot paper and their consequences. The political gridlock we're in now was born out of the ambiguity over whether Leave meant a Norway-style deal, a 'hard' Brexit or something else altogether. As a result we have a fudged deal which doesn't bear much, if any, resemblance to what anyone was contemplating when they cast their vote for Remain or Leave. \"\nMr Peacey said that the risk of a no deal scenario is more real even if not yet a certainty.\nH said: \"Many businesses have already recognised that a plan for no deal is a prudent business protection measure – although the timeframe to make meaningful plans is fast disappearing.\"\nDaniel Sladen, Partner at PKF Francis Clark, said that the fear is that the Government’s tactic is to run down the clock and try and scare MPs into backing the deal rather than reaching an unintentional no-deal on 29 March. Read More Is tech the future of the post-Brexit economy in the South West?\n\"This has to mean that leaving with no deal is more likely, and that it may be quite a few weeks before we know what happens next. For any businesses that were keeping their contingency plans on hold, now is the time to take no-deal planning seriously and take any available steps to preserve access to goods, services and markets that their business relies on.\" Read More This is the reality for Devon’s 27,000 Europeans living in Brexit limbo\nA EU Court of Justice ruling on Monday concluded that the UK can unilaterally withdraw Article 50 and halt the Brexit process without getting permission from the EU.\nMr Sladen said: \"This gives the Government more options to pull back from its cliff-edge approach, but it’s not clear whether there is the political will to do this.\"\nStuart Brocklehurst, chief executive of online marketplace Applegate in Barnstaple, said that businesses need to be in good shape to stay competitive.\nHe said: \"It’s a good time to look at the fundamental health of your business: are you paying the right amount for your suppliers; if you’re reliant on existing customers do you know how you would win new ones if they went away? I’d caution against cutting back too hard on investment, however: the uncertainty around Brexit has already reduced this, and we risk leaving ourselves poorly equipped for future recovery if it drops further.” Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-11T15:42:00.000+02:00", "crawled": "2018-12-11T15:53:10.024+02:00", "highlightTitle": ""}