{"organizations": [], "uuid": "d40882a5335ea7e76e732981954a874d7fd6335b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15572954.ece/ALTERNATES/s1200/0_Glaxo-Wellcome-Cephalosporins-Manufacturing-Building.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/glaxosmithkline-agrees-tie-up-pfizer-15572784", "country": "GB", "domain_rank": 21960, "title": "GlaxoSmithKline agrees tie-up with Pfizer in move that could lead to job cuts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T16:03:00.000+02:00", "replies_count": 0, "uuid": "d40882a5335ea7e76e732981954a874d7fd6335b"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/glaxosmithkline-agrees-tie-up-pfizer-15572784", "ord_in_thread": 0, "title": "GlaxoSmithKline agrees tie-up with Pfizer in move that could lead to job cuts", "locations": [], "entities": {"persons": [{"name": "emma walmsley", "sentiment": "none"}], "locations": [{"name": "barna", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "castle county durham", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "barnard castle", "sentiment": "none"}], "organizations": [{"name": "glaxosmithkline", "sentiment": "negative"}, {"name": "glaxo wellcome plc cephalosporins manufacturing building", "sentiment": "negative"}, {"name": "pfizer", "sentiment": "negative"}, {"name": "glaxo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Glaxo Wellcome PLC Cephalosporins Manufacturing Building their secondary manufacturing site in Barnard Castle County Durham (Image: Publicity Picture)\nOne of the region’s major employers has agreed a £9.8bn deal with a global rival which it says will impact on jobs.\nBritish drugs giant GlaxoSmithKline, which has a plant in Barnard Castle, County Durham ,\nhas agreed a tie-up with US rival Pfizer to merge their consumer healthcare divisions to create a business with combined sales of £9.8bn.\nThe deal paves the way for a break-up of Glaxo into two separate UK-based companies - one focused on pharmaceuticals and vaccines, and the other on consumer healthcare - within three years of the completing joint venture.\nGlaxo has admitted there will be an impact on staff under aims to slash annual costs by £500m following the Pfizer deal, but said it was too early to give details. Emma Walmsley of GlaxoSmithKline (Image: PA)\nEmma Walmsley, chief executive of Glaxo, said: “Obviously there’s going to be some impact on people.\n“That’s something we are working through and we will certainly be talking to our employees before we start talking about that in any way publicly.”\nEarlier this year Glaxo revealed it was cutting 200 jobs at its Barnard Castle site, despite investing more than £100m on upgrades and expansion at the facility over the last two years.\nAfter the company’s joint venture deal was announced this morning, shares in Glaxo rose by 7%. Read More New Virgin Money owner given entry to £350m scheme to increase competition in banking\nUnder terms of the all-share deal, Glaxo will own 68% of the consumer healthcare joint venture, while US firm Pfizer will own the remaining 32% stake. It will bring together Glaxo’s brands such as Sensodyne, Aquafresh and Panadol with Pfizer’s Advil and Centrum.\nThe firms are aiming to complete the joint venture in the second half of 2019.\nIt comes after pressure from shareholders for Glaxo to spin off its consumer division.\nBut Ms Walmsley said plans to make the consumer business a separate listing in a few years’ time would allow Brexit “uncertainties” to subside.\n“I’m confident we’ll be in a more stable environment than we are in today,” she said. Read More Champagne bar pulls into Newcastle Central Station to serve bubbles and real ale\nOn Brexit contingency planning, she added: “For GSK, what we’re focused on in terms of Brexit, whatever the scenario might be, is ensuring the supply of vaccines and products that people need.\n“We have been working on that for some time with the Government and we’re confident we can be ready in all scenarios for that.”\nThe consumer healthcare joint venture will be the market leader after the tie-up, with a 7.3% share and a presence in more than 100 countries.\nThe deal comes after Glaxo pulled out of an auction for Pfizer’s consumer business earlier this year. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-19T16:03:00.000+02:00", "crawled": "2018-12-19T20:37:33.000+02:00", "highlightTitle": ""}