{"organizations": [], "uuid": "c83113eb1431c1f67df55cd21be1afef2b95cf73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15521194.ece/ALTERNATES/s1200/1_may-downing.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/pmqs-live-updates-theresa-answers-15571146", "country": "GB", "domain_rank": 21960, "title": "PMQs LIVE: Updates as Theresa May answers questions on no deal Brexit preparations", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T13:00:00.000+02:00", "replies_count": 0, "uuid": "c83113eb1431c1f67df55cd21be1afef2b95cf73"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/pmqs-live-updates-theresa-answers-15571146", "ord_in_thread": 0, "title": "PMQs LIVE: Updates as Theresa May answers questions on no deal Brexit preparations", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "paul hodges", "sentiment": "none"}, {"name": "hodges", "sentiment": "none"}, {"name": "kathryn riddell", "sentiment": "none"}], "locations": [{"name": "brexit britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "ready for brexit", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour leader Jeremy Corbyn has told the House of Commons: “I did not use thewords ‘stupid woman’ about the Prime Minister or anyone else.” 15:33\nTaking to Twitter , Piers demanded Mr Corbyn apologise to Mrs May, the Mirror reports.Piers furiously tweeted: “Unbelievable. Corbyn’s now denying saying ‘stupid woman’ to Theresa May,” “This is obviously a flagrant lie. Shocking that he is trying to dig himself into an even deeper hole. For God’s sake @jeremycorbyn - WE CAN SEE YOU SAYING IT. Come back to the House & profusely apologise.” Piers also took aim at the Speaker, John Bercow , over the incident, tweeting: “ Astonishing scenes in the Commons. Speaker Bercow, who refused to apologise for calling Andrea Leadsom a ‘stupid woman’, now refusing to call back Corbyn to apologise for calling Theresa May a ‘stupid woman’.\n“Female MPs rightly furious. Shocking sexism by Corbyn.” 15:09 May on Corbyn apologising\nTheresa May has suggested Jeremy Corbyn apologise if he used “inappropriate language” during PMQs.Asked if she wanted an apology after the Labour leader was accused of mouthing “stupid woman”, the Prime Minister said:\n“The Speaker made very clear that if a Member of Parliament uses inappropriate language, then they should apologise.” 14:25 Kathryn Riddell Prime Minister accused of 'criminal waste of money'\nTheresa May has ramped up no-deal plans with 3,500 troops on standby in a bid to persuade MPs to back her deal.\nMr Corbyn said this was trying to blackmail the Commons - adding MPs could simply block no deal.\nAnd he blasted the PM after she refused to guarantee she will not delay a Commons vote on her deal yet again.\n“What the Prime Minister is doing is a criminal waste of money,” he told MPs.\n“The Prime Minister is recklessly running down the clock all in a shameful attempt to make her own bad deal look like the lesser of two evils.” 14:19 Kathryn Riddell Theresa May's response about 'appropriate language'\nTory MP Paul Scully raised the comment during PMQs, asking Mrs May: “You helpfully circulated an update on the behaviour in this place. In this year when we’ve been celebrating 100 years of women getting the vote, do you think it’s appropriate language … to call people a ‘stupid woman’ in this chamber?”\nMrs May replied: “I think that everybody in this house, particularly in this 100th year anniversary of women getting the vote, should be aiming to encourage women to come in to this chamber and to stand in this chamber - and should therefore use appropriate language in this chamber when they refer to female members.” 14:11 Kathryn Riddell Actor Rob Lowe gives his opinion\nHollywood actor Rob Lowe has even weighed into the debate about whether Corbyn said “woman” or “people”.\nMr Corbyn has denied the allegations he said “woman”. 14:01 Kathryn Riddell Tory MP calls for action from Speaker\nTory MP Anna Soubry exploded with fury, telling Speaker Bercow: “With respect to the chair, I have to say this. If it was one of my male colleagues on this side of the House that had used that expression against a woman on the Front Bench on the opposition, you sir would take action immediately. Conservative MP Anna Soubry (Image: Nottingham Post )\n“This is not acceptable. Please would you deal with it, as you often do Mr Speaker, in a fair way, but also from the point of view of women in this house who are fed up over decades of being abused by men.” 13:53 Kathryn Riddell May claims Corbyn has no Brexit plan\nIt came after a fraught exchange, in which Mr Corbyn reminded Mrs May the next meeting of the European Council was not until March - two months after the rescheduled meaningful vote is supposed to take place. Prime Minister Theresa May speaks during Prime Minister's Questions in the House of Commons (Image: PA)\nHe said: “She will be bringing back the same deal she pulled last week - it’s an intolerable situation and she is simply playing for time.”\nMrs May said her “achievements” with EU negotiators would be set out in the new year and again insisted Mr Corbyn had no alternative Brexit deal.\nShe said: “I know it’s Christmas and he has looked in his stocking, down the chimney, under the Christmas tree, but he still has not found a Brexit plan.\n“He has to accept his responsibility for delivering on Brexit.” 13:43 Kathryn Riddell Tempers high as Tories try to show video\nTory MPs later shouted “disgraceful” and “shameful” when ex-minister Patrick McLoughlin accused Mr Corbyn of saying the words.\nCommons Speaker John Bercow said he did not see the alleged utterance, but that anyone who did breach rules should apologise.\nAs tempers frayed in the Commons chamber, the situation spiralled out of control, with Tory MPs waving phones at the speaker in a bid to show him evidence of the moment in question. 13:35 Kathryn Riddell Corbyn in sexism row but denies saying 'stupid woman'\nJeremy Corbyn has denied calling Theresa May a “stupid woman” during a fiery Prime Minister’s Questions.\nA video of the session on Wednesday showed the Labour leader saying something under his breath after the Prime Minister likened Labour ’s attempt to table a no confidence motion against her to a pantomime.\nHealth Secretary Matt Hancock wrote on Twitter : “The mask slips. Jeremy Corbyn’s abuse of the Prime Minister shows what a reactionary misogynist he is”.\nHe added: “Unreal how Corbyn supporters are actually *defending* him calling the PM a “stupid woman”. Sickening. This misogyny now runs deep in Corbyn’s Labour - and runs right to the top.” Jeremy Corbyn and Theresa May, who will lead their party the longest?\nConservative Party chairman Brandon Lewis said on Twitter: “Will @jeremycorbyn apologise or clarify exactly what he was saying? Looks shocking on the film, unacceptable in any environment.”\nBut a spokesman for Mr Corbyn said: “He did not call her a stupid woman. He was saying ‘stupid people’.” 13:11", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15571146;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-19T13:00:00.000+02:00", "crawled": "2018-12-19T14:08:02.022+02:00", "highlightTitle": ""}