{"organizations": [], "uuid": "5162e0373f6b02633faa7a8bdc96b67d744f9fe5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.cornwalllive.com/incoming/article1495343.ece/ALTERNATES/s1200/2_Embraer-Flybe-195-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/flybe-takeover-talks-continue-virgin-2343755", "country": "GB", "title": "Flybe takeover talks continue with Virgin Atlantic", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T12:27:00.000+02:00", "replies_count": 0, "uuid": "5162e0373f6b02633faa7a8bdc96b67d744f9fe5"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/flybe-takeover-talks-continue-virgin-2343755", "ord_in_thread": 0, "title": "Flybe takeover talks continue with Virgin Atlantic", "locations": [], "entities": {"persons": [{"name": "richard branson", "sentiment": "none"}, {"name": "stobart", "sentiment": "none"}], "locations": [{"name": "virgin atlantic flybe", "sentiment": "none"}, {"name": "virgin atlantic virgin atlantic", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "virgin atlantic", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "british airways", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Flybe takeover talks continue with Virgin Atlantic Virgin Atlantic is said to be considering over the acquisition of Flybe Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nTalks are continuing with Virgin Atlantic over a potential takeover of Exeter airline Flybe.\nVirgin, which is part owned by Sir Richard Branson, first announced its interest last month.\nThe group said on Wednesday that it \"continues to review its options in respect of Flybe, including potentially making an offer.\n\"Accordingly, discussions with Flybe and its management are continuing.\"Virgin is thought to be vying with Stobart and British Airways to buy Flybe and is interested in its take-off and landing slots at London's Heathrow Airport. Read More What's happened to Flybe?\nThe regional airline employs more than 1,000 people in Exeter. It put itself up for sale in November after warning over profits earlier in the year. The Exeter-based carrier is battling challenging conditions in the airline industry and has suffered with falling demand and a £29 million hit from rising fuel costs and the weak pound.\nEconomic bosses in the region have raised concern about any potential sale and insist that the headquarters must remain in Exeter because of the massive contribution it makes to the region . A Flybe dash-8 plane at Exeter Airport\nFlybe has 78 planes operating from smaller airports including London City, Southampton and Norwich, and flies to destinations across the UK and Europe. Five reasons why Flybe is struggling to make money\n1. Passengers are feeling the pinch\nJust like the high street, Flybe is at the mercy of the consumer. It means things like the 'Beast from the East' or Storm Callum puts people off flying or means flights are cancelled. And if consumers are losing jobs or feeling the pinch because of rising household bills, the first thing to drop off the budget is a trip abroad.\n2. Brexit\nThe risks associated with Brexit and what regulation will look like for the aviation industry is a worry. Will there be additional tariffs and visas to think about. Air passenger duty continues to concern airlines - especially Flybe which has a lot of routes and partnerships with other airlines in mainland Europe.\n3. Cost of fuel and the impact of the dollar\nCar drivers will sympathise with this one. Flybe buys its fuel in dollars and the average market price in US Dollar was up 19.1% at $560.\nCurrency is a changeable beast and policy makers like President Trump can and does affect the price.\n4. Planes are expensive\nCapital investment from the outset is high and Flybe has been reducing the number of plane sit has from a peak of 85 in May last year to ensure that they are running at peak profitability. It needs to make sure that its planes are full to be most efficient. It is also cancelling its unprofitable routes.\nAviation is heavily regulated and the airline spends a lot on maintenance.\nIt has also overhauled its IT and digital systems to make sure that customers can book their flights on their mobile devices.\n5. Flybe is a small company\nFlybe may be one of the region's biggest players but it is small compared to the likes of its competitors Easyjet, Ryanair and BA. It means that the back room costs take up a higher proportion of its outlay. It costs about the same to pay for things like maintenance, HR and online bookings for 200 planes as it would for 80, for example.\nIt carries around eight million passengers a year and Virgin would look to attract customers into its long-haul network via Flybe's domestic routes.\nTrade unions have already raised concerns over the impact of a Flybe's sale on the carrier's 2,300 employees. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-19T12:27:00.000+02:00", "crawled": "2018-12-19T12:36:38.007+02:00", "highlightTitle": ""}