{"organizations": [], "uuid": "d36c0b95663d52c8b9410d34b56b7bfa33b4e121", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15324027.ece/ALTERNATES/s1200/0_TMP_NEC_270718FoodbankCrisis06JPG.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/here-huge-problems-being-ignored-15542600", "country": "GB", "domain_rank": 21960, "title": "Here are the huge problems being ignored as the nation focuses on Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T17:51:00.000+02:00", "replies_count": 0, "uuid": "d36c0b95663d52c8b9410d34b56b7bfa33b4e121"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/here-huge-problems-being-ignored-15542600", "ord_in_thread": 0, "title": "Here are the huge problems being ignored as the nation focuses on Brexit", "locations": [], "entities": {"persons": [{"name": "brexit brexit", "sentiment": "negative"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Here are the huge problems being ignored as the nation focuses on Brexit Brexit overshadows everything else at Westminster while parents are depending on foodbanks to feed their children Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nPeople with disabilities are set to lose their right to free parking because Newcastle City Council needs the money.\nIt’s one of a number of cost-cutting measures set out in the council’s budget plans.\nOther local authorities across the North East and the country as a whole have also been forced to cut services to the bone .\nThe nation’s politicians are focusing on Brexit , and you can understand why.\nBut there are other issues that urgently need addressing and, perhaps, haven’t had the attention they deserve in recent months.\nHere are some examples: Local councils in crisis\nCouncils are planning another round of cuts, as they attempt to cope with rising demand for services as following years of funding cuts.\nNewcastle City Council has opened a consultation into its latest plans, which form the first stage of efforts to save £60 million by 2020. Read More Met Office forecast 'big change' and SNOW for UK weather this weekend\nIf approved by the council next March, the latest round of cuts could result in disabled Blue Badge holders being charged for parking in multi-storeys and off-street car parks, while the Shopmobility service will be reduced to three days a week from the current six.\nThere are also plans to shut the City Library at 5pm three days per week and not open on Sundays, while the Discovery Museum and Laing Art Gallery would no longer open on five Bank Holidays. The Universal Credit scandal\nThere are 34,342 people on Universal Credit in the Northumberland and Tyne and Wear area, the latest Department for Work and Pensions figures show.\nBut a range of experts, including the independent National Audit Office, have warned that the system doesn’t work.\nIt may have had good intentions, but in practice it’s making some people desperately poor.\nWhat’s more, a total of 15,035 sanctions have been imposed in the area since the benefit was introduced.\nAnd these can drive people into severe debt - or leave them homeless. Universal Credit has been blamed for poverty and debt (Image: iStockphoto)\nNewcastle Central MP Chi Onwurah said: “Ever since Universal Credit (UC) piloted Newcastle I have received large numbers of complaints covering almost all aspects of UC , but especially the unfairness and impact of sanctions.\n\"Many sanctions have been cancelled or reduced when challenged by my staff, illustrating the flawed nature of the UC process.\n“Behind each statistic there is a heartbreaking story. Sanctions are imposed on already struggling and often vulnerable residents leading to rent arrears, other debts, and the horrendous necessity of the country’s largest food bank.\n\"UC sanctions also lead to physical and mental health issues imposing a greater burden on the NHS.\n“Over the years there has been no sign of any improvement in UC system despite government claims ‘they are listening’.” Households forced to live in temporary accommodation\nLast year 1,220 households were recognised as being “homeless and in priority need” by local councils in the North East.\nAnd 140 households in the region are in temporary accommodation, according to the latest figures.\nThis is one issue where the problems aren’t as bad in the North East as elsewhere. Homelessness figures are low here, compared to many other parts of the country.\nBut there are still hundreds of homeless households. Thousands of children are being fed by foodbanks West End Food bank (Image: newcastle chronicle)\nFigures from charity the Trussell Trust show that three-day emergency food supplies to people in crisis went to 5,085 households in the North East last December.\nThat includes 1,951 households with children.\nIt expects the numbers to be higher this year. And a third of children are in poverty\nThere are now 610,000 people living in poverty in the North East, new figures reveal.\nAnd that includes 170,000 children.\nIt means 33% of children in the region, a third, are in poverty. Read More Fury as hospital left with extensive flood damage after being repeatedly targeted by thieves\nThe figures were published by think tank the Joseph Rowntree Foundation.\nAnd the figures show that 24% of children in working households are in poverty in the North East, compared to 63% of children in households where nobody works. Violent crime is rising - while police funding has fallen\nViolent crime has risen across the country, and Northumbria Police recorded 38,467 incidents of violent crime in the 12 months up to September 2017 - up 25% compared to the 29,617 incidents recorded a year previously.\nAt the same time, central funding government for police has been cut since 2010. In recent years, the central grant to police has been frozen, although forces have been able to raise money by increasing precepts added to council tax bills. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-12T17:51:00.000+02:00", "crawled": "2018-12-12T18:19:37.004+02:00", "highlightTitle": ""}