{"organizations": [], "uuid": "afe94f54629e48cb52e776077f175b9b0e96c1b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15498117.ece/ALTERNATES/s1200/0_business.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/business-confidence-north-east-lowest-15497873", "country": "GB", "domain_rank": 21960, "title": "Business confidence in North East at lowest level since recession", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-03T14:30:00.000+02:00", "replies_count": 0, "uuid": "afe94f54629e48cb52e776077f175b9b0e96c1b0"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/business-confidence-north-east-lowest-15497873", "ord_in_thread": 0, "title": "Business confidence in North East at lowest level since recession", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "james callaghan", "sentiment": "none"}, {"name": "richard halstead", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "institute of chartered accountants", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business confidence in North East at lowest level since recession Separate reports point to problems in the regional economy, with Brexit a factor in both Share James Callaghan (left) and Richard Halstead (right) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nBusiness confidence levels in the North East are at their lowest level since 2009, with the region recording some of the worst scores in the UK, a new report says.\nThe Business Confidence Monitor from the Institute of Chartered Accountants in England and Wales (ICAEW) reports that businesses in the region are seeing slowing domestic sales, with almost 60% of local companies now operating below capacity.\nBusinesses are also struggling to achieve increases in selling prices, which are rising more slowly than input price inflation and wage costs.\nIn the ICAEW study, the North East’s score of -18.3 for the fourth quarter of 2018 is well below the UK Q4 average of -12.3 and considerably down on the same period of last year, when it stood at -6.5. It is the region’s lowest score since Q2 2009.\nJames Callaghan, the organisation’s regional director for the North, said “Whilst last quarter’s score was only marginally positive, to see confidence levels in the North East so firmly in negative territory – and for the region to be one of the four lowest in the UK overall – is concerning.\n“Whether this is a blip due to pre-Brexit uncertainty, or if it is indicative of a longer-term decline in confidence, remains to be seen.”\nThe confidence monitor is based on interviews with accountants in a range of businesses who together represent companies that make up around 1% of the UK economy.\nIt reports challenges many businesses are facing in terms of recruiting staff at both management and non-management levels, and says that levels of investment in businesses are subdued. Read More See the Prohibition Cabaret Bar team's film celebrating grand moving plans\nElsewhere, a separate report has found that the outlook for North East manufacturers is deteriorating on the back Brexit uncertainty, weaker global growth and the impact of protectionist global trade policies.\nThe survey from manufacturers’ organisation EEF and business advisory firm BDO LLP found output in the region’s firms at its lowest levels since 2016.\nEEF’s survey also pointed to weak domestic demand and said export orders, which have been a big driver for manufacturing in recent years, were flat for the third quarter in a row. Read More See the Prohibition Cabaret Bar team's film celebrating grand moving plans\nRichard Halstead, director of member engagement for EEF in the North, said: “The moderation in manufacturing performance over the course of this year appears to have gathered pace during the final quarter with more clouds on the horizon than there have been for some time.\n“This should come as no surprise given the significant political uncertainty at home which is why it is essential that there is an agreement for the UK’s withdrawal as soon as possible. If everything that can go right does then business and consumer confidence should hopefully gather some steam next year with improved prospects for growth.\n“That’s the backdrop we’re working to, let’s hope it’s the right one.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-03T14:30:00.000+02:00", "crawled": "2018-12-03T17:37:47.012+02:00", "highlightTitle": ""}