{"organizations": [], "uuid": "3e2aafd1ab1ebc4ce477016aea1826902f132f6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15521194.ece/ALTERNATES/s1200/1_may-downing.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-second-referendum-theresa-answers-15521167", "country": "GB", "domain_rank": 21960, "title": "From Brexit to a second referendum: Theresa May answers YOUR questions", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-09T07:00:00.000+02:00", "replies_count": 0, "uuid": "3e2aafd1ab1ebc4ce477016aea1826902f132f6b"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-second-referendum-theresa-answers-15521167", "ord_in_thread": 0, "title": "From Brexit to a second referendum: Theresa May answers YOUR questions", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "macron", "sentiment": "none"}, {"name": "ed hollyman", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PM answers your Brexit questions\nQ) As the country had no idea what exactly they were voting for in the referendum is it not highly hypocritical to suggest MPs may be given a second vote if you lose the first vote, yet you will not allow the British public to vote this time on the terms of Brexit as they now know them?\nEd Hollyman, Cramlington, Northumberland\nA) I don’t think there should be a second referendum. People voted to leave the EU in 2016 and politicians need to respect that vote, and get on with the job.\nIt’s been over two years since the referendum and the overwhelming sense I get when talking to people around the country is that there shouldn’t be any further delays and the government just need to get on with it.\nQ) I would like it pointed out very clearly where it states that it is the decision of the UK only to walk away from the further discussions with the EU, and not requiring the permission or agreement of the EU.\nI would like to see a written reassurance that Macron and other countries cannot hold a gun to the head of the UK and make it impossible for the UK to be able to leave the EU.\nLesley Jones, Durham\nA) Lesley – we are leaving the European Union on March 29th 2019, just as people voted for in Durham and across the UK. We’ve agreed a deal with European leaders about the terms of our departure, which they signed off at the latest European Council.\nI can assure you that there is no question about the United Kingdom being held in the European Union against our will. Prime Minister Theresa May speaks at a press conference after attending a special session of the European Council over Brexit\nQ) My question is simply this, why, after leaving the EU, as an independent country, can we just simply say to the EU “we are quite happy to have an open border in Ireland, free from any customs and travel checks. Surely this will get past the “backstop” that the EU seem determined to enforce?\nAndrew Mills, Holywell Village, Northumberland\nA) The situation on the island of Ireland is unique. Both sides are committed to ensuring that the people and businesses that depend on an open border can continue living their lives as they do now and that the hard-won gains of the peace process in Northern Ireland are protected.\nOf course, as we are leaving the European Union, we are also leaving their customs union and single market. For any other third country this would mean there would need to be checks at any land borders shared with countries in the European Union.\nBoth sides have been clear that this wouldn’t work on the Northern Ireland- Ireland border and instead our future trading relationship with the EU will negate the need for a hard border.\nI’d also remind you that the backstop is no more than an insurance policy, and no-one wants it be to used including the EU. We are confident that our future relationship will be ready by the end of the implementation period. Boris Johnson\nQ) 1. Are you surprised that 30 months after the referendum, yours is the only plan on the table?\nFor all the sniping from people like Boris Johnson, Jacob Rees Mogg, Dominic Raab and David Davis, none of them has published their own blueprint for Brexit which is viable and delivers on the promises they made during the referendum campaign.\n2. From the outside it looks like you are pushed around by a small noisy group of Brexiters. After you leave office, will you publish your memoirs and set the record straight?\nWarwick Anson, Northumberland\nA) 1. It’s nice to hear someone point this out. I do believe that my deal is the only credible plan on the table. It is easy to make suggestions from the side-lines but negotiating day in and day out is a different matter altogether.\nWhat we’ve got on the table now is the very best deal for every part of the UK and it delivers on what people voted for.\nWe won’t be sending vast annual sums of money to the EU anymore, we’ll take back control of our borders and we’ll be able to decide who comes here based on what they can offer the UK.\nThat’s what people voted for and that’s what I’m delivering with this deal.\n2. You won’t be surprised to hear that my focus right now is getting this deal through Parliament and delivering on the referendum result! Read More\nQ) If your deal fails to be approved by parliament you, and the EU, have said that it is the only deal available.\nYou have also both said that the only alternatives are exiting without a deal or no Brexit.\nGiven that there is widespread opposition to exiting without a deal from a vast majority of MPs and businesses, and with analayses showing that this would detrimental to the countries future, isn’t the only real alternative to remain a member of the EU if your deal is not passed?\nJonathan Smalley\nA) We gave the public the choice, they voted to leave the EU and it is now up to politicians to deliver on this.\nI’ve negotiated long and hard to deliver a Brexit deal that’s right for the UK, which protects jobs and the economy.\nThis deal is in the national interest and I’m urging MPs from across the country to back it on Tuesday.\nIf the deal does not pass, the government has 21 days to come back to Parliament to explain our next steps, but the government and Parliament need to deliver on the will of the British people. Read More\nQ) Instead of leaving the EU, and saying the reason is to get control of immigration, why could you not invest in higher security measures and strict processes and still stay in the EU?\nSarah Khan\nA) Thanks for your question, Sarah. I think the first thing to say is that the issue of immigration is only one of many reasons people voted to leave the European Union. Some people voted to take back control of our money and our laws.\nThe fact is that we’re not staying in the EU – we are leaving on March 29th and I think it’s important that MPs deliver on this vote. Like us on Facebook", "external_links": [], "published": "2018-12-09T07:00:00.000+02:00", "crawled": "2018-12-09T07:50:48.179+02:00", "highlightTitle": ""}