{"organizations": [], "uuid": "f376e26fe27b1ac29313af36927fcbb5207d6a09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article593005.ece/ALTERNATES/s1200/1_mental.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/deprived-people-devon-seek-more-2309870", "country": "GB", "title": "Deprived people in Devon seek more access to mental health services", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T23:20:00.000+02:00", "replies_count": 0, "uuid": "f376e26fe27b1ac29313af36927fcbb5207d6a09"}, "author": "Anita Merritt", "url": "https://www.devonlive.com/news/devon-news/deprived-people-devon-seek-more-2309870", "ord_in_thread": 0, "title": "Deprived people in Devon seek more access to mental health services", "locations": [], "entities": {"persons": [], "locations": [{"name": "devon", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "none"}, {"name": "joseph rowntree foundation", "sentiment": "none"}, {"name": "katies schmuecker", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Deprived people in Devon seek more access to mental health services More than 42,000 people in Devon accessed mental health services in 2017/18 Share There are a lack of mental health beds in Devon\nThe most deprived people in Devon are nearly five times as likely to access mental health services as the most affluent.\nNew figures from the NHS have shown a total of 42,410 people in Devon accessed mental health services in 2017/18. Of those, nearly one in every eight were from the most deprived 10 per cent of residents in Devon, amounting to 5,125 people. Read More\nIn comparison, just 1,060 people from the least deprived 10 per cent of the region accessed mental health services, making up just 2.5 per cent of the total.\nThe figures take into account people accessing secondary mental health services, learning disabilities and autism services. Read More Man died jumping from M5 van\nKaties Schmuecker, head of policy and partnerships at the Joseph Rowntree Foundation, said: “We are experiencing a rising tide of poverty across our country. Struggling to make ends meet has a serious impact on every aspect of a person’s life, placing immense strain on themselves and their relationships.\n“It’s unacceptable that over a quarter of the poorest adults in our society experience anxiety or depression. However, we can do something about this.\n“We need concerted action from government, business and employers to loosen the grip of poverty on families by boosting people’s incomes and reducing the costs they have to pay. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n“We need to dramatically increase the supply of low-cost rented homes in our society, ensuring everyone has a decent place they can call home. Ending the benefit freeze would mean, for the first time in years, the incomes of families, in and out of work who rely on social security, keep up with the prices they have to pay.\n“Ultimately, this comes down to the sort of country we want to be. A compassionate and just society would not stand by while more people are locked in poverty.” Read More Half of Devon wants a second vote on Brexit - and most would vote remain\nThe findings in Devon show an even greater discrepancy than the one seen nationally. The NHS spent £11.9 billion on secondary mental health, learning disabilities and autism services in the last financial year - almost £1 billion more than in 2016/17.\nAcross England, over 2.5 million people used these services in 2017/18 - 4.5 per cent of the population. Around 16 per cent of that number were from the most deprived backgrounds in the country, while just 7 per cent were from the least deprived - making those living in poverty more than twice as likely to use these services as the most affluent. Read More Horse rider injured in a hit-and-run, police hunt driver\nMatthew Geer, campaigns manager at UK poverty charity Turn2Us, said: “The links between your financial situation and mental wellbeing are clear. If you are in debt or worrying about putting your next meal on the table and feeding your children, then stress and anxieties are going to be a constant feature of your life.\n“For the millions of people in poverty in the UK the day-to-day struggle to get by will take a toll on their mental health, and many vulnerable people can become trapped in a vicious cycle of poverty and poor mental health\" Read More Hunt continues for two men missing in Devon\n\"The most important way to improve the mental health of people in poverty is simply to get them out of poverty, higher wages and greater welfare support will make significant improvements.\n\"Another key area is to explore ways of giving people with mental health problems more support with their finances. This can include helping people to manage their finances and finding ways to prevent them from making bad decisions when they are feeling unwell.”\nNEW Devon CCG were approached for a comment. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-10T23:20:00.000+02:00", "crawled": "2018-12-10T23:35:26.033+02:00", "highlightTitle": ""}