{"organizations": [], "uuid": "7d162b8f7dfcb363684729b8abc22c29ecff2003", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2155208.ece/ALTERNATES/s1200/4_PicsJPG.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/leicester-news/gary-lineker-accused-jonathan-agnew-2327541", "country": "GB", "domain_rank": 48128, "title": "Gary Lineker accused by Jonathan Agnew of breaching BBC rules with Brexit tweets", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-14T15:50:00.000+02:00", "replies_count": 0, "uuid": "7d162b8f7dfcb363684729b8abc22c29ecff2003"}, "author": "Tom Mack", "url": "https://www.leicestermercury.co.uk/news/leicester-news/gary-lineker-accused-jonathan-agnew-2327541", "ord_in_thread": 0, "title": "Gary Lineker accused by Jonathan Agnew of breaching BBC rules with Brexit tweets", "locations": [], "entities": {"persons": [{"name": "gary lineker", "sentiment": "negative"}, {"name": "jonathan agnew", "sentiment": "negative"}, {"name": "lineker", "sentiment": "none"}, {"name": "jacob rees-mogg", "sentiment": "none"}, {"name": "agnew", "sentiment": "none"}, {"name": "peter shilton", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "scalford", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gary Lineker accused by Jonathan Agnew of breaching BBC rules with Brexit tweets The Leicester football and presenter is not shy about sharing his views Share Gary Lineker says he will not stop tweeting his views Get Daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nGary Lineker has been accused by a fellow Leicestershire sports pundit of breaching BBC rules with his tweets on Brexit.\nCricket commentator Jonathan Agnew, who lives in Scalford, suggested the Leicester-born Match of the Day host could find himself in hot water with the BBC if he kept expressing his political views.\nBut Lineker tweeted back stating he could say what he wanted on his own Twitter feed, having a little dig at Agnew – who voted to remain in Europe - for being pro-Brexit.\nThe disagreement followed on from Lineker’s row earlier in the week with former England goalkeeper Peter Shilton , who commented on the social media site that right-wing Conservative MP Jacob Rees-Mogg “really knows what he is talking about”.\nHis former teammate Lineker, who has never hidden his opposition to Brexit and is a keen campaigner for a people's vote, responded with: “What’s that old saying? You should never see a tweet from your heroes?”\nThat followed an earlier tweet to another former England teammate, Chris Waddle. Waddle’s tweet, which has since been deleted, said Brexit would be best with no deal.\nLineker advised him: “Stick to football.”\nAgnew, who presents the cricket on BBC5 Live, joined in by suggesting Lineker could be breaching the BBC rules by getting so political on Twitter. Mr Jonathan Agnew MBE (Image: PHILIP BROWN)\nIn a message yesterday directed at the former striker, Aggers wrote: “Gary. You are the face of BBC Sport.\n“Please observe BBC editorial guidelines and keep your political views, whatever they are and whatever the subject, to yourself.\n“I’d be sacked if I followed your example. Thanks.”\nIn response to criticism on Twitter he added: “If I tweet/broadcast about politics I’ll be disciplined.\n“Please believe me. I’ve been in post nearly 30 years!!!”\nBut Lineker made it clear he had no intention of toning things down.\nHe tweeted: “Jonathan, I’m the face of my own Twitter account. I’ll continue to tweet what I like and if folk disagree with me then so be it.\n“Thank you so much for your concern, which, I imagine, wouldn’t be a concern at all if you agreed with me.”\nThe BBC has said that since Gary is not involved in political coverage he is free to express his political views on Twitter. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-12-14T15:50:00.000+02:00", "crawled": "2018-12-14T16:23:15.015+02:00", "highlightTitle": ""}