{"organizations": [], "uuid": "c58acfdf96c39fa6dda8bc7886a355642bc325e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15563826.ece/ALTERNATES/s1200/0_Laura-Ashley-store-closures.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/laura-ashley-close-40-stores-15562691", "country": "GB", "domain_rank": 21960, "title": "Laura Ashley to close 40 stores as firm pins growth hopes on Asia", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-17T17:42:00.000+02:00", "replies_count": 0, "uuid": "c58acfdf96c39fa6dda8bc7886a355642bc325e8"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/business/business-news/laura-ashley-close-40-stores-15562691", "ord_in_thread": 0, "title": "Laura Ashley to close 40 stores as firm pins growth hopes on Asia", "locations": [], "entities": {"persons": [{"name": "laura ashley", "sentiment": "negative"}, {"name": "khoo kay peng", "sentiment": "none"}, {"name": "andrew khoo", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "khoo", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Laura Ashley to close 40 stores as firm pins growth hopes on Asia The retailer has five stores in the North East but it is currently not known if they will remain open Share A Laura Ashley store (Image: PA) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nLaura Ashley is to close around 40 stores as the company’s new chairman pushes ahead with a fresh vision for the brand which includes expansion in China.\nAndrew Khoo said he expects to reduce the number of UK stores from 160 to 120, continuing a strategy that has seen 40 retail units close since the beginning of 2015.\nLaura Ashley has five stores in the North East at the Metrocentre in Gateshead, Durham, Morpeth, Darlington, and Stockton. It is not known if any of these stores have been earmarked for closure.\nMr Khoo, who took over as chairman of Laura Ashley’s owner from his father Khoo Kay Peng last week, said: “The direction I want to go is to have not so many stores, but maybe the ones we have could be larger.\n“It’s more about showcasing the brand. It doesn’t really matter if they buy online or offline, we just want them to get inspired.” Laura Ashley girl sitting on yellow scooter (Image: Publicity Picture)\nHe added that the group would look at moving staff from any stores which close to the enlarged shops.\nMeanwhile Laura Ashley will roll out bricks and mortar stores in China once it has built a significant online customer base.\n“We’re moving to Asia in a much bigger way,” said Mr Khoo. Read More Confidence falling with North East SMEs, regional bank says\n“We have a regional office in Singapore, it’s a dedicated office of about 10 people and it’s focused purely on ecommerce into China. Once we get a significant foothold in digital retail in China we can look at the physical stores rollout.”\nBritish retailers have had a difficult year as high street footfall declines and consumer confidence wanes. Last week Sports Direct boss Mike Ashley said November was “unbelievably bad” and warned that many retailers will be unable to take the strain.\nMr Khoo said that Laura Ashley in the UK had seen some promising signs in the run-up to Christmas including an uptick in clothing sales, but it has been slow to shift big-ticket items like furniture.\n“It’s a challenging environment and it could become more challenging,” he said. Read More Meet the North East businesses which have Christmas every day\nBut he remained positive on Laura Ashley’s home market despite the threat of Brexit uncertainty.\n“My long-term view of the UK is I have confidence in the UK and we will continue to invest in the UK. As long as Laura Ashley stays relevant there’s no reason we can’t get over this little speed bump.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-17T17:42:00.000+02:00", "crawled": "2018-12-17T20:13:49.000+02:00", "highlightTitle": ""}