{"organizations": [], "uuid": "b7ea8654d227e40f4e4120fd20aa4acd5594b949", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15325425.ece/ALTERNATES/s1200/1_Autumn-weather-Oct-21st-2018.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-latest-15491262", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-01T11:10:00.000+02:00", "replies_count": 0, "uuid": "b7ea8654d227e40f4e4120fd20aa4acd5594b949"}, "author": "Katie Dickinson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-latest-15491262", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [], "locations": [{"name": "edinburgh", "sentiment": "none"}, {"name": "glasgow central", "sentiment": "none"}, {"name": "doncaster", "sentiment": "none"}, {"name": "south gosforth", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "birmingham new street", "sentiment": "none"}, {"name": "manchester airport", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "doncaster / london kings cross / york / newark north gate", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "southampton central london north eastern railway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Four vehicle crash on A1\nThere’s been a crash near Gateshead BREXIT Japan PM's appeal to May\nJapan’s prime minister has issued an appeal to Theresa May to prevent a no-deal Brexit.\nShinzo Abe’s plea, delivered as the pair met at the G20 summit in Argentina, follows warnings from Japanese companies with operations in the UK of the additional costs and bureaucracy they would face if Britain withdraws from the EU without a deal.\nHonda has warned a no-deal Brexit would cost it tens of millions of pounds in additional tariffs and would damage the competitiveness of its Swindon plant. And Nissan, which employs 7,000 at Britain’s biggest car factory in Sunderland, has said that a sudden change to World Trade Organisation rules would have “serious implications for British industry”. The entrance to Nissan's plant at Washington (Image: nissan)\nCar manufacturers are particularly exposed to any disruption to trade because of their “just-in-time” supply chains constantly moving parts around Europe. Speaking ahead of bilateral talks on the margin of the G20 summit in Buenos Aires, Mr Abe told Mrs May: “I would like to take this opportunity to express my tribute to your leadership in realising the Withdrawal Agreement as well as the EU’s agreement on the Political Declaration.\n“Also I would like to once again ask for your support to avoid no deal, as well as to ensure transparency, predictability as well as legal stability in the Brexit process.” 14:41 Crash update\nTraffic is still slow after an earlier accident on the A194(M) Northbound at J2 A195 New Road (Follingsby Roundabout).The main carriageway was closed until around 2.40pm. Until then, all traffic had to divert via the entry and exit slip roads. UK news WWII veteran dies after robbery\nA Second World War veteran who was seriously injured in a violent robbery in his home has died.\nPeter Gouldstone had been left badly hurt following the attack in north London last month.\nThe 98-year-old, who suffered severe injuries including two bleeds to the brain and extensive bruising on his body, died in hospital in the early hours of Friday.\nNo arrests have been made, but Scotland Yard said “a number of active enquiries are in hand”.\nA 26in Panasonic TV and other personal possessions belonging to Mr Gouldstone were stolen from the house in Enfield during the robbery on November 6. 14:35\nA reminder about work on the line tomorrow: WEATHER Tonight's forecast\nMore rain on the way, according to the Met Office\nCloudy at first with perhaps some patchy light rain, before outbreaks of sometimes heavy rain arrive overnight. The lowest temperatures will be at first, then becoming slightly milder overnight. Minimum temperature 4 °C. 14:06 Leam Lane crash\nOne lane is closed due to an accident on the A194(M) Northbound at J2 A195 New Road (Follingsby Roundabout). 14:01 Burglar and pub meal cheat's iPhone theft was a 'blip'\nA burglar who invaded his mum’s home, treated his mates to a pub lunch without paying and stole his girlfriend’s iPhone has been given another chance by the courts.\nJames Fowler, 37, from Middlesbrough , now has an opportunity to prove himself after a hopeful probation report which agreed his latest crime was a “blip”.\nThe recovering drug addict was given a suspended prison sentence in January for burgling his mum’s home stealing money, jewellery and spirits in October last year. Teesside Crown Court, Middlesbrough, Teesside (Image: Evening Gazette)\nThen he went to a Northallerton pub with three friends, had a meal worth more than £90 then made off in his car when his card was declined in May.\nFor this fraud , the period of his suspended sentence was extended from 18 months to two years in July. 13:38 Weather delays opening of Baltic Square winter village\nThe opening of Gateshead ’s brand new winter village has been delayed due to bad weather.\nThe attraction on the banks of the Tyne was due to officially open at Baltic Square on Saturday, December 1.\nBut organisers have confirmed that the opening of the Quayside market has been delayed until Sunday as bad weather has affected the Teepee bar. Rain falls at Gateshead's winter village at the Baltic on Saturday, December 1 (Image: ncjMedia)\nJonathan Corbett said the wind had caused damage to the teepee overnight, meaning it was unable to open for safety reasons.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15491262;", "http://ojp.nationalrail.co.uk/service/planjourney/search", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-01T11:10:00.000+02:00", "crawled": "2018-12-01T12:38:11.000+02:00", "highlightTitle": ""}