{"organizations": [], "uuid": "f1219d210a71bfda3309bac54d7f56b11680d3ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14960356.ece/ALTERNATES/s1200/0_School-exclusion-systems.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/bad-behaviour-classroom-grinds-teachers-15564672", "country": "GB", "domain_rank": 21960, "title": "Bad behaviour in the classroom 'grinds teachers down'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-18T10:00:00.000+02:00", "replies_count": 0, "uuid": "f1219d210a71bfda3309bac54d7f56b11680d3ec"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/bad-behaviour-classroom-grinds-teachers-15564672", "ord_in_thread": 0, "title": "Bad behaviour in the classroom 'grinds teachers down'", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "halifax", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "invalid email newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bad behaviour in the classroom 'grinds teachers down' Newcastle teachers have spoken about the challenges they face in the classroom Share Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nNewcastle teachers say lessons are being disrupted by badly-behaved pupils and most of them know a colleague who has “left the teaching profession because of bad behaviour”.\nThis is the finding of a study by think tank Policy Exchange, which found three-quarters of teachers frequently have to deal with disruptive behaviour in school.\nOne Newcastle teacher said: “It just grinds you down. You feel the energy zapping.”\nThe think tank conducted interviews with teachers, parents and pupils in Newcastle, Halifax and London.\nIt found there was growing support for the idea of “zero tolerance” policies, in which pupils receive strict punishments for breaking any school rule.\nDescribing the impact it had on the classroom, one Newcastle teacher said: “Our workplace has improved because we’ve got a new Head Teacher who has zero tolerance on it [disruption].”\nHowever, zero tolerance policies were occasionally thought to lead to silly or overzealous outcomes – for example, one-hour detentions for not having the right pen or sharpening a pencil into the wrong bin. Read More Here are the huge problems being ignored as the nation focuses on Brexit\nTeachers also reported that social media meant they were having to deal with arguments between pupils and bullying that took place outside school hours.\nA Newcastle teacher said: “Social media has made that (bullying) a whole different world … I think that’s changed the whole dynamic of how bullying happens.\n“I’m picking up on issues that that have got nothing to do with what happened in lessons; it’s actually outside of school via a tweet or Facebook.\n“Then they come together in that lesson.”\nMore than half of teachers asked said they believed the quality of children’s education was affected by disrupted lessons, and 45% said they did not feel their initial training had prepared them to manage pupil behaviour.\nReport author Dr Joanna Williams said higher standards of behaviour should be required for schools to achieve good or better Ofsted ratings and that staff should have refreshers in behaviour management policies. Read More Here's why bus passenger numbers are falling in the North East\nThe report said: “In order for pupil behaviour to improve further, what is needed now are not more government directives from the Department for Education but for more diligent and consistent enforcement of existing school behaviour policies.\n“We need a cultural shift where high standards of behaviour are assumed to be the norm and, for teachers, discussing behaviour management is considered a professional responsibility rather than a source of failure.\n“Our research shows that parents, pupils and teachers all want a school environment in which all pupils are expected to behave, are challenged and sanctioned when they do not.”\nIt also recommended schools have a clear policy that either bans mobile phones, which it said can contribute to low level disruption, or restricts their use to certain times in the school day.\nEducation Secretary Damian Hinds said: “Poor behaviour disrupts both learning and teaching, often most keenly affecting disadvantaged young people. Read More Brexiteer MP sets out how Theresa May CAN win support for a Brexit deal\n“Since 2010 we have taken decisive action to empower teachers to tackle poor behaviour, and many schools are already leading the way in tackling persistent disruption.\n“As these important findings from Policy Exchange show, we now need all schools to follow the lead of the best-performing so that we can build on the rising standards in our schools.\n“To help school leaders make that happen, we have pledged £10 million for schools to share best practice on behaviour management so that teachers can focus on the most important task - teaching.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-18T10:00:00.000+02:00", "crawled": "2018-12-18T10:18:59.042+02:00", "highlightTitle": ""}