{"organizations": [], "uuid": "33b1d7439dc334880c1ea7ec165b35a5aee0c97c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14746025.ece/ALTERNATES/s1200/Rail-timetable-changes.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/transport-bosses-meet-learn-what-15498729", "country": "GB", "domain_rank": 21960, "title": "Transport bosses meet to learn what the Government has planned for the North", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-03T18:00:00.000+02:00", "replies_count": 0, "uuid": "33b1d7439dc334880c1ea7ec165b35a5aee0c97c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/transport-bosses-meet-learn-what-15498729", "ord_in_thread": 0, "title": "Transport bosses meet to learn what the Government has planned for the North", "locations": [], "entities": {"persons": [{"name": "chris grayling", "sentiment": "none"}], "locations": [{"name": "newcastle central station", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "north transport", "sentiment": "neutral"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "newcastle council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Transport bosses meet to learn what the Government has planned for the North Transport for the North and Newcastle Council to hear from the Department for Transport at northern summit Share Passengers and a Northern train at Newcastle Central Station (Image: PA) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe North\n’s transport bosses are to learn more about the Government’s plans for the region at a high-powered summit in Manchester.\nOfficials from the Department for Transport will talk about the Government’s priorities for transport infrastructure in the North of England.\nThose attending include officials from Newcastle City Council and from Transport for the North (TfN), the transport authority that is working on plans for a new “Northern Powerhouse” rail network.\nTfN received funding of £37 million to help develop the proposals in the October Budget.\nAnd it is to present a business case to Transport Secretary Chris Grayling before Christmas.\nNorthern Powerhouse rail will be a new rail line running North East to North West across the Pennines. It is also expected to improve services to Newcastle and other North East cities and towns, although this may be by improving existing track. Read More North tells Government: Back us and we'll make a success out of Brexit\nTfN has said better links between the big cities of the North would allow more than 100,000 businesses to get to the North East in less than 90 minutes, as well as making it easier for people to commute between those cities.\nOfficials from Network Rail, which oversees rail infrastructure, and Highways England, which is responsible for major roads, will also attend the summit.\nTfN launched a smartcard project in November, working in partnership with Northern and TransPennine Express.\nThe Smart on Rail project is a first step towards delivering an integrated smart travel system for the whole of the North of England, according to TfN.\nThe initial phase will be run on rail lines between Hull, Scarborough and Malton, before being rolled-out across the network.\nIt’s hoped that passengers will eventually be able to travel across the whole of the North of England using just their smart phone or watch as a ticket. Read More\nBus, rail and tram services will all be included. Rather than facing an array of complex ticketing options, commuters will be guaranteed to pay the lowest price possible for the journey they make.\nThe roll out of the “smart travel programme” takes place in three phases.\nFrom December this year, smart cards provided by transport operators will be available for rail passengers to use instead of season tickets.\nThe second phase involves providing information about bus and rail times and fares on apps.\nThe third and most ambitious phase will see the entire public transport network in the North included in an integrated ticketing system.\nWhile smart cards are likely to be available for passengers, they will also have the option of using a bank card, their phone or a smart watch to make journeys.\nThe card or smart device will be tapped against devices at platforms or bus stops to register that a journey has been made. Read More George Osborne urges Government to give the North control of its rail services\nSpeaking to Chronicle Live earlier this year, Peter Molyneux, of Transport for the North, said: “It will work whether you are just getting the bus in Gateshead, or whether you want to go from Liverpool to Northumberland or whether you want to get the Metro in Newcastle.”\nTransport for the North has been publicising its plans at Labour’s conference, where it has a stand in an exhibition hall frequented by politicians and delegates, and has sent senior managers to speak at fringe events. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-03T18:00:00.000+02:00", "crawled": "2018-12-04T00:54:24.005+02:00", "highlightTitle": ""}