{"organizations": [], "uuid": "47855ffbd92fb3c6517919dc5e61a49cadaa9733", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13638475.ece/ALTERNATES/s1200/ECP_NEC_210514weather_04JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/powered-people-campaign-launched-promote-15552092", "country": "GB", "domain_rank": 21960, "title": "Powered by People campaign launched to promote County Durham", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-14T15:53:00.000+02:00", "replies_count": 0, "uuid": "47855ffbd92fb3c6517919dc5e61a49cadaa9733"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/powered-people-campaign-launched-promote-15552092", "ord_in_thread": 0, "title": "Powered by People campaign launched to promote County Durham", "locations": [], "entities": {"persons": [{"name": "coun simon henig", "sentiment": "none"}, {"name": "durh", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "durham city", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "county durham businesses", "sentiment": "negative"}, {"name": "county durham business powered", "sentiment": "negative"}, {"name": "dyer engineering", "sentiment": "none"}, {"name": "banks group", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "aykley heads", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Powered by People campaign launched to promote County Durham Businesses and public bodies have made films on how the county is a great place to live and work Share Durham Cathedral (Image: Newcastle Chronicle) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA campaign to promote County Durham as one of the country’s best places in which to live and work has been launched by a group of businesses and public bodies.\nThe Powered by People initiative aims to showcase the county’s strengths and has had input from businesses including Hitachi, PolyPhotonix, Banks Group and Dyer Engineering.\nThe campaign has come at a time of new developments around Durham City, with major construction projects on either side of the river in the city centre and plans to turn Durham County Council’s HQ at Aykley Heads into a major hi-tech business park.\nDurham’s excellent transport links, with the east coast mainline and easy access to the A1 and A19, are also highlighted in the campaign, as well as a global Top 100 university and lifestyle factors such as Durham’s coastline and its world heritage site. Coun Simon Henig, Durham County Council, leader (Image: Copyright Unknown)\nThe campaign was launched at Durham’s Salvus House with the unveiling of two promotional videos that aim to showcase the county’s strengths to a national and international audience.\nDurham County Council leader Simon Henig said: “This initiative has come from a conversation we’ve been having with businesses on how we need ways to showcase the county and everything that’s going on.\n“We know that Durham is a great place to do business but we need something to present to the region and beyond. We need to amplify all that positivity about what a fantastic place Durham is to do business.”\nCoun Henig and other speakers at the launch event spoke of the need to maintain the promotion of County Durham while uncertainty around Brexit threatened to hit the economy. The Invest in the North East campaign (Image: Newcastle Chronicle)\nAllan Cook, managing director of Arlington Real Estate, which has developed the DurhamGate scheme near Spennymoor, was one of the speakers at the launch.\nHe said: “We’re in the middle of one of the most divisive things that’s happened in this country for the last 50 years.\n“We can’t do anything about that but having an initiative like this, with a strapline that’s so fitting, can really bring the whole community of Durham together.” Read More Confidence falling with North East SMEs, regional bank says\nAn event for 300 businesses will be held in Durham on January 31 at which they will be asked to spread the message of the Powered by People campaign with a toolkit of online and social media material.\nThe county is also taking an eight-page supplement in a national newspaper at the end of December to promote its assets, as well as a poster campaign at King’s Cross, York and Edinburgh Waverley train stations. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-14T15:53:00.000+02:00", "crawled": "2018-12-14T19:28:37.009+02:00", "highlightTitle": ""}