{"organizations": [], "uuid": "f23fda33e3918c6669356244699b0bf59f66ec82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2311869.ece/ALTERNATES/s1200/0_Government-Prepares-For-Meaningful-Vote-On-Brexit.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/leicester-news/what-could-happen-next-after-2311862", "country": "GB", "domain_rank": 48128, "title": "This is what could happen next after Theresa May pulled Brexit vote", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T16:28:00.000+02:00", "replies_count": 0, "uuid": "f23fda33e3918c6669356244699b0bf59f66ec82"}, "author": "Sam Dimmer", "url": "https://www.leicestermercury.co.uk/news/leicester-news/what-could-happen-next-after-2311862", "ord_in_thread": 0, "title": "This is what could happen next after Theresa May pulled Brexit vote", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "westminster", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This is what could happen next after Theresa May pulled Brexit vote There could be big changes in the next few days Share Sam Dimmer Digital Development Editor 14:28, 10 DEC 2018 Prime Minister Theresa May arrives in Downing Street earlier today (Image: Getty Images) Get Daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA statement is expected later today as it's reported Theresa May is going to shelve a key vote on Brexit.\nA Government source confirmed that the vote was being pulled, with the Prime Minister due to inform the House of Commons in an oral statement at 3.30pm.\nNews that the crucial \"meaningful vote\" was being postponed broke just moments after a Downing Street spokeswoman told Westminster reporters at a regular daily briefing that it would go ahead.\nThe pound fell sharply in response, shedding 0.5% versus the US dollar to stand at 1.26. Against the Euro, the pound was 0.8% down at 1.10.\nIt's being speculated the move is being made to give Mrs May time to seek further concessions from Brussels.\nNumerous backbenchers have come out to suggest they intend to vote against the deal.\nLabour leader Jeremy Corbyn said the UK no longer had a \"functioning Government\" and called on the PM to switch to his party's plans for a \"jobs-first deal\".\nNow the vote appears to be off the table, for now, we've had a look at what could happen in the next few days. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now A better deal?\nMrs May could have shelved the vote to return to EU negotiators and look for a better deal.\nThe reaction to the proposal should leave them in little doubt that getting this deal over the line is going to be a tall order.\nSo maybe the threat of no deal will enable Mrs May to get a better deal and win over key Brexiteers.\nIf that's the case the vote will return to parliament and be approved. Push ahead with the vote\nAt the moment at least 90 MPs say they'll vote the current deal down, so if no new concessions can be obtained it looks likely that will happen.\nIf that does happen everything is up in the air. The Brexit deal , the future of Mrs May and the future of the Conservative government could all be in jeopardy.\nLabour MP David Lammy, a supporter of the Best for Britain campaign for a second referendum, said: \"This is an unprecedented and historic humiliation for Theresa May.\n\"This is recognition of what has been clear for months: there is no majority for her miserable Brexit deal in Parliament.\" Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-12-10T16:28:00.000+02:00", "crawled": "2018-12-10T16:38:46.000+02:00", "highlightTitle": ""}