{"organizations": [], "uuid": "7c155d040b7e9224c565a513db6a294fbb21da84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article2289854.ece/ALTERNATES/s1200/0_GripHero_Oli-Yeo.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-invention-being-used-hundreds-2289761", "country": "US", "title": "This Devon invention is being used on hundreds of petrol forecourts", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-04T17:41:00.000+02:00", "replies_count": 0, "uuid": "7c155d040b7e9224c565a513db6a294fbb21da84"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/devon-invention-being-used-hundreds-2289761", "ord_in_thread": 0, "title": "This Devon invention is being used on hundreds of petrol forecourts", "locations": [], "entities": {"persons": [{"name": "oli yeo", "sentiment": "none"}, {"name": "share oli yeo", "sentiment": "none"}, {"name": "griphero", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "devon a devon", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This Devon invention is being used on hundreds of petrol forecourts The device protects users from fuel spills and germs Share Oli Yeo with GripHero - made in Devon\nA Devon made gadget to cut down on plastic waste when filling up is set to be rolled out across 500 petrol forecourts in the UK and beyond.\nInventor Oli Yeo launched the GripHero in October.\nIt's a device that fits onto the fuel nozzle and dispenses plastic gloves to protect users from fuel spills and germs.\nIt's already in 250 forecourts in the UK and Ireland, a figure set to be doubled by the end of the year with a number of major overseas contracts under negotiation, which could see GripHero introduced to forecourts in mainland Europe and the Middle East.\nGripHero is also releasing brightly coloured plastic recycling bins to help complete the recycling circle. The GripHero hand cover that means drivers keep clean and are more likely to buy drinks and snacks before driving off\nGripHero aims to reduce plastic waste by dispensing only one item of hand-protection at a time - rather than the clumps of gloves commonly withdrawn from conventional dispensers.\nOli Yeo, designer and MD of GripHero, said: “As more people use hand-protection to avoid foul-smelling, fuel contaminated hands and the cross-contamination of viruses such as the flu from fuel pump handles, it is more important than ever to recycle waste on the forecourt.\" Read More This is the reality for Devon’s 27,000 Europeans living in Brexit limbo\nIn addition to independent forecourts, GripHero is being installed on franchised forecourts featuring major brands including Texaco, Esso, Murco, BP and Gulf.\nUnlike other forms of hand-protection, GripHero ensures that only one item is dispensed at a time, putting an end to wasteful clumps of gloves that often come out when customers attempt to retrieve conventional hand-protection – resulting in a lack of gloves for other customers, and unnecessary levels of plastic waste. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-04T17:41:00.000+02:00", "crawled": "2018-12-04T18:02:13.015+02:00", "highlightTitle": ""}