{"organizations": [], "uuid": "c53b57418f1a398332f347aad874402ad41e8077", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14506595.ece/ALTERNATES/s1200/IBP_NEC_230318tuc_brexit_05JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/mps-must-vote-against-prime-15525691", "country": "GB", "domain_rank": 21960, "title": "MPS must vote against Prime Minister's 'blindfold Brexit' deal, says TUC", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T07:00:00.000+02:00", "replies_count": 0, "uuid": "c53b57418f1a398332f347aad874402ad41e8077"}, "author": "Beth Farhat", "url": "https://www.chroniclelive.co.uk/business/business-news/mps-must-vote-against-prime-15525691", "ord_in_thread": 0, "title": "MPS must vote against Prime Minister's 'blindfold Brexit' deal, says TUC", "locations": [], "entities": {"persons": [{"name": "beth farhat", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}], "organizations": [{"name": "tuc business", "sentiment": "negative"}, {"name": "tuc", "sentiment": "negative"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business opinion MPS must vote against Prime Minister's 'blindfold Brexit' deal, says TUC The country needs time to find a real alternative, says Beth Farhat, regional secretary for the TUC Share Beth Farhat, regional secretary of the TUC (Image: Newcastle Chronicle) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nAnother week of chaos ahead in politics.\nIf the Prime Minister fails to secure Parliament’s approval of the deal on December 11, she must within 21 days make a statement to Parliament explaining what steps the government will take next.\nThe Government would then be required to give Parliament the opportunity to debate a motion on the statement in neutral terms.\nThe deal comprises of two parts.\nThe first part is the Withdrawal Agreement (which sets out provisions for a transition period, financial payments, citizen’s rights, and makes backstop provisions for Northern 2 Ireland).\nThe second is the political declaration on the future relationship. If Parliament votes in favour of the deal, it will lead to the first part being ratified as a treaty between the UK and the EU. The second part is designed to inform future negotiations on a trade deal, but it would not be legally binding and a future government could depart from the approach it outlines.\nTrade unions cannot support a Brexit deal that does not protect rights at work, jobs, and peace in Northern Ireland.\nHaving spent two years trapped by her own red lines and internal party politics, the Prime Minister is now trying to force the country into a blindfold Brexit that offers working people none of the guarantees they need. The political declaration on the future relationship is not only weak on protecting jobs and rights, but it’s not even legally binding.\nThis means working people have no way of knowing what the UK’s future relationship with the EU will really look like and how it will impact on their lives.\nThe only thing that seems certain is that this Brexit deal will make the country poorer – as shown by the government’s own forecasts published last week.\nThe Prime Minister has threatened that unless her deal is accepted by Parliament the UK will leave the EU with no deal. It is unacceptable for a Prime Minister to seek to hold Parliament to ransom in this way, attempting to coerce MPs into supporting a deal that they know will hurt their constituents.\nThe deal currently before Parliament does not offer working people the guarantees they need on rights at work, jobs and peace in Northern Ireland.\nTUC calls on MPs to vote against the Prime Minister’s deal on the grounds that it doesn’t deliver for the working people they represent.\nTo protect against no deal and to allow for an appropriate alternative to be found.\nIf this deal cannot command the support of Parliament, the country needs time to find a real alternative. Asking the EU to agree to an extension of Article 50 would be an important first step in this process. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-10T07:00:00.000+02:00", "crawled": "2018-12-10T07:18:02.019+02:00", "highlightTitle": ""}