{"organizations": [], "uuid": "2034fc2b2bae45532e6ee6f0a6885794afd2d043", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15572930.ece/ALTERNATES/s1200/0_Landmarks-lit-for-125th-anniversary-of-NUFC.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/champagne-bar-pulls-newcastle-central-15572865", "country": "GB", "domain_rank": 21960, "title": "Champagne bar pulls into Newcastle Central Station to serve bubbles and real ale", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T15:58:00.000+02:00", "replies_count": 0, "uuid": "2034fc2b2bae45532e6ee6f0a6885794afd2d043"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/champagne-bar-pulls-newcastle-central-15572865", "ord_in_thread": 0, "title": "Champagne bar pulls into Newcastle Central Station to serve bubbles and real ale", "locations": [], "entities": {"persons": [], "locations": [{"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle central station", "sentiment": "neutral"}, {"name": "yolo", "sentiment": "none"}, {"name": "stack newcastle", "sentiment": "none"}, {"name": "yolo townhouse", "sentiment": "none"}, {"name": "danieli holdings", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Champagne bar pulls into Newcastle Central Station to serve bubbles and real ale The team behind Stack Newcastle and YOLO has secured approval for it new plan for the station's glazed entrance Share Central Station in Newcastle (Image: Newcastle Chronicle)\nA champagne bar and real ale retreat will soon be pulling into Newcastle Central Station following a successful planning application.\nThe leisure team behind Stack Newcastle, Yolo Townhouse and the Muddler will launch its latest venue inside the glazed entrance to the Grade 1 listed station, bringing to life retail pods which have lain empty for some time.\nDanieli Holdings initially proposed taking on half of the entrance hall, producing sketches to show how it could potentially be transformed into a welcoming haven for locals, commuters and tourists, serving drinks and small plates of food.\nThose plans were knocked back, however, when conservationists raised concerns that the scheme would detract from the look of the Grade I listed porte-cochere.\nDanieli Holdings, which also runs care and security businesses, changed the proposals to make use of just two vacant retail pods based on one side of the portico area. Read More New health clinic in Newcastle offers 100 free places to weight loss classes\nThe scheme had been knocked back on the grounds that it “would distract and detract from the way in which the port cochère is experienced resulting in harm to the special interest of the Grade I Listed Building”, but following the approval of a Lawful Development Certificate, the firm submitted an application for listed building consent to take the scheme forward.\nThe design documents said: “The building will be entirely unchanged. The proposals seek to enhance the quality of the porte-cochere by introducing high quality restaurant space and adapting the existing retail pods. The design and use of the new platform for food and drink will enhance the customer experience of the station.”\nNow approval has been granted, with Historic England concluding the bar plan would have a “neutral impact on the significance” of the station. Read More Dozens of North East businesses call for People's Vote on Brexit\nIn a report in which planning permission is conditionally granted, the council’s planning department said: “In this case, the activation of the pods – which were designed to facilitate commercial activity within the port-cochere and have been vacant for a considerable amount of time – through cafe/restaurant use will add vitality to this key arrival space within the city and thus equalise the impacts of adapting the retail pods.”\nThere are, however, six conditions which Danieli Holdings will have to meet before pressing ahead, including submitting large scale details of all plans and works to install flooring, fixed seating, wall finishes, bar counters and shutters, as well as details for all plumbling, electrical and heating services. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-19T15:58:00.000+02:00", "crawled": "2018-12-19T20:37:35.015+02:00", "highlightTitle": ""}