{"organizations": [], "uuid": "93398a9c3b2650a3b4f7dad4de7a2c4b6a811d54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1754900.ece/ALTERNATES/s1200/BMEpL63O.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/withdrawal-agreement-not-vision-many-2310255", "country": "GB", "title": "Withdrawal Agreement is not the vision many hoped for and I cannot support it", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T12:53:00.000+02:00", "replies_count": 0, "uuid": "93398a9c3b2650a3b4f7dad4de7a2c4b6a811d54"}, "author": "Neil Parish", "url": "https://www.devonlive.com/news/news-opinion/withdrawal-agreement-not-vision-many-2310255", "ord_in_thread": 0, "title": "Withdrawal Agreement is not the vision many hoped for and I cannot support it", "locations": [], "entities": {"persons": [{"name": "neil pari", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Withdrawal Agreement is not the vision many hoped for and I cannot support it Neil Parish MP says his preference is to vote for a deal to ensure a smooth and orderly exit, but the current deal needs work and he cannot support the Withdrawal Agreement Share Click to play Tap to play The video will start in 8 Cancel Play now\nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010\nAs the date of the ‘meaningful vote’ approaches on the Prime Minister’s EU Withdrawal Agreement – I have been inundated with correspondence from constituents who want to share their view. And rightly so.\nThe December 11 vote and decisions taken in the coming weeks are critical to the direction of the country. As someone who campaigned and voted to give the people a say in a referendum, I firmly believe we need to get on and deliver the result. Neil Parish MP\nThe Prime Minister’s 585 page deal is an important step in carrying out Brexit. If passed, it will govern our relationship with the EU from 11pm on March 29 2019. The deal can protect citizens’ rights, give businesses certainty, ensure frictionless trade, no hard border in Northern Ireland, co-operation on security – and provide an agreed process moving forward.\nThere is much that I like in the Withdrawal Agreement and my preference is to vote for a deal to ensure a smooth and orderly exit. But as I have explained to the Prime Minister, the current deal needs work, or it will not pass in the Commons. Vital issues remain on the Northern Ireland 'backstop' and leverage for getting a good future trade deal. Until these are resolved, I cannot support the Withdrawal Agreement.\nAt Prime Minister’s Questions, I raised the specific issue of the £39 billion ‘divorce bill’. It is a crucial part of the leverage we hold to get a good future trade agreement with the EU. Yes, some obligations are owed. But ongoing commitments to the EU budget, the application of EU law without our say, the inability to diverge - or leave this arrangement unilaterally, stack up to give the EU little incentive to quickly agree a looser free trade deal. We are locking ourselves in, and kicking an expensive can down the road. Neil Parish MP\nAll of this makes the Northern Ireland ‘backstop’ more likely by December 2020. Although it would mean no more EU budget contributions after that date, it does result in a UK-wide customs union, with special rules applied to Northern Ireland indefinitely. Under the ‘backstop’, EU law would apply extensively, underpinned by the European Court of Justice. This is not the vision many hoped for.\nIndeed, as a Conservative and Unionist MP, I see applying different rules and regulations to Northern Ireland indefinitely as a clear threat to the sovereignty and integrity of the United Kingdom. MPs should not be asked to sign away our precious Union. The backstop must be reworked.\nThe Prime Minister has a tough job, but I believe she can get a deal over the line. We need to sort out some key issues with European leaders and the Commission, or we will plainly lose all the benefits that a negotiated settlement can provide. In the weeks ahead, we need to regain focus on a long-term vision for the whole of the United Kingdom and attain the leverage necessary to get there. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-10T12:53:00.000+02:00", "crawled": "2018-12-10T13:00:33.022+02:00", "highlightTitle": ""}