{"organizations": [], "uuid": "b46a176093e6ddb04879946e2fd9967c47333928", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2303370.ece/ALTERNATES/s1200/0_0.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/council-votes-not-discuss-motion-2303367", "country": "GB", "title": "Council votes not to discuss motion calling for a People's Vote on Brexit deal", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-07T15:55:00.000+02:00", "replies_count": 0, "uuid": "b46a176093e6ddb04879946e2fd9967c47333928"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/council-votes-not-discuss-motion-2303367", "ord_in_thread": 0, "title": "Council votes not to discuss motion calling for a People's Vote on Brexit deal", "locations": [], "entities": {"persons": [{"name": "cllr martin shaw", "sentiment": "none"}, {"name": "cllr shaw", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "daniel clark", "sentiment": "none"}], "locations": [{"name": "county hall", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "news council", "sentiment": "none"}, {"name": "dec", "sentiment": "none"}, {"name": "people’s vote", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Council votes not to discuss motion calling for a People's Vote on Brexit deal Instead, the motion was referred to cabinet to discuss at a later date before coming back to full council in February Share Daniel Clark Local Democracy Reporter 13:55, 7 DEC 2018 Click to play Tap to play The video will start in 8 Cancel Play now\nCouncillors voted not to discuss a motion calling for Devon County Council to support a People’s Vote over Brexit at Thursday’s full council meeting.\nThe motion of Cllr Martin Shaw said that in the light of polling evidence which suggests that a majority of Devon voters and Devon districts now oppose Brexit, Devon County Council calls on the Government to organise a referendum on the deal.\nBut the Conservative-led authority instead chose to refer the motion to its Cabinet, who would then make a recommendation back to full council, as per the usual procedure of notice of motions. People's Vote campaigners outside County Hall (Image: Daniel Clark)\nThis came despite Cllr Shaw arguing the motion should be discussed at the meeting in light of its urgency given Parliament will vote on the negotiated deal next week and that the next full council meeting is on February 21, 2019. Read More Barden factory closure: Warning more...\nLabour, Liberal Democrat and Independent Group members all voted for the council to discuss the motion today, but the ruling Conservative en-masse voted for it to be referred to the Cabinet. Calls for a recorded vote were also lost in the same way. People's Vote campaigners outside County Hall (Image: Daniel Clark)\nCllr Shaw, calling for the motion to be discussed today, said: “It is self-evident that there is a matter of urgency in discussing this today due to when Parliament makes its very important decision. The motion may well be redundant by the time the cabinet meets in January and full council in February. Read More People’s Vote is the only way out of Brexit gridlock Parliament is facing\n“I am affronted by the idea that the council might not get the chance to discuss this motion in a timely fashion. We would be saying however damaged and badly affected we would be by the process of Brexit, or if we crash out without a deal or sign up to a deal that both the Brexit and Remain camps think is a bad deal, it will be on record that the council did not discuss the deal and they did not want the people to have the chance to vote on it.” People's Vote campaigners outside County Hall (Image: Daniel Clark)\nDevon For Europe supporters had congregated outside County Hall prior to the meeting to show their support for the motion and to call for a People’s Vote. Read More Watch councillors walk out of council chamber when Brian Greenslade speaks as they are 'offended by his presence'\nCllr Emma Brennan, who was wearing a Devon For Europe T-shirt during the meeting, shouted ‘shame on you’ when the vote to discuss the motion during Thursday’s meeting was lost.\nThe motion calling for a People’s Vote was then unanimously approved by the full council to be referred to cabinet and then back to full council with a recommendation for February’s meeting. Climate change protesters outside County Hall (Image: Daniel Clark)\nA motion calling for the council to declare a climate emergency, pledge to make the county of Devon carbon neutral by 2030, and to report back to full council within six months with the actions being taken to address this emergency, was also referred to the cabinet rather than being discussed at Thursday’s meeting, despite the proposer of the motion, Cllr Jacqi Hodgson, asking for it to be debated on the day. Like us on Facebook", "external_links": ["https://www.plymouthherald.co.uk/news/business/barden-factory-closure-warning-more-2189263", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-07T15:55:00.000+02:00", "crawled": "2018-12-07T16:29:39.013+02:00", "highlightTitle": ""}